[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Leyla McCalla: Tiny Desk Concert", "description": "Ann Powers | October 20, 2022\n“How much does a memory weigh?” Leyla McCalla sings halfway through her Tiny Desk performance in a voice that feels like it’s floating in water – swimming, drowning, escaping, returning home – as it intertwines with the seaweed lines of Nahum Zdybel’s guitar. That question, from her ballad “Memory Song,” is central to the music she and her band offer in this sparkling, thoughtful set. This music originated within McCalla's theater piece about independent station Radio Haiti, Breaking the Thermometer To Hide the Fever, which she transformed into one of 2022’s most compelling albums. From the driving, danceable call to revolution “Dodinin” to “Nan Fon Bwa,” written by renowned guitarist Frantz Casseus and now a showcase for McCalla’s funky cello work, she and her band — all players deeply immersed in Haiti’s rhythms and songlines — enact a historical journey that honors a nation born in revolution and still fighting, despite unfathomable hardship, today.\n\nMcCalla’s parents immigrated to New York as kids, during François Duvalier’s murderous regime. “I’ve been curious about that period in their lives and Haitian history for a long time,” she says, introducing “Fort Dimanche,” which samples an interview conducted by Radio Haiti’s cofounder Michèle Montas about life within the country’s most notoriously brutal prison. The song begins quietly, led by McCalla’s circular banjo lines, then builds a dream of freedom through the rhythms of Markus Schwartz's congas and Pete Olyinciw’s bowed and plucked upright bass. Memory’s shape is latticework, delicate and non-linear, and McCalla’s songs honor its partial revelations with the grace of deep attention.\n\nSET LIST\nDodinin\nMemory Song\nFort Dimanche\nNan Fon Bwa\n\nMUSICIANS\nLeyla McCalla - vocals, cello, banjo, electric guitar\nPete Olynciw - upright bass\nShawn Myers - drums\nNahum Zdybel - electric guitar\nMarkus Schwartz - Congas\n\nTINY DESK TEAM\nProducer: Bob Boilen\nDirector/Editor: Joshua Bryant\nAudio Engineer: Josh Rogosin\nSeries Producer: Bobby Carter\nVideographers: Kara Frame, Joshua Bryant, Maia Stern\nAudio Assistant: Natasha Branch\nProduction Assistant: Jill Britton\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#TinyDesk #NPRMusic #LeylaMcCalla", "link": "https://www.youtube.com/watch?v=2aX8svdJjZo", "date_published": "2022-10-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]