[{"source": "https://www.theguardian.com/world/rss", "title": "India criticised over arbitrary travel bans after photojournalist blocked from Pulitzer trip", "description": "<p>Sanna Irshad Mattoo says she was barred from taking a flight to New York where she was scheduled to receive the 2022 Pulitzer Prize</p><p>Indian authorities have been criticised after a Kashmiri photojournalist said she was barred from taking a flight to New York where she was scheduled to receive the 2022 Pulitzer prize.</p><p>Sanna Irshad Mattoo, 27, was in a team of Reuters photographers who had won a Pulitzer for feature photography for their coverage of the coronavirus crisis in India.</p> <a href=\"https://www.theguardian.com/global-development/2022/oct/20/india-criticised-over-arbitrary-travel-bans-after-photojournalist-blocked-from-pulitzer-trip\">Continue reading...</a>", "link": "https://www.theguardian.com/global-development/2022/oct/20/india-criticised-over-arbitrary-travel-bans-after-photojournalist-blocked-from-pulitzer-trip", "date_published": "2022-10-20 22:06:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Iran provides ‘technical support’ for Russian drones killing civilians, says US", "description": "<p>Iranians brought trainers and technical support to Crimea to help Russians use drones ‘with better lethality’, White House says</p><p>Iran has significantly deepened its involvement in Russia’s invasion of Ukraine by providing technical support for Russian pilots flying <a href=\"https://www.theguardian.com/world/2022/oct/17/fear-kyiv-deadly-kamikaze-drones-rain-down-ukraine\">Iranian-made drones</a> to bomb civilian targets, the White House has confirmed.</p><p>The national security council lead spokesperson, John Kirby, said on Thursday that it was the US’s understanding that the Iranian advisers were in Crimea to provide training and maintenance – but not to actually pilot the drones – after Russian forces experienced difficulties in operating the unmanned flying bombs.</p> <a href=\"https://www.theguardian.com/world/2022/oct/20/russia-ukraine-war-iran-drones-advisers-crimea\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/20/russia-ukraine-war-iran-drones-advisers-crimea", "date_published": "2022-10-20 21:39:52+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Canada supreme court refuses to hear appeal in blow to residential school survivors", "description": "<p>Survivors of St Anne’s Indian residential school allege government withheld key evidence in determining compensation for victims</p><p>Canada’s supreme court has declined to hear an appeal brought by a group of Indigenous residential school survivors, dealing a major blow to their decade-long fight against federal government over thousands of unreleased documents.</p><p>Survivors of St Anne’s Indian residential school had hoped the country’s top court would take their case, which alleges Canada’s federal government withheld crucial evidence in determining compensation for victims of abuse at the school in northern Ontario.</p> <a href=\"https://www.theguardian.com/world/2022/oct/20/canada-supreme-court-decline-appeal-school-indigenous-abuse\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/20/canada-supreme-court-decline-appeal-school-indigenous-abuse", "date_published": "2022-10-20 18:09:19+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Vanuatu to welcome first female MP since 2008 after snap election", "description": "<p>Vanuatu Election Commission yet to declare official results but Julia King likely to be lone female voice in 52-member parliament</p><p>Votes are still being counted in Vanuatu’s snap election, but with the preliminary votes tallied, one change seems certain: Vanuatu’s all-male parliament is no more, with the first woman elected to office since 2008 likely to be announced within days.</p><p>“I’m excited for Vanuatu women of course,” Julia King said. King looks set to be returned as the MP for Mele on the outskirts of the capital of Port Vila. “I’m happy for women in general to know they have a voice that can be represented up there. That’s the part I can be excited about.”</p> <a href=\"https://www.theguardian.com/world/2022/oct/21/vanuatu-to-welcome-first-female-mp-since-2008-after-snap-election\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/21/vanuatu-to-welcome-first-female-mp-since-2008-after-snap-election", "date_published": "2022-10-20 18:00:01+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Dozens dead in Chad capital as security forces fire on protesters", "description": "<p>‘Rebels’ accused of setting fire to ruling party HQ during demonstrations calling for faster democratic transition</p><p>Security forces in Chad’s capital, N’Djamena, have violently dispersed banned protests calling for a quicker transition to democratic rule, leaving at least 50 dead and dozens injured, according to the country’s prime minister.</p><p>Palls of black smoke could be seen in some areas in N’Djamena and the crack of teargas grenades could be heard throughout much of the day. Several roads had been blocked with barricades and burning tyres and most shops closed their doors to avoid looting.</p> <a href=\"https://www.theguardian.com/world/2022/oct/20/chaos-chad-police-protests-journalist-prime-minister-democracy\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/20/chaos-chad-police-protests-journalist-prime-minister-democracy", "date_published": "2022-10-20 17:55:07+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Head of WHO’s Syria office faces allegations of fraud and abuse", "description": "<p>Numerous complaints made about Dr Akjemal Magtymova, AP reports after whistleblower leak</p><p>The head of the World Health Organization’s Syria office has been accused of widespread mismanagement, including misspending donor money, plying government officials with gifts and pressing for contracts to be signed with regime officials and politicians.</p><p>Staff at the UN organisation have made numerous complaints about Dr Akjemal Magtymova, who has led WHO’s Syrian operations for almost three years, according to an investigation by the Associated Press.</p> <a href=\"https://www.theguardian.com/world/2022/oct/20/head-of-who-syria-office-allegations-dr-akjemal-magtymova\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/20/head-of-who-syria-office-allegations-dr-akjemal-magtymova", "date_published": "2022-10-20 17:15:40+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Hedley frontman Jacob Hoggard sentenced to five years for sexual assault", "description": "<p>Musician was found guilty earlier this year for sexually assaulting an Ottawa woman in a ‘particularly degrading rape’</p><p>Jacob Hoggard, the front man for the Canadian band Hedley, has been sentenced to five years in prison on Thursday after he was <a href=\"https://www.theguardian.com/world/2022/jun/06/jacob-hoggard-hedley-musician-guilty-rape\">found guilty earlier this year of sexually assaulting an Ottawa woman</a> in what the presiding judge called a “particularly degrading rape”.</p><p>Ontario superior court justice Gillian Roberts said she accepted the woman’s testimony in its entirety and said it involved “gratuitous degradation” and “gratuitous violence”.</p><p>Information and support for anyone affected by rape or sexual abuse issues is available from the following organisations. In the US, <a href=\"https://www.rainn.org/\">Rainn</a> offers support on 800-656-4673. In the UK, <a href=\"https://rapecrisis.org.uk/\">Rape Crisis</a> offers support on 0808 802 9999. In Australia, support is available at <a href=\"https://www.1800respect.org.au/\">1800Respect</a> (1800 737 732). Other international helplines can be found at <a href=\"http://ibiblio.org/rcip/internl.html\">ibiblio.org/rcip/internl.html</a></p> <a href=\"https://www.theguardian.com/world/2022/oct/20/jacob-hoggard-sexual-assault-sentenced-hedley-band\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/20/jacob-hoggard-sexual-assault-sentenced-hedley-band", "date_published": "2022-10-20 16:12:24+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Indonesia bans sale of syrup medicines after at least 99 child deaths", "description": "<p>Country investigating 206 cases of kidney injury that could be linked to ingredients in liquid medicines</p><p>Indonesia has banned the sale of all syrup medicines as it investigates the deaths this year of nearly 100 children, warning that the liquids may contain ingredients linked to fatal kidney injuries.</p><p>The move comes just weeks after the World Health Organization issued an alert over four Indian-made cough syrups that it said were potentially linked with acute kidney injuries and the deaths of 70 children in the Gambia.</p> <a href=\"https://www.theguardian.com/world/2022/oct/20/indonesia-bans-sale-of-syrup-medicines-after-at-least-99-children-die\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/20/indonesia-bans-sale-of-syrup-medicines-after-at-least-99-children-die", "date_published": "2022-10-20 13:46:38+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "‘Nature is striking back’: flooding around the world, from Australia to Venezuela", "description": "<p>Heavy rain and rising waters continue to take a deadly toll in countries including Nigeria, Thailand and Vietnam</p><p>It has been a drenched 2022 for many parts of the world, at times catastrophically so. A year of disastrous flooding perhaps reached its nadir in Pakistan, where a third of the country was inundated by heavy rainfall from June, killing more than 1,000 people in what António Guterres, the UN secretary general, called an unprecedented natural disaster.</p><p>While floods are indeed natural phenomena, a longstanding result of storms, the human-induced climate crisis is amplifying their damage. Rising sea levels, driven by melting glaciers and the thermal expansion of water, are increasingly inundating coastal areas, while warmer temperatures are causing more moisture to accumulate in the atmosphere, which is then released as rain or snow.</p> <a href=\"https://www.theguardian.com/environment/2022/oct/20/flooding-world-climate-crisis-australia-venezuela-nigeria\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/oct/20/flooding-world-climate-crisis-australia-venezuela-nigeria", "date_published": "2022-10-20 12:51:37+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Ministers urged to expel China diplomat over Manchester protest violence", "description": "<p>UK government facing growing criticism for ‘weak’ response to attack on democracy campaigner</p><p>British ministers have been urged immediately to expel a senior Chinese diplomat who admitted being involved in violence against protesters in Manchester, as the government faced growing criticism over its “weak and supine” response.</p><p>Zheng Xiyuan, the Chinese consul general, said it was his “duty” to grab the hair of a pro-democracy campaigner who was badly injured after being <a href=\"https://www.theguardian.com/uk-news/2022/oct/18/china-claims-hong-kong-protester-entered-manchester-consulate-illegally\">dragged inside the consulate grounds</a> on Sunday.</p> <a href=\"https://www.theguardian.com/politics/2022/oct/20/uk-ministers-urged-expel-china-diplomat-manchester-protest-violence\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/oct/20/uk-ministers-urged-expel-china-diplomat-manchester-protest-violence", "date_published": "2022-10-20 11:59:29+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "China using influencers to whitewash human rights abuses, report finds", "description": "<p>Social media videos by people from the Uyghur community are part of a sophisticated propaganda campaign, thinktank says</p><p>The Chinese Communist party is using social media influencers from troubled regions like Xinjiang, Tibet and Inner Mongolia to whitewash human rights abuses through an increasingly sophisticated propaganda campaign, a report has claimed.</p><p>The report published on Thursday by the Australian Strategic Policy Institute (ASPI), described the videos by “frontier influencers” as a growing part of Beijing’s “propaganda arsenal”.</p> <a href=\"https://www.theguardian.com/world/2022/oct/20/china-using-influencers-to-whitewash-human-rights-abuses-report-finds\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/20/china-using-influencers-to-whitewash-human-rights-abuses-report-finds", "date_published": "2022-10-20 11:34:20+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Albanese government to give $900m budget boost to Pacific countries", "description": "<p>Funding will help tackle poverty and shore up security in the region and make Australia ‘more influential in the world’, Penny Wong says</p><ul><li><a href=\"https://www.theguardian.com/australia-news/live/2022/oct/21/australia-news-live-updates-eastern-states-brace-for-more-rain-floods-victoria-weather-politics-labor-plans-pacific-aid-boost-liz-truss\">Follow our Australia news live blog for the latest updates</a></li><li>Get our <a href=\"https://www.theguardian.com/australia-news/2022/sep/23/morning-mail-newsletter-best-daily-news-email-guardian-australia-free-sign-up-inbox-subscribe?CMP=cvau_sfl\">morning</a> and <a href=\"https://www.theguardian.com/australia-news/2022/oct/13/afternoon-update-newsletter-best-daily-news-email-guardian-australia-free-sign-up?CMP=cvau_sfl\">afternoon</a> news emails, <a href=\"https://www.theguardian.com/technology/ng-interactive/2018/may/15/the-guardian-app?CMP=cvau_sfl\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></li></ul><p>The Albanese government will increase aid to Pacific countries by $900m as it declares next week’s budget will deliver the biggest rise in Australia’s official development assistance in more than a decade.</p><p>The foreign affairs minister, Penny Wong, will announce the extra funding during a speech in French Polynesia on Friday, arguing the budget will be “a major step toward the goal of making Australia stronger and more influential in the world”.</p><p>Sign up for our free <a href=\"https://www.theguardian.com/australia-news/2022/sep/23/morning-mail-newsletter-best-daily-news-email-guardian-australia-free-sign-up-inbox-subscribe?CMP=copyembed\">morning newsletter</a> and <a href=\"https://www.theguardian.com/australia-news/2022/oct/13/afternoon-update-newsletter-best-daily-news-email-guardian-australia-free-sign-up?CMP=copyembed\">afternoon email</a> to get your daily news roundup</p> <a href=\"https://www.theguardian.com/australia-news/2022/oct/20/albanese-government-to-give-900m-budget-boost-to-pacific-countries\">Continue reading...</a>", "link": "https://www.theguardian.com/australia-news/2022/oct/20/albanese-government-to-give-900m-budget-boost-to-pacific-countries", "date_published": "2022-10-20 11:30:52+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Canada’s largest grocer to freeze prices amid profiteering accusations", "description": "<p>Loblaw Companies says it will lock in prices of ‘no name’ amid looming parliamentary investigation into the food retail industry</p><p>Canada’s largest grocer has announced a price freeze on its low-cost product line, amid accusations of profiteering a worsening cost of living crisis – and a looming parliamentary investigation into the food retail industry.</p><p>Inflation figures on Wednesday showed that grocery prices in the country rose 11.4% over last month, continuing a surge not seen in more than four decades.</p> <a href=\"https://www.theguardian.com/world/2022/oct/20/canada-largest-grocer-to-freeze-prices\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/20/canada-largest-grocer-to-freeze-prices", "date_published": "2022-10-20 09:30:50+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "YouTube and Facebook letting Brazil election disinformation spread, NGO says", "description": "<p>Global Witness produced – and withdrew – purposely misleading ads that were all approved by YouTube, and half by Facebook</p><p> YouTube and Facebook are allowing disinformation to be spread about <a href=\"https://www.theguardian.com/world/brazil\">Brazil</a>’s election campaign, <a href=\"https://www.theguardian.com/world/2022/sep/15/jair-bolsonaro-brazil-political-violence-election\">adding to the bitterness</a> in an already polarized and violent election, according to a new report by the human rights organization Global Witness.</p><p>The NGO produced a series of purposely misleading ads during an election season that has been dominated by the bitter race between far-right incumbent <a href=\"https://www.theguardian.com/world/jair-bolsonaro\">Jair Bolsonaro</a> and his leftist challenger, former president <a href=\"https://www.theguardian.com/world/luiz-inacio-lula-da-silva\">Luiz Inácio Lula da Silva</a>.</p> <a href=\"https://www.theguardian.com/world/2022/oct/20/brazil-election-disinformation-youtube-facebook\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/20/brazil-election-disinformation-youtube-facebook", "date_published": "2022-10-20 09:30:50+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Eight killed in suspected parcel bomb explosions at Myanmar’s Insein prison", "description": "<p>Three prison staff and five visitors died after the bombs hit a crowd queuing to drop off parcels for inmates at prison housing political detainees</p><p>At least eight people have been killed in explosions at Myanmar’s main prison for political detainees after two bombs exploded on Wednesday morning.</p><p>Three prison staff and five visitors, including a 10-year-old girl, died after the bombs hit a crowd queueing to drop off parcels for inmates at Insein Prison, junta authorities said in a statement.</p> <a href=\"https://www.theguardian.com/world/2022/oct/20/killed-in-suspected-parcel-bomb-explosions-at-myanmars-insein-prison\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/20/killed-in-suspected-parcel-bomb-explosions-at-myanmars-insein-prison", "date_published": "2022-10-20 03:04:32+00:00", "persistent": false, "user": null, "language": "en-US"}]