{"entries": [{"source": "https://feeds.feedburner.com/TheHackersNews", "link": "https://thehackernews.com/2022/10/google-launches-guac-open-source.html", "title": "Google Launches GUAC Open Source Project to Secure Software Supply Chain", "date_published": "2022-10-20 17:03:00+00:00", "description": "Google on Thursday announced that it's seeking contributors to a new open source initiative called Graph for Understanding Artifact Composition, also known as GUAC, as part of its ongoing efforts to beef up the software supply chain.\n\"GUAC addresses a need created by the burgeoning efforts across the ecosystem to generate software build, security, and dependency metadata,\" Brandon Lum, Mihai", "persistent": false}, {"source": "https://feeds.feedburner.com/TheHackersNews", "link": "https://thehackernews.com/2022/10/oldgremlin-ransomware-targeted-over.html", "title": "OldGremlin Ransomware Targeted Over a Dozen Russian Entities in Multi-Million Scheme", "date_published": "2022-10-20 16:31:00+00:00", "description": "A Russian-speaking ransomware group dubbed OldGremlin has been attributed to 16 malicious campaigns aimed at entities operating in the transcontinental Eurasian nation over the course of two and a half years.\n\"The group's victims include companies in sectors such as logistics, industry, insurance, retail, real estate, software development, and banking,\" Group-IB said in an exhaustive report", "persistent": false}, {"source": "https://feeds.feedburner.com/TheHackersNews", "link": "https://thehackernews.com/2022/10/hackers-using-new-version-of-furball.html", "title": "Hackers Using New Version of FurBall Android Malware to Spy on Iranian Citizens", "date_published": "2022-10-20 11:33:00+00:00", "description": "The Iranian threat actor known as Domestic Kitten has been attributed to a new mobile campaign that masquerades as a translation app to distribute an updated variant of an Android malware known as FurBall.\n\"Since June 2021, it has been distributed as a translation app via a copycat of an Iranian website that provides translated articles, journals, and books,\" ESET researcher Lukas Stefanko said", "persistent": false}, {"source": "https://feeds.feedburner.com/TheHackersNews", "link": "https://thehackernews.com/2022/10/not-all-sandboxes-are-for-children-how.html", "title": "Not All Sandboxes Are for Children: How to Secure Your SaaS Sandbox", "date_published": "2022-10-20 11:20:00+00:00", "description": "When creating a Sandbox, the mindset tends to be that the Sandbox is considered a place to play around, test things, and there will be no effect on the production or operational system. Therefore, people don't actively think they need to worry about its security. This mindset is not only wrong, but extremely dangerous. \nWhen it comes to software developers, their version of sandbox is similar to", "persistent": false}, {"source": "https://feeds.feedburner.com/TheHackersNews", "link": "https://thehackernews.com/2022/10/these-16-clicker-malware-infected.html", "title": "These 16 Clicker Malware Infected Android Apps Were Downloaded Over 20 Million Times", "date_published": "2022-10-20 09:04:00+00:00", "description": "As many as 16 malicious apps with over 20 million cumulative downloads have been taken down from the Google Play Store after they were caught committing mobile ad fraud.\nThe Clicker malware masqueraded as seemingly harmless utilities like cameras, currency/unit converters, QR code readers, note-taking apps, and dictionaries, among others, in a bid to trick users into downloading them,", "persistent": false}, {"source": "https://feeds.feedburner.com/TheHackersNews", "link": "https://thehackernews.com/2022/10/latest-ursnif-variant-shifts-focus-from.html", "title": "New Ursnif Variant Likely Shifting Focus to Ransomware and Data Theft", "date_published": "2022-10-20 08:39:00+00:00", "description": "The Ursnif malware has become the latest malware to shed its roots as a banking trojan to revamp itself into a generic backdoor capable of delivering next-stage payloads, joining the likes of Emotet, Qakbot, and TrickBot.\n\"This is a significant shift from the malware's original purpose to enable banking fraud, but is consistent with the broader threat landscape,\" Mandiant researchers Sandor", "persistent": false}, {"source": "https://feeds.feedburner.com/TheHackersNews", "link": "https://thehackernews.com/2022/10/brazilian-police-arrest-suspected.html", "title": "Brazilian Police Arrest Suspected Member of Lapsus$ Hacking Group", "date_published": "2022-10-20 05:07:00+00:00", "description": "The Federal Police of Brazil on Wednesday announced it had arrested an individual for purported links to the notorious LAPSUS$ extortionist gang.\nThe arrest was made as part of a new law enforcement effort, dubbed Operation Dark Cloud, that was launched in August 2022, the agency noted. Not much is known about the suspect other than the fact that the person could be a teenager.\nThe Polícia", "persistent": false}], "source url": "https://feeds.feedburner.com/TheHackersNews", "source title": "The Hacker News"}