[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Abdullah Ibrahim: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | March 9, 2022\nIt’s less a concert and more witnessing a master thoughtfully creating an atmosphere, a vibe. And for 13 short minutes, I feel seated in Abdullah Ibrahim’s home in Chiemgau, Germany, witnessing seven decades of experience slowly dripping from his fingers and touching my soul.\n\nAbdullah Ibrahim, now 87, has witnessed the horrors of apartheid. He grew up in South Africa and composed what would become known as the “anti-apartheid anthem,” “Mannenberg.” Nelson Mandela called him “our Mozart.” He also successfully made music under the name Dollar Brand, and worked with jazz legends including Duke Ellington, Max Roach, Don Cherry and Archie Shepp. In 1968, he converted to Islam and changed his name from Dollar Brand; more recently, he became an NEA Jazz Master. In my 18 years directing All Things Considered, I’d often reach for his music to play between news stories to give the audience a chance to think and reflect. His music is like that; it’s mind-opening. \n\nAnd here he is seated at his piano, his white hair luminous, his fingers delicate, while he reflects on the past and helps clarify the present. The music is from his newest album Solotude, a recording made to an empty concert hall in southeast Germany during the 2020 lockdown, which for me became a source of calm when it was released toward the end of 2021. To witness this Tiny Desk (home) concert, I suggest you take these next 13 minutes, turn off your distractions and discover the strength in delicate reflection from a gentle man who has some much to share. \n\nSET LIST\n“Blue Bolero”\n“Signal On The Hill”\n“Once Upon A Midnight”\n\nMUSICIANS\nAbdullah Ibrahim: piano\n\nCREDITS\nDirector / Director of Photography: Tobias Corts\nSound Engineer / Edit / Grading: Florian Epple\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Joshua Bryant\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Kara Frame, Maia Stern, Ashley Pointer\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #abdullahibrahim", "link": "https://www.youtube.com/watch?v=L5i4stj4M30", "date_published": "2022-03-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Patricia Kopatchinskaja: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nTom Huizenga | March 8, 2022\nViolinist Patricia Kopatchinskaja and pianist Joonas Ahonen, like most of us right now, are concerned about the Russian invasion of Ukraine. Kopatchinskaja hails from Moldova, which shares a border with Ukraine and declared independence from the Soviet Union in 1991. Ahonen is from Finland, which borders Russia in the east and was once under the Russian Empire until the 1917 Revolution.     \n \n“We are outraged,” the violinist says. And the music the two have chosen to play, in her Vienna apartment, is appropriate in both its bold surface features and deeper connections. The two movements from Beethoven’s Violin Sonata No. 7 have never sounded more fiercely provocative. No dainty singing line in the scherzo for Kopatchinskaja; her Beethoven cries out with insistence. And the finale finds Ahonen’s piano explosive in its urgency. Beethoven, Kopatchinskaja reminds us, was a supporter of human rights and a defier of despotism. They follow with rarely heard, arresting music by George Antheil, a Trenton, N.J. native and Beethoven devotee, who triumphed in Europe before settling in Hollywood in the 1930s. His Violin Sonata No. 1, with its wailing blocks of sound and mechanical rhythms, defines his 1920s style which has been compared to cubism in painting.\n\nAt age 44, Kopatchinskaja is considered one of today’s most courageous, forward-thinking violinists. Her restless spirit has led her in diverse musical directions ever since she was a youngster. “My first teacher was the rain,” she wrote in a piece for The Strad. “I listened to the drops. They were the first short, round notes in my childhood imagination.” Thankfully, in this Tiny Desk (home) concert, she allows us to eavesdrop on her teeming creativity.\n \nSET LIST\nBeethoven: Violin Sonata No. 7 in C minor: III. Scherzo\nBeethoven: Violin Sonata No. 7 in C minor: IV. Finale. Allegro.\nAntheil: Violin Sonata No. 1: IV. Presto\n\nMUSICIANS\nPatricia Kopatchinskaja: violin\nJoonas Ahonen: piano\n\n\nCREDITS\nVideo: Patricia Kopatchinskaja\nAudio: Joonas Ahonen\n\n\nTINY DESK TEAM\nProducer: Tom Huizenga\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Joshua Bryant, Maia Stern, Ashley Pointer\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #patriciakopatchinskaja", "link": "https://www.youtube.com/watch?v=L1l69tA5oCs", "date_published": "2022-03-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]