[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Assassin's Creed Valhalla: Dawn of Ragnarök DLC Review", "description": "Dawn of Ragnarök, Assassin's Creed Valhalla's latest expansion, doesn't quite reach the highs found in previous myth and legends focused DLC, but it does evolve Valhalla's combat and navigation via an assortment of mythical powers.", "link": "https://www.youtube.com/watch?v=XhW2-a7YxTw", "date_published": "2022-03-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best PlayStation State of Play Trailers (March 2022)", "description": "Sony's PlayStation State of Play for March 2022 has wrapped up, and in this video, we're taking a look at the best trailers from the event. We got some surprise announcements, including reveal trailers for Exoprimal and Valkyrie Elysium, as well as free DLC for Returnal and a look at upcoming games like GhostWire: Tokyo. Check out the video for a look at all of the most exciting reveals.\n\n00:00 - Exoprimal\n02:27 - Valkyrie Elysium\n04:30 - Forspoken\n06:14 - GhostWire: Tokyo\n08:04 - Gundam Evolution\n09:29 - JoJo's Bizarre Adventure: All Star Battle R\n11:00 - Trek to Yomi\n12:43 - Returnal - Ascension\n14:13 - The DioField Chronicle\n\n#StateofPlay #SonyPlayStation", "link": "https://www.youtube.com/watch?v=dU9CDoQznIc", "date_published": "2022-03-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring: Every Sacred Tear Location Guide", "description": "Sacred Tears are among the most important items in Elden Ring, allowing you to upgrade your Flasks of Crimson and Cerulean Tears. Here's where to find every Sacred Tear in Elden Ring. #EldenRing\n\n0:00 - Intro\n0:33 - 1. Church of Pilgrimage, Weeping Peninsula\n0:59 - 2. Fourth Church of Marika, Weeping Peninsula\n1:28 - 3. Callu Baptismal Church, Weeping Peninsula\n2:06 - 4. Third Church of Marika, Mistwood\n2:43 - 5. Church of Irith, Liurnia of the Lakes\n3:13 - 6. Bellum Church, Liurnia of the Lakes\n3:27 - 7. Church of Inhibition, Liurnia of the Lakes\n4:12 - 8. Church of the Plague, Caelid\n4:44 - 9. Second Church of Marika, Altus Plateau\n5:10 - 10. Stormcaller Church, Altus Plateau\n5:56 - 11. First Church of Marika, Mountaintops of the Giants\n6:30 - 12. Church of Repose, Mountaintops of the Giants\n7:24 - Conclusion\n\nElden Ring Sacred Tears are among the most important items in the game. These are how you’ll upgrade your Flasks of Crimson and Cerulean Tears, and as you’d expect from such useful items, you won’t find them growing on trees. Sacred Tears are less random and are found in churches, though actually reaching some of these abandoned holy places is often more difficult than searching high and low for Seeds.\n\nSacred Tears are much rarer than Golden Seeds and increase how much HP or FP your Flasks restore with each use. They’re exceptionally useful as you increase your Vigor and Mind stats, and you can get several early in the game. Sacred Tears are found in churches, though not every church has one. In this video, we show the locations and how to reach each Sacred Tear we've found.\n\nIf you want to know more about the game, check out Tamoor Hussain's Elden Ring review in progress. He gave it a 10/10 saying, \"From Software's latest is a masterpiece of open-world design that places exploration and player agency at the heart of the experience.\"", "link": "https://www.youtube.com/watch?v=MK_fvB1uG0o", "date_published": "2022-03-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Exoprimal Reveal Trailer | State of Play March 2022", "description": "Capcom is back at it with dinosaurs and exosuits in Exoprimal. In Exoprimal, you'll find yourself controlling an exosuit, and humanity's greatest hope, as you take on prehistoric dinosaurs who have been warped into a futuristic city. Exoprimal is a brand new IP from Capcom, and is set to release 2023 on PS4 and PS5. \n\n#Exoprimal #StateofPlay", "link": "https://www.youtube.com/watch?v=_1txNoNYrYo", "date_published": "2022-03-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Forspoken NEW Gameplay Trailer | Sony State of Play March 2022", "description": "The upcoming action RPG, Forspoken, from Luminous Productions and Square Enix received a brand new gameplay trailer. In it, we saw protagonist, Frey, using all new abilities to take on her enemies and traverse the world. Forspoken releases to PS5 on October 11, 2022.\n\n#Forspoken #StateofPlay", "link": "https://www.youtube.com/watch?v=c7mxS5WEvzk", "date_published": "2022-03-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Ghostwire Tokyo Trailer | Sony State of Play March 2022", "description": "Ghostwire Tokyo is Tango Gameworks and Bethesda Softworks upcoming action-adventure video game. It releases on March 25, 2022.\n\nFace the unknown, uncover the truth and save Tokyo. A thrilling action-adventure game coming to PlayStation®5.\n\nGhostwire: Tokyo. Pre-order/Buy Now! (Buy Now starting 3/25)\n\nFor more on the Ghostwire: Tokyo: \nhttps://www.playstation.com/en-us/games/ghostwire-tokyo/?emcid=pa-3r-43913", "link": "https://www.youtube.com/watch?v=e0xhT1nBZsc", "date_published": "2022-03-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "JoJo's Bizarre Adventure All Star Battle R First Announcement Trailer", "description": "This fighting game based on the popular anime series has 50 playable characters and is set for release in early Fall 2022.\n\n#JojosBizarreAdventure", "link": "https://www.youtube.com/watch?v=Srih9AwlBmU", "date_published": "2022-03-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PlayStation State of Play | March 9, 2022 Livestream", "description": "Join us this Wednesday March 9 at 2 PM Pacific / 5 PM Eastern / 11:00 PM CET for new reveals and eye-catching updates for PS5 and PS4 titles. Note: We won’t have any updates on PlayStation VR2 titles or hardware in this broadcast.", "link": "https://www.youtube.com/watch?v=BOaBbokQGuc", "date_published": "2022-03-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sony PlayStation State of Play Full Showcase | March 2022", "description": "Check out the full Sony State of Play from March 2022, featuring primarily games coming from Japanese Developers. We got a look at Exoprimal, a new Jojo's Bizarre Adventure game, 2 new games from Square Enix and more!\n\n#StateofPlay #SonyPlayStation", "link": "https://www.youtube.com/watch?v=lPLoOZ-2G3g", "date_published": "2022-03-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The DioField Chronicle Teaser Trailer | State of Play March 2022", "description": "The Diofield Chronicle is a real time strategy RPG from Square Enix coming in 2022.", "link": "https://www.youtube.com/watch?v=0vRgYDopBEA", "date_published": "2022-03-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Valkyrie Elysium Announcement Trailer | State of Play March 2022", "description": "Valkyrie Elysium is an action brawler, with Soulslike combat, set in a fantastical world, sprawling with creatures, giants, and menacing knights. From developer Square Enix, Valkyrie Elysium is expected to launch on PS4 and PS5 in 2022.", "link": "https://www.youtube.com/watch?v=S27FOlh1YOg", "date_published": "2022-03-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Mysterious Arenas Unlocked By Modders | GameSpot News", "description": "Elden Ring might get colosseum based DLC, Halo Infinite Co-Op gets delayed again, and Forspoken delayed to October. \n\nRecently, several modders have finally found their way past the locked doors and explored these restricted locations. Videos like this one from YouTuber Garden of Eyes show that these buildings are far from empty and may not have just been cut content. In fact, each area’s level of detail has led many to speculate about what these colosseums could be used for. Some guesses across social media include: challenges, special boss fights, and a PvP arena.\n\nThe news comes via a new Halo Infinite development update, where developer 343 Industries has broken down current high-priority issues affecting the game, what fans can expect in Season 2, and updates on co-op and Forge. Clever fans did find a way to glitch their way into Halo Infinite co-op shortly after the game's launch, even if doing so risked corrupting the game's save data and it was more than a little buggy.\n\nSquare Enix and Luminous Productions announced that Forspoken has been delayed to October 11. It was originally set to launch on May 25. Forspoken follows a young woman named Frey Holland from New York City who is transported to Athia, a mystical and fantastical world where she must find her way home. Forspoken's original release date of May 25 was revealed during The Game Awards back in December.\n\nSTAMPS\n00:00 - Intro\n00:07 - Elden Ring\n01:10 - Halo Co-op\n02:32 - Forspoken", "link": "https://www.youtube.com/watch?v=D86F_f3vbMY", "date_published": "2022-03-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "GTA V on PS5 & Xbox Series X|S Price Revealed | GameSpot News", "description": "GTA V next-gen prices have been released, PlayStation State of Play is coming March 9, and a Dead Space Remake stream is coming March 11. \n\nPrices of Grand Theft Auto V's PS5 and Xbox Series X|S versions have been revealed and both platforms have discounts that will last until June 14. Unfortunately, existing owners of GTA V will not get a free upgrade when the new versions release on March 15. \n\nSony has revealed the next PlayStation State of Play will take place on March 9. According to the announcement, the event will run for about 20 minutes and will mainly focus on games from Sony's Japanese publishing partners.\n\nThere will also be a stream for the upcoming Dead Space remake on March 11. According to developer Motive Studios, the event will offer fans early looks at development and what goes into the remake of a game.\" The stream’s title is “The Sound Of Fear Reimagined. Audio Developer Livestream”, so it seems like it’ll be heavier on what you’ll hear in the game instead of what you’ll see.   \n\nSTAMPS\n00:00 - Intro\n00:09 - GTA V\n01:20 - State of Play\n02:21 - Dead Space Remake", "link": "https://www.youtube.com/watch?v=fCswHMStfJI", "date_published": "2022-03-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]