[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "John gets 'fact checked' by BBC", "description": "But who 'fact checks' the 'fact checkers'\n\nCovid: Posts claiming only 17,000 died of virus 'factually incorrect'\n\nhttps://www.bbc.co.uk/news/60145237\n\nThen on 20 January, Dr John Campbell, a retired nurse educator who has amassed a huge following on YouTube, released a video describing the figures as a \"huge story\" and suggested Covid deaths were \"much lower than mainstream media seems to have been intimating\".\n\nhttps://www.ons.gov.uk/peoplepopulationandcommunity/healthandsocialcare/conditionsanddiseases/articles/coronaviruscovid19/latestinsights\n\nhttps://coronavirus.data.gov.uk/details/deaths\n\nhttps://www.ons.gov.uk/aboutus/transparencyandgovernance/freedomofinformationfoi/deathsfromcovid19withnootherunderlyingcauses?s=09\n\nhttps://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/preexistingconditionsofpeoplewhodiedduetocovid19englandandwales\n\nhttps://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/lifeexpectancies/bulletins/nationallifetablesunitedkingdom/2018to2020\n\n\"It has become a weapon of the cruel and heartless to dismiss the deaths of the people we love.\"\n\nThe BBC has contacted Mr Nawaz, Dr Campbell and Mr Davis.\n\nBy Rachel Schraer\nHealth and disinformation reporter\n\nCoronavirus (COVID-19) latest insights: Deaths\n\nhttps://www.ons.gov.uk/peoplepopulationandcommunity/healthandsocialcare/conditionsanddiseases/articles/coronaviruscovid19latestinsights/deaths\n\nInformation based on scientific facts is a human right\n\nhttps://www.nytimes.com/live/2022/01/28/world/omicron-covid-vaccine-tests\n\nPope Francis\n\nTo be properly informed, to be helped to understand situations based on scientific data and not fake news, is a human right\n\nJournalists and scientists, should try to build bridges to those who need to hear scientific truths\n\nlauded those who could properly place individual facts in a broader picture\n\nby explaining the causes and circumstances of a given situation.\n\n10 billion vaccine doses have been administered globally\n\nProfessor Madhukar Pai, epidemiology and biostatistics, McGill University in Montreal\n\nhttps://www.nytimes.com/live/2022/01/28/world/omicron-covid-vaccine-tests\n\nSouth Africa, for example, has set up a hub to begin developing mRNA vaccines where scientists, are trying to reverse-engineer the Moderna vaccine from scratch, because the U.S. drugmaker won’t share its technology.\n\nDr. Pai likened this to reinventing the wheel while a car is on fire.", "link": "https://www.youtube.com/watch?v=bza1gAc8sOA", "date_published": "2022-01-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Data, we want it all, and we want it now", "description": "And we want it now.\n\nCovid-19 vaccines and treatments: we must have raw data, now\nhttps://www.bmj.com/content/376/bmj.o102\n\nData should be fully and immediately available for public scrutiny\n\n2009 - 2012\n\nhttps://clinicaltrials.gov/ct2/show/NCT04368728\n\nGovernments spent billions stockpiling Tamiflu\n\nMajority of trials sponsored by manufacturer\n\nPapers ghostwritten, paid by the manufacturer\n\nAcademics who requested access to the data for independent analysis were denied\n\nGodlee  F. We want raw data, now. BMJ2009;339:b5405doi:10.1136/bmj.b5405. \nFREE Full TextGoogle Scholar\n\nGodlee  F, Clarke  M Why don’t we have all the evidence on oseltamivir?BMJ2009;339:b5351.doi:10.1136/bmj.b5351 pmid:19995815\nFREE Full TextGoogle Scholar\n\nCohen  D Complications: tracking down the data on oseltamivir. BMJ2009;339:b5387.doi:10.1136/bmj.b5387 pmid:19995818\nFREE Full TextGoogle Scholar\n\nDoshi  P Neuraminidase inhibitors—the story behind the Cochrane review. BMJ2009;339:b5164.doi:10.1136/bmj.b5164 pmid:19995813\nFREE Full Text\n\nToday\n\nDespite the global rollout of covid-19 vaccines and treatments, \n\nthe anonymised participant level data underlying the trials for these new products remain inaccessible to doctors, researchers, and the public\n\nThis is morally indefensible for all trials, but especially for those involving major public health interventions.\n\nPfizer’s pivotal covid vaccine trial, designed, run, analysed, and authored by Pfizer employees. \n\nThe company and the contract research organisations that carried out the trial hold all the data.\n\nPfizer has indicated that it will not begin entertaining requests for trial data until May 2025, (NCT04368728).\n\nModerna data\n\nmay be available … with publication of the final study results in 2022\n\nDatasets will be available upon request and subject to review once the trial is complete\n\nEestimated primary completion date 27 October 2022 (NCT04470427).\n\n\n\nAstraZeneca\n\nAs of 31 December 2021 \n\ntimelines vary per request and can take up to a year upon full submission of the request\n\nRegeneron’s phase III trial of monoclonal antibody therapy REGEN-COV\n\nParticipant level data will not be made available to others EMU)\n\nShould the drug be approved, sharing will be considered\n\nRemdesivir\n\nUS National Institutes of Health, (funders) The longitudinal data set only contains a small subset of the protocol and statistical analysis plan objectives\n\nIn our view, there is no dilemma\nthe anonymised individual participant data from clinical trials must be made available for independent scrutiny.\nUS Food and Drug Administration, freedom of information request to the agency for Pfizer’s vaccine data\n\nUK, Medicines and Healthcare Products Regulatory Agency\n\ndoes not proactively release clinical trial documents\n\nTransparency and trust\n\nTransparent decision making is essential. \n\nAt least three of the many companies making covid-19 vaccines have past criminal and civil settlements costing them billions of dollars\n\nThe BMJ supports vaccination policies based on sound evidence. \n\nThe same applies to treatments for covid-19 \n\nData must be available when trial results are announced, published, or used to justify regulatory decisions. \n\nThere is no place for wholesale exemptions from good practice during a pandemic. \n\nThe public\n\nHas paid for covid-19 vaccines through vast public funding of research\n\nthat takes on the balance of benefits and harms\n\nhas a right and entitlement to those data, as well as to the interrogation of those data by experts.\n\nPharmaceutical companies are reaping vast profits without adequate independent scrutiny of their scientific claims.\n\nThe purpose of regulators is not to dance to the tune of rich global corporations and enrich them further; \n\nit is to protect the health of their populations. \n\nWe need complete data transparency for all studies, we need it in the public interest, and we need it now.", "link": "https://www.youtube.com/watch?v=YDxkloJ-4kE", "date_published": "2022-01-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]