[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "THE BEE WEEKLY: Backhanding Blue Checks and Now You Can Be A Skittle", "description": "Candy can be trans now, Democrats are talking about backhanding women they disagree with, and pro-life conservatives tell a pro-abortion Oklahoma state legislator that his terms are acceptable. This week at The Babylon Bee, Kyle and Adam talk to Skillet’s John Cooper about his new album, Dominion, which is lifting spirits and melting faces.\n\nThis episode is brought to you by Alliance Defending Freedom Legal Fund: go to: http://ADFLegal.org/babylonbee\n\nThis episode is also brought to you by Enduring Word Bible Commentary, which is completely free. Go to: http://enduringword.com\n\nKyle and Adam talk about the banger and bomb articles of the week which involve a new M&M trans character and Uyghur Muslims being forced to make Golden State Warrior jerseys. Podcast viewers can enjoy the video about the first trans Skittle. Then, Adam gives you the news you need to know this week in Weakly News. The Bee also gets caught up on all the crazy things Blue Checks say like how women should be backhanded, it’s now celebrated for a wife to renounce her husband’s thought crimes, and USA Today wants us to better understand pedophilia for some reason. Also, Trey Gowdy doesn’t understand how three times zero isn’t three. Then it’s time for The Celebrity Dating Game featuring AOC!\n\nKyle and Adam then talk to John Cooper from Skillet about Dominion, honoring the Emperor, and what’s causing crime to skyrocket in our cities. Of course, there is also hate mail.\n\nIn the subscriber lounge, Gavin answers the ten questions and shows off his lightsaber collection with the news that we are one step closer to making lightsabers a reality. Subscribers also get the rest of the interview with Skillet’s John Cooper!", "link": "https://www.youtube.com/watch?v=iF25ju6SnvI", "date_published": "2022-01-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]