[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "LINUX is still HARD to install?", "description": "Get 100$ credit for your Linux or Gaming server: https://www.linode.com/linuxexperiment\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n#Linux #InstallingLInux #HowtoinstallLinux\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nI also do a Gaming Podcast: https://www.youtube.com/channel/UCbRPZ11S1quJ4ESoj42A3ug\n\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n#Linux #InstallingLInux #HowtoinstallLinux\n\n00:00 Intro\n00:30 Sponsor: 100$ credit on your Linux or Gaming server\n01:42 Pre-Install steps are tricky\n04:23 Live session aren't self explanatory\n06:36 Our installers are just better\n09:19 Is Linux that hard to install?\n10:53 Sponsor: Get your Linux device\n11:16 Support the channel\n\nWhen talking about installing Linux, we instantly think about our graphical installers, like the ones that Ubuntu, OpenSUSE, Manjaro, PopOS, or elemenary OS provide.\nBut we forget that there is a step before accessing that graphical installer, and that's creating a bootable media.\n\nWhile it sounds super easy for most users who have made the switch to Linux, and users who distro hop constantly thanks to Ventoy and the ability to never flash a USB drive again, it's important to remember that most people who use a computer have NEVER created an install disk on their own.\n\n\nEven if the user manages to make that flash drive, they still have to be able to boot from it. A lot of computers that come with windows preinstalled will only boot to the disk drive first, for security reasons.\n\nLinux desktops also generally offer live sessions, and these are great to try out the distribution and the desktop before installing. I think these live sessions make the install experience much more user friendly, because you're not dropped immediately into something that will mess with your SSD or hard drive, you get a chance to see what it is that you're installing.\n\nThink about it. It's not immediately crystal clear that this session you're running isn't installed on your computer directly, or that the changes you make in this session will be lost when you reboot.\n\nThis needs much, much better explanation. Live sessions are fantastic tools, but dropping a user into one without warning or explanation kinda makes them scarier than if they weren't here.\n\nAnd now we come to the good part, the part where Linux excels compared to the competition: the graphical install part.\n\nLinux desktops, in that regard, are stellar. Our installers are the most user friendly that any user could happen upon. \n\nThe install process is generally extremely simple, if you want to erase your disk or install alongside another OS in a dual boot. You pick the language, the keyboard layout, an install drive, a few options for extra codecs or drivers, and you're good to go.\n\nInstalling a Linux desktop takes from 10 to 20 minutes depending on your disk speeds. Windows can take up to an hour with all the reboots and the loading screens.\n\nLinux installers don't pester you with questions and options, and stuff to disable.\n\nThe install experience is much more seamless. You get the installation, one reboot, and the user account creation in case of an OEM install. Windows reboots an unhealthy number of times during install, which makes the process jarring.\n\nSo, is Linux hard to install? There are 2 ways I can answer that question.\n\nThe first one is just taking Linux and Windows on an equal footing, as if someone wanted to install an OS onto a blank computer.\n\nIn that case, Linux isn't hard to install. It's easier than Windows: In both cases, you have to download ISO files, create a bootable disk, manage to boot from it, and install, and the Linux install process is much, much easier once you've done these first steps.\n\nThe second way I can answer the question is Yes, Linux is hard to install, because while actually installing it is a very easy process, the whole way to access the graphical installer is convoluted, requires a third party tool, and access to the BIOS or UEFI.", "link": "https://www.youtube.com/watch?v=QIMDPoQHqL8", "date_published": "2022-01-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]