[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dead Space Remake - Fear Reimagined Developer Full Showcase", "description": "Dead Space Remake is apparently going to need a little more time to get those jump scares ready, but in the meantime, the team shows off their progress and how they will make the game scary with creepy audio design.\n\nThis showcase will focus on the studio’s philosophy for taking Dead Space’s award-winning audio design to the next level by bringing the game to today’s generation of platforms and the new Frostbite engine while continuing to remain faithful to the iconic atmosphere, mood, and sounds you know and love.\n\nJoin creative Director Roman Campos-Oriola, Senior Producer Philippe Ducharme, and Audio Director Olivier Asselin, alongside special guest Jack Pattillo, who will be take you through an in-depth look at what the team is improving and updating in the audio design. Learn more about the:\n\nThe A.L.I.V.E. System –  your first chance to hear how the system that controls Isaac’s heart rate, breathing, and dialogue delivery will sound\n\nAudio Occlusion – how audio levels will be controlled through different materials and surfaces as well as projected audio down hallways\n\nWeapons – listen to both the original Plasma Cutter and the Pulse Rifle and the updates to these iconic sounds\n\nTimestamps\n0:00 Intro\n4:04 Audio Pillars\n8:50 Occlusion and Obstruction\n19:52 Weapon Sound Design\n28:12 Taking a look at Issac's Breathing and Heartbeat in the Original Dead Space\n36:01 - The A.L.I.V.E. System\n\n#DeadSpace", "link": "https://www.youtube.com/watch?v=mHDUjcfyXLA", "date_published": "2022-03-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dead Space Remake Gameplay & Release Window Teased | GameSpot News", "description": "The Dead Space remake gets new gameplay and a new release window, Call of Duty Warzone is coming to mobile, and Halo Infinite does not work on Steam Deck. \n\nThe Dead Space remake is now targeting an early 2023 release. The remake is being handled by EA Motive, the studio behind Star Wars: Squadrons, and will run on the Frostbite engine.\n\nA new blog post on the official Call of Duty website has confirmed that Call of Duty: Warzone is coming to mobile. There is no word yet on whether or not this will become part of the current Call of Duty Mobile or be available as its own app.\n\nMicrosoft has detailed which of its games are compatible with Valve's Steam Deck.  Games like Halo Infinite and The Master Chief Collection are both unsupported, as well as Gears of War 5.\n\nSTAMPS\n00:00 - Intro\n00:06 - Dead Space\n01:20 - Warzone\n02:02 - Steam Deck", "link": "https://www.youtube.com/watch?v=cEx4_lGgEoA", "date_published": "2022-03-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Everything We Want in Grand Theft Auto 6", "description": "Grand Theft Auto V is consistently one of the best-selling games each week, almost ten years after it was released. However, GTA V may be showing its age, as we’re finally starting to get our first hints of Grand Theft Auto VI, with Rockstar recently confirming that development on the game is “well underway” and rumors constantly swirling about new characters and the game’s location. Yet, while GTA V and GTA Online remain popular to this day, it’s clear after the tragic launch of the Grand Theft Auto: The Trilogy Definitive Edition that even the mightiest of video game franchises can’t rest on its laurels, so video producer Jessie Earl put together their list of what they want for the franchise that skipped an entire generation of consoles to do in order to update itself for today.\n\n0:00 - Intro\n0:58 - A New Setting\n2:20 - Multiple Protagonists \n3:45 - A Female Protagonist\n5:00 - A Stronger Narrative\n6:05 - Grounded Insanity\n7:02 - A Lived-in World\n7:45 - Improved Fighting Mechanics\n8:18 - RPG-Lite Elements\n8:45 - Good Talk Radio\n10:17 - Single-Player DLC\n11:10 - Outro\n\n#GTA #GTA6", "link": "https://www.youtube.com/watch?v=6ccOCNwKwSI", "date_published": "2022-03-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Destiny 2: The Witch Queen Review", "description": "Bungie continues to improve its shooter MMO with the best story campaign it has yet produced and a whole lot of great additional content to keep players engaged.\n\n#Destiny2 #TheWitchQueen", "link": "https://www.youtube.com/watch?v=lWLqCxzL9iw", "date_published": "2022-03-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring - 10 MORE Things You Didn't Know", "description": "Elden Ring is absolutely filled with hidden secrets and obscure details. From NPC questlines you'll have to track and can easily mess up, to illusory walls with hidden items and enemies, and even obscure mechanics you can easily miss. Today, Dave goes over Seluvis' secret in front of Ranni's Rise, a major illusory wall, and horseback meachnics on Torrent. Here are 10 Things You Didn't Know about Elden Ring\n\n00:13 - Seluvis’ Secret\n01:13 - Black Knife’s Illusory Wall\n02:30 - Farming the Big Boy Dragon\n04:19 - Torrent-back Fighting\n05:05 - Double-attacks while on Torrent\n05:58 - Spiritsprings? More like Spiritwells!\n06:35 - Torrent and status effects\n07:15 - Do not roll in poison\n07:58 - That annoying glinting item in the Stranded Graveyard\n09:18 - Those statues with glints in them\n\n#EldenRing", "link": "https://www.youtube.com/watch?v=grxYHDsHbps", "date_published": "2022-03-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "GTA V Next Gen - Everything to Know", "description": "After almost 10 years, Grand Theft Auto V has made it to another generation of gaming with the launch of GTA V on PS5 and Xbox Series X/S. From transferring save data to release dates, here's everything to know for GTA V on next-gen.\n\n00:40 - Release & Transfer Data\n01:36 - What's Different? \n03:39 - GTA Online Updates\n\nGrand Theft Auto V’s next gen launch is right around the corner. If you’re looking at hopping back into the streets of Los Santos, or if you’re thinking of joining GTA Online for the first time, here’s everything to know to prepare for the March 15th launch.\n\nAs mentioned in the Rockstar blog post, GTA next gen will feature updated visuals and quality of life updates. Let’s get into what you can expect. Beginning with game modes, GTA V will launch with three. Performance, Fidelity and Performance RT. Stay tuned by subscribing to GameSpot for more GTA videos like our upcoming graphics comparison and of course GTA VI coverage.", "link": "https://www.youtube.com/watch?v=89_tmdqg_8s", "date_published": "2022-03-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 NEW Developer Update", "description": "Watch this new developer update with Overwatch 2 director Aaron Keller, where Blizzard shares new details regarding plans for Overwatch 2, which include getting the PvP component of the shooter into players' hands while it continues work on the PvE side. That will begin with a closed alpha today, followed by a beta that includes a wider pool of players starting in April.\n\n#Overwatch2", "link": "https://www.youtube.com/watch?v=r1nv4MoBlDo", "date_published": "2022-03-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Play Stranger Of Paradise Early & Keep Your Progress! | GameSpot News", "description": "Stranger Of Paradise: Final Fantasy Origin gets a free demo, Final Fantasy’s 35th Anniversary site teases new projects, Gotham Knights gets an October release date and Advance Wars 1+2 Re-Boot Camp gets delayed.\n\nSony’s March State of Play is in the books and with it came some new announcements as well as updates on games that we already know about. During the event, it was revealed that Stranger Of Paradise: Final Fantasy Origin is getting a demo. Now PS4 and PS5 players can grab the demo today and try the game out before it's released on March 18. There was no word on whether it will also arrive for Xbox or PC.\n\nOriginally scheduled to launch at the end of 2021, Gotham Knights will now be released on October 25. Meanwhile, Advance Wars 1+2 Re-Boot Camp has been delayed. Nintendo announced the news in a brief tweet, attributing the move to \"recent world events.”", "link": "https://www.youtube.com/watch?v=KdPCausJDH0", "date_published": "2022-03-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Play The Overwatch 2 Beta Soon | GameSpot News", "description": "The Overwatch 2 beta is coming soon, Dying Light 2: Stay Human has a brand new update and Steam Deck adds drivers to support installation of Windows 10.\n\nBlizzard has announced a closed alpha and a closed beta for Overwatch 2. The alpha test begins today for Blizzard employees, Overwatch League players, and \"a few other select groups\". That April test will also be a closed beta, but you can now sign up to request access to it on the game's official website.\n\nTechland has just rolled out a brand-new patch for Dying Light 2: Stay Human that adds a number of features and fixes many of the game's worst bugs. The patch is live now for PC, and will be coming to console soon.\n\nValve has released the additional drivers necessary including drivers for GPU, WiFi, and Bluetooth. Audio drivers however are still in the works.\n\nTime Stamps\n00:00 - Intro\n00:07 - Overwatch 2\n01:42 - Dying Light 2\n02:47 - Steam Deck", "link": "https://www.youtube.com/watch?v=bWTyaJquC_c", "date_published": "2022-03-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]