[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Long list of side effects to look out for", "description": "The Complete List of the Pfizer Adverse Events of Special Interest\n\nLink to Wefwafwa's original video, https://www.youtube.com/watch?v=q1JO0kl3RYk\n\nand channel, https://www.youtube.com/channel/UCzsLklGgOttU3Se-WGLp7ow\n\nPlease suscribe to Wefwafwa@s channel to spport the community health work in Uganda\n\nhttps://phmpt.org/wp-content/uploads/2021/11/5.3.6-postmarketing-experience.pdf\n\nhttps://drjessesantiano.com/the-complete-list-of-the-pfizer-adverse-events-of-special-interest/\nIvermectin study apparently withdrawn\n\nhttps://www.sciencedirect.com/science/article/pii/S1201971221009887\n\nThe researchers and experts told The Associated Press that the findings are no longer relevant.\n\nhttps://apnews.com/article/fact-checking-136056839408\n\nAnother retraction example\n\nhttps://www.thelancet.com/journals/lancet/article/PIIS0140-6736(20)31180-6/fulltext\n\nAdverse Event of Special Interest \n\nis an event for a particular product that should be monitored by a drug or vaccine manufacturing company. \n\nIt can be severe or non-serious, but it can lead to a serious medical condition.\n\nAccording to the CIOMS Working Group VII\n\nhttps://cioms.ch\n\nThe Council for International Organizations of Medical Sciences (CIOMS),\n\ninternational, non-governmental, non-profit organization established jointly by WHO and UNESCO in 1949. \n\nSuch events should be described in protocols or protocol amendments, \n\nand instruction provided for investigators as to how and when they should be reported to the sponsor.\n\nThe original Pzifer appendix is a wall of words with the diagnoses separated by semi-colons. \n\nMore than 95% of the adverse events listed are life-changing. (for the bad)\n\nIf you are lucky enough to have a diagnosis from your doctors and say it is not related to the shot, \n\nshow this list to them. \n\nTell them that Pfizer is watching out for those complications. \n\nMany doctors, nurse practitioners, or physician assistants don’t know. \n\nI didn’t until I read the whole list.\n\nMany of the conditions below are rare. \n\nThat means a doctor may not have seen that condition before or might have forgotten about them from medical school. \n\nRare also means there may be no standardized treatment for them.\n\nThe diagnosis on the list does not mean they always happen with the COVID-19 shots, \n\nbut anyone who got “vaccinated” and then diagnosed with the illnesses below should be reported to Pfizer or the VAERS. \n\nThe diagnosis may be months or years after the shots. You can still report them.\n\nThe World Health Organization is also keeping an eye on the AESIs. AESI monitoring determines if there is a higher incidence of specific diseases in people who had the COVID shots. \n\nIf the incidence is higher in people who had the shots, they should stop using these “vaccines”. \n\nThat is if they do their job.\n\nThis list may be from Pfizer, but ALL WHO HAD THE COVID SHOTS WHATEVER THE MANUFACTURER SHOULD REPORT THEIR DIAGNOSIS.", "link": "https://www.youtube.com/watch?v=EASM6EzCVeg", "date_published": "2022-03-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Florida, no childhood vaccinations", "description": "Free PDFs of my two text books, direct link for downloads, http://159.69.48.3/\n\nPhysiology book in hard copy\n\nhttps://www.ebay.co.uk/itm/154770452796?mkevt=1&mkcid=16&mkrid=710-127635-2958-0\n\n0:00 start \n1:25 it is essential that health care practitioners review all data\n1:45 to evaluate risk and benefits, unique to each patient \n2:11 when determining what health care services to provide, \n2:37 including the administration of covid-19 vaccines \n2:53 these decisions should be made on an individual basis (Topic on providing unique care according to individual needs)\n3:15 risk of administering a covid-19 vaccine to healthy children may outweigh the benefits\n3:25 Healthy children aged 5 to 17 may not benefit from receiving the currently available COVID-19 vaccine\n3:39 children with underlying conditions are the best candidates for the COVID-19 vaccine\nLooking at the evidence \n4:00 risk that may outweigh benefits among healthy children with no underlying conditions\n4:12 limited risk of severe illness due to COVID-19\n5:00 Keynotes: Paper was used in Delta times, you ideally want something more current. The following are points true according to delta times \n5:34 Although Covid-19 is generally milder in children than adults \n5:39 severe illness and long-term complications, including multisystem inflammatory syndrome in children (MIS-C), can occur after primary infection \n6:11 Evaluation of the BNT162b2 Covid-19 Vaccine in children 5 to 11 years of AGE (NEJM)\n8:42 argument: There is high prevalence of existing immunity among children \n11:18 The absence of data informing benefit of COVID-19 vaccination among children with existing immunity (agrees with the Florida study)\n12:19 in clinical trials, higher than anticipated serious adverse events occurred among those receiving the covid-19 vaccine. (reference unclear to this claim) \n14:43 Reduced vaccine efficacy in with omicron, Effectiveness of the BNT162b2 vaccine among children 5-11 and 12-17 years in New York after the Emergence of the Omicron Variant \n16:27 the effectiveness against cases of BNT162b2 declined rapidly for children, particularly those 5-11\n16:48 However, vaccination of children 5-11 years was protective against severe disease and is recommended\n17:53 Risk of myocarditis due to the COVID-19 vaccine, Myocarditis Cases Reported After mRNA-Based COVID-19 Vaccination in the US From December 2020 to August 2021 (JAMA, 2022) \n20:19 Vaccine efficacy wanes rapidly (the percentage drop shown for children and adolescents) \n21:40 Recommended for children with underlying health conditions or comorbidities \n22:08 in general, healthy children with no significant underlying health conditions under 16 years old are at little to no risk of severe illness complications from covid-19, For adolescents, the risk of myocarditis du\r\n\nFlorida\nhttps://floridahealthcovid19.gov/wp-content/uploads/2022/03/g2-jtr_QWBT4hJpqr.pdf?utm_source=floridahealth.gov&utm_medium=referral&utm_campaign=covid-19&utm_term=fdoh+issues+new+guidance+regarding+covid-19+vaccination+recommendations+for+children&utm_content=press_release&url_trace_7f2r5y6=hcgyu2mu94atfcyvdgsa\n\nChildren with underlying conditions are the best candidates for the COVID-19 vaccine. \n\nEvaluation of the BNT162b2 Covid-19 Vaccine in Children 5 to 11 Years of Age (NEJM)\n\n(Delta time data)\n\nhttps://www.nejm.org/doi/full/10.1056/nejmoa2116298\n\nEvaluation of the BNT162b2 Covid-19 Vaccine in Children 5 to 11 Years of Age (NEJM)\n\nhttps://www.nejm.org/doi/full/10.1056/nejmoa2116298\n\nN = 2,268, (phase 2 clinical trial)\n\nhttps://covid19serohub.nih.gov\n\nNIH covid SeroHub\n\nhttps://www.fda.gov/safety/reporting-serious-problems-fda/what-serious-adverse-event\n\nReduced vaccine efficacy in with omicron\n\nEffectiveness of the BNT162b2 vaccine among children 5-11 and 12-17 years in New York after the Emergence of the Omicron Variant\n\nhttps://www.medrxiv.org/content/10.1101/2022.02.25.22271454v1\n\nNew York State Department of Health\n\nDecember 13, 2021 to January 30, 2022\n\nAged 12 – 17, n = 852,384 fully-vaccinated\n\nAged, 5 – 11 years, n = 365,502 fully-vaccinated\n\nRisk of myocarditis due to the COVID-19 vaccine\n \nMyocarditis Cases Reported After mRNA-Based COVID-19 Vaccination in the US From December 2020 to August 2021(JAMA, 2022)\n\nhttps://jamanetwork.com/journals/jama/fullarticle/2788346\n\n(70.7 per million doses of the BNT162b2 vaccine)\n\nin adolescent males aged 16 to 17 years\n\n(105.9 per million doses of the BNT162b2 vaccine)\n\nin young men aged 18 to 24 years\n\n(52.4 per million doses of BNT162b2)\n \n(56.3 per million doses of \nmRNA-1273 )\n\nhttps://www.medrxiv.org/content/10.1101/2022.02.25.22271454v1", "link": "https://www.youtube.com/watch?v=TWPXRRVsAGk", "date_published": "2022-03-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]