{"entries": [{"source": "https://feeds.feedburner.com/TheHackersNews", "link": "https://thehackernews.com/2022/12/trojanized-windows-10-installer-used-in.html", "title": "Trojanized Windows 10 Installer Used in Cyberattacks Against Ukrainian Government Entities", "date_published": "2022-12-16 14:00:00+00:00", "description": "Government entities in Ukraine have been breached as part of a new campaign that leveraged trojanized versions of Windows 10 installer files to conduct post-exploitation activities.\nMandiant, which discovered the supply chain attack around mid-July 2022, said the malicious ISO files were distributed via Ukrainian- and Russian-language Torrent websites. It's tracking the threat cluster as UNC4166", "persistent": false}, {"source": "https://feeds.feedburner.com/TheHackersNews", "link": "https://thehackernews.com/2022/12/ex-twitter-employee-gets-35-years-jail.html", "title": "Ex-Twitter employee Gets 3.5 Years Jail for Spying on Behalf of Saudi Arabia", "date_published": "2022-12-16 13:08:00+00:00", "description": "A former Twitter employee who was found guilty of spying on behalf of Saudi Arabia by sharing data pertaining to specific individuals has been sentenced to three-and-a-half years in prison.\nAhmad Abouammo, 45, was convicted earlier this August on various criminal counts, including money laundering, fraud, falsifying records, and being an illegal agent of a foreign government.\nAbouammo was", "persistent": true}, {"source": "https://feeds.feedburner.com/TheHackersNews", "link": "https://thehackernews.com/2022/12/cyber-security-is-not-losing-game-if.html", "title": "Cyber Security Is Not a Losing Game – If You Start Right Now", "date_published": "2022-12-16 12:46:00+00:00", "description": "Reality has a way of asserting itself, irrespective of any personal or commercial choices we make, good or bad. For example, just recently, the city services of Antwerp in Belgium were the victim of a highly disruptive cyberattack. \nAs usual, everyone cried \"foul play\" and suggested that proper cybersecurity measures should have been in place. And again, as usual, it all happens a bit too late.", "persistent": false}, {"source": "https://feeds.feedburner.com/TheHackersNews", "link": "https://thehackernews.com/2022/12/github-announces-free-secret-scanning.html", "title": "GitHub Announces Free Secret Scanning for All Public Repositories", "date_published": "2022-12-16 12:24:00+00:00", "description": "GitHub on Thursday said it is making available its secret scanning service to all public repositories on the code hosting platform for free.\n\"Secret scanning alerts notify you directly about leaked secrets in your code,\" the company said, adding it's expected to complete the rollout by the end of January 2023. \nSecret scanning is designed to examine repositories for access tokens, private keys,", "persistent": false}, {"source": "https://feeds.feedburner.com/TheHackersNews", "link": "https://thehackernews.com/2022/12/goodbye-sha-1-nist-retires-27-year-old.html", "title": "Goodbye SHA-1: NIST Retires 27-Year-Old Widely Used Cryptographic Algorithm", "date_published": "2022-12-16 07:39:00+00:00", "description": "The U.S. National Institute of Standards and Technology (NIST), an agency within the Department of Commerce, announced Thursday that it's formally retiring the SHA-1 cryptographic algorithm.\nSHA-1, short for Secure Hash Algorithm 1, is a 27-year-old hash function used in cryptography and has since been deemed broken owing to the risk of collision attacks.\nWhile hashes are designed to be", "persistent": false}, {"source": "https://feeds.feedburner.com/TheHackersNews", "link": "https://thehackernews.com/2022/12/minecraft-servers-under-attack.html", "title": "Minecraft Servers Under Attack: Microsoft Warns About Cross-Platform DDoS Botnet", "date_published": "2022-12-16 07:10:00+00:00", "description": "Microsoft on Thursday flagged a cross-platform botnet that's primarily designed to launch distributed denial-of-service (DDoS) attacks against private Minecraft servers.\nCalled MCCrash, the botnet is characterized by a unique spreading mechanism that allows it to propagate to Linux-based devices despite originating from malicious software downloads on Windows hosts.\n\"The botnet spreads by", "persistent": false}, {"source": "https://feeds.feedburner.com/TheHackersNews", "link": "https://thehackernews.com/2022/12/cisa-alert-veeam-backup-and-replication.html", "title": "CISA Alert: Veeam Backup and Replication Vulnerabilities Being Exploited in Attacks", "date_published": "2022-12-16 05:45:00+00:00", "description": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added two vulnerabilities impacting Veeam Backup & Replication software to its Known Exploited Vulnerabilities (KEV) Catalog, citing evidence of active exploitation in the wild.\nThe now-patched critical flaws, tracked as CVE-2022-26500 and CVE-2022-26501, are both rated 9.8 on the CVSS scoring system, and could be leveraged to", "persistent": false}], "source url": "https://feeds.feedburner.com/TheHackersNews", "source title": "The Hacker News"}