{"entries": [{"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/weve-got-to-stand-up-for-it-on-both-sides-megyn-kelly-calls-on-musk-to-reinstate-suspended-reporters", "title": "‘We’ve Got To Stand Up For It On Both Sides’: Megyn Kelly Calls On Musk To Reinstate Suspended Reporters", "date_published": "2022-12-16 22:59:45+00:00", "description": "Megyn Kelly called on Elon Musk to reinstate suspended reporters he said had violated a rule after posting information about the &#8220;exact real-time location&#8221; of his private jet and said that people should stand up for free speech &#8220;on both sides.&#8221; During Sirius XM&#8217;s &#8220;The Megyn Kelly Show&#8221; podcast, the host was speaking with Stanford ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/cambridge-dictionary-defines-woman-as-not-a-woman", "title": "Cambridge Dictionary Defines Woman As Not A Woman", "date_published": "2022-12-16 21:36:18+00:00", "description": "The following is the opening satirical monologue from &#8220;The Andrew Klavan Show.&#8221; The Cambridge Dictionary has changed the definition of the word woman to include, [quote] “an adult who lives and identifies as female though they may have been said to have a different sex at birth.” [unquote] Now, I know what you’re thinking. You’re ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/hollywood-a-lister-claims-male-directors-throw-the-biggest-hissy-fits", "title": "Hollywood A-Lister Claims Male Directors Throw ‘The Biggest Hissy Fits’", "date_published": "2022-12-16 20:55:08+00:00", "description": "Oscar-winning actress Jennifer Lawrence claimed during a panel discussion that male directors often threw &#8220;the biggest hissy fits&#8221; on set, pushing back against the idea that women were more likely to let their emotions distract them from the job at hand. Lawrence joined a Hollywood Reporter roundtable discussion that also included Danielle Deadwyler, Michelle Yeoh, Michelle Williams, ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/house-democrats-move-to-bar-trump-from-office", "title": "House Democrats Move To Bar Trump From Office", "date_published": "2022-12-16 20:21:19+00:00", "description": "Dozens of House Democrats lined up behind legislation that would bar former President Donald Trump from holding office again. The bill, introduced Thursday by Rep. David Cicilline (D-RI), aims to use Section 3 of the Fourteenth Amendment to get the job done, accusing Trump of orchestrating an insurrection with the Capitol riot on January 6, ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/journalist-that-elon-musk-gave-twitter-files-to-calls-him-out-he-shreds-her-with-responses", "title": "Journalist That Elon Musk Gave ‘Twitter Files’ To Calls Him Out, He Shreds Her With Responses", "date_published": "2022-12-16 20:03:23+00:00", "description": "Twitter CEO Elon Musk slammed Bari Weiss on Friday afternoon after she called out his decision to suspend several journalists that had shared information about the location of his private jet. The suspensions came after Musk announced a new policy change Wednesday after an incident happened involving his child. Accounts that were suspended included left-wing ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/fbi-responds-to-latest-release-of-the-twitter-files", "title": "FBI Responds To Latest Release Of ‘The Twitter Files’", "date_published": "2022-12-16 19:27:14+00:00", "description": "The FBI released a statement Friday evening in response to the newest release of &#8220;The Twitter Files&#8221; which showed that federal law enforcement officials were regularly flagging content for Twitter to take action against. Journalist Matt Taibbi said that between January 2020 and November 2022, then-Twitter Senior Director of Trust &amp; Safety Yoel Roth had ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/its-ugly-its-not-pretty-dahmer-series-creator-says-he-disagrees-lgbtq-series-movies-should-be-about-uplifting-themes", "title": "‘It’s Ugly. It’s Not Pretty’: ‘Dahmer’ Series Creator Says He Disagrees LGBTQ Series/Movies Should Be About Uplifting Themes", "date_published": "2022-12-16 19:18:13+00:00", "description": "&#8220;Dahmer&#8221; series creator Ryan Murphy said he disagreed with the idea that LGBTQ series/movies should be about uplifting topics in response to a backlash over his initial inclusion of the L.G.B.T.Q. tag on his show. Murphy, who created the hit Netflix series about serial murderer Jeffrey Dahmer, told Variety he understood why people weren’t happy ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/you-absolute-drama-queens-dana-loesch-takes-axios-apart-for-attack-on-elon-musk", "title": "‘You Absolute Drama Queens’: Dana Loesch Takes Axios Apart For Attack On Elon Musk", "date_published": "2022-12-16 18:31:34+00:00", "description": "Nationally syndicated radio host Dana Loesch unloaded on Axios on Friday after the outlet accused Twitter owner Elon Musk of taking &#8220;unprecedented&#8221; action to ban journalists who shared real time tracking data revealing his location. Musk stated that such real-time doxxing was akin to posting &#8220;assassination coordinates&#8221; — and as such would not be tolerated. ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/disgraced-non-binary-biden-official-helped-create-school-policy-to-hide-childrens-gender-changes-from-parents", "title": "Disgraced Non-Binary Biden Official Helped Create School Policy To Hide Children’s Gender Changes From Parents", "date_published": "2022-12-16 18:20:33+00:00", "description": "Sam Brinton, the disgraced non-binary Biden administration nuclear energy official who was arrested for stealing women&#8217;s luggage at airports, previously helped create a school policy that encourages hiding children&#8217;s gender changes from parents. Brinton attracted attention for being one of the federal government&#8217;s first non-binary officials, but he was fired this week from the Office of ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/jake-tapper-reveals-the-misdiagnosis-that-could-have-killed-his-daughter", "title": "Jake Tapper Reveals The Misdiagnosis That Could Have Killed His Daughter", "date_published": "2022-12-16 18:01:15+00:00", "description": "CNN anchor Jake Tapper choked up when he revealed the misdiagnosis that could have killed his teenaged daughter Alice, saying that the access he had to resources as a journalist may have been what ultimately helped her get the right care. Alice Tapper, 15, was diagnosed with a viral infection when she actually had appendicitis. ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/thanks-to-cnn-you-can-watch-pelosi-and-schumer-scarf-down-chinese-food-and-slurp-some-soup", "title": "Thanks To CNN, You Can Watch Pelosi And Schumer Scarf Down Chinese Food And Slurp Some Soup", "date_published": "2022-12-16 17:38:40+00:00", "description": "Have you ever seen a bunch of freeloaders eat a meal? They tend to wolf it down so quickly that you have to wonder whether they even taste the food. If you&#8217;re confused, then you&#8217;re probably a mooch yourself. Or, you just might be Speaker of the House Nancy Pelosi (D-CA) and Senate Majority Leader Chuck ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/friday-afternoon-update-jan-6-committee-comes-to-a-close-russia-warns-u-s-georgia-bans-tiktok-for-state-devices", "title": "Friday Afternoon Update: Jan. 6 Committee Comes To A Close, Russia Warns U.S., Georgia Bans TikTok For State Devices", "date_published": "2022-12-16 17:30:12+00:00", "description": "This article is a companion piece to today’s Morning Wire Afternoon Update. To listen to the podcast version, click here. January 6 Committee&#8217;s Final Meeting Monday The House committee investigating the Capitol riot will hold its final meeting Monday, wrapping up its year-and-a-half-long inquiry by asking the Justice Department to investigate potential crimes. The committee of ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/pennsylvania-county-set-to-perform-2020-election-recount-next-year", "title": "Pennsylvania County Set To Perform 2020 Election Recount Next Year", "date_published": "2022-12-16 17:22:50+00:00", "description": "More than than two years after the 2020 general election, a hand recount of paper ballots in two races in that contest — in one Pennsylvania county — is scheduled to take place next year. Up to 40 employees of Lycoming County will go through nearly 60,000 ballots, examining the races for president and state ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/report-students-threatened-with-suspension-if-they-take-photos-of-trans-shop-teacher-with-enormous-fake-breasts", "title": "Report: Students ‘Threatened With Suspension’ If They Take Photos Of Trans Shop Teacher With Enormous Fake Breasts", "date_published": "2022-12-16 17:22:31+00:00", "description": "Students in Canada have reportedly been &#8220;threatened with suspension&#8221; if they take photos of a biologically male shop teacher who wears enormous fetish breast prosthetics while teaching children. The Halton District School Board (HDSB) has said the biologically male teacher, Kayla Lemieux, can wear the insanely large fetish breasts with giant protruding nipples with no ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/breaking-new-twitter-files-shows-how-federal-state-governments-monitor-americans-social-media-posts", "title": "BREAKING: New ‘Twitter Files’ Shows How Federal, State Governments Monitor Americans’ Social Media Posts", "date_published": "2022-12-16 17:10:25+00:00", "description": "A new drop in &#8220;The Twitter Files&#8221; series Friday afternoon shows that federal law enforcement officials were working in close contact with employees at Twitter to censor content. Journalist Matt Taibbi said that between January 2020 and November 2022, then-Twitter Senior Director of Trust &amp; Safety Yoel Roth had exchanged more than 150 emails with ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/chris-cuomo-hosts-first-national-news-coverage-of-detransitioners", "title": "Chris Cuomo Hosts First National News Coverage Of Detransitioners", "date_published": "2022-12-16 16:43:34+00:00", "description": "Former CNN host Chris Cuomo hosted the first national news coverage on &#8220;transgender youth&#8221; that predominately featured detransitioners.  Cuomo, host of &#8220;CUOMO&#8221; on NewsNation, held &#8220;a special hour on treating transgender youth&#8221; on Thursday night that highlighted the stories of three detransitioned young women and three doctors who believe the medicalization of trans-identified minors needs ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/internet-sleuths-i-need-help-who-is-brandan-roneel", "title": "Internet Sleuths, I Need Help — Who Is Brandan Roneel?", "date_published": "2022-12-16 16:43:04+00:00", "description": "I need your help figuring out a mystery. A few years ago, my husband and I had dinner with a man who never existed.  At least, we don’t think he existed. That evening has haunted me ever since and I am still searching for answers. I am finally ready to open up about what happened ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/nbc-senior-reporter-suspended-from-elon-musk-coverage-over-mocking-tweets", "title": "NBC Senior Reporter Suspended From Elon Musk Coverage Over Mocking Tweets", "date_published": "2022-12-16 15:54:44+00:00", "description": "NBC News has temporarily barred one of its senior reporters, Ben Collins, from appearing on its airwaves to report on Elon Musk. The temporary suspension, which covers both NBC and MSNBC, was instated because of Collins’ activity on the social media platform Twitter. Collins, who covers disinformation and extremism on the internet, violated NBC News’ ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/new-barbie-trailer-parodies-stanley-kubricks-2001-a-space-odyssey-intro", "title": "New ‘Barbie’ Trailer Parodies Stanley Kubrick’s ‘2001: A Space Odyssey’ Intro", "date_published": "2022-12-16 15:33:57+00:00", "description": "Fans were excited to see the new teaser trailer for the “Barbie” movie, which stars Margot Robbie and Ryan Gosling in the lead roles, from Warner Bros. A first look at director Greta Gerwig’s highly anticipated film debuted Friday and is already making waves on social media. Viewers immediately noticed that the short clip was ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/kate-middleton-cracks-joke-when-asked-if-she-would-be-performing-solo-at-christmas-concert", "title": "Kate Middleton Cracks Joke When Asked If She Would Be Performing Solo At Christmas Concert", "date_published": "2022-12-16 15:31:12+00:00", "description": "Kate Middleton cracked a joke about herself when asked if she would be performing a solo at this year&#8217;s Christmas concert after she previously showed off her piano skills last holiday season. During the annual Christmas Carol Concert at Westminster Abbey on Thursday, the Princess of Wales reportedly was overheard telling performer Alfie Boe that ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/britney-spears-husband-makes-clear-he-wished-singer-didnt-share-topless-and-nude-shots", "title": "Britney Spears’ Husband Makes Clear He Wished Singer Didn’t Share Topless And Nude Shots", "date_published": "2022-12-16 15:02:51+00:00", "description": "Britney Spears&#8217; husband Sam Asghari has made it clear he wished his wife didn&#8217;t share topless and nude photos on her Instagram account. In a post on his Instagram Story, the 41-year-old singer&#8217;s husband shared that while the &#8220;Toxic&#8221; hitmaker has been &#8220;bullied&#8221; for posting photos, he would prefer she not share intimate images, Page ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/twitter-files-journalist-matt-taibbi-confirms-platforms-supreme-court-had-ben-shapiro-in-its-sights", "title": "‘Twitter Files’ Journalist Matt Taibbi Confirms Platform’s ‘Supreme Court’ Had Ben Shapiro In Its Sights", "date_published": "2022-12-16 14:52:38+00:00", "description": "Journalist Matt Taibbi, who is playing a lead role in exposing Twitter&#8217;s prior censorship regime, told Daily Wire Editor Emeritus Ben Shapiro Friday that the platform&#8217;s top content cops did indeed actively discuss suppressing him. Multiple installments of the &#8220;Twitter Files,&#8221; a set of internal documents Twitter CEO Elon Musk recently provided to Taibbi and others handpicked ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/why-dave-chappelle-is-the-id-of-the-american-left", "title": "Why Dave Chappelle Is The ‘Id’ Of The American Left", "date_published": "2022-12-16 14:49:23+00:00", "description": "There is something about Dave Chappelle. It is a quality of detachment that inspires great confidence in his audiences. It is largely because of this trust that Chappelle can venture into subject matter — such as race or the trans issue, even Donald Trump — that makes most celebrities send out apologetic press releases, without ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/pushback-starts-texas-legislator-offers-bill-to-stop-wokeness-on-campuses", "title": "Pushback Starts: Texas Legislator Offers Bill To Stop Wokeness On Campuses", "date_published": "2022-12-16 14:48:57+00:00", "description": "A bill from a Texas legislator is targeting the often one-sided leftist political viewpoints present in higher education institutions, demanding that DEI (diversity, equity, and inclusion) offices on campuses be banned. The bill, Texas H.B. 1006, states clearly that “each institution of higher education has the general responsibility to foster a diversity of viewpoints” and ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/slave-auction-nfl-vp-of-football-operations-reportedly-ripped-scouting-combine-at-league-meetings", "title": "‘Slave Auction’: NFL VP Of Football Operations Reportedly Ripped Scouting Combine At League Meetings", "date_published": "2022-12-16 13:31:11+00:00", "description": "The NFL’s executive vice president of football operations precipitated anger at league meetings this week by allegedly likening the NFL scouting combine, where college players perform so teams can judge whether they fit their needs, to a “slave auction.” Troy Vincent, who played in the NFL for 15 seasons and made the Pro Bowl five ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/nick-cannon-feels-guilt-juggling-quality-time-with-11-kids-im-just-spread-thin", "title": "Nick Cannon Feels ‘Guilt’ Juggling Quality Time With 11 Kids: ‘I’m Just Spread Thin’", "date_published": "2022-12-16 12:52:56+00:00", "description": "Nick Cannon just admitted that having 11, soon to be 12, children with multiple women has been a challenge to juggle. The 42-year-old rapper and TV host admitted to struggling with time management during a recent episode of Paramount+’s “The Checkup with Dr. David Agus.” “Being a father of multiple kids, it’s always the biggest ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/bostonians-of-the-year-marthas-vineyard-residents-win-prize-for-dealing-with-illegal-aliens-for-48-hours", "title": "‘Bostonians Of The Year’: Martha’s Vineyard Residents Win Prize For Dealing With Illegal Aliens For 48 Hours", "date_published": "2022-12-16 12:39:40+00:00", "description": "Remember when Martha&#8217;s Vineyard residents had to deal with illegal aliens for two days in September courtesy of one Governor Ron DeSantis (R-FL)? This was after Labor Day and &#8220;the season&#8221; was starting to slow down. Suddenly, 49 men, women, and children appeared on the island. None of these liberals had ever seen anything like ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/site-of-jesus-baptism-could-become-home-to-300-million-tourist-village", "title": "Site Of Jesus’ Baptism Could Become Home To $300 Million Tourist Village", "date_published": "2022-12-16 12:21:27+00:00", "description": "Two millennia ago, the people of Judea visited the Jordan River in droves as the voice of John the Baptist cried to them from the wilderness about the arrival of Jesus Christ. Today, that wilderness from which Jesus began his ministry could become the home of souvenir shops, botanical gardens, and boutique hotels. King Abdullah ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/5-left-wing-protesters-targeting-planned-georgia-police-center-charged-with-domestic-terrorism", "title": "5 Left-Wing Protesters Targeting Planned Georgia Police Center Charged With Domestic Terrorism", "date_published": "2022-12-16 12:02:59+00:00", "description": "Five Left-wing environmental protesters have been charged with domestic terrorism for allegedly targeting a planned $90 million police training center to be built on nearly 400 acres of the Weelaunee Forest. Some of the protesters were living in the nearby Weelaunee Forest; police reportedly found “explosive devices, gasoline, and road [flares]” in the area. One ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/national-archives-to-release-hundreds-of-emails-on-hunter-biden-unless-white-house-intervenes", "title": "National Archives To Release Hundreds Of Emails On Hunter Biden Unless White House Intervenes", "date_published": "2022-12-16 11:42:55+00:00", "description": "The National Archives and Records Administration (NARA) intends to release hundreds of emails referencing Hunter Biden and his foreign business deals unless stopped by the White House. NARA executive Susan Donius sent a letter to the White House late last month warning that the records agency is preparing to release emails in response to an ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/activists-rage-at-james-cameron-for-promoting-avatar-2-with-live-dolphin-show", "title": "Activists Rage At James Cameron For Promoting ‘Avatar 2’ With Live Dolphin Show", "date_published": "2022-12-16 11:30:06+00:00", "description": "Animal rights activists are out in force against director James Cameron for his decision to use live dolphins to promote his newly released movie “Avatar: The Way of Water.” Video from the press tour in Tokyo shows dolphins performing tricks in the water, including the marine mammals lifting two trainers into the air. The Canadian director ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/dark-chocolate-may-pose-health-hazard-report-says-many-bars-contain-levels-of-lead-cadmium", "title": "Dark Chocolate May Pose Health Hazard, Report Says. Many Bars Contain Levels Of Lead, Cadmium.", "date_published": "2022-12-16 11:14:41+00:00", "description": "A new report indicates that dark chocolate, often touted as a healthy food to add to your diet, may in fact contain elements dangerous to your health. Consumer Reports examined 28 different dark chocolate bars sold to consumers and found that every single one of them contained amounts of cadmium and lead. Children ingesting lead ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/sarah-michelle-gellar-recalls-extremely-toxic-male-set-from-earlier-in-her-career", "title": "Sarah Michelle Gellar Recalls ‘Extremely Toxic Male’ Set From Earlier In Her Career", "date_published": "2022-12-16 11:05:18+00:00", "description": "Actress Sarah Michelle Gellar made references to a “toxic” workplace environment from her past during a speech at The Wrap&#8217;s Power Women Summit in Los Angeles. The 45-year-old star didn’t specify what past set she was referring to during the speech but said it left a lasting impression on her. “For so long, I was ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/texas-judge-deals-stinging-defeat-to-biden-trumps-remain-in-mexico-program-must-stay", "title": "Texas Judge Deals Stinging Defeat To Biden: Trump’s ‘Remain In Mexico’ Program Must Stay", "date_published": "2022-12-16 10:56:36+00:00", "description": "A Texas federal judge dealt a stinging defeat to the Biden administration, ruling that they cannot terminate the Migrant Protection Protocols (MPP), also referred to as the “Remain in Mexico” program, that former President Trump implemented during his tenure. In June 2022, the Supreme Court ruled 5-4 that the Biden administration could end MPP, declaring ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/atomic-bomb-lab-studying-ways-to-combat-misinformation-including-covid-lab-leak-theory", "title": "Atomic Bomb Lab Studying Ways To ‘Combat’ ‘Misinformation’ Including COVID Lab-Leak Theory", "date_published": "2022-12-16 10:32:00+00:00", "description": "The federal laboratory that designed the atomic bomb has set its sights on Americans, funding a study intended to help authorities learn how to “combat” “misinformation”&#8211;including the “conspiracy theory” that COVID came from a lab.", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/youre-not-special-musk-crashes-journos-chat-after-twitter-doxxing-bans", "title": "‘You’re Not Special’: Musk Crashes Journos’ Chat After Twitter Doxxing Bans", "date_published": "2022-12-16 10:12:55+00:00", "description": "Elon Musk popped in on journalists complaining about his decision to ban some of their brethren for allegedly doxxing him and his family, and told the reporters they “aren’t special.” The journalists had convened in a Twitter Spaces chat after the Twitter boss had suspended the accounts of several high-profile reporters assigned to cover him. ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/do-college-bowl-games-matter-anymore", "title": "Do College Bowl Games Matter Anymore?", "date_published": "2022-12-16 09:57:44+00:00", "description": "As big businesses grow and evolve, it’s amazing how their priorities change. It’s no different in the big business arena of college football. It used to be, back in the day, that any bowl game was a reward for the team. It was a way to send the older players off with one more game ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/elizabeth-warren-and-kevin-oleary-clash-on-regulating-crypto", "title": "Elizabeth Warren And Kevin O’Leary Clash On Regulating Crypto", "date_published": "2022-12-16 08:43:00+00:00", "description": "Sen. Elizabeth Warren (D-MA) and celebrity investor Kevin O’Leary clashed during a Wednesday hearing of the Senate Banking Committee discussing new federal regulations on cryptocurrency following the collapse of digital asset exchange FTX. The company filed for bankruptcy last month after users learned that the venture’s assets were commingled with sister firm Alameda Research; both ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/harvard-university-names-race-and-politics-professor-as-its-next-president", "title": "Harvard University Names ‘Race And Politics’ Professor As Its Next President", "date_published": "2022-12-16 08:22:39+00:00", "description": "Harvard University government professor Claudine Gay will serve as the prestigious school’s first black president and second female president. The news comes six months after current Harvard President Lawrence Bacow announced that he would retire sometime next year. Gay is scheduled to assume the leadership role of the nearly 400-year-old school on July 1, according ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/massive-264000-gallon-cylindrical-tropical-aquarium-explodes-inside-berlin-hotel", "title": "Massive 264,000-Gallon Cylindrical Tropical Aquarium Explodes Inside Berlin Hotel", "date_published": "2022-12-16 07:54:19+00:00", "description": "A massive aquarium exploded inside a hotel in Berlin, Germany, on Friday morning, killing hundreds of tropical fish and destroying everything within a small radius, including objects outside the hotel. The 264,000-gallon tank was approximately 82 feet tall, was home to 1,500 fish from more than 100 species (some reports have said as high as ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/video-shows-f-35-strike-fighter-crashing-into-ground-in-texas-pilot-ejecting-from-plane", "title": "Video Shows F-35 Strike Fighter Crashing Into Ground In Texas, Pilot Ejecting From Plane", "date_published": "2022-12-16 07:28:49+00:00", "description": "An F-35B Lighting II Joint Strike Fighter crashed into the ground in Texas on Thursday at Naval Air Station Joint Reserve Base Fort Worth. &#8220;We are aware of the F-35B crash on the shared runway at Naval Air Station Joint Reserve Base in Fort Worth and understand that the pilot ejected successfully,&#8221; Lockheed Martin said ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/but-theyre-wrong-michael-knowles-talks-speech-and-censorship-on-timcast", "title": "‘But They’re Wrong’: Michael Knowles Talks Speech And Censorship On Timcast", "date_published": "2022-12-16 00:13:46+00:00", "description": "Daily Wire host Michael Knowles opened an appearance on the Timcast IRL podcast wearing a black face-mask reminiscent of the one worn by Kanye West in his now infamous interview with Alex Jones, kicking off a two hour discussion about censorship and the foundational structure of society. After removing the “$4 Amazon” mask and slamming ...", "persistent": false}], "source url": "https://www.dailywire.com/feeds/rss.xml", "source title": "Daily Wire"}