[{"source": "https://www.theguardian.com/international/rss", "title": "Beau Greaves denied by William O’Connor on her PDC world darts debut", "description": "<ul><li>Teenager lands two big checkouts but loses 3-0 in first round</li><li>Michael Smith beats Nathan Rafferty without losing a leg</li></ul><p>Beau Greaves’ highly-anticipated debut at the PDC world championship ended in a hard-fought defeat to William O’Connor at London’s Alexandra Palace.</p><p>The 18-year-old Greaves, currently ranked second on the women’s order of merit, is one of the sport’s rising stars but was the underdog against her Irish opponent, ranked 36th in the world and making his sixth consecutive Ally Pally appearance. Greaves started in breathtaking fashion, however, taking the first leg with a 120 checkout.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/16/pdc-world-darts-championship-beau-greaves-william-oconnor-michael-smith\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/dec/16/pdc-world-darts-championship-beau-greaves-william-oconnor-michael-smith", "date_published": "2022-12-16 23:13:07+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "US investigators were allowed access to Trump allies’ emails", "description": "<p>Justice department was granted access to emails from former employees and loyalists</p><p>Federal investigators have been scrutinizing emails between lawyers for Donald Trump and a loyalist Republican congressman for months, it emerged on Friday, casting new light on the direction of the criminal inquiry into the former president’s alleged insurrection efforts.</p><p>Beryl Howell, the US district court chief judge, <a href=\"https://www.dcd.uscourts.gov/sites/dcd/files/ECF%20No.%2032_Order%2022gj28.pdf\">granted a request</a> from the justice department to unseal an order she made in June.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/16/trump-emails-justice-department\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/16/trump-emails-justice-department", "date_published": "2022-12-16 22:11:40+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Emma Raducanu reportedly finds new coach in Germany’s Sebastian Sachs", "description": "<ul><li>British No 1 thought to be working with Sachs on trial basis</li><li>Raducanu returns from injury with narrow loss to Ons Jabeur</li></ul><p>Emma Raducanu has begun working with a new coach as she prepares for the 2023 season, joining forces with the former German player Sebastian Sachs, according to reports.</p><p>Sachs is thought to be working with the British No 1 on a trial basis and would be Raducanu’s fifth coach in under two years. The 30-year-old only had a brief playing career on the Futures tour but has impressed as a coach, guiding Belinda Bencic to Olympic gold in Tokyo last year.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/16/emma-raducanu-tennis-new-coach-sebastian-sachs-reports\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/dec/16/emma-raducanu-tennis-new-coach-sebastian-sachs-reports", "date_published": "2022-12-16 21:34:20+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘Several hundred’ UFO reports received by Pentagon’s new tracking office", "description": "<p>All-domain Anomaly Resolution Office was set up to track unidentified objects in the sky, underwater or in space</p><p>A new Pentagon office set up to track reports of <a href=\"https://www.theguardian.com/world/ufos\">unidentified flying objects</a> has received “several hundred” of new reports, but no evidence so far of alien life, the agency’s leadership has told reporters.</p><p>The All-domain Anomaly Resolution Office (AARO) was <a href=\"https://www.defense.gov/News/Releases/Release/Article/3100053/dod-announces-the-establishment-of-the-all-domain-anomaly-resolution-office/\">set up in July</a> and is responsible for not only tracking unidentified objects in the sky, but also underwater or in space – or potentially an object that has the ability to move from one domain to the next.</p> <a href=\"https://www.theguardian.com/world/2022/dec/16/several-hundred-ufo-reports-received-by-pentagon-new-tracking-office\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/16/several-hundred-ufo-reports-received-by-pentagon-new-tracking-office", "date_published": "2022-12-16 21:23:52+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Mexico news anchor survives shooting amid surge in violence against journalists", "description": "<p>Ciro Gómez Leyva was unharmed when an attacker fired at his car, but 42 journalists have been killed during Amlo’s term</p><p>One of Mexico’s most prominent news anchors has survived an apparent assassination attempt near his home in the capital, in one of the most brazen attacks against a journalist the country has seen in recent decades.</p><p>Ciro Gómez Leyva, a news anchor for the national news network, Grupo Imagen, was driving a bulletproof SUV when the pillion rider on a motorcycle opened fire on him late on Thursday.</p> <a href=\"https://www.theguardian.com/world/2022/dec/16/mexico-news-anchor-shooting-ciro-gomez-leyva-journalist\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/16/mexico-news-anchor-shooting-ciro-gomez-leyva-journalist", "date_published": "2022-12-16 20:25:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "The week around the world in 20 pictures", "description": "<p>Power cuts in Kyiv, clashes in Lima, a Christmas tree in the ruins of Aleppo and Harry Kane dejected at the World Cup – the most striking images this week</p> <a href=\"https://www.theguardian.com/artanddesign/gallery/2022/dec/16/the-week-around-the-world-in-20-pictures\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/gallery/2022/dec/16/the-week-around-the-world-in-20-pictures", "date_published": "2022-12-16 20:16:59+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Chelsea ease past Vllaznia and into Women’s Champions League last eight", "description": "<p></p><p>Chelsea became the second English club to advance to the Champions League knockout stage, <a href=\"https://www.theguardian.com/football/2022/dec/15/arsenal-through-despite-lyon-loss-but-wait-anxiously-on-miedema-injury\">joining Arsenal</a> in securing a quarter-final place. A comfortable 4-0 victory over Vllaznia in Albania saw Emma Hayes’ side qualify with a game to spare. First half goals from Sophie Ingle and Fran Kirby set the tone before a late header from Katerina Svitkova and Maren Mjelde’s injury-time penalty rounded off the scoring.</p><p>A frustrating <a href=\"https://www.theguardian.com/football/2022/dec/08/real-madrid-chelsea-womens-champions-league-match-report\">draw away to Real Madrid</a> a week ago had ensured the Blues needed a result in Shkoder to progress. Nevertheless, Chelsea came into this encounter as clear favourites, having lost just once in their last ten European games. Their dominance against the same opponent was evident in October when they <a href=\"https://www.theguardian.com/football/2022/oct/26/chelsea-vllaznia-womens-champions-league-match-report\">put eight past them</a> at Kingsmeadow.</p> <a href=\"https://www.theguardian.com/football/2022/dec/16/vllaznia-chelsea-womens-champions-league-match-report\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/16/vllaznia-chelsea-womens-champions-league-match-report", "date_published": "2022-12-16 20:07:39+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "As Qatar’s World Cup ends it is time for truth: Fifa chose death and suffering", "description": "<p>Fifa had options in 2010 and from the moment it made its bid decision there was only one route from there to here</p><p>It was a different Gianni Infantino, a more pensive Gianni Infantino, a less alarmingly excited Gianni Infantino who addressed Hall 1 at the Qatar National Convention Centre on Friday morning.</p><p>This had been the scene of Infantino’s own defining moment just a month ago, his sacking of the temple, his Woodstock, his I have (a Very Peculiar) Dream. Brusquely late, Infantino was all business this time. “I am … happy … to be here,” he kicked off in a descending tone as though announcing the imminent execution of a colony of wasps. “Has this World Cup been a massive success?” he was asked from the floor. No, Gianni demurred very sightly. It had, in fact, been “an incredible success”.</p> <a href=\"https://www.theguardian.com/football/2022/dec/16/as-qatars-world-cup-ends-it-is-time-for-truth-fifa-chose-death-and-suffering\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/16/as-qatars-world-cup-ends-it-is-time-for-truth-fifa-chose-death-and-suffering", "date_published": "2022-12-16 20:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Messi v Mbappé: World’s finest primed to fight over biggest prize in football", "description": "<p>While Argentina’s genius targets a successful swansong, his club teammate’s talent could help France retain the World Cup</p><p>After Sunday night, Lusail Stadium will turn into something else. The precise nature of its repurposing is vague: “civic facilities” including homes, shops and health clinics are among the proposals, although that will require populating an area whose eeriness strikes hardest on those days when World Cup crowds’ attentions lie elsewhere. But a legend has been built so perhaps they will come.</p><p>Qatar and its flagship venue have the showpiece they craved and demanded: this will for ever be the arena of <a href=\"https://www.theguardian.com/football/2022/dec/15/france-plot-new-plan-to-stop-lionel-messi-after-kantes-2018-masterclass\">Lionel Messi</a> against <a href=\"https://www.theguardian.com/football/2022/dec/09/project-mbappe-the-making-of-frances-football-superstar\">Kylian Mbappé</a>, two different yet markedly similar versions of football’s present, the world’s best forwards wrestling for a hat-trick of garlands. The story transcends physical structures, edifices, the existence of the pitch on which it will have taken place. It will stay told in the air.</p> <a href=\"https://www.theguardian.com/football/2022/dec/16/messi-v-mbappe-world-cup-argentina-france-final-preview\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/16/messi-v-mbappe-world-cup-argentina-france-final-preview", "date_published": "2022-12-16 20:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Exclusive: January 6 panel considering Trump referral to justice department for obstruction of Congress", "description": "<p>Subcommittee recommended Trump could also be referred for conspiracy to defraud the United States, sources say</p><p>The House January 6 select committee is considering a criminal referral to the justice department against <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> for obstruction of an official proceeding of Congress and conspiracy to defraud the United States on the recommendation of a special subcommittee, according to sources familiar with the matter.</p><p>The recommendations on the former president – made by <a href=\"https://www.theguardian.com/us-news/2022/nov/17/january-6-subcommittee-capitol-attack-criminal-referrals\">the subcommittee examining referrals</a> – were based on renewed examinations of the evidence that indicated Trump’s attempts to impede the certification of the 2020 election results amounted to potential crimes.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/16/trump-jan-6-panel-obstruction-congress-justice-department\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/16/trump-jan-6-panel-obstruction-congress-justice-department", "date_published": "2022-12-16 19:51:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Jane Fonda says cancer is in remission, three months after revealing diagnosis", "description": "<p>The actor described feeling ‘blessed’ to cease chemotherapy treatments for non-Hodgkin’s lymphoma </p><p>Three months after revealing that she’d been diagnosed with non-Hodgkin’s lymphoma, <a href=\"https://www.theguardian.com/film/jane-fonda\">Jane Fonda</a>’s cancer is in remission, the US actor and activist has announced.</p><p>In a blog post headlined “<a href=\"https://www.janefonda.com/2022/12/best-birthday-present-ever/\">Best Birthday Present Ever</a>”, Fonda wrote that her oncologist had told her she could “discontinue” the chemotherapy treatments she had received for her illness.</p> <a href=\"https://www.theguardian.com/film/2022/dec/16/jane-fonda-cancer-remission-non-hodgkins-lymphoma\">Continue reading...</a>", "link": "https://www.theguardian.com/film/2022/dec/16/jane-fonda-cancer-remission-non-hodgkins-lymphoma", "date_published": "2022-12-16 19:20:17+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "France and Morocco resolve visa tensions after World Cup clash", "description": "<p>French foreign minister Catherine Colonna said the countries had returned to ‘full consular cooperation’ on visit to Rabat</p><p>France and Morocco have announced they were mending fences after months of tensions over visas, and said the French president, Emmanuel Macron, would visit the north African kingdom in early 2023.</p><p>Speaking in Rabat alongside her Moroccan counterpart Nasser Bourita, the French foreign minister, Catherine Colonna, said it was time to “write a new page together”.</p> <a href=\"https://www.theguardian.com/world/2022/dec/16/france-and-morocco-resolve-visa-tensions-after-world-cup-clash\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/16/france-and-morocco-resolve-visa-tensions-after-world-cup-clash", "date_published": "2022-12-16 19:12:37+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "More than 1 in 10 species could be lost by end of century, study warns", "description": "<p>Modelling shows that if  we continue on current trajectory, global heating will drive a cascade of extinctions in plants and animals</p><p>Earth could lose more than a tenth of its plant and animal species by the end of the century on current trends, according to new research which comes as nearly 3,000 scientists call for action from governments to stop the destruction of nature in the final days of negotiations at Cop15.</p><p>The climate crisis will drive an accelerating cascade of extinctions in the coming decades, as predators lose their prey, parasites lose their hosts, and temperature rises fracture Earth’s web of life, according to the researchers, who warn of the risk of co-extinctions in <a href=\"https://www.science.org/doi/10.1126/sciadv.abn4345\">a paper</a> published on Friday in Science Advances.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/16/more-than-1-in-10-species-could-be-lost-by-end-of-century-study-warns-aoe\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/dec/16/more-than-1-in-10-species-could-be-lost-by-end-of-century-study-warns-aoe", "date_published": "2022-12-16 19:00:02+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Teeth suggest ancestors of diplodocus may have eaten meat", "description": "<p>Analysis shows ‘earliest members of two main veggie dinosaur lineages were not exclusively herbivorous’</p><p>With its huge feet, long neck and penchant for plants, the diplodocus may be one of history’s biggest vegetarians. But research has revealed the sauropod’s ancestors may have had a taste for flesh.</p><p>Scientists studying the teeth of some of the earliest dinosaurs to roam the Earth say they have uncovered telltale clues as to what they ate.</p> <a href=\"https://www.theguardian.com/science/2022/dec/16/teeth-ancestors-of-diplodocus-eaten-meat-dinosaur-herbivore\">Continue reading...</a>", "link": "https://www.theguardian.com/science/2022/dec/16/teeth-ancestors-of-diplodocus-eaten-meat-dinosaur-herbivore", "date_published": "2022-12-16 19:00:02+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Courtney Lawes was not consulted over England decision to sack Eddie Jones", "description": "<ul><li>Lawes missed Eddie Jones’s final games in charge due to injury</li><li>‘I was quite surprised because it was so close to World Cup’</li></ul><p>Courtney Lawes has revealed he was not consulted by the Rugby Football Union over the <a href=\"https://www.theguardian.com/sport/2022/dec/06/eddie-jones-sacked-as-england-rugby-union-head-coach\" title=\"\">decision to sack Eddie Jones</a> and was not aware that any players had been, admitting he was shocked and saddened by the former head coach’s departure.</p><p>The 33-year-old captained England to their series victory in Australia over the summer and was set to continue in the role in the autumn until he suffered nerve damage in his neck. He was sorely missed with England recording just one win in four matches, ending the year with five victories from 12 Tests including <a href=\"https://www.theguardian.com/sport/2022/nov/27/rugby-union-defeat-by-south-africa-only-serves-to-highlight-deeper-problems-for-england\" title=\"\">the dreadful defeat by South Africa</a> to close the campaign.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/16/lawes-not-consulted-over-decision-to-sack-england-head-coach-jones\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/dec/16/lawes-not-consulted-over-decision-to-sack-england-head-coach-jones", "date_published": "2022-12-16 18:58:19+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Ministers warned cancer survival rates could fall due to NHS staff and pay crises", "description": "<p>Exclusive: head of Cancer Research UK says waiting lists for care could get even longer unless health service’s problems are fixed</p><p>Ministers risk cutting the survival chances of cancer patients and undoing two decades of progress in lowering death rates unless they tackle the NHS workforce crisis and resolve the pay row, the head of Britain’s biggest cancer charity has warned.</p><p>Although efforts have been made to prioritise cancer patients, Michelle Mitchell, the chief executive of Cancer Research UK, said the impact of next week’s planned <a href=\"https://www.theguardian.com/uk-news/video/2022/dec/16/nhs-nurses-on-strike-morale-has-hit-the-floor\">strikes by nurses</a> and ambulance workers would be cumulative and the NHS would find it “harder and harder” to prevent cancer patients dying early.</p> <a href=\"https://www.theguardian.com/society/2022/dec/16/ministers-warned-cancer-survival-rates-could-fall-due-to-nhs-staff-and-pay-crises\">Continue reading...</a>", "link": "https://www.theguardian.com/society/2022/dec/16/ministers-warned-cancer-survival-rates-could-fall-due-to-nhs-staff-and-pay-crises", "date_published": "2022-12-16 18:27:04+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Nasal flu vaccine may help protect children against strep A, study shows", "description": "<p>UKHSA pilot scheme shows strep A infections lower in areas where nasal vaccine offered to all young children</p><p>Giving children the nasal flu vaccine may help protect them against strep A, according to analysis by the UK Health Security Agency.</p><p>UKHSA data shows <a href=\"https://www.theguardian.com/society/2022/dec/15/strep-a-kills-three-more-children-as-uk-activates-new-medicines-plan\">at least 19 children have now died</a> as a result of strep A across the UK, while there are 7,750 cases of scarlet fever so far this season. This is more than treble the 2,538 cases reported during the same period over the last comparably high season – the winter of 2017-18.</p> <a href=\"https://www.theguardian.com/society/2022/dec/16/nasal-flu-vaccine-may-help-protect-children-against-strep-a-study-shows\">Continue reading...</a>", "link": "https://www.theguardian.com/society/2022/dec/16/nasal-flu-vaccine-may-help-protect-children-against-strep-a-study-shows", "date_published": "2022-12-16 18:25:12+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Twitter’s suspension of journalists sets ‘dangerous precedent’, UN warns", "description": "<p>Pressure grows on Elon Musk as EU says social media platform could face sanctions over suspensions</p><p>The United Nations is “very disturbed” by Twitter’s abrupt suspension of a <a href=\"https://www.theguardian.com/technology/2022/dec/15/twitter-suspends-accounts-journalists-musk\">group of US journalists</a>, a spokesperson has said, warning that the move sets a “dangerous precedent” – as the EU said the social media platform could fall foul of forthcoming legislation.</p><p> Stéphane Dujarric said on Friday the UN was “very disturbed” by the barring of prominent tech reporters at news organisations including <a href=\"https://www.cnn.com/2022/12/14/tech/elonjet-twitter-suspended/index.html\">CNN</a>, the <a href=\"https://www.washingtonpost.com/technology/2022/12/14/elonjet-twitter-suspension-jack-sweeney-talks/\">Washington Post</a> and the <a href=\"https://www.nytimes.com/2022/12/14/technology/twitter-private-jet-accounts-suspended.html\">New York Times</a> who have written about Musk and the tech company he owns.</p> <a href=\"https://www.theguardian.com/technology/2022/dec/16/twitter-elon-musk-suspension-journalists-sets-dangerous-precedent-un-warns\">Continue reading...</a>", "link": "https://www.theguardian.com/technology/2022/dec/16/twitter-elon-musk-suspension-journalists-sets-dangerous-precedent-un-warns", "date_published": "2022-12-16 18:07:32+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Anderson suggests England’s aggression can pose Australia problems in Ashes", "description": "<ul><li>‘I’m sure they’ll try to come back just as hard as they can’</li><li>Anderson sits out third Test in Pakistan with series won</li></ul><p>Jimmy Anderson fancies England’s new buccaneering approach under Ben Stokes and Brendon McCullum may force Australia to rethink their plans ahead of next summer’s much-anticipated Ashes series.</p><p>The 40-year-old has been rested for the third Test against Pakistan in Karachi that gets under way on Saturday, meaning his work for 2022 is done. His mark on this first tour of Pakistan for 17 years is inedible, however, claiming eight wickets at 18 runs apiece to secure <a href=\"https://www.theguardian.com/sport/2022/dec/12/cricket-pakistan-england-second-test-day-four-match-report\">England’s unassailable 2-0 lead</a> going into the finale.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/16/jimmy-anderson-suggests-england-aggression-can-pose-australia-problems-ashes-cricket\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/dec/16/jimmy-anderson-suggests-england-aggression-can-pose-australia-problems-ashes-cricket", "date_published": "2022-12-16 18:00:02+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘There was an explosion, and I had to close my eyes’: how TV left 12,000 children needing a doctor", "description": "<p>The Japanese government held an emergency meeting and share prices crashed after a Pokémon broadcast. For years, its effects went unexplained – until researchers started digging …</p><p>Twenty-five years ago, at precisely 6.51pm on 16 December 1997, hundreds of children across Japan experienced seizures. In total, 685 – 310 boys and 375 girls – were taken by ambulance to hospital. Within two days, 12,000 children had reported symptoms of illness. The common factor in this sudden mass outbreak was an unlikely culprit: an episode of the <a href=\"https://www.theguardian.com/games/pokemon\">Pokémon</a> cartoon series.</p><p>The instalment in question, Dennō Senshi Porygon (Electric Soldier Porygon), was the 38th<sup> </sup>in the Pokémon <a href=\"https://www.theguardian.com/culture/anime\">anime</a>’s first season – and initially, at least, it sparked a medical mystery. Twenty minutes into the cartoon, an explosion took place, illustrated by an animation technique known as paka paka, which broadcast alternating red and blue flashing lights at a rate of 12Hz for six seconds. Instantly, hundreds of children experienced photosensitive epileptic seizures – accounting for some, but far from all, of the hospitalisations.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/16/pokemon-explosion-tv-japan-children-hospital\">Continue reading...</a>", "link": "https://www.theguardian.com/tv-and-radio/2022/dec/16/pokemon-explosion-tv-japan-children-hospital", "date_published": "2022-12-16 18:00:02+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "What happened in the Russia-Ukraine war this week? Catch up with the must-read news and analysis", "description": "<p>Ukraine says Putin readying to launch major new offensive; inside the ‘Bakhmut meat grinder’; Zelenskiy’s greatest bargaining chip; Putin cancels year-end press conference</p><ul><li><a href=\"https://www.theguardian.com/world/ukraine\">See all our Ukraine war coverage</a></li></ul><p>Every week we wrap up the must-reads from our coverage of the <a href=\"https://www.theguardian.com/world/ukraine\">Ukraine</a> war, from news and features to analysis and opinion.</p> <a href=\"https://www.theguardian.com/world/2022/dec/17/what-happened-in-the-russia-ukraine-war-this-week-catch-up-with-the-must-read-news-and-analysis\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/17/what-happened-in-the-russia-ukraine-war-this-week-catch-up-with-the-must-read-news-and-analysis", "date_published": "2022-12-16 18:00:01+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Twitter’s rulebook in a nutshell: don’t annoy Elon Musk", "description": "<p>The site’s recent actions, such as banning critical journalists, appear to indicate policy is made on a whim</p><p>Facebook’s community standards is a sprawling document, broken down into six top-level categories and 24 subcategories, distinguishing between content that is allowed and that which requires extra context, replete with examples of breaches and justifications for its choices. It is treated with quasi-legalistic power by the company’s oversight board, which incorporates its own precedent, as well as international human rights standards, to occasionally overrule Facebook’s own moderation choices.</p><p>Twitter’s rulebook is simpler: don’t annoy Elon Musk.</p> <a href=\"https://www.theguardian.com/technology/2022/dec/16/twitter-rulebook-elon-musk-banning-journalists\">Continue reading...</a>", "link": "https://www.theguardian.com/technology/2022/dec/16/twitter-rulebook-elon-musk-banning-journalists", "date_published": "2022-12-16 17:56:58+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "King Charles dances with Anne Frank’s stepsister to celebrate Hanukah", "description": "<p>Monarch takes 93-year-old Eva Schloss for a twirl during visit to Jewish community centre in London</p><p>King Charles was put through his paces on the dancefloor as he took the stepsister of Holocaust victim Anne Frank for a twirl while visiting a Jewish community centre in north London.</p><p><a href=\"https://www.theguardian.com/lifeandstyle/2017/jan/21/eva-geiringer-schloss-auschwitz-holocaust-survivor-heinz-paintings\">Eva Schloss</a>, 93, who survived Nazi concentration camps and has spent decades promoting peace among humanity, partnered the king during a celebration of Hanukah.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/16/king-charles-dances-with-eva-schloss-anne-frank-stepsister-to-celebrate-hanukah\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/dec/16/king-charles-dances-with-eva-schloss-anne-frank-stepsister-to-celebrate-hanukah", "date_published": "2022-12-16 17:50:48+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Drums, tattoos and T-shirts: Argentina’s World Cup fan odyssey", "description": "<p>Guardian photographer Tom Jenkins has covered eight World Cups but even he has been surprised by the team’s level of support in Qatar</p><p>The passion of Argentina’s supporters has been one of this World Cup’s most memorable storylines. The atmosphere at their games has been electric and there is a religious feel to their fandom.</p><p>Even though a few images of the Pope pop up here and there, it’s more a devotion to the two messiahs of Argentinian football: Maradona and Messi. On the backs of replica Argentina shirts you don’t see any other names. Identical twins at the semi-final against Croatia were wearing T-shirts: one had Lionel Messi on the front, the other Diego Maradona. On flags, banners and headdresses you see mocked-up images showing Maradona handing a ball to Messi – as if imploring him to continue carrying the fight. I’ve seen Maradona-Messi tattoos on arms and legs.</p><p>Flags, tattoos and T-shirts all bearing the images of Diego Maradona and Lionel Messi.</p> <a href=\"https://www.theguardian.com/football/2022/dec/16/argentina-fans-world-cup-2022-picture-essay\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/16/argentina-fans-world-cup-2022-picture-essay", "date_published": "2022-12-16 17:49:40+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Newly released JFK documents unlikely to impact 1964 commission conclusion", "description": "<p>US National Archives releases 13,173 documents relating to official investigation into 1963 assassination </p><p>Historians and conspiracy theorists have been given an early Christmas present: the release from US National Archives of 13,173 documents relating to the official investigation into the 1963 assassination of President John F Kennedy.</p><p>From barely legible memos filled with the crabby handwriting of CIA agents, through reports on secret meetings with Russian diplomats, to painstaking detective work on the movements of Lee Harvey Oswald, the <a href=\"https://www.archives.gov/research/jfk/release2022\">trove of documents</a> will keep JFK assassination obsessives busy for months. Few expect bombshells among the pile, however.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/16/jfk-kennedy-assasination-new-documents-national-archive\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/16/jfk-kennedy-assasination-new-documents-national-archive", "date_published": "2022-12-16 17:41:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Vllaznia v Chelsea: Women’s Champions League – live", "description": "<ul><li>Updates from the 5.45pm GMT kick-off in Albania</li><li>You can contact Sarah <a href=\"mailto:sarah.rendell.casual@theguardian.com\">by mail</a> or <a href=\"https://twitter.com/rendellx\">Twitter</a> with your thoughts</li></ul><p><strong>Chelsea manager Emma Hayes is keen</strong> for her side not to under-estimate their opponents this evening. She said: “We have to expect they will have learned from their European journey and for us to be the top professionals that we are, to make sure we’re ready for the things they’ve worked on.”</p><p><strong>Chelsea only need a point this evening</strong> to secure their spot in the quarter-finals. If Real Madrid fail to beat Paris Saint-Germain, the other game in Chelsea’s group, then the Blues will go through even if Vllaznia defeat them.</p> <a href=\"https://www.theguardian.com/football/live/2022/dec/16/vllaznia-v-chelsea-womens-champions-league-live\">Continue reading...</a>", "link": "https://www.theguardian.com/football/live/2022/dec/16/vllaznia-v-chelsea-womens-champions-league-live", "date_published": "2022-12-16 17:40:10+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Ally of Wagner Group boss injured in CAR after ‘assassination attempt’", "description": "<p>Dmitry Sytii is under US sanctions for links with mercenary group founded by Yevgeny Prigozhin, who is close to Vladimir Putin</p><p>A Russian businessman believed to be a close ally of Yevgeny Prigozhin has been taken to hospital in Central African Republic after an “assassination attempt”, the RIA Novosti news agency has reported, citing the local Russian embassy.</p><p>Dmitry Sytii, who officially works as the head of the “Russian House” culture centre in CAR’s capital, Bangui, had <a href=\"https://home.treasury.gov/news/press-releases/sm1133\">sanctions imposed on him</a> by the US in September 2020 for his alleged links to Wagner Group, a private military group founded by Prigozhin that has deployed more than 1,000 fighters in the unstable country to fight rebels.</p> <a href=\"https://www.theguardian.com/world/2022/dec/16/dmitry-sytii-ally-of-wagner-boss-injured-in-car-after-assassination-attempt\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/16/dmitry-sytii-ally-of-wagner-boss-injured-in-car-after-assassination-attempt", "date_published": "2022-12-16 17:21:39+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Crude art: oil-filled trophy tackles Qatar World Cup controversies", "description": "<p>Work by Andrei Molodkin, a Russian-born conceptual artist, has a symbolic price of $150m</p><p>As the World Cup winners lift the golden trophy on Sunday evening, an alternative to the ultimate footballing achievement will highlight alleged corruption and reported human rights violations that have been a feature of the 2022 tournament hosted by Qatar.</p><p>A Russian-born conceptual artist has created a replica of the World Cup trophy that slowly fills with crude oil. It has a symbolic price of $150m – a figure that matches the amount of money allegedly spent on bribes and kickbacks to Fifa officials,<a href=\"https://www.theguardian.com/football/2015/may/27/fifa-officials-world-cup-fraud-us-prosecutors\"> according to US criminal investigators</a> in 2015.</p> <a href=\"https://www.theguardian.com/artanddesign/2022/dec/16/crude-art-oil-filled-trophy-tackles-qatar-world-cup-controversies\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/2022/dec/16/crude-art-oil-filled-trophy-tackles-qatar-world-cup-controversies", "date_published": "2022-12-16 17:14:01+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "A fortune’s coming home: how British PR firms won big representing Qatar", "description": "<p>Pushback on stories critical of the World Cup hosts has come from lobbyists and lawyers operating out of London</p><p>When British journalists were writing about the treatment of migrant workers building World Cup stadiums, they might have expected to receive a phone call from a Qatari based in Doha, pushing back on their accusations. Instead, newspapers found themselves being contacted by Britons such as George Pascoe-Watson, a former political editor of the Sun, challenging the premise of their story and offering a more pro-Qatari viewpoint.</p><p>Pascoe-Watson is a senior partner at Portland, a high-end London-based public relations and lobbying company founded by Tony Blair’s former adviser, Tim Allan. It is one of many British-based firms who have benefitted from spinning on behalf of the Qatari government ahead of the World Cup, pushing the Gulf nation’s case in the media, and arguing against negative coverage.</p> <a href=\"https://www.theguardian.com/football/2022/dec/16/how-british-pr-firms-won-big-representing-qatar-2022-world-cup\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/16/how-british-pr-firms-won-big-representing-qatar-2022-world-cup", "date_published": "2022-12-16 17:08:51+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Argentina v France: where the World Cup final could be won and lost", "description": "<p>Lionel Messi and Kylian Mbappé loom large but other tactical elements, including the role of Rodrigo De Paul, may be crucial</p><p>For better or for worse, this was always going to be the tournament of Lionel Messi. If he fails to win the World Cup, the shadow lies across his career, a sense of destiny unfulfilled. If he wins, it is a glorious culmination. So far, no side have really been able to stop him and there’s a sense that, paradoxically, it is harder to know how to combat him now as he does less in games. For long spells he is not involved; it would seem absurd to man-mark him as Louis van Gaal had Nigel de Jong do in the <a href=\"https://www.theguardian.com/football/2014/jul/09/argentina-holland-world-cup-semi-final-match-report\" title=\"\">2014 World Cup semi-final</a>; that would be to lose a player for the sake of three or four minutes in the game.</p> <a href=\"https://www.theguardian.com/football/2022/dec/16/argentina-v-france-where-the-world-cup-final-could-be-won-and-lost-messi-mbappe-de-paul\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/16/argentina-v-france-where-the-world-cup-final-could-be-won-and-lost-messi-mbappe-de-paul", "date_published": "2022-12-16 17:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘I feel swaddled, protected’: testing out Prada’s £700 white vest", "description": "<p>Vest enthusiast Simon Hattenstone runs the rule over designer tank top hailed as the item that defined 2022</p><p>Fancy paying £700 for a sleeveless vest? An undershirt? Or, if we want to get to the taboo nitty-gritty, a “wife beater”? Even on Prada’s terms, the Italian fashion brand for the ludicrously loaded is surely taking the sartorial piss here.</p><p>This Prada vest, which looks much like an ordinary vest, except a hundred times the price, was one of the most sought after items of the year. It is the third “hottest” item in Lyst’s autumn list, which monitors what people buy, Google and tag on social media, and British Vogue called it the item that defined 2022. It is sold out everywhere.</p> <a href=\"https://www.theguardian.com/fashion/2022/dec/16/testing-out-prada-white-vest-simon-hattenstone\">Continue reading...</a>", "link": "https://www.theguardian.com/fashion/2022/dec/16/testing-out-prada-white-vest-simon-hattenstone", "date_published": "2022-12-16 16:58:05+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Brittney Griner plans return to WNBA and thanks Biden on release from medical facility", "description": "<ul><li>Basketball star released from Russian detention last week</li><li>32-year-old aims to return to WNBA for new season</li></ul><p>Brittney Griner has left the Texas army facility where she was <a href=\"https://www.theguardian.com/sport/2022/dec/11/brittney-griner-political-fallout-over-prisoner-swap-continues\">undergoing physical and mental evaluation</a> following her release from 10 months of detention in Russia.</p><p>The basketball star had been staying at the Brooke Army Medical Center in San Antonio after US officials <a href=\"https://www.theguardian.com/us-news/2022/dec/08/brittney-griner-biden-russia-viktor-bout\">secured her freedom last week</a> in a prisoner exchange for Russian arms dealer Viktor Bout.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/16/brittney-griner-released-medical-facility-wnba-return-basketball\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/dec/16/brittney-griner-released-medical-facility-wnba-return-basketball", "date_published": "2022-12-16 16:55:29+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Harry and Meghan are still giving Britons what they really want from royalty: cruel spectacle | Jonathan Freedland", "description": "<p>You don’t have to be a fan of the couple to see that monarchy exacts too high a price – and abolition would do the Windsors a favour</p><p>They’re more royal than the royals. Detached they might be, but even in exile they are fulfilling their duties to the letter. For all their insistence that they had to break away from the system of monarchy, Harry and Meghan remain two of its most devoted servants. Because, for all the red-top fury aimed their way, they are doing the job from which they claimed to have “stepped back” exactly as it has been prescribed for generations. Indeed, they continue to provide the service Britons have been demanding from the Windsors for a century or more.</p><p>And what is that service? At its simplest, it is entertainment – or, perhaps more accurately, diversion. At a time when the news is full of bleak tidings – nurses paid so poorly they are compelled to strike, migrants and refugees risking death to cross an icy Channel, Russian missiles raining down on Ukraine – H&amp;M, as the couple call each other, have served up a welcome excuse to look the other way.</p><p>Jonathan Freedland is a Guardian columnist</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/16/harry-meghan-royalty-monarchy-abolition-windsors\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/dec/16/harry-meghan-royalty-monarchy-abolition-windsors", "date_published": "2022-12-16 16:42:39+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Amazon workers vote to strike at Coventry depot in UK first", "description": "<p>GMB union hails major victory as staff back stoppages over their demand for a pay rise to £15 an hour</p><p>Amazon workers at a vast depot in Coventry are poised to go on strike in the new year, demanding pay of £15 an hour, after securing a historic yes vote in a ballot for industrial action.</p><p>Members of the GMB union opted to hold a second ballot after narrowly missing the 50% turnout threshold earlier this year.</p> <a href=\"https://www.theguardian.com/technology/2022/dec/16/amazon-workers-vote-strike-coventry-depot-uk-first\">Continue reading...</a>", "link": "https://www.theguardian.com/technology/2022/dec/16/amazon-workers-vote-strike-coventry-depot-uk-first", "date_published": "2022-12-16 16:30:56+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Kevin Spacey attends London hearing by video link from the Middle East", "description": "<p>US actor is charged with seven sexual offences, bringing the total number of charges to 12</p><p>The Oscar-winning actor Kevin Spacey has appeared in a London court by video link facing seven sexual offence charges.</p><p>In a short hearing at Westminster magistrates court in London, the 63-year-old US actor appeared by video link from the Middle East and spoke only to confirm his name – Kevin Spacey Fowler – date of birth and address.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/16/kevin-spacey-attends-london-hearing-by-video-link-from-the-middle-east\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/dec/16/kevin-spacey-attends-london-hearing-by-video-link-from-the-middle-east", "date_published": "2022-12-16 16:28:25+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Watchdog orders suspension of two peers over ‘cash for parliamentary advice’", "description": "<p>Earl of Shrewsbury and Mary Goudie took thousands of pounds to help and promote firms, reports find</p><p>A House of Lords watchdog has ordered that two peers be suspended from the upper house for long periods for taking thousands of pounds to promote companies, in breach of parliamentary rules.</p><p>In two reports published on Friday, the House of Lords Conduct Committee recommended a suspension of nine months for the Earl of Shrewsbury, a former Conservative, now non-affiliated, hereditary peer, and six months for the Labour-appointed peer Mary Goudie.</p> <a href=\"https://www.theguardian.com/politics/2022/dec/16/watchdog-orders-suspension-of-two-peers-over-cash-for-parliamentary-advice\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/dec/16/watchdog-orders-suspension-of-two-peers-over-cash-for-parliamentary-advice", "date_published": "2022-12-16 16:22:31+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Varane, Konaté and Coman train apart as virus hits France World Cup final plan", "description": "<ul><li>France adopt social distancing and hand-washing measures</li><li>Tchouaméni and Theo Hernandez train indoors due to injuries</li></ul><p>Kingsley Coman, Ibrahima Konaté and Raphaël Varane trained away from the rest of the France squad as the defending champions tried to deal with a virus that has disrupted their preparations for Sunday’s World Cup final against Argentina.</p><p>France, who were without Coman, Dayot Upamecano and Adrien Rabiot because of illness during their <a href=\"https://www.theguardian.com/football/2022/dec/14/france-morocco-world-cup-semi-final-match-report\">semi-final win over Morocco</a>, have implemented hygiene measures in an attempt to ensure more players do not fall unwell.</p> <a href=\"https://www.theguardian.com/football/2022/dec/16/varane-konate-and-coman-train-apart-virus-france-world-cup-final\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/16/varane-konate-and-coman-train-apart-virus-france-world-cup-final", "date_published": "2022-12-16 16:17:40+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Almost 8,000 US shootings attributed to unseasonable heat – study", "description": "<p>Research suggests climate crisis may contribute to increased gun violence by pushing temperatures beyond normal ranges</p><p>Almost 8,000 shootings in US cities in recent years were attributable to unseasonably warm temperatures, according to a new study. The researchers said the work suggested the climate crisis could be contributing to increased gun violence by pushing temperatures beyond the normal ranges.</p><p>Shootings were already known to peak in summer, when people are outside more and when heat can increase aggression. But the new research took account of the season and showed that above average temperatures at any time of year increased the risk of shootings.</p> <a href=\"https://www.theguardian.com/world/2022/dec/16/almost-8000-us-shootings-attributed-to-unseasonable-heat-study\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/16/almost-8000-us-shootings-attributed-to-unseasonable-heat-study", "date_published": "2022-12-16 16:00:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Cocktail of the week: Hide and Fox’s hide and fizz – recipe", "description": "<p>A celebratory sparkler with tropical undertones</p><p>If you like sparkling wine-based cocktails, this one is definitely for you. Elegant, luxurious and great for festive parties or to start the night with, and also easy to make. It’s an absolute winner.</p><p>Alice Barsby, general manager, <a href=\"https://hideandfox.co.uk/\">Hide and Fox</a>, Hythe, Kent<br /></p> <a href=\"https://www.theguardian.com/food/2022/dec/16/cocktail-of-the-week-hide-and-fox-hide-and-fizz-recipe-vermouth-spakling-wine\">Continue reading...</a>", "link": "https://www.theguardian.com/food/2022/dec/16/cocktail-of-the-week-hide-and-fox-hide-and-fizz-recipe-vermouth-spakling-wine", "date_published": "2022-12-16 16:00:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "A class apart: France goalkeeper Hugo Lloris on threshold of history", "description": "<p>Victory over Argentina would make the 35-year-old the first captain to win two men’s World Cups</p><p>Hugo Lloris heard the mating call of the English press. “You got two minutes?” one of the journalists asked. The France goalkeeper and captain did not have two seconds. “Oh, you want to talk to me now?” he replied, with no little huffiness, barely breaking stride en route to the stadium exit.</p><p>It was last Saturday night, <a href=\"https://www.theguardian.com/football/2022/dec/10/england-france-world-cup-quarter-final-match-report\">France had just beaten England</a> in the World Cup quarter-final and it was not immediately apparent what was eating Lloris. Turns out he was fuming at an article in one of the English newspapers that suggested he could be France’s weak link.</p> <a href=\"https://www.theguardian.com/football/2022/dec/16/a-class-apart-france-goalkeeper-hugo-lloris-on-threshold-of-history\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/16/a-class-apart-france-goalkeeper-hugo-lloris-on-threshold-of-history", "date_published": "2022-12-16 15:57:39+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Soyuz temperature rising but crew not in danger, says Russian space agency", "description": "<p>Coolant leak on Soyuz capsule forced last-minute cancellation of spacewalk by two cosmonauts</p><p>The temperature in the Soyuz capsule that is docked with the International Space Station has risen but the crew is not in danger, the Russian space agency has said.</p><p>On Thursday, Roscosmos and the US space agency, Nasa, said a <a href=\"https://www.theguardian.com/science/2022/dec/15/unexplained-leak-from-soyuz-spacecraft-forces-russia-to-abort-iss-spacewalk-mission\">coolant leak had been detected on the Soyuz MS-22 spacecraft</a>. The leak forced the last-minute cancellation of a spacewalk by two Russian cosmonauts on Wednesday.</p> <a href=\"https://www.theguardian.com/science/2022/dec/16/soyuz-temperature-rising-but-crew-not-in-danger-says-russian-space-agency\">Continue reading...</a>", "link": "https://www.theguardian.com/science/2022/dec/16/soyuz-temperature-rising-but-crew-not-in-danger-says-russian-space-agency", "date_published": "2022-12-16 15:55:46+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Ngozi Fulani receives personal apology over Buckingham Palace racism incident", "description": "<p>Former lady in waiting to queen Susan Hussey and black charity founder have ‘warm and understanding’ meeting </p><p>A former lady in waiting to the late queen who <a href=\"https://www.theguardian.com/uk-news/2022/nov/30/buckingham-palace-aide-resigns-black-guest-traumatised-by-repeated-questioning\">resigned from the royal household</a> after repeatedly asking the black charity founder Ngozi Fulani where she was from during a charity palace reception has apologised to her in person, Buckingham Palace has said.</p><p><a href=\"https://www.theguardian.com/uk-news/2022/nov/30/who-is-royal-aide-lady-susan-hussey\">Susan Hussey</a>, godmother to the Prince of Wales, met Fulani, the founder of Sistah Space, at the palace in a meeting described as “warm and understanding”, during which she apologised for comments including for asking “where she was really from” despite being told by Fulani she was British.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/16/lady-hussey-apologises-ngozi-fulani-buckingham-palace-racism-incident\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/dec/16/lady-hussey-apologises-ngozi-fulani-buckingham-palace-racism-incident", "date_published": "2022-12-16 15:53:37+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Qatar 2022: this World Cup has taken place in a crime scene | Marina Hyde", "description": "<p>There has not been a single conviction and yet nothing changes with metaphorical bedsheets dutifully shielding the suspects</p><p>Two days out from the World Cup final, Qatar finishes hosting its tournament having very recently been declared “a frontrunner in labour rights”. “Today,” the declaration in question continued, “the World Cup in Qatar is proof of how sports diplomacy can achieve a historic transformation of a country.”</p><p>It feels only mildly unfortunate that the member of the European parliament who uttered these words three weeks ago is currently detained by Belgian police, <a href=\"https://www.theguardian.com/world/2022/dec/16/a-tragic-affair-european-parliament-stunned-by-qatar-corruption-inquiry\" title=\"\">after the discovery of almost €1m</a> in banknotes in her marital home and a hotel room used by her father. After all, this has been a successful World Cup. Qatar has catapulted itself on to the world stage and won many plaudits. This timing is merely a freak coincidence.</p> <a href=\"https://www.theguardian.com/football/2022/dec/16/qatar-2022-this-world-cup-has-taken-place-in-a-scene\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/16/qatar-2022-this-world-cup-has-taken-place-in-a-scene", "date_published": "2022-12-16 15:47:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Police chief fired grenade launcher given as gift by Ukraine, Polish media reports", "description": "<p>Prosecutors investigating after Jarosław Szymczyk injured in blast at police headquarters in Warsaw</p><p>Polish prosecutors are investigating a “violent release of energy” at the national police headquarters amid media reports that the chief of police fired a grenade launcher in his office.</p><p>Poland’s interior ministry said on Thursday that Jarosław Szymczyk, the police commander in chief, was injured and taken to hospital <a href=\"https://www.theguardian.com/world/2022/dec/15/poland-police-chief-jaroslaw-szymczyk-wounded-when-gift-from-ukraine-explodes\">when a present he received during a visit to Ukraine exploded</a> at police headquarters in Warsaw.</p> <a href=\"https://www.theguardian.com/world/2022/dec/16/poland-police-chief-jaroslaw-szymczyk-fired-grenade-launcher-gift-ukraine\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/16/poland-police-chief-jaroslaw-szymczyk-fired-grenade-launcher-gift-ukraine", "date_published": "2022-12-16 15:46:23+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Binance auditor withdraws from working with crypto company", "description": "<p>World’s largest cryptocurrency exchange, which has been hit by $6bn of withdrawals this week, seeks replacement for Mazars</p><p>Binance, the world’s largest cryptocurrency exchange, has revealed that the auditor Mazars has stopped working with it.</p><p>The exchange, which has been hit by $6bn of withdrawals this week, said in a statement that the French auditing firm had “temporarily” paused work with all its crypto clients including Binance. </p> <a href=\"https://www.theguardian.com/business/2022/dec/16/binance-auditor-mazars-withdraws-from-working-with-cryptocurrency-exchange\">Continue reading...</a>", "link": "https://www.theguardian.com/business/2022/dec/16/binance-auditor-mazars-withdraws-from-working-with-cryptocurrency-exchange", "date_published": "2022-12-16 15:46:07+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Sinisa Mihajlovic, Serie A and Serbian football icon, dies aged 53", "description": "<ul><li>Former player and manager was diagnosed with leukemia</li><li>Tributes paid from inside and outside football world</li></ul><p>Sinisa Mihajlovic, a former standout footballer in his native Serbia and then Italy, who became a popular coach in Serie A, has died after being diagnosed with leukemia. He was 53.</p><p>Mihajlovic’s family announced on Friday that he died in a Rome hospital.</p> <a href=\"https://www.theguardian.com/football/2022/dec/16/sinisa-mihajlovic-serie-a-and-serbian-football-icon-dies-aged-53\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/16/sinisa-mihajlovic-serie-a-and-serbian-football-icon-dies-aged-53", "date_published": "2022-12-16 15:17:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "I’m a former Tory minister and a doctor – and I say give striking nurses a better pay deal", "description": "<p>NHS workers in Scotland have been offered close to 8%. Surely their colleagues  in England deserve as much</p><p>For the first time in its history, the Royal College of Nursing has <a href=\"https://www.theguardian.com/society/live/2022/dec/15/uk-nurses-strike-today-nhs-history-live-latest-updates\">taken strike action</a> over pay. Next week, nurses in England will be joined on the picket line by ambulance workers and other members of the NHS workforce, and junior doctors may soon join them. We should be clear that strike action on this scale is unprecedented in the history of our National Health Service.</p><p>As a doctor myself, I would never strike, because I worry about the impact on my patients. But it is important to recognise that many NHS workers are experiencing real financial hardship owing to the ever-rising cost of living, and the failure of the government to make a sensible pay offer is not helping. So how has the government got into this mess, and what can be done about it?</p><p>Dr Dan Poulter is the MP for Central Suffolk and North Ipswich, a former health minister and a practising NHS hospital doctor</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/16/tory-minister-doctor-striking-nurses-pay-nhs-workers-scotland-england\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/dec/16/tory-minister-doctor-striking-nurses-pay-nhs-workers-scotland-england", "date_published": "2022-12-16 15:15:29+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Music to harvest and relax to: how the Stardew Valley soundtrack caught the rhythms of the seasons", "description": "<p>Like everything else about the hit indie farming game, Stardew Valley’s soundtrack is an extension of its creator, Eric Barone. He reveals how he composed it by listening to the weather</p><p>Earlier this year, Eric Barone was approached by singer-songwriter Molly Rankin of power-pop group <a href=\"https://www.theguardian.com/music/2022/oct/11/alvvays-molly-rankin-interview-blue-rev\">Alvvays</a>. The game developer, best known as the one-man creative force behind the hit farming simulator Stardew Valley, was asked if he would like to contribute some art for the band’s new single, Many Mirrors. Never one to limit himself, or to do things by halves, Barone created a whole music video instead. “That’s just how I work,” he tells me. “I don’t hold back.”</p><p>You can tell from his work that Barone puts the whole of himself into it. Now almost seven years old and still hugely popular, Stardew Valley is an extension of who he is. When you work on the graphics, the programming, the audio, the systems and the writing all at once, you project a fairly complete image of who you are on to the world. For some people that would be daunting, but Barone embraces it.</p> <a href=\"https://www.theguardian.com/culture/2022/dec/16/stardew-valley-eric-barone-interview-soundtrack-seasons-high-scores\">Continue reading...</a>", "link": "https://www.theguardian.com/culture/2022/dec/16/stardew-valley-eric-barone-interview-soundtrack-seasons-high-scores", "date_published": "2022-12-16 15:09:03+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Bismarck du Plessis: ‘Every time I can put my boots on I feel fortunate’", "description": "<p>World Cup winner reflects on his innate competitiveness, family tragedy and coming out of retirement to play in the snow at Exeter</p><p>A compelling force clearly still drives Bismarck du Plessis. He is 38 now and there is plenty else to occupy him on the family farm near Bethlehem, 165 miles due south of Johannesburg. He and his wife, Anja, already have three boys, including six-year-old identical twins, with twin girls due in March. After 79 caps for South Africa, a 2007 World Cup winner’s medal and multiple other honours, the battle-scarred hooker could be excused for seeking a quieter life.</p><p>And yet here he is, dragging his aching body halfway around the world to hit more rucks in Exeter on a freezing Saturday in the shadow of Christmas. The bleak midwinter challenge at Sandy Park in the Champions Cup on Saturday appears, if anything, to be an extra incentive. “My kids’ godparents live not far away and they’ve been sending me pictures of the snow. I’ve sent them to the young boys in our squad and told them there’s a rude awakening waiting for us.”</p> <a href=\"https://www.theguardian.com/sport/2022/dec/16/bismarck-du-plessis-every-time-i-can-put-my-boots-on-i-feel-fortunate\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/dec/16/bismarck-du-plessis-every-time-i-can-put-my-boots-on-i-feel-fortunate", "date_published": "2022-12-16 15:02:56+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Can I train my cat like a dog? We ask an expert", "description": "<p>It’s easy to teach your feline companion to sit or follow a target, says behaviour expert Daniel Warren-Cummings</p><p>This year <a href=\"https://link.springer.com/article/10.1007/s10071-022-01674-w\" title=\"\">a French study</a> found that cats know when their owners are talking to them, adding to a growing body of evidence that cats might be more bonded to us than we think. So if cats rival dogs as man’s best friends, could we train them in the same way? I asked behaviourist Daniel Cummings from welfare charity Cats Protection.</p><p><strong>Recently it was demonstrated that cats can, to some extent, </strong><strong><a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7401521/\" title=\"\">read human emotions</a>, </strong><strong>leading some to suggest </strong><strong>they could be therapy animals for their owners. </strong><strong>Could </strong><strong>a cat be trained </strong><strong>to be a support animal?</strong><br />Oh yes! I would say such training is universal across all species. It’s mostly positive reinforcement – so rewarding the animal when they do the right thing, until eventually they learn “if I do this, something good happens”. You could do that with a dog, cat, alligator, elephant – you could even maybe try it with some invertebrates.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/16/can-i-train-my-cat-like-a-dog-we-ask-an-expert\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/16/can-i-train-my-cat-like-a-dog-we-ask-an-expert", "date_published": "2022-12-16 15:00:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Football is the most attractive game, but its governors are squandering its joy | Philipp Lahm", "description": "<p>Too often, those in charge of Fifa and Uefa have put gain above the common good. Diversity and equality must be defended</p><p>A World Cup works always and everywhere. There is nothing like it – and it is a diverse event. Eleven men or women are actively involved on both sides, even up to 17 due to the new rule with substitutions. All continents take part, and Sunday’s finalists Argentina lost in Qatar to a country from Asia – Saudi Arabia – and almost had to go into extra time against Australia. Thanks to Morocco, Africa – alternatively Arabia – made it to the semi-finals for the first time.</p><p>At a football tournament, the world negotiates how it wants to live together. The game provides material for discussions in all directions. Was the ball out before Japan’s winning goal against Spain? Can offside be measured digitally, as technology optimists believe? Is the Palestine flag political, and what does it say? Was the OneLove armband necessary? What signal does it send when Muslim athletes dance with and kiss their mothers in front of the world after victories?</p> <a href=\"https://www.theguardian.com/football/blog/2022/dec/16/football-is-the-most-attractive-game-but-its-governors-are-squandering-its-joy\">Continue reading...</a>", "link": "https://www.theguardian.com/football/blog/2022/dec/16/football-is-the-most-attractive-game-but-its-governors-are-squandering-its-joy", "date_published": "2022-12-16 15:00:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Witness to paradise being lost: my year in the dying Amazon", "description": "<p>In the past 12 months I have learned that the mass extermination of the Amazon is a climate catastrophe –  and much more</p><p>I thought it was a blood moon at first. The dark orange glow appeared at dusk on the far side of the shimmering silver band that is the Xingu River. It was just before 8pm, after the parrots had squawked back to their nests and the insects and frogs were noisily starting the forest nightshift. A flash of lightning from a cloud appeared above almost the same location but the rest of the sky was clear. How could there be a storm? I peered more intently and took a photograph that I could magnify. And there was the answer – a fire, which grew fiercer as I watched, the flames spreading sideways and upwards, flickering red and yellow, billowing smoke into the sky, sparking flashes of lightning every couple of minutes.</p><p>I felt sick to the stomach. The Amazon rainforest was being destroyed in front of my eyes. I have been writing about the climate crisis for 16 years, always with a sense of horror but until now, mostly with a sense of distance. This was the first time I had seen it from my home, and it was stranger than I expected. I had not realised until that moment that fire can create its own lightning storms, by creating <a href=\"https://www.nasa.gov/topics/earth/features/pyrocb.html\">pyrocumulonimbus</a>, which scientists describe as “the fire-breathing dragon of clouds”.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/16/year-in-the-life-of-the-amazon-deforestation-climate-disaster-mass-extermination\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/dec/16/year-in-the-life-of-the-amazon-deforestation-climate-disaster-mass-extermination", "date_published": "2022-12-16 15:00:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Benjamina Ebuehi’s recipe for a festive bread-and-butter pudding | The sweet spot", "description": "<p>The traditional comforting pud gets a cranberry and almond twist for a touch of festive flair</p><p>Bread and butter pudding: so simple, so comforting. For the most part I quite like a traditional one, but during the festive season, I’m more than happy to break a few rules. The cranberries bring a welcome burst of colour and a delicious tartness that cuts through everything rich. And December is probably the only time of year that I’ll happily eat marzipan, so I’ve snuggled a few nuggets into the custard for pops of almondy chewiness.</p> <a href=\"https://www.theguardian.com/food/2022/dec/16/festive-bread-and-butter-pudding-cranberry-marzipan-recipe-benjamina-ebuehi\">Continue reading...</a>", "link": "https://www.theguardian.com/food/2022/dec/16/festive-bread-and-butter-pudding-cranberry-marzipan-recipe-benjamina-ebuehi", "date_published": "2022-12-16 15:00:54+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Barbie: first trailer for Greta Gerwig’s movie starring Margot Robbie", "description": "<p>The Little Women writer-director has re-teamed with Noah Baumbach to write a new take on the much-loved doll character</p><p>The teaser trailer for the much-anticipated new take on Barbie <a href=\"https://www.youtube.com/watch?v=8zIf0XvoL9Y\">has landed</a>, giving us our first official look at Margot Robbie in action.</p><p>The Suicide Squad star takes on the role of the divisive doll, originally launched in 1959, in a satirical film directed by Greta Gerwig based on a script she wrote with Noah Baumbach. The two previously collaborated on scripts for Frances Ha and Mistress America.</p> <a href=\"https://www.theguardian.com/film/2022/dec/16/barbie-first-trailer-greta-gerwig-margot-robbie\">Continue reading...</a>", "link": "https://www.theguardian.com/film/2022/dec/16/barbie-first-trailer-greta-gerwig-margot-robbie", "date_published": "2022-12-16 14:50:36+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "George Osborne to earn share of £26.5m payout in first year at investment banking company", "description": "<p>Robey Warshaw did not specify how much the former chancellor would collect</p><p>George Osborne will collect a share of a £26.5m payout for his first year working as partner at the City advisory firm Robey Warshaw.</p><p>The former chancellor, who orchestrated the austerity drive after the financial crisis, is one of four partners at the Mayfair-based investment banking company, which announced on Friday it would pay out a total of £26,482,914 to four men.</p> <a href=\"https://www.theguardian.com/politics/2022/dec/16/george-osborne-to-earn-share-of-265m-payout-in-first-year-at-investment-banking-company\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/dec/16/george-osborne-to-earn-share-of-265m-payout-in-first-year-at-investment-banking-company", "date_published": "2022-12-16 14:36:09+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "How France avoided the curse of previous World Cup winners | Chris Evans", "description": "<p>Recent world champions have put up embarrassing title defences. What have France done differently?</p><p>By <a href=\"https://twitter.com/ChrisEvansWrite\">Chris Evans</a> for <a href=\"https://thesetpieces.com/\">The Set Pieces</a></p><p>The World Cup winners’ curse has been haunting teams for six decades. If France beat Argentina on Sunday, they will become the first team to retain the World Cup since the Brazil side of Pelé and Garrincha in 1962. Didier Deschamps’ side have already overcome one curse by reaching the final, which is a huge achievement considering how poorly recent winners have performed while defending their titles.</p><p>Four of the previous five World Cup winners failed to get past the first round of the next tournament, so what looked like an easy group for France – Australia, Denmark and Tunisia – was not as simple as it initially appeared. Add to that the slew of injuries France suffered before the tournament and it seemed likely the curse would strike again.</p> <a href=\"https://www.theguardian.com/football/the-set-pieces-blog/2022/dec/16/france-avoided-curse-previous-world-cup-winners\">Continue reading...</a>", "link": "https://www.theguardian.com/football/the-set-pieces-blog/2022/dec/16/france-avoided-curse-previous-world-cup-winners", "date_published": "2022-12-16 14:30:35+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Outrage after Twitter suspends several US journalists who reported on Musk – live", "description": "<p>US media outlets express frustration while EU promises sanctions and German foreign ministry says ‘we have a problem’</p><ul><li><a href=\"https://www.theguardian.com/info/2018/sep/17/guardian-us-morning-briefing-sign-up-to-stay-informed\">Sign up to receive First Thing – our daily briefing by email</a></li></ul><p><strong>Good morning and happy Friday to all politics blog readers! </strong>After <strong>Elon Musk</strong>’s <a href=\"https://www.theguardian.com/technology/2022/dec/15/twitter-suspends-accounts-journalists-musk\">purge of several prominent US journalists’ Twitter accounts</a>, the EU was quick to react, <a href=\"https://www.livemint.com/news/world/twitter-bans-journalists-european-union-turns-up-the-heat-on-elon-musk-10-points-11671191300869.html\">promising sanctions</a> against the social media giant.</p><p>“We have a problem @Twitter,” the <a href=\"https://twitter.com/AuswaertigesAmt/status/1603689087969411072\">German foreign ministry tweeted</a>, while a raft of other senior European officials are expressing their concern at curbed press freedoms.</p><p>Senators continue their discussions on an omnibus deal to keep the government funded for the next year after passing a week-long stopgap measure last night. Democrats want to include the <strong>Electoral Count Act</strong>, seeking to prevent another January 6-style insurrection.</p><p>The House committee investigating the January 6 Capitol attack by followers of <strong>Donald Trump</strong> are wrapping up their business ahead of Monday’s final public hearing, but it’s unclear whether we’ll see the full report on that day.</p><p><strong>Joe Biden</strong> will meet veterans to talk about benefits and services resulting from the Pact Act during a town hall meeting at a National Guard center in Delaware named for the president’s late son Beau. He’ll speak at 12pm.</p><p>The national security adviser, <strong>Jake Sullivan,</strong> will talk about international affairs at the Carnegie Endowment for International Peace thinktank in Washington DC.</p> <a href=\"https://www.theguardian.com/us-news/live/2022/dec/16/twitter-suspends-journalists-elon-musk-reaction-politics-trump-biden-live-updates\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/live/2022/dec/16/twitter-suspends-journalists-elon-musk-reaction-politics-trump-biden-live-updates", "date_published": "2022-12-16 14:29:37+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Gianni Infantino announces 32-team men’s Club World Cup in 2025", "description": "<ul><li>Fifa president risks wrath of Europe’s leading federations</li><li>No agreements made with relevant domestic leagues</li></ul><p>Gianni Infantino has risked a major row with Europe’s leading federations by announcing that Fifa will launch a 32-team men’s Club World Cup in 2025.</p><p>In what amounts to an ambush to the Premier League and its counterparts, Infantino confirmed the drastic expansion of a tournament whose current annual iteration sees seven teams compete. His revelation was made even though no agreements have been made with the relevant domestic leagues.</p> <a href=\"https://www.theguardian.com/football/2022/dec/16/gianni-infantino-announces-32-team-mens-club-world-cup-in-2025\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/16/gianni-infantino-announces-32-team-mens-club-world-cup-in-2025", "date_published": "2022-12-16 14:24:05+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘A tragic affair’: European parliament stunned by Qatar corruption inquiry", "description": "<p>Arrest of Greek MEP and her boyfriend at centre of top-secret investigation into a criminal conspiracy</p><p>The police had been waiting since dawn. Officers from the special unit of Belgium’s federal police gathered on Rue Wiertz, close to the European parliament in Brussels. The parliament, which likes to style itself the house of European democracy, had been at the centre of a months-long, top-secret investigation. Investigators believed a Gulf country – unofficially confirmed as Qatar – was trying to sway decisions at the assembly, using vast sums of cash and lavish gifts. Now they were about to arrest the man they thought was at the centre of the criminal conspiracy.</p><p>He was Francesco Giorgi, an assistant at the parliament. Charismatic and well-connected, the young Italian lived with his partner, Eva Kaili, a Greek MEP, who had enjoyed a meteoric rise to become one of the parliament’s 14 vice-presidents since her election in 2014. As soon as Giorgi left the building, police surrounded him. His interrogation – and seizure of his phone – was deemed crucial to the investigation, according to Le Soir, which recounted the details of his morning arrest. By lunchtime last Friday, police had searched 16 properties in Brussels, arrested five others including Kaili, seized laptops, phones and hundreds of thousands of euros in cash. Two people were later released without charge.</p> <a href=\"https://www.theguardian.com/world/2022/dec/16/a-tragic-affair-european-parliament-stunned-by-qatar-corruption-inquiry\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/16/a-tragic-affair-european-parliament-stunned-by-qatar-corruption-inquiry", "date_published": "2022-12-16 14:22:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Traces of suspected cocaine found after parties in Liz Truss’s grace-and-favour house, say staff", "description": "<p>Exclusive: White powder residue found after events held at Chevening and Downing Street, say sources</p><p>Traces of a suspected class A drug were found at a government grace-and-favour home after parties attended by political allies of Liz Truss, the Guardian has been told.</p><p>The white powder was discovered at the Chevening estate last summer in the days before Truss won the Tory leadership contest and became prime minister, according to sources.</p> <a href=\"https://www.theguardian.com/politics/2022/dec/16/traces-of-suspected-cocaine-found-after-parties-in-liz-truss-grace-and-favour-house-say-staff\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/dec/16/traces-of-suspected-cocaine-found-after-parties-in-liz-truss-grace-and-favour-house-say-staff", "date_published": "2022-12-16 14:07:52+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "From Musk to Truss, 2022 was the year reckless populists came crashing down to Earth | Gaby Hinsliff", "description": "<p>Revolutionaries who claim to bring down corrupt systems have proved that orthodoxy exists for a reason</p><p>For a man on a moral crusade, <a href=\"https://www.theguardian.com/business/2022/dec/13/ftx-founder-sam-bankman-fried-money-fraud-what-we-know\">Sam Bankman-Fried</a> lived a life of surprising luxury. The <a href=\"https://www.theguardian.com/technology/2022/nov/14/sam-bankman-fried-bahamas-penthouse-ftx-crypto\">$40m penthouse</a> in the Bahamas, the supermodels and celebrities roped in to back his business ventures, and the fawning glossy magazine profiles would all be perfectly standard trappings for a Wall Street tycoon or hedge fund playboy. But they seem strangely reminiscent of the tired old capitalism Bankman-Fried got rich rejecting, not the one he was supposedly building in its place.</p><p>Once one of the world’s youngest billionaires, Bankman-Fried made his fortune in cryptocurrencies – forms of digital money originally invented to circumvent the supposedly corrupt financial elite and empower the little guy – and had grand plans for giving it all away to life-changing progressive causes. But instead of bringing the rotten old order crashing down, he was this week arrested on fraud charges (which he has denied) relating to the implosion of his currency exchange FTX in what <a href=\"https://www.theguardian.com/technology/2022/dec/10/sam-bankman-fried-ftx-cryptocurrency-exchange\">bankruptcy lawyers describe</a> as “one of the most abrupt and difficult collapses in the history of corporate America”.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/16/musk-truss-2022-year-populists-crashed-to-earth\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/dec/16/musk-truss-2022-year-populists-crashed-to-earth", "date_published": "2022-12-16 14:02:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Time away from my usual routine made me realise what was missing | Katie Cunningham", "description": "<p>I’d forgotten holidays aren’t just a chance to relax, but an opportunity to pause, reflect and reassess</p><ul><li><a href=\"https://www.theguardian.com/newsletters/2019/oct/18/saved-for-later-sign-up-for-guardian-australias-culture-and-lifestyle-email?CMP=cvau_sfl\">Get our weekend culture and lifestyle email</a></li></ul><p>I recently returned from my first holiday in four years. As well as being long overdue, it came after an extended period of work cannibalising my nights, weekends and few remaining shreds of sanity, pushing me close to the brink of burnout. Which is to say: I really needed this. It was, predictably, wonderful. I went to Bali for a week and did blissfully little. I swam, read a couple of books, drank cocktails of varying quality and got a massage every day.</p><p>I also did a lot of yoga. On day two of the trip, a friend took me to a studio called Radiantly Alive (this is the vibe of Ubud) for a 90-minute hatha class. I had done yoga precisely once before, at a Fitness First inside a Canberra shopping mall. This was a very different experience. I stood in a large room surrounded by beautiful Balinese nature, sunlight and a gentle breeze filtering in through the open windows, some kind of chillout mix on the speakers. I didn’t know my happy babies from my downward dogs, but nonetheless emerged from the class limber and in a state of bliss. I felt … radiantly alive.</p><p><strong><a href=\"https://www.theguardian.com/newsletters/2019/oct/18/saved-for-later-sign-up-for-guardian-australias-culture-and-lifestyle-email?CMP=copyembed\">Sign up for the fun stuff with our rundown of must-reads, pop culture and tips for the weekend, every Saturday morning</a></strong></p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/17/time-away-from-my-usual-routine-made-me-realise-what-was-missing\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/dec/17/time-away-from-my-usual-routine-made-me-realise-what-was-missing", "date_published": "2022-12-16 14:00:56+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘It’s hard coming home to a tent’: the rise of Australia’s working homeless", "description": "<p>People with jobs and families will be seeing out Christmas in camping grounds and motels, as experts warn of a new kind of crisis</p><ul><li>Get our <a href=\"https://www.theguardian.com/australia-news/2022/oct/29/email-newsletters-guardian-australia-best-daily-news-emails-newsletter-free-sign-up-inbox-subscribe-headlines?CMP=cvau_sfl\">morning and afternoon news emails</a>, <a href=\"https://www.theguardian.com/technology/ng-interactive/2018/may/15/the-guardian-app?CMP=cvau_sfl\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></li></ul><p>At 5am most mornings, Cheryl Rowe’s alarm wakes her up in the camping trailer where she has been living for three months. It signals time for the 63-year-old to start her work day as a cleaner.</p><p>Torch in hand, she gets ready and packs the car at the caravan park in Western Australia’s Margaret River region. She has been asked to be quiet so as not to wake the tourists. Then she spends the rest of her day cleaning, part of it scrubbing holiday homes that sometimes sit empty.</p><p><strong><a href=\"https://www.theguardian.com/australia-news/2022/oct/29/email-newsletters-guardian-australia-best-daily-news-emails-newsletter-free-sign-up-inbox-subscribe-headlines?CMP=copyembed\">Sign up for Guardian Australia’s free morning and afternoon email newsletters for your daily news roundup</a></strong></p> <a href=\"https://www.theguardian.com/australia-news/2022/dec/17/its-hard-coming-home-to-a-tent-the-rise-of-australias-working-homeless\">Continue reading...</a>", "link": "https://www.theguardian.com/australia-news/2022/dec/17/its-hard-coming-home-to-a-tent-the-rise-of-australias-working-homeless", "date_published": "2022-12-16 14:00:56+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Few things are as glam or Christmassy as sequins … just don’t go for new ones | Jess Cartner-Morley", "description": "<p>Sequins always make you look like you’ve made an effort – team them with a blazer, a plain dress or denim skirt</p><p>Liza Minnelli in magenta Halston at Studio 54. Marilyn Monroe and Jane Russell sparkling in lipstick red in <a href=\"https://www.theguardian.com/film/2010/feb/25/gentlemen-prefer-blondes-film-review\">Gentlemen Prefer Blondes</a>. The Supremes in their Bob Mackie silver sheaths. Kate Moss in vintage at her 30th birthday party. Harry Styles on stage in a Gucci jumpsuit. Sequins and glamour go together like Mariah Carey and Christmas. </p><p>When the festive season rolls around, the mini-flashbulb-pop of sequins is never far behind. Sequins are both armour and comfort blanket. They look as if you have made an effort. Because of their light-reflecting properties they tend to be flattering. And they give you a glow, like a portable ring light, which is welcome at this time of year, when fatigue and the vampire-darkness of midwinter take their toll on the complexion. </p> <a href=\"https://www.theguardian.com/fashion/2022/dec/16/few-things-are-as-glam-or-christmassy-as-sequins\">Continue reading...</a>", "link": "https://www.theguardian.com/fashion/2022/dec/16/few-things-are-as-glam-or-christmassy-as-sequins", "date_published": "2022-12-16 14:00:54+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "I can’t believe it’s not … cheaper than 50 quid: the UK’s poshest butter", "description": "<p>Even among the soaring cost of spreads, one offering stands out, priced at £55 – or £105 with a dish</p><p>It has long been a kitchen staple in Britain but with prices soaring, butter is fast becoming a luxury item.</p><p>Now an unsavoury milestone has been passed, with a 150g block arriving on shop shelves with a price tag of more than £50.</p> <a href=\"https://www.theguardian.com/food/2022/dec/16/i-cant-believe-its-not-cheaper-than-50-quid-the-uks-poshest-butter\">Continue reading...</a>", "link": "https://www.theguardian.com/food/2022/dec/16/i-cant-believe-its-not-cheaper-than-50-quid-the-uks-poshest-butter", "date_published": "2022-12-16 14:00:53+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "I’m lonely and depressed in my first job. What can I do? | Ask Annalisa Barbieri", "description": "<p>The adult world can feel big and scary at first. Can you start by reaching out to  people you feel comfortable with?</p><p><strong>A few months ago I graduated from university and started my first full-time job. It’s a really good position to have at my age in an industry I really want to be in, and my co-workers are very polite. On the flip side, I’m a good 20 years younger than almost everyone around me, and the few people in their late </strong><strong>20s are pretty </strong><strong>uninterested in me.</strong></p><p><strong>I have always struggled with making friends, and mostly focused on my academic work to fill the void. Now I find myself being both the least knowledg</strong><strong>able, and socially awkward to boot. I have no friends in my office, and barely have time to see the few I have from university. I feel like my loneliness is eating me alive and every day it gets worse.</strong></p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/16/im-lonely-and-depressed-in-my-first-job-what-can-i-do\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/16/im-lonely-and-depressed-in-my-first-job-what-can-i-do", "date_published": "2022-12-16 14:00:53+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Football Daily | Gianni Infantino and the difficult second monologue", "description": "<p><a href=\"https://www.theguardian.com/info/2022/nov/14/football-daily-email-sign-up\">Sign up now! Sign up now! Sign up now? Sign up now!</a></p><p>Today Gianni Infantino feels late. He kept the hordes waiting for his much-anticipated Human Rights World Cup exit press conference for an hour. Football Daily’s popcorn had gone cold by the time he took to his throne. Infantino must have spent those final few moments perfecting lines to see how he could rework his <a href=\"https://www.theguardian.com/football/2022/nov/19/fifa-gianni-infantino-world-cup-qatar\">“I feel gay” routine</a> from the start of the tournament. Maybe he was making sure he had the latest numbers for migrant workers’ deaths in Qatar absolutely spot on, especially considering how vague he has been on the matter thus far.</p><p>In 1996, Manchester United <a href=\"https://www.theguardian.com/football/2006/apr/15/sport.comment2\">changed their kit</a> after the half-time cuppa at Southampton because the grey ensemble put them off the business of the day. This explains why England and Germany are out and France and Argentina are through to the HRWC final. England’s costume with its shoulder detail was devastatingly distracting, while the Germans’ big black stripe made them human credit cards. Argentina has stuck to trusted tradition while the French belong on a Paris catwalk” – Lindsay Williams.</p> <a href=\"https://www.theguardian.com/football/2022/dec/16/football-daily-email-human-rights-world-cup-gianni-infantino\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/16/football-daily-email-human-rights-world-cup-gianni-infantino", "date_published": "2022-12-16 13:52:49+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "A marble Fiat and ANC singers in South Africa: Friday’s best photos", "description": "<p>The Guardian’s picture editors select photo highlights from around the world</p> <a href=\"https://www.theguardian.com/news/gallery/2022/dec/16/marble-fiat-anc-singers-south-africa-fridays-best-photos\">Continue reading...</a>", "link": "https://www.theguardian.com/news/gallery/2022/dec/16/marble-fiat-anc-singers-south-africa-fridays-best-photos", "date_published": "2022-12-16 13:51:12+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Nosferatu at 100: Berlin exhibition examines vampire classic’s enduring appeal", "description": "<p>Show takes a deep into lore around 1922 film that spawned an entire genre – with free entry for blood donors </p><p>It was a nightmare born out of a pandemic: a silent killer that arrived from a faraway land, rapidly spreading a delirious fever across the domestic population and leaving its hosts in an anaemic stupor.</p><p>By channelling contemporary fears around infectious diseases in the wake of the 1918-20 influenza pandemic, the <a href=\"https://www.theguardian.com/film/2013/oct/24/nosferatu-eview\">1922 expressionist masterpiece Nosferatu</a> founded an entire genre of vampire horror movies and inspired claw-fingered monsters that would spook generations to come, from <a href=\"https://www.theguardian.com/film/2022/may/17/send-us-your-questions-freddy-krueger-nightmare-on-elm-street-robert-englund\">Freddy Krueger</a> to <a href=\"https://www.theguardian.com/film/2014/oct/23/the-babadook-review-chilling-freudian-thriller\">the Babadook</a>.</p> <a href=\"https://www.theguardian.com/film/2022/dec/16/nosferatu-100-berlin-vampire-exhibition\">Continue reading...</a>", "link": "https://www.theguardian.com/film/2022/dec/16/nosferatu-100-berlin-vampire-exhibition", "date_published": "2022-12-16 13:48:03+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "World Cup final sees Messi v Mbappé, with Qatar the winner regardless", "description": "<p>Host country prepares for day of celebration on Sunday as Argentina take on France, with Lionel Messi on a mission</p><p>It takes only a few minutes to spot the first Lionel Messi shirt after stepping out of Msheireb metro station. Keep going towards Souq Waqif and, although the streets of downtown Doha are not playing host to a typical football atmosphere, images of the little Argentinian genius are hard to miss. There are countless Messi T-shirts hanging from the stalls in the market, there is even a painting of him in the front window of the Souq Waqif Art Center, and judging by the mood among the tourists mooching around the city most people will be backing Argentina when they meet France in the World Cup final on Sunday night.</p><p>As one stallholder puts it as he sells another Argentina scarf, nobody is particularly interested in his France merchandise. Even the four Brazil fans taking a stroll on a hot Friday morning are wearing curly blue and white wigs. It is a baffling sight, but there is an explanation. Yes, it was annoying that <a href=\"https://www.theguardian.com/football/2022/dec/09/croatia-brazil-world-cup-quarter-final-match-report\">Brazil blew their quarter-final against Croatia</a>. And, yes, Brazilians <em>do</em> hate Argentina. But apparently it’s a bit like hating your family: you love them really and would prefer to see them happy.</p> <a href=\"https://www.theguardian.com/football/2022/dec/16/world-cup-final-lionel-messi-kylian-mbappe-argentina-france-qatar\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/16/world-cup-final-lionel-messi-kylian-mbappe-argentina-france-qatar", "date_published": "2022-12-16 13:44:15+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Rosalía review – pop’s fearless queen conjures a kaleidoscopic paradise", "description": "<p><strong>The O2, London<br /></strong>The Spanish superstar sends her audience into raptures with an epic set that proves her status as a daring avant-pop virtuoso</p><p>There’s a <a href=\"https://twitter.com/Shuttsapalooza/status/1594403230758338561\">meme format</a> going around where an image of an odd-looking fellow – the <a href=\"https://twitter.com/keithposting/status/1594393854081368065?lang=en-GB\">original</a> being Wayne Rooney in a vacuum-tight suit – is paired with the caption: “No one has ever looked like this before.” Even in an age of endless bootlegs, remakes and copycats, the shock of the new is reassuringly enduring.</p><p>And until this year, surely, no one has ever thought they were watching the greatest pop performance in the world as a singer and eight dancers zipped around the stage on micro-scooters while making bunny-ear gestures and shouting: “Chicken teriyaki!”</p> <a href=\"https://www.theguardian.com/music/2022/dec/16/rosalia-review-o2-london\">Continue reading...</a>", "link": "https://www.theguardian.com/music/2022/dec/16/rosalia-review-o2-london", "date_published": "2022-12-16 13:37:13+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Dreaming of a Covid-free Christmas? How to stay safe over festive season", "description": "<p>Cases are rising, but this year there aren’t any restrictions on how we party. We ask experts for their advice</p><p>Christmas is coming, party season is upon us, and for the first time since 2019 the government Grinches aren’t telling us what to do. For two successive festive seasons during the pandemic, the authorities across the UK issued rules to limit Covid’s spread. This year, <a href=\"https://www.gov.scot/coronavirus-covid-19/\">there are</a> <a href=\"https://www.gov.uk/coronavirus\">none</a>. Off you go, enjoy yourselves.</p><p>Normality is hugely welcome, but Covid has not gone away. Infections, while much lower than at their peak, <a href=\"https://www.ons.gov.uk/peoplepopulationandcommunity/healthandsocialcare/conditionsanddiseases/articles/coronaviruscovid19latestinsights/infections\">are rising</a>; the number of people in hospital with Covid in England <a href=\"https://www.theguardian.com/world/2022/dec/15/number-of-people-in-hospital-with-covid-in-england-rises-22-in-a-week\">rose by 22%</a> in the past week alone, while admissions for flu are <a href=\"https://www.thetimes.co.uk/article/flu-infects-more-hospital-patients-than-covid-6l8p9c36r\">even higher</a>. Meanwhile the <a href=\"https://www.telegraph.co.uk/business/2022/12/05/200000-leave-workforce-reported-long-covid/\">huge cost</a> of long Covid to the country’s health and productivity is ever more apparent. What does it mean for this holiday season? We asked the experts.</p> <a href=\"https://www.theguardian.com/world/2022/dec/16/covid-christmas-uk-how-to-stay-safe\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/16/covid-christmas-uk-how-to-stay-safe", "date_published": "2022-12-16 13:23:12+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "How a teenager created one of the UK’s last celluloid-only cinemas", "description": "<p>The retro Slindon Cinema has grown from student Joe Cornick’s passion project to a cherished community hub in a West Sussex village hall</p><p>While studying for his A-levels, Joe Cornick undertook a project close to his heart. He wanted to recreate a retro cinema utilising the local village hall where he grew up.</p><p>Though the 1930s Coronation Hall in Slindon, West Sussex had a full projection box, no projectors had ever been put in. So in 2019, nearly 100 years later, Cornick installed a full 35mm projection facility – thanks to a generous donation of equipment from a cinema in Tonbridge that had gone fully digital.</p> <a href=\"https://www.theguardian.com/film/2022/dec/16/celluloid-slindon-cinema-west-sussex\">Continue reading...</a>", "link": "https://www.theguardian.com/film/2022/dec/16/celluloid-slindon-cinema-west-sussex", "date_published": "2022-12-16 13:17:32+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Police and NCA investigating four Channel boat deaths", "description": "<p>Forces working with French partners ‘to find those responsible and bring them to justice’</p><p>Police are investigating the death of four people after <a href=\"https://www.theguardian.com/uk-news/2022/dec/14/you-could-see-the-panic-how-the-channel-small-boat-incident-unfolded\">a small boat capsized in the Channel</a>, saying they are determined that those who facilitated the crossing face justice.</p><p>Kent police said they were looking into the circumstances surrounding Wednesday’s incident with the support of the National Crime Agency (NCA).</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/16/channel-boat-deaths-police-nca-investigating\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/dec/16/channel-boat-deaths-police-nca-investigating", "date_published": "2022-12-16 13:13:01+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Kanye West has shown us exactly who he is – and yet the public are still listening | Dorian Lynskey", "description": "<p>Despite his antisemitic rants, the rapper now known as Ye is finishing the year in Spotify UK’s top five most-streamed artists</p><p>This year, there has been no spectacle in popular culture more grotesque than the unravelling of Ye, the rapper formerly known as <a href=\"https://www.theguardian.com/music/kanyewest\">Kanye West</a>. But why stop at this year? We have seen other stars make racist statements, experience career-ruining scandals or psychologically disintegrate in public, but to witness all three converge in extremis over two months is unprecedented.</p><p>It should spell career suicide. But Ye has ended the year in the top fivemost-streamed artists of 2022 on Spotify in the UK and the US. His 2021 album Donda is No 43 on Billboard’s chart of the year’s most popular albums. When he isn’t suspended from Twitter, he has 30.6m followers there. As he well knows, media outlets track his every move. People aren’t only still listening; they’re watching, too. Despite being on an apparently terminal course, Ye isn’t about to disappear: this is just the latest chapter in his mission to test the public’s threshold for disgust.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/16/kanye-west-antisemitic-rapper-ye-spotify\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/dec/16/kanye-west-antisemitic-rapper-ye-spotify", "date_published": "2022-12-16 13:00:53+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘We’d kiss each other on stage and simulate sex’: the pioneering gay powerpop of Handbag", "description": "<p>The trio burst on to the mid-70s scene only for their label to bury their debut. As it resurfaces, singer Paul Southwell looks back at a band who would have changed LGBTQ+ history</p><p>In 1971, 19-year-old musician Paul Southwell left Accrington and headed for the bright lights. At that time London’s gay scene consisted of a selection of seedy pubs, after-hours basement drinking dens and regular discos organised by the Gay Liberation Front, which had formed the previous October. But none of the acts playing GLF events were out: most of the entertainment was supplied by decidedly straight bands.</p><p>Southwell would change that. Alongside Dave Jenkins and Alan Jordan, he formed Handbag, a powerpop band whose look was influenced by the Rocky Horror Show and whose material included covers of Lou Reed and David Bowie songs as well as originals about gay motorcycle gangs (Leather Boys) and cruising (42nd East Street). The gay trio quickly built a following, playing GLF benefits, LGBTQ+ events and the busy pub rock circuit, although many gigs were pulled when venue managers realised exactly what kind of act they had booked. “We would dress outrageously,” says Southwell. “We’d kiss each other on stage and simulate sex – whatever a song warranted.”</p> <a href=\"https://www.theguardian.com/music/2022/dec/16/wed-kiss-each-other-on-stage-and-simulate-sex-the-pioneering-gay-powerpop-of-handbag\">Continue reading...</a>", "link": "https://www.theguardian.com/music/2022/dec/16/wed-kiss-each-other-on-stage-and-simulate-sex-the-pioneering-gay-powerpop-of-handbag", "date_published": "2022-12-16 13:00:53+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Fousheé: ‘It’s not acceptable for a Black woman to be angry’", "description": "<p>The US songwriter was making waves with her whisper-quiet R&amp;B-folk. Then she came back with a debut LP stuffed with intense punk-metal. ‘I needed to scream out a few things,’ she says</p><p>For the past eight weeks, US singer-songwriter Britanny Fousheé has been spending her evenings screaming into the faces of filming teens. She is opening on the 24-year-old multi-instrumentalist <a href=\"https://www.theguardian.com/music/2022/jul/08/steve-lacy-us-singer-tiktok-stevie-wonder-prince-kendrick-lamar-bisexual\">Steve Lacy</a>’s world tour, giving audiences waiting for a main act who plays R&amp;B and pop a rude awakening.</p><p>It’s taken time for Fousheé to be heard like this. “From five years old I knew I had a voice – I could sing and I had something to say, but I needed to convince everyone else first,” she says. “They wanted me to be loud – to sing stronger – but I have a soft approach.”</p> <a href=\"https://www.theguardian.com/music/2022/dec/16/foushee-softcore-metal-punk-interview\">Continue reading...</a>", "link": "https://www.theguardian.com/music/2022/dec/16/foushee-softcore-metal-punk-interview", "date_published": "2022-12-16 13:00:52+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Ross McCullam jailed for life for murder of Megan Newborough", "description": "<p>Lab technician to serve minimum of 23 years for killing colleague at his parents’ home in Leicestershire</p><p>Ross McCullam has been jailed for life with a minimum term of 23 years for the murder of his colleague Megan Newborough.</p><p>The 30-year-old lab technician strangled Newborough, 23, and cut her throat at his parents’ house in Leicstershire before dumping her in nearby woodland. Later, he left a voicemail on her phone professing his love for her to try to cover his tracks.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/16/ross-mccullam-jailed-for-life-for-murder-of-megan-newborough\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/dec/16/ross-mccullam-jailed-for-life-for-murder-of-megan-newborough", "date_published": "2022-12-16 12:45:54+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Japan approves biggest military buildup since second world war amid China fears", "description": "<p>US welcomes doubling of military spending but critics express unease over abandoning seven decades of pacifism</p><p>Japan has approved its biggest military buildup since the second world war, warning that China poses the “greatest strategic challenge ever” and outlining plans to develop a counterstrike capability funded by record defence spending.</p><p>The plans, announced by the government on Friday, reflect growing alarm over a more assertive Chinese military and a North Korean regime that continues to improve its nuclear and ballistic missile capabilities.</p> <a href=\"https://www.theguardian.com/world/2022/dec/16/japan-approves-biggest-military-buildup-since-second-world-war-amid-china-fears\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/16/japan-approves-biggest-military-buildup-since-second-world-war-amid-china-fears", "date_published": "2022-12-16 12:39:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Fifteen all out: Sydney Thunder collapse to lowest ever Big Bash total", "description": "<ul><li>Adelaide Strikers dismiss opponents in only 35 balls</li><li>Henry Thornton (5-3) and Wes Agar (4-6) run riot </li></ul><p>The Sydney Thunder have sputtered their way to the lowest total in Big Bash history, just 15 runs, to hand the Adelaide Strikers the easiest of wins at Showground Stadium.</p><p>The Thunder looked in control after restricting the Strikers to 139-9 after losing the toss and being sent into the field on Friday night but were bowled out in 35 balls to come up well short of the previous record for low score (57).</p> <a href=\"https://www.theguardian.com/sport/2022/dec/16/fifteen-all-out-sydney-thunder-collapse-to-lowest-ever-big-bash-total\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/dec/16/fifteen-all-out-sydney-thunder-collapse-to-lowest-ever-big-bash-total", "date_published": "2022-12-16 12:30:05+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Danish government plans to scrap bank holiday to increase defence spending", "description": "<p>New coalition’s proposal to remove Great Prayer Day from calendar met with criticism by church and business owners</p><p>Denmark’s new government, the country’s first left-right coalition since the 1970s, has got off to an unpopular start with the announcement that one of its earliest policy proposals is to scrap a bank holiday.</p><p>The Social Democrat prime minister, Mette Frederiksen, appointed right-leaning political rivals as key ministers in her new reform-oriented government on Thursday, after close-run <a href=\"https://www.theguardian.com/world/2022/nov/01/danish-election-mette-frederiksen-new-party-support\">parliamentary elections last month</a>.</p> <a href=\"https://www.theguardian.com/world/2022/dec/16/denmark-coalition-government-bank-holiday-defence-spending\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/16/denmark-coalition-government-bank-holiday-defence-spending", "date_published": "2022-12-16 12:21:08+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Cold War Steve on Lionel Messi’s potential crowning World Cup glory", "description": "<p>The fourth in a special series <a href=\"https://www.theguardian.com/artanddesign/2019/jun/15/cold-war-steve-satire-is-my-antidote-to-a-scary-world-interview\">by the celebrated visual satirist</a> for the Guardian, previewing the final between Argentina and France</p> <a href=\"https://www.theguardian.com/football/picture/2022/dec/16/cold-war-steve-on-lionel-messi-potential-crowning-world-cup-glory\">Continue reading...</a>", "link": "https://www.theguardian.com/football/picture/2022/dec/16/cold-war-steve-on-lionel-messi-potential-crowning-world-cup-glory", "date_published": "2022-12-16 12:00:51+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Conservative donors pour ‘dark money’ into case that could upend US voting law", "description": "<p>Groups submitting amicus briefs to supreme court case in support of Republican lawmakers received $90m in anonymous donations</p><p>Conservative donors poured tens of millions of dollars of anonymous “dark money” into groups supporting Republican lawmakers in a supreme court case that could upend American election law.</p><p>The donors backed several groups that have filed supreme court amicus briefs in support of North Carolina legislators in <a href=\"https://www.theguardian.com/us-news/2022/dec/06/supreme-court-voting-rights-moore-v-harper-gerrymander-voter-id\">Moore v Harper</a>, according to a recent analysis. They are pushing for a ruling that would take ultimate decisions about voting rights and congressional gerrymandering away from state courts and hand those powers to state legislatures, of which Republicans now control the majority.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/16/dark-money-us-supreme-court-case-voting-law-moore-v-harper\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/16/dark-money-us-supreme-court-case-voting-law-moore-v-harper", "date_published": "2022-12-16 12:00:51+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Saltie Girl, London W1: ‘There is something slapdash about this place’ – restaurant review", "description": "<p>I have taken to leaving restaurants such as this by simply WhatsApping an image of a highwayman to denote paying the bill</p><p>First, let us tackle the name <a href=\"https://www.saltiegirl.com/location/saltie-girl-london/\">Saltie Girl</a>, which, frankly, sounds less than delicious. Which parts of her are salty? Her armpits? Her toes? Her choice of language? The owners of Saltie Girl say the phrase is old Maine colloquial for mermaid, and have opened branches of this seafood-fixated restaurant in Boston, Los Angeles and, now, London. Over here, the name is just odd and slightly offputting, but then, when you’re selling lobster on waffle at £36 a throw, it’s not just the name that will be keeping casual passers-by at bay.</p><p>Saltie Girl has opened its London branch on North Audley Street in Mayfair, a stone’s throw from Selfridge’s in a locale that’s home to <a href=\"https://www.theguardian.com/food/2022/may/27/apricity-london-w1-grace-dent-restaurant-review\">Apricity</a> and <a href=\"https://www.theguardian.com/food/2021/oct/08/bibi-london-w1-restaurant-review-grace-dent\">Bibi</a>, two restaurants I recommend everyone goes to if time, funds and occasion fit, both being outstanding examples of modern, innovative dining and fine service. Saltie Girl, on the other hand, is a highly expensive US import that sells shrimp cocktails, tinned fish and seafood towers, is backed by the people behind <a href=\"https://www.theguardian.com/lifeandstyle/2004/aug/14/foodanddrink.shopping1\">Roka</a> and <a href=\"https://zumarestaurant.com/\">Zuma</a>, and is aimed at their wealthy but not massively discerning audiences.</p> <a href=\"https://www.theguardian.com/food/2022/dec/16/saltie-girl-london-w1-restaurant-review-grace-dent\">Continue reading...</a>", "link": "https://www.theguardian.com/food/2022/dec/16/saltie-girl-london-w1-restaurant-review-grace-dent", "date_published": "2022-12-16 12:00:51+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Suranne Jones on playing Scrooge: ‘I could just be horrible – and it was great!’", "description": "<p>How did the actor prepare to become a new-fangled Ebenezer? By channelling Cruella De Vil and watching Drag Race, of course! She talks about her Christmas gift to Gentleman Jack fans – and how to escape a torpedo tube</p><p>Start your engines, because Suranne Jones is about to become the first ever Scrooge inspired by a TV drag competition. In Christmas Carole, the <a href=\"https://www.theguardian.com/tv-and-radio/2021/aug/28/bbc-vigil-suranne-jones\">Vigil</a> and Doctor Foster star plays a new version of Ebenezer Scrooge – called, of course, Carole. “When I was filming <a href=\"https://www.theguardian.com/tv-and-radio/2022/apr/10/gentleman-jack-series-two-review-one-of-the-greatest-british-period-dramas-of-our-time\">Gentleman Jack</a>, I watched 13 series of RuPaul’s Drag Race,” says Jones. “I told the director, Carole is like a drag persona. At first, he thought I was mad. But she’s got that superhero-ness, that self-belief and confidence and single-mindedness. It was really useful to use Drag Race in that way.” When she read the script, she made a moodboard for what Carole might look like. “Anna Wintour was on there. And Cruella de Vil. And Nicole Kidman from Paddington. Carole is instantly recognisable, with the bob, the red lips, the red bag and the red nails. And I could just be horrible. Really horrible. And it was great.”</p><p>Horrible though Carole may be, it is probably the most cheerful show Jones has done in quite some time. Over the last couple of years, she has stomped her way around the industrial revolution in 19th-century Yorkshire (Gentleman Jack), endured panic attacks and a breakdown (<a href=\"https://www.theguardian.com/tv-and-radio/2021/aug/05/i-am-victoria-review-a-masterclass-in-what-pushes-a-woman-to-the-edge\">I Am Victoria</a>), had a child go missing (<a href=\"https://www.theguardian.com/tv-and-radio/2018/feb/28/save-me-review-suranne-jones-drama-benidorm\">Save Me</a>) and woken up trapped inside a submarine torpedo tube that was slowly filling with water (Vigil). You can understand why, for Christmas, she treated herself to a comedy caper with a side order of singing and dancing.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/16/suranne-jones-interview-christmas-carole-vigil-gentleman-jack-save-me\">Continue reading...</a>", "link": "https://www.theguardian.com/tv-and-radio/2022/dec/16/suranne-jones-interview-christmas-carole-vigil-gentleman-jack-save-me", "date_published": "2022-12-16 12:00:51+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "The Woman in Black by Susan Hill audiobook review – immersive gothic horror", "description": "<p>Narrator Paapa Essiedu delivers the chills in this atmospheric telling of Hill’s classic ghost story</p><p>Susan Hill’s 1983 novella opens on Christmas Eve with the retired solicitor Arthur Kipps at home with his second wife, Esmé, and his stepchildren. When they ask him to tell them a ghost story, he offers up a tale of “haunting and evil, fear and confusion, horror and tragedy … an inextricable part of my past”. It is a story so bleak, he continues, that he cannot say it out loud; he will write it down so that he “might finally be free of it”.</p><p>It concerns a visit made by Kipps as a young man to Eel Marsh House, a coastal mansion at the end of a causeway which is cut off from the mainland at high tide. He has been dispatched there by his boss to settle the affairs of a deceased widow named Alice Drablow. Kipps sifts through acres of paperwork, working through the night alone – or so he thinks. In the midst of his work, he catches glimpses of a ghostly woman dressed in black. Eventually a local man, Sam Daily, informs him that Alice Drablow’s sister Jennet haunts the house. During Jennet’s life, her child died in a terrible accident; legend has it that whenever the woman in black appears, another child dies in the village.</p> <a href=\"https://www.theguardian.com/books/2022/dec/16/the-woman-in-black-by-susan-hill-audiobook-review-immersive-gothic-horror\">Continue reading...</a>", "link": "https://www.theguardian.com/books/2022/dec/16/the-woman-in-black-by-susan-hill-audiobook-review-immersive-gothic-horror", "date_published": "2022-12-16 12:00:51+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Best movies of 2022 in the US: No 6 – The Fabelmans", "description": "<p>Steven Spielberg’s thorny family drama gave us unusual insight into how the world’s most famous director came to be</p><ul><li><a href=\"https://www.theguardian.com/film/2022/dec/06/the-50-best-movies-films-of-2022-in-the-us\">50 best movies of 2022 in the US</a></li><li><a href=\"https://www.theguardian.com/culture/series/2022-in-culture\">More on the best culture of 2022</a></li></ul><p>The first thing you realize watching The Fabelmans is that Steven Spielberg has been telling the story of his childhood in bits and pieces throughout his career – through the domestic turmoil in Close Encounters of the Third Kind, the suburban expanses of ET the Extra Terrestrial, and the many lost boys left to grow up on their own. Yet Spielberg has waited until now to tell his story directly, from the perspective of a grownup who may have experienced a turbulent adolescence, but didn’t fully comprehend the complexities of adult relationships until he aged a little himself and could see the past more clearly.</p><p>Along with great films such as Armageddon Time and Aftersun, 2022 has been a year of thorny nostalgia pieces, with directors rejecting the cozy conventions of the coming-of-age film in order to interrogate memories rather than preserve them in amber. With a crucial assist from Tony Kushner, who brought so much dimension to Spielberg’s West Side Story last year, the script for The Fabelmans is structured around a boy’s journey from his magical first trip to the movies, where he thrilled to the spectacle of The Greatest Show on Earth, to his appearance on a studio lot as a young adult. Yet the way his movie-love dovetails with family upheaval makes an important point about Spielberg’s brand of commercial film-making: blockbusters don’t have to be impersonal.</p> <a href=\"https://www.theguardian.com/film/2022/dec/16/best-movies-of-2022-in-the-us-no-6-the-fabelmans\">Continue reading...</a>", "link": "https://www.theguardian.com/film/2022/dec/16/best-movies-of-2022-in-the-us-no-6-the-fabelmans", "date_published": "2022-12-16 12:00:50+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "It’s not enough for Labour to be a nicer version of the Tories. It must take risks for what is right | Simon Jenkins", "description": "<p>Instead of fighting for the centre ground, Keir Starmer should look to the radical changes pushed through under Harold Wilson</p><p>The pitch is being rolled for Keir Starmer’s entry to No 10. Titles on the prospect of a Labour Britain already line the bookshop shelves, from Oliver Eagleton’s The Starmer Project to Lisa Nandy’s <a href=\"https://www.theguardian.com/books/2022/nov/28/all-in-how-we-build-country-that-works-by-lisa-nandy-review-why-labour-must-give-power-to-the-people\">All In</a>. Who is he really? Is he a socialist in sheep’s clothing, or just another moderate, pragmatic, oh-so-hesitant Labour leader trapped in an ideological no-man’s-land between left and “left-of-centre”?</p><p>The one label that no one could pin on Starmer is “radical”. After the trauma of Liz Truss, economic policy has sunk into a grim torpor. Starmer has eschewed alternative economic models, terrified of the reaction of markets and thus, possibly, of voters. He is so fearful of the issue of Brexit – <a href=\"https://www.kcl.ac.uk/news/leavers-more-likely-to-regret-brexit-vote-than-remainers-study-finds\">which many Britons who voted for it now regret</a> – that he has become its most effective supporter. On social policy, Labour is all platitude and nothing structural. Britain is drifting down Europe’s league table on health outcomes, <a href=\"https://www.gov.uk/government/publications/united-kingdom-drug-situation-focal-point-annual-report/uk-drug-situation-2019-summary\">drug abuse</a>, <a href=\"https://www.russellwebster.com/how-does-our-prison-system-compare/#:~:text=In%20January%202021%2C%20the%20prison,116.1%20and%20median%20of%20101.8\">prison population</a> and <a href=\"https://commonslibrary.parliament.uk/research-briefings/sn01403/#:~:text=European%20context,applications%20for%20every%2010%2C000%20people.\">reception of migrants</a>. Yet Labour only promises to do broadly more of the same. A Starmer government would be a more generous sort of Tory one.</p><p>Simon Jenkins is a Guardian columnist</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/16/labour-tories-keir-starmer-radical-harold-wilson\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/dec/16/labour-tories-keir-starmer-radical-harold-wilson", "date_published": "2022-12-16 11:52:10+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Argentina’s fall against Saudi Arabia may have set them on a shining path", "description": "<p>If France are taking hope from their World Cup final opponents’ defeat in their first match, then they really ought to think again</p><p>It may feel as if a sporting lifetime has passed since Saudi Arabia turned Argentina over, but it was only three and a half weeks ago. A massive shock <a href=\"https://www.theguardian.com/football/2022/nov/22/argentina-saudi-arabia-world-cup-group-c-match-report#:~:text=Saudi%20Arabia%20stun%20Argentina%20as,World%20Cup%202022%20%7C%20The%20Guardian\">that animated the whole World Cup</a>, it begged many questions, not least about the prospects for Lionel Messi and his team at this tournament.</p><p>It turned out that those prospects were rosy, and any footballing obituaries now seem hasty as Argentina have since won five games on the trot in Qatar to stand 90 minutes (or 120, or 145 with injury time) from history. On reflection, then, the Saudi upset seems even more extraordinary. Given Argentina’s 36-game unbeaten run going into the tournament, what was it that the Green Falcons had that dozens of other teams did not?</p> <a href=\"https://www.theguardian.com/football/2022/dec/16/argentina-france-world-cup-final-preview-saudi-arabia\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/16/argentina-france-world-cup-final-preview-saudi-arabia", "date_published": "2022-12-16 11:46:19+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Kendrick, White Lotus, Top Gun and more – our favourite pop culture of 2022", "description": "<p>To kick off list season, these are the films, shows, albums, podcasts and books we couldn’t get enough of this year</p><p>This week we’re highlighting some of the great culture released in 2022. We won’t be offering a definitive ranking – that’s being very handily covered by the Guardian’s various arts desks, from <a href=\"https://www.theguardian.com/film/2022/dec/06/the-50-best-films-movies-of-2022-in-the-uk\">film</a> and <a href=\"https://www.theguardian.com/music/2022/dec/06/the-50-best-albums-of-2022\">music</a> to <a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/02/the-50-best-tv-shows-of-2022\">TV</a> and <a href=\"https://www.theguardian.com/stage/2022/dec/15/the-best-theatre-of-2022\">stage</a>, with art and games still to come. Instead, this is a spotlight on our favourite releases – big and small – from the year that culture came roaring back after a pandemic-themed start to the decade.</p><p>Indeed, 2022 saw cinemas, gig venues, theatres, concert halls and festivals finally packed with up-for-it audiences again. Meanwhile, performers were able to showcase what they had been cooking up in those lost lockdown months, and in many cases the results were spectacular. The news wasn’t all positive, though. In the UK, venues that were already struggling post-pandemic had to contend with a cost of living crisis that made operating impossible for some, while a radical reshaping of Arts Council funding created some winners, but a lot of <a href=\"https://www.theguardian.com/commentisfree/2022/dec/09/the-guardian-view-on-cuts-in-theatre-funding-a-threat-to-playwriting\">losers</a>. The demise of the <a href=\"https://www.theguardian.com/film/2022/oct/07/edinburgh-film-festival-changed-culture-its-closure-is-a-serious-loss-to-cinema\">Edinburgh International film festival</a> showed that even institutions many would consider part of the cultural furniture are vulnerable in these straitened times.</p> <a href=\"https://www.theguardian.com/culture/2022/dec/16/the-guide-best-pop-culture-2022\">Continue reading...</a>", "link": "https://www.theguardian.com/culture/2022/dec/16/the-guide-best-pop-culture-2022", "date_published": "2022-12-16 11:45:50+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Digested week: give me The White Lotus over Harry and Meghan any day", "description": "<p>I lasted two episodes of the royal couple’s series before bailing out. Turns out I’m just not that interested</p><p>An old friend died recently. The cause of death has not been made public, but he is believed to have killed himself. The news came as a profound shock. Though I knew he had had mental health problems, I thought he was largely out the other side and had found a way of living with them. Our relationship was unusual. We rarely – if ever – socialised together, but knew each other intimately. We were in the same psychotherapy group for many years. I’m still going. He was a lovely man. Generous, warm, kind and very, very funny. And damaged. Though you can take that as read. My heart goes out to his wife and children. When I <a href=\"https://www.theguardian.com/lifeandstyle/2021/dec/27/i-was-a-heroin-addict-and-had-given-up-on-myself-then-suddenly-briefly-i-felt-a-desire-to-live\">was in rehab</a> more than 35 years ago, one of the counsellors told us that, statistically speaking, half of us would be dead within 15 years or so. At the time I just thought she was trying to shock us into changing our behaviour, but it turned out she was telling no more than the truth. Half of us were dead well within the time frame. Since then the death rate among those people I knew who were addicts has at times felt attritional. Quite apart from the usual suspects of relapse, overdose, Aids and suicide, the incidence of death through cancer and heart disease have been far higher among the addicts I know than other people. It might just be a coincidence but I suspect not. My dad, towards the end of his life, used to say that old age wasn’t for wimps. I’m beginning to know how he felt. The number of people who used to know me as a young man are getting fewer and fewer. It’s starting to get lonely.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/16/digested-week-give-me-the-white-lotus-over-harry-and-meghan-any-day\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/dec/16/digested-week-give-me-the-white-lotus-over-harry-and-meghan-any-day", "date_published": "2022-12-16 11:20:44+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "UK house prices expected to fall by 8%  next year, says Halifax", "description": "<p>Lender says market rebalancing after years of growth, as mortgage rates and cost of living push prices down</p><p>Rising mortgage costs and the broader cost of living crisis will push house prices down by about 8% next year, according to a forecast by the lender Halifax.</p><p>Halifax, which in November reported the largest monthly fall in house prices in 14 years, said the market was now rebalancing after years of conditions that have resulted in some of the biggest rises in house prices ever recorded.</p> <a href=\"https://www.theguardian.com/money/2022/dec/16/uk-house-prices-fall-next-year-halifax-forecast\">Continue reading...</a>", "link": "https://www.theguardian.com/money/2022/dec/16/uk-house-prices-fall-next-year-halifax-forecast", "date_published": "2022-12-16 11:10:18+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Migrant surges hint at chaos at US-Mexico border once Title 42 expires", "description": "<p>Critics of Covid migration restriction, ending next week, say it illegally prevents asylum claims and places migrants in danger</p><p>More than 1,500 undocumented people <a href=\"https://www.elpasotimes.com/picture-gallery/news/immigration/2022/12/12/hundreds-migrants-cross-rio-grande-mass-hoping-seek-asylum/10881350002/\">hurried across</a> the US-Mexico border into west Texas all at once last weekend, surprising the city of El Paso, which is <a href=\"https://www.theguardian.com/us-news/2022/oct/10/el-paso-texas-migrants-shelter-border-crossings-surge\">no stranger</a> to dealing with migration.</p><p>The group included many Nicaraguans, who said they were freed by Mexican authorities after being kidnapped last week.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/16/title-42-expires-us-mexico-border-migrants\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/16/title-42-expires-us-mexico-border-migrants", "date_published": "2022-12-16 11:00:50+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "My shabby shed poses a planting problem: the answer is rhubarb | Alys Fowler", "description": "<p>A dry shady area around my tatty old shed needs a creative approach</p><p>I own a shed. It is possibly the cheapest, most shoddily built shed going. I like it but it is not pretty enough to make me happy when I have to look at it every time I open the back door. So I moved it. Now it sits between the end of the privet hedge and an old lilac, in a dark, dry nook where little would otherwise grow.</p><p>It sits on a very slapped-together base made up of all the ugly concrete slabs that were kicking around, with many gaps and strange levels to boot. I have a healthy population of slow worms in the garden and I am sure they will enjoy napping in these gaps, but this doesn’t quite solve the aesthetic problem.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/16/my-shabby-shed-poses-a-planting-problem-the-answer-is-rhubarb\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/16/my-shabby-shed-poses-a-planting-problem-the-answer-is-rhubarb", "date_published": "2022-12-16 11:00:50+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "The best dance of 2022", "description": "<p>Exhilarating highlights this year ranged from tech-savvy ballet and a juggling celebration of Merce Cunningham to a daring flamenco Rite of Spring</p><p>• <a href=\"https://www.theguardian.com/culture/series/2022-in-culture\">More of the best culture of 2022</a></p><p>When Strictly’s Johannes Radebe sashayed across the stage in a costume made from flags of all the countries where homosexuality is illegal, it was clear there was more to this touring show than glamour and cosy chat. Executed with the Latin champ’s megawatt warmth and charm, even hardened critics were on their feet. <a href=\"https://www.theguardian.com/stage/2022/apr/04/johannes-radebe-freedom-review-strictly-star-leaves-it-all-on-the-floor\">Read the full review</a> <em>LW</em></p> <a href=\"https://www.theguardian.com/stage/2022/dec/16/the-best-dance-of-2022\">Continue reading...</a>", "link": "https://www.theguardian.com/stage/2022/dec/16/the-best-dance-of-2022", "date_published": "2022-12-16 11:00:50+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Can America’s low-cost mobile homes withstand the climate crisis?", "description": "<p>From Vermont to Montana, efforts are underway to protect residents in flood-vulnerable locations </p><p><em>This article originally appeared in <a href=\"https://nexusmedianews.com/\">Nexus Media News</a>.</em></p><p>Charlotte Bishop was standing at her kitchen window in January 2019 when she saw water streaming into her yard. A block of ice had clogged the brook that snakes around the mobile home park where she and her husband Rollin live in Brattleboro, Vermont.<em> </em>Bishop grabbed her keys and rushed outside to move their cars to higher ground. Within minutes, she was wading through knee-high water.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/16/us-mobile-home-flood-risk-climate-crisis\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/16/us-mobile-home-flood-risk-climate-crisis", "date_published": "2022-12-16 11:00:49+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Houseplant of the week: poinsettia", "description": "<p>This plant is as festive as they come – and you can coax them to flower next year</p><p><strong>Why will I love it?<br /></strong>This is the most festive of houseplants: for me, just the sight of <em>Euphorbia pulcherrima</em>’s scarlet bracts conjure up the scent of cinnamon candles, mulled wine and cosy fireside nights.</p><p><strong>Light or shade?<br /></strong>Bright indirect sunshine.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/16/houseplant-of-the-week-poinsettia\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/16/houseplant-of-the-week-poinsettia", "date_published": "2022-12-16 11:00:49+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Prep your replies, take deep breaths (and don’t apologise for burnt spuds) – how to get through Christmas without falling out with your family", "description": "<p>Here’s how to keep calm around the dinner table this year with our advice expert’s guide to defusing festive feuds</p><p>Christmas is only universally joyous for children. At some point you grow up and it gets complicated. At least that is how it seems from the <a href=\"https://www.theguardian.com/lifeandstyle/series/ask-annalisa-barbieri\" title=\"\">letters I receive</a>. They start to roll in around August and although the details and personalities change, the story always goes something like this: “I want to spend Christmas doing X, but my parents/in-laws/siblings want me to do Y. How can I tell them that’s not what I want to do?” </p><p>These are people perfectly used to dealing with tricky situations in their professional lives, but Christmas combined with family expectations seems to catapult them back to their childhoods.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/16/how-to-get-through-christmas-without-falling-out-with-your-family\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/16/how-to-get-through-christmas-without-falling-out-with-your-family", "date_published": "2022-12-16 11:00:49+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "UK politics live: Rishi Sunak refuses to concede to pressure as Tory row over nurses’ pay grows", "description": "<p>Prime minister is in Northern Ireland as Conservatives split over pay rise for nurses</p><p>The prime minister has said he is working “flat out” to try and restore the powers sharing executive in Northern Ireland.</p><p>Speaking during a visit to Belfast, Rishi Sunak said:</p><p>“I am really committed to resolving some of the issues with the (Northern Ireland) protocol, protecting Northern Ireland’s place in the union, in the United Kingdom, and in doing so, restoring the Executive.</p><p>“That is what the people in Northern Ireland need and deserve and that is what I am working flat out to try and deliver.</p> <a href=\"https://www.theguardian.com/politics/live/2022/dec/16/uk-politics-live-rishi-sunak-in-northern-ireland-as-tory-row-over-nurses-pay-grows\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/live/2022/dec/16/uk-politics-live-rishi-sunak-in-northern-ireland-as-tory-row-over-nurses-pay-grows", "date_published": "2022-12-16 10:50:47+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Amazon agrees deal with Games Workshop to create Warhammer TV series", "description": "<p>Former Superman star Henry Cavill linked to project, and agreement includes film and merchandise plans</p><p>Amazon has struck a deal with the high street games chain Games Workshop to create a series based on its hit franchise Warhammer, the science-fiction fantasy miniature war game, potentially featuring the former Superman star Henry Cavill.</p><p>The London-listed Games Workshop, which has a £2.7bn market value and runs about 530 stores, has struck a deal with Amazon to develop the company’s intellectual property into film and TV productions as well as sell merchandise.</p> <a href=\"https://www.theguardian.com/technology/2022/dec/16/amazon-agrees-deal-with-games-workshop-to-create-warhammer-tv-series-henry-cavill\">Continue reading...</a>", "link": "https://www.theguardian.com/technology/2022/dec/16/amazon-agrees-deal-with-games-workshop-to-create-warhammer-tv-series-henry-cavill", "date_published": "2022-12-16 10:45:39+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘I’m parking my guilt’: confessions of a celebrity children’s book ghost writer", "description": "<p>As an author whose own books never find their way to supermarket shelves, it’s frustrating work – but it puts food on my family’s table</p><p>Once a rare species, <a href=\"https://www.theguardian.com/books/2020/dec/12/famous-first-words-how-celebrities-made-their-way-on-to-childrens-bookshelves\">celebrity authored children’s books</a> have become stalwarts of supermarket books aisles. Perfect for a grandparent hunting a last-minute Christmas gift, or a parent looking for something that will appeal to a child reluctant to read, books by stars have become the go-to for many. Those buying them might have it in the back of their minds that these “authors” might not have done much of the writing. But that doesn’t matter, does it? As long as the kids are reading, that’s what counts.</p><p>For children’s authors who do write their own stuff, it’s a little galling. They’d give their hind teeth for a spot on that shelf – and surely they are no less deserving of exposure and recognition. As a writer of children’s fiction, I’ve been known to turn a shade of green, too. But I’m conflicted, because in addition to writing original and mostly unrecognised books for young readers, I also work as a ghost writer. </p> <a href=\"https://www.theguardian.com/books/2022/dec/16/im-parking-my-guilt-confessions-of-a-celebrity-childrens-book-ghost-writer\">Continue reading...</a>", "link": "https://www.theguardian.com/books/2022/dec/16/im-parking-my-guilt-confessions-of-a-celebrity-childrens-book-ghost-writer", "date_published": "2022-12-16 10:41:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Russia begins mass airstrike in apparent move to destroy Ukraine’s power grid", "description": "<p>Power outages reported after barrage of rockets fired at several regions in second mass strike in days</p><ul><li><a href=\"https://www.theguardian.com/world/live/2022/dec/16/russia-ukraine-war-live-ukrainian-officials-warn-of-major-new-russian-offensive-us-senate-approves-800m-in-aid\">Russia-Ukraine war: latest updates</a></li></ul><p>The second mass air attack in days has been launched by Russia across Ukraine, with a barrage of rockets fired at several regions across the country.</p><p>The aim of the mass attack, authorities said, appeared to be to destroy the Ukrainian power grid in the hope that damaging Ukraine away from the frontline would enable Russia to make gains on the battlefield.</p> <a href=\"https://www.theguardian.com/world/2022/dec/16/russia-begins-mass-air-strike-in-apparent-move-to-destroy-ukraines-power-grid\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/16/russia-begins-mass-air-strike-in-apparent-move-to-destroy-ukraines-power-grid", "date_published": "2022-12-16 10:26:54+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Huge cylindrical aquarium housing 1,500 exotic fish bursts in Berlin", "description": "<p>Two people injured by broken glass as 1m litres of water pour out of 14-metre-high tank</p><p>A freestanding cylindrical aquarium housing about 1,500 exotic fish has burst in Berlin, causing a wave of devastation in and around the Sea Life tourist attraction, police have said.</p><p>Glass and other debris were swept out of the DomAquarée complex, which houses a Radisson hotel, a museum, shops and restaurants, as 1m litres of water poured out of the 14-metre-high tank shortly before 6am.</p> <a href=\"https://www.theguardian.com/world/2022/dec/16/huge-cylindrical-aquarium-housing-1500-exotic-fish-bursts-in-berlin\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/16/huge-cylindrical-aquarium-housing-1500-exotic-fish-bursts-in-berlin", "date_published": "2022-12-16 10:24:15+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "After ditching Henry Cavill’s Superman, can James Gunn really turn DC around?", "description": "<p>The studio’s new chief exec has enjoyed a trigger-happy start, scrapping Cavill’s Man of Steel as well as Wonder Woman 3. But he must be given time to realise his vision</p><p>It’s impossible not to feel sorry for Henry Cavill, given the news this week that the statuesque Englishman <a href=\"https://www.theguardian.com/film/2022/dec/15/henry-cavill-dropped-as-superman-after-james-gunn-announces-new-movie\">will not be returning to the role of Superman</a> after all. Apparently DC supremo James Gunn is planning a reboot that will focus on the superhero’s younger years, which sounds like another mighty kick in the kryptonites for the guy who’s been playing him for the past decade.</p><p>All this after Cavill returned to the role in a <a href=\"https://www.youtube.com/watch?v=kK9BqBUYeaw\">mid-credits scene during the recent Black Adam</a>, which seemed to tee up a future tête-à-tête with Dwayne Johnson’s musclebound antihero. Then there’s the small matter of Cavill having announced his own return to the role as recently as October, having reportedly been given permission to do so by Warner Bros.</p> <a href=\"https://www.theguardian.com/film/2022/dec/16/henry-cavill-superman-james-gunn-dc\">Continue reading...</a>", "link": "https://www.theguardian.com/film/2022/dec/16/henry-cavill-superman-james-gunn-dc", "date_published": "2022-12-16 10:14:01+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "A placard on the street said all we need to know about the violation of Child Q | Lola Okolosie", "description": "<p>The protest against the police abuse of a teenage girl at her school showed that people refuse to tolerate black children being seen as less than human</p><ul><li>What was the image on your phone that defined 2022? <a href=\"https://www.theguardian.com/commentisfree/series/snapshot-of-2022\">Writers give their perspectives</a></li></ul><p>“Someone walked into the school, where I was supposed to feel safe, took me away from the people who were supposed to protect me and stripped me naked, while on my period.” These are the words of the 15-year-old black girl we now know as <a href=\"https://www.theguardian.com/uk-news/2022/jun/15/child-q-four-met-police-officers-facing-investigation-over-strip-search\">Child Q</a>. In this devastating summary of her violation, Child Q makes clear what key professionals were unwilling to recognise that day: she was a child in need of safeguarding.</p><p>Two years stretched between that harrowing ordeal in 2020 and Hackney council’s report on how it could have happened; the conclusion being that “<a href=\"https://chscp.org.uk/wp-content/uploads/2022/03/Child-Q-PUBLISHED-14-March-22.pdf\">racism … was likely</a> to have been an influencing factor in the decision to undertake the strip-search”. In August, a report by the children’s commissioner for England, Dame Rachel de Souza, found that black children made up nearly 60% of the <a href=\"https://www.theguardian.com/uk-news/2022/aug/08/police-data-raises-alarm-over-welfare-of-strip-searched-children\">650 who underwent</a> a police strip-search between 2018 and 2020. More than half of those searches resulted in no further action.</p><p>Lola Okolosie is an English teacher and writer focusing on race, politics, education and feminism</p><p><em><strong>Do you have an opinion on the issues raised in this article? If you would like to submit a response of up to 300 words by email to be considered for publication in our <a href=\"https://www.theguardian.com/letters\">letters</a> section, please <a href=\"mailto:guardian.letters@theguardian.com?body=Please%20include%20your%20name,%20full%20postal%20address%20and%20phone%20number%20underneath%20your%20letter.%20Letters%20are%20usually%20published%20with%20the%20author’s%20name%20and%20city/town/village.%20The%20rest%20of%20the%20information%20is%20for%20verification%20only%20and%20to%20contact%20you%20if%20your%20letter%20is%20used.\">click here</a>.</strong></em></p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/16/placard-violation-child-q-protest-police-abuse-black-children\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/dec/16/placard-violation-child-q-protest-police-abuse-black-children", "date_published": "2022-12-16 10:00:50+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Amy Bloom: ‘Nigella Lawson is God (if we’re lucky)’", "description": "<p>The American author on finding comfort in cookbooks, the allure of Jane Austen, and how Octavia Butler opened her mind to science fiction</p><p><strong>My earliest reading memory</strong><br />Learning how to read with Superman comic books on the floor of the barber’s shop my Dad went to every Saturday morning, when I was three. That same year, I branched out to Supergirl, Superdog and Superboy.</p><p><strong>My favourite book growing up<br /></strong>The more appropriate was Little Women by <a href=\"https://www.theguardian.com/books/2014/feb/03/100-best-novels-little-women-louisa-may-alcott\">Louisa May Alcott</a>. Like so many other girls, I identified with Jo and her temper and her unappreciated talent, despised Amy, grieved for Beth and was utterly indifferent to Meg and whatever conventional visions of happiness she had. My other favourite was A House Is Not a Home, the memoir of a New York madam, by Polly Adler. Despite the fact that I didn’t really grasp what the girls did in the evening I loved this book for its portrait of backstage life, as it were, and female solidarity. And I love that neither the librarian, nor my mother, took it out of my hands.</p> <a href=\"https://www.theguardian.com/books/2022/dec/16/amy-bloom-nigella-lawson-is-god-if-were-lucky\">Continue reading...</a>", "link": "https://www.theguardian.com/books/2022/dec/16/amy-bloom-nigella-lawson-is-god-if-were-lucky", "date_published": "2022-12-16 10:00:49+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Experience: a baby seal broke into our home", "description": "<p>It made its way into the spare room and on to a couch. ‘Oi, no!’ I said</p><p>We moved to Mount Maunganui, a small seaside community in New Zealand’s beautiful Bay of Plenty, 10 years ago for my husband Phil’s work as a marine biologist. I had seen seals around Pilot Bay, which is near here. Sometimes you see them out on the rocks, sunning themselves or playing – but usually in their own territory.</p><p>It was a dark winter morning in August this year when the seal came. At 5.50am, I left the house to go fitness training. I went down to the car parked in the driveway and heard a growl. I thought our ballsy cat, Coco, must have chased a dog under the car.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/16/experience-a-baby-seal-broke-into-our-home\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/16/experience-a-baby-seal-broke-into-our-home", "date_published": "2022-12-16 10:00:49+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "High on Life review – limp gunplay and questionable taste", "description": "<p><strong>Xbox, PC; Squanch Games</strong><br />This first-person shooter from Rick and Morty’s co-creator pairs a barrage of nihilistic jokes with flimsy gameplay</p><p>I honestly can’t tell you whether High on Life is funny. Humour is subjective, sure, but also, after eight hours of this game’s rapid-fire jokes, I’m not sure I even know any more. You spend enough time spacefaring in Rick and Morty co-creator Justin Roiland’s orbit and eventually, you get sucked into the void. It’s no longer a series of clearly delineated jokes, more a transcendental oneness with an eternal bit. Body fluids. Self-reflexive observations. Observations about the self-reflexive observations. Casual misanthropy. More body fluids. You switch from a grin to a grimace every 15 seconds and at some point, your face just goes numb.</p><p>I can tell you that this game is consistently creative, even when new studio Squanch’s design chops fail them. You play a nameless teen bounty hunter paired up with a talking gun, travelling the universe attempting to free humanity from an alien crime syndicate that wants to use us as drugs. Along the way, you’ll use your chattering gun’s abilities to solve traversal puzzles in a Metroid Prime sort of way, and do a lot of shooting. There are some genuinely nifty and thoughtful combat options, like a ricocheting sawblade that you can bonk back at baddies, or a shotgun that hoovers protective slime from your foes.</p><p>High on Life is out now; £46.49, or included with a Game Pass subscription<br /><br /></p> <a href=\"https://www.theguardian.com/games/2022/dec/16/high-on-life-review-limp-gunplay-and-questionable-taste\">Continue reading...</a>", "link": "https://www.theguardian.com/games/2022/dec/16/high-on-life-review-limp-gunplay-and-questionable-taste", "date_published": "2022-12-16 10:00:49+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "The 50 best albums of 2022: No 6 – Arctic Monkeys: The Car", "description": "<p>The Sheffield quartet’s elegant, lounge-funk-inflected seventh album was an introspective, elliptical ode to a time that may only live in the mind of its frontman</p><ul><li><a href=\"https://www.theguardian.com/music/2022/dec/06/the-50-best-albums-of-2022\">The 50 best albums of 2022</a></li><li><a href=\"https://www.theguardian.com/music/2022/dec/05/the-20-best-songs-of-2022\">The best songs of 2022</a></li><li><a href=\"https://www.theguardian.com/culture/series/2022-in-culture\">More of the best culture of 2022</a></li></ul><p>Late theorist and writer Mark Fisher didn’t especially like <a href=\"https://www.theguardian.com/music/arcticmonkeys\">Arctic Monkeys</a>. He considered the Sheffield band an example of how so much “new” art in the 21st century is rooted in nostalgia. “Arctic Monkeys airbrush cultural time out and appeal to this endless return and timelessness of rock,” <a href=\"https://crackmagazine.net/article/long-reads/mark-fisher-interview/\">he said to Crack magazine</a> in 2014. It’s undeniable that part of the band’s success across two decades – from Myspace-propelled teens, to bona fide rock stars, to cosmic piano crooners in space – has relied on this innate sense of timelessness. But it’s hard not to wonder what Fisher would have thought listening to <a href=\"https://www.theguardian.com/music/2022/oct/18/arctic-monkeys-the-car-review-aching-songs-of-soured-dreams\">The Car</a>, the group’s refined, lounge-y, cinematic, orchestral seventh album. Nodding to Bowie, the Beatles and bossa nova, it seems in its own way to be contemplating time.</p><p>In <a href=\"https://www.nme.com/big-reads/arctic-monkeys-cover-interview-2022-the-car-3332436\">an interview with NME</a>, frontman Alex Turner said of The Car: “So much of this new music is scratching at the past and how much of it I should hang on to.” It makes sense: Arctic Monkeys’ best music has always been about yearning in all its forms; here, this is manifest in Turner’s unmistakable, swooning vocals, brimming with intimacy and lyrical longing, and instrumentals that make moods of love, lust, grief, insecurity and dislocation flutter somewhere deep within. The Car delves into depths and subtleties of feeling with gilded music that belongs to a past which never existed: velveteen strings, gleaming keys and licks of guitar that veer from funky to blazing and anticipatory.</p> <a href=\"https://www.theguardian.com/music/2022/dec/16/the-50-best-albums-of-2022-no-6-arctic-monkeys-the-car\">Continue reading...</a>", "link": "https://www.theguardian.com/music/2022/dec/16/the-50-best-albums-of-2022-no-6-arctic-monkeys-the-car", "date_published": "2022-12-16 10:00:48+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "World Cup 2022: Infantino speaks to media as France and Argentina prepare for final – live", "description": "<ul><li>News and updates from Qatar before Sunday’s World Cup final</li><li>Get in touch! <a href=\"mailto:luke.mclaughlin.casual@theguardian.com\">Email Luke</a> or <a href=\"https://twitter.com/LukeMcLaughlin\">tweet @LukeMcLaughlin</a></li></ul><p><strong>What have we learned from Qatar 2022?</strong> Max Rushden and guests discuss the controversies and ethical issues of the past few weeks in today’s Football Daily Podcast:</p><p><strong>An app providing migrant workers</strong> in <a href=\"https://www.theguardian.com/world/qatar\">Qatar</a> with information on their rights and the possibility of legal assistance has been launched by three trade unions, the first definitive legacy for workers exploited in the process of delivering the World Cup.</p> <a href=\"https://www.theguardian.com/football/live/2022/dec/16/world-cup-2022-gianni-infantino-fifa-speaks-france-argentina-final-live\">Continue reading...</a>", "link": "https://www.theguardian.com/football/live/2022/dec/16/world-cup-2022-gianni-infantino-fifa-speaks-france-argentina-final-live", "date_published": "2022-12-16 09:50:04+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Rehan Ahmed to become England’s youngest ever men’s Test debutant", "description": "<ul><li>Ben Stokes names 18-year-old all-rounder in side for third Test</li><li>Pakistan batter Azhar Ali to retire from international cricket</li></ul><p>As one international career comes to an end in Karachi, another dawns, with Pakistan’s Azhar Ali announcing the series finale will be his final appearance, if selected, and England confirming a much-anticipated debut for 18-year-old Rehan Ahmed.</p><p>Ahmed first, one of two changes to the England side that took an unassailable 2-0 lead in Multan. Leicestershire’s leg-spinning all-rounder was named as a straight swap for Will Jacks, while Ollie Pope has been relieved of the gloves to focus on his batting, Ben Foakes returning and Jimmy Anderson told to rest his 40-year-old legs.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/16/rehan-ahmed-to-become-england-youngest-ever-mens-test-debutant-cricket-azhar-ali\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/dec/16/rehan-ahmed-to-become-england-youngest-ever-mens-test-debutant-cricket-azhar-ali", "date_published": "2022-12-16 09:24:38+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "New app offers Qatar’s migrant workers first definitive World Cup 2022 legacy", "description": "<ul><li>Users can access information on rights and legal assistance</li><li>Platform is ‘only initiative made by and for migrant workers’</li></ul><p>An app providing migrant workers in Qatar with information on their rights and the possibility of legal assistance has been launched by three trade unions, the first definitive legacy for workers exploited in the process of delivering the World Cup.</p><p>With the month-long tournament ending on Sunday when Argentina play France in the final, the failure of Fifa and football associations to deliver positive change for workers has been decried this week by a number of charities and NGOs.</p> <a href=\"https://www.theguardian.com/football/2022/dec/16/new-app-offers-qatars-migrant-workers-first-definitive-world-cup-2022-legacy\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/16/new-app-offers-qatars-migrant-workers-first-definitive-world-cup-2022-legacy", "date_published": "2022-12-16 09:00:47+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Top Gun: Maverick to Glass Onion – the best films to watch over the festive period", "description": "<p>From the belated return of Tom Cruise’s dogfighting ace to Daniel Craig’s deliciously knotty whodunnit, it’s the best movies to enjoy with a mouth full of mince pie</p> <a href=\"https://www.theguardian.com/film/2022/dec/16/top-gun-maverick-to-glass-onion-the-best-films-to-watch-over-the-festive-period\">Continue reading...</a>", "link": "https://www.theguardian.com/film/2022/dec/16/top-gun-maverick-to-glass-onion-the-best-films-to-watch-over-the-festive-period", "date_published": "2022-12-16 09:00:46+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "How Strasbourg became the evergreen ‘capital of Christmas’", "description": "<p>From sustainable gifts to energy-efficient fairy lights and hotels using only local products, here’s how to have yourself an eco-friendly Christmas in France</p><p>It’s mid-morning on a December Saturday and Strasbourg’s rue des Orfèvres is rammed with festive shoppers. They’re gawping into patisserie shops and jewellery boutiques, snapping photos and soaking up the festive cheer on this narrow street close to the city’s mighty cathedral. Above our heads, the ancient buildings’ facades are decorated with giant baubles, fat teddy bears and glittery bows and, while you can see a web of fairy lights wound among these arrangements, the lights are decidedly “off”.</p><p>Strasbourg, the self-proclaimed French “capital of Christmas”, draws 2.5 million visitors to its world-famous <em>marché de Noël</em>. This year, efforts to make the yuletide fun more eco-friendly are in tune with other city-wide initiatives, such as the 373 miles (600km) of bike paths that saw it crowned “cycling capital of France”. This means those Christmas lights won’t be switched on until sundown and will go off at 11pm (when previously they were on 24/7). Many have been replaced by more energy-efficient LEDs and the city has been clever not to double up by hanging lights where businesses have their own bright decorations.</p> <a href=\"https://www.theguardian.com/travel/2022/dec/16/strasbourg-christmas-break-france-eco-friendly\">Continue reading...</a>", "link": "https://www.theguardian.com/travel/2022/dec/16/strasbourg-christmas-break-france-eco-friendly", "date_published": "2022-12-16 08:53:10+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "New find details deadly chapter in Butch and Sundance’s escape to South America", "description": "<p>Killing of officer in Chilean town of Antofagasta set in motion events that led to pair’s death in shootout with Bolivian soldiers</p><p>The two outlaws spent their nights carousing in the bordellos of a far west mining town where they were holed up, on the run from the law. One night, one of the fugitives got into a brawl at an after-hours restaurant. Lawmen arrived and ordered everyone into the street, but the drunken bandit drew his gun. He fired a single shot; an officer died.</p><p>The 1905 scene did not play out in the US, but in the Chilean port of Antofagasta – a boom town that at the time was as wild as any in the old American west – and it was detailed in a judicial report recently rediscovered in the country’s national archives.</p> <a href=\"https://www.theguardian.com/world/2022/dec/16/butch-cassidy-sundance-kid-argentina-chile-bolivia\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/16/butch-cassidy-sundance-kid-argentina-chile-bolivia", "date_published": "2022-12-16 08:30:46+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Rail and road passengers facing disruption as strikes get underway – business live", "description": "<p>One in five trains expected to run today, while some road traffic officers and control room operators working for National Highways begin strike </p><ul><li><a href=\"https://www.theguardian.com/uk-news/2022/dec/16/national-strikes-resume-friday-despite-breakthrough\">Full story: Train strikes resume despite hopes of breakthrough</a></li><li><a href=\"https://www.theguardian.com/uk-news/2022/dec/12/uk-strike-days-calendar-the-public-service-stoppages-planned-for-december\">UK strike days calendar – the public service stoppages planned for December</a></li></ul><p><strong><br /></strong></p><p>You can keep track of the strikes and stoppages planned this month across the UK’s health, transport and postal networks <a href=\"https://www.theguardian.com/uk-news/2022/dec/12/uk-strike-days-calendar-the-public-service-stoppages-planned-for-december\">here</a>:</p><p><strong>Merseyrail</strong> are running a limited train service today and tomorrow, due to the RMT strikes. <a href=\"https://www.merseyrail.org/plan-your-journey/network-rail-strike-action.aspx\">The details are here</a>.</p><p>Whilst Merseyrail staff are not part of this industrial action, it will involve Network Rail staff who operate the signalling systems and provide maintenance support.</p> <a href=\"https://www.theguardian.com/business/live/2022/dec/16/rail-disruption-rmt-nurses-train-strikes-uk-highways-business-live\">Continue reading...</a>", "link": "https://www.theguardian.com/business/live/2022/dec/16/rail-disruption-rmt-nurses-train-strikes-uk-highways-business-live", "date_published": "2022-12-16 08:23:01+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "US religious conspiracist linked to Queensland police killers Gareth and Stacey Train", "description": "<p>Australian couple behind Wieambilla attack were in regular contact with man with a similar fundamentalist theology</p><ul><li><a href=\"https://www.theguardian.com/australia-news/2022/dec/16/queensland-shooting-gareth-and-stacey-train-youtube-video-published-after-killing-police\">Killers published YouTube video after killing police officers</a></li><li><a href=\"https://www.theguardian.com/australia-news/2022/dec/15/wieambilla-shooting-stacey-train-had-limited-contact-with-family-after-entering-controlling-relationship-with-brother-in-law\">Stacey Train had limited contact with family after entering ‘controlling’ relationship</a></li><li>Get our <a href=\"https://www.theguardian.com/australia-news/2022/oct/29/email-newsletters-guardian-australia-best-daily-news-emails-newsletter-free-sign-up-inbox-subscribe-headlines?CMP=cvau_sfl\">morning and afternoon news emails</a>, <a href=\"https://www.theguardian.com/technology/ng-interactive/2018/may/15/the-guardian-app?CMP=cvau_sfl\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></li></ul><p>In the hours after Gareth Train and his wife, Stacey, murdered two police officers and wounded a third during a chilling, premeditated attack on their remote Queensland property this week, they posted a haunting video to YouTube.</p><p>“They came to kill us, and we killed them,” Gareth says, his face partly obscured in darkness.</p><p><strong><a href=\"https://www.theguardian.com/australia-news/2022/oct/29/email-newsletters-guardian-australia-best-daily-news-emails-newsletter-free-sign-up-inbox-subscribe-headlines?CMP=copyembed\">Sign up for Guardian Australia’s free morning and afternoon email newsletters for your daily news roundup</a></strong></p> <a href=\"https://www.theguardian.com/australia-news/2022/dec/16/us-religious-conspiracist-linked-to-queensland-police-killers-gareth-and-stacey-train\">Continue reading...</a>", "link": "https://www.theguardian.com/australia-news/2022/dec/16/us-religious-conspiracist-linked-to-queensland-police-killers-gareth-and-stacey-train", "date_published": "2022-12-16 08:09:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Colombia revokes amnesty it granted to alleged IRA bomb-making trio", "description": "<p>Men were pardoned in April 2020, but after reviewing evidence the court concluded they had not come clean about their trip</p><p>Colombia’s peace tribunal has revoked a controversial amnesty it granted to three alleged IRA members accused of training Colombia’s largest guerrilla group in bomb-making. </p><p>Colombia’s Special Jurisdiction for Peace (JEP) had <a href=\"https://www.theguardian.com/world/2020/apr/23/colombia-grants-amnesty-to-alleged-ira-bomb-making-trio\">pardoned the trio in April 2020</a> providing they fully divulge the truth about a trip they made to Colombia in 2001 at the height of the country’s six decades of conflict.</p> <a href=\"https://www.theguardian.com/world/2022/dec/16/colombia-amnesty-alleged-ira-bomb-making-trio\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/16/colombia-amnesty-alleged-ira-bomb-making-trio", "date_published": "2022-12-16 08:00:46+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "You be the judge: should my boyfriend clear out his hundreds of old CDs and DVDs?", "description": "<p>She says clear the clutter and start streaming, he prizes his collection for its nostalgia value – and you are the remote controller</p><p><a href=\"https://www.theguardian.com/lifeandstyle/2021/sep/25/you-be-the-judge-send-us-your-domestic-disputes\">Find out how to get a disagreement settled or become a You be the judge juror</a></p><p><em>The discs clutter up the house – and I can’t recall the last time he made use of his collection</em></p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/16/you-be-the-judge-should-my-boyfriend-clear-out-his-hundreds-of-old-cds-and-dvds\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/16/you-be-the-judge-should-my-boyfriend-clear-out-his-hundreds-of-old-cds-and-dvds", "date_published": "2022-12-16 08:00:46+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘There are truths that have to be told and they may upset people’: Tony Kushner on Spielberg, Ye and ‘the orange-covered mud devil’", "description": "<p>The Angels in America writer talks about antisemitism, homophobia and working on The Fabelmans, Steven Spielberg’s loosely autobiographical film about a teenager obsessed with cinema</p><p>It’s lunchtime a couple of weeks before Christmas. Past the tree in the glitzy lobby of Claridge’s hotel in London ambles a man who, in his octagonal glasses, workman’s jacket, jeans and trainers, looks a little out of place. Once installed in his room, however, <a href=\"https://www.theguardian.com/stage/tony-kushner\">Tony Kushner</a> is entirely in his element. Insights on art, history and politics pour out at the slightest prompting. He cites writers from Conor McPherson to Robert Lowell, gives a lightning-quick insight into Othello (too cruel a play, he says, for him to catch National Theatre’s new production on this trip) and, in the 50 minutes we talk, widens my vocabulary by three words (abreacting, recrudesce and armamentarium).</p><p>It’s not hard to see why Steven Spielberg has chosen him to write (or co-write) the scripts for four of his films: Munich, Lincoln, West Side Story and his latest, <a href=\"https://www.theguardian.com/film/2022/sep/11/the-fabelmans-review-steven-spielberg-drama\">The Fabelmans</a>. As well as mind-expanding company, Kushner is perhaps the US’s most important living playwright. His two-part, eight-hour Angels in America became a theatrical landmark on its Broadway debut in 1993. A <a href=\"https://www.theguardian.com/stage/2017/may/05/angels-in-america-review-andrew-garfield-nathan-lane-tony-kushner\">2017 revival</a> underscored its punch and prescience.</p> <a href=\"https://www.theguardian.com/film/2022/dec/16/there-are-truths-that-have-to-be-told-and-they-may-upset-people-tony-kushner-on-spielberg-ye-and-the-orange-covered-mud-devil\">Continue reading...</a>", "link": "https://www.theguardian.com/film/2022/dec/16/there-are-truths-that-have-to-be-told-and-they-may-upset-people-tony-kushner-on-spielberg-ye-and-the-orange-covered-mud-devil", "date_published": "2022-12-16 08:00:46+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Babylon review – Brad Pitt suaves through a grand hymn to golden age Hollywood", "description": "<p>Pitt and Margot Robbie, and many razzle dazzle setpieces, help lift a story in no hurry to engage with the true-life nastiness of its era</p><p>Damien Chazelle returns to that la la land in which he made his big breakthrough, with a turbocharged but heavy-handed epic about the secret chaos and excess of 1920s silent-era Hollywood on the verge of talkie extinction, inspired by some well-known anecdotes and further embellishing the apocryphal rumours and tales. It’s a love letter to the movies, inevitably, though I remember Chazelle’s previous films being love letters to actual human beings. There are preemptive references to Singin’ in the Rain and it climaxes with a swoony-solemn Oscar-telecast-type montage including clips from Maya Deren’s Meshes of the Afternoon and James Cameron’s Terminator 2. Funny though Babylon often is, in all its frantic melodrama it is weirdly without the gentle romantic sweetness and believable human frailty in his Oscar-winning film La La Land (although there are musical echoes of that earlier picture and the same message that jazz is where integrity is to be found in showbusiness).</p><p>Chazelle is also concerned to restore some of the minorities who have been erased in Hollywood’s history, as well as be more candid about the sordid realities, but he fudges the new #MeToo conversation about the Hollywood golden age: all the raunchy sex here is very much consensual. Pundits have cited silent movie historian and evangelist Kevin Brownlow in relation to this film, but the debt is obviously more to Kenneth Anger, author of Hollywood Babylon – and frankly even more to Baz Luhrmann than either. The outrageous party scenes, with the mandatory overhead shots showing the ecstatically unclothed women crowd-surfing face-up are so much like Luhrmann he should be getting a royalty cheque.</p> <a href=\"https://www.theguardian.com/film/2022/dec/16/babylon-review-hollywood-brad-pitt-margot-robbie\">Continue reading...</a>", "link": "https://www.theguardian.com/film/2022/dec/16/babylon-review-hollywood-brad-pitt-margot-robbie", "date_published": "2022-12-16 08:00:45+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "The week in wildlife – in pictures", "description": "<p>The best of this week’s wildlife pictures, including hungry puppies, a snow leopard and migratory birds</p> <a href=\"https://www.theguardian.com/environment/gallery/2022/dec/16/the-week-in-wildlife-in-pictures\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/gallery/2022/dec/16/the-week-in-wildlife-in-pictures", "date_published": "2022-12-16 08:00:45+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Watered down: why negotiators at Cop15 are barely mentioning the ocean", "description": "<p>With only two mentions of the word ‘ocean’ in the latest 5,000-word working agreement, delegates fear marine biodiversity is being sacrificed</p><p>The ocean may cover 70% of the Earth’s surface and contain much of its animal life, but you might not get that impression from the UN discussions in Montreal to save global biodiversity. Some delegates fear marine protections could be severely watered down or dropped entirely.</p><p>Although overfishing, global heating and acidification are considered an existential risk to what has been called <a href=\"https://news.un.org/pages/lungs-of-our-planet/\">“the lungs of the planet”</a>, so far there are only two mentions of the word “ocean” in the latest 10-page, 5,000-word working agreement at Cop15. There are no specific demands to <a href=\"https://www.theguardian.com/environment/2022/oct/26/north-east-atlantic-overfishing-brexit\">curtail fishing</a>, protect <a href=\"https://www.theguardian.com/environment/video/2022/nov/17/underwater-in-sharm-el-sheikh-examining-the-importance-of-coral-reefs-video\">coral reefs</a> or stop <a href=\"https://www.theguardian.com/environment/2021/sep/27/race-to-the-bottom-the-disastrous-blindfolded-rush-to-mine-the-deep-sea\">deep-sea mining</a>.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/16/negotiators-cop15-barely-mentioning-ocean\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/dec/16/negotiators-cop15-barely-mentioning-ocean", "date_published": "2022-12-16 07:45:45+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Four people in critical condition after crush at Asake concert in Brixton", "description": "<p>Met police begin investigation after thousands of people force entry into O2 Academy during performance</p><p>Eight people were injured, including four who are in a critical condition, after thousands of people forced entry into a concert in O2 Academy Brixton in London.</p><p>The Metropolitan police have launched an investigation into what they said was an “extremely distressing” incident at a performance of the Nigerian Afrobeats singer and songwriter Asake.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/16/four-people-in-critical-condition-after-crush-at-o2-academy-brixton\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/dec/16/four-people-in-critical-condition-after-crush-at-o2-academy-brixton", "date_published": "2022-12-16 07:42:18+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Chess: Carlsen ‘adopts’ US champion, Fabiano Caruana, in online blitz rout", "description": "<p>Norway’s world No 1 did not lose a single game in his 22-4 victory, and achieved the rare feat of 10 successive wins, which in online speed chess jargon qualifies as adopting your opponent</p><p>Magnus Carlsen’s achievements are so many that it is hard for the Norwegian to surprise fans any more, but the No 1’s crushing online blitz victory against Fabiano Caruana on Tuesday was remarkable.</p><p>Caruana is the reigning US champion, and had scored an even 6-6 in his classical games against Carlsen in their 2018 world title match in London. This week, they were paired in a quarter-final of the annual $100,000 Chess.com speed championship, whose format of 90 minutes play at 5/1 (five minutes per player per game plus one second per move increment), 60 minutes at 3/1 blitz, and 30 minutes of 1/1 bullet, is a searching test of endurance, creativity, and fast reactions over a marathon course of around 25-30 games in three hours.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/16/chess-carlsen-adopts-us-champion-fabiano-caruana-in-online-blitz-rout\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/dec/16/chess-carlsen-adopts-us-champion-fabiano-caruana-in-online-blitz-rout", "date_published": "2022-12-16 07:30:45+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "White Torture by Narges Mohammadi review – solitary savagery", "description": "<p>An Iranian political activist, now in jail herself, interviews 12 female prisoners of the Islamic Republic about their experiences</p><p>I can’t think when I last came across a book that opened with such disturbing words: “I am writing this preface in the final hours of my home leave. Very soon I will be forced to return to my prison … This time I was found guilty because of the book you are holding in your hands – White Torture.<em>”</em> That was last March. Narges Mohammadi, a leading Iranian political dissident, had been briefly released from jail because she had had a heart attack, followed by cardiac surgery. Now she is a prisoner again, facing 80 lashes and a total of more than 30 years behind bars. Part of her sentence will be spent in solitary confinement. “I declare once more that this is a cruel and inhumane punishment,” she writes. “I will not rest until it is abolished.”</p><p>Mohammadi builds up her campaign against solitary confinement partly with her own story, but mostly through interviews with 12 other Iranian women who have also experienced it. They come from different backgrounds and were jailed for a variety of things the Islamic republic regards as crimes: being a member of the Bahá’i religious minority, or a Sufi, converting to Christianity, supporting the <a href=\"https://www.theguardian.com/us-news/mek\" title=\"\">People’s Mujahedin</a>, or simply getting involved in protest movements.</p> <a href=\"https://www.theguardian.com/books/2022/dec/16/white-torture-by-narges-mohammadi-review-solitary-savagery\">Continue reading...</a>", "link": "https://www.theguardian.com/books/2022/dec/16/white-torture-by-narges-mohammadi-review-solitary-savagery", "date_published": "2022-12-16 07:30:45+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "The Art of Building Competition 2022 – in pictures", "description": "<p>The finalists in the largest photography competition celebrating the built environment have been announced.  Run by the <a href=\"https://artofbuilding.org/vote/\">Chartered Institute of Building</a>, entries range from an isolated church  to a shopping mall, with the winner to be decided by a public vote.</p> <a href=\"https://www.theguardian.com/artanddesign/gallery/2022/dec/16/the-art-of-building-competition-2022-in-pictures\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/gallery/2022/dec/16/the-art-of-building-competition-2022-in-pictures", "date_published": "2022-12-16 07:00:45+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Will Boris Johnson stage a comeback? Sunak may only have five months to find out | Katy Balls", "description": "<p>If the prime minister can’t close the gap on Labour, many Tory MPs predict the ‘wild’ return of his rival in the spring</p><p>Three years ago this week, Boris Johnson was looking ahead to a long premiership – eight years at least. As the result broke of a majority of 80 in the 2019 election the prime minister pitched himself as a Blair-like figure – heading to Sedgefield, where his party had turned the former prime minister’s seat blue, <a href=\"https://www.chroniclelive.co.uk/news/uk-news/boris-johnson-boasts-sedgefield-victory-17414652\">for his victory rally</a>. The implication was clear: Johnson was a leader who would be as influential and long-lasting in British politics as Tony Blair.</p><p>Fast forward to today and things look rather different. Johnson is on the backbenches – having been forced to resign in the face of successive scandals. After Liz Truss’s short stint in the job, he launched one aborted attempt to return. His former chancellor and political rival Rishi Sunak is now in charge. The polls suggest the Conservatives are on course for a heavy defeat at the next election, which could even include <a href=\"https://www.theguardian.com/politics/2022/may/28/could-boris-johnson-lose-his-seat-in-the-next-election\">Johnson’s own seat</a> of Uxbridge and South Ruislip.</p><p>Katy Balls is the Spectator’s deputy political editor</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/16/boris-johnson-comeback-rishi-sunak-prime-minister-labour-tory-mps\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/dec/16/boris-johnson-comeback-rishi-sunak-prime-minister-labour-tory-mps", "date_published": "2022-12-16 07:00:45+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘It made my heart sing’: finding herbs and medicine in the Bronx food forest", "description": "<p>The Bronx River Foodway, the only legal place to forage in New York, celebrates the end of a season</p><p>On a crisp November day in the South Bronx, more than 300 people made their way from Westchester Avenue below the clamor of the 6 train down a tree-lined path leading to Concrete Plant park. This is the home of the Bronx River Foodway, a quarter-acre food forest full of edible, mostly native plants. What looks like a stretch of land dotted with trees appears at first glance to be overrun by weeds, but the wild foliage has been intentionally planted by the Foodway. It is the only legal foraging site in New York City.</p><p>Neighbors young and old poured on to the grassy banks of the Bronx River to celebrate the end of the season and the foliage of the Bronx, including an array of snacks made from foraged ingredients: ginkgo cheese and acorn crackers, and pickled mushrooms and herbal ales made at recent four-part cooking series put on by the Foodway over the last two months.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/15/new-york-foraging-bronx-river-foodway\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/15/new-york-foraging-bronx-river-foodway", "date_published": "2022-12-16 07:00:45+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Capturing Ecology 2022 – in pictures", "description": "<p>A selection of the winning and highly commended images in the British Ecological Society’s annual competition <a href=\"http://britishecologicalsociety.org/membership-community/annual-photographic-competition/\">Capturing Ecology</a>, taken by international ecologists and students across the globe. From a hungry mother leopard hunting to the calm of a bird floating on water, the images illustrate the intricacies of nature and our relationship with the natural world</p> <a href=\"https://www.theguardian.com/artanddesign/gallery/2022/dec/16/capturing-ecology-2022-in-pictures\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/gallery/2022/dec/16/capturing-ecology-2022-in-pictures", "date_published": "2022-12-16 07:00:44+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Tunisia election set to deliver male-dominated parliament and erosion of women’s rights", "description": "<p>As the country goes to the polls, reforms introduced by hardline president Kais Saied have led to the exclusion of female candidates</p><p>Tunisians will vote on Saturday in an election that will lead to a weakened parliament “almost exclusively dominated by men”, as activists warn of a stark deterioration of women’s rights under an<em><strong> </strong></em>increasingly authoritarian president.</p><p>The controversial elections, boycotted by all the main parties, mark the final piece of the constitutional jigsaw President Kais Saied began assembling in July 2021, when he suspended the legislature in what critics called a power grab.</p> <a href=\"https://www.theguardian.com/global-development/2022/dec/16/tunisia-election-male-parliament-womens-rights-kais-saied\">Continue reading...</a>", "link": "https://www.theguardian.com/global-development/2022/dec/16/tunisia-election-male-parliament-womens-rights-kais-saied", "date_published": "2022-12-16 06:45:44+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Ten people, including five children, killed in apartment fire near Lyon, French authorities say", "description": "<p>About 170 firefighters were at the scene of the blaze at a seven-storey residential building in Vaulx-en-Velin</p><p>Ten people, including five children, have reportedly been killed after a fire broke out on Friday morning at a residential building in Vaulx-en-Velin, near the French city of Lyon.</p><p>The local authority for the Lyon/Rhone region said the fire was first reported to emergency services at 3.12am and by 3.25am around 170 firefighters and 65 fire trucks were at the site.</p> <a href=\"https://www.theguardian.com/world/2022/dec/16/ten-people-including-five-children-killed-in-apartment-fire-near-lyon-french-authorities-say\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/16/ten-people-including-five-children-killed-in-apartment-fire-near-lyon-french-authorities-say", "date_published": "2022-12-16 06:42:50+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘I went cross-eyed’: Australia’s former deputy PM taken to hospital after drinking entire bowl of kava", "description": "<p>Michael McCormack paid a high price for downing, not sipping, the sakau during a Pacific tour, later stating: ‘I was trying to be respectful’</p><p>Former Australian deputy prime minister Michael McCormack has learned the hard way that being polite can be hazardous to your health.</p><p>The Nationals MP suffered the consequences of drinking an entire shell of sakau – a traditional Micronesian kava – in one hit, thinking it was similar to South Pacific kava.</p> <a href=\"https://www.theguardian.com/world/2022/dec/16/i-went-cross-eyed-australias-former-deputy-pm-taken-to-hospital-after-drinking-entire-bowl-of-kava\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/16/i-went-cross-eyed-australias-former-deputy-pm-taken-to-hospital-after-drinking-entire-bowl-of-kava", "date_published": "2022-12-16 06:15:14+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Russia-Ukraine war live: Ukrainian officials warn of major new Russian offensive; US senate approves $800m in aid", "description": "<p>Ukraine’s defence minister warns mobilised Russian soldiers preparing for new attack; US defence bill passes with further funding for Ukraine</p><ul><li><a href=\"https://www.theguardian.com/world/ukraine\">See all our Ukraine war coverage</a></li></ul><p></p><p>Oleg Synegubov, the head of Kharkiv regional administration, has warned people via Telegram to remain in shelters amid air raid alarms this morning. </p><p>At least eight people were killed and 23 injured by Ukrainian shelling in the Russian-controlled Luhansk region of Ukraine, Russia’s state TASS news agency reported on Friday, citing an unidentified source in the emergency services.<br /><br />The shelling destroyed a building in the village of Lantrativka and some people were trapped under rubble, TASS said.<br /><br />Russian-backed officials from Luhank’s representation to the Joint Centre of Control and Co-ordination – a ceasefire monitoring body set-up to help manage the conflict between Russian-backed separatists and Ukrainian forces after 2014 – said Ukraine fired three US-made HIMARS rockets at Lantrativka at 04:10 local time (0210 GMT) on Friday morning.<br /><br />The head the “people’s militia” in Luhansk also reported on his Telegram channel there were civilian casualties as a result of Ukrainian shelling on the town of Svatove on Friday morning. He provided no further details of the attack.<br /><br />Reuters could also not immediately verify the battlefield reports.</p> <a href=\"https://www.theguardian.com/world/live/2022/dec/16/russia-ukraine-war-live-ukrainian-officials-warn-of-major-new-russian-offensive-us-senate-approves-800m-in-aid\">Continue reading...</a>", "link": "https://www.theguardian.com/world/live/2022/dec/16/russia-ukraine-war-live-ukrainian-officials-warn-of-major-new-russian-offensive-us-senate-approves-800m-in-aid", "date_published": "2022-12-16 06:07:36+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Messi business: how ‘sportswashing’ could land Saudi Arabia the 2030 World Cup", "description": "<p>Qatar has written the playbook on how to further geopolitical aims by hosting a Fifa event. Riyadh is taking notes</p><p>If Lionel Messi lifts the World Cup trophy it will not only represent a victory for Argentina’s diminutive captain but <a href=\"https://www.theguardian.com/football/2022/may/12/lionel-messi-saudi-arabia-deal-tourism\">his unlikely new benefactor: Saudi Arabia</a>. The team may have inflicted a shock, humiliating defeat upon Argentina in their opening game of the tournament, but Messi, paid to be an ambassador for Saudi under <a href=\"https://www.dailymail.co.uk/sport/sportsnews/article-11456277/Saudi-Arabian-ambassador-Lionel-Messi-BOOED-Saudi-fans-Argentinas-disastrous-defeat.html\">a reported £25m contract</a>, could deliver a long-term prize worth far more – a chance to emulate Qatar and host the 2030 World Cup.</p><p>After the tiny gas-rich emirate won the right to host the <a href=\"https://www.theguardian.com/football/world-cup-football\">World Cup</a> in December 2010, in circumstances mired in controversy, Qatar wrote the playbook on using the soft power of the world’s biggest sporting event to further its aims – from the big spending western brands which come with the tournament to the attempts to improve its image on human rights.</p> <a href=\"https://www.theguardian.com/world/2022/dec/16/messi-business-how-sportswashing-could-land-saudi-arabia-the-2030-world-cup\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/16/messi-business-how-sportswashing-could-land-saudi-arabia-the-2030-world-cup", "date_published": "2022-12-16 06:00:44+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Nobel prize winner criticises western ‘neglect’ and urges action over DRC violence", "description": "<p>Denis Mukwege has demanded sanctions be imposed on Rwanda to ease the crisis in eastern Democratic Republic of the Congo</p><p>The west must ditch its “double standards” and act decisively against the violence <a href=\"https://www.theguardian.com/world/2022/dec/12/renewed-fighting-in-drc-raises-fears-of-chaotic-proxy-conflict\">worsening in the Democratic Republic of the Congo</a> (DRC), Dr Denis Mukwege, the Nobel prize-winning surgeon, has said.</p><p>In a stinging criticism of the international community’s “negligence”, Mukwege urged Britain and its allies to impose sanctions on neighbouring Rwanda to help ease the growing crisis in the east of the country.</p> <a href=\"https://www.theguardian.com/global-development/2022/dec/16/nobel-prize-winner-criticises-western-neglect-and-urges-action-over-drc-violence\">Continue reading...</a>", "link": "https://www.theguardian.com/global-development/2022/dec/16/nobel-prize-winner-criticises-western-neglect-and-urges-action-over-drc-violence", "date_published": "2022-12-16 06:00:44+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "These strikes are telling us something: the era of low wages may be over | Andy Beckett", "description": "<p>Higher salaries would boost Britain’s economy and bring us in line with many other rich countries</p><p>For almost half a century, in other words within the limits of political memory, Britain has been a country where the priority of most governments has been to keep a few key economic numbers low. Income tax, interest rates, inflation and most people’s wages: all were deliberately suppressed by Downing Street and its collaborators in business and the Bank of England. By doing so a space was created – in theory at least – for certain interest groups to flourish: employers, entrepreneurs, shareholders, top earners, homeowners and consumers. Together, they were supposed to boost our previously sluggish rate of economic growth.</p><p>It hasn’t quite worked out like that. Britain is on the brink of recession yet again. Interest rates, taxes and inflation are all high. Only average wages are still low. And even that dubious achievement of British government and capitalism since the 1980s now feels fragile, with strikes solidifying and spreading across both private and state sectors, determinedly driven by workers who have finally had enough of years of falling pay. As Mick Lynch of the RMT union put it with characteristic pithiness on the Today programme last week: “The price of labour isn’t at the right price in this country.”</p><p>Andy Beckett is a Guardian columnist</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/16/strikes-are-telling-us-something-low-wages-over\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/dec/16/strikes-are-telling-us-something-low-wages-over", "date_published": "2022-12-16 06:00:44+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘Like hell’: Henry Moore drawings of coalminers’ wartime work on show", "description": "<p>Scupltor and miner’s son was commissioned to spend a week making sketches of men in Yorkshire pit</p><p>He is one of Britain’s greatest sculptors, celebrated for his modernist representations of the female form. But Henry Moore had a little-known dark side: drawings of coalminers created from a week spent in the gloom of a Yorkshire pit in the wartime winter of 1941-42.</p><p>They depict the back-breaking, dangerous work carried out daily by hundreds of thousands of miners making a vital contribution to the war effort. Moore described the conditions 1,400ft underground as “like hell”.</p> <a href=\"https://www.theguardian.com/artanddesign/2022/dec/16/like-hell-henry-moore-drawings-of-coalminers-wartime-work-on-show\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/2022/dec/16/like-hell-henry-moore-drawings-of-coalminers-wartime-work-on-show", "date_published": "2022-12-16 06:00:44+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘It’s got to be an experience, first and foremost’: James Cameron, Sigourney Weaver and Kate Winslet on the return of Avatar", "description": "<p>The director and actors discuss his typically gruelling film-making process, including learning to free dive, the tech v nature message of the new films – and why there’s still room for ‘big boy toys’</p><p>Sigourney Weaver recalls flying back from New Zealand with James Cameron last year, after they had finished filming the new Avatar movie. “I put on Superbad, I got a glass of wine, I had my seat back, slept for 14 hours,” she says. Meanwhile, for the duration of the flight, “Jim is sitting up reading a book that was called something like Is God Dead? I realised that I was not the same kind of human as he is. I mean, the guy is just …” She trails off, grasping for words. “He’s such a <em>marine</em>.”</p><p>People often complain that the age of Hollywood legends is over, but everything about James Cameron always seems to be mythologically huge. Where other movie titans owned fleets of luxury cars, Cameron had not just cars but helicopters and even submarines – which he designed himself and<a href=\"https://www.theguardian.com/film/2012/mar/26/james-cameron-mariana-trench-dive\"> took to the bottom of the ocean</a>. Alongside the militaristic hardware, a myth has formed of Cameron as a fearsome, tough-talking army general of a director, subduing and marshalling his crew on set to the extent they once made T-shirts that read: “You can’t scare me, I work for James Cameron.”</p> <a href=\"https://www.theguardian.com/film/2022/dec/16/its-got-to-be-an-experience-first-and-foremost-james-cameron-sigourney-weaver-and-kate-winslet-on-the-return-of-avatar\">Continue reading...</a>", "link": "https://www.theguardian.com/film/2022/dec/16/its-got-to-be-an-experience-first-and-foremost-james-cameron-sigourney-weaver-and-kate-winslet-on-the-return-of-avatar", "date_published": "2022-12-16 06:00:43+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Chips are down, down: Coles imposes frozen chip limit amid potato shortage", "description": "<p>Australian farmers blame a cold and wet winter for shortfall in potatoes, with shortages likely to persist until January</p><ul><li><a href=\"https://www.theguardian.com/australia-news/live/2022/dec/16/australia-news-live-santos-says-energy-price-caps-a-soviet-policy-focus-on-extremism-after-wieambilla-shootings\">Follow our Australia news live blog for the latest updates</a></li><li>Get our <a href=\"https://www.theguardian.com/australia-news/2022/oct/29/email-newsletters-guardian-australia-best-daily-news-emails-newsletter-free-sign-up-inbox-subscribe-headlines?CMP=cvau_sfl\">morning and afternoon news emails</a>, <a href=\"https://www.theguardian.com/technology/ng-interactive/2018/may/15/the-guardian-app?CMP=cvau_sfl\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></li></ul><p>Coles has brought in limits on the sale of frozen potato chips because of a nationwide supply shortage.</p><p>Customers will be temporarily limited to two items.</p><p><strong><a href=\"https://www.theguardian.com/australia-news/2022/oct/29/email-newsletters-guardian-australia-best-daily-news-emails-newsletter-free-sign-up-inbox-subscribe-headlines?CMP=copyembed\">Sign up for Guardian Australia’s free morning and afternoon email newsletters for your daily news roundup</a></strong></p> <a href=\"https://www.theguardian.com/food/2022/dec/16/chips-are-down-down-coles-imposes-frozen-chip-limit-amid-potato-shortage\">Continue reading...</a>", "link": "https://www.theguardian.com/food/2022/dec/16/chips-are-down-down-coles-imposes-frozen-chip-limit-amid-potato-shortage", "date_published": "2022-12-16 05:02:37+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘Surreal spectacle’: US botched 35% of execution attempts this year", "description": "<p>Annual review reveals that seven of the 20 execution attempts carried out this year were visibly problematic</p><p>As 2022 draws to a close, a new grim distinction can be attached to it: in America it was the year of the botched execution.</p><p>In its <a href=\"https://deathpenaltyinfo.org/facts-and-research/dpic-reports/the-death-penalty-in-2022-year-end-report\">annual review</a> of US capital punishment, the Death Penalty Information Center (DPIC) reveals the astonishing statistic that 35% of the 20 execution attempts carried out this year were visibly problematic.</p> <a href=\"https://www.theguardian.com/world/2022/dec/15/us-death-penalty-data-execution-attempts-botched\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/15/us-death-penalty-data-execution-attempts-botched", "date_published": "2022-12-16 05:01:41+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "European MPs seek to publicise plight of jailed Iranian protesters", "description": "<p>Politicians particularly in Germany taking responsibility for lobbying for the safety of individual prisoners</p><p>Politicians across Europe have begun sponsoring jailed Iranian protesters in the hope that by highlighting individual cases of injustice, the authorities will be forced to step back from handing down lengthy jail sentences or carrying out executions.</p><p>The <a href=\"https://www.theguardian.com/world/2022/dec/12/scores-of-executions-feared-in-iran-as-23-year-old-hanged-in-public-execution\">executions of two demonstrators</a> and threats to kill others suggest Tehran is set on the use of repression and fear to quell the protests.</p> <a href=\"https://www.theguardian.com/world/2022/dec/16/european-mps-seek-to-publicise-plight-of-jailed-iranian-protesters\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/16/european-mps-seek-to-publicise-plight-of-jailed-iranian-protesters", "date_published": "2022-12-16 05:00:42+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Qatar 2022: what have we learned? – Football Daily podcast", "description": "<p><a href=\"https://twitter.com/maxrushden\">Max Rushden</a>, <a href=\"https://twitter.com/PhilippeAuclair\">Philippe Auclair</a>, Pete Pattisson, <a href=\"https://twitter.com/JamesPiotr\">James Montague</a>, <a href=\"https://twitter.com/_shireenahmed_\">Shireen Ahmed</a> and <a href=\"https://twitter.com/BeardedGenius\">Nooruddean Choudry</a> look back over the World Cup in Qatar</p><p><strong>Rate, review, share on <a href=\"https://itunes.apple.com/podcast/football-weekly-the-guardian/id188674007?mt=2\">Apple Podcasts</a>, <a href=\"https://soundcloud.com/guardianfootballweekly\">Soundcloud</a>, <a href=\"https://audioboom.com/channel/football-weekly\">Audioboom</a>, <a href=\"https://www.mixcloud.com/guardianfootballweekly/\">Mixcloud</a>, <a href=\"https://www.acast.com/footballweekly\">Acast</a> and <a href=\"http://www.stitcher.com/podcast/guardianuk/football-weekly\">Stitcher</a>, and join the conversation on <a href=\"https://www.facebook.com/GuardianPodcasts/\">Facebook</a>, <a href=\"https://twitter.com/guardianaudio\">Twitter</a> and <a href=\"mailto:footballweekly@theguardian.com\">email</a>.</strong></p><p>Today: Pete Pattisson and James Montague join to discuss how the Supreme Committee and Fifa have dealt with controversies that have happened over the last month in Qatar and what might happen post-World Cup.</p> <a href=\"https://www.theguardian.com/football/audio/2022/dec/16/qatar-2022-what-have-we-learned-football-daily-podcast\">Continue reading...</a>", "link": "https://www.theguardian.com/football/audio/2022/dec/16/qatar-2022-what-have-we-learned-football-daily-podcast", "date_published": "2022-12-16 05:00:42+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "San Francisco 49ers capture NFC West title as Brock Purdy tames Seahawks", "description": "<ul><li>Purdy and 49ers topple Seahawks 21-13 to win NFC West</li><li>Kittle has four catches for 93 yards and two touchdowns</li></ul><p>Rookie Brock Purdy a pair of touchdown passes to George Kittle, and the San Francisco 49ers won their first NFC West title since 2019, beating the Seattle Seahawks 21-13 on Thursday night.</p><p>Despite using their third starting quarterback this season, the 49ers (10-4) continued to show they might be the class of the NFC alongside Philadelphia. San Francisco won their seventh straight, using its stifling defense to frustrate Seattle into countless mistakes.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/15/san-francisco-49ers-seattle-seahawks-game-report\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/dec/15/san-francisco-49ers-seattle-seahawks-game-report", "date_published": "2022-12-16 04:47:32+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "China v Jimmy Lai: a tycoon, a trial and the erosion of Hong Kong’s rule of law", "description": "<p>The pro-democracy figure has been subjected to a ‘travesty of justice’ because the Communist party regards his power as a threat, experts believe</p><p>Even before his jailing, Jimmy Lai knew he faced a grim future, but insisted on fighting his cause.</p><p>“Without fighting, we don’t have hope. We don’t know when we’ll win, but we’re so sure we’re on the right side of history, and time is on our side,” the founder of the vocal pro-democracy Hong Kong newspaper Apple Daily told the Guardian in August 2020 while on bail, five days after his arrest over allegations of foreign collusion.</p> <a href=\"https://www.theguardian.com/world/2022/dec/16/china-v-jimmy-lai-a-tycoon-a-trial-and-the-erosion-of-hong-kongs-rule-of-law\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/16/china-v-jimmy-lai-a-tycoon-a-trial-and-the-erosion-of-hong-kongs-rule-of-law", "date_published": "2022-12-16 04:10:44+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "US Senate passes legislation to keep government afloat for another week", "description": "<p>Lawmakers race to finish work on a full-year spending package before the holidays and a new Congress is sworn in</p><p>The Senate passed legislation Thursday to fund the government for an additional week as lawmakers race to finish work on a full-year spending package before they head home for the holidays and a new Congress is sworn in.</p><p>Congress in September passed a bill to keep the government running through midnight Friday. The latest extension, which now goes to President Joe Biden’s desk to be signed into law, funds federal agencies through 23 December. It passed by a vote of 71-19.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/15/us-senate-legislation-government-afloat-additional-week\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/15/us-senate-legislation-government-afloat-additional-week", "date_published": "2022-12-16 03:24:10+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "The call to put 'a price on nature' can be appealing - but it misunderstands what’s at stake | Jeff Sparrow", "description": "<p>Free market mechanisms have been used for years to tackle the environmental crisis – with disastrous results. It’s time for some new ideas</p><p>“When [a] crisis occurs, the actions that are taken depend on the idea that are lying around.”</p><p>Nowhere has Milton Friedman’s dictum applied with more force than in respect of the environment. When scientists first raised the alarm about global warming in the late 1980s, the ideas “lying around” all pertained to neoliberalism. As a result, mainstream climate action has prioritised free market mechanisms, with disastrous results.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/16/the-call-to-put-a-price-on-nature-can-be-appealing-but-it-misunderstands-whats-at-stake\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/dec/16/the-call-to-put-a-price-on-nature-can-be-appealing-but-it-misunderstands-whats-at-stake", "date_published": "2022-12-16 03:05:07+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Twitter suspends accounts of several journalists who had reported on Elon Musk", "description": "<p>Many at CNN, Washington Post and the New York Times who had written critically of the new owner found their handles suspended </p><p>A number of prominent<strong> </strong>journalists who have reported on Twitter and its new chief executive Elon Musk appear to have been suspended or banned from the platform without explanation. The Twitter account for a rival social media company, Mastodon, where some Twitter users have migrated after Musks’s takeover of Twitter, also appeared to <a href=\"https://twitter.com/somospostpc/status/1603529332240138241\">have been suspended</a>.</p><p>Accounts of tech journalists at <a href=\"https://www.cnn.com/2022/12/14/tech/elonjet-twitter-suspended/index.html\">CNN</a>, the <a href=\"https://www.washingtonpost.com/technology/2022/12/14/elonjet-twitter-suspension-jack-sweeney-talks/\">Washington Post</a>, <a href=\"https://mashable.com/author/matt-binder\">Mashable</a> and the <a href=\"https://www.nytimes.com/2022/12/14/technology/twitter-private-jet-accounts-suspended.html\">New York Times</a> were suspended in quick succession Thursday evening. All had recently published articles about Musk’s suspension of a Twitter account that had shared publicly-available data about the movements of his private jet. Each of these articles had highlighted the tension between Musk’s stated commitment to “free speech” and his choice to ban an account that he personally disliked.</p> <a href=\"https://www.theguardian.com/technology/2022/dec/15/twitter-suspends-accounts-journalists-musk\">Continue reading...</a>", "link": "https://www.theguardian.com/technology/2022/dec/15/twitter-suspends-accounts-journalists-musk", "date_published": "2022-12-16 03:02:22+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "The ‘prince’ and the plot against Germany – podcast", "description": "<p>Have you heard the one about the former paratrooper, politician and ‘prince’ who walk into a hunting lodge and allegedly plot to overthrow the German government? Philip Oltermann in Berlin explains why it was no joke</p><p>On 27 November, a video was uploaded on to a website that was popular among far-right conspiracy theorists. It featured a German man with a strong Bavarian accent sitting by the Adriatic Sea and explaining that there was a great, epochal upheaval about to come to Germany. The man in the footage was Maximilian Eder, a former special forces soldier, well trained, with access to weapons.</p><p>The Guardian’s Berlin bureau chief, <strong>Philip Oltermann</strong>, tells <strong>Michael Safi</strong> how this alleged plot to bring down the German government was cooked up and how it came crashing down. The alleged coup failed, but its very existence tells us something about the new power of far-right conspiracies to radicalise people – and not just in Germany.</p> <a href=\"https://www.theguardian.com/news/audio/2022/dec/16/the-prince-and-the-plot-against-germany-podcast\">Continue reading...</a>", "link": "https://www.theguardian.com/news/audio/2022/dec/16/the-prince-and-the-plot-against-germany-podcast", "date_published": "2022-12-16 03:00:39+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "New Zealand set to cancel Jacinda Ardern’s Waitangi Day BBQ amid security concerns", "description": "<p>The annual event likely won’t be going ahead in 2023 amid growing concerns that radical fringe groups are transforming the country’s security environment</p><p>Jacinda Ardern’s much-loved <a href=\"https://www.theguardian.com/world/2021/feb/06/new-zealand-celebrates-waitangi-day-with-dawn-service-bacon-butties\">Waitangi Day ritual</a> of hosting a barbecue breakfast for the public will likely be off the menu in 2023 due to security concerns, as New Zealand deals with increased threats and harassment of politicians.</p><p>Since 2018, Ardern, her family and government ministers have donned aprons and wielded tongs to cook a free barbecue for all who brave the early wake-up for a dawn service on the country’s national founding holiday, at the Waitangi Treaty Grounds in Paihia.</p> <a href=\"https://www.theguardian.com/world/2022/dec/16/new-zealand-set-to-cancel-jacinda-arderns-waitangi-day-bbq-amid-security-concerns\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/16/new-zealand-set-to-cancel-jacinda-arderns-waitangi-day-bbq-amid-security-concerns", "date_published": "2022-12-16 02:33:38+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Senate passes $858bn defense bill that rescinds army Covid vaccine mandate", "description": "<p>Democrats agreed to Republican demands to scrap vaccination requirement for service members to win support for the bill</p><p>A bill to rescind the Covid-19 vaccine mandate for members of the US military and provide nearly $858bn for national defense passed the Senate on Thursday and now goes to President Joe Biden to be signed into law.</p><p>The bill provides for about $45bn more for defense programs than Biden requested and roughly 10% more than last year’s bill as lawmakers look to account for inflation and boost the nation’s military competitiveness with China and Russia. It includes a 4.6% pay raise for servicemembers and the defense department’s civilian workforce.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/15/senate-passes-858bn-defense-bill-rescinds-army-covid-vaccine-mandate\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/15/senate-passes-858bn-defense-bill-rescinds-army-covid-vaccine-mandate", "date_published": "2022-12-16 02:04:38+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Russia-Ukraine war at a glance: what we know on day 296 of the invasion", "description": "<p>Ukraine defence minister says half of mobilised Russians are being prepared more thoroughly for new offensive in coming months</p><ul><li><a href=\"https://www.theguardian.com/world/ukraine\">See all our Ukraine war coverage</a></li></ul><p></p><p><strong>Vladimir Putin is preparing for a major new offensive in the new year</strong>, Ukraine’s defence minister has said. In an interview with the Guardian, Oleksii Reznikov, said evidence was emerging that the Kremlin was <a href=\"https://www.theguardian.com/world/2022/dec/15/ukraine-says-putin-is-preparing-major-offensive-in-new-year\">preparing a broad new campaign</a> despite a series of humiliating battlefield setbacks for Russia in recent months. Referring to Russia’s partial mobilisation of about 300,000 soldiers, Reznikov suggested that while half – often after receiving minimal training – were being used to reinforce Moscow’s forces now, the remainder were being prepared more thoroughly for future offensives.</p><p><strong>The head of Ukraine’s armed forces believes Russia will make a renewed attempt at capturing the capital, Kyiv,</strong> after its previous attack was repelled earlier this year. <a href=\"https://www.economist.com/zaluzhny-transcript\">In an interview with the Economist</a>, Gen Valeriy Zaluzhny said he was trying to prepare for Russian forces to have another go at taking the city, possibly in February or March.</p><p><strong>Russian shelling killed two people, including a Red Cross worker, in Kherson on Thursday and completely cut power in the southern city</strong>, Ukrainian officials said, with temperatures near freezing. Moscow-allied officials in the Russian-occupied city of Donetsk, meanwhile, said they had come under some of the heaviest shelling in years from Ukrainian forces, leaving one person dead.</p><p><strong>Russia is to double the number of test launches of its intercontinental ballistic missiles to eight next year</strong> from four in 2022, the commander of strategic rocket forces was quoted as saying on Friday. Sergei Karakayev told the military newspaper Krasnaya Zvezda that the eight test flights would be scheduled from two launch sites – one near Murmansk in the north, the other near Volgograd in the south.</p><p><strong>A Russian airbase in Kursk was struck on Wednesday night</strong>, a senior Ukrainian official has said. Anton Gerashchenko, a senior presidential adviser to Volodymyr Zelenskiy, posted a series of updates on Telegram, saying an “unknown drone” struck the military facility.</p><p><strong>The US military announced it would expand training in Germany of Ukrainian military personnel.</strong> Starting in January, 500 troops a month would be trained, building on more than 15,000 Ukrainians trained by the US and its allies since April.</p><p><strong>Electricity blackouts due to Russian missile and drone attacks on Ukraine’s power infrastructure are crippling its economy, </strong>including in key sectors such as mining and manufacturing. The <a href=\"https://www.washingtonpost.com/world/2022/12/15/ukraine-economy-russia-war-crisis/\">report in the Washington Post</a> said Ukraine needed another $2bn a month on top of the $55bn already projected for next year to meet basic expenses.</p><p><strong>An</strong> <strong>€18bn EU finance package for Ukraine looks likely to go ahead after Poland dropped its opposition. </strong>Diplomats from Warsaw had objected to a minimum corporate tax level, which diplomats had told Reuters had “blindsided” those negotiating the deals. They, and Lithuania, had also argued for tighter restrictions on their neighbour Russia.</p><p><strong>Volodymyr Zelenskiy has said the next six months of the conflict with Russia will be “decisive”. </strong>In an online address to the European Council on Thursday, Ukraine’s president said: “The next six months will be decisive in many respects in the confrontation Russia started with their aggression.”</p><p><strong>Vladimir Putin has said Russia will try to overcome the financial impact of western sanctions by selling gas to its eastern neighbours. </strong>In a televised speech he said Russia would develop its economic ties with countries in Asia, Africa and Latin America.</p> <a href=\"https://www.theguardian.com/world/2022/dec/16/russia-ukraine-war-at-a-glance-what-we-know-on-day-296-of-the-invasion\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/16/russia-ukraine-war-at-a-glance-what-we-know-on-day-296-of-the-invasion", "date_published": "2022-12-16 01:31:49+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Henry Cavill won’t return to The Witcher despite losing Superman role", "description": "<p>Netflix confirms role of Geralt of Rivia will still be recast and played by Australian actor Liam Hemsworth, after Cavill was dropped by DC Studios</p><p>Henry Cavill will not be returning to his role as Geralt of Rivia in Netflix series The Witcher, despite being dropped as Superman after a shake-up at Warner Bros.</p><p>Cavill played Geralt for three seasons but confirmed he would be leaving the Netflix series in October, with the Australian actor Liam Hemsworth stepping into the lead role. </p><p><strong><a href=\"https://www.theguardian.com/newsletters/2019/oct/18/saved-for-later-sign-up-for-guardian-australias-culture-and-lifestyle-email?CMP=copyembed\">Sign up for the fun stuff with our rundown of must-reads, pop culture and tips for the weekend, every Saturday morning</a></strong></p> <a href=\"https://www.theguardian.com/film/2022/dec/16/henry-cavill-wont-return-to-the-witcher-despite-losing-superman-role\">Continue reading...</a>", "link": "https://www.theguardian.com/film/2022/dec/16/henry-cavill-wont-return-to-the-witcher-despite-losing-superman-role", "date_published": "2022-12-16 01:01:20+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Malaysia landslide: 100 people feared trapped at campsite near Kuala Lumpur", "description": "<p>At least 31 people have been rescued after a landslide hit at about 3am on the capital’s outskirts</p><p>About 100 people are feared trapped after a landslide at a campsite in Malaysia in the early hours of Friday, officials say.</p><p>The landslide in Selangor state, on the outskirts of the capital, Kuala Lumpur, occurred at 3am on the side of a road near a farmhouse that provides camping facilities, the state fire and rescue department said in a statement.</p> <a href=\"https://www.theguardian.com/world/2022/dec/16/malaysia-landslide-trapped-campsite-near-kuala-lumpur\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/16/malaysia-landslide-trapped-campsite-near-kuala-lumpur", "date_published": "2022-12-16 00:59:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "US National Archives releases more than 12,000 documents on JFK assassination", "description": "<p>Documents disclosed after Joe Biden issued an executive order authorizing them to be made available to the public</p><p>The US National Archives on Thursday <a href=\"https://bit.ly/3j8Tol0\">released</a> thousands of documents related to the 1963 assassination of then President John F Kennedy shortly after Joe Biden issued an executive order authorizing the release that also kept hundreds of other sensitive records secret.</p><p>The release of 12,879 documents was not expected to include any new bombshells or change the conclusion reached by the commission led by chief justice Earl Warren that Lee Harvey Oswald, a former Marine and communist activist who had lived in the Soviet Union, acted alone. However, the latest cache will be useful for historians focusing on the events around the assassination.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/15/us-national-archives-releases-documents-jfk-assassination\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/15/us-national-archives-releases-documents-jfk-assassination", "date_published": "2022-12-16 00:46:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Peru protests death toll rises to 12 after another day of violent clashes", "description": "<p>Country’s human rights office calls for armed forces to cease the use of firearms and teargas</p><p>The death toll from violent clashes that followed <a href=\"https://www.theguardian.com/world/2022/dec/07/peru-president-detained-pedro-castillo-coup\">the ousting and arrest of President Pedro Castillo a week ago</a> in Peru has risen to at least 12.</p><p>Four people were killed and 39 injured on Thursday in Ayacucho, in Peru’s southern Andes, as protesters clashed with soldiers and police, the local health authority confirmed.</p> <a href=\"https://www.theguardian.com/world/2022/dec/16/peru-protests-death-toll-rises-to-12-after-another-day-of-violent-clashes-castillo\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/16/peru-protests-death-toll-rises-to-12-after-another-day-of-violent-clashes-castillo", "date_published": "2022-12-16 00:39:44+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "World Cup 2022 briefing: Argentina v France will provide subplots aplenty", "description": "<p>A host of intriguing storylines await, including those for clubmates</p><p>Lisandro Martínez v Raphaël Varane, Leandro Paredes v Adrien Rabiot, Cristian Romero v Hugo Lloris and Nahuel Molina v Antoine Griezmann. These are subplots we can look forward to when Argentina face France in the final on Sunday. While everyone is thinking about Lionel Messi v Kylian Mbappé, there are plenty of clubmates preparing to do battle for the right to be champions of the planet, the entire planet.</p> <a href=\"https://www.theguardian.com/football/2022/dec/16/world-cup-2022-briefing-argentina-v-france-will-provide-subplots-aplenty\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/16/world-cup-2022-briefing-argentina-v-france-will-provide-subplots-aplenty", "date_published": "2022-12-16 00:00:36+00:00", "persistent": false, "user": null, "language": "en-US"}]