[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCxt2r57cLastdmrReiQJkEg", "title": "Monopoly is Anti-Landlord Propaganda", "description": "Sign up to Morning Brew for free today: https://morningbrewdaily.com/tomnicholas\n\nWatch this video ad-free on Nebula: https://nebula.tv/videos/tomnicholas-how-capitalism-stole-monopoly\n\nA video about Monopoly, landlords, propaganda and one of the most devious acts of intellectual property fraud of all time.\n\nWritten, presented and directed by Tom Nicholas.\nEdited by Georgia Burrows.\n\n*Chapters*\n\n00:00 Monopoly: A Story of Board Game Propaganda\n05:17 Part One: Lizzie vs. the Landlords\n06:33 Part One (a): The Slightly Weird Economics of Henry George\n14:44 Part One (Redux): Lizzie vs. the Landlords\n18:39 Part Two: Open-Sourcing Monopoly\n24:06 Part Three: The Man Who Stole Monopoly\n29:50 Part Four: The Monopoly Monopoly\n37:44 Part Five: Lizzie's Legacy\n\n*Bibliography*\n\nYou can find an annotated bibliography for this video on my Patreon, here: https://www.patreon.com/posts/video-how-stole-76009569\n\n*Some Copy About this Video for the YouTube Algorithm*\n\nMonopoly is very likely the most popular commercial board game of all time, having sold more than 275 million copies since it was first retreated in 1935. Come the holidays, families and friendship groups worldwide will around their dining room tables and do their best to bankrupt one another. Until, that is, someone inevitably snaps and flips the board.\n\nMonopoly and its associated iconography including “Mr. Monopoly” (or Rich Uncle Pennybags as he was once officially called), the “Go” corner, “Go to Jail” and “Boardwalk” (or “Mayfair” in the UK edition) is iconic. And, those icons are often presented as a celebration of contemporary capitalism; such as when they’re used in the regular McDonalds Monopoly partnership.\n\nBut, what if I was to tell you that what we today know as Monopoly was actually created as a critique of capitalism rather than as a celebration of it? That Monopoly was in fact designed as an ingenious piece of anti-landlord propaganda?\n\nIn this video, we’re going to explore how an activist from Oregon called Lizzie Magie was inspired by the economic and political theories of Henry George to create The Landlord’s Game. And how a salesman called Charles Darrow got rich by stealing her invention.\n\nSupport the channel on Patreon at https://patreon.com/tomnicholas\n\nIf you've enjoyed this video and would like to see more including my What The Theory? series in which I provide some snappy introductions to key theories in the humanities as well as video essays and more then do consider subscribing.\n\nThanks for watching!\n\nTwitter: http://twitter.com/tom_nicholas\nInstagram: http://instagram.com/tomnicholaswtf\nTikTok: https://www.tiktok.com/@tom_nicholas\nPatreon: http://patreon.com/tomnicholas\nWebsite: http://www.tomnicholas.com\n\nSelect footage courtesy of Getty\nBoard Images courtesy Thomas Forsyth: https://landlordsgame.info\n\n#Monopoly #BoardGames #Propaganda", "link": "https://www.youtube.com/watch?v=B7nFA19Gzrw", "date_published": "2022-12-16 20:30:08+00:00", "persistent": false, "user": null, "language": "en-US"}]