[{"source": "https://businessinsider.com.pl/.feed", "title": "Kanada pożyczy Ukrainie 500 mln dolarów kanadyjskich. Sprzedała obligacje", "description": "Kanada pożyczy Ukrainie 500 mln dolarów kanadyjskich. Tamtejszy rząd poinformował, że środki zostaną przekazane po sprzedaży obligacji na wsparcie Ukrainy. Ich emisja trwała od 21 listopada.", "link": "https://businessinsider.com.pl/finanse/kanada-pozyczy-ukrainie-500-mln-dolarow-kanadyjskich-z-emisji-obligacji/s3wteg0", "date_published": "2022-12-16 20:15:12+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Na Węgrzech zamrożono rosyjskie aktywa o wartości 870 mln euro. Wcześniej było to... 3 tys. euro", "description": "Węgierski dziennik \"Nepszava\" podaje, że na Węgrzech zamrożono rosyjskie aktywa o wartości 870 mln euro. Dziennikarze piszą, że wcześniej poziom ten sięgał 3 tys. euro. Wzmożenie aktywności we wdrażaniu unijnych sankcji jest związane ze staraniami Budapesztu o odblokowanie środków unijnych.", "link": "https://businessinsider.com.pl/finanse/na-wegrzech-zamrozono-rosyjskie-aktywa-o-wartosci-870-mln-euro/bjkscb0", "date_published": "2022-12-16 19:47:21+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Jerzy Hausner pierwszym profesorem honorowym Uniwersytetu Ekonomicznego w Krakowie", "description": "Prof. Jerzy Hausner został pierwszym Profesorem Honorowym Uniwersytetu Ekonomicznego w Krakowie. Jest to pierwsze tego typu wyróżnienie w historii uczelni. Profesor Hausner otrzymał je \"za wybitne zasługi, istotny wkład w rozwój dyscyplin naukowych, dorobek naukowy, a także aktywność społeczną i publiczną\".", "link": "https://businessinsider.com.pl/finanse/jerzy-hausner-pierwszym-profesorem-honorowym-uniwersytetu-ekonomicznego-w-krakowie/wjec17c", "date_published": "2022-12-16 19:05:45+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Amerykańska koszykarka wraca do sportu po opuszczeniu rosyjskiej kolonii karnej. Wymieniono ją na najsłynniejszego handlarza bronią", "description": "Brittney Griner chce ponownie grać w profesjonalną koszykówkę. Zawodniczka po raz pierwszy publicznie wypowiedziała się po wyjściu z rosyjskiej kolonii karnej. Wymieniono ją za najsłynniejszego handlarza bronią.", "link": "https://businessinsider.com.pl/sport/brittney-griner-chce-w-tym-roku-wrocic-do-gry-uwolniono-ja-z-kolonii-karnej-w-rosji/cr3r1ld", "date_published": "2022-12-16 18:05:06+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Weekendowe utrudnienia w dostępie do konta. Cztery duże banki", "description": "W przedświąteczny weekend cztery duże banki zaplanowały prace serwisowe. Ich klienci będą mieli czasowo ograniczony dostęp do aplikacji mobilnych i bankowości internetowej.", "link": "https://businessinsider.com.pl/twoje-pieniadze/weekendowe-utrudnienia-w-dostepie-do-konta-cztery-duze-banki/rjp8gk0", "date_published": "2022-12-16 17:56:07+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Firma rodzinna. Jak skutecznie przeprowadzić sukcesję", "description": "Firmy rodzinne od pozostałych przedsiębiorstw wyróżnia jedno. Zarząd często łączą relacje rodzinne, a gdy np. rodzice chcą zmniejszyć swoją aktywność zawodową, ale utrzymać rodzinny charakter przedsiębiorstwa, muszą pomyśleć o sukcesji. Problem w tym, że młodsi następcy nie zawsze chcą przejąć stery. Z pomocą przyjdzie fundacja rodzinna.", "link": "https://businessinsider.com.pl/prawo/firma/firma-rodzinna-jak-przeprowadzic-skuteczna-sukcesje-przez-fundacje-rodzinna/6v0f8g0", "date_published": "2022-12-16 17:06:09+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Norweski gaz z Baltic Pipe już nie płynie do Polski przez Niemcy. Droga krótsza o 800 km", "description": "Przez ponad dwa miesiące od rozpoczęcia przesyłu przez Baltic Pipe, żeby trafić z Norwegii do Polski, gaz musiał przepłynąć przez Niemcy, potem przez Danię i dopiero stamtąd trafiał do Polski. Jak policzyliśmy, wymagało to wykorzystania około 800 km gazociągów więcej. Od środy 30 listopada wszystko się zmieniło. Duńczycy uruchomili ważny punkt przesyłowy.", "link": "https://businessinsider.com.pl/gospodarka/norweski-gaz-z-baltic-pipe-juz-nie-plynie-do-polski-przez-niemcy-droga-krotsza-o-800/txjzrry", "date_published": "2022-12-16 16:54:48+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Eksperci: nowy program mieszkaniowy ożywi rynek i może obniżyć ceny najmu. Jest jednak jeden problem", "description": "Minister rozwoju i technologii Waldemar Buda ogłosił dziś nowy program mieszkaniowy. Będzie on obejmował osoby do 45. roku życia, które dotychczas nie posiadały swojego pierwszego mieszkania. Zakłada on m.in. kredyt o stałej stopie, utworzenie oszczędnościowego konta mieszkaniowego, kwotę kredytu do wysokości 500 tys. dla jednej osoby lub 600 tys. dla pary oraz brak konieczności wniesienia wkładu własnego. Eksperci wskazują, że tego typu program ożywi rynek i zwiększy dostępność mieszkań dla młodych Polaków, ale trzeba uważać przy udzielaniu wsparcia.", "link": "https://businessinsider.com.pl/finanse/program-pierwsze-mieszkanie-eksperci-widza-w-nim-szanse/66cjlx6", "date_published": "2022-12-16 16:50:45+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Goldman Sachs chce zwolnić prawie 4 tys. osób", "description": "Financial Times podaje, że Goldman Sachs chce zwolnić ok. 4 tysięcy pracowników. Dziennik pisze, że w ten sposób firma chce zwiększyć rentowność swojego biznesu. Zwolnienia mają ruszyć już w styczniu.", "link": "https://businessinsider.com.pl/finanse/goldman-sachs-chce-zwolnic-4-tysiace-osob/nymwn2f", "date_published": "2022-12-16 16:41:07+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Pracodawcy wolą przemilczeć te kwoty. Unia wymusi jawność", "description": "Firmy coraz częściej decydują się na zamieszczenie widełek płacowych w ogłoszeniach o pracę. Z danych pewnego rekrutera wynika, że tylko 15 proc. ogłoszeń z 8124 zachęcających do złożenia CV do pracy w transporcie, spedycji i logistyka zamieszczone widełki. Za sprawą unijnej dyrektywy to się zmieni. Jeśli kandydat nie pozna widełek z ogłoszenia i tak się o nich dowie.", "link": "https://businessinsider.com.pl/prawo/praca/czy-w-ogloszeniu-o-prace-musi-byc-podana-pensja-unia-wymusi-przepisy/zfnsg23", "date_published": "2022-12-16 15:48:57+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Alior Bank rusza z odroczonymi płatnościami. Obejmą też rachunki", "description": "Alior Bank uruchomił usługę odroczonych płatności Alior Pay. Jak powiedział prezes banku Grzegorz Olszewski, usługa będzie dostępna nie tylko w sklepach, ale także np. przy opłacaniu rachunków.", "link": "https://businessinsider.com.pl/twoje-pieniadze/alior-bank-rusza-z-odroczonymi-platnosciami-obejma-tez-rachunki/sh83q1h", "date_published": "2022-12-16 15:33:50+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Słabsze dane z amerykańskiej gospodarki. To może wpływać na decyzje Fed", "description": "Wskaźniki PMI płynące z amerykańskiej gospodarki za grudzień okazały się słabsze od listopadowych i prognoz. Informacje te mogą mieć wpływ na kolejne decyzje amerykańskiego banku centralnego.", "link": "https://businessinsider.com.pl/finanse/makroekonomia/slabsze-dane-z-amerykanskiej-gospodarki-to-moze-wplywac-na-decyzje-fed/w7evtcc", "date_published": "2022-12-16 14:57:18+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Stan wyjątkowy w energetyce Ukrainy. Efekt rosyjskiego ostrzału", "description": "Ukraiński operator energetyczny Ukrenerho ogłosił stan wyjątkowy po kolejnym ostrzale infrastruktury energetycznej przez Rosjan. Jak poinformowano system energetyczny stracił ponad 50 procent zużycia energii.", "link": "https://businessinsider.com.pl/wiadomosci/stan-wyjatkowy-w-energetyce-ukrainy-efekt-rosyjskiego-ostrzalu/tr55j90", "date_published": "2022-12-16 14:55:29+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Święta przyniosą podwyżki cen paliw. Już dziś jest o 57 groszy drożej niż rok temu", "description": "Święta przyniosą wzrost cen paliw. Tak wynika z prognoz Biura Maklerskiego Reflex. Zdaniem analityków przed Bożym Narodzeniem możemy zobaczyć kilkugroszowe wahania cen w górę.", "link": "https://businessinsider.com.pl/finanse/ceny-paliwa-pojda-w-gore-na-boze-narodzenie/xb1t24w", "date_published": "2022-12-16 14:39:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Przepisy na dobre życie i pracę z „Rewolucyjnej książki kucharskiej”", "description": "Na pytanie o to, czym jest dobre życie i dobra praca, ale też na wiele innych, które stawiają sobie Polki i Polacy, stara się odpowiedzieć 19 osób z różnych obszarów życia społecznego, nauki i aktywizmu, które Greenpeace Polska zaprosiło do książki „Rewolucyjna książka kucharska, czyli przepisy na lepszą Polskę”. Poza przepisami na roślinne dania zawiera ona także „przepisy na przyszłość” - pomysły na zmiany, których potrzebuje Polska.", "link": "https://businessinsider.com.pl/gospodarka/przepisy-na-dobre-zycie-i-prace-z-rewolucyjnej-ksiazki-kucharskiej/r46mpej", "date_published": "2022-12-16 14:34:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Prezes Tauronu ostro o wykonawcy bloku w Jaworznie. \"Próba ucieczki od odpowiedzialności\" [TYLKO U NAS]", "description": "Wykonawca nowego bloku w Elektrowni Jaworzno — Rafako — zażądało od Tauronu gwarancji zapłaty wynagrodzenia za wykonane prace w wysokości niemal 110 mln zł. Prezes Rafako tłumaczy to m.in. \"obawą o stabilność finansową państwowej spółki\". — W mojej ocenie aktualna aktywność medialna prezesa Rafako oznacza próbę ucieczki od odpowiedzialności za inwestycję i ucieczki od dokończenia tej z inwestycji — ripostuje prezes Tauronu Paweł Szczeszek w rozmowie z Business Insider Polska. Przekonuje, że problemy bloku w Jaworznie są spowodowane m.in. wadami projektowymi i wykonawczymi.", "link": "https://businessinsider.com.pl/biznes/tauron-odpiera-zarzuty-w-sprawie-bloku-w-jaworznie-proba-ucieczki-rafako-od/hbj23r5", "date_published": "2022-12-16 14:27:17+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Duże zmiany w akcyzie. Firmom spada kamień z serca", "description": "Nowelizacja akcyzy czeka już tylko na podpis prezydenta. Większość zmian wejdzie w życie od 1 stycznia 2023 r. Są ważne dla sprzedawców płynów do e-papierosów, elektrycznych samochodów, ale też gmin. Najważniejsza zamiana to przesunięcie wejścia w życie obowiązku ewidencjonowaniu akcyzy w formie elektronicznej.", "link": "https://businessinsider.com.pl/prawo/podatki/nowelizacja-przepisow-o-akcyzie-ewidencje-akcyzowe-beda-pozniej-od-kiedy/k183l6z", "date_published": "2022-12-16 14:26:51+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Zrozumieć AI. Odc. 9 – Edukacja AI w szkołach [podcast]", "description": "Z zalet sztucznej inteligencji – świadomie lub nieświadomie - korzystamy dziś wszyscy. Pomaga nam poszukiwać informacji w internecie, usuwa niechciane maile, podpowiada ciekawą muzykę lub filmy, a nawet pomaga nam prowadzić nowoczesne samochody. Czy młodzi ludzie, uczniowie szkół podstawowych i liceów, są gotowi na dalszy rozwój AI? Czy szkoły w Polsce zapewniają odpowiedni program nauczania i co należałoby w tym programie zmienić?", "link": "https://businessinsider.com.pl/technologie/nowe-technologie/zrozumiec-ai-odc-9-edukacja-ai-w-szkolach-podcast/tvs3trf", "date_published": "2022-12-16 14:10:12+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "UE nakłada kolejne sankcje na Rosję. Na liście znalazły się silniki do dronów", "description": "Unia Europejska formalnie przyjęła w piątek dziewiąty pakiet nowych sankcji na Rosję. Nowe obostrzenia obejmują głównie towary i technologie, które Rosja mogłaby wykorzystywać w swoim sektorze obronnym. Na liście znalazło się też 168 nowych podmiotów, które mogą powiązania z tamtejszym sektorem zbrojeniowym.", "link": "https://businessinsider.com.pl/finanse/kolejne-sankcje-na-rosje-na-liscie-technologie-i-drony/c9mz5nw", "date_published": "2022-12-16 13:58:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Oto zyski banków po dziesięciu miesiącach. KNF podała nowe dane", "description": "Wynik finansowy netto banków wyniósł 9,91 mld zł na koniec października 2022 r., co oznacza spadek o 5,8 proc. rok do roku — podała Komisja Nadzoru Finansowego (KNF). Stratę wykazało w październiku dziesięć banków komercyjnych.", "link": "https://businessinsider.com.pl/finanse/oto-zyski-bankow-po-dziesieciu-miesiacach-knf-podala-nowe-dane/f0g391r", "date_published": "2022-12-16 13:52:09+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "\"Krajowa energetyka na krawędzi\". Prezes Rafako odsłania kulisy sporu wokół Elektrowni Jaworzno [TYLKO U NAS]", "description": "Zaostrza się spór między Rafako a Tauronem w sprawie nowego bloku w Elektrowni Jaworzno, którego budowa pochłonęła 6,5 mld zł. Po miesiącach nieudanych negocjacji Rafako, które realizowało inwestycję, zażądało od właściciela elektrowni — Tauronu — gwarancji zapłaty wynagrodzenia za wykonane prace w wysokości niemal 110 mln zł. — Obawiamy się o stabilność finansową państwowej spółki — wyjaśnia Radosław Domagalski-Łabędzki, prezes Rafako, w rozmowie z Business Insider Polska. Ujawnia też, co wykazało badanie próbek węgla spalanego w nowej instalacji.", "link": "https://businessinsider.com.pl/biznes/krajowa-energetyka-na-krawedzi-prezes-rafako-odslania-kulisy-sporu-z-tauronem-wokol/d5e4y8c", "date_published": "2022-12-16 13:50:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Wyjedź na słoneczny urlop pod palmami. Dominikana w specjalnych cenach", "description": "Dominikana to najchętniej odwiedzana przez turystów wyspa z archipelagu Karaibów. Położona jest pomiędzy Jamajką, Kubą a Portoryko. Dominikana przez turystów, nazywana jest wakacyjnym rajem na ziemi. Czym zasłużyła sobie na to zaszczytne miano? Z całą pewnością rajską przyrodą w postaci szerokich i pięknych plaż z białym i miękkim piaskiem, malowniczych zatok, rozłożystych zielonych palm, stad różowych flamingów nad lazurową wodą i pyszną kuchnią składającą się z egzotycznych owoców i warzyw połączonych z owocami morza. W artykule polecamy sprawdzone hotele, które mają dostępne terminy jesienią i zimą, a jednocześnie są różnorodne pod względem standardu i ceny. Zapraszamy!", "link": "https://businessinsider.com.pl/lifestyle/podroze/wyjedz-na-sloneczny-urlop-pod-palmami-dominikana-w-specjalnych-cenach/v5kk1kh", "date_published": "2022-12-16 13:36:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Roboty kuchenne, które zechcesz mieć jeszcze przed świętami", "description": "Jeśli nie teraz, to kiedy? Nie warto czekać z zakupem robota kuchennego, szczególnie że przed świętami na pewno skorzystamy z jego wszystkich funkcji. Przedstawiamy grudniowy ranking popularności robotów kuchennych na podstawie danych ze Skąpiec.pl.", "link": "https://businessinsider.com.pl/technologie/roboty-kuchenne-ktore-zechcesz-miec-jeszcze-przed-swietami/mp5bnq4", "date_published": "2022-12-16 13:30:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Ten wskaźnik polskiej inflacji może niepokoić. Wysokie tempo wzrostu cen może jeszcze potrwać", "description": "Inflacja bazowa, czyli wskaźnik nieuwzględniający cen energii, paliw i żywności, w listopadzie znowu wzrosła, przekroczyła prognozy i jest na najwyższym poziomie odkąd zbierane są tego typu statystyki — wynika z najnowszych danych Narodowego Banku Polskiego. To wskazuje, że presja inflacyjna w Polsce wciąż jest wysoka. I choć inflacja w przyszłym roku będzie spadać, to ceny konsumpcyjne wciąż będą rosły. Tyle tylko, że nieco wolniej.", "link": "https://businessinsider.com.pl/finanse/makroekonomia/ten-wskaznik-polskiej-inflacji-moze-niepokoic-wysokie-tempo-wzrostu-cen-moze-jeszcze/xw8cjw2", "date_published": "2022-12-16 13:03:56+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Program pierwsze mieszkanie. Rząd ogłasza nowość", "description": "— Mieszkanie to prawo, a nie towar — stwierdził minister Waldemar Buda, zapowiadając nowy program mieszkaniowy rządu. Ma on dać możliwość zakupienia mieszkania już w najbliższym roku lub w kolejnych latach.", "link": "https://businessinsider.com.pl/twoje-pieniadze/program-pierwsze-mieszkanie-rzad-oglasza-nowosc/3qwnjrd", "date_published": "2022-12-16 12:35:21+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Program pierwsze mieszkanie. Rząd ogłasza nowość i pokazuje wyliczenia", "description": "— Mieszkanie to prawo, a nie towar — stwierdził minister rozwoju i technologii Waldemar Buda, zapowiadając nowy program mieszkaniowy rządu. Ma on dać możliwość zakupienia mieszkania już w najbliższym roku lub w kolejnych latach. Składa się z dwóch elementów.", "link": "https://businessinsider.com.pl/twoje-pieniadze/program-pierwsze-mieszkanie-rzad-oglasza-nowosc-i-pokazuje-wyliczenia/3qwnjrd", "date_published": "2022-12-16 12:35:21+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Stacje pogodowe — najnowszy ranking popularności według Skąpiec.pl", "description": "Stacje pogodowe cieszą się ogromną popularnością. Najnowszy ranking stacji pogodowych według danych ze Skąpiec.pl zawiera kilka niezwykle interesujących modeli, z których zadowoleni będą nawet bardziej wymagający użytkownicy.", "link": "https://businessinsider.com.pl/technologie/stacja-pogodowa-jako-nietypowy-prezent-pod-choinke-sprawdz-ranking/ykb2nqx", "date_published": "2022-12-16 12:35:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Przez drożyznę komitety wyborcze będą mogły wydać więcej", "description": "Komitety wyborcze będą mogły wydać więcej w czasie kampanii. Jak informuje Ministerstwo Finansów, zgodnie z kodeksem wyborczym resort jest zobowiązany do podwyższenia limitów wydatków komitetów, gdy wskaźnik inflacji przekroczy 5 proc.", "link": "https://businessinsider.com.pl/finanse/przez-drozyzne-komitety-wyborcze-beda-mogly-wydac-wiecej/0tf6gbl", "date_published": "2022-12-16 12:28:32+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kup zmywarkę, by oszczędzać wodę — ranking najpopularniejszych modeli", "description": "Zamiast spędzać czas w święta na zmywaniu i marnować przy tym ogromne ilości wody, lepiej zainwestować w zmywarkę. Przedstawiamy najnowszy ranking popularności według danych ze Skąpiec.pl. Wybierz model odpowiedni do twoich potrzeb.", "link": "https://businessinsider.com.pl/technologie/kup-zmywarke-by-oszczedzac-wode-ranking-najpopularniejszych-modeli/yn19038", "date_published": "2022-12-16 12:17:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Radio Zet: śledztwo w sprawie podejrzenia przyjęcia korzyści przez wiceprezesa PKN Orlen", "description": "Prokuratura i ABW mają prowadzić śledztwo w sprawie wiceprezesa PKN Orlen — podaje Radio Zet. Miał on umożliwić spółce znanego wrocławskiego biznesmena otrzymanie intratnych kontraktów.", "link": "https://businessinsider.com.pl/wiadomosci/sledztwo-w-sprawie-podejrzenia-przyjecia-korzysci-przez-wiceprezesa-pkn-orlen/gnmlrvp", "date_published": "2022-12-16 11:53:11+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Pracownicy dyskontów chwalą się świątecznymi upominkami. \"Z dystansem proszę\"", "description": "Pracownicy dużych sieci supermarketów dzielą się na TikToku zawartością paczek świątecznych, jakie otrzymali od pracodawców. Nowy trend cieszy się dużym zainteresowaniem internautów, którzy z podziwem odnoszą się do pomysłowości i hojności niektórych szefów. Nie brakuje też sceptycznych komentarzy.", "link": "https://businessinsider.com.pl/pracownicy-dyskontow-pokazuja-swiateczne-prezenty-z-dystansem-prosze/hnzzmet", "date_published": "2022-12-16 11:27:52+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Biedronka, Lidl i inni zdecydowali. Tak będą otwarte sklepy w okresie świąteczno-noworocznym", "description": "\"W okresie świąteczno-sylwestrowym prawie 2200 placówek sieci będzie czynnych do godz. 23 lub dłużej\" — informuje Biedronka. Krótsze godziny otwarcia będą za to obowiązywać w Wigilię i sylwestra. Dotyczy to także innych sieci.", "link": "https://businessinsider.com.pl/wiadomosci/biedronka-lidl-i-inni-zdecydowali-o-godzinach-otwarcia-tak-beda-dzialac-sklepy-w/pc8cw0q", "date_published": "2022-12-16 11:12:36+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Przed nami najdroższe Boże Narodzenie w tym wieku. Ceny poszybowały", "description": "To będą najdroższe święta w tym wieku. W grudniu 2022 r. ceny żywności w Polsce są o ok. 23 proc. wyższe niż przed rokiem – wynika z szacunków Biura Analiz Sektora Food and Agri w Banku BNP Paribas. Zdrożały wszystkie kategorie produktów. Nawet za karpia na tegoroczną Wigilię zapłacimy zdecydowanie więcej niż przed rokiem. Oznacza to, że czekają nas Święta dużo skromniejsze i bardziej bolesne dla naszych portfeli od tych, do których przyzwyczailiśmy się przez ostatnie dekady.", "link": "https://businessinsider.com.pl/finanse/przed-nami-najdrozsze-boze-narodzenie-w-tym-wieku-ceny-poszybowaly/25yngw1", "date_published": "2022-12-16 10:56:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Dlaczego w firmie nie warto oszczędzać na cyberbezpieczeństwie?", "description": "Jak wynika z najnowszego raportu ESET aż 59 proc. małych i średnich firm z Polski doświadczyło w ciągu ostatniego roku incydentu związanego z bezpieczeństwem danych. Średnia szacunkowa jednostkowa strata z tego tytułu wynosiła niemal 220 tys. euro, czyli ponad milion złotych. Dane słowackich analityków wskazują, że liczba wykrytych zagrożeń w sektorze bezpieczeństwa IT zwiększyła się aż o 20 proc. r/r.", "link": "https://businessinsider.com.pl/biznes/dlaczego-w-firmie-nie-warto-oszczedzac-na-cyberbezpieczenstwie/c0z8mlk", "date_published": "2022-12-16 10:50:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Optymistyczne dane o inflacji. Wskaźniki wzrostu cen hamują, choć nadal są wysokie", "description": "Inflacja konsumencka w strefie euro w listopadzie 2022 r. wyniosła 10,1 proc. rok do roku — wynika z finalnych danych opublikowanych w piątek przez Eurostat. To nieco wyższy odczyt niż wskazywały wstępne informacje, ale i tak jest niższy niż miesiąc wcześniej. Polska nadal w czołówce państw o najwyższej inflacji.", "link": "https://businessinsider.com.pl/finanse/makroekonomia/optymistyczne-dane-o-inflacji-wskazniki-wzrostu-cen-hamuja-choc-nadal-sa-wysokie/6y9enpn", "date_published": "2022-12-16 10:27:06+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Twitter zawiesza dziennikarzy, którzy krytykowali Elona Muska", "description": "Twitter zawiesił kilka kont należących do cenionych dziennikarzy, którzy zajmowali się tematem Elona Muska i jego pracy w tym serwisie społecznościowym.", "link": "https://businessinsider.com.pl/media/twitter-zawiesza-dziennikarzy-ktorzy-krytykowali-elona-muska/5392d4e", "date_published": "2022-12-16 10:16:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Piekarze straszą chlebem w styczniu za 15 zł. Na posłach nie zrobiło to wrażenia", "description": "\"Bochenek chleba, którego średnia cena wynosi dziś 4,20 zł, już za kilka tygodni będzie kosztować 12-15 zł\" — ostrzega Krajowy Związek Rewizyjny Spółdzielni Spożywców \"Społem\". Wszystko przez skok cen gazu dla przedsiębiorców. Posłowie nie uwzględnili jednak w przepisach poprawki Senatu, na której zależało piekarzom.", "link": "https://businessinsider.com.pl/gospodarka/chleb-w-styczniu-po-15-zl-rozpaczliwy-apel-piekarzy-zignorowany-przez-poslow/jjrc0x4", "date_published": "2022-12-16 09:51:45+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Niezłe dane z gospodarki strefy euro. Aktywność maleje, ale nie aż tak mocno", "description": "Wskaźniki PMI w strefie euro w grudniu wprawdzie znalazły się poniżej granicy 50 pkt oddzielającej ożywienie aktywności od spadku, ale wzrosły w porównaniu do listopada i okazały się lepsze od prognoz. Gospodarka wspólnej unii walutowej hamuje, ale nie aż tak mocno.", "link": "https://businessinsider.com.pl/finanse/makroekonomia/niezle-dane-z-gospodarki-strefy-euro-aktywnosc-maleje-ale-nie-az-tak-mocno/021gw1j", "date_published": "2022-12-16 09:41:08+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Wreszcie będzie łatwiej o kredyty mieszkaniowe. Urząd zapowiada ważne zmiany dla rynku hipotek", "description": "Urząd Komisji Nadzoru Finansowego w odpowiedzi na pytania redakcji Business Insider Polska zapowiada obniżenie bufora służącego do obliczania zdolności kredytowej. To powinno zwiększyć sprzedaż hipotek i poprawić możliwości zakupu mieszkań przez Polaków. Na razie głównie będzie to dotyczyć kredytów o stałym oprocentowaniu, które stają się w Polsce coraz bardziej popularne. Im dłuższy okres stałej stopy, tym niższy byłby bufor stosowany do szacowania zdolności kredytowej i tym większą sumę można by pożyczyć od banku.", "link": "https://businessinsider.com.pl/finanse/wreszcie-bedzie-latwiej-o-kredyty-mieszkaniowe-urzad-zapowiada-wazne-zmiany-dla-rynku/kl3sy7n", "date_published": "2022-12-16 09:13:18+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Pracodawca płacił za mało? Dowiesz się o tym. Otrzymasz też odszkodowanie i zaległe premie", "description": "Komisja Europejska przyjmuje osiągnięte porozumienie polityczne między Parlamentem Europejskim a Radą w sprawie dyrektywy dotyczącej środków zapewniających przejrzystość wynagrodzeń. Nowe przepisy zapewnią większą przejrzystość i skuteczne egzekwowanie zasady równości wynagrodzeń kobiet i mężczyzn, a także poprawią dostęp dla wymiaru sprawiedliwości w zakresie dyskryminacji płacowej.", "link": "https://businessinsider.com.pl/prawo/praca/pracodawca-placil-za-malo-dowiesz-sie-o-tym-otrzymasz-tez-odszkodowanie-i-zalegle/7wrbqfx", "date_published": "2022-12-16 09:04:19+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "500 milionów euro na rozwój biznesu w Polsce Wschodniej. Wkrótce pierwsze konkursy", "description": "Program Polska Wschodnia, realizowany w latach 2014-2020 ze środków Unii Europejskiej w 5-ciu wschodnich województwach okazał się sukcesem – między innymi: ponad 3,4 tys. firm otrzymało wsparcie na rozwój biznesu, powstało 4,1 tys. miejsc pracy, ok. 630 przedsiębiorców weszło na nowe rynki zagraniczne, wdrożono ponad 3 tys. innowacji i ok. 160 wyników prac B+R. Wsparcie będzie kontynuowane w programie Fundusze Europejskie dla Polski Wschodniej 2021-2027. Budżet programu to 2,65 mld euro. Pierwsze konkursy wystartują w 2023 roku – kto i na jakie działania może uzyskać dofinansowanie?", "link": "https://businessinsider.com.pl/finanse/fundusze/500-milionow-euro-na-rozwoj-biznesu-w-polsce-wschodniej-wkrotce-pierwsze-konkursy/n09lpfr", "date_published": "2022-12-16 09:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "RPO apeluje do ministra finansów ws. rozliczania składki zdrowotnej", "description": "Rzecznik Praw Obywatelskich interweniuje w Ministerstwie Finansów ws. niekorzystnych zasad rozliczania składki zdrowotnej przez przedsiębiorców. Zmiany wynikają z przepisów Polskiego Ładu.", "link": "https://businessinsider.com.pl/twoje-pieniadze/rpo-apeluje-do-ministra-finansow-ws-rozliczania-skladki-zdrowotnej/4ck8zg0", "date_published": "2022-12-16 08:53:14+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "W Niemczech pękło największe akwarium na świecie. Ewakuacja hotelu", "description": "W piątek w godzinach porannych pękło akwarium AquaDom w Berlinie, czyli największa na świecie cylindryczna konstrukcja z morską wodą; pobliska ulica została zalana, dwie osoby ucierpiały w wyniku skaleczenia odłamkami szkła — powiadomił niemiecki portal rbb24 za berlińską policją i strażą pożarną.", "link": "https://businessinsider.com.pl/wiadomosci/w-niemczech-peklo-najwieksze-akwarium-na-swiecie-aquadom-goscie-hotelu-ewakuowani/2r695jy", "date_published": "2022-12-16 08:37:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kurs franka 16 grudnia w okolicach 4,75 zł", "description": "Frank szwajcarski w okolicach 4,75 zł. W piątek rano 16 grudnia 2022 r. kurs tej waluty wobec polskiego złotego wynosi 4,7502.", "link": "https://businessinsider.com.pl/gielda/kursy-walut/kurs-franka-frank-szwajcarski-chfpln-16-grudnia-2022/g60d4yr", "date_published": "2022-12-16 08:10:49+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kurs euro 16 grudnia poniżej 4,7", "description": "Kurs euro poniżej 4,7 zł. W piątek rano 16 grudnia 2022 r. kurs EUR/PLN wynosił 4,6895 zł.", "link": "https://businessinsider.com.pl/gielda/kursy-walut/kurs-euro-eurpln-notowania-walut-16-grudnia-2022/d4v5h5w", "date_published": "2022-12-16 08:09:04+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kurs dolara 16 grudnia w okolicach 4,4 zł", "description": "Kurs dolara w okolicach 4,4 zł. W piątek rano 16 grudnia 2022 r. kurs USD/PLN wynosi 4,4082.", "link": "https://businessinsider.com.pl/gielda/kursy-walut/kurs-dolara-usdpln-notowania-walut-16-grudnia-2022/x9q0v6p", "date_published": "2022-12-16 08:06:12+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Inflacja dołuje ponad połowę Polaków", "description": "Ponad połowa Polaków odczuwa pogorszenie kondycji psychicznej z powodu wysokiej inflacji — wynika z badania do raportu \"Zdrowie psychiczne Polaków w czasach wysokiej inflacji\". Według autorów raportu, gospodarcze koszty tego zjawiska to ponad 2 mld rocznie.", "link": "https://businessinsider.com.pl/wiadomosci/inflacja-doluje-ponad-polowe-polakow/qxqt1yd", "date_published": "2022-12-16 07:37:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Lidl Polska: jubileuszowy 2022 rok upłynął pod znakiem nowych wyzwań", "description": "Kończy się ważny, bo jubileuszowy rok dla firmy Lidl Polska. Sieć w ciągu ostatnich miesięcy nie przestała się rozwijać i w związku z kolejnymi otwarciami, zatrudniła w Polsce ponad 1000 nowych pracowników, którzy od przyszłego roku będą zarabiali więcej. Jednocześnie firma stale poszukiwała ekologicznych rozwiązań oraz podnosiła atrakcyjność swojej oferty, obniżając ceny i chroniąc polskie rodziny przed inflacją. W pędzie codziennych zadań, firma nie zapomniała również o wsparciu obywateli Ukrainy i innych potrzebujących.", "link": "https://businessinsider.com.pl/wiadomosci/lidl-polska-jubileuszowy-2022-rok-uplynal-pod-znakiem-nowych-wyzwan/8t8xxsz", "date_published": "2022-12-16 07:36:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Norwegowie przejmują polską sięć pizzerii", "description": "Ok. 190 lokali franczyzowych sieci Da Grasso przechodzi w norweskie ręce. Nie oznacza to jednak rozstania założycielki biznesu z marką.", "link": "https://businessinsider.com.pl/firmy/orkla-przejmuje-da-grasso-norwegowie-biora-190-restauracji/5g9pbwn", "date_published": "2022-12-16 07:25:49+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kolejne wyciągi ruszą w weekend. Kto był w zeszłym roku, może się zdziwić cenami", "description": "W weekend na Podhalu ruszają kolejne wyciągi narciarskie. Szusować będzie można m.in. na Gubałówce, Polanie Szymoszkowej i Harendzie w Zakopanem oraz w Jurgowie, Kluszkowcach, na Jaworzynie Krynickiej, Słotwinach i Wierchomli. Nie wszędzie jednak stan pokrywy śnieżnej jest już odpowiedni.", "link": "https://businessinsider.com.pl/wiadomosci/gdzie-na-narty-kolejne-wyciagi-rusza-w-weekend-uwaga-na-ceny/nvm4nl4", "date_published": "2022-12-16 06:57:51+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Brytyjczycy zapowiadają rewolucję w lataniu. Koniec z uciążliwymi kontrolami bagażu", "description": "Najpóźniej za półtora roku na głównych brytyjskich lotniskach ma być zniesiony zakaz przewożenia w bagażu podręcznym płynów o objętości powyżej 100 ml oraz obowiązek wyjmowania laptopów i innego większego sprzętu elektronicznego przed prześwietlaniem bagażu. Z dotychczasowymi problemami mają sobie poradzić skanery nowej generacji.", "link": "https://businessinsider.com.pl/wiadomosci/koniec-z-wyciaganiem-laptopow-i-przelewaniem-plynow-wielka-brytania-zapowiada/pryeyx0", "date_published": "2022-12-16 06:39:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Superdrogie mieszkania biją rekordy. 23 mln zł za apartament w Warszawie", "description": "Apartament w Warszawie kupiony za 23 mln zł, w Krakowie – za ponad 15 mln. To rekordowe transakcje mijającego roku – informuje \"Rzeczpospolita\" w piątkowym wydaniu.", "link": "https://businessinsider.com.pl/twoje-pieniadze/nieruchomosci/superdrogie-mieszkania-bija-rekordy-23-mln-zl-za-apartament-w-warszawie/m7bk4b3", "date_published": "2022-12-16 06:31:32+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Ponad 11 mln zł za tuńczyka ważącego 278 kg. Tak wygląda największy targ rybny świata", "description": "Tuńczyk błękitnopłetwy jest w Japonii znany jako \"król sushi\" ze względu na swój kolor i układ włókien. Najlepsze złowione okazy sprzedawane są na aukcjach na targu Toyosu w Tokio za równowartość milionów złotych.", "link": "https://businessinsider.com.pl/lifestyle/jedzenie/ponad-11-mln-zl-za-tunczyka-wazacego-278-kg-tak-wyglada-najwiekszy-targ-rybny-swiata/eep73b2", "date_published": "2022-12-16 06:24:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Oto cztery oznaki tego, że ktoś próbuje tobą manipulować", "description": "Większość z nas styka się z manipulacją każdego dnia. Różne jej metody stosują twórcy reklam, nasi przełożeni, a bywa, że także nasi życiowi partnerzy. Jeśli są używane subtelnie, czasem trudno odróżnić je od perswazji. Są jednak pewne różnice.", "link": "https://businessinsider.com.pl/rozwoj-osobisty/jak-poznac-ze-jest-sie-manipulowanym-cztery-oznaki/n74y22s", "date_published": "2022-12-16 06:20:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Czy wiesz, kto to powiedział? [QUIZ]", "description": "Złote myśli, motywujące aforyzmy, genialne spostrzeżenia - notujemy je, wieszamy sobie nad łóżkiem, zapisujemy innym na kartkach urodzinowych. Niektóre z nich weszły do naszego codziennego języka i z czasem zapomnieliśmy, kto właściwie jest ich autorem. Sprawdź, czy pamiętasz, kto wypowiedział poniższe zdania, przydatne nie tylko drodze na szczyt.", "link": "https://businessinsider.com.pl/rozwoj-osobisty/czy-wiesz-kto-to-powiedzial-cytaty-znanych-ludzi-quiz/fy1gk1k", "date_published": "2022-12-16 06:19:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kolejna edycja rządowego programu. Do wzięcia nawet 135 tys. zł", "description": "3 stycznia 2023 r. ruszy kolejna edycja programu \"Czyste Powietrze\", w którym na wymianę \"kopciucha\" i termomodernizację domu będzie można otrzymać nawet do 135 tys. zł dotacji – poinformowała PAP minister klimatu i środowiska Anna Moskwa.", "link": "https://businessinsider.com.pl/wiadomosci/kolejna-edycja-rzadowego-programu-do-wziecia-nawet-135-tys-zl/r3egh53", "date_published": "2022-12-16 06:11:48+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Unijne fundusze znów się oddalają. Prezydent mówi zupełnie coś innego niż Komisja Europejska", "description": "Unijna kasa z Funduszy Odbudowy znów nam się oddala, bo okazuje się, że prezydent Andrzej Duda ma w tej sprawie poglądy raczej sprzeczne z poglądami Komisji Europejskiej. Rynki posmutniały, bo wszyscy podnoszą stopy procentowe, a inflacja w Polsce okazała się jednak minimalnie wyższa, niż sądzono. UOKiK zabrał się za oszustów preparujących na zamówienie fałszywe opinie o produktach w internecie, a wszyscy razem dogoniliśmy Portugalczyków w poziomie konsumpcji indywidualnej. Oto pięć najciekawszych wydarzeń w gospodarce teraz.", "link": "https://businessinsider.com.pl/gospodarka/piec-najciekawszych-wydarzen-w-gospodarce-teraz-16122022/gwejk5j", "date_published": "2022-12-16 06:11:09+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Tych ustaw nie można przegapić. Siedem najważniejszych zmian uchwalonych przez Sejm", "description": "Czwartek 15 grudnia obfitował w prawne wydarzenia. Było zamieszanie z projektem ustawy o Sądzie Najwyższym, ale Sejm też uchwalił wiele ustaw, w tym wprowadzającą maksymalne ceny gazu. Są też inne zmiany w prawie, które dotkną firmy. Ponadto do podpisu prezydenta trafi już też ustawa wprowadzająca abolicję dla samorządowców za wybory kopertowe. Przeczytaj artykuł, a dowiesz się o więcej zmianach.", "link": "https://businessinsider.com.pl/prawo/maksymalne-ceny-gazu-i-nie-tylko-siedem-najwazniejszych-zmian-uchwalonych-przez-sejm/vr3yrg8", "date_published": "2022-12-16 05:47:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Polska zablokowała pomoc UE dla Ukrainy. Potem zdanie zmieniła", "description": "Polska odmówiła poparcia pakietu porozumień, wśród których było uwolnienie 18 miliardów euro pomocy Unii Europejskiej dla Ukrainy. Powodem było weto w sprawie minimalnej stawki podatku od osób prawnych. Potem zdanie zmieniła, ale sprzeciw \"był zupełnie niezrozumiały\" dla reszty krajów UE — pisze \"Rzeczpospolita\".", "link": "https://businessinsider.com.pl/finanse/polska-zablokowala-pomoc-ue-dla-ukrainy-potem-zdanie-zmienila/eg1zrej", "date_published": "2022-12-16 05:46:09+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Badania lekarskie pracowników mogą być dłuższe. Idą zmiany w medycynie pracy", "description": "Załóżmy, że na okresowe badania stawi się pracownik, który jest w grupie ryzyka różnych schorzeń, np. z uwagi na wiek lub warunki pracy. W takim przypadku lekarz będzie mógł skierować go na dodatkowe bezpłatne badania. Dzięki temu firma zaoszczędzi na medycynie pracy, ale pojawia się też dużo wątpliwości.", "link": "https://businessinsider.com.pl/prawo/praca/badania-lekarskie-pracownikow-moga-byc-dluzsze-ida-zmiany-w-medycynie-pracy/154py9b", "date_published": "2022-12-16 05:33:45+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Problem z PIT-11. Przez brak jednego numeru grożą wysokie kary", "description": "Firmy muszą przesłać fiskusowi drogą elektroniczną PIT-11 za 2022 r. do końca stycznia 2023 r. Większość już teraz przygotowuje się do złożenia tego formularza i napotyka problemy. Okazuje się, że przez brak numeru PESEL nie można wywiązać się z obowiązku.", "link": "https://businessinsider.com.pl/prawo/podatki/problem-z-pit-11przez-brak-jednego-numeru-firmom-groza-wysokie-kary/g9z7kq3", "date_published": "2022-12-16 05:24:41+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Jest porozumienie ws. 9 pakietu sankcji na Rosję", "description": "Udało się osiągnąć porozumienie w sprawie 9. pakietu sankcji przeciwko Rosji — powiedział w czwartek wieczorem na konferencji prasowej po zakończeniu szczytu unijnych przywódców w Brukseli przewodniczący Rady Europejskiej Charles Michel.", "link": "https://businessinsider.com.pl/finanse/porozumienie-ws-9-pakietu-sankcji-na-rosje/bjgtbkw", "date_published": "2022-12-16 05:20:15+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Jest porozumienie ws. 9 pakietu sankcji na Rosję", "description": "Udało się osiągnąć porozumienie w sprawie 9. pakietu sankcji przeciwko Rosji — powiedział w czwartek wieczorem na konferencji prasowej po zakończeniu szczytu unijnych przywódców w Brukseli przewodniczący Rady Europejskiej Charles Michel.", "link": "https://businessinsider.com.pl/finanse/prozumienie-ws-9-pakietu-sankcji-na-rosje/bjgtbkw", "date_published": "2022-12-16 05:20:15+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Panele zasypane śniegiem, wiatraki ledwo się kręcą. Dominacja węgla w energetyce największa od lat", "description": "W grudniu były już cztery takie dni, kiedy elektrownie węglowe wyprodukowały aż ponad 85 proc. energii w Polsce. Wielomiliardowe inwestycje w energetykę odnawialną zdają się na nic, bo wciąż bazujemy na \"brudnej\" energii. Wymusza to sytuacja pogodowa. Zasypane śniegiem panele słoneczne praktycznie nie wytwarzają energii, a z racji tego, że słabo wieje, wiatraki produkują w niektóre dni poniżej 3 proc. prądu w systemie. Gdyby węgla zabrakło, polska gospodarka mogłaby się właśnie zwijać.", "link": "https://businessinsider.com.pl/gospodarka/dominacja-wegla-w-energetyce-najwieksza-od-lat-panele-zasypane-sniegiem-wiatraki/gqetfws", "date_published": "2022-12-16 05:14:40+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Na ten moment czekali kredytobiorcy. Raty w dół jeszcze nawet w tym roku. Zobacz o ile", "description": "To może być początek końca koszmaru kredytobiorców. RPP wstrzymała podwyżki stóp, a na dodatek w najbliższym czasie raty wielu klientów banków wreszcie spadną. Wielu Polaków czekało na ten moment od bardzo dawna. Pierwsze symboliczne obniżki mogą pojawić się jeszcze nawet w tym roku. Sprawdziliśmy, o ile mniejsza będzie rata kredytu.", "link": "https://businessinsider.com.pl/twoje-pieniadze/wibor-zaczal-spadac-raty-w-dol-jeszcze-w-tym-roku/dn8qwfh", "date_published": "2022-12-16 05:05:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Prezes PKO BP chce rozwiązać frankowy problem. \"Pracujemy nad zmianami naszej oferty\" [TYLKO U NAS]", "description": "Jesteśmy liderem, jeśli chodzi o proces zawierania ugód frankowych, czyli szukania sprawiedliwego rozwiązania, które będzie satysfakcjonujące zarówno dla naszych klientów, jak i banku. Obecnie pracujemy nad kolejnymi, korzystnymi zmianami naszej oferty. Będziemy je intensywnie promować i mam nadzieję, że duża część frankowego portfela kredytowego do czasu orzeczenia TSUE znajdzie rozwiązanie na drodze ugodowej – mówi w wywiadzie dla Business Insider Polska Paweł Gruza, p.o. prezesa PKO BP.", "link": "https://businessinsider.com.pl/finanse/prezes-pko-bp-ma-nowy-pomysl-na-ugody-z-frankowiczami/2617p6q", "date_published": "2022-12-16 05:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]