[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "15 MORE Things You STILL Didn't Know In Zelda Breath Of The Wild", "description": "This time in Breath of the Wild, we look back at some secrets about Zelda WiiU, what clothing shop banners actually are, and funny ways to disarm certain enemies.\n\nIn the video above, we cover 15 facts, tips and tricks that aren’t quite as well known, ranging from secrets to glitches, so me that are pretty simple and others that are fairly complex. The Legend of Zelda: Breath of the Wild has been out for four years at this point, and players have found some amazing things, intended or not, that keep the game and its sense of discovery feeling fresh.\n\n#botw #breathofthewild #gaming \n\n0:00 Intro\n0:20 Zonai Towers Were Changed\n0:54 Repair Sheikah Text\n1:23 Two Guidance Stones Messages\n2:08 Guardian Resist Buff Translated\n2:16 Final Trial Lock Text\n2:41 Hyrule Castle Library Categorization\n3:21 Zelda WiiU Loves Ghibli\n3:58 Zelda WiiU Sound Effects\n4:49 Hestu's Island\n5:00 Armor Shop Banners\n5:22 Holding Jump Attacks\n5:38 Tips From The Wild\n5:58 Holding Fire While Crouching\n6:23 Buy Shields Out Of Enemies Hands\n7:07 Disarming Lynels\n7:43 Outro", "link": "https://www.youtube.com/watch?v=WeRjOmQbOHA", "date_published": "2022-10-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "SILENT HILL Townfall Official Teaser Trailer", "description": "From Annapurna Interactive, the creators of Stories Untold and Observation, and No Code, comes Silent Hill: Townfall - a spinoff of the Silent Hill franchise. Not much is known about Silent Hill: Townfall as of yet, but it's meant to be an expanded concept on Silent Hill, and No Code's prior games were inspired by the psychological horror of Silent Hill. No release date has been revealed as of yet.\n\n#silenthill #townfall #gaming", "link": "https://www.youtube.com/watch?v=FIRDHM2zqE0", "date_published": "2022-10-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "SILENT HILL f Official 4K Teaser Trailer", "description": "After many long years, the classic psychological horror franchise Silent Hill is finally back with Silent Hill f. Silent Hill f is the first original Silent Hill sequel in years. In the trailer we see odd blood vines, and a Japanese Torii gate. The blood blossoms around a girl to reveal what looks like a creepy inner disease. Silent Hill f is written by Ryukishi07, creature & character design from kera, and produced by Motoi Okamoto. Silent Hill f has yet to receive a release date.\n\n#silenthillf #konami #gaming", "link": "https://www.youtube.com/watch?v=ZqzK_nqDU9M", "date_published": "2022-10-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Silent Hill F Teaser Trailer", "description": "Check out the teaser trailer for an upcoming game Silent Hill F that was announced during the Konami Transmission.\n\n#silenthillf #konami #gaming", "link": "https://www.youtube.com/watch?v=jbYB8HD-RX8", "date_published": "2022-10-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "When Will Call of Duty Be On Game Pass? | GameSpot News", "description": "We’ve got another update in the Microsoft & Activision Blizzard investigation as well as Silent Hill and Disney news.\n#GamingNews #CallofDuty #ModernWarfare2\n\nThe Competition and Markets Authority has so far expressed a number of concerns related to Microsoft and Activision Blizzard’s deal. One concern is how it has the potential to have a major impact on Sony if Activision Blizzard content is made exclusive to Xbox. \n\nIn response to the CMA’s decision to enter a second phase of investigation into the proposed $69 billion deal, Microsoft highlighted footnote references to a tweet from Microsoft Gaming CEO Phil Spencer that said, \"The agreement between Activision Blizzard and Sony includes restrictions on the ability of Activision Blizzard to place Call of Duty titles on Game Pass for a number of years.” \n\nAfter months of speculation and reports, Konami officially confirmed its Silent Hill 2 remake during the Silent Hill Transmission video presentation. The game, which opened the presentation with an impressive trailer, looks to be rebuilt from the ground up while still keeping the essence of the 2001 original intact.\n\nThe trailer gives us a look at the new James Sunderland, who has ventured to Silent Hill to rescue his wife Mary--long believed dead. We see some signature series elements in the trailer, as well, including the fog-filled streets and a few familiar enemies. Those, naturally, include Pyramid Head.\n\nThe Sunlit Plateau has fallen under darkness, and Scar--who wants to make that area his home--recruits the player to set things right. A new set of Star Path rewards are also available, which will let players earn Halloween-themed clothes and decorations to give their version of Dreamlight Valley a spooky spin.\n\nThe update also includes multiple bug fixes, from minor elements like Mickey's weird eyes and lightning flashes to game-breaking bugs. For example, memory pieces that would spawn inside the counter at Scrooge's store no longer do so, which allows players to finish questlines for multiple characters.", "link": "https://www.youtube.com/watch?v=fqgyXMvhLHg", "date_published": "2022-10-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "9 Minutes of Dead Space Remake Chapter 3 Gameplay", "description": "Check out more gameplay from Dead Space Remake. This time we're taking a look specifically at chapter 3. You'll get to see some zero gravity gameplay, exploration, combat, and the use of the flamethrower.\n\n#deadspace #gameplay #gaming", "link": "https://www.youtube.com/watch?v=CeSVegpCEro", "date_published": "2022-10-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best PlayStation Plus Games October 2022", "description": "Presented by PlayStation Plus. From spooky games like The Medium and Inside to whacky thrills like Grand Theft Auto: Vice City - Definitive Edition, there's plenty arriving on PlayStation Plus this October. Here's your rundown of all the new games joining the service.\n\n#gaming #gamespot #playstationplus\n\nRegardless of which PlayStation Plus membership plan you have, there are loads of fantastic games joining the service this October. If you don't know where to start, then don't worry: we've got you covered. In this video, we go through all the latest games joining PS Plus, from the monthly games available to every subscriber, to new entries to the Game and Classics Catalogs. We also give you a rundown of the PS Plus Plans, and explain the benefits of each one. \n\nIt’s October, which means spooky season is upon us. Get your fright on with gruesome platformers Inside and Limbo, or solve a dark mystery in The Medium. There are a number of Assassin’s Creed games joining Game Catalog, including Assassin’s Creed 3 and Assassin’s Creed Syndicate, as well as the sprawling RPG Assassin’s Creed Odyssey. If you fancy something a little smaller in scale, there are the Assassin’s Creed Chronicles titles, 2.5D platformers that mix stealth, parkour, and combat. \n\nOther Game Catalog highlights include five (that’s right, five!) Dragon Quest games, including Dragon Quest 11, and Dragon Quest Builders. More Yakuza games are joining PlayStation Plus, with Yakuza 3, 4, and 5 Remastered hitting the Classics Catalog.\nThere are so many more games coming to PS Plus, so to keep up to date, make sure to subscribe to GameSpot.", "link": "https://www.youtube.com/watch?v=fzte4bsNXb8", "date_published": "2022-10-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War Ragnarök Shaping the Story Dev Overview", "description": "Join us on our journey behind the scenes of God of War Ragnarök. Throughout this series, we’ll take you across the Nine Realms as we look behind the curtain at the development process across the many disciplines that bring God of War to life.\n\nEpisode 1 begins in Midgard, where we’ll cover the important story information from God of War (2018) and set the stage for God of War Ragnarök before it launches on November 9th, 2022.  \n\n#godofwarragnarok #godofwar #gaming", "link": "https://www.youtube.com/watch?v=EX70WLYiLRc", "date_published": "2022-10-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Modern Warfare 2 Spec-Ops Details Finally Revealed | GameSpot News", "description": "Activision has finally revealed more details about Modern Warfare 2’s Spec Ops mode.\n#GamingNews #CallofDuty #ModernWarfare2\n\nModern Warfare 2's Spec Ops mode is a 2-player co-op experience and at launch, Activision says it will initially feature three missions, meaning more missions could potentially arrive at a later date. These will be large-scale missions that take place in Al Mazrah, the new map location for Warzone 2.0.\n\nIn Spec Ops, players will have access to a backpack to store equipment and one of three Kits. Special Ops Kits are similar to having a set of perks, field upgrades, and killstreaks in multiplayer.\n\nThese Kits are leveled up by earning stars through missions and mission-related challenges, which the publisher says gives all three of these launch missions plenty of replayability.\n\nActivision also mentioned that players will want to complete the Spec Ops missions and have at least one Kit leveled up to Rank 5 before Raids arrive post-launch on December 14 as part of the season 1 reloaded update. While it doesn't specify why, presumably this means kits will be factored into the Raids, which are described as being a direct continuation of the campaign. This new Raid feature will be introduced to Spec Ops sometime in Season 1.\n\nThose with digital preorders of the game will receive early access to Modern Warfare 2's campaign, starting on October 20. Additionally, Activision announced a whole set of Modern Warfare 2 campaign rewards that players can earn for completing the campaign during the early-access period.", "link": "https://www.youtube.com/watch?v=JSh8HpgIrIQ", "date_published": "2022-10-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Need for Speed Unbound Official Gameplay Trailer", "description": "To get to the top in Need for Speed Unbound, you need to take risks. Choose how and when to put it all on the line, pulling huge drifts on the street, outdriving the cops, or placing side bets with your own earnings against rival racers. Time is money, so find the fastest way to earn enough cash to enter the weekly qualifiers and make it to Lakeshore’s ultimate race, The Grand.\n\nStart at the bottom and race to the top in Need for Speed Unbound, coming to PlayStation 5, Xbox Series X and S and PC on December 2, 2022.\n\n#nfs #needforspeed #gaming", "link": "https://www.youtube.com/watch?v=YM6nUa2_EBQ", "date_published": "2022-10-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]