[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "A Glimpse Inside Michael Flynn’s Holy War | FRONTLINE + @AssociatedPress", "description": "Michael Flynn spent decades fighting wars overseas, from Central America to Iraq to Afghanistan. Now, the retired three-star general is fighting a war at home, the new documentary “Michael Flynn's Holy War” reports.\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate.\n \nFRONTLINE and The @AssociatedPress trace that transformation, showing how Flynn has become a leader in a political movement that’s attracting election deniers, conspiracy theorists and extremists from around the country.\n\n“Michael Flynn's Holy War” examines the movement’s volatile mix of politics and conspiracy theories — and its efforts to put its brand of Christianity at the center of American civic life and institutions. As the above excerpt shows, this ideology — known as Christian nationalism — was on display at the Capitol insurrection on Jan. 6, 2021, where camouflage and tactical gear mingled with Christian imagery.\n\nIn the run-up to the midterm elections, \"Michael Flynn’s Holy War\" is a revealing look at the rise of one of the Republican party’s most active and polarizing political allies, and what his growing influence might mean for future U.S. elections.\n\n\"Michael Flynn’s Holy War\" will be available to stream in full starting Oct. 18, 2022. https://to.pbs.org/3D6cQqc \n\n\"Michael Flynn’s Holy War\" is a FRONTLINE production with Midnight Films, LLC in partnership with The Associated Press. The director and writer is Richard Rowley. The producers are Paul Abowd and Jacqueline Soohen. The reporters are Michelle R. Smith, Paul Abowd and Richard Rowley. The correspondent is Michelle R. Smith. The international investigations editor for AP is Ron Nixon. The editor-in-chief and executive producer of FRONTLINE is Raney Aronson-Rath.\n\n#MichaelFlynn #FRONTLINE #Documentary #AssociatedPress\n\nFind FRONTLINE on the PBS Video App, where more than 300 of our documentaries available to watch any time: https://to.pbs.org/FLVideoApp \n\nSubscribe on YouTube: http://bit.ly/1BycsJW \nInstagram: https://www.instagram.com/frontlinepbs\nTwitter: https://twitter.com/frontlinepbs \nFacebook: https://www.facebook.com/frontline\n\nFRONTLINE is produced at GBH in Boston and is broadcast nationwide on PBS. Funding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Additional support for FRONTLINE is provided by the Abrams Foundation, the John D. and Catherine T. MacArthur Foundation, Park Foundation, the Heising-Simons Foundation, and the FRONTLINE Journalism Fund, with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen. Funding for Michael Flynn’s Holy War is provided by the Jonathan Logan Family Foundation and The WNET Group’s Preserving Democracy, a public media reporting initiative.", "link": "https://www.youtube.com/watch?v=TdypIYfTU1U", "date_published": "2022-10-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]