[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Excess baby deaths investigation", "description": "Review of spikes in Neonatal Mortality ordered by Scotland\n\nhttps://www.healthcareimprovementscotland.org/our_work/governance_and_assurance/programme_resources/neonatal_mortality_in_scotland.aspx\n\nHealthcare Improvement Scotland, asked by Scottish Government\n\nReview of significant increase in neonatal mortality\n\n2021 to 2022\n\nScottish Government orders review as neonatal deaths higher than expected\n\nhttps://www.bbc.co.uk/news/uk-scotland-63097142\n\nNeonatal death rates, two spikes over six-months\n\nSeptember 2021, at least 21 babies under 4 weeks died\n\nMarch 2022, at least 18 babies under 4 weeks died\n\nAverage mortality rate among newborns\n\nTwo per 1,000 births.\n\nIn September 2021, 4.9 per 1,000 births\n\nMarch 2020, 4.6 per 1,000 births\n\nFor all of 2021, 3.9 infant deaths for every thousand live births\n\nFor all of 2020, 3.1\n\n(A preliminary investigation found the September spike was not linked to Covid)\n\nThis form of monitoring introduced, July 2017\n\nDr Sarah Stock, maternal and foetal medicine, University of Edinburgh\n\nhttps://www.scotsman.com/health/scottish-government-orders-review-as-neonatal-deaths-higher-than-expected-3863538\n\nI think the numbers are really troubling and I don't think we know the reasons why yet.\n\nWhat we do know it's not neonatal Covid – the rates of Covid-19 infection in babies are very low and deaths from Covid are thankfully very, very small, \n\nso this isn't Covid affecting babies\n\n\nCovid Scotland: Vaccines ruled out in neonatal deaths spike\n\nhttps://www.heraldscotland.com/news/23028843.covid-scotland-vaccines-ruled-cause-neonatal-deaths-spike/?ref=rss\n\nPUBLIC health experts ruled out any link between spikes in neonatal deaths and the Covid vaccine\n\nwithout checking whether any of the infants' mothers had received the jag during pregnancy.\n\nExperts stressed, no “plausible” link to justify investigating maternal vaccination status. \n\nPublic Health Scotland (PHS) said its consultants had given “careful consideration” to the “potential benefits and harms” of carrying out such as analysis as part of its probe into the tragic deaths of 39 infants, \n\nbut concluded against doing so\n\nPHS added\n\nA risk that “identifying the vaccination status of the mothers, even at aggregate level, \n\nwould result in harm to those individuals and others close to them, \n\nthrough actual or perceived judgement of the effects of their personal vaccination decision”\n\nFurthermore\n\n“the outcomes of such analysis, whilst being uninformative for public health decision making, \n\nhad the potential to be used to harm vaccine confidence at this critical time”\n\nPHS response, “We do not have any plans to examine maternal vaccination status, as there is no public health reason to do so”.\n\nNHS logging baby deaths as stillbirths ‘to avoid scrutiny’\n\nhttps://www.telegraph.co.uk/news/2022/10/16/nhs-logging-baby-deaths-stillbirths-avoid-scrutiny/\n\nFamilies call into question trusts’ transparency after hospital accounts clash with their experience\n\nNHS hospitals have claimed that babies born alive were stillborn\n\nprompting accusations they were trying to avoid scrutiny.\n\nSix children who died before they left hospital were wrongly described as stillborn. \n\nSeveral of the children lived for minutes and one lived for five days.\n\nhttps://www.gov.uk/government/news/new-powers-to-investigate-stillbirths\n\nAt present, coroners can only hold inquests for babies who have shown signs of life after being born.\n\nThe babies identified by The Telegraph should have been recorded as neonatal deaths, but staff claimed they were stillbirths\n\n‘Our baby was alive for five days but was recorded as a stillbirth’", "link": "https://www.youtube.com/watch?v=wj4rE0LrpR0", "date_published": "2022-10-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Inconsistent vaccination data", "description": "ONS vaccination data\n\nhttps://www.ons.gov.uk/peoplepopulationandcommunity/healthandsocialcare/conditionsanddiseases/articles/coronaviruscovid19latestinsights/vaccines\n\nIn the UK by the end of August 2022, of those aged 12 years and over: \n\n93.6% had received a first dose of a COVID-19 vaccine\n\n88.2% had received a second dose \n\n70.2% had received three or more doses\n\nTherefore 6.4% of over 12s are totally unvaccinated\n\n\nWeekly national Influenza and COVID-19 surveillance report\n\nWeek 41 report (up to week 40 data) 13 October 2022 \n\nhttps://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1110820/Weekly_Flu_and_COVID-19_report_w41.pdf\n\n(Page 74)\n\nCumulative data up to week 40 2022 (week ending 9 October 2022) was extracted from the National Immunisation Management Service (NIMS). \n\nThe vaccine uptake rate, aged 18 and over \n\n82.5% for dose 1\n\n79.7% for dose 2\n\n65.8% for dose 3\n\nUK, HSA\n\nTherefore 17.5% of over 18s are totally unvaccinated\n\nUK, ONS\n\nTherefore 6.4% of over 12s are totally unvaccinated\n\nGiven that vaccination rates are lower in 12 to 18, as compared to over 18s,\n\nWe would expect the percentage of unvaccinated in over 12s to be higher.\n\nSo his discrepancy is even greater that it appears\n\nVaccine rates are lower between 12 to 18\n\n(compared to over 18s)\n\nImplications of the Office for National Statistics estimates of Covid-19 vaccine take up in England on the representativeness of its sample population\n\n(October 2022)\n\nhttps://www.researchgate.net/publication/364310694_Implications_of_the_Office_for_National_Statistics_estimates_of_Covid-19_vaccine_take_up_in_England_on_the_representativeness_of_its_sample_population?channel=doi&linkId=63459d419cb4fe44f31d90fd&showFulltext=true\n\nMost recent vaccine mortality surveillance report the UK's Office for National Statistics (ONS),\n\nestimated just 8% of adults in England were unvaccinated by the end of May 2022. \n\nHowever, the ONS estimates are based on a special subset of the England population. \n\nOther independent estimates for the whole of the population in May were higher: \n\nthe UK Health Security Agency (UKHSA) estimated 20%, \n\nwhile a large independent survey by ICM found 26%. \n\nhttps://www.icmunlimited.com/our-work/exploring-attitudes-towards-covid-19-vaccinations-for-stv/\n\nAssuming the ONS estimate is correct for its subset of the England population,\n\nand that the other independent estimates of between 20 and 26% for the whole population are also correct,\n\nthen between 69% and 99.6% of adults missing from the ONS sample are unvaccinated. \n\nThis would mean the ONS sample is unrepresentative of the whole England population and any conclusions about vaccine take-up, \n\nefficacy and safety based on the ONS data may not be relevant to the population as a whole.\n\nIf the ONS is not underestimating the proportion of unvaccinated in its sample,\n\nthen we have shown that the sample is so unrepresentative of the whole population that any inferences made \nabout the vaccination programme using the ONS data are worthless.\n\n\nYT Guidelines\n\nCOVID-19 medical misinformation policy\n\nhttps://support.google.com/youtube/answer/9891785\n\nPrevention misinformation: \n\nContent that promotes prevention methods that contradict local health authorities or WHO.\n\nhttps://support.google.com/youtube/answer/11161123\n\nVaccine safety: content alleging that vaccines cause chronic side effects, outside of rare side effects that are recognized by health authorities\nEfficacy of vaccines: content claiming that vaccines do not reduce transmission or contraction of disease \nIngredients in vaccines: content misrepresenting the substances contained in vaccines", "link": "https://www.youtube.com/watch?v=kzLlSXsqrxc", "date_published": "2022-10-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]