[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Rainbow Six Siege’s Guns PART 3", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down more of the weaponry of Rainbow Six: Siege, including the AK-74M, the P90 and .44 Mag Semi-Auto.\n\n00:00 - Opening\n00:44 - AK-74M\n02:58 - .44 Mag Semi-Auto\n04:38 - CSRX 300\n06:34 - GSH-18\n07:49 - P90\n09:24 - 6P41\n10:57 - M249 SAW\n13:54 - SMG-12\n15:21 - SPAS-12\n17:22 - TCSG12\n18:37 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down more of the guns of Rainbow Six: Siege and compares them to their real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=HiwKFYBGM7A", "date_published": "2022-09-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village Shadows of Rose DLC Borrows From RE2 Remake", "description": "ReTamoor and Jean-Luc got hands on with the upcoming Shadows of Rose DLC for Resident Evil Village, which remixes familiar locations and brings in the 3rd person perspective of RE2 Remake.\n\nResident Evil Village Shadows of Rose is the upcoming story DLC as a part of the Winter Expansions for Resident Evil Village: Gold Edition. Taking place after the main campaign, the DLC will act as an epilogue of sorts as players take control of Rose Winters, who seeks to be rid of her powers.\n\nUnlike the main game, Shadow of Rose is exclusively in the 3rd person perspective, putting it more in line with the remakes of Resident Evil 2 and 3. The section of the game we got to play takes place in Castle Dimitrescu. The castle is now covered in a goopy red substance and filled a new type of enemy called the face eaters. Rose can use her unique powers to remove the red goop as well as attack the face easters,\n\nResident Evil Village Shadows of Rose launches on October 28th for all platforms.\n\n#residentevilvillage #shadowsofrose #gaming", "link": "https://www.youtube.com/watch?v=dxzBs_MT9bA", "date_published": "2022-09-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "15 Minutes of Wo Long: Fallen Dynasty Gameplay", "description": "We played through Wo Long: Fallen Dynasty's demo a couple of times to master its challenging Souls-like combat.\n#gaming #WoLongFallenDynasty #Soulslike \n\nWo Long: Fallen Dynasty combines a variety of different ideas from combat veterans Team Ninja, creating a faster, more intense Soulslike experience. We recently got a chance to play Wo Long's PlayStation 5 demo, which gives a look at the game's combat and a variety of its systems.\n\nThe notable thing about Wo Long is how fast and aggressive it is, while maintaining some of the underlying foundations of Souls-like games. Enemies hit hard and are often unblockable, forcing you to adapt and adjust to their strategies, but you can also overwhelm them with strikes and dodges thanks to the game's \"spirit\" system, which replaces the usual stamina gauge. That creates a tug-of-war-like take on combat, where you have to know when to block and when to attack, overwhelming your enemy so they don't overwhelm you.\n\nWo Long is also tough. The footage here is a sort of \"new game plus\" version of the demo, allowing you to start over but keeping your equipment and character level. If it looks like we're tearing through this demo, it's because we're a bit overleveled in order to give you a cleaner, speedier look at the gameplay (although we still died a few times along the way).\n\n#wolongfallendynasty #gaming", "link": "https://www.youtube.com/watch?v=9hoLOT0wb6g", "date_published": "2022-09-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Modern Warfare 2 - Multiplayer and Warzone 2.0 Details", "description": "Call of Duty Modern Warfare 2 just had a bunch of details released on its multiplayer as well as Warzone 2.0. Here's everything we learned from the Next showcase event.\n\nCall of Duty Modern Warfare 2 comes out real soon and Activision just dropped some big details for the game like a Warzone 2.0 release date and setting and Warzone Mobile as well as what Multiplayer is going to look like. From Dolphin Diving, to some brand new maps. Here’s everything we know about the Multiplayer, and Warzone, in Call of Duty: Modern Warfare 2 so far.\n\nIn this video we break down new gameplay mechanics like vehicle destruction, and how firefights can take place in and even under the water. There are new maps like Sariff Bay as well as the new Warzone 2.0 map complete with distinct areas and a new ring closing system. Game modes like Invasion are new and pair your teams up with AI teammates as well but there are also non AI game modes for those who prefer to shoot down other players instead. And of course we go deep into the Gunsmith customization and break down it's revamped systems.\n\nWe’ve got some serious cod fans in the house at GameSpot and a bunch of us will be playing so sub to this channel and follow us on twitter for our Cod takes. Cookin up right now will be a livestream with the gang, as well as some more expert reacts videos which go live on our channel every Saturday. As for me personally? I just whipped up a deep dive into Battlefield 2042 and what redemption looks like for that game – and is it even possible so be sure to pop in and check it out!\n\nTimestamps: \n0:00 Intro\n0:35 Multiplayer Gameplay\n1:15 Game Modes\n2:35 Maps\n3:36 Warzone 2.0\n5:10 - Redesigned Gunsmith\n6:48 - Release Date, Platforms & Price\n\n\n#cod #callofduty #modernwarfare2", "link": "https://www.youtube.com/watch?v=HMhCi5B0-MI", "date_published": "2022-09-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Modern Warfare 2 PS5 Open Beta Livestream", "description": "The first round of open beta for Modern Warfare 2 is here and the GameSpot crew is hoping in to check it out!\r\n\r\n#gaming #modernwarfare2 #gamespot", "link": "https://www.youtube.com/watch?v=-e-Re_BeLZc", "date_published": "2022-09-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Crisis Core: Final Fantasy VII Reunion Hands-On", "description": "Crisis Core: Final Fantasy Reunion is the upcoming remake of Crisis Core: Final Fantasy, a well regarded game amongst Final Fantasy fans that sadly saw limited players due to it being on the PSP. Crisis Core Reunion is brings the game to modern systems with updated graphics and gameplay.\n#crisiscorereunion #crisiscore #ffvii \n\nGameSpot's very own Phil Hornshaw had a chance to go hands-on with Crisis Core: Final Fantasy Reunion at a Square Enix event, where he was able to check how the updated graphics and gameplay felt.\n\nFinal Fantasy VII Remake set a high bar for reviving a classic game, both retelling the original game's story and altering it in key ways to create something new. Crisis Core is a prequel to the original FFVII, but despite its links to FFVII Remake's revised story, producer Mariko Sato previously told GameSpot that Reunion is hewing closely to the original Crisis Core's story. That's what we saw in the demo as well--the story and cutscenes of Crisis Core Reunion seem extremely similar to what was in the original game. The primary changes and improvements are in Reunion's combat.\n\nCrisis Core keeps all its fighting in real-time--using your special abilities, magic spells, or healing items is done with by pressing different combinations of buttons, and there's no break in the action like in FFVII Remake. With Crisis Core Reunion, however, it's clear that the movement, melee fighting, and camera systems have been tuned up, making the combat feel like a Crisis Core spin on FFVII Remake's foundation.\n\nCrisis Core: Final Fantasy VII Reunion is set to release on December 13, 2022.", "link": "https://www.youtube.com/watch?v=TpwKqHLvWO0", "date_published": "2022-09-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk Edgerunners Rules | GameSpot After Dark Ep 162", "description": "Its been a heck of a week, both good and bad, but at least the weekend is finally here! On this week's After Dark the crew talks Cyberpunk: Edgerunners, Metal: Hellsinger, Street Fighter 6, Metal Gear Solid V, and the announcements we are most excited about from E3 Fall Edition.\n\nTimestamps:\n0:00:00 - Intro\n0:02:54 -  FFXIV\n0:08:04 - Ben's Playing Fighting Games\n0:14:46 - Street Fighter 6 looks hype\n0:22:41 - Save Room (RE4 Inventory Puzzle Game)\n0:26:40 - Splatoon 3\n0:31:51 - Metal Gear Solid V\n0:40:05 - Metal: Hellsinger\n0:49:20 - Cyberpunk: Edgerunners\n0:58:05 - Which new Assassin's Creed are we excited for?\n1:08:15 - Goldeneye Remaster\n1:11:00 - Tears of the Kingdom\n1:18:53 - Hecka Yakuza / Like a Dragon games\n1:30:55 - Outro\n\n#CyberpunkEdgerunners #gaming #gamespotafterdark", "link": "https://www.youtube.com/watch?v=-k55zXdmpDQ", "date_published": "2022-09-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "KOEI TECMO Special Program TGS 2022 Livestream | Atelier Ryza 3, Wo Long: Fallen Dynasty", "description": "Tune in for the Koei Tecmo Toyko Game Show presentation, focusing on Atelier Ryza 3 and Wo Long: Fallen Dynasty.\n\n#TGS #KoeiTecmo #gaming", "link": "https://www.youtube.com/watch?v=S2Wh6lc6mDE", "date_published": "2022-09-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "KONAMI Tokyo Game Show 2022 Special Program Livestream", "description": "Tune in for the latest information on video games coming out from Konami, including several Yu-Gi-Oh! titles, eFootball 2023, and Super Bomberman R2.\n\n#gaming #TGS #Konami", "link": "https://www.youtube.com/watch?v=S_787vDHlmw", "date_published": "2022-09-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Like A Dragon: Ishin Hands-On Preview", "description": "RGG Studio's feudal take on its signature franchise is living up to the promise of being an all-star Yakuza game.\n#gaming #gamename #gamespot \n\nMasayoshi Yokoyama, executive producer of RGG Studios and writer of the Yakuza series, said during the RGG 2022 summit that Like A Dragon: Ishin is meant to be the all-star Yakuza game. It's pitched as a game that will feature characters from the entire franchise, music from across the games, and returning actors, and the 20 minutes of hands-on time I had with the game definitely delivered on that promise. But Like A Dragon: Ishin doesn't just feel like simple Yakuza fan service. From what I've played, Ishin features enough of a new story and presents a fresh environment (to a western audience, at least) that it is poised to welcome new players to the massive franchise without completely alienating them. \n\nThe preview demo--played at Tokyo Game Show, courtesy of Sega--featured two modes: day mode, which was a more explorative and story-centric introduction to the game's central area, Kyo, and night mode, a more action-focused look at the game's many fighting styles.\n\nthe game is expected to be released on PS4, PS5, Xbox One, Xbox Series X|S, and PC in February 2023.", "link": "https://www.youtube.com/watch?v=GCqAHSj19h0", "date_published": "2022-09-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Street Fighter 6 - 20 Minutes of Ken Gameplay", "description": "The latest fighter to join the rooster SF6 is Ken, and we have 20 minutes of gameplay from the Tokyo Game Show demo. Watch Ken fight every character revealed so far including the recently added Juri, Kimberly, and Guile, set to the highest level CPU.\n\nTimestamps:\n00:00 - Ken vs Juri\n03:00 - Ken vs Kimberly\n05:53 - Ken vs Guile\n09:27 - Ken vs Ryu\n11:58 - Ken vs Luke\n15:02 - Ken vs Chun-Li\n17:29 - Ken vs Jamie\n\n#gaming #streetfighter6 #tokyogameshow", "link": "https://www.youtube.com/watch?v=NuPt2JHpp5c", "date_published": "2022-09-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Street Fighter 6 Official Launch Characters Reveal Trailer", "description": "Get a glimpse of art for the 18 characters on the launch roster for Street Fighter 6: Luke, Jamie, Manon, Kimberly, Marisa, Lily, JP, Juri, Dee Jay, Cammy, Ryu, E. Honda, Blanka, Guile, Ken, Chun-Li, Zangief, and Dhalsim.\n\nEmbark on a globetrotting journey to discover The Meaning of Strength. The legendary fighters you know and love are waiting for you to take the plunge and experience the world of Street Fighter like never before!\n\n#streetfighter6 #sf6 #gaming", "link": "https://www.youtube.com/watch?v=zMm60rQ9p30", "date_published": "2022-09-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Street Fighter 6 Special Program TGS 2022 Livestream", "description": "Tune in September 16 at 8PM PT for the Street Fighter 6 Special Program where Capcom will show more on Fighting Ground and World Tour.\r\n\r\n#gaming #TGS #streetfighter6", "link": "https://www.youtube.com/watch?v=V5Fkt1oK-lk", "date_published": "2022-09-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Why Cyberpunk 2077 Is Popular Again | GameSpot News", "description": "n today’s GameSpot News, we explain why Cyberpunk 2077 is popular again and there are new updates on Street Fighter 6 and Tekken 8.\n#GamingNews #Cyberpunk2077 #GameSpot\n\nAccording to SteamDB and spotted by Eurogamer, concurrent players peaked yesterday at 37,000, beating other popular games such as Elden Ring, Destiny 2, and Grand Theft Auto V on the Steam Charts. This is more than double Cyberpunk 2077's August high of 16,000 players and is presumably thanks in part to the Edgerunners update that added a substantial number of new features and improvements.\n\nMoving right along to some fighting games. One day after Capcom's TGS 2022 Special Program showcased new modes, characters, and a closed beta test for Street Fighter 6, a separate presentation has confirmed the launch roster for the game through an intro video. The presentation showed the introduction to the game's single-player story mode World Tour, which showcases the entire roster as a narrator talks over the video. All 11 confirmed characters were shown, as were seven previously unknown fighters.\n\nIn other fighting game news, Tekken 8 director Katsuhiro Harada has revealed even more info about what we can expect from the fighting game sequel during an interview with IGN. Aside from more exciting father versus son showdowns, Tekken 8 is built from the ground up in Unreal Engine 5. None of Tekken 7 has been re-used, and Harada was excited to describe the impressive in-game footage. As for the story, Harada called Tekken 8 a turning point and promised that the story mode hasn't been shrunk from what players saw from Tekken 7. Looking toward the future, Harada expressed optimism about the longevity of fighting games. Harada also said he was interested in how the fighting game scene will shift, commenting on the transition from arcade to console, and now what could possibly happen in the future.\n\nSTAMPS\n00:00 - Intro\n00:07 - Cyberpunk 2077\n01:23 - Street Fighter 6\n02:22 - Tekken 8", "link": "https://www.youtube.com/watch?v=sOSV1yeboq4", "date_published": "2022-09-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Wo Long: Fallen Dynasty Gameplay Presentation | Koei Tecmo TGS 2022", "description": "Check out over 10 minutes of gameplay that was shown off during the Koei Tecmo 2022 showcase. The developers showcase some of the gameplay mechanics, as well as a few boss fights.\n\n#wolongfallendynasty #tgs #gaming \n\nTimestamps\n0:00 Introduction\n0:12 Open World Combat and Exploration\n1:23 Gear and Weapons\n2:09 Combat\n3:46 Leveling up\n4:49 Zhang Liang Boss Fight\n8:37 Lu Bu Boss Fight", "link": "https://www.youtube.com/watch?v=0DZ1hHwzW3I", "date_published": "2022-09-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Wo Long: Fallen Dynasty Hands-On: A Faster, More Aggressive Soulslike", "description": "Wo Long: Fallen Dynasty takes the well trod soulslike formula and adds interesting new mechanics like the spirit meter and morale system.\n#gaming #WoLongFallenDynasty #gamespot #Soulslike \n\nWith Wo Long: Fallen Dynasty, developer Team Ninja feels like it's riffing on a riff. The action game studio has already given its spin to the Soulslike genre with the Nioh games. In Wo Long, Team Ninja once again borrows some of the underpinnings of From Software's lauded series, but takes a faster, more Ninja Gaiden-like approach. It's some of the same ideas but with a different feel, which will challenge action game fans in a lot of different ways.\n\nGameSpot got an early look at Wo Long's playable demo on PlayStation 5, which gives a snapshot of the game's combat systems. A lot of the foundation will be familiar to Soulslike fans--enemies hit hard and are tough to kill, often sporting unblockable or uninterruptible animations. Whenever you stop to rest at a checkpoint, enemies respawn, forcing you to fight them again. Healing is limited to a small set of flasks you carry, and using them takes a very long time, leaving you open to attack. Most fights come down to analyzing or memorizing enemy attack patterns so you can exploit weaknesses and avoid taking an abundance of damage.\n\nBut as mentioned, Wo Long takes a much faster and more aggressive approach to that foundation than most other Soulslike games, making it most comparable to something like Sekiro: Shadows Die Twice. Wo Long focuses on Chinese martial arts, and thus, much of its gameplay is about speedy strikes and redirecting your opponent's force. Its biggest adjustment from similar games, though, is that it drops the usual stamina gauge that dictates how many moves you can make before you stall out.\n\nInstead, Wo Long sports a \"spirit\" gauge, which dictates how much you can block or dodge, as well as special abilities, like martial arts or magical \"wizardry\" attacks. The spirit gauge is less of a limitation than it is a gamble, though. The gauge starts at zero in the center, with a negative and positive side. When you take damage, block attacks, dodge, or use your special abilities, you \"lose\" spirit, so the gauge pushes into the negative. If your gauge fully fills up on the negative side, a hit from an enemy will stagger you, leaving you vulnerable for a long time.", "link": "https://www.youtube.com/watch?v=cPA8j-g3BqU", "date_published": "2022-09-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]