[{"source": "https://www.dailywire.com/feeds/rss.xml", "title": "9 Migrants Drown In Rio Grande Seeking To Enter U.S.", "description": "Nine migrants died while attempting to cross the Rio Grande River and enter the United States near Eagle Pass Friday, according to U.S. Customs and Border Protection (CBP) officials. CBP agents rescued 37 migrants from the increasingly strong currents of the river and detained 16 more while Mexican authorities detained another 39 migrants. Heavy rain ...", "link": "https://www.dailywire.com/news/9-migrants-drown-in-rio-grande-seeking-to-enter-u-s", "date_published": "2022-09-03 22:38:43+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "China’s Forced Organ Harvesting Demands U.S. Response", "description": "American doctors go to great lengths to maintain the highest ethical standards as they work to save thousands of desperately ill patients waiting for an organ match, as underscored in recent reporting of innovative transplant experiments using genetically modified pig hearts. China’s transplant sector, unconstrained by rigorous ethical rules, found a more expedient solution. China ...", "link": "https://www.dailywire.com/news/chinas-forced-organ-harvesting-demands-u-s-response", "date_published": "2022-09-03 21:04:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Trump Hits Back At Biden In First Rally Since FBI Raid: ‘Danger To Our Democracy Comes From The Radical Left, Not The Right’", "description": "Former President Donald Trump shot back at President Joe Biden and the Democratic Party at a rally in Wilkes-Barre, Pennsylvania, Saturday night held with Republican candidates Mehmet Oz and Doug Mastriano. The “Save America” event marked Trump’s first rally appearance since the FBI raided his home on August 8. Trump focused a large portion of ...", "link": "https://www.dailywire.com/news/trump-hits-back-at-biden-in-first-rally-since-fbi-raid-danger-to-our-democracy-comes-from-the-radical-left-not-the-right", "date_published": "2022-09-03 20:53:14+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "DeSantis Reveals Keys For Republican Party To Win Back House And Senate In 2022", "description": "Florida Republican Governor Ron DeSantis revealed the keys late this week for the Republican Party to win back control of the U.S. House and the U.S. Senate in this fall&#8217;s midterm elections. Appearing on Fox News Friday evening, DeSantis told &#8220;The Ingraham Angle&#8221; that the key to winning was telling voters that Biden would be ...", "link": "https://www.dailywire.com/news/desantis-reveals-keys-for-republican-party-to-win-back-house-and-senate-in-2022", "date_published": "2022-09-03 18:55:24+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Dan Rather Panics After CNN Continues To Fire Far-Left Employees, Gets Slammed Online", "description": "Disgraced left-wing journalist Dan Rather was mocked online late this week after panicking over CNN cutting some of its most extreme left-wing voices from the network. &#8220;What is going on at CNN? It’s a serious question,&#8221; Rather tweeted. &#8220;There is a lot of speculation on directives and motives. What’s really going on? And is it ...", "link": "https://www.dailywire.com/news/dan-rather-panics-after-cnn-continues-to-fire-far-left-employees-gets-slammed-online", "date_published": "2022-09-03 18:43:02+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Man’s Eerie Message Before Allegedly Stealing Plane, Threatening Crash Into Walmart: Report", "description": "The pilot who threatened to crash a plane into a Mississippi Walmart allegedly posted an eerie message on social media before allegedly stealing the plane. The pilot, identified by officials as Cory Wayne Patterson, had threatened to crash a Beechcraft King Air C90 twin-engine aircraft into a Walmart in Tupelo, a town of about 38,000 ...", "link": "https://www.dailywire.com/news/mans-eerie-message-before-allegedly-stealing-plane-threatening-crash-into-walmart-report", "date_published": "2022-09-03 17:53:45+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "NASA Scrubs 2nd Attempt At Moon Rocket Launch After Another Fuel Leak", "description": "NASA’s unmanned flight to the Moon was stopped for the second time before launch Saturday after a fuel leak was discovered on the 322-foot Artemis I rocket. Saturday’s leak is the second found on the rocket this week right before a scheduled launch. Artemis I, the most powerful rocket NASA has ever built, was initially ...", "link": "https://www.dailywire.com/news/nasa-scrubs-2nd-attempt-at-moon-rocket-launch-after-another-fuel-leak", "date_published": "2022-09-03 17:32:54+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Black Lives Matter Leader Stole $10 Million From Organization, Lawsuit Says", "description": "A top leader in the Black Lives Matter Global Network Foundation was accused in a lawsuit filed this week of stealing millions of dollars from the organization through a &#8220;scheme of fraud and misrepresentation.&#8221; The lawsuit, filed in Los Angeles County Superior Court on Thursday by Black Lives Matter Grassroots, accused Shalomyah Bowers, one of ...", "link": "https://www.dailywire.com/news/black-lives-matter-leader-stole-10-million-from-organization-lawsuit-says", "date_published": "2022-09-03 17:10:09+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Pilot In Custody After Threatening To Smash Plane Into Mississippi Walmart, Police Say", "description": "A pilot threatening to crash a plane into a Mississippi Walmart has been detained by police after circling around the area for hours in a stolen plane, according to state officials. The pilot, identified by officials as Cory Wayne Patterson, had threatened to crash a plane into a Walmart in Tupelo, a town of about ...", "link": "https://www.dailywire.com/news/pilot-in-custody-after-threatening-to-smash-plane-into-mississippi-walmart-police-say", "date_published": "2022-09-03 15:38:46+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Bumps And Bruises’: Megyn Kelly’s Transformation From Fox News Anchor To Running Her Own Hit Podcast Show", "description": "Megyn Kelly said her transformation from Fox News anchor to the host of &#8220;The Megyn Kelly Show&#8221; podcast, hasn&#8217;t been without its &#8220;bumps and bruises.&#8221; Kelly&#8217;s broadcast story started in 2003 after she walked away from a legal career to become a reporter in Washington, D.C., when she was hired by the ABC affiliate WJLA-TV. ...", "link": "https://www.dailywire.com/news/bumps-and-bruises-megyn-kellys-transformation-from-fox-news-anchor-to-running-her-own-hit-podcast-show", "date_published": "2022-09-03 15:14:06+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Trump Responds To Former Attorney General Bill Barr’s Shocking Interview", "description": "Former President Donald Trump slammed former Attorney General William Barr after Barr criticized him during a Fox News interview late this week, claiming that Barr had “no guts.” Barr’s Friday afternoon remarks on Fox News came after the FBI raided the former president’s Florida home at Mar-a-Lago last month and recovered numerous classified documents and ...", "link": "https://www.dailywire.com/news/trump-responds-to-former-attorney-general-bill-barrs-shocking-interview", "date_published": "2022-09-03 15:08:17+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Trump’s Former Attorney General Bill Barr Makes Surprising Remarks About The Former President", "description": "Former U.S. Attorney General William Barr — who served in the role twice, once under former President George H.W. Bush and later under former President Donald Trump — slammed Trump in an interview Friday afternoon over his alleged handling of classified government documents. Barr&#8217;s remarks came after the FBI raided the former president&#8217;s Florida home ...", "link": "https://www.dailywire.com/news/trumps-former-attorney-general-bill-barr-makes-surprising-remarks-about-the-former-president", "date_published": "2022-09-03 14:57:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Kanye West Appears To Reveal What ‘Addiction’ Ruined His Marriage With Kim Kardashian", "description": "Rapper Kanye West appeared to admit in a now-deleted Instagram post this week that an addiction to pornography ruined his family with Kim Kardashian. West&#8217;s remarks on social media were about where his four kids with ex-wife Kim Kardashian — North West, Saint West, Chicago West (born via surrogate), and Psalm West (born via surrogate) ...", "link": "https://www.dailywire.com/news/kanye-west-appears-to-reveal-what-addiction-ruined-his-marriage-with-kim-kardashian", "date_published": "2022-09-03 14:29:50+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "DeSantis Responds To Biden’s Speech In Philadelphia", "description": "Governor Ron DeSantis (R-FL) slammed President Joe Biden Friday night for delivering “one of the most disgusting speeches an American president has ever given” this week in Philadelphia where the president made “a partisan attack on half the country.” In his speech on Thursday night, Biden sought to blame America&#8217;s problems on former President Donald ...", "link": "https://www.dailywire.com/news/desantis-responds-to-bidens-speech-in-philadelphia", "date_published": "2022-09-03 13:24:54+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "IRS Admits To Exposing The Confidential Data Of Over 100,000 Americans", "description": "The IRS said on Friday it had removed from its website confidential information on over 100,000 Americans it had exposed through a mistaken disclosure.  In a letter from the Treasury Department to House Committee on Homeland Security Chair Bennie Thompson, the agency said that the data of about 120,000 Americans had been exposed through an ...", "link": "https://www.dailywire.com/news/irs-admits-to-exposing-the-confidential-data-of-over-100000-americans", "date_published": "2022-09-03 12:58:35+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Court Tosses Man’s Claim Nirvana’s Use Of Baby Pic On Iconic Album Cover Was Child Porn", "description": "A man who claimed rock band Nirvana’s use of his baby picture on an iconic 1990s album cover was child porn saw his lawsuit tossed yet again by a federal judge Friday. Spencer Elden, whose picture as a naked, four-month-old baby graced the cover of the classic grunge album “Nevermind,” waited too long to sue ...", "link": "https://www.dailywire.com/news/court-tosses-mans-claim-nirvanas-use-of-baby-pic-on-iconic-album-cover-was-child-porn", "date_published": "2022-09-03 12:13:50+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Painful To Watch’: Viewers Hate ‘Lord Of The Rings: Rings Of Power,’ Which Critics Insist Is Another Example Of Racism", "description": "There’s been a lot of hype leading up to Amazon&#8217;s “Lord of the Rings” adaptation, “The Rings Of Power,” but now some fans are saying it’s a huge flop. The series premiered the first two episodes Thursday and currently has an 84% critic rating and 36% audience rating on Rotten Tomatoes.  This certainly isn’t the first ...", "link": "https://www.dailywire.com/news/painful-to-watch-viewers-hate-lord-of-the-rings-rings-of-power-which-critics-insist-is-another-example-of-racism", "date_published": "2022-09-03 11:49:17+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘One Of The Worst Humans’: Two Celebs Bash ‘Friends’ Star Lisa Kudrow", "description": "“Friends” star Lisa Kudrow was trashed Friday by two celebrities, reality TV star Spencer Pratt and businesswoman and fellow reality star Bethenny Frankel. In a TikTok video, Spencer responded to a fan asking about the “rudest celebrity” he&#8217;s ever met. “Oh, that’s easy,” Pratt said. “Phoebe from ‘Friends.&#8217; Hands down, one of the worst humans I’ve ever come ...", "link": "https://www.dailywire.com/news/one-of-the-worst-humans-two-celebs-bash-friends-star-lisa-kudrow", "date_published": "2022-09-03 11:07:36+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Billionaire Family Offers Reward For Kidnapped Heiress, Kindergarten Teacher", "description": "A $50,000 reward is being offered for information leading to the rescue of a kindergarten teacher and heiress to a billion-dollar fortune who was abducted early Friday in Memphis while out for a jog. Eliza Fletcher, 34 and a mom of two, was snatched around 4:30 a.m. as she ran near the University of Memphis. ...", "link": "https://www.dailywire.com/news/billionaire-family-offers-reward-for-kidnapped-heiress-kindergarten-teacher", "date_published": "2022-09-03 11:03:27+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Tiffany Haddish, Aries Spears Accused Of Child Sex Abuse In Lawsuit. Both Deny Claims", "description": "Comedians Tiffany Haddish and Aries Spears have been accused of child sex abuse in a lawsuit filed Tuesday. The suit claims Haddish and Spears abused two siblings, a female when she was 14 years old and the girl&#8217;s brother when he was seven. On both occasions, the children, dubbed Jane Doe and John Doe, were allegedly ...", "link": "https://www.dailywire.com/news/tiffany-haddish-aries-spears-accused-of-child-sex-abuse-in-lawsuit-both-deny-claims", "date_published": "2022-09-03 11:02:02+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘It’s A Cult’: Joe Rogan Nukes Podcast Trade Group Over Bizarre Treatment Of Ben Shapiro", "description": "Joe Rogan blasted the podcasting trade association that bizarrely tried to paint The Daily Wire’s Ben Shapiro as a dangerous pariah, calling out the crackpots behind last month’s shocking attack as part of a woke cult. Podcast Movement created the stir after Shapiro, host of the biggest political podcast in the country, stopped by a ...", "link": "https://www.dailywire.com/news/its-a-cult-joe-rogan-nukes-podcast-trade-group-over-bizarre-treatment-of-ben-shapiro", "date_published": "2022-09-03 09:47:22+00:00", "persistent": false, "user": null, "language": null}]