[{"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Włochy. Kilkanaście kilogramów narkotyków ukryte w lotniskowym wózku inwalidzkim", "description": "Na włoskim lotnisku Mediolan-Malpensa celnicy zwrócili uwagę na pasażera na elektrycznym wózku inwalidzkim. Psy tropiące wskazały, że to właśnie w tym pojeździe mogą znajdować się narkotyki. Po rozcięciu tapicerki odkryto paczki z kokainą ważące ponad 13 kilogramów i wartości przekraczającej 1 mln euro.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-03/wlochy-kilkanascie-kilogramow-narkotykow-ukryte-w-lotniskowym-wozku-inwalidzkim/", "date_published": "2022-09-03 20:07:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Lwów: Flaga ukraińskich nacjonalistów podczas wizyty Niedzielskiego. Ministerstwo Zdrowia komentuje", "description": "Flaga Organizacji Ukraińskich Nacjonalistów wisiała w sali lwowskiego szpitala, kiedy minister Adam Niedzielski zjawił się tam, aby przekazać dary. OUN odpowiadała za akty terroru wobec Polaków w okresie międzywojnia, a z jej szeregów wyłonili się banderowcy, którzy przeprowadzili rzeź wołyńską. Była to flaga jednego z rannych. Zwróciliśmy uwagę stronie ukraińskiej - zapewnił resort zdrowia.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-03/lwow-flaga-ukrainskich-nacjonalistow-podczas-wizyty-niedzielskiego-ministerstwo-zdrowia-komentuje/", "date_published": "2022-09-03 19:08:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Hawierzów: Karuzela zerwała się podczas festynu. Kilkunastu rannych, w tym dzieci", "description": "Ramiona karuzeli nagle oderwały się od konstrukcji i wraz z uczestnikami festynu w czeskim Hawierzowie spadły na punkt sprzedaży biletów. Czternaście osób jest rannych, w tym jedenaścioro dzieci. Najciężej poszkodowanych przetransportowano do szpitala w Ostrawie. Policja wszczęła śledztwo, a lokalne media alarmują, że karuzela funkcjonowała nieprawidłowo od początku imprezy.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-03/hawierzow-karuzela-zerwala-sie-podczas-festynu-kilkunastu-rannych-w-tym-dzieci/", "date_published": "2022-09-03 17:50:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Czeczenia. Ramzan Kadyrow przestanie kierować republiką? Opublikował zagadkowe nagranie", "description": "- Zbyt długo siedzę na swoim stanowisku, zasłużyłem na wakacje - powiedział czeczeński lider Ramzan Kadyrow na nagraniu zamieszczonym w sieci. Dał tym samym do zrozumienia, że wkrótce może zrezygnować z kierowania zależną od Rosji republiką. Niezależne media zastanawiają się jednak, czy Kadyrow nie blefuje i chce jedynie sprawdzić, jak na jego słowa zareaguje Moskwa.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-03/czeczenia-ramzan-kadyrow-przestanie-kierowac-republika-opublikowal-zagadkowe-nagranie/", "date_published": "2022-09-03 15:33:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "NASA. Start misji Artemis I ponownie przełożony. Negatywna rekomendacja inżynierów", "description": "Zaplanowany na sobotni wieczór pierwszy lot w ramach misji Artemis I organizowanej przez NASA nie odbędzie się. Nie udało się naprawić usterki związanej z uzupełnianiem paliwa w rakiecie SLS, co uniemożliwiło wydanie zgody na start.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-03/nasa-start-misji-artemis-ponownie-przelozony-negatywna-rekomendacja-inzynierow/", "date_published": "2022-09-03 15:23:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Tupelo: Pilot grozi, że uderzy samolotem w sklep. Mieszkańcy ewakuowani", "description": "Pilot małego samolotu grozi służbom, że celowo uderzy maszyną w sklep Walmart w Tupelo w amerykańskim stanie Mississipi. Ściśle monitorujemy sytuację. Wszyscy obywatele powinni być czujni i na bieżąco śledzić informacje - przekazał gubernator Tate Reeves.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-03/tupelo-pilot-grozi-ze-uderzy-samolotem-w-sklep-mieszkancy-ewakuowani/", "date_published": "2022-09-03 14:04:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Albania. Rząd rozpoczął rozbiórkę nadmorskiego hotelu. Na miejscu kilkadziesiąt turystów z Polski", "description": "Niespodziewany widok zastali turyści pięciogwiazdkowego hotelu w albańskiej miejscowości Golem położonej nad Morzem Adriatyckim. Koparki zaczęły tam demolować basen i infrastrukturę obiektu. Rozbiórka miała zostać zlecona przez rząd kraju. W hotelu przebywa kilkadziesiąt turystów z Polski.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-03/albania-rzad-rozpoczal-rozbiorke-nadmorskiego-hotelu-na-miejscu-kilkadziesiat-turystow-z-polski/", "date_published": "2022-09-03 11:40:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "USA. Nauczycielka porwana w trakcie joggingu. Została wciągnięta do samochodu. Trwają poszukiwania", "description": "34-letnia Eliza Fletcher została wciągnięta do samochodu i porwana podczas porannej przebieżki. Do zdarzenia doszło w centrum Memphis w środkowej części USA. Nauczycielka ostatni raz widziana była w piątek około 4:30. Trwają jej poszukiwania - poinformowała lokalna policja.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-03/usa-nauczycielka-porwana-w-trakcie-joggingu-zostala-wciagnieta-do-samochodu-trwaja-poszukiwania/", "date_published": "2022-09-03 08:52:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "USA. 17-letni uczeń zastrzelony na dziedzińcu przed budynkiem szkoły w Baltimore", "description": "17-letni uczeń liceum Mergenthaler w Baltimore w stanie Maryland zmarł po tym, jak został postrzelony na dziedzińcu szkoły - doniosła lokalna policja.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-03/usa-17-letni-uczen-zastrzelony-przed-budynkiem-szkoly-w-baltimore/", "date_published": "2022-09-03 08:01:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Delegacja rosyjska wystąpiła o wizy na spotkanie ONZ. Wciąż nie otrzymała odpowiedzi", "description": "Rosja skierowała prośbę do Stanów Zjednoczonych o wydanie 56 wiz. USA jeszcze nie wystosowało odpowiedzi. Ambasador Kremla przy Organizacji Narodów Zjednoczonych brak wydania dokumentów nazywa niepokojącym. Stawia to pod znakiem zapytania obecność Siergieja Ławrowa wraz z delegacją na wrześniowym szczycie ONZ w Nowym Jorku.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-03/delegacja-rosyjska-wystapila-o-wizy-na-spotkanie-onz-nie-otrzymala-odpowiedzi/", "date_published": "2022-09-03 05:32:00+00:00", "persistent": false, "user": null, "language": null}]