[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Ezra Collective: Tiny Desk Concert", "description": "Suraya Mohamed | November 10, 2022\nThe day before The Ezra Collective’s Tiny Desk concert, the band members practiced for hours at a nearby community music space and the next morning, they walked in the door giddy and ready to go. The warm-up was good, but once we started to record, a crazy intensity and energy spilled out into the room. They were fierce and fun and all of their solos were on fire. \n\nThe band makes amazing jazz music and mixes it with a fusion of other genres like Afrobeat, hip-hop and grime. The London-based band was supposed to play this Tiny Desk concert in 2020, but then, as bandleader and phenom drummer Femi Koleoso put it, “the world collapsed.” Here it is now, rockin’ hard with the highest level of musicianship and technique.\n\nBefore coming to NPR, Koleoso had just finished a world tour with the group Gorillaz. He met up with his bandmates in Washington, D.C., to play this concert and kick off promotion for the band’s newly released sophomore album, Where I’m Meant To Be. He explained on Instagram that he loves the album title because it's vague and specific at the same time, just like his band, a multifaceted complement of contrasting attributes. The first two songs in this set are from that new album while the last, “Chapter 7,” is from the group’s 2016 EP. Throughout the set, watch how keyboard player Joe Armon-Jones barely stays on his seat and hear how the audience couldn’t keep quiet. After the concert, the spirit of the music lingered for a long time and the day ended with pictures, hugs and plenty of smiles. \n\nSET LIST\n“Victory Dance”\n“Welcome To My World”\n“Chapter 7” \n\nMUSICIANS\nFemi Koleoso: drums\nTJ Koleoso: bass\nJoe Armon-Jones: keys\nJames Mollison: saxophone\nIfe Ogunjobi: trumpet\n\nTINY DESK TEAM\nProducer: Suraya Mohamed\nDirector/Editor: Joshua Bryant\nAudio Engineer: Josh Rogosin\nCreative Director: Bob Boilen\nSeries Producer: Bobby Carter\nVideographers: Joshua Bryant, Kara Frame, Maia Stern, Sofia Seidel \nAudio Assistant: Andie Huether\nProduction Assistant: Jill Britton\nTiny Desk Team: Marissa Lorusso, Hazel Cills, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #ezracollective", "link": "https://www.youtube.com/watch?v=eAzClkn3zYw", "date_published": "2022-11-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]