[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "DMZ Gameplay Revealed, Gamers React | GameSpot News", "description": "Warzone 2.0 and DMZ gameplay are revealed during special livestreams from popular Call of Duty content creators. \n#GamingNews #Warzone2 #DMZ\n\nCall of Duty fans were pleasantly surprised yesterday when Infinity Ward held an invite only Warzone 2.0 event. \n\nCall of Duty creators like CouRage, ModernWarzone, NoisyButters and more played the game for their audiences and showed off a lot of what was detailed in the most recent Call of Duty blog post. This includes loadouts, various points of interest, and 3rd person mode. \n\nThere was also a lot of looting and inventory management shown off. Content creator Repullze took to Twitter to clarify some confusion about the new system and said, “They didn’t take anything away, they technically just added. You have an ‘on person’ inventory that’s your standard WZ1 system and then there’s your backpack that adds slots. Everything in your on person inventory auto picks up.”\n\nRepullze continued by saying when you loot someone, the backpack auto fills things you need with the examples being armor plates or ammo stacking on top of what you already have in those slots.  \n \nSeems simple enough, but the system’s reveal has drawn plenty of criticism and so has DMZ as a whole. DMZ is an open-world, narrative-focused extraction mode where players fight alone or together with the aim of getting to the chopper to escape. On their way, players will take part in \"faction-based\" missions and side objectives, as they fight against other human and AI players before exfiltration at the end of the round.\n\nIce Man Isaac reacted to the mode and said “I think DMZ should be delayed. Let Warzone 2.0 go crazy on Nov 16th and keep working on DMZ until it's ready.” TimTheTatMan had a similar reaction and said, “dmz looked kinda meh. warzone 2 looked solid and I’m excited for next week. 3rd person warzone 2 tho looked litttttt”.", "link": "https://www.youtube.com/watch?v=Tex648vF3vw", "date_published": "2022-11-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God Of War Ragnarok’s Immersive Mode Is The Way To Play", "description": "God of War Ragnarok is stunning, and if you want to truly appreciate all the detailed environments, enemies, and characters, this just might be the best way to experience Kratos’ latest adventure.\n\n#godofwarragnarok #gamespot #gaming", "link": "https://www.youtube.com/watch?v=3NJ7dbua12Q", "date_published": "2022-11-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Warhammer 40,000: Darktide - World Intro Official 4K Trailer", "description": "Following the fate of the guardsmen from the first teaser two years ago, check out this new world intro trailer for Warhammer 40,000: Darktide! \n\n#DARKTIDE #Warhammer #Warhammer40k", "link": "https://www.youtube.com/watch?v=x-DtwQUCWx4", "date_published": "2022-11-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Atomic Heart Official Boss Fight Gameplay", "description": "Check out 10 minutes of an intense boss fight you'll encounter in Atomic Heart. \n\nAtomic Heart releases on February 21, 2023 on PlayStation 4, PlayStation 5, Xbox One, Xbox Series X and S, and PC.", "link": "https://www.youtube.com/watch?v=9pGIEKqQmXs", "date_published": "2022-11-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PS Plus November Game Catalog Revealed | GameSpot News", "description": "Skyrim, Kingdom Hearts and more join PlayStation’s Game Catalog. Call of Duty Modern Warfare 2’s first season gets new details. \n#GamingNews #PS5 #ModernWarfare2\n\nThis month the PlayStation Plus Game Catalog is gaining some big additions. Members at the Extra and Premium tiers can look forward to playing The Elder Scrolls V: Skyrim Special Edition, Tom Clancy’s Rainbow Six Siege, Ghost Recon Breakpoint and The Division 2.\n\nBut that's not all because also soaring its way into the catalog is Sora and gang with Kingdom Hearts HD 1.5 + 2.5 Remix, 2.8 Final Chapter Prologue and KH 3 and Melody of Memory. \n\nAnd you might be as well because early this month, PlayStation added 3 free games to its essential PlayStation Plus tier. Those include:  \nNioh 2 is a yokai-slaying action game from Team Ninja that combines the pinpoint swordplay of Ninja Gaiden with the mechanics of Dark Souls. The Lego Harry Potter Collection, a game that combines Years 1-4 and Years 5-7 into one game. And the physics-based puzzle game Heavenly Bodies. \n\nA week from today on November 16, Modern Warfare II will get its first major update with the launch of Season 1 and Warzone 2.0 will be unleashed on the masses. In a blog post, Activision ran through the specifics of what's new in Season 1, and it's a lot of information. \n\nModern Warfare II is adding fan-favorite maps in Season 1, and those include Shoot House and Shipment. Both maps are \"reimagined\" for Modern Warfare II, Activision said. These are smaller maps with a lot of action, especially Shipment, which is one of Call of Duty's smallest maps.", "link": "https://www.youtube.com/watch?v=_GdfXyr-gtc", "date_published": "2022-11-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Why Now Is the Time to Jump into World of Warcraft and Play Dragonflight", "description": "(Presented by Blizzard Entertainment) World of Warcraft: Dragonflight is an exciting new chapter in the WoW saga that introduces a whole bunch of massive, and awesome, changes to the way the game plays and feels.  And with its focus on dragons and their story, Dragonflight is a return to WoW's high fantasy roots and also the game's best entry point in years--it's perfect for new and old players alike. \n\n#WoW #dragonflight #gaming", "link": "https://www.youtube.com/watch?v=0euo5i5R-Ts", "date_published": "2022-11-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]