[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCG_nvdTLdijiAAuPKxtvBjA", "title": "Terminator Salvation — The Reboot that Bankrupted a Franchise | Anatomy Of A Failure", "description": "Start speaking a new language in 3 weeks with Babbel 🎉. Get up to 60% OFF your subscription ➡️ here: https://go.babbel.com/t?bsc=1200m60-youtube-filmento-nov-2022&amp;btp=default&amp;utm_term=generic_v1&amp;utm_medium=paidsocial&amp;utm_source=YouTube&amp;utm_content=Influencer..filmento..USA..YouTube\n\nTerminator Salvation tried to revive the Terminator franchise in 2009 by a launching new trilogy of movies, starring Christian Bale as John Connor and Avatar's Sam Worthington as Marcus Wright, a human Terminator hybrid. The plan didn't work out though, because the movie flopped at the box office and became a box office disaster and the company behind it went bankrupt. And then the rights went to the next people who brought us hits like Terminator Dark Fate and Terminator Genisys. So in today's Anatomy of a Failure, let's see why Terminator Salvation flopped so badly and how it being a reboot was at fault.\n\n\nSupport:     https://patreon.com/filmento\nFollow:        https://twitter.com/filmento\n\nFilmento en Español: \nhttps://youtu.be/ViDZUofaZd8\n\n#terminator    #terminatorsalvation    #anatomyofafailure\n\nMusic:\nHurt no copyright - https://youtu.be/ElffxcP0yQ0\n\n-\nTerminator Salvation (2009)\nThe fourth installment of the Terminator series follows an adult John Connor (played by Christian Bale) as he attempts to organize a human resistance force which could prove to be mankind's last true hope in the war against the machines. Opening in the year 2018, Terminator Salvation finds John Connor's certainty about the future shaken by the sudden appearance of a mysterious stranger named Marcus Wright (Sam Worthington), whose last memory is of sitting on death row and awaiting execution. Unable to determine whether Marcus was sent from the future or rescued from the past, Connor begins to wonder whether there is still any hope left for the human race as the robots grow more powerful and aggressive than ever before. It appears that Skynet is preparing a devastating final attack designed to eliminate the human resistance once and for all, leaving Connor and Marcus with no choice but to strike back at the cybernetic heart of Skynet's operations. Once there, the two battle-scarred soldiers discover a devastating secret regarding the potential annihilation of all humankind. Anton Yelchin fills Michael Biehn's shoes as a young Kyle Reese in the first installment of a planned Terminator trilogy from director McG (Charlie's Angels).", "link": "https://www.youtube.com/watch?v=AkATB5HLj1s", "date_published": "2022-11-09 20:08:16+00:00", "persistent": false, "user": null, "language": "en-US"}]