[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New PlayStation Plus Games Revealed And Classic Games Confirmed So Far | GameSpot News", "description": "Sony reveals a list of games for new PlayStation Plus, Ubisoft+ is confirmed for PlayStation Plus, and MultiVersus reveals news characters and an open beta. \n#GamingNews #PS5 #PlayStationPlus\n\nToday Sony confirmed a list of games that will be available as part of its overhauled PS Plus subscription service, which includes a selection of PS4 and PS5 titles for the PS Plus Extra and Premium tiers. Classic games from the original PlayStation and PSP will also be made available through a smaller library, which also includes a mix of first and third-party games. Ape Escape, Syphon Filter, and Wild Arms 3 are just some of the games joining the list, alongside Tekken 2 and several more. \n\nUbisoft+ Classics is being bundled into the PS Plus Extra and Premium tiers. Ubisoft+ Classics will launch with 27 curated games on June 13 in the US. The standard version of Ubisoft+ will be added to PlayStation at a later date.\n\nA new trailer for MultiVersus shows off new characters like Iron Giant and Taz as well as confirming an open beta coming in July 2022.\n\nSTAMPS\n00:00 - Intro\n00:05 - PlayStation Plus\n01:51 - Ubisoft Plus\n02:38 - MultiVersus", "link": "https://www.youtube.com/watch?v=1jfZJEqj-Vs", "date_published": "2022-05-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Toughest Game Achievements That Aren't Worth The Stress", "description": "Whether you're hunting for achievements on an Xbox console or pursuing that elusive platinum trophy on a PlayStation, there's something endlessly satisfying about a digital high-five when you nail a feat within a game. Here are the 20 toughest ones to get.\n\n#Gaming #GameSpot #AchievementHunting #TrophyHunting\n\n00:00 Intro\n00:27 Call of Duty 4: Modern Warfare\n00:57 Dead Rising\n01:29 Dead Space 2\n01:51 The Evil Within\n02:12 Gears 5\n02:45 GTA 5\n03:14 Half-Life 2\n03:58 Halo: The Master Chief Collection\n04:24 Limbo\n04:51 Max Payne 3\n05:12 Mega Man 10\n05:40 MGS4\n06:09 Mortal Kombat (2011)\n06:33 Outlast 2\n06:53 Ori and the Will of the Wisps\n07:18 Overwatch\n07:47 Rock Band 2\n08:10 Sniper Elite 4\n08:39 The Stanley Parable\n08:56 Wolfenstein 2: The New Colossus", "link": "https://www.youtube.com/watch?v=2yLafmktRo4", "date_published": "2022-05-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "BOTW's Most Anime Combat Of 2022 Explained", "description": "User Breneko obliterates a Guardian in Breath of the Wild, but how did he pull it off? We go behind the scenes and explain how each trick was done step by step. \n\nAt this point you’re probably wondering, “How did they pull this off? And what the heck actually happened?”. You’d be surprised at just how much preparation, creativity, trial and error, and thought went into this simple 20 second Breath of the Wild clip that you would’ve never known without actually understanding what’s happening behind the scenes, so today I’m going to break down exactly what happened step by step, because this brilliance requires a lot more explaining than you might think, and maybe you’ll appreciate it all a lot more when you see all the pieces. \n\nhttps://twitter.com/bre_Neko/status/1522231456814166016\n\nUser Breneko shared this clip on twitter on May 5th, 2022, and dropped many jaws. There’s a total of 7 major glitches used here, such as Trickshotting, Absolute Thunderclap Rushes, Slow Daruk Marking, Guardian Disabling, and Jelly Bouncing are just a few of the tricks used behind the scenes in this mind blowing clip. Even 5 years later, players in Breath of the Wild continue to create amazing ideas.\n\n0:00 Intro\n0:57 Jelly Bouncing Explanation\n1:29 TCR, Mark and Chase Explanation\n2:40 Slow Daruk Marking Explanation\n3:40 Guardian Range Explanation\n4:20 Guardian Disable Explanation\n6:12 Part 1 Recap\n6:28 Trickshot Setup Explanation\n9:56 Part 2 Recap\n10:44 Outro", "link": "https://www.youtube.com/watch?v=xdANqSNm0vU", "date_published": "2022-05-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sword Master Reacts to MORE Elden Ring Weapons", "description": "David Rawlings, a Sword Master and founder of the London Longsword Academy, breaks down some more of the weapons from Elden Ring, everything from spears, morning stars, twinblades and giant anchors.\n\nIf you want to see David's reaction to the more eclectic and fantasy weapons of Elden Ring be sure to like, subscribe and let us know in the comments! \n\nFirearms Expert Reacts Playlist: https://www.youtube.com/playlist?list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you are interested in training with David and team and learn how to swordfight, check out www.londonlongsword.com or send an email to enquiry@londonlongsword.com\n \nIf you would like to see more videos of David Rawlings and the London Longsword Academy (LLA) check out their YouTube channel: https://www.youtube.com/user/LondonLongsword\n \nIf you like swords and martial arts content, follow the LLA on Instagram  Master_at_Arms and Swordfightress or Facebook London Longsword Academy.\n\n#EldenRing #LongSwordExpert #Gaming\n\nWeapons Featured: \n\nIntro: 00:00\nMorning Star: 00:35\nHalberd : 2:43\nHandaxe: 4:49\nSpear and Shield: 6:14\nGiant Anchor: 8:03\nTwinblade: 8:36\nDual Shields: 10:38", "link": "https://www.youtube.com/watch?v=5vmd9g2r3y4", "date_published": "2022-05-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]