[{"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Wielka Brytania: Znaleźli w swoim domu monety z XVII wieku. Eksperci wycenili je na ponad mln zł", "description": "Para znalazła 264 złote monety, które były ukryte pod podłogą ich domu w angielskiej miejscowości Ellerby. Niektóre z nich pochodzą nawet z początków XVII wieku. Eksperci oszacowali wartość znaleziska na około 250 tys. funtów (ponad milion złotych). Zostały obecnie wystawione na aukcję - przekazał Daily Mail.", "link": "https://www.polsatnews.pl/wiadomosc/2022-08-31/w-brytania-znalezli-w-swoim-domu-monety-z-xvii-wieku-eksperci-wycenili-je-na-ponad-mln-zl/", "date_published": "2022-08-31 20:11:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Leonardo DiCaprio rozstał się z Camilą Morrone. \"Wykres DiCaprio\" mówi prawdę?", "description": "Zakończył się czteroletni związek Leonardo DiCaprio z młodszą o ponad 20 lat modelką Camilą Morrone. Chociaż oboje tego nie potwierdzili, amerykańskie media rozpisują się o dowodach, w tym samotnym rejsie aktora na prywatnym jachcie. Internauci zwracają uwagę, że kolejny raz gwiazdor Titanica rozstał się z partnerką po tym, jak ta obchodziła 25. urodziny. Powstał nawet wykres DiCaprio.", "link": "https://www.polsatnews.pl/wiadomosc/2022-08-31/leonardo-di-caprio-rozstal-sie-z-camila-morrone-wykres-dicaprio-mowi-prawde/", "date_published": "2022-08-31 19:41:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Wielka Brytania: 90-latek dźgnął nożem chorą żonę, bo skończyła mu się cierpliwość", "description": "Edward Turpin dźgnął swoją żonę Joan Turpin w ich domu w Orpington w hrabstwie Kent - czytamy na stronie Sky News. Mężczyzna zadzwonił pod numer alarmowy i powiedział operatorowi, że nie mogę już tego znieść. Podczas procesu zaprzeczał, by usiłował dokonać zabójstwa.", "link": "https://www.polsatnews.pl/wiadomosc/2022-08-31/wielka-brytania-90-latek-dzgnal-nozem-chora-zone-bo-skonczyla-mu-sie-cierpliwosc/", "date_published": "2022-08-31 19:26:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Włochy: Polak aresztowany przez żandarmerię. Pobił partnerkę, złamał jej m.in. nos", "description": "42-letni Polak został aresztowany we włoskim mieście Carlentini przez karabinierów za stosowanie przemocy wobec swojej partnerki. Przerażoną kobietę ze spuchniętą twarzą zauważył przechodzień, który powiadomił o sprawie służby. Kobieta doznała złamania nosa i urazu głowy.", "link": "https://www.polsatnews.pl/wiadomosc/2022-08-31/polak-aresztowany-przez-wloska-zandarmerie-jego-partnerka-miala-peknieta-czaszke/", "date_published": "2022-08-31 17:52:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Ukraina. MiG-29 uzbrojone w amerykańskie pociski przeciwradarowe. Pojawiło się nagranie", "description": "Ukraiński resort obrony opublikował nagranie, na którym widać jak z samolotów bojowych MiG-29 wystrzeliwane są amerykańskie pociski przeciwradarowe AGM-88 HARM. Tym samym jest to oficjalne potwierdzenie dostarczenia i możliwości użycia tej broni. Rakiety prawdopodobnie posłużyły w jednym z ataków na rosyjskie bazy na Krymie.", "link": "https://www.polsatnews.pl/wiadomosc/2022-08-31/ukraina-mig-29-uzbrojone-w-amerykanskie-pociski-przeciwradarowe-pojawilo-sie-nagranie/", "date_published": "2022-08-31 15:33:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Wojna w Ukrainie. Dmytro Kułeba: Rosjanie cieszą się podróżami do Europy, to nie fair", "description": "- Jeśli podzielają politykę naruszania granic, to powinni zostać w Rosji dopóki ich władze nie nauczą się jak szanuje się nienaruszalność granic - powiedział w rozmowie z Polsat News Dmytro Kułeba, szef MSZ Ukrainy, pytany o postulat zakazu wydawania wiz dla Rosjan w UE.", "link": "https://www.polsatnews.pl/wiadomosc/2022-08-31/wojna-w-ukrainie-dmytro-kuleba-rosjanie-ciesza-sie-podrozami-do-europy-to-nie-fair/", "date_published": "2022-08-31 14:49:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Trwa wyprawa Andrzeja Bargiela na Mount Everest. Chce zdobyć szczyt i zjechać z niego na nartach", "description": "Andrzej Bargiel chce wejść wraz ze swoją ekipą na najwyższy szczyt świata, a następnie zjechać z niego na nartach. W wyprawie towarzyszy im Polsat News. Lukla była pierwszym miejscem, do którego samolotem dotarła ekipa skialpinisty. Od tej miejscowości położonej na wysokości prawie trzech tys. m nad poziomem morza, wyruszyli w drogę na Mount Everest. W tej chwili są na ponad 4 tys. m n.p.m.", "link": "https://www.polsatnews.pl/wiadomosc/2022-08-31/trwa-wyprawa-andrzeja-bargiela-na-mount-everest-chce-zdobyc-szczyt-i-zjechac-z-niego-na-nartach/", "date_published": "2022-08-31 14:48:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Unia Europejska kończy z ułatwieniami wizowymi dla Rosjan. \"Przyjeżdżają, jakby wojny nie było\"", "description": "- Ministrowie spraw zagranicznych Unii Europejskiej zgodzili się w środę, by całkowicie zawiesić porozumienie o ułatwieniach wizowych dla obywateli Rosji - przekazał szef unijnej dyplomacji Josep Borrell. Oznacza to, że Rosjanom będzie trudniej uzyskać zgodę na wjazd do Wspólnoty, wiz będzie mniej, a ich otrzymanie potrwa dłużej.", "link": "https://www.polsatnews.pl/wiadomosc/2022-08-31/unia-europejska-konczy-z-ulatwieniami-wizowymi-dla-rosjan-przyjezdzaja-jakby-wojny-nie-bylo/", "date_published": "2022-08-31 14:26:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Hiszpania: Gigantyczny grad zabił dziecko. Kula miała 10 cm średnicy", "description": "20-miesięczne dziecko zmarło w środę rano po uderzeniu dziesięciocentymetrową kulą gradową podczas gwałtownej burzy w północno-wschodniej Hiszpanii. Co najmniej 50 osób doznało obrażeń", "link": "https://www.polsatnews.pl/wiadomosc/2022-08-31/hiszpanii-gigantyczny-grad-zabil-dziecko-kula-miala-10-cm-srednicy/", "date_published": "2022-08-31 14:04:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Niemiecka firma pomagała Rosji. Dostarczała substancje do produkcji broni chemicznej i biologicznej", "description": "Niemiecka firma Riol Chemie pomagała Rosji, dostarczając jej substancje niezbędne do produkcji broni chemicznej i biologicznej. Wśród nich były nowiczoki, czyli związki, którymi otruto Aleksieja Nawalnego i Siergieja Skripala - podają media w RFN. Służby przeszukały lokale należące do przedsiębiorstwa, a dziennikarze przypominają, że USA przestrzegały wcześniej przed działalnością Riol Chemie.", "link": "https://www.polsatnews.pl/wiadomosc/2022-08-31/niemiecka-firma-pomagala-rosji-dostarczala-substancje-do-produkcji-broni-chemicznej-i-biologicznej/", "date_published": "2022-08-31 13:51:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Holandia. Sportowiec otrzymał pozytywny wynik testu dopingowego. Wcześniej zjadł kurczaka", "description": "Holenderski sprinter Solomon Bockarie uzyskał pozytywny wynik testu na obecność hormonu wzrostu GHRP-2 na początku lipca. Sportowiec zarzeka się, że nie stosował dopingu, za to twierdzi, że wcześniej zjadł mięso z kupionego za niską cenę kurczaka.", "link": "https://www.polsatnews.pl/wiadomosc/2022-08-31/holandia-sportowiec-otrzymal-pozytywny-wynik-testu-dopingowego-wczesniej-zjadl-kurczaka/", "date_published": "2022-08-31 13:45:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "USA. Pilot zagroził odwołaniem lotu. Zaskakujący powód", "description": "Pilot amerykańskiej linii Southwest zagroził pasażerom samolotu, który miał lecieć do Meksyku odwołaniem lotu. Powodem zdenerwowania kapitana były... nagie zdjęcia, które pasażerowie udostępniali za pomocą specjalnej funkcji w telefonie.", "link": "https://www.polsatnews.pl/wiadomosc/2022-08-31/usa-pilot-zagrozil-odwolaniem-lotu-zaskakujacy-powod/", "date_published": "2022-08-31 12:05:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Ekstremalne upały w Chinach. Ludzie szukają ochłody w supermarketach", "description": "Chiny zmagają się z największymi w historii upałami. W wielu miejscach kraju temperatury przekraczają 40 stopni Celsjusza. Z powodu suszy wysycha trzecia najdłuższa rzeka świata - Jangcy. Rekordowe temperatury dają się we znaki również ludziom. Szczególnie narażeni są na nie seniorzy, którzy szukają schronienia w klimatyzowanych supermarketach.", "link": "https://www.polsatnews.pl/wiadomosc/2022-08-31/ekstremalne-upaly-w-chinach-ludzie-szukaja-ochlody-w-supermarketach/", "date_published": "2022-08-31 10:44:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Ukraina. Kontrofensywa trwa. Linia frontu w kilku miejscach przesunięta", "description": "Trwa ukraińska kontrofensywa na wschodzie kraju. Według brytyjskiego wywiadu linia frontu w niektórych miejscach została przesunięta. Rosjanie próbują wzmocnić swoje siły i wysyłają do Ukrainy korpus utworzony z batalionów ochotników. Armia ukraińska koncentruje się na uderzeniach w szlaki transportowe okupantów, żeby odciąć ich od zaopatrzenia.", "link": "https://www.polsatnews.pl/wiadomosc/2022-08-31/ukraina-kontrofensywa-d-2/", "date_published": "2022-08-31 09:07:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Władimir Putin kurczowo trzyma się stołu. To może wskazywać na chorobę", "description": "Władimir Putin podczas spotkania z jednym z generałów mocno ściskał swoje biurko. Jest to już kolejny raz, gdy zaobserwowano u niego ten charakterystyczny gest - przekazują media. Według ekspertów może to wskazywać na powstrzymywanie niekontrolowanego drżenia rąk. Spekulacje o stanie zdrowia prezydenta Rosji trwają już od dawna.", "link": "https://www.polsatnews.pl/wiadomosc/2022-08-31/wladimir-putin-kurczowo-trzyma-sie-stolu-to-moze-wskazywac-na-chorobe/", "date_published": "2022-08-31 08:43:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Indie. Nastolatka odrzuciła zaloty. Została podpalona", "description": "19-letnia Hinduska Ankita Singh została podpalona przez swojego stalkera i w wyniku doznanych obrażeń zmarła w szpitalu. Nastolatka odrzuciła wcześniej zaloty mężczyzny.", "link": "https://www.polsatnews.pl/wiadomosc/2022-08-31/indie-nastolatka-odrzucila-zaloty-zostala-podpalona/", "date_published": "2022-08-31 08:37:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Wojna w Ukrainie. Ogromny pożar składu ropy na Krymie", "description": "Duże kłęby dymu zaobserwowano w środę w okolicach wioski Krasnohwardijskie na okupowanym przez Rosję Krymie. Według mediów ukraińskich płonie rosyjski skład ropy.", "link": "https://www.polsatnews.pl/wiadomosc/2022-08-31/wojna-w-ukrainie-ogromny-pozar-skladu-ropy-na-krymie/", "date_published": "2022-08-31 08:01:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Wielka Brytania. Pierwsza kobieta bez makijażu w finale konkursu Miss Anglii", "description": "20-letnia studentka z południowego Londynu, Melisa Raouf, jako pierwsza kobieta w historii weszła do finału konkursu Miss Anglii, startując bez jakiegokolwiek makijażu. Kobieta w październiku powalczy o koronę najpiękniejszej.", "link": "https://www.polsatnews.pl/wiadomosc/2022-08-31/wielka-brytania-pierwsza-kobieta-bez-makijazu-w-finale-konkursu-miss-anglii/", "date_published": "2022-08-31 07:23:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Rosja. \"Wikipedia pełna materiałów rusofobicznych\". Moskwa ściga autorów", "description": "Zachód atakuje Rosję na wielu frontach. W tym informacyjnych. Na przykład Wikipedia jest pełna materiałów rusofobicznych - twierdzi rosyjski deputowany Andrej Alszewskich. Na jego wniosek Centrum ds. Zwalczania Ekstremizmu MSW w Moskwie ma się zająć walką z autorami wpisów dotyczących rosyjskich działań w Ukrainie.", "link": "https://www.polsatnews.pl/wiadomosc/2022-08-31/rosja-wikipedia-pelna-materialow-rusofobicznych-moskwa-sciga-autorow/", "date_published": "2022-08-31 07:02:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Świat żegna Michaiła Gorbaczowa. \"Zmienił bieg historii\"", "description": "Światowi przywódcy oddają hołd Michaiłowi Gorbaczowowi. Ostatni przywódca ZSRR zmarł we wtorek w wieku 91 lat.", "link": "https://www.polsatnews.pl/wiadomosc/2022-08-31/swiat-zegna-michaila-gorbaczowa-zmienil-bieg-historii/", "date_published": "2022-08-31 04:41:00+00:00", "persistent": false, "user": null, "language": null}]