[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCHnyfMqiRRG1u-2MsSQLbXA", "title": "World's Highest Jumping Robot", "description": "This tiny robot can jump higher than anything else in the world. This video is sponsored by Brilliant. The first 200 people to sign up via https://brilliant.org/veritasium get 20% off a yearly subscription.\n\nHuge thanks to Dr. Elliot Hawkes and the rest of the group - Charles Xiao, Chris Keeley, Dr. Morgan Pope, and Dr. Günter Niemeyer - for having us at UCSB and showing us their high-flying jumper. This work was partially supported by an Early Career Faculty Grant from NASA’s Space Technology Research Grants Program.\n\n▀▀▀\nReferences:\n\nHawkes, E.W., Xiao, C., Peloquin, R., Keeley, C., Begley, M.R., Pope, M.T., & Niemeyer, G. (2022). Engineered jumpers overcome biological limits via work multiplication. Nature, 604, 657-661. – https://rdcu.be/cMePc\nhttps://ve42.co/Hawkes2022\nFernandez, S. (2022). Hitting New Heights. The Current, UC Santa Barbara. – https://ve42.co/Fernandez2022\nBushwick, S. (2022). Record-Breaking Jumping Robot Can Leap a 10-Story Building. Engineering, Scientific American. – https://ve42.co/Bushwick2022\nMack, E. (2022). This Robot Can Leap Nine Stories in One Jump, Will Go Even Higher on Moon. Science, CNET. – https://ve42.co/Mack2022\nAshby, M. (2020). Materials Selection in Mechanical Design (4th edition). Elsevier. \nJumping robot leaps to record heights. Nature Video - https://ve42.co/NatureJumper\nMultiMo-Bat Robot - https://ve42.co/MultiMoBat\nGalago Jump - https://ve42.co/GalagoJump\nSlingshot Spider - https://ve42.co/SlingshotSpider\n\n▀▀▀\nSpecial thanks to Patreon supporters: RayJ Johnson, Brian Busbee, Jerome Barakos M.D., Amadeo Bee, TTST, Balkrishna Heroor, Chris LaClair, John H. Austin, Jr., OnlineBookClub.org, Matthew Gonzalez, Eric Sexton, john kiehl, Nathan Lanza, Diffbot, Gnare, Dave Kircher, Burt Humburg, Blake Byers, Dumky, Evgeny Skvortsov, Meekay, Bill Linder, Paul Peijzel, Josh Hibschman, Mac Malkawi, Michael Schneider, jim buckmaster, Juan Benet, Robert Blum, Sunil Nagaraj, Richard Sundvall, Lee Redden, Stephen Wilcox, Marinus Kuivenhoven, Michael Krugman, Cy 'kkm' K'Nelson, Sam Lutfi, Ron Neal\n\n▀▀▀\nWritten by Emily Zhang and Derek Muller\nFilmed by Derek Muller and Trenton Oliver\nAnimation by Mike Radjabov and Ivy Tello\nEdited by Trenton Oliver\nAdditional video/photos supplied by Pond5 and Getty Images\nMusic from Epidemic Sound\nProduced by Derek Muller, Petr Lebedev, and Emily Zhang", "link": "https://www.youtube.com/watch?v=daaDuC1kbds", "date_published": "2022-08-31 13:00:16+00:00", "persistent": false, "user": null, "language": null}]