[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "SIX The Musical: Tiny Desk Concert", "description": "Josh Rogosin | Sept. 1, 2022\nAs soon as the Queens saw the Tiny Desk, their excitement was palpable. After the initial flurry of selfies were snapped, the actors and band completely owned the room — enrapturing the audience of NPR staffers assembled.\n\nSIX The Musical imagines the six wives of Henry VIII reuniting on stage as real-life popstars. Their \"queenspirations\" include Beyoncé (for Catherine of Aragon, as played by Khaila Wilcoxon), Miley Cyrus (Anne Boleyn played by Storm Lever), Adele (Jane Seymour played by Jasmine Forsberg), Lizzo (Anna of Cleves played by Olivia Donalson), Britney Spears (Katherine Howard played by Didi Romero) and Celine Dion (Catherine Parr played by Gabriela Carrillo).\n\nSIX premiered in 2017 at the famed Edinburgh Fringe Festival and was written by Toby Marlow and Lucy Moss while students at the University of Cambridge. Since then, the show has become a global sensation — with six productions running concurrently. It won this year's Tony Awards for best original score and best costume design of a musical.\n\nOpening night on Broadway was set for March 12, 2020. Just 90 minutes before curtain, New York theaters were ordered to close due to the pandemic. As the resident theater geek on the team, I pitched SIX for a Tiny Desk (home) concert once the show finally opened in the fall of 2021. Then it was announced that the musical would be at The National Theatre just a few miles from NPR HQ. Luckily, we were all finally back at Bob's diminutive desk recording bands, ready to welcome them. The rest, as they say, is herstory.\n\nSET LIST\n\"Ex-Wives (Reprise)\" \n\"Heart of Stone\"\n\"Get Down\"\n\"Six\"\n\nMUSICIANS\nKhaila Wilcoxon: vocals, as Catherine of Aragon\nStorm Lever: vocals, as Anne Boleyn\nJasmine Forsberg: vocals, as Jane Seymour\nOlivia Donalson: vocals, as Anna of Cleves\nDidi Romero: vocals, as Katherine Howard\nGabriela Carrillo: vocals, as Catherine Parr\nJo Ann Daugherty: conductor, keyboard\nValerie Maze: melodica, percussion\nJanetta Goines: bass\nRose Laguaña: electric, acoustic guitar\nPaige Durr: drums\n\nTINY DESK TEAM\nProducer/Audio Engineer: Josh Rogosin\nDirector: Kara Frame \nSeries Creator: Bob Boilen\nSeries Producer: Bobby Carter \nEditor: Michael Zamora \nVideographers: Kara Frame, Michael Zamora, Pierre Kattar, Joshua Bryant\nProduction Assistants: Jill Britton, Alanté Serene, Joby Tanseco\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=vkzlU2fDLs8", "date_published": "2022-09-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Isaiah J. Thompson Quartet: Tiny Desk Concert", "description": "Jazz may not be the first thing that comes to mind when you think of The Juilliard School, but perhaps this series of Tiny Desks will change that. Tiny Desk and Jazz Night in America celebrate the 20th anniversary of Juilliard Jazz with three Tiny Desk concerts featuring performances by current students and alumni of the prestigious institution.\n\nNikki Birch | August 31, 2022\nBefore Isaiah J. Thompson walked into NPR's office, special preparations for his Tiny Desk concert were already underway: the arrival and tuning of a piano for the Steinway artist, who performed the final concert in our Juilliard Jazz 20th anniversary series. When the soft-spoken pianist and his sharply-dressed bandmates touched down, I knew we were in for a treat.\n\nA common thread throughout the group's musical selections is a commitment to honoring the fibers that make up the rich fabric of African American culture. Thompson's first composition, \"Maestros of the Community,\" is an uptempo dedication to the indelible impact of seeing his identity reflected and amplified by unsunned mentors. The following song, \"Thank You Betsy,\" is a warm, dreamy ballad that highlights tenor saxophonist Julian Lee (previously featured on Jazz Night) and bassist Felix Moseholm.\n\nThe quartet's chemistry is undeniable, its long history of playing together evident in the way the members read each other's quick glances and their ability to pivot and improvise, unphased, when the unexpected occurs. (Blink and you might miss drummer Kyle Poole swiftly picking up a brush when his stick slips from his grasp.) The set ends with \"The Highest Calling,\" a fast-paced toe-tapper which gives each musician a chance to stretch. The quartet's sound, channeled through Thompson's compositions, becomes an elegant statement that combines jazz's past and present to paint a beautiful portrait of its future.\n\nSET LIST\n\"Maestros of the Community\"\n\"Thank You Betsy\"\n\"The Highest Calling\"\n\nMUSICIANS\nIsaiah J. Thompson: piano\nJulian Lee: tenor saxophone\nFelix Moseholm: bass\nKyle Poole: drums\n\nTINY DESK TEAM\nProducer: Nikki Birch\nAudio Engineer: Josh Rogosin \nDirector: Kara Frame \nCreative Director: Bob Boilen\nSeries Producer: Bobby Carter\nEditor: Michael Zamora\nAnimator: Alanté Serene\nVideographers: Kara Frame, Joshua Bryant, Michael Zamora\nProduction Assistant: Jill Britton\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=D9jEMdJGhs0", "date_published": "2022-08-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]