[{"source": "https://www.theguardian.com/rss", "title": "China’s treatment of Uyghurs may be crime against humanity, says UN human rights chief", "description": "<p>Michelle Bachelet issues report minutes before her term ends, detailing ‘credible’ reports of torture, forced sterilization and internment</p><p>The outgoing UN human rights commissioner, Michelle Bachelet, has said that China had committed “serious human rights violations” against Uyghur Muslims in Xinjiang province which may amount to crimes against humanity.</p><p>Bachelet’s <a href=\"https://www.ohchr.org/sites/default/files/documents/countries/2022-08-31/22-08-31-final-assesment.pdf\">damning report</a> was published with only 11 minutes to go before her term came to an end at midnight Geneva time. Publication was delayed by the eleventh-hour delivery of an official Chinese response that contained names and pictures of individuals that had to be blacked out by the UN commissioner’s office for privacy and safety reasons.</p> <a href=\"https://www.theguardian.com/world/2022/aug/31/china-uyghur-muslims-xinjiang-michelle-bachelet-un\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/aug/31/china-uyghur-muslims-xinjiang-michelle-bachelet-un", "date_published": "2022-08-31 23:49:10+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Transfer news: Chelsea make second Aubameyang bid as £75m Fofana arrives", "description": "<ul><li>Chelsea’s first offer of £13m plus Marcos Alonso was rejected</li><li>Leeds make late move to rival Southampton for Cody Gakpo</li></ul><p>Chelsea’s summer spending could reach close to £350m as they pursue deadline-day deals for Pierre-Emerick Aubameyang and Josko Gvardiol. The figure in the first window under the new owners went past £250m on Wednesday with the £75m signing of Wesley Fofana from Leicester.</p><p>On Wednesday night Chelsea had an offer rejected for Aubameyang of €15m (£13m) that included Marcos Alonso but they swiftly returned with a new bid – also including Alonso – and talks progressed to the point of discussing the add-ons structure. Aubameyang joined Barcelona from Arsenal in February but is ready to return to the Premier League and the 33-year-old has agreed terms with Chelsea.</p> <a href=\"https://www.theguardian.com/football/2022/aug/31/transfer-latest-leicester-boga-everton-garner-manchester-united\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/aug/31/transfer-latest-leicester-boga-everton-garner-manchester-united", "date_published": "2022-08-31 23:19:26+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Next PM urged to put families at the heart of policymaking plans", "description": "<p>Children’s commissioner for England says investing in family is the single greatest investment you can make</p><p>Ministers have been urged to put family at the centre of policymaking, with the children’s commissioner for England saying “investing in family is the single greatest investment you can make”.</p><p>Dame Rachel de Souza has called on the incoming Conservative leader’s administration to “prioritise” putting families “at the heart” of policymaking as outlined in the government-commissioned family review.</p> <a href=\"https://www.theguardian.com/education/2022/sep/01/next-pm-urged-to-put-families-at-the-heart-of-policymaking-plans\">Continue reading...</a>", "link": "https://www.theguardian.com/education/2022/sep/01/next-pm-urged-to-put-families-at-the-heart-of-policymaking-plans", "date_published": "2022-08-31 23:07:40+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Cold homes will cost children’s lives and cause long-term damage, warn experts", "description": "<p>Winter ‘humanitarian crisis’ will damage children’s lungs and brain development</p><p>Cold homes will damage children’s lungs and brain development and lead to deaths as part of a “significant humanitarian crisis” this winter, health experts have warned.</p><p>Unless the next prime minister curbs soaring fuel bills, children face a wave of respiratory illness with long-term consequences, according to a review by Sir Michael Marmot, the director of UCL’s Institute of Health Equity, and Prof Ian Sinha, a respiratory consultant at Liverpool’s Alder Hey children’s hospital.</p> <a href=\"https://www.theguardian.com/society/2022/sep/01/cold-homes-will-cost-childrens-lives-and-cause-long-term-damage-warn-experts\">Continue reading...</a>", "link": "https://www.theguardian.com/society/2022/sep/01/cold-homes-will-cost-childrens-lives-and-cause-long-term-damage-warn-experts", "date_published": "2022-08-31 23:01:39+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘It’s cold, it’s mouldy, we’re ill non-stop’: the UK families living in fear of winter", "description": "<p>‘Your children should feel safe and secure and happy,’ says Alifjane Begum, one of millions who live in cold homes. ‘They’re not’</p><ul><li><a href=\"https://www.theguardian.com/society/2022/sep/01/cold-homes-will-cost-childrens-lives-and-cause-long-term-damage-warn-experts\">Cold homes will cost children’s lives and cause long-term damage, warn experts</a> </li></ul><p>Last winter Ayaat, four, was “severely ill, coughing all night”, as damp afflicted her family’s temporary council home in Dagenham, east London.</p><p>As mould spread, her sisters, Ayesha, six, and Anisa, seven, were sick too, and were regularly prescribed antibiotics. Their mother, Alifjane Begum, 27, has a cupboard full of Calpol but it doesn’t help much. Now she lives in fear of the coming winter knowing her finances won’t stretch to keeping the heating on to keep condensation at bay.</p> <a href=\"https://www.theguardian.com/business/2022/sep/01/its-cold-its-mouldy-were-ill-non-stop-the-uk-families-living-in-fear-of-winter\">Continue reading...</a>", "link": "https://www.theguardian.com/business/2022/sep/01/its-cold-its-mouldy-were-ill-non-stop-the-uk-families-living-in-fear-of-winter", "date_published": "2022-08-31 23:01:39+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "A generation of Britons face long-term illness from being cold and poor this winter | Michael Marmot", "description": "<p>When two-thirds of the population face fuel poverty, it is clear that we’ll need more than just quick fixes to this crisis</p><p><a href=\"https://www.youtube.com/watch?v=q5fW7sERw7I\">All I want is a room somewhere</a>./ Far away from the cold night air …/warm face, warm hands, warm feet. Oh, wouldn’t it be loverly.</p><p>To Eliza Doolittle’s lament we can add, not just “loverly”, but healthy, too. George Bernard Shaw, whose play Pygmalion was the source for the film My Fair Lady, was writing about Edwardian London. Yet cold and poor is the reality facing <a href=\"https://www.theguardian.com/society/2022/aug/17/two-thirds-of-uk-families-could-be-in-fuel-poverty-by-january-research-finds?utm_term=62fdb94510fe8d1fd667ce03b35f1630&amp;utm_campaign=GuardianTodayUK&amp;utm_source=esp&amp;utm_medium=Email&amp;CMP=GTUK_email\">66% of the population</a> this winter in 21st-century Britain.</p><p>Michael Marmot is professor of epidemiology at University College London, director of the UCL Institute of Health Equity, and past president of the World Medical Association</p> <a href=\"https://www.theguardian.com/commentisfree/2022/sep/01/generation-britain-long-term-illness-cold-poor-winter-cost-of-living-crisis\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/sep/01/generation-britain-long-term-illness-cold-poor-winter-cost-of-living-crisis", "date_published": "2022-08-31 23:01:38+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Children more candid about mental health when talking to robot, study finds", "description": "<p>Cambridge research finds 60cm-tall humanoid called Nao helped children open up about feelings</p><p>The Nao robot looks more like a prop from a low-budget sci-fi film than the cutting edge of medical research. But a study found that children felt more comfortable confiding in the child-sized, quizzical-looking humanoid than when responding to mental health assessments with their parents, in some cases disclosing information that they had not previously shared.</p><p>The team, from the University of Cambridge, say the findings suggest a wider role for robots in assessing children’s mental health – although they said that they would not be intended as a substitute for professional mental health support.</p> <a href=\"https://www.theguardian.com/technology/2022/sep/01/children-mental-health-talking-robot-study-cambridge\">Continue reading...</a>", "link": "https://www.theguardian.com/technology/2022/sep/01/children-mental-health-talking-robot-study-cambridge", "date_published": "2022-08-31 23:01:38+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "More than 120,000 workers quit jobs because of racism, UK study suggests", "description": "<p>Survey finds more than a quarter of minority ethnic workers have faced racist jokes in last five years  </p><p>More than 120,000 workers from minority ethnic backgrounds have quit their jobs because of racism, suggests a landmark study that has found workplace discrimination is sapping the confidence of a large part of the UK workforce.</p><p>More than one in four workers from black and other minority ethnic backgrounds have faced racist jokes at work in the last five years and 35% said it left them feeling less confident at work, according to what is believed to be the largest representative survey conducted of the UK’s 3.9 million minority ethnic workers. Eight per cent of victims left their job as a result of the racism they experienced, according to the study by the Trades Union Congress.</p> <a href=\"https://www.theguardian.com/world/2022/sep/01/more-than-120000-workers-quit-jobs-because-of-racism-uk-study-suggests\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/sep/01/more-than-120000-workers-quit-jobs-because-of-racism-uk-study-suggests", "date_published": "2022-08-31 23:01:38+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Rwanda threat raised UK asylum seekers’ suicide risk, clinicians said", "description": "<p>In-depth analysis of 36 people threatened with removal to African country says it compounded mental health problems for some </p><p>The threat of being sent to Rwanda has increased the risk of suicide among some vulnerable asylum seekers, according to medical evidence in a report.</p><p>The report, called Who’s Paying the Price? The Human Cost of the Rwanda Removals, from the charity Medical Justice, is the first in-depth analysis of 36 recently arrived asylum seekers in the UK who were held in immigration detention centres and threatened with removal to Rwanda on 14 June.</p><p><em>In the UK and Ireland, Samaritans can be contacted on 116 123, or email <a href=\"mailto:jo@samaritans.org\">jo@samaritans.org</a> or <a href=\"mailto:jo@samaritans.ie\">jo@samaritans.ie</a>. In the US, the National Suicide Prevention Lifeline is <a href=\"\">1-800-273-8255</a>. In Australia, the crisis support service Lifeline is 13 11 14. Other international helplines can be found at <a href=\"http://www.befrienders.org/\">befrienders.org</a>.</em></p> <a href=\"https://www.theguardian.com/uk-news/2022/sep/01/rwanda-threat-raised-uk-asylum-seekers-suicide-risk-clinicians-said\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/sep/01/rwanda-threat-raised-uk-asylum-seekers-suicide-risk-clinicians-said", "date_published": "2022-08-31 23:01:38+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The best theatre to stream this month: Beckett batting, Henry VI and a South African dance-off", "description": "<p>Our roundup of drama to watch at home includes an intelligent political drama, a reimagined As You like It and a play about Samuel Beckett and Harold Pinter’s passion for cricket</p><p>The Made in Northampton digital strand of the Royal &amp; Derngate theatre continues to offer riches with this intimate, cutting-edge musical co-production with the English Touring Opera. Dwelling on themes of identity and sexuality, it is written by cabaret artist Jessica Walker and Joseph Atkins. Directed by James Dacre and filmed by David Lefeber (with animation by Tom Hicks), we follow the emotional trajectory of Walker’s life, from a complex childhood to her wedding day, with an hour long song-cycle about gender confusion, sexual assault, first love, betrayals and family secrets. <a href=\"https://www.scene-unseen.co.uk/\">Available from 5 September for three months</a>.</p> <a href=\"https://www.theguardian.com/stage/2022/sep/01/the-best-theatre-to-stream-this-month-scene-unseen-tikkun-olam-and-more\">Continue reading...</a>", "link": "https://www.theguardian.com/stage/2022/sep/01/the-best-theatre-to-stream-this-month-scene-unseen-tikkun-olam-and-more", "date_published": "2022-08-31 23:01:38+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "What’s on Netflix and Amazon this month – September", "description": "<p>Our monthly rundown of the best new releases on Netflix, Amazon, iPlayer, All4, Sky/Now and more in the UK</p> <a href=\"https://www.theguardian.com/tv-and-radio/ng-interactive/2022/sep/01/whats-on-netflix-and-amazon-this-month-september\">Continue reading...</a>", "link": "https://www.theguardian.com/tv-and-radio/ng-interactive/2022/sep/01/whats-on-netflix-and-amazon-this-month-september", "date_published": "2022-08-31 23:01:38+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Ohio officer kills 20-year-old Black man seconds after opening his bedroom door", "description": "<p>Donovan Lewis was pronounced dead at the hospital after Columbus police shot at him in his own bed</p><p>A police officer in Ohio fatally shot a Black man within a second of opening his bedroom door early Tuesday morning as the officer was attempting to serve him an arrest warrant.</p><p>The killing was captured on police body camera. The man was not armed and was identified by authorities as 20-year-old Donovan Lewis, who was killed by Ricky Anderson, a Columbus police officer with decades of experience.</p> <a href=\"https://www.theguardian.com/us-news/2022/aug/31/ohio-police-shot-black-man-bedroom-warrant\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/aug/31/ohio-police-shot-black-man-bedroom-warrant", "date_published": "2022-08-31 22:53:51+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "NHS leaders warn of service cuts as hospital energy bills soar", "description": "<p>Costs expected to rise by £2m a month for some English trusts, leading to funding gap and difficult choices</p><p>Hospital trusts in England face “eye-watering” rises in energy bills of £2m a month each due to the fuel price surge, with NHS leaders saying patients may face longer waiting times or even see their care “cut back” as a result.</p><p>NHS trusts are concerned they will have to make critical choices on staff levels and the services they provide in order to keep operating, with energy costs predicted to be as much as three times higher than a year ago.</p> <a href=\"https://www.theguardian.com/society/2022/aug/31/nhs-leaders-english-trusts-service-cuts-hospital-energy-bills-soar\">Continue reading...</a>", "link": "https://www.theguardian.com/society/2022/aug/31/nhs-leaders-english-trusts-service-cuts-hospital-energy-bills-soar", "date_published": "2022-08-31 22:30:37+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "New research gives more reasons to eat less-processed food", "description": "<p>Two studies provide evidence of link between consumption of highly processed food and risk of serious disease</p><p>Eating lots of highly processed food such as ready meals is linked to an increased risk of heart disease, bowel cancer and premature death, according to two large studies.</p><p>The research offers more reasons to limit intake of ultra-processed foods and instead consume more unprocessed or minimally processed foods to reduce the risk of death, disease and ill health. The findings were published in the BMJ.</p> <a href=\"https://www.theguardian.com/food/2022/aug/31/highly-processed-food-consumption-risk-disease-evidence\">Continue reading...</a>", "link": "https://www.theguardian.com/food/2022/aug/31/highly-processed-food-consumption-risk-disease-evidence", "date_published": "2022-08-31 22:30:37+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Send Nudes review – would you let 50 strangers decide if you should enlarge your privates?", "description": "<p>Contestants on this reality show must strip for a photoshoot then show a CGI version of their naked body to a panel, who vote on whether they should get surgery. Oh how you’ll hate yourself for watching</p><p>You know how you can eat a takeaway pizza or curly fries and – if the manufacturer/concocter has done its job properly – the combination of chemicals and preservatives that have been moulded together into the food-approximation you are pushing down your gullet seems to sate and feed your appetite for it, regardless of the self-loathing that fills you at the same time? Yes? OK, great – Send Nudes (E4) is the televisual equivalent.</p><p>Anyone with an ounce of sense and a grasp on humanity’s and TV commissioners’ basic urges will have seen this coming since <a href=\"https://www.theguardian.com/tv-and-radio/2022/mar/02/your-body-uncovered-with-kate-garraway-review-a-dull-voyage-into-anatomy\" title=\"\">Your Body Uncovered</a>, presented by Kate Garraway, graced our screens in March. It used new technology to create a holographic avatar of participants with various medical disorders, who could then see themselves inside and out, walk around their own representations and view what doctors were planning to do to alleviate their health problems.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/aug/31/send-nudes-review-would-you-let-50-strangers-decide-if-you-should-enlarge-your-privates\">Continue reading...</a>", "link": "https://www.theguardian.com/tv-and-radio/2022/aug/31/send-nudes-review-would-you-let-50-strangers-decide-if-you-should-enlarge-your-privates", "date_published": "2022-08-31 22:20:37+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "New Mexico to build abortion clinic as it prepares for surge in out-of-state demand", "description": "<p>Governor signs executive order as state prepares for influx of abortion seekers from neighboring states</p><p>New Mexico’s governor earmarked $10m in public funds on Wednesday for a reproductive healthcare clinic to meet an expected rise in demand for abortions from women traveling from neighboring states that have banned the procedure.</p><p>Governor Michelle Lujan Grisham signed an executive order for the clinic to be built in southern New Mexico’s Doña Ana county, bordering Texas, where abortion has been outlawed since the US supreme court in June ended the nationwide constitutional right to the procedure.</p> <a href=\"https://www.theguardian.com/us-news/2022/aug/31/abortion-new-mexico-reproductive-healthcare-clinic\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/aug/31/abortion-new-mexico-reproductive-healthcare-clinic", "date_published": "2022-08-31 22:18:07+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Canada: police trio charged with manslaughter over shooting death of 18-month-old", "description": "<p>Jameson Shapiro killed by police gunfire after officers called to domestic dispute in Kawartha Lakes, Ontario, in November 2020</p><p>Three police officers in Canada have been charged with manslaughter in the <a href=\"https://www.theguardian.com/world/2020/nov/27/one-year-old-boy-shot-dead-during-alleged-kidnapping-in-canada\">death of an 18-month-old boy</a>, nearly two years after he was killed by police gunfire.</p><p>Ontario’s police watchdog, the Special Investigations Unit, <a href=\"https://www.siu.on.ca/en/news_template.php?nrid=8009\">announced the charges</a> on Wednesday afternoon.</p> <a href=\"https://www.theguardian.com/world/2022/aug/31/canada-police-ontario-infant-shooting-death\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/aug/31/canada-police-ontario-infant-shooting-death", "date_published": "2022-08-31 21:41:44+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Fábio Carvalho strikes at death to give Liverpool dramatic win over Newcastle", "description": "<p>Newcastle have come a long way fast under Saudi ownership but cannot escape the feeling of last-minute despair at Anfield. To Stan Collymore in 1996 and Robbie Fowler in 1997, they can add Fábio Carvalho 2022 to the list of Liverpool tormentors. Eddie Howe will find solace in the performance once the pain eventually subsides.</p><p>Five minutes of stoppage time were signalled at the end of an engrossing, fractious affair at Anfield. Liverpool’s young substitute Carvalho, who turned 20 on Tuesday, extended his birthday celebrations with the winner in the 98th minute. Additional time was added to the additional time due to treatment to Newcastle goalkeeper Nick Pope and time-wasting from his teammates.</p> <a href=\"https://www.theguardian.com/football/2022/aug/31/liverpool-newcastle-united-premier-league-match-report\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/aug/31/liverpool-newcastle-united-premier-league-match-report", "date_published": "2022-08-31 21:20:43+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "US Open: Andy Murray fights back to defeat Emilio Nava in second round", "description": "<ul><li>Murray rallies from losing first set to win 5-7, 6-3, 6-1, 6-0</li><li>No 13 seed Matteo Berrettini awaits in third round</li></ul><p>Andy Murray arrived at Arthur Ashe Stadium conscious of the fact that this was a match he could not afford to lose.</p><p>Over the past year, Murray has recorded a number of strong wins against highly ranked players, but he has often been unable to use them as catalysts for deeper runs or greater consistency. After a great straight sets first‑round win against Francisco Cerundolo, the 24th seed, it was essential that he consolidated his form appropriately in a match he was heavily favoured to win.</p> <a href=\"https://www.theguardian.com/sport/2022/aug/31/us-open-andy-murray-emilio-nava-tennis-report\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/aug/31/us-open-andy-murray-emilio-nava-tennis-report", "date_published": "2022-08-31 21:20:01+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Tomas Soucek salvages draw for West Ham to slow Tottenham’s momentum", "description": "<p>The margins are usually tight when these two great rivals meet and Antonio Conte was grateful for a point in the end after Tomas Soucek’s second-half strike cancelled out Thilo Kehrer’s own goal for a resurgent West Ham.</p><p>It could have been even better for the Hammers had the club‑record £50m signing Lucas Paquetá or Jarrod Bowen finished off late chances but this was much more like the kind of performance we have come to expect from David Moyes’s side.</p> <a href=\"https://www.theguardian.com/football/2022/aug/31/west-ham-united-tottenham-hotspur-premier-league-match-report\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/aug/31/west-ham-united-tottenham-hotspur-premier-league-match-report", "date_published": "2022-08-31 21:00:10+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Finally the Truss v Sunak psychodrama comes to end – for now at least", "description": "<p>Conservatives will choose between a halfwit with half an idea and a flatlining ideologue with no ideas</p><p>Finally. This is the end, beautiful friend. The end. Well, let’s hope so. For now at least.</p><p>In the absence of the government doing any actual governing, we’ve been forced to endure the tedium of a drawn out Tory leadership contest. A niche psychodrama for the 160,000 people allowed to vote. One with very little actual drama as we’ve all known who was going to win from the moment MPs reduced the candidates down to the final two.</p> <a href=\"https://www.theguardian.com/politics/2022/aug/31/finally-the-truss-v-sunak-psychodrama-comes-to-end-for-now-at-least\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/aug/31/finally-the-truss-v-sunak-psychodrama-comes-to-end-for-now-at-least", "date_published": "2022-08-31 20:57:20+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "UN says 50 civilians killed in April by Mali’s army", "description": "<p>Alleged massacre took place on market day in Hombori after military convoy hit explosive device</p><p>At least 50 civilians were killed during a military operation conducted by Mali’s army and “foreign troops” on 19 April, according to a report by the UN.</p><p>The UN has repeatedly accused Malian soldiers of summarily executing civilians and suspected militants during their decade-long fight against groups linked to al-Qaida and Islamic State.</p> <a href=\"https://www.theguardian.com/world/2022/aug/31/un-says-50-civilians-killed-in-april-by-malis-army\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/aug/31/un-says-50-civilians-killed-in-april-by-malis-army", "date_published": "2022-08-31 20:32:26+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Haaland scores hat-trick as Manchester City hit Nottingham Forest for six", "description": "<p>Who will bet against Erling Haaland obliterating Sergio Agüero’s club‑record 260 strikes for Manchester City if this ruthless goalscorer continues at the current rate?</p><p>Here was the centre-forward’s second hat‑trick in five days to make it nine goals in five matches: one more than the brilliant Argentinian returned in the same number during his start in City livery. Agüero took 390 appearances to reach his final tally and Haaland could eclipse this breathtaking ratio, too.</p> <a href=\"https://www.theguardian.com/football/2022/aug/31/manchester-city-nottingham-forest-premier-league-match-report\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/aug/31/manchester-city-nottingham-forest-premier-league-match-report", "date_published": "2022-08-31 20:32:03+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Gabriel Martinelli sinks Aston Villa to maintain Arsenal’s perfect start", "description": "<p>If the season were a few months older, and if Arsenal did not have a decade and a half of underachievement to nag at them, this might be called the stuff of champions. Make no mistake, the league leaders mauled Aston Villa here: for most of the night it was barely a contest but a nasty surprise was never out of the question while they led by only one goal.</p><p>When Douglas Luiz duly swung in one of his corner-kick party pieces moments after coming on as a substitute, 58,000 pairs of eyes might have rolled; they have seen it all before at a venue that knows false dawns like few others.</p> <a href=\"https://www.theguardian.com/football/2022/aug/31/arsenal-aston-villa-premier-league-match-report\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/aug/31/arsenal-aston-villa-premier-league-match-report", "date_published": "2022-08-31 20:29:51+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Nasa’s Moxie instrument successfully makes oxygen on Mars", "description": "<p>Researchers hope scaled-up version could one day generate oxygen to sustain humans on Mars</p><p>An instrument the size of a lunchbox has been successfully generating breathable oxygen on Mars, doing the work of a small tree.</p><p>Since February last year the Mars oxygen in-situ resource utilisation experiment, or Moxie, has been successfully making oxygen from the red planet’s carbon dioxide-rich atmosphere.</p> <a href=\"https://www.theguardian.com/science/2022/aug/31/nasa-moxie-instrument-successfully-makes-oxygen-on-mars\">Continue reading...</a>", "link": "https://www.theguardian.com/science/2022/aug/31/nasa-moxie-instrument-successfully-makes-oxygen-on-mars", "date_published": "2022-08-31 19:44:55+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Martin Rowson on two car crashes – cartoon", "description": "<p></p> <a href=\"https://www.theguardian.com/commentisfree/picture/2022/aug/31/martin-rowson-on-two-car-crashes-cartoon\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/picture/2022/aug/31/martin-rowson-on-two-car-crashes-cartoon", "date_published": "2022-08-31 19:06:40+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Government appoints anti-‘woke’ activist as V&A trustee", "description": "<p>Rightwing commentator Zewditu Gebreyohanes is director of a group waging ‘politicised’ campaign against the National Trust</p><p>A rightwing commentator and activist who has a record of accusing arts and heritage organisations of “wokeness” has been appointed by the prime minister to a role at the Victoria and Albert Museum, in a move likely to inflame accusations that the government is waging a “culture war”.</p><p>Zewditu Gebreyohanes, who has worked for the right-leaning Policy Exchange thinktank and is also a director of a group that has been waging a campaign against perceived “wokeness” within the National Trust, is one of three new trustees of the V&amp;A appointed by the prime minister via the Department for Digital, Culture, Media and Sport (DCMS).</p> <a href=\"https://www.theguardian.com/culture/2022/aug/31/government-appoints-anti-woke-activist-as-va-trustee\">Continue reading...</a>", "link": "https://www.theguardian.com/culture/2022/aug/31/government-appoints-anti-woke-activist-as-va-trustee", "date_published": "2022-08-31 19:03:00+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Demand for crisis support soars even in wealthy UK towns", "description": "<p>Citizens Advice in affluent Wokingham says requests for help have nearly doubled in a year</p><p>A growing number of people in one of the most affluent areas of the country are struggling financially because of a huge spike in energy bills and the soaring cost of living, according to the chief executive of Wokingham Citizens Advice.</p><p>Many people who have been “just about managing” are now slipping into poverty and debt in Berkshire, said Jake Morrison, making him fearful for poorer regions throughout the country.</p> <a href=\"https://www.theguardian.com/business/2022/aug/31/crisis-support-demand-soars-citizens-advice-uk\">Continue reading...</a>", "link": "https://www.theguardian.com/business/2022/aug/31/crisis-support-demand-soars-citizens-advice-uk", "date_published": "2022-08-31 18:20:41+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Medically fit patients waiting months to be discharged from England’s hospitals", "description": "<p>Charities say social care crisis is ‘crippling patient flow’ in hospitals and has created a ‘miserable situation’</p><p>Patients are waiting up to nine months to be discharged from NHS hospitals in England despite being medically fit to leave, according to “shocking” figures that will pile pressure on ministers to tackle the social care crisis.</p><p>Health experts say the incredibly long-delayed discharges are yet more evidence of the impact of the shortage of social care beds and provisions to get patients home safely.</p> <a href=\"https://www.theguardian.com/society/2022/aug/31/medically-fit-patients-waiting-up-to-nine-months-to-be-discharged-from-hospital\">Continue reading...</a>", "link": "https://www.theguardian.com/society/2022/aug/31/medically-fit-patients-waiting-up-to-nine-months-to-be-discharged-from-hospital", "date_published": "2022-08-31 18:13:40+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Four minutes of small talk can reveal key personality traits, study says", "description": "<p>Exchanging pleasantries can leave lasting impression and affect future social interactions, research suggests</p><p>The British may be mocked for their weather-related small talk but exchanging idle pleasantries can leave a lasting impression and affect future social interactions, research suggests.</p><p>The study found just four minutes of chit-chat can give away aspects of our personality, such as whether we are extroverted or introverted, and influence subsequent social interactions.</p> <a href=\"https://www.theguardian.com/science/2022/aug/31/four-minutes-of-small-talk-can-reveal-key-personality-traits-study-says\">Continue reading...</a>", "link": "https://www.theguardian.com/science/2022/aug/31/four-minutes-of-small-talk-can-reveal-key-personality-traits-study-says", "date_published": "2022-08-31 18:00:32+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Plans to sell £1.5bn of UK government buildings based on ‘fantasy’", "description": "<p>Jacob Rees-Mogg accused of pursuing agenda of ‘punishing civil servants who work from home’</p><p>Plans to sell off £1.5bn worth of government-owned buildings are based on “fantasy” job cuts to the civil service and ignore the role of hybrid working, critics have said.</p><p>They took aim at Jacob Rees-Mogg’s crackdown on what he called “under-utilised” property, under which the number of offices operating at the heart of Westminster would more than halved.</p> <a href=\"https://www.theguardian.com/politics/2022/aug/31/plans-to-sell-15bn-of-uk-government-offices-based-on-fantasy-say-critics\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/aug/31/plans-to-sell-15bn-of-uk-government-offices-based-on-fantasy-say-critics", "date_published": "2022-08-31 17:51:29+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Gazprom to pay Kremlin £8.6bn after record profits", "description": "<p>Politicians wait to see whether Russia switches  back on Nord Stream 1 gas supply to Europe</p><p>Russian state-backed energy firm Gazprom is poised to hand a bumper £8.6bn payout to the Kremlin after notching up record profits.</p><p>The company reported a net profit of 2.5tn roubles (£35.8bn) for the first six months of this year. Oil and gas prices soared during that period, pushed higher by concerns over supplies after Russia’s invasion of Ukraine.</p> <a href=\"https://www.theguardian.com/business/2022/aug/31/gazprom-to-pay-kremlin-86bn-after-record-profits\">Continue reading...</a>", "link": "https://www.theguardian.com/business/2022/aug/31/gazprom-to-pay-kremlin-86bn-after-record-profits", "date_published": "2022-08-31 17:40:02+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The Guardian view on Gorbachev’s legacy: the hope endures | Editorial", "description": "<p>Russia’s post-Soviet experiment in democracy failed, but the dream of its political freedom must be preserved</p><p>The Kremlin has <a href=\"https://www.theguardian.com/world/2022/aug/31/putin-gorbachev-death-tribute-impact-global-history\" title=\"\">been unsure</a> how to mark the death this week of <a href=\"https://www.theguardian.com/world/2022/aug/30/mikhail-gorbachev-obituary\" title=\"\">Mikhail Gorbachev</a>, the man who is celebrated without hesitation in the west for his role in hastening the end of the cold war. In Russia, events leading to the collapse of the Soviet Union are officially narrated as a national calamity, or not at all. The loss of superpower status is an injury that Vladimir Putin has made it his life’s work to reverse.</p><p>Mr Gorbachev did not intend for his democratising reforms to dissolve the USSR. In some former Soviet republics he is remembered more as a repressor of pro-independence movements than as a liberator. Events ran away from him. The Russia that was born from Soviet ruin was not a creature of his design, and the failure of its subsequent experiment in political freedom tainted his legacy. For many Russians, chaos and criminality contaminated the concept of democracy. Mr Putin capitalised on that disillusionment to restore authoritarianism with a neo-Soviet, nationalist inflection, of which his murderous assault on Ukraine is an expression.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/aug/31/the-guardian-view-on-gorbachevs-legacy-the-hope-endures\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/aug/31/the-guardian-view-on-gorbachevs-legacy-the-hope-endures", "date_published": "2022-08-31 17:36:07+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Is it ever a good idea to stop paying into your UK workplace pension pot?", "description": "<p>As the cost of living bites, staff are releasing cash by pausing pension contributions – but the damage can be long term</p><p>• <a href=\"https://www.theguardian.com/business/2022/aug/31/more-people-leaving-workplace-pension-schemes-tuc-warns\">TUC warns staff are leaving workplace schemes</a></p><p>UK workers are <a href=\"https://www.theguardian.com/business/2022/aug/31/more-people-leaving-workplace-pension-schemes-tuc-warns\">leaving their pension schemes</a> or reducing how much they pay in as the cost of living crisis forces people to make hard financial choices.</p> <a href=\"https://www.theguardian.com/money/2022/aug/31/is-it-ever-a-good-idea-to-stop-paying-into-your-uk-workplace-pension-pot\">Continue reading...</a>", "link": "https://www.theguardian.com/money/2022/aug/31/is-it-ever-a-good-idea-to-stop-paying-into-your-uk-workplace-pension-pot", "date_published": "2022-08-31 17:34:42+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The Guardian view on Rishi Sunak: the politician who cried wolf | Editorial", "description": "<p>Of course financial markets are jittery: the government has gone awol and the economy is tanking</p><p>The man most likely to lose the fight to become Conservative leader is threatening dire consequences if he is disappointed. Pointing to volatile financial markets, <a href=\"https://www.theguardian.com/business/2022/aug/31/10-year-borrowing-costs-for-uk-set-for-biggest-monthly-rise-since-1986\" title=\"\">Rishi Sunak</a> warned this week that investors will dump British assets if Liz Truss becomes prime minister and then borrows tens of billions to give away. Pressing ahead with <a href=\"https://www.theguardian.com/politics/2022/aug/25/truss-and-sunak-clash-on-energy-costs-at-penultimate-tory-hustings\" title=\"\">tax cuts and public spending</a> while ignoring the risk of an investors’ revolt is, says the former chancellor, “complacent and irresponsible”.</p><p>A degree of rhetorical licence is granted to electoral combatants, and Mr Sunak has enjoyed his full quota this summer. The once mild-mannered MP has spotted a dangerous <a href=\"https://www.theguardian.com/politics/live/2022/aug/09/liz-truss-rishi-sunak-cost-of-living-crisis-conservative-leadership-tv-debate-uk-politics-latest?page=with:block-62f2a6b68f082f7526a86823\" title=\"\">“lefty woke culture”</a> from which only he can protect “our history, our values, our women”. Indeed, the further behind he has fallen, the more extreme the vows for what he will do if he wins. But even the boy who cried wolf called it right once, and this latest claim will undoubtedly be taken more seriously. After all, its author once worked in the City for those money managers he sees as so jittery.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/aug/31/the-guardian-view-on-rishi-sunak-the-politician-who-cried-wolf\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/aug/31/the-guardian-view-on-rishi-sunak-the-politician-who-cried-wolf", "date_published": "2022-08-31 17:32:34+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Is it time to abandon the nuclear non-proliferation treaty? | Letters", "description": "<p>The failure of last week’s talks is forcing a rethink among those in the peace movement who once pinned their hopes on article VI of the NPT, writes <strong>Frank Jackson</strong>, while <strong>Colin Hines </strong>calls for nuclear power to be eliminated too</p><p>Last week, Jacinda Ardern wrote of growing scepticism about the intention of the nuclear weapon states to ever implement their nuclear disarmament commitments under article VI of the nuclear non-proliferation treaty (NPT), despite the threat of nuclear catastrophe being greater than ever (<a href=\"https://www.theguardian.com/commentisfree/2022/aug/25/the-world-stands-on-a-nuclear-precipice-we-must-avoid-catastrophe\" title=\"\">The world stands on a nuclear precipice – we must avoid catastrophe, 24 August</a>).</p><p>That scepticism has been more than justified by the utter failure of the NPT review conference to agree even a weak final document, with fine words about their “unequivocal undertaking to accomplish the total elimination of their nuclear arsenals” but no commitment to physical steps towards that end.</p> <a href=\"https://www.theguardian.com/world/2022/aug/31/is-it-time-to-abandon-the-nuclear-non-proliferation-treaty\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/aug/31/is-it-time-to-abandon-the-nuclear-non-proliferation-treaty", "date_published": "2022-08-31 17:19:13+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Gorbachev was let down by the west. Putin’s Russia is the result | Letters", "description": "<p>With better support from the US and Britain, Russia could have been a very different place today, says <strong>Michael Meadowcroft</strong>, while <strong>Bill Robinson</strong> remembers photographing the Thatchers and the Gorbachevs in Moscow</p><p>Mikhail Gorbachev’s attempts to reach nuclear disarmament with Ronald Reagan went much further than an agreement “to reduce medium-range nuclear missiles in Europe” (<a href=\"https://www.theguardian.com/world/2022/aug/30/mikhail-gorbachev-dies-soviet-leader-92\" title=\"\">Report, 30 August</a>). In the <a href=\"https://www.theguardian.com/world/2022/jan/09/history-of-wests-summits-with-russia\" title=\"\">1986 Reykjavik talks</a>, Gorbachev proposed the “zero option” of jointly getting rid of all their nuclear weapons, but Reagan refused.</p><p>Also, the democracy that Gorbachev wanted needed time to develop the civil society that had never existed, plus a sounder economy than was the case. The US, aided and abetted by the UK, pushed immediately for privatisation and a free economy and this led inevitably to the exploitation of the Soviet Union’s vast natural resources and the advent of the Russian oligarchs.</p> <a href=\"https://www.theguardian.com/world/2022/aug/31/gorbachev-was-let-down-by-the-west-putins-russia-is-the-result\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/aug/31/gorbachev-was-let-down-by-the-west-putins-russia-is-the-result", "date_published": "2022-08-31 17:18:34+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Fossilised teeth help scientists uncover secrets of mammals", "description": "<p>Palaeontologists studied growth lines and elements preserved in fossil teeth to reconstruct the day-to-day life of <em>Pantolambda bathmodon</em></p><p>Palaeontologists have identified the earliest example of a placental mammal in the fossil record to date, which could provide new insights into how our furry ancestors came to dominate Earth after the extinction of the dinosaurs.</p><p>They made the breakthrough by studying the odontological (tooth) equivalent of tree rings – growth lines and elements preserved in fossil teeth – which they used to reconstruct the day-to-day life of one of our early cousins: <em>Pantolambda bathmodon</em><em>, </em>a stocky<em> </em>dog-pig-like creature, which trotted around approximately 62m years ago – soon after the dinosaur extinction.</p> <a href=\"https://www.theguardian.com/science/2022/aug/31/earliest-example-of-placental-mammal-fossil-discovered\">Continue reading...</a>", "link": "https://www.theguardian.com/science/2022/aug/31/earliest-example-of-placental-mammal-fossil-discovered", "date_published": "2022-08-31 17:00:34+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "More people leaving workplace pension schemes, TUC warns", "description": "<p>Growing numbers cannot afford to save for retirement, prompting calls to increase employer contributions</p><p>• <a href=\"https://www.theguardian.com/money/2022/aug/31/is-it-ever-a-good-idea-to-stop-paying-into-your-uk-workplace-pension-pot\">Is it ever a good idea to stop paying into your UK pension scheme?</a></p><p>Growing numbers of workers are cutting their workplace pension contributions or opting out of schemes entirely because they cannot afford payments – prompting calls for employers to increase the amounts they pay in.</p><p>With real wages falling and bills rising sharply, people across the country are looking for ways to reduce spending and supplement their incomes, and the TUC said it was hearing about staff in both the public and private sectors who had concluded they could not afford to save for retirement at the moment.</p> <a href=\"https://www.theguardian.com/business/2022/aug/31/more-people-leaving-workplace-pension-schemes-tuc-warns\">Continue reading...</a>", "link": "https://www.theguardian.com/business/2022/aug/31/more-people-leaving-workplace-pension-schemes-tuc-warns", "date_published": "2022-08-31 16:59:59+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Health officials warn of major outbreaks of disease after severe floods in Pakistan", "description": "<p>Diarrhoea and malaria cases spread, with risk of dysentery and cholera, as millions of displaced people forced to drink flood water</p><p>Health officials have warned of large-scale outbreaks of disease in Pakistan after severe flooding displaced millions of people.</p><p>A rise in cases of diarrhoea and malaria has been reported after months of heavy rains left people stranded and without access to clean water.</p> <a href=\"https://www.theguardian.com/global-development/2022/aug/31/health-officials-warn-of-major-outbreaks-of-disease-after-severe-floods-in-pakistan\">Continue reading...</a>", "link": "https://www.theguardian.com/global-development/2022/aug/31/health-officials-warn-of-major-outbreaks-of-disease-after-severe-floods-in-pakistan", "date_published": "2022-08-31 16:57:51+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Blood and Honey: are we ready for the Winnie the Pooh horror film?", "description": "<p>The first trailer for the violent slasher that reimagines the world of AA Milne is somehow even wilder than expected</p><p>When it was first <a href=\"https://variety.com/2022/film/news/winnie-the-pooh-blood-and-honey-director-1235278405/\">announced</a> back in May, Winnie the Pooh: Blood and Honey was met with an amused shrug. Sure, everything else in the world is on a fast-track expressway to hell, so why not make a horror movie about AA Milne’s beloved teddy bear transforming into a living nightmare and embarking on a bloodthirsty rampage? Nice idea, good luck to all involved.</p><p>But sometimes wishes do come true. Because while Winnie the Pooh: Blood and Honey might have sounded like a one-gag pipe dream destined to be ensnared forever within Disney’s litigious machinery, now there is tangible proof that the thing actually exists. The first Blood and Honey trailer has been released into the world and, for better or worse, it is every single thing you ever thought it would be.</p> <a href=\"https://www.theguardian.com/film/2022/aug/31/winnie-the-pooh-horror-film-blood-and-honey-trailer\">Continue reading...</a>", "link": "https://www.theguardian.com/film/2022/aug/31/winnie-the-pooh-horror-film-blood-and-honey-trailer", "date_published": "2022-08-31 16:37:51+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Who will fund Sizewell C nuclear plant and when will it be built? | explainer", "description": "<p>Boris Johnson is expected to confirm government funding for Suffolk project</p><p>Boris Johnson is poised to sign off as prime minister by giving the green light for a new nuclear reactor costing up to £30bn. </p><p>The decision to offer funding for the Sizewell C in Suffolk, in his final week in Downing Street, is expected to unlock significant private funding for the project after years bogged down in planning approvals. However, it would come after Johnson promised not to make any major spending decisions before leaving office. Here is the state of play.</p> <a href=\"https://www.theguardian.com/environment/2022/aug/31/who-will-fund-sizewell-c-nuclear-plant-when-will-it-be-built-explainer\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/aug/31/who-will-fund-sizewell-c-nuclear-plant-when-will-it-be-built-explainer", "date_published": "2022-08-31 16:35:02+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Trump boasted he had ‘intelligence’ on Macron’s sex life", "description": "<p>Inventory of what was seized at Mar-a-Lago caused ‘transatlantic freakout’ between Paris and Washington</p><p>Donald Trump boasted to close associates that he knew secrets about Emmanuel Macron’s sex life from US intelligence sources, it has been reported.</p><p>The report in <a href=\"https://www.rollingstone.com/politics/politics-news/donald-trump-emmanuel-macron-maralago-fbi-raid-1234582465/\">Rolling Stone magazine</a> comes in the wake of the release of court documents on the classified and national defence documents found in a search of Trump’s Mar-a-Lago home on 8 August, which mention a file referred to as “info re: President of France”.</p> <a href=\"https://www.theguardian.com/us-news/2022/aug/31/trump-boasted-he-had-intelligence-on-macron-sex-life\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/aug/31/trump-boasted-he-had-intelligence-on-macron-sex-life", "date_published": "2022-08-31 16:28:35+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "EU foreign ministers agree to suspend visa travel deal with Russia", "description": "<p>Move will curb number of Russian nationals entering the bloc but stops short of full tourist visa ban</p><p>The EU has agreed to suspend a visa travel deal with Moscow to curb the number of Russian nationals entering the bloc for holidays and shopping, stopping short of a full tourist visa ban demanded by some central and eastern European countries.</p><p>Meeting in Prague, the EU’s 27 foreign ministers promised to suspend the 2007 visa facilitation agreement with Russia that makes it relatively easy to obtain travel documents.</p> <a href=\"https://www.theguardian.com/world/2022/aug/31/eu-foreign-ministers-agree-to-suspend-visa-travel-deal-with-russia\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/aug/31/eu-foreign-ministers-agree-to-suspend-visa-travel-deal-with-russia", "date_published": "2022-08-31 15:55:24+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The leaves are turning – but be under no illusions, this is not autumn | Alys Fowler", "description": "<p>Extreme heat has caused trees to shed their leaves early and summer crops to give up. It’s nature’s equivalent of grabbing whatever you can when leaving a burning building</p><p>The first cool mornings, the sweet rot of fallen apples, the sight of seed heads – these are all signs that autumn is here. But what happens when it starts coming earlier? When the floor is littered with burnt leaves, when the summer crops give up early and the flowers fade before all the pollinators get their fill? What has happened is a <a href=\"https://www.theguardian.com/commentisfree/2022/aug/28/the-guardian-view-on-this-false-autumn-an-uncanny-beauty\">“false” autumn</a> .</p><p>The leaves on the ground of your local park and pavements are not autumn leaves, where a deciduous tree has reclaimed as many valuable chemicals as possible from the leaf, so that the colours beneath are exposed, before sending it to ground. The extraction of pigments in a leaf is a slow process that takes trees several weeks, but the blast of extreme heat stole this from the plants and instead they had to slough off resources as they struggled to stay hydrated. These are the leaves we see right now: brown, curled and fried by the sun.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/aug/31/leaves-autumn-extreme-heat-trees-crops-nature\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/aug/31/leaves-autumn-extreme-heat-trees-crops-nature", "date_published": "2022-08-31 15:47:59+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Police chiefs blame Tory cuts for fall in crime detection and charge rates", "description": "<p>Senior officers rebuff claims police focusing on ‘woke’ causes and highlight ‘disconnected approach over the last 12 years’</p><p>Cuts under Conservative-led governments have had a negative effect upon policing, the organisation representing senior officers has said, in a rebuff to claims that forces are focusing on “woke” causes.</p><p>The National Police Chiefs Council said in a statement that crime detection and charge rates had dropped following austerity measures and a fall in police numbers since 2010.</p> <a href=\"https://www.theguardian.com/uk-news/2022/aug/31/police-chiefs-blame-tory-cuts-for-fall-in-detection-and-charge-rates\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/aug/31/police-chiefs-blame-tory-cuts-for-fall-in-detection-and-charge-rates", "date_published": "2022-08-31 15:47:56+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Ryan Giggs trial jury discharged after failing to reach verdict", "description": "<p>CPS will decide whether former footballer should face retrial on charges of assault and controlling behaviour</p><p>Ryan Giggs is facing a possible retrial in June next year after a jury failed to reach verdicts on charges of assault and controlling behaviour.</p><p>Giggs, 48, had been on trial for four weeks accused of deliberately head-butting his former girlfriend, Kate Greville, and elbowing her younger sister in the face during an argument at his home in Greater Manchester on 1 November 2020.</p> <a href=\"https://www.theguardian.com/uk-news/2022/aug/31/ryan-giggs-trial-jury-discharged-after-failing-to-reach-verdict\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/aug/31/ryan-giggs-trial-jury-discharged-after-failing-to-reach-verdict", "date_published": "2022-08-31 15:35:49+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Global fossil fuel subsidies almost doubled in 2021, analysis finds", "description": "<p>Support amid huge industry profits is a ‘roadblock’ to tackling climate crisis, says International Energy Agency</p><p>Global public subsidies for fossil fuels almost doubled to $700bn in 2021, analysis has shown, representing a “roadblock” to tackling the climate crisis.</p><p>Despite the huge profits of fossil fuel companies, the subsidies soared as governments sought to shield citizens from surging energy prices as the global economy rebounded from the Covid-19 pandemic.</p> <a href=\"https://www.theguardian.com/environment/2022/aug/31/fossil-fuel-subsidies-almost-doubled-in-2021-analysis-finds\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/aug/31/fossil-fuel-subsidies-almost-doubled-in-2021-analysis-finds", "date_published": "2022-08-31 15:14:21+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "New legal filings paint Trump as a flailing liar surrounded by lackeys | Lloyd Green", "description": "<p>‘I’m going to enforce all laws concerning the protection of classified information,’ Trump once vowed. As promises go, that one aged badly</p><p>As a first-time presidential candidate, Donald Trump repeatedly demanded that Hillary Clinton be sent to jail. “Lock her up” emerged as a battle cry for the 45th president and his fans. He also pledged that his presidency would properly handle the nation’s secrets.</p><p>“In my administration, I’m going to enforce all laws concerning the protection of classified information,” he <a href=\"https://twitter.com/HowardMortman/status/1564554875618447361\">intoned</a> at a 2016 rally in North Carolina. “No one will be above the law.” As promises go, this one aged badly – much like his commitment to release his tax returns.</p><p>Lloyd Green served in the Department of Justice from 1990 to 1992</p> <a href=\"https://www.theguardian.com/commentisfree/2022/aug/31/trump-legal-filings-liar-lackeys\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/aug/31/trump-legal-filings-liar-lackeys", "date_published": "2022-08-31 15:09:55+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘He looked ridiculous – and couldn’t style it out’: photographers pick their best Boris Johnson shot", "description": "<p>Stuck on a zipwire, waking up to Covid, knocking a child to the ground … as Boris Johnson steps down, photographers remember how they captured a showman whose clowning often fell flat</p><p><em>As London mayor Johnson joins a street rugby tournament in</em><em> Tokyo on</em><em> </em><em>a trade visit to Japan, </em><em>October 2015. </em><em>Photo by Stefan Rousseau</em></p> <a href=\"https://www.theguardian.com/artanddesign/2022/aug/31/photographers-best-shot-boris-johnson\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/2022/aug/31/photographers-best-shot-boris-johnson", "date_published": "2022-08-31 15:04:43+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Purple perennials and the Elephant Rock – readers’ best photos", "description": "<p>A selection of Guardian readers’ photographs from around the world. To submit a picture to be considered for publication in the letters section online and/or in print, please click <a href=\"https://www.theguardian.com/artanddesign/2018/jan/15/share-your-best-photographs-of-the-week-with-us\">here</a></p> <a href=\"https://www.theguardian.com/community/gallery/2022/aug/31/purple-perennials-and-the-elephant-rock-readers-best-photos\">Continue reading...</a>", "link": "https://www.theguardian.com/community/gallery/2022/aug/31/purple-perennials-and-the-elephant-rock-readers-best-photos", "date_published": "2022-08-31 15:00:31+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Spain’s annual La Tomatina tomato fight – in pictures", "description": "<p>La Tomatina has returned to the village of Buñol, near Valencia. The fiesta, billed as ‘the world’s biggest food fight’, was banned for two years due to Covid-19. Tomatoes used for the event are overripe and low quality, which makes them inedible</p> <a href=\"https://www.theguardian.com/artanddesign/gallery/2022/aug/31/spain-la-tomatina-tomato-fight-festival-in-pictures\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/gallery/2022/aug/31/spain-la-tomatina-tomato-fight-festival-in-pictures", "date_published": "2022-08-31 15:00:31+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Train drivers from 12 firms to strike over pay in September, says Aslef union", "description": "<p>Stoppage likely to be most disruptive to date after coordinated strikes by union members in July and August</p><p>Train drivers will go on strike again next month in an escalation of the long-running dispute over pay and conditions on the railway, with a 24-hour strike at 12 companies that will stop many services across Great Britain.</p><p>The action by the Aslef union on 15 September will bring to a standstill the main intercity routes from London to the Midlands, the of north England, and Scotland and Wales, as well as commuter services in the south-east, Midlands and north, and the London Overground.</p> <a href=\"https://www.theguardian.com/uk-news/2022/aug/31/aslef-drivers-at-12-train-firms-go-on-strike-on-15-september\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/aug/31/aslef-drivers-at-12-train-firms-go-on-strike-on-15-september", "date_published": "2022-08-31 15:00:26+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The Lord of the Rings: The Rings of Power review – so astounding it makes House of the Dragon look amateur", "description": "<p>The visual splendour of this rich, gorgeous Tolkien drama will make you gawp throughout. Watch it on the largest TV you can</p><p>The Lord of the Rings: The Rings of Power (<a href=\"https://www.amazon.co.uk/Lord-Rings-Power-Season/dp/B09QH97PTF\">Prime Video</a>) is likely to prove divisive, not least depending on whether you watch it on a big TV or squint at its splendour on a phone or laptop. It is so rich and gorgeous that it is easy to spend the first episode simply gawping at the landscapes, as it swoops and swooshes between the lands of elves and dwarves, humans and harfoots. This is TV that is made for big screens, although surely destined to be watched on smaller ones. It is so cinematic and grand that it makes <a href=\"https://www.theguardian.com/tv-and-radio/2022/aug/22/house-of-the-dragon-review-this-game-of-thrones-prequel-is-gorgeous-opulent-television\">House of the Dragon</a> look as if it has been cobbled together on Minecraft.</p><p>This makes it difficult to judge The Rings of Power as an ordinary series, because so much about it is extraordinary. It is Tolkien, which means this world is already venerated and beloved by so many, whether in the form of the books, Peter Jackson’s films or both. There is an extraordinary weight of expectation before any viewer presses play. Add to that the fact that this is reportedly the most expensive TV series ever made – $465m for eight episodes – and it is tough to view this as just another show. It is an event, a spectacle, but if it isn’t entirely perfect, does that make it a failure?</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/aug/31/the-lord-of-the-rings-the-rings-of-power-review-so-astounding-it-makes-house-of-the-dragon-look-amateur\">Continue reading...</a>", "link": "https://www.theguardian.com/tv-and-radio/2022/aug/31/the-lord-of-the-rings-the-rings-of-power-review-so-astounding-it-makes-house-of-the-dragon-look-amateur", "date_published": "2022-08-31 14:00:28+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "John Lewis offers staff free food over Christmas to help with cost of living", "description": "<p>Perks for workers also include interest-free loans, gift cards and a one-off bonus of as much as £2,000</p><p><a href=\"https://www.theguardian.com/business/johnlewis\">John Lewis</a> is to offer free food to all its workers, including temporary staff, during its peak Christmas trading period as a way to help with the cost of living.</p><p>Workers in stores, warehouses and its head office will be able to get breakfast and lunch in staff canteens while those on the road, such as long-distance lorry drivers, will be able to order a packed lunch.</p> <a href=\"https://www.theguardian.com/business/2022/aug/31/john-lewis-offers-staff-free-food-over-christmas-to-help-with-cost-of-living\">Continue reading...</a>", "link": "https://www.theguardian.com/business/2022/aug/31/john-lewis-offers-staff-free-food-over-christmas-to-help-with-cost-of-living", "date_published": "2022-08-31 14:00:08+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Covid inquiry to examine how Boris Johnson’s cabinet handled pandemic", "description": "<p>Second part of investigation will focus on early 2020 and what was known about the virus at the time</p><p>The UK’s official public inquiry into Covid-19 will begin scrutinising how Boris Johnson and his government handled the pandemic, it has been announced.</p><p>The delayed investigation has been broken into modules, with teams investigating and commissioning research on different issues.</p> <a href=\"https://www.theguardian.com/uk-news/2022/aug/31/covid-inquiry-to-examine-how-boris-johnsons-cabinet-handled-pandemic\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/aug/31/covid-inquiry-to-examine-how-boris-johnsons-cabinet-handled-pandemic", "date_published": "2022-08-31 13:02:38+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "What is a special master and why does Donald Trump want one?", "description": "<p>Former president’s attorneys argue that the FBI may have seized materials at Mar-a-Lago protected by executive privilege</p><p>Donald Trump’s attorneys are seeking the appointment of a special master to determine whether the materials that the FBI seized from his Mar-a-Lago resort in Florida can be used in the investigation into his unauthorized retention of government secrets.</p><p>The judge overseeing the case had said in an order over the weekend that she had preliminary intent to grant the <a href=\"https://www.theguardian.com/us-news/donaldtrump\">former US president’s</a> request – though she stressed that was not her final determination.</p> <a href=\"https://www.theguardian.com/us-news/2022/aug/31/trump-special-master-explainer\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/aug/31/trump-special-master-explainer", "date_published": "2022-08-31 12:48:47+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "From Simpsons to Spitting Image: Gorbachev the pop culture icon", "description": "<p>After his time in office, the Soviet leader stayed a familiar face in the west – and one of his ads perhaps contained a hidden message</p><p>Mikhail Gorbachev, the <a href=\"https://www.theguardian.com/world/2022/aug/30/mikhail-gorbachev-obituary\">last leader of the Soviet Union</a>, enjoyed an unusual second act as an international pop culture icon, appearing in television advertisements for western brands.</p><p>The most famous of these was a <a href=\"https://www.youtube.com/watch?v=fgm14D1jHUw&amp;ab_channel=TomDarbyshire\">1998 Pizza Hut ad</a> in which the former president of the USSR walked alongside his granddaughter across Red Square and into a franchise of the American chain.</p> <a href=\"https://www.theguardian.com/world/2022/aug/31/pizza-hut-the-simpsons-mikhail-gorbachev-pop-culture-icon\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/aug/31/pizza-hut-the-simpsons-mikhail-gorbachev-pop-culture-icon", "date_published": "2022-08-31 12:41:23+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Tory leadership contenders urged not to ditch vital regulations", "description": "<p>Group of 40 organisations says deregulation risks irreparable damage to environment, people’s health and workers’ rights</p><p>Ditching the UK’s green and social regulations in the bonfire of red tape that both Tory leadership candidates have promised would risk irreparable damage to the natural environment, to people’s health and workers’ rights, a group of 40 organisations has warned.</p><p>Health and safety in the workplace could also be threatened if current regulations are abandoned, according to the group. Both Liz Truss and Rishi Sunak, one of whom will be the next prime minister after a poll of Conservative party members, have indicated they would lead a deregulation drive in government.</p> <a href=\"https://www.theguardian.com/environment/2022/aug/31/tory-leadership-contenders-urged-not-to-ditch-vital-regulations\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/aug/31/tory-leadership-contenders-urged-not-to-ditch-vital-regulations", "date_published": "2022-08-31 12:00:28+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "How will next UK prime minister tackle cost of living and environment crises?", "description": "<p>Energy bills are set to top £3,500 a year for the average household, while voices on the right of the Tory party want to bury the ‘green agenda’</p><p>The fourth Conservative prime minister in six years will take office next week, facing a set of inflationary economic and social crises not seen since the 1970s.</p><p>Energy bills <a href=\"https://www.theguardian.com/money/2022/aug/26/ofgem-raises-energy-price-cap-to-3549\">set to top £3,500 a year</a> for the average household are forecast to <a href=\"https://www.theguardian.com/society/2022/aug/17/two-thirds-of-uk-families-could-be-in-fuel-poverty-by-january-research-finds\">push two-thirds into fuel poverty by January</a>, while food prices have leapt at the fastest rate for more than a decade, adding nearly £500 and rising to the average annual grocery bill. Key workers are striking or mulling stoppages, and services from health to the courts are on the brink of collapse. Meanwhile, sewage is pouring into our rivers and beaches, a grim metaphor for the state of the nation taking tangible form.</p> <a href=\"https://www.theguardian.com/uk-news/2022/aug/31/how-will-next-uk-prime-minister-tackle-cost-of-living-and-environment-crises\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/aug/31/how-will-next-uk-prime-minister-tackle-cost-of-living-and-environment-crises", "date_published": "2022-08-31 11:56:47+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "New PM will meet Queen at Balmoral before taking over at No 10", "description": "<p>Boris Johnson will also have to travel 500 miles from London to monarch’s Aberdeenshire estate before he steps down</p><ul><li><a href=\"https://www.theguardian.com/politics/live/2022/aug/31/boris-johnson-liz-truss-rishi-sunak-conservative-tory-leadership-hustings-uk-politics-live\">Latest politics news – live</a></li></ul><p>The new prime minister will have to travel to Balmoral in Scotland for their audience with the Queen before formally taking over in Downing Street, the royal family has said in a statement, the first time this will have happened.</p><p>The 96-year-old monarch, for whom Liz Truss or Rishi Sunak will be the 15th prime minister she has dealt with, normally sees an incoming leader at Buckingham Palace, but remains outside of London due to what is described as an an “episodic mobility issue”.</p> <a href=\"https://www.theguardian.com/politics/2022/aug/31/new-pm-will-meet-queen-at-balmoral-before-taking-over-at-no-10\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/aug/31/new-pm-will-meet-queen-at-balmoral-before-taking-over-at-no-10", "date_published": "2022-08-31 11:44:55+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Remembering Mikhail Gorbachev: the last leader of the Soviet Union – video obituary", "description": "<p>Mikhail Gorbachev, who has died at the age of 91, was the last leader of the Soviet Union and one of the most important world figures of the last quarter of the 20th century. Almost singlehandedly he brought an end to 40 years of east-west confrontation with the removal of the iron curtain and liberated the world from the danger of nuclear conflagration.</p><p>While he was celebrated in the west, many Russians never forgave&nbsp;Gorbachev&nbsp;for the turbulence that his policies unleashed, believing it was too high a price to pay for democracy</p><ul><li><a href=\"https://www.theguardian.com/world/2022/aug/30/mikhail-gorbachev-dies-soviet-leader-92\">Mikhail Gorbachev, Soviet leader who ended cold war, dies aged 91</a></li><li><a href=\"https://www.theguardian.com/world/2011/aug/16/gorbachev-coup-1991-lost-scoop\">Gorbachev coup 20 years on: the scoop that got away</a></li><li><a href=\"https://www.theguardian.com/world/live/2022/aug/30/mikhail-gorbachev-former-soviet-leader-dies-moscow-live\">Tributes pour in as Mikhail Gorbachev, former Soviet leader, dies – as it happened</a></li></ul> <a href=\"https://www.theguardian.com/world/video/2022/aug/31/remembering-mikhail-gorbachev-the-last-leader-of-the-soviet-union-video-obituary\">Continue reading...</a>", "link": "https://www.theguardian.com/world/video/2022/aug/31/remembering-mikhail-gorbachev-the-last-leader-of-the-soviet-union-video-obituary", "date_published": "2022-08-31 11:35:37+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "How to make Belgian waffles – recipe | Felicity Cloake's Masterclass", "description": "<p>A step-by-step guide to making the awfully versatile Belgian breakfast treat</p><p>An ancient festive food that still feels like a special occasion today, the Belgian waffle is all too often a mere spongy mattress for mountains of whipped cream and syrupy sauce, when it deserves to be the main attraction. It might not be Monday-morning fare, but at the weekends, or on holiday, a hot waffle is a tradition worth celebrating.</p><p>Prep <strong>15 min</strong><br />Rest <strong>1 hr+<br /></strong>Cook <strong>25 min</strong><br />Makes <strong>10</strong></p> <a href=\"https://www.theguardian.com/food/2022/aug/31/how-to-make-belgian-waffles-recipe-felicity-cloake\">Continue reading...</a>", "link": "https://www.theguardian.com/food/2022/aug/31/how-to-make-belgian-waffles-recipe-felicity-cloake", "date_published": "2022-08-31 11:00:27+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "UK early years providers: how are you coping with rising costs?", "description": "<p>We’re keen to hear from nursery owners and childminders in the UK about the  economic pressures they are facing, and how the expect to cope </p><p>We’re interested to hear which economic challenges UK early years providers face at the moment.</p><p>Whether you are a registered childminder or run a nursery, we would like to hear how you believe you will cope with rising costs and energy prices, and any other economic pressures you may face.</p> <a href=\"https://www.theguardian.com/education/2022/aug/31/uk-early-years-providers-how-are-you-coping-with-rising-costs\">Continue reading...</a>", "link": "https://www.theguardian.com/education/2022/aug/31/uk-early-years-providers-how-are-you-coping-with-rising-costs", "date_published": "2022-08-31 09:47:19+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘I was so much happier outside London’: how top chefs found heaven in the West Country", "description": "<p>Covid, exorbitant overheads and burnout have convinced a host of big names that the capital is no longer the place to be. Now settled in Somerset, Devon and Cornwall, they have created a new foodie destination</p><p>In Somerset, it has been a prolific summer for courgettes. I know this because they feature in at least three of the 10 dishes on the menu at <a href=\"https://www.oldpharmacybruton.com/\">the Old Pharmacy</a> in Bruton. “We’re inundated,” says its chef patron, Merlin Labron-Johnson. I can’t decide between the tromboncino scapece – coins of a thin, curling, pastel-green courgette native to Italy, fried in garlicky olive oil then quick-pickled in vinegar, served cold as an antipasto – and a bigger dish of grilled chunks of yellow courgette with preserved lemon, courgette cream, nasturtiums and salty, lemony almonds. I order both.</p><p>The Old Pharmacy’s blackboard menu is a snapshot of what is good and in season not just in the area, but at Labron-Johnson’s nearby farm, where he grows almost all of the fresh produce that this and <a href=\"https://osiprestaurant.com/\">Osip</a>, his small, high-end restaurant next door, put to work in their kitchens. “We grow every vegetable, herb and fruit that it’s possible to grow in the UK,” he says, not least all those courgettes. “And we don’t need to look much further than Somerset for everything else – we have Westcombe for cheese, Bruton Organic Dairy for meat, and in winter we go to a local hunter for game.” The scapece arrives crowned with basil leaves and swimming in a golden pool of peppery olive oil; I order bread to mop it up, which arrives with a blob of freshly churned, salted butter. I’m in Somerset; it would be rude not to.</p> <a href=\"https://www.theguardian.com/food/2022/aug/31/i-was-so-much-happier-outside-london-how-top-chefs-found-heaven-in-the-west-country\">Continue reading...</a>", "link": "https://www.theguardian.com/food/2022/aug/31/i-was-so-much-happier-outside-london-how-top-chefs-found-heaven-in-the-west-country", "date_published": "2022-08-31 09:00:24+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "An ancestral cape, a polaroid and labour pains: the BJP international photography award winners", "description": "<p>The British Journal of Photography International Photography Award celebrates some of our most exciting contemporary talents. The Single Image category brings together work by photographers from nine different countries across four continents.</p><p>See all the winning Single Images <a href=\"https://www.1854.photography/awards/bjp-international-photography-award/winners-2021/\">here</a> and in person at <a href=\"https://mail.1854.photography/Prod/link-tracker?redirectUrl=aHR0cHMlM0ElMkYlMkYxODU0LnBob3RvJTJGM1IyZ0ZSQyUzRnV0bV9zb3VyY2UlM0RBY3RpdmVDYW1wYWlnbiUyNnV0bV9tZWRpdW0lM0RlbWFpbCUyNnV0bV9jb250ZW50JTNEJTI1NUJFTUJBUkdPRUQlMjU1RCUyQkFubm91bmNpbmclMkJ0aGUlMkJ3aW5uZXJzJTJCb2YlMkJCSlAlMkJJbnRlcm5hdGlvbmFsJTJCUGhvdG9ncmFwaHklMkJBd2FyZCUyNnV0bV9jYW1wYWlnbiUzRFByZXNzJTJCUmVsZWFzZSUyQiUyNTVCRU1CQVJHT0VEJTI1NUQtJTJCSVBBMjAyMSUyQldpbm5lcnMlMkJBbm5vdW5jZW1lbnQlMkIlMjU1QjIzJTI1MkYwOCUyNTVE&amp;sig=CaiX3kdqKtSk9f4c7Te26f81udoHRpvsT7XtsrmR24p6&amp;iat=1661249721&amp;a=%7C%7C799342651%7C%7C&amp;account=185462785%2Eactivehosted%2Ecom&amp;email=GX9lIE64rDpUPUflJzqfZhe7zNm%2FGjJ577f8JtcRrvM%3D&amp;s=079bd8559bb8bc03d78abb353916ca78&amp;i=178A233A5A2553\">Seen Fifteen</a> gallery, London from November.</p> <a href=\"https://www.theguardian.com/artanddesign/gallery/2022/aug/31/the-bjp-photography-award-winners-single-image-category\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/gallery/2022/aug/31/the-bjp-photography-award-winners-single-image-category", "date_published": "2022-08-31 06:00:21+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "How to cope with rising energy bills – podcast", "description": "<p>Rupert Jones reports on the energy price cap and what options we have as energy bills go up</p><p>On Friday, the energy regulator Ofgem announced it is raising the energy price cap to £3,549 a year in October.</p><p>Millions of households around the UK are concerned about how they will pay their bills in the autumn. The Guardian’s consumer and money editor, Rupert Jones, tells Hannah Moore what it means for your energy bills and offers some suggestions on ways to make some savings. He reflects on how difficult it is to advise readers when their options feel increasingly limited.</p> <a href=\"https://www.theguardian.com/news/audio/2022/aug/31/how-to-cope-with-rising-energy-bills-podcast\">Continue reading...</a>", "link": "https://www.theguardian.com/news/audio/2022/aug/31/how-to-cope-with-rising-energy-bills-podcast", "date_published": "2022-08-31 02:00:15+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Mikhail Gorbachev – a life in pictures", "description": "<p>The last leader of the Soviet Union, who started a process of liberalisation and reform that eventually led to its dissolution, has died at the age of 91 in Russia</p> <a href=\"https://www.theguardian.com/world/gallery/2022/aug/31/mikhail-gorbachev-a-life-in-pictures\">Continue reading...</a>", "link": "https://www.theguardian.com/world/gallery/2022/aug/31/mikhail-gorbachev-a-life-in-pictures", "date_published": "2022-08-31 01:06:52+00:00", "persistent": false, "user": null, "language": "en-UK"}]