[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Canceled Star Wars 1313 Game Footage Released | GameSpot News", "description": "New footage Of canceled Star Wars 1313 game is revealed, Hyper Scape servers are shutting down April 28, and Xbox Games With Gold Free Games for February 2022 revealed.\n\nIn this video, DeVante talks about new footage of the canceled Star Wars: 1313 being unearthed by The Vault. This game was originally revealed at E3 2012, and would have seen players descend into the criminal underworld of the Galactic Empire's capital city, Coruscant.\n\nDeVante also talks about the games being offered in February for Xbox Games with Gold, as well as the shut down of Ubisoft’s Hyper Scape in April. \n\nSTAMPS\n00:00 - INTRO\n00:08 - Star Wars 1313\n02:10 - February Game with Gold\n02:45 - Hyper Scape Getting Shut down", "link": "https://www.youtube.com/watch?v=6SNtsEJm_8Y", "date_published": "2022-01-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PS Plus February Games Revealed… Let The Crumpocalypse Begin | GameSpot News", "description": "In today’s episode of GameSpot News, Persia talks about February's PS Plus games, the next few Call Of Duty’s releasing on PlayStation, and more. \n\nVideo Notes:\nThe February PS Plus line-up will include EA Sports UFC 4, Planet Coaster: Console Edition, and Tiny Tina's Assault on Dragon Keep: A Wonderlands One-Shot Adventure. All three will be available starting Tuesday, February 1.\n\nLater in the video, Persia goes over the report that Activision Blizzard are committed to releasing the next three entries in the Call of Duty series on PlayStation, following its impending buyout by Microsoft.\n\nAnd Lastly, Persia talks about the possibility of another Uncharted game after Naughty Dog dev says “Never say never.”\n\nFor more information on all of our topics, please visit gamespot.com.\n\nTimestamps:\nIntro - 00:00\nPS Plus - 00:08\nCall Of Duty - 01:06\nUncharted - 02:17\nOutro - 03:22", "link": "https://www.youtube.com/watch?v=KdyNzG14f24", "date_published": "2022-01-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Elder Scrolls Online Global Reveal Livestream", "description": "Learn about The Elder Scrolls Online's next big adventure! Discover the new lands, characters, and dangers coming to Tamriel in 2022.", "link": "https://www.youtube.com/watch?v=DVNSIhJgJ_Y", "date_published": "2022-01-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Blizzard Casually Announces New Survival Game | GameSpot News", "description": "In today’s GameSpot News, Persia talks about Blizzard announcing a new survival game amid the Microsoft acquisition, three new Star Wars games in the works - including a Jedi Fallen Order sequel, and more.\n\nBlizzard has announced it's working on a new survival game for PC and consoles in what looks to be a brand-new universe. Unfortunately, that's about all we know at this point, along with a look at some concept art for the project.\n\nElectronic Arts has announced major plans to create more Star Wars games, with its studios and partners developing three new games, including a sequel to Jedi Fallen Order, an FPS, and a strategy title with Respawn overseeing the development of all three games. However, EA did not announce any new Star Wars Battlefront games.\n\nLastly, Persia talks about New World's latest update bringing some major changes to the endgame of Amazon's MMORPG, most notably in the form of Expedition Mutators. \n\nFor more information on all of our topics, please visit gamespot.com.\n\nTimestamps: \nIntro - 00:00\nBlizzard - 00:06\nStar Wars - 01:25\nNew World - 02:54\nOutro - 04:21", "link": "https://www.youtube.com/watch?v=pmrKSt9GZhk", "date_published": "2022-01-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "History of Pokémon Games (Mainline Series)", "description": "From humble beginnings on the GameBoy with Pokemon Red, Blue, and Green, to 3D entries like Pokemon Sword and Shield, we’ve been addicted to catching, battling, breeding, and caring for Pokémon for more than 25 years. With the launch of Pokémon Legends: Arceus, we decided to go back and chart the history of the mainline Pokémon games. \n\nIn this video, we chart the history of the mainline Pokémon games, starting back in the 90s to explore where its creator Satoshi Tajiri got the idea for pocket monsters, to the small team that brought them to life on the GameBoy. The games exploded in popularity because trade between the two versions was required to catch 'em all, and after the trading card game and TV show, Pokémon became the juggernaut we know today. \n\nWith multiple mainline entries, from 2D to 3D titles, spin-offs, mobile games like Pokémon Go, and now the latest game, Pokémon Legends: Arceus, these cute monsters show no sign of slowing down. \n\nFor more Pokémon, make sure to check out our list of ten things you never knew about the franchise, as well as our upcoming review and features around Arceus. Make sure to subscribe at youtube.com/gamespot so you don't miss out. \n\n00:19 - 1996: Pokémon Red, Green, and Blue\n04:00 - 1998: Pokémon Yellow\n04:47 - 1999: Pokémon Gold and Silver\n06:09 - 2000: Pokémon Crystal\n06:43 - 2002: Pokémon Ruby and Sapphire\n07:57 - 2004: Pokémon FireRed and LeafGreen\n08:26 - 2004: Pokémon Emerald \n08:54 - 2006: Pokémon Diamond and Pearl\n09:34 - 2008: Pokémon Platinum\n09:50 - 2009: Pokémon HeartGold and SoulSilver\n10:21 - 2010: Pokémon Black and White\n11:02 - 2012: Pokémon Black 2 and White 2\n11:43 - 2013: Pokémon X & Y\n13:04 - 2014: Pokémon Omega Ruby and Alpha Sapphire\n13:36 - 2016: Pokémon Sun and Moon\n14:03 - 2017: Pokémon Ultra Sun and Ultra Moon\n14:29 - 2018: Pokémon Let’s Go, Pikachu! And Let’s Go, Eevee!\n15:21 - 2019: Pokémon Sword and Shield\n16:23 - 2021: Pokémon Brilliant Diamond and Shining Pearl\n16:41 - 2022: Pokémon Legends: Arceus", "link": "https://www.youtube.com/watch?v=eIZRafDT3dA", "date_published": "2022-01-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Legends: Arceus Review", "description": "Pokémon Legends: Arceus is a significant reimagining of what makes a Pokémon game, with an exciting level of flexibility that's only slightly hampered by a slow early-game grind.\n\nGame Freak and Nintendo's Pokémon Legends: Arceus will be available on Nintendo Switch on January 28, 2022. You can read the full written Pokémon Legends: Arceus review by Steve Watts on GameSpot: https://www.gamespot.com/reviews/pokemon-legends-arceus-review-what-pokemon-is-evolving/1900-6417818/", "link": "https://www.youtube.com/watch?v=_6znWl9yFVw", "date_published": "2022-01-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Uncharted: Legacy of Thieves Collection - PS4 vs PS5 Graphics Comparison", "description": "Uncharted 4 and The Lost Legacy's PlayStation 5 update enhances the graphics and performance of the games, so in this video we put them side-by-side with the original PlayStation 4 versions. \n\nThe Uncharted: Legacy of Thieves Collection has three modes: Fidelity mode which runs at 4K at 30 frames per second, Performance Mode which runs at 1440p at 60 frames per second, and Performance Plus which runs at 1080p at 120 frame per second. In this video specifically we will be using Performance Mode and Fidelity Mode and comparing the PlayStation 5 and base PlayStation 4. \n\nTimestamps 0:00\nIntroduction 0:36 \nLoading Times Comparison 1:23 \nUncharted 4 Comparison 3:47 \nUncharted The Lost Legacy Comparison \n#uncharted", "link": "https://www.youtube.com/watch?v=dlEtqTwDzHA", "date_published": "2022-01-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Uncharted: Legacy of Thieves Collection Review", "description": "Naughty Dog is one of the most recognizable names on PlayStation hardware, and the roaring success of its Uncharted franchise across two generations of the console plays a large part in that legacy. It makes sense then that the studio's first full release for the PlayStation 5 celebrates that storied history, bringing two of the series' best entries to new hardware with a suite of improvements that make experiencing the treasure-hunting adventures a pleasure again. Although some of the underlying design choices are showing some age, the Legacy of Thieves Collection is the best way to play Uncharted 4: A Thief's End and Uncharted: Lost Legacy.\n \nAcross both games, the most significant changes are clear to see in the game's three modes of play. Fidelity mode targets a native 4K presentation, with the frame rate aiming for a locked 30fps(and sticking there for pretty much every scene). The new performance mode, which is likely the best way to play, reduces the resolution to 1440p but doubles the frame rate to 60fps, which it easily maintains for much more responsive gameplay. A third mode, Performance+, cuts the resolution even more, with a native 1080p presentation and a frame rate that aims for 120fps. You'll need a display that supports that in the first place, and even then, it's a tough concession to make visually for added fluidity that's not really required for the narrative-focused adventures that this collection contains. \n \nWhat the additional horsepower of the PS5 offers, then, is choice, which wasn't present with the original releases on both the PS4 and PS4 Pro. Both Uncharted 4 and Lost Legacy have been playable on PS5 through backwards-compatibility, but have been frustratingly locked to the same 30fps cap as the PS4 versions in both respective campaigns. The higher frame rates for both were reserved for their respective multiplayer modes, which aren't included in this Legacy of Thieves Collection anyway.  \n\n#Uncharted", "link": "https://www.youtube.com/watch?v=y9wRaZCo_1I", "date_published": "2022-01-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]