[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Shtetl (full documentary) | FRONTLINE", "description": "A search for the lives and memories of an entire Jewish village lost in the Holocaust. (Aired 1996)\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nFRONTLINE travels back in time to a family shtetl with producer Marian Marzynski, who escaped the Warsaw ghetto as a child.\n\nThe remarkable three-hour documentary tells the homecoming story of two elderly Polish-American Jews who return to their families’ shtetl in Bransk, Poland, where 2,500 Jews lived before most were sent to Treblinka’s gas chambers. These two Americans are aided in their journey by a Polish Gentile, who has restored Bransk’s Jewish cemetery and researched the lives of the Jews who once lived there. The film captures these pilgrims as they face old neighbors, some who were betrayers, others who were saviors to the Jews of Bransk.\n\nLove FRONTLINE? Find us on the PBS Video App, where there are more than 300 FRONTLINE documentaries available to watch any time: https://to.pbs.org/FLVideoApp​ \n\n#Documentary #Holocaust\n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=GzmDqs1LCAc", "date_published": "2022-01-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]