[{"source": "https://www.theguardian.com/rss", "title": "'Defenders of nature': a tribute to Bruno Pereira and Dom Phillips – video", "description": "<p>The 10-day search in the Amazon for Indigenous expert Bruno Pereira and journalist Dom Phillips came to an end on Wednesday. Their deaths have horrified Brazil and underline the dangers faced by those defending the country's environment and Indigenous communities. Jonathan Watts, the Guardian's global environment editor and Phillips's friend, provides insight into their lives, their work and their legacy</p><ul><li><a href=\"https://www.theguardian.com/world/2022/jun/16/dom-phillips-and-bruno-pereira-police-find-bodies-of-two-men-in-search-for-missing-pair\">Dom Phillips and Bruno Pereira: Brazil police find two bodies in search for missing men</a><br /></li><li><a href=\"https://www.theguardian.com/world/2022/jun/13/dom-phillips-bruno-pereira-brazil-amazon-friendship\">The writer and the activist: how Dom Phillips and Bruno Pereira bonded over the Amazon</a><br /></li><li><a href=\"https://www.theguardian.com/commentisfree/2022/jun/16/the-guardian-view-on-dom-phillips-and-bruno-pereira-justice-for-them-safety-for-others\">The Guardian view on Dom Phillips and Bruno Pereira: justice for them, safety for others | Editorial</a></li></ul> <a href=\"https://www.theguardian.com/world/video/2022/jun/17/defenders-nature-bruno-pereira-dom-phillips-video\">Continue reading...</a>", "link": "https://www.theguardian.com/world/video/2022/jun/17/defenders-nature-bruno-pereira-dom-phillips-video", "date_published": "2022-06-17 11:50:17+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘It’s an investment in the future’: the creative company displaying growth through sustainability", "description": "<p>When business slowed during the pandemic, creative design and print agency KGK Genix took the opportunity to start its journey towards net zero</p><p>For Graham Pitts, group managing director of the creative design and print agency <a href=\"https://kgkgenix.com/\" rel=\"nofollow\">KGK Genix</a>, it was the pandemic that prompted him to rethink how he runs his business.</p><p>His company specialises in designing and creating brand activations, retail displays, event graphics and exhibition stands throughout Europe, and when retail shut and events stopped, 65% of its business disappeared. Working primarily with blue-chip clients, Pitts had seen how many businesses were working towards the <a href=\"https://www.gov.uk/government/publications/implementing-the-sustainable-development-goals/implementing-the-sustainable-development-goals--2\" rel=\"nofollow\">2030 sustainable development goals</a>, including the 2050 net zero emissions target, and how they were looking for eco suppliers. Boosting his company’s environmental credentials seemed like the obvious path to take. “We had lots of time to think about how we would recover and set ourselves apart,” he says. “Coming up with new ways of doing the same things means we stand out from the crowd and won’t get left behind.”</p> <a href=\"https://www.theguardian.com/green-to-grow-your-business/2022/jun/17/its-an-investment-in-the-future-the-creative-company-displaying-growth-through-sustainability\">Continue reading...</a>", "link": "https://www.theguardian.com/green-to-grow-your-business/2022/jun/17/its-an-investment-in-the-future-the-creative-company-displaying-growth-through-sustainability", "date_published": "2022-06-17 08:48:24+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘Our customers expect it of us’: the children’s skincare brand with grown-up eco values", "description": "<p>On founding her children’s skincare line, Toddle Born Wild, Hannah Saunders put sustainability at the heart of the company</p><p>When Hannah Saunders’ son Etienne was tiny, she wanted to share her passion for adventure and the outdoors with him, so she’d pop him into a baby backpack and head off on long hikes and hill walks.</p><p>“He loved being outside, but I noticed he’d get chapped lips and windburned cheeks,” she says. Unable to find products to protect his delicate skin, she decided to make her own – and her sustainable children’s skincare brand, Toddle Born Wild, was born.</p> <a href=\"https://www.theguardian.com/green-to-grow-your-business/2022/jun/17/our-customers-expect-it-of-us-the-childrens-skincare-brand-with-grown-up-eco-values\">Continue reading...</a>", "link": "https://www.theguardian.com/green-to-grow-your-business/2022/jun/17/our-customers-expect-it-of-us-the-childrens-skincare-brand-with-grown-up-eco-values", "date_published": "2022-06-17 08:47:08+00:00", "persistent": false, "user": null, "language": "en-UK"}]