[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Lore - Starscourge Radahn", "description": "One of Elden Ring's most notorious and mightiest demigods is Radahn - known throughout the land as General Radahn and Starscourge Radahn. Radahn was born of Rennala and Radagon, and shares the demigod siblings of Ranni and Rykard. However, he would stand out as one of Elden Ring and the Lands Between's Greatest Warriors, even rivaling the strength of Malenia, Blade of Miquella. So, let's dive into Radahn's past, where he came from, and what would happen to him during The Shattering. #EldenRing #Gaming #GameSpot\n\nRadahn was born of two separate houses. His mother was Rennala of Carian Royalty and the master of the Academy of Raya Lucaria - giving him an association with intelligence and sorcery. Meanwhile, his father was Radagon - who was a champion of the Erdtree and the Golden Order, with an association to incantations and faith.\n\nRadagon had flowing red hair that Radahn would inherit.\n\n“Every giant is red of hair, and Radagon was said to have despised his own red locks. Perhaps that was a curse of their kind.” However, while Radagon seemed to compare this to the giants - who fought against the Golden Order and Erdtree - and therefore saw it as a negative, Radahn viewed this as a positive thing:\n\n“Radahn inherited the furious, flaming red hair of his father Radagon, and is fond of its heroic implications.\n\n“I was born a champion’s cub. Now I am the Lord of the Battlefield’s lion.””", "link": "https://www.youtube.com/watch?v=ONoyJME6j_o", "date_published": "2022-05-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Evil Dead: The Game Review", "description": "Evil Dead: The Game doesn't stray far from this foundational premise.\n\nEvil Dead: The Game smartly leans on its B-movie hijinx to give fans of the genre something worthy of being in their horror game rotation, even as it doesn't have the soul to swallow all of their time singlehandedly.\n\nEvil Dead: The Game is available on PlayStation 4, Nintendo Switch, Xbox One, PlayStation 5, Xbox Series X and Series S, and Microsoft Windows. You can read the full written review by Mark Delaney on GameSpot: https://www.gamespot.com/reviews/evil-dead-the-game-review-somewhat-groovy/1900-6417881/\n\n#Gaming #EvilDeadGameReview #AshvsEvilDeadGameReview #EvilDeadGameTheTrailer", "link": "https://www.youtube.com/watch?v=1lkOVUmWqAo", "date_published": "2022-05-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sniper Elite 5 First 19 Minutes Of Gameplay", "description": "Sniper Elite 5 levels are made for multiple playthroughs. Let's look at how the X-Ray camera shines as we run and gun the Atlantic Wall opening level with our customized M 1911, SREM-1 sniper rifle, and Welgun SMG. In this clip, we also find a prototype night fighting MP 44, detonate some explosive barrels, and prove melee takedowns are powerful. \n\nSniper Elite 5 continues the series World War Two sniping sandbox with an expanded open area Hitman-style level design, tons of weapon customization, character upgrades, and a plot to stop secret Nazi plans. The game takes place around D-Day, with the first few missions seeing Karl Fairburne deploying by submarine to knock out guns ahead of the Allied invasion before uncovering a deeper Nazi plot called Project Kraken. Developers at Rebellion want to accommodate a wide variety of playstyles which they broke into stealth, control, power, and speed. Around that idea, the Atlantic Wall map has many different routes, from open fields to trenches to underground bunkers. There is more than one way to knock out the artillery around the map and disable a massive radar array. This was our second run of the area, and you will see us start in a later part of the mission that became unlocked and also sport a customized M 1911 with a wood stock, scope, and suppressor.  \n\nSniper Elite 5 releases on May 26th on all major platforms, including PlayStation 4, PS5, Xbox Series X|S, and PC. It is both single-player, co-op, and multiplayer, also including player invasions of the campaign. #Gaming #SniperElite #GameSpot", "link": "https://www.youtube.com/watch?v=BPDwOXO2oN8", "date_published": "2022-05-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Warzone 2 Details Leak | GameSpot News", "description": "New Call of Duty: Warzone 2 details leak, Norman Reedus reveals, Death Stranding 2 is in development and Skyrim’s Anniversary Edition may be coming to Switch. \n#GamingNews #COD #Warzone\n\nAccording to a new report from Exputer, Warzone 2 – or whatever it will be called – will include an \"interrogation\" feature similar to Rainbow Six Siege. Warzone 2 is expected to be released in 2023, following the launch of Call of Duty: Modern Warfare 2 this year. While Activision has announced the next Warzone and Modern Warfare 2, the publisher has yet to fully reveal both titles.\n\nActor Norman Reedus has revealed that development has begun on Death Stranding 2. The game has not been announced, but Reedus plainly told Leo Edit that, \"We just started the second one.\" Death Stranding sold more than 5 million copies before the launch of the director's cut, so it sure seems that the game was a hit. Sony published the PS4 and PS5 edition, with 505 Games handling the PC release in 2020.\n\nThe game's Anniversary Edition, released in 2021 for PlayStation, Xbox, and PC to celebrate the game's 10th anniversary, is now reportedly headed to Switch next. The Skyrim Anniversary Edition includes the base game, all DLC and mods, and a new fishing system, among other things.\n\nSTAMPS\n00:00 - Intro\n00:08 - Warzone 2\n01:40 - Death Stranding 2\n02:29 - Skyrim on Switch", "link": "https://www.youtube.com/watch?v=P-gLXPL0agg", "date_published": "2022-05-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "MARVEL SNAP Official Cinematic Announcement Trailer and Gameplay Reveal", "description": "Learn more about Marvel Snap a new card battler from ex Hearthstone developers. Assemble your MARVEL dream team in this action-packed 1v1 multiplayer collectible card game. Coming to Mobile and PC.\n\nVisit https://marvelsnap.com to sign-up for the limited closed beta on Android or to get the latest news on when MARVEL SNAP will be available in your region. \n\n#MarvelSnap #Gaming\n\n00:00 - Animated Teaser\n01:12 - Fastest CCG in the Multiverse!\n02:16 - Deck Building\n02:35 - Cosmic Cubes, Modes, and SNAPs\n03:22 - Cards, Variants, and Live Ops\n05:19 - Card Art, Special Effects, Music and Sound Design\n06:25 - Sign-up for Closed Beta", "link": "https://www.youtube.com/watch?v=50AhqUGthEs", "date_published": "2022-05-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "MultiVersus Preview: More Than Just A Smash Bros. Clone", "description": "Warner Bros. and Player First Games' take on Smash Bros. packs action and personality into a F2P package.\n\nThe premise seems totally absurd when you read it: the all-powerful Superman teaming with cowardly and perpetually hungry teenager Shaggy to throw down against a shape-shifting dog Jake and a face-stealing assassin Arya Stark. This is real, however, and it's MultiVersus, the upcoming Warner Bros. platform fighter and the latest game to challenge Smash Bros. for its platform fighter throne. We got an early look at the upcoming closed alpha test, and so far MultiVersus is not only a viable challenger to Nintendo's all-star smasher, but it could be a glimpse at the future of fighting games in general.\n\nOn the surface, MultiVersus looks very similar to other platform fighting games, as the combatants zip around a stage with multiple ledges, throwing out attacks and trying to knock each other off of the screen. The names on the marquee may be different--Superman, Wonder Woman, and Batman from DC Comics, Bugs Bunny and Taz from Looney Tunes, Shaggy from Scooby-Doo, etc.--but the action at a glance stays with the tried-and-true Smash Bros. formula. \n\nIt's not entirely the same, however, and nowhere is that more apparent than in 2v2 team battles. Teams are split into red and blue teams, and the first team to score four knockouts wins. This is a slightly different approach to the stock battles of Smash Bros., as knockouts act as a scored point rather than one player losing a life. This scoring format allows both players to stay in the match the entire time, rather than one remaining player being at a disadvantage. Even with this change in scoring, the team battle mode sounds similar to other games that offer it, but there's a deeper level of strategy to consider here that sets MultiVersus apart, elevating it from potential Smash Bros. clone to a game that can stand on its own two feet. #Gaming #GameSpot #Multiversus", "link": "https://www.youtube.com/watch?v=AIfoVDDMhKY", "date_published": "2022-05-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Multiversus Closed Alpha Gameplay Livestream", "description": "David dives into Multiversus to try out the new closed alpha gameplay. He'll get time to play with characters like Shaggy, Bugs Bunny, Wonder Woman, Jake, Tom and Jerry and much more.\n\nIn the Multiversus closed alpha we get a look at the tutorial, advanced tutorial and various modes including 1 vs 1, teams 2 vs 2, co-op vs the AI, and 4 player Free For All. Additionally, you'll get a feel for the battle pass in the game as well as character progression. As each character levels they get access to more and more perks to enhance their characters play style. Learn more about the game in this gameplay livestream.\n\n#Multiversus #Gaming #GameSpot", "link": "https://www.youtube.com/watch?v=ruP6fiwahSs", "date_published": "2022-05-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Saints Row Preview: It Looks Okay", "description": "We got a hands off look at a Saints Row preview demo. Instead of following the over-the-top ending of Saints Row 4, developer Volition is rebooting the action-adventure franchise with a brand-new gang in Saints Row. \n\nDeveloper Volition showed off 40 minutes of new Saints Row gameplay at a recent hands-off preview. This game is a reboot of the open-world franchise that hasn't released a mainline entry since 2013's Saints Row IV. The game takes place in a brand-new setting: the southwest United States-Inspired Santo lleso. You play as a former member of a private military corporation organization called Marshall Defense Industries. In a familiar fashion to the series you and a group of characters--including a talented driver and a wannabe business entrepreneur--form your own crew called the Saints in order to fight your way to the top. \n\nThis Saint's Row steps back from outlandish sci-fi settings and focuses on a more grounded story. Unfortunately, that has seemingly translated into a by-the-numbers open-world crime game with a series of predictable loops. You go to your gang's hideout, figure out what you want to do next, jump in your car, drive to a point on your map, complete the mission, and return to base to pick the next mission. The world doesn't seem to react to you--beyond the cops attacking you if you draw too much heat--and the game features the same handful of missions that the Saints Row games have always had like \"cause a certain amount of damage in a limited time\" or \"fly to the bad guys' base and blow it up\" or \"save your friend before time runs out.\" You never actually need to understand the lay of the land or take note of the scenery because the world is one of destinations to go to and boxes to check. If it wasn't for the graphics, this new Saints Row would seem like a game I had played almost 10 years ago.\n\nCombat seems like it could be pretty fun, as it mixes in unorthodox weapons alongside more traditional firearms. There's nothing quite as extravagant as what was seen in Saints Row: The Third and Saints Row IV, but there are a few cool toys like a device that allows you to shoot through walls and a football that latches onto enemies and sends them flying into the air. But I'm worried that combat could get stale after a while. I watched what combat looked like against both the Los Panteros and the Idols and it seemed like the same run-and-gun strategy worked for both gangs, despite their members being quite visually different. \n\n Saints Row is now scheduled to release later this year, launching for Xbox Series X|S, Xbox One, PS5, PS4, and PC on August 23. #Gaming #GameSpot #SaintsRow", "link": "https://www.youtube.com/watch?v=aCPNqZygZI8", "date_published": "2022-05-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "V Rising Beginner's Guide: 7 Early Game Tips", "description": "V Rising, the survival-crafting game from Stunlock Studios is rocketing up the Steam charts. If you picked it up and are looking for some early game tips, then here is our beginner's guide to get you started. \n\nStunlock Studios' newest title is V Rising, a survival-crafting game that puts players in the shoes of a vampire who's looking to rebuild a lost empire. The gameplay is polished and the early access build seems to be fairly stable by all accounts. However, as with any new game, players are somewhat confused as to how to progress in the game. Whether this is through finding a specific material in the world or surviving the elements as a vampire, many players could benefit from a few tips and tricks.\n\nWe've compiled our top seven tips to navigate the early game of V Rising, from where to find whetstones, how to change blood type, how to make leather, and how to avoid the sun, we've got you covered. \n\nFor more on V Rising, make sure to subscribe to GameSpot on YouTube, or check GameSpot.com, we're frequently updating the site with new V Rising guides and walkthroughs. \n\n#VRising #Guide #Gaming", "link": "https://www.youtube.com/watch?v=XrlTVwpzBGI", "date_published": "2022-05-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Witcher 3 For PS5 & Xbox Series X|S Consoles Release Window Confirmed | GameSpot News", "description": "Witcher 3 for PS5 and Xbox and Series X|S Release window confirmed by CD Projekt Red, The Last of Us Remake is reportedly set to launch this holiday, and Warzone players are farming one part of Kong’s body for easy XP. \n#GamingNews #TheWitcher #TheLastofUs\n\nToday CD Projekt Red confirmed The Witcher 3's PlayStation 5 and Xbox Series X|S version will be released in Q4 2022. That means it'll launch in the October-December period… unless the dev decided to push it again.\n\nWe're still getting reports that a remake for 2013's The Last of Us is in the works, and it seems like it's scheduled to launch sometime this year. The remake will supposedly launch in the holiday season, which is currently fairly empty following Starfield's delay.\n\nCall of Duty: Warzone is currently home to a rematch between Kong and Godzilla in Operation Monarch and as discovered on Reddit's r/CODWarzone, it is possible to hop into a helicopter and attack the ape wonder of the world's upper thigh section.\n\nSTAMPS\n00:00 - Intro\n00:06 - Witcher 3\n01:08 - The Last of Us\n02:14 - Warzone", "link": "https://www.youtube.com/watch?v=YPCyNwro7fg", "date_published": "2022-05-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]