[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Ghostwire: Tokyo Review", "description": "Ghostwire: Tokyo doesn't reinvent the wheel when it comes to open-world games, but its unique setting, tremendous attention to detail, and singular combat make it stand out amongst its contemporaries.\n\n#GhostWireTokyo", "link": "https://www.youtube.com/watch?v=oxCh-Y3gEBM", "date_published": "2022-03-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "LEGO Star Wars: The Skywalker Saga - The Final Preview", "description": "Before its full release on April 5, we had the chance to check out a preview of LEGO Star Wars: The Skywalker Saga. TT Games' new LEGO Star Wars game adds character skill trees, a cover-based shooting mechanics, and a melee combo system.\n\nThe Skywalker Saga is not a collection of Lego Star Wars: The Video Game, Lego Star Wars II: The Original Trilogy, and Lego Star Wars: The Force Awakens--this entirely new entry in developer TT Games' series features brand-new and original levels, cutscenes, voice acting, hub areas, and gameplay mechanics. Each of the nine episodes can be played in any order, and the storylines of each episode have been tweaked to incorporate details from beyond the nine mainline movies.", "link": "https://www.youtube.com/watch?v=ie-Fb-DnPKo", "date_published": "2022-03-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Witcher Game Announced, Won't Be Epic Games Store Exclusive | GameSpot News", "description": "A New Witcher game is announced, PlayStation buys Haven Studios, and Steam Deck gets support for Xbox cloud gaming. \n#GamingNews #Witcher #PlayStation\n\nCD Projekt Red has finally announced that a new game in The Witcher series is in development. While CDPR isn't ready to share any details on the next Witcher game just yet, the company did briefly touch on the company shifting to Unreal Engine 5 as part of a multi-year strategic partnership with Epic Games.\n\nSony Interactive Entertainment is buying gaming veteran Jade Raymond's new studio, Haven, in a move that comes after the two companies announced plans to work together on a new IP, a AAA multiplayer experience for PlayStation 5.\n\nSteam Deck now supports Xbox's cloud gaming service. Microsoft says it worked closely with Valve to enable support, which is now available through Microsoft's Edge browser.\n\nSTAMPS\n00:00 - Intro\n00:08 - New Witcher\n02:25 - Sony & Haven Studios\n03:35 - Xbox Cloud Gaming On Steam Deck", "link": "https://www.youtube.com/watch?v=QIMl_KOMmTs", "date_published": "2022-03-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PUBG MOBILE’s 4th Anniversary Top Four Favorites", "description": "(Presented by PUBG MOBILE ) It’s hard to believe we’ve been playing PUBG MOBILE for four years already, but it’s true. At this point, there’s just so much PUBG MOBILE to love that just going through our favorite outfits didn’t feel like it would be enough. So in honor of the 4th anniversary, we’re gonna share our top 4 things in four different categories, from our favorite maps to the best guns to the most exciting drop spots.\n\n#PUBGMOBILE #PUBGMOBILETURNS4", "link": "https://www.youtube.com/watch?v=2w-KJv9Qouk", "date_published": "2022-03-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite Chapter 3 Season 2 Resistance Story Trailer", "description": "Check out the Fortnite Chapter 3 Season 2 Story Trailer! \n\nWatch the latest trailer for the newest season coming to Fortnite. We get a look at Dr. Sloane with Prowler, as well as Agent Jones with Lara Croft. Additionally we see Dr. Strange, Iron Man, Black Widow, members of the seven and more.\n\nMultiple vehicles were showcased including planes, tanks, battle buses, blimps, and more. Hard to say what will be available for players to drive but check it out.\n\n#Fortnite #Resistance", "link": "https://www.youtube.com/watch?v=hVDQNxEuI88", "date_published": "2022-03-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "So You're Getting Back Into GTA Online…", "description": "If you’re curious about starting or jumping back into GTA Online now is the time. The streets of Los Santos have never looked better and Rockstar Games is ready to hold your hand through the process. Join Richie as he breaks down the process of returning to Grand Theft Auto Online for PS5 and Xbox Series X/S.\n\nGTA Online has been around for nearly 10 years and with the launch of the next-gen version, there's no sign of slowing down. Since you may be asking yourself if it's worth diving back into the mean streets of Los Santos with a fresh start, we've made this video to show you exactly what that looks like.\n\nA fresh start in GTA Online can be alluring. You're able to create an all-new custom character, and you're given loads of opportunities to rank up quickly. Not to mention you're given 4 million GTA bucks to get you going. The whole online system has also been streamlined to help new players start off on the right (or wrong) foot. You can now choose from four criminal careers- Executive, Gun Runner, Nightclub Owner, or Biker. From there, the real fun begins. Finding missions, joining crews and ranking up all await first time players. For classic players, the nostalgia will instantly kick in as you re-live early level missions dating back to 2013. Overall GTA Online is in a fun place, so if you're lucky enough to have a PS5 or Xbox Series X/S, it may just be worth it to start fresh.   \n\n#GTAOnline", "link": "https://www.youtube.com/watch?v=3ddEF1i5GP0", "date_published": "2022-03-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Tiny Tina's Wonderlands - Everything To Know", "description": "Tiny Tina’s Wonderlands is a spin-off Borderlands game and takes place inside a Bunkers and Badasses roleplaying campaign. Here’s everything you need to know about loot, guns, magic spells, majestic unicorns, starting classes, the tabletop overworld, co-op, and more. \n\nTiny Tina’s Wonderlands is Gearbox’s latest take on the Borderlands series and expands on tabletop roleplaying themes from Tiny Tina's Assault on Dragon Keep: A Wonderlands One-Shot Adventure. Dragon’s Keep was originally DLC for Borderlands 2. The game is set inside a Bunkers and Badasses tabletop campaign run by Tiny Tina as the Bunker Master. Wonderlands sports a cast of new characters, but features several returning faces as well, like Tina, Butt Stallion, and Mr. Torgue. Newer characters Valentine, Frette, and The Dragon Lord are played by notable voice actors Brooklyn Nine-Nine’s Andy Samberg, comedian, actor, writer Wanda Sykes, and Arrested Development’s, Will Arnett. Ashly Burch, fresh from her star turn as Aloy in Horizon Forbidden West returns as Tina.\n\nThe gameplay in Wonderlands departs from the Borderlands series with changes like a tabletop overworld, random encounters, a host of magic spells, wards, new classes based around the use of swords, hammers, and other fantasy weapons, as well as lots and lots of medieval-themed guns. Players are no longer locked to pre-made Vault Hunters and can fully customize their character, choose a backstory, voice, and pick one of six starting classes: the Brr-Zerker, Clawbringer Graveborn, Spellshot, Spore Warden, and Stabbomancer. Each class can be combined with any one of the other classes later in the game, which is called multiclassing. That allows for min/max builds or just bringing along multiple pets. \n\nWonderlands releases on March 25th with the Season One pass starting April 21st. The game will launch for PC, PS4, PlayStation 5, Xbox One, and Xbox Series X|S, although you should be aware that only the two more expensive editions of the game have new-gen optimization", "link": "https://www.youtube.com/watch?v=_Avvs-hNH8M", "date_published": "2022-03-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]