[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "DOMi & JD BECK: Tiny Desk Concert", "description": "Bobby Carter | August 10, 2022\nIf you've heard a DOMi & JD BECK song or watched a performance online, expectations of catching brilliance when you witness the jazz duo in person are likely high. JD's drumsticks move faster than the brain can process. DOMi offers every appendage on her body to the keys. It's frantic but focused, and I can't stop watching. For as tight as the two artists are musically — and even physically; one of their few Tiny Desk requests was for the drums and keys to be set up as close as possible — they take silly self-deprecating jabs when they aren't playing. It's believable until they transform and the music starts.\n\nThe two musicians come from two completely different parts of the world. James Beck began cutting his teeth as young as eleven at jam sessions in Dallas. DOMi, aka DOMi Louna, was born in France and raised on jazz, and enrolled at the Conservatoire Régional du Grand Nancy at five. DOMi eventually made her way to the States via a Presidential Scholarship from the Berklee College of Music. The two met at a trade show in 2018 and have been inseparable since, playing sets on YouTube and driving the internet nuts. Before they knew it, they were rubbing elbows with the upper echelon in jazz, R&B, and hip-hop.\n\nThe duo's debut album, ironically titled NOT TiGHT, is a graduation of sorts with all of their OGs lending a hand — notably Anderson .Paak, who took DOMi and JD BECK under his wing and made the duo the first signee to his APES*** label. The two brought highlights from that album to the Tiny Desk, including the vines, turf and vibrant floral arrangements from the album cover. Before \"U DON'T HAVE TO ROB ME,\" a true story turned comedy, they make another attempt at neutralizing the room. DOMi says, \"We're gonna ruin it!\" It's too late for all of that. We're already amazed.\n\nSET LIST\n\"NOT TiGHT\"\n\"SMiLE\"\n\"U DON'T HAVE TO ROB ME\"\n\"WHATUP\"\n\nMUSICIANS\nDOMi: keys, vocals\nJD BECK: drums, vocals\n\nTINY DESK TEAM\nProducer: Bobby Carter \nAudio Engineer: Josh Rogosin, Jhair \"Jha\" Lazo \nDirector: Kara Frame \nCreative Director: Bob Boilen \nEditor: Joshua Bryant \nVideographers: Kara Frame, Pierre Kattar, Joshua Bryant\nArt Direction: Winston Studios, Carlos Lopez, Iman Jordan\nAudio Assistant: Josephine Nyounai \nProduction Assistants: Jill Britton, Joby Tanseco\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#TinyDesk #NPRMusic #DOMiandJDBECK", "link": "https://www.youtube.com/watch?v=ANPbOxaRIO0", "date_published": "2022-08-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]