[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cult of the Lamb Review", "description": "Cult of the Lamb is a delightfully demented rogue-like that combines fast-paced dungeoneering, bold art, dark topics, and real-time simulation elements to create a one-of-a-kind \n#gaming #gamespot #DevolverDigital #IndieGame", "link": "https://www.youtube.com/watch?v=VFF0iQJAAdA", "date_published": "2022-08-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Marvel's Spider-Man PC Ultrawide Mouse & Keyboard Gameplay", "description": "See Marvel's Spider-Man in action on PC, running at ultrawide resolution using mouse and keyboard controls.\n\nMarvel’s Spider-Man Remastered is now available on PC and with it comes support for ultrawide 21:9 displays. This aspect ratio looks great while swinging around New York City fighting crime, as well as during the game’s numerous cinematic cutscenes. However Spider-Man Remastered ultrawide support isn’t without its faults. For example, menu screens such as the map or the skill tree do not support 21:9 displays. We also ran into a visual bug with the waveform UI during calls in the game. Other supported ratios include panoramic 32:9 and Nvidia Surround multi-monitor setups.\n\nThis gameplay was captured using mouse and keyboard controls. This method of playing is serviceable, but does not feel as natural as playing with a controller such as the DualSense, which is supported as well.  \n\nThe PC port of Spider-Man also includes an unlocked frame rate, improved shadows, ray-traced reflections at varying quality levels, Nvidia Deep Learning Super Sampling, Nvidia Deep Learning Anti-Aliasing and more. \n\nMarvel’s Spider-Man Remastered is coming to PC on August 12, 2022. Marvel’s Spider-Man: Miles Morales will also come to PC sometime in Fall 2022. \n\nMarvel's Spider-Man originally launched on PlayStation 4 in September 2018. The remastered version came packaged with the ultimate edition of Marvel's Spider-Man: Miles Morales, which launched with the PlayStation 5 on November 12, 2020.\n\n#gaming #marvelsspiderman #ultrawide", "link": "https://www.youtube.com/watch?v=Zq9Pjg2kQcU", "date_published": "2022-08-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PlayStation Plus Adds More Titles To Its Game Catalog | GameSpot News", "description": "A bunch of games coming to PlayStation Plus, Platoon 3 Direct info, and the DioField Chronicles beta.\n#Gaming #PlayStationPlus #PS5 \n\nMore games coming to PlayStation Plus, Splatoon 3 Direct news, and go hands on with Square Enix’s latest JRPG, DioField Chronicles, early. All this on today’s GameSpot news, coming to you from inside Spider-Man 2018 (I’m in the office and gonna see about recording on the roof. Will cut this gag if that location isn’t feasible.)\n\nSony has revealed the next batch of free games for PlayStation Plus Extra and Premium subscribers. The August 2022 PS Plus Game Catalog lineup includes not one but three Yakuza games, a recent remake in the Mana series, the latest Ghost Recon, and more, coming to the service on August 16.\n\nTo start, you can live your Japanese crime family fantasies with Yakuza 0, Yakuza Kiwami, and Yakuza Kiwami 2. Those mark the start of Yakuza offerings on PS Plus with others set to come later this year. Extra and Premium members can also get the 1v4 multiplayer game Dead by Daylight, as well as Tom Clancy's Ghost Recon Wildlands and the extremely wacky adventure game Bugsnax.\n\nRounding out the new additions will be Metro Exodus, Trials of Mana, Uno, Monopoly Madness, and Monopoly Plus.\n\nThese are the premium extras for the higher tiers, separate from the PlayStation Plus Essentials games lineup. Extra and Premium members can grab those games too, which this month include Tony Hawk, Yakuza: Like a Dragon, and Little Nightmares.\n\nIf you subscribed to PlayStation Plus Extra or Premium, make sure to check out our list of the best PS4 and PS5 games in the library to download and play here on GameSpot’s YouTube.\n\nSplatoon 3 just had its Direct spotlight, revealing a ton of new info about the game. Familiar and newbie NPCs, including Splatoon 3’s new host. Frye, Shiver, and Big Man the stingray.\n\nCan’t wait for the internet to just be awash with erotic Big Man fan art.\n\nTIMECODES: \n00:16 - PlayStation Plus titles\n01:27 - Platoon 3 Nintendo Direct info\n02:52 - DioField Chronicles beta", "link": "https://www.youtube.com/watch?v=l8YsSzn-dKs", "date_published": "2022-08-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Splatoon 3 Direct (August 8, 2022)", "description": "Watch this Splatoon 3 Direct presentation and join us in the Splatlands for roughly 30 minutes of updates!\n\nLearn more about the various stages you'll get to play on, as well as a new weapon type, new special weapons, a brand new card game, photo mode, Salmon Run, Splatfest's return, and more in this latest Splatoon 3 direct.\n\n#splatoon3 #gaming #nintendo \n\nTimestamps\n0:00 Splatoon 3 Intro\n2:39 Splatoon 3 Stages\n4:12 Splatoon 3 Weapons\n6:52 Splatoon 3 Weapon Shop\n7:50 Splatoon 3 Gear\n10:22 Splatoon 3 Lobby\n14:27 Splatoon 3 Customization\n15:40 Splatoon 3 New Card Game\n16:52 Splatoon 3 Salmon Run\n19:28 Splatoon 3 Story Mode\n22:30 Splatoon 3 Amiibo\n24:15 Splatoon 3 New NPCs\n27:25 Splatfest Returns", "link": "https://www.youtube.com/watch?v=UkfWnSlhPWw", "date_published": "2022-08-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Games Like Pokemon That Fans Should Check Out", "description": "From franchises like Monster Hunter to Final Fantasy, here are some games to play when you can't play anymore Pokemon.\n\n00:00 Intro\n00:40 Coromon\n01:18 Chocobo's Mystery Dungeon: Every Buddy!\n01:58 Ni No Kuni: Wrath of the White Witch\n02:45  Ooblets \n03:38 Monster Crown\n04:04 Monster Hunter Stories / Stories 2\n04:50 Monster Sanctuary \n05:27 Nexomon / Nexomon Extinction \n06:10 TemTem\n06:50 World of Final Fantasy: Maxima\n07:31 Outro\n\nStu here to break down some of the top games that scratch that “Gotta Catch Em’ All” itch. From big name franchises like Final Fantasy and Monster Hunter, to smaller indie teams like Ooblets and Temtem, these experiences all emulate some aspect of the Pokemon phenomenon. There is something for everyone here and although they could never be Pokemon, hopefully they can fill that Charizard sized hole in your heart until the next big release. The games on this list are available across all platforms from Playstation, to Nintendo Switch, to Xbox, and PC.\n\n#pokemon #gaming", "link": "https://www.youtube.com/watch?v=DTStbXkFWcc", "date_published": "2022-08-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Patch 1.06 Explained - Nerfs, Buffs, and Fixes", "description": "Elden Ring gets a substantial patch, a new Xbox Elite controller is on its way, and Skyrim gets a Nemesis System.\n#Gaming #EldenRing #Xbox \n\nElden Ring is getting some of its biggest changes yet, a new Xbox Elite controller could be coming soon, and Skyrim gets a fun mod. All this on today’s GameSpot News.\n\nA new patch for Elden Ring, 1.06, is now live, and it brings with it some massive adjustments. Previously in the game, you could only put down one summon sign at a time. Even leaving an area would be enough to stop the summon sign from functioning. With this newest patch, players can place multiple summon signs and invade larger areas. This means that it will be easier to pick up some PvP or run around the world while waiting to get summoned for a boss. \n\nThe oft-used and oft-maligned ash of war Bloodstone Step has been nerfed, with decreased distance and fewer invincibility frames, as well as growing less effective with repeated use. \n\nAnother notorious skill, Corpse Piler, now has decreased damage and blood buildup when hit with the blood portion of the attack. Damage caused by hitting enemies with the blade itself has only been slightly decreased. \n\nOther changes make Greatswords, Curved Greatswords, and Great Hammers quicker and an increased roll distance with a light equip load. The patch also fixes dozens of bugs and will now warn players if they are in possession of an unauthorized item such as Deathbed Smalls aka Fia’s underwear. Earlier this year a player ironically named Pantsu Dealer invaded worlds and left the cursed item behind for unsuspecting players to pick up. This resulted in tons of 180-day ban reports from users on Elden Ring’s subreddit. At least now you’ll know ahead of time to toss them because the ban hammer is dropped.  \n\nThe community response to the patch, thus far, has been overwhelmingly positive. Quote tweets and comments abound rejoice at the implemented nerfs and even the buffs to larger and heavier weapons.\n\nTIMESTAMPS: \n\n00:12 - Elden Ring 1.06 Patch\n02:03 - Xbox Elite Controller\n02:55 - Skyrim Nemesis Mod", "link": "https://www.youtube.com/watch?v=MccxCfRL_Wk", "date_published": "2022-08-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Monster Hunter Digital Event (August 2022)", "description": "Tune in to the Monster Hunter Rise: Sunbreak Digital Event for new info on the free Title Update 1, including a look at Lucent Nargacuga, Seething Bazelgeuse, and more.\n\nThis digital event is presented by Monster Hunter Series Producer Ryozo Tsujimoto and Game Director Yoshitake Suzuki.\n\n#monsterhunter #gaming", "link": "https://www.youtube.com/watch?v=oVxSLZ0Gqkk", "date_published": "2022-08-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]