[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "What Joe Biden Told FRONTLINE about School Shootings and Gun Control in 2014 | FRONTLINE Interview", "description": "In this interview from 2014, Joe Biden took FRONTLINE back to the days immediately after the 2012 Sandy Hook mass shooting in Newtown, Connecticut. “There were things I wouldn’t even say here on television, how gruesome what happened was to these little first-grade kids. And it just shocked the conscience of the country.”\n \nJoe Biden is the 47th president of the United States. At the time of this interview, he was vice president, serving under Barack Obama. Biden previously served as a U.S. senator from Delaware.\n \nThis interview was conducted by FRONTLINE’s Jim Gilmore, on November 14, 2014, for the documentary \"Gunned Down: The Power of the NRA.\" The documentary, which originally aired in 2015, is an investigation into the NRA, its political evolution and influence, and how it has consistently succeeded in defeating new gun control legislation. Learn more: https://www.pbs.org/wgbh/frontline/film/gunned-down/\n \nJoe Biden’s interview with FRONTLINE was also featured in the 2020 documentary \"NRA Under Fire.\" Watch the documentary here: https://www.youtube.com/watch?v=7KIo56iEFLc\n \nThis interview is being published as part of FRONTLINE’s Transparency Project, an effort to open up the source material behind our documentaries. Explore the transcript of this interview, and others, on the FRONTLINE website: https://www.pbs.org/wgbh/frontline/about-frontlines-transparency-project/\n \n#FRONTLINE #Interview #JoeBiden\n \nLove FRONTLINE? Find us on the PBS Video App, where there are more than 300 FRONTLINE documentaries available to watch any time: https://to.pbs.org/FLVideoApp\n \nSubscribe on YouTube: http://bit.ly/1BycsJW\nInstagram: https://www.instagram.com/frontlinepbs\nTwitter: https://twitter.com/frontlinepbs\nFacebook: https://www.facebook.com/frontline\n \nFRONTLINE is produced at GBH in Boston and is broadcast nationwide on PBS.\n \nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; the Heising-Simons Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=fEFCDoo0edY", "date_published": "2022-05-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]