[{"source": "https://www.jefftk.com/news.rss", "title": "If Professional Investors Missed This...", "description": "<p><span>\n\nOne of the largest cryptocurrency exchanges, </span>\n\n<a href=\"https://en.wikipedia.org/wiki/FTX_(company)\">FTX</a>, recently\nimploded after \n\n<a href=\"https://www.nytimes.com/2022/11/14/technology/ftx-sam-bankman-fried-crypto-bankruptcy.html?unlocked_article_code=40IPATU-4dJKAPYsqyYO1YAmhYMmQ0od0KpjdrMgGMbY9jreAGhYxqtvL_29Xl8vrakjEfkUrvd8m4bel3RjnuSuCzaIKneM8IC2aCXuvMFlh6XLySRW_9AECwcFnrOROR6xA7dnH1zZPsO6lBrrzhEVgoVHbDM-KkN1J9u1lo6LJoI7kU4hGx2Lh_pRodhtl49CeqLc91ewCuoGsNqW0_eHE6Z8FTTBlUysszUf0Dw97F6f4IipOD-Dhgyt-W-_F--fQMBtyikXbao987xBcqtapHJsaDZ9VhO0KGd_HWkd9kPukUU7XGI5Y-dIyQbxGAizHJZ7ZLUnDDfn29mkM2pczVwd0RWW-Ccl8WmAWkjpDr9SpQ&amp;smid=share-url\">apparently</a>\ntransferring customer funds to cover losses at their affiliated hedge\nfund. Matt Levine has \n\n<a href=\"https://www.bloomberg.com/opinion/authors/ARbTQlRLRjE/matthew-s-levine\">good\ncoverage</a>, especially his recent post on \n\n<a href=\"https://www.bloomberg.com/opinion/articles/2022-11-14/ftx-s-balance-sheet-was-bad\">their\nbalance sheet</a>.  Normally a crypto exchange going bust isn't\nsomething I'd pay that much attention to, aside from sympathy for its\ncustomers, but its \n\n<a href=\"https://ftxfuturefund.org/\">Future\nFund</a> was one of the largest funders in effective altruism (EA).\n\n\n\n<p>\n\nOne reaction I've seen in several places, mostly outside EA, is\nsomething like, \"this was obviously a fraud from the start, look at\nall the red flags, how could EAs have been so credulous?\"  I think\nthis is mostly wrong: the red flags they cite (size of FTX's claimed\nprofits, located in the Bahamas, involved in crypto, relatively young\nfounders, etc.) are not actually strong indicators here.  Cause for\nscrutiny, sure, but short of anything obviously wrong.\n\n</p>\n\n<p>\n\nThe opposite reaction, which I've also seen in several places, mostly\nwithin EA, is more like, \"how could we have caught this when serious\ninsitutional investors with hundreds of millions of dollars on the\nline missed it?\"  FTX had raised <a href=\"https://www.institutionalinvestor.com/article/b20nnq0gxctxy5/How-Did-So-Much-Smart-Money-Get-Tangled-Up-in-FTX\">about\n$2B</a> in external funding, including ~$200M from <a href=\"https://www.sequoiacap.com/\">Sequoia</a>, ~$100M from <a href=\"https://visionfund.com/\">SoftBank</a>, and ~$100M from the <a href=\"https://www.otpp.com/\">Ontario Teacher's Pension Plan</a>.  I\nthink this argument does have some truth in it: this is part of why\nI'm ok dismissing the \"obvious fraud\" view of the previous paragraph.\nBut I also think this lets EA off too easily.\n\n</p>\n\n<p>\n\nThe issue is, we had a lot more on the line than their investors did.\n\n\n\nTheir worst case was that their investments would go to zero and they\nwould have mild public embarrassment at having funded something that\nturned out so poorly.  A strategy of making a lot of risky bets can do\nwell, especially if spending more time investigating each opportunity\ntrades off against making more investments or means that they\nsometimes lose the best opportunities to competitor funds.  Half of\ntheir investments could fail and they could still come out ahead if the other\nhalf did well enough.  Sequoia <a href=\"https://twitter.com/sequoia/status/1590522718650499073\">wrote\nafter</a>, \"We are in the business of taking risk.  Some investments\nwill surprise to the upside, and some will surprise to the downside.\"\n\n</p>\n\n<p>\n\nThis was not our situation:\n\n</p>\n\n<ul>\n\n<li><p>The money FTX planned to donate represented a far greater portion\nof the EA \"portfolio\" than FTX did for these institutional investors,\nThe FTX Future Fund was probably the biggest source of EA funding\nafter <a href=\"https://www.openphilanthropy.org/\">Open\nPhilanthropy</a>, and was ramping up very quickly.\n\n</p></li>\n<li><p>This bankruptcy means that many organizations now suddenly have\nmuch less money than they expected: the FTX Future Fund's committed\ngrants won't be paid out, and the moral and <a href=\"https://forum.effectivealtruism.org/posts/o8B9kCkwteSqZg9zc/thoughts-on-legal-concerns-surrounding-the-ftx-situation\">legal</a>\nstatus of past grants is unclear. [1] Institutional investors were not\nrelying on the continued healthy operation of FTX or any other single\ncompany they invested in, and were thinking of the venture capital\nsegment of their portfolios as a long-term investment.\n\n</p></li>\n<li><p>FTX and their affiliated hedge fund, Alameda Research, were\nfounded and run by people from the effective altruism community with\nthe explicit goal of earning money to donate.  Their founder, Sam\nBankman-Fried, was <a href=\"https://web.archive.org/web/20150704061217/https://80000hours.org/career-guide/member-stories/sam-bankman-fried/\">profiled</a>\nby <a href=\"https://80000hours.org/\">80,000 Hours</a> and listed <a href=\"https://web.archive.org/web/20150717034849/https://80000hours.org/\">on\ntheir homepage</a> as an example earning to give, back when he was a\nfirst-year trader at <a href=\"https://www.janestreet.com/\">Jane\nStreet</a>, and he was later <a href=\"https://web.archive.org/web/20190428233845/https://www.centreforeffectivealtruism.org/team/\">on\nthe board</a> of the <a href=\"https://www.centreforeffectivealtruism.org/\">Centre for\nEffective Altruism</a>'s US branch. FTX, and Bankman-Fried in\nparticular, represented in part an investment of reputation, and\nunlike <a href=\"https://www.reuters.com/article/us-global-oil-crash-explainer/explainer-what-is-a-negative-crude-future-and-does-it-mean-anything-for-consumers-idUSKBN22301M\">typical</a>\nfinancial investments reputational investments can go negative.\n\n</p></li>\n</ul>\n\n\n\n<p>\n\nThese other investors did have much more experience evaluating large\nstartups than most EAs, but we have people in the community who do\nthis kind of evaluation professionally, and it would also have been\npossible to hire an outside group.  I suspect the main reason this\ndidn't happen is that EA isn't a unified whole, it's a collection of\nindividuals and organizations with similar goals and ways of thinking\nabout the world.  There are likely many things that would be worth it\nfor \"EA\" to do that don't happen because it's not clear who would do\nthem or even whether someone is already quietly doing the work.  I\nhope building a better process for identifying and coordinating on this\nsort of work is one of the things that can come out of this collapse.\n\n</p>\n\n<p>\n\nWhile at this stage it's still not clear to me whether more vetting\nwould have prevented this abuse of customer funds (perhaps by leading\nto better governance at FTX or more robust separation between FTX and\nAlameda) or led EAs to be more cautious with FTX funding, I don't\nthink it's enough to say that since Sequoia etc. missed it we most\nlikely would have as well.\n\n</p>\n\n<p>\n<br />\n\n[1] Disclosure: my work may have been funded in part by FTX.  I've\nasked for my pay to be put on hold if it would be coming from an FTX\ngrant.\n\n  </p>\n\n<p><i>Comment via: <a href=\"https://www.facebook.com/jefftk/posts/pfbid0SKbgbk8qBhnABUWzdud1rjS9JYK86va2CFodRPDwsmSc2tDPUgAoshxjViHhqavul\">facebook</a>, <a href=\"https://lesswrong.com/posts/gLdZEzC3afQn2Fon5\">lesswrong</a>, <a href=\"https://forum.effectivealtruism.org/posts/7o8foiTKYdRrgtzyE\">the EA Forum</a>, <a href=\"https://mastodon.mit.edu/@jefftk/109354068104606289\">mastodon</a></i></p>", "link": "https://www.jefftk.com/p/if-professional-investors-missed-this", "date_published": "2022-11-16 08:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]