[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Meets globalFEST: Suistamon Sähkö, Bedouin Burger, ADG7", "description": "For the second consecutive year, NPR teams up with globalFEST for a thrilling online music festival we call Tiny Desk Meets globalFEST: three nights, nine bands, and a world of musical traditions beamed into your living room.\n\nBob Boilen | January 18, 2022\nEvery January, I attend globalFEST at a New York City nightclub and see some of the most fantastic music I'll experience all year. Not being able to do this live and in person again is a challenge, but it's also an opportunity: Leaving the nightclub for the desktop lets us share this festival with the world. And ... IT'S FREE!\n\nFor each of the three nights, Tiny Desk Meets globalFEST will present artists in intimate settings (often behind their own globe-topped tiny desks), some of whom are making their globalFEST debuts, while a few others are notable past performers.\n\nIt's all hosted by African pop star and four-time Grammy Award winner Angélique Kidjo. She is one of the greatest artists in international music today, a creative force with 13 albums to her name. She also performed at the inaugural edition of globalFEST in 2004.\n\nTiny Desk has been working from home since March 2020, bringing you performances from across the country and the world. We've tried to maintain the same spirit as the shows at my NPR desk — stripped-down sets, an intimate setting — just in a different space. The following biographical information about each performer was written by the globalFEST team.\n\nSuistamon Sähkö\nPerforming from Tampere, Finland's Suistamon Sähkö whips up rambunctious experimental dance music with a primordial force. Cheerfully moving from ethno-techno to hip-hop, the group's buzzing synthesizers, rap declarations, and a Soviet-made accordion makes audiences come alive.\n\nSuistamon Sähkö's third album, 2021's Varokaa! Hengenvaara (loosely translated: \"Beware! Danger to Life\"), is both their most accessible and wildest material to date. It's music engineered (along with their sartorial fabulousness and irresistable dancing) to keep you warm on a frozen Scandinavian winter night.\n\nSET LIST\n\"Kalman laulu\"\n\"Kotiin\"\n\"Hummani hei\"\n\nBedouin Burger\nLebanese indie stalwart Zeid Hamdan and celestially voiced Syrian singer Lynn Adib are Bedouin Burger, a rising duo from the Middle East. Their music marries traditional Arab sounds of magam, religious songs of ancient Syria, jazz, and slick pop hooks – all delivered with a sultry, insouciant flare.\n\nRecording from Helico Studios in France, this rhythmic, entrancing performance exemplifies the band's musical style of \"surviving chaos through a celebration of life.\"\n\nSET LIST\n\"Mansya\"\n\"Nomad\"\n\"Taht El Ward\"\n\nADG7\nWith one foot in the world of tradition and another in glitzy, upbeat pop, ADG7 (Ak Dan Gwang Chil) is a multi-award winning group inspired by Korea's sacred, shamanic ritual music (gut) and beloved folk songs (minyo) of Hwanghae Province in the northern reaches of the peninsula.\n\nPerforming from Hyehwa, Korea, their powerful performance presents the spiritual blessings and positive energy of traditional music in a thoroughly modern and often comical style. ADG7 was organized in 2015, the year Korea commemorated its 70th anniversary of national liberation, and first performed in-person at globalFEST in January 2020.\n\nSET LIST\n\"Hee Hee\"\n\"Hello, Lonely\"\n\"NOZA NOZA\"\nTiny Desk Meets globalFEST\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mixing: Josh Rogosin\nTiny Production Team: Bobby Carter, Kara Frame, Joshua Bryant, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\nGLOBALFEST ARTISTIC TEAM\n\nCo-Directors: Shanta Thake, Isabel Soffer, Bill Bragin\n2022 Curators: Shanta Thake, Isabel Soffer, Bill Bragin, Gabrielle Davenport\n\nGLOBALFEST PRODUCTION TEAM\nEvent Producer: Ian Thake\nProducer: THE OFFICE performing arts + film\nVideo Producer: Karim Tabbaa\n\nSPECIAL THANKS\nThe Andrew W. Mellon Foundation\nNational Endowment for the ArtsNYC Department of Cultural Affairs\nNYC Mayor's Office of Media and Entertainment\nJanArtsNYC.org\nSocial Media Manager: Valerie French\nPublicity: Yuri Kwon, Pitch Perfect PR\nLegal Services: Tamizdat\nLegal Services: Duane Morris\nTHE OFFICE performing arts + film consists of Rachel Chanoff, Laurie Cearley, Olli Chanoff, Erica Zielinski, Nadine Goellner, Lynn Koek, Noah Bashevkin, Catherine DeGennaro, Gabrielle Davenport, Chloe Golding, Kyla Gardner, Tess Peppis, Zion Jackson, Scout Eisenberg and Jose Alvarado", "link": "https://www.youtube.com/watch?v=BThnnxdLAqs", "date_published": "2022-01-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]