[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "FLATPAK is the FUTURE of LINUX application distribution", "description": "Get 100$ credit for your own Linux server: https://www.linode.com/linuxexperiment \n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nI also do a Gaming Podcast: https://www.youtube.com/channel/UCbRPZ11S1quJ4ESoj42A3ug\n\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:36 Sponsor: Get 100$ off your own Linux server\n01:48 Why older packages don't work anymore\n05:55 How is Flatpak any better?\n09:47 Why not Snaps or AppImages?\n11:25 Flatpak is NOT the future?\n12:51 Sponsor: Get a shiny Linux device\n13:15 Support the channel\n\nThe Flatpak is not the future blogpost: https://ludocode.com/blog/flatpak-is-not-the-future\n\nWhy do we need flatpak?\n\nWell, first, there's the dependency hell. You might have recently seen one example of that through the Linus Tech Tips challenge: installing Steam removed the desktop environment entirely.\nThat's an extreme example, but a very recent one, and other, smaller ones happen very often. \n\nSecond is app distribution. These good old packages need to be made for every distro, for every release, for every architecture.\nJust Ubuntu alone will net you tens of packages to make, for every update.\n\nPPA's, introduce more dependency hell, as they can contain library updates, that might break other apps that don't come from this PPA.\n\nThere's the fact that installing a package is super insecure, as the package basically has full root control when being installed, so you better trust that install source 100%\n\nBut is Flatpak really any better?\n\nFirst Flatpak is universal. This means that you can install the same package on any distro that has the flatpak base installed, which is mostly everyone but Ubuntu these days. Developers package once, and distribute everywhere.\n\nSecond, Flatpak doesn't require root to install. Flatpak apps are sandboxed, and use portals to interact with the system, handled through permissions. These permissions are managed by the user, and they can choose to disable them.\n\nFlatpak is also decentralized: anyone can host their own flatpak remote, which is the equivalent to a repository, and anyone can have access to flathub.\n\nFlatpak also integrates with your desktop and app store. You can install apps directly from GNOME Software, Discover, Pamac, the APpCenter, and more. You can then manage them from here. THey'll add menu entries, work with the dock, or taskbar, they're just normal citizens.\n\nSome people will say that Flatpak isn't space efficient, but that's not really true: flatpak ships libraries as runtimes, and these get reused by the various apps that need them.\n\nThese runtimes have also been accused of using more RAM, but they don't use more RAM than if you had loaded the corresponding libraries if they were installed as packages.\n\nWhy not other solutions?\n\nSnap will never be a favorite for most people. It's made by Canonical. Snap also has a proprietary store backend, which annoys people, and it has clearly been designed for server and iOT first, and desktop second.\n\nThere's also appimages. These are self contained, as in each app carries all the libraries they need to run. They're portable, you can drop them in a folder somewhere and take them from distro to distro, and they'll run. Super handy.\n\nExcept that this takes a lot more space than the approach Flatpak went with, because there is no reuse of common components, and that these appimages generally look completely out of place with the rest of your system.\n\nIn the end though, what matters is what distros start shipping. And they're not turning to snap, or to appimages they're turning to flatpak, because a lot of them want an out from the old packages that put a huge burden on them in terms of time to maintain, udpate, test, upgrade and generally fix all the dependency hell.", "link": "https://www.youtube.com/watch?v=zs9QpPKDw74", "date_published": "2022-01-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]