[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Capcom Showcase 2022 Full Presentation", "description": "Today during Capcom's Showcase for Summer of 2022 we learned more about Monster Hunter Rise Sunbreak, as well as new information and exo suits in EXOPRIMAL, and finally we got updates across the Resident Evil Franchise. First we got to see Shadows of Roses the DLC for Resident Evil Village, as well as updates to Mercenaries Mode including the ability to play as Lady Dimitrescu. After that we got updates on Resident Evil 4 the remake which showed off 15 seconds of brand new gameplay. To wrap it all up we got the release of the next gen updates for Resident Evil 2,3, and 7 which are available today!\n\n#capcom #residentevil #exoprimal #monsterhunter \n\nTimestamps\n0:00 Intro\n0:40 Monster Hunter Rise: Sunbreak\n10:05 Capcom Spotlight\n13:11 EXOPRIMAL\n20:00 Dragon's Dogma 10th Anniversary\n21:24 Resident Evil Village Updates\n27:58 Resident Evil 4\n32:58 Resident Evil 2,3,7 Next Gen Trailer", "link": "https://www.youtube.com/watch?v=oT-UwGOGL8M", "date_published": "2022-06-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Diablo 4 Necromancer, PvP, World Boss Gameplay", "description": "We got our hands on some extra gameplay footage of Diablo 4 hot off the new Necromancer announcement and Diablo IV gameplay showcase at the Xbox & Bethesda Games showcase. Jake and Erick talk about some of the gameplay to see what extra things they can learn about the Necromancer, PvP and also a World Boss.\n\nWe get a deeper dive on some of the Necromancer's skills especially the \"Book of Dead\" which seems to be its summoning skills. We learn there are three skills shown off including Skeletal Warriors, Skeletal Mages, and Golem. This information below is subject to change as this is not a final build but here is what we saw from the gameplay regarding the 3 various summons. Each of the summons has 3 variations to choose from and upgrade into. For Skeletal Warriors there is Skirmishers, Defenders, and Reapers. For the Skeletal Mages there is Shadow, Cold and Bone. For the Golem there is Blood, Bone, and Iron.  See below for more detail information on what we were able to see specifically for each of the variations.\n\nSkeletal Warriors\n\n-Skirmishers\n-Defenders - Durable shield-bearers with 15% increased Life.\nUpgrades \n1. Every 10 seconds your Skeletal Defenders negate the next instance of Direct Damage they would take\n2. Increase the amount of Thorns that Defender Warriors inherit from you from 30%-50%\n3. Sacrifice - You gain 15% non-Physical Resistance, but you can no longer raise Skeletal Warriors\n-Reapers\n\nSkeletal Mages\n-Shadow\n-Cold - Chills and Freezes Enemies\nUpgrades\n1. Each time your Cold Mages damages enemies with their primary attack, you gain 2 essence\n2. Enemies who are Frozen by or damage while Frozen by your Cold Mages' primary attack are made Vulnerable for 3 seconds\n3. Sacrifice - You deal x15% increased damage to Vulnerable enemies, but you can no longer raise Skeletal Mages\n-Bone - Uses its own bones as projectiles, dealing heavy damage for a Life cost.\nUpgrades\n1. Reduce the Life Cost of your Bone Mages attacks from 15% to 10%. After being alive for 5 seconds, Bone Mages deal 40% increased damage\n2. Each time a Bone Mage dies from its own attack, they leave behind a corpse and Fortify you for 2,188\n3. Sacrifice - Your Overpower damage is increased by 30%, but you can no longer raise Skeletal Mages\n\nGolem \n-Bone - Taunts enemies in a wide area.\nUpgrades\n1. Each time your Bone Golem takes up to 20% of its maximum life as damage, it sheds a Corpse.\n2. Your Bone Golem gains 10% maximum life and the amount of Thorns they inherit from you is increased by 30% to 50%.\n3. Sacrifice - you gain 10% increased Attack Speed, but you lose the ability to summon a Golem\n-Blood - Drains Life from nearby enemies\nUpgrades\n1. Your Blood Golem absorbs 15% of damage you would take.\n2. While Healthy, your Blood Golem gains 25% Damage Reduction and x25% increased damage\n3. Sacrifice - Your maximum Life is increased by 10% but you lose the ability to summon a Golem\n-Iron - Slams the ground and stuns enemies\nUpgrades\n1. Every 5th Iron Golem attack causes a shockwave dealing 16% damage to the primary enemy and enemies behind them\n2. Your Iron Golem's slam attack also makes enemies Vulnerable for 3 seconds\n3. Sacrifice - You deal x30% increased Critical Strike Damage, but you lose the ability to summon a Golem.\n\nHash Tags: #summergamefest, #diablo4, #d4\n\nTimestamps:\n0:05 Intro\n0:15 Necromancer Single Golem Gameplay\n1:25 Necromancer Skeletal Mages and Warriors Open Fields Gameplay\n2:52 Necromancer Book of Dead Skills\n3:11 Necromancer Iron Golem And Skeletons Dungeon Gameplay\n6:25 PvP Gameplay\n8:47 Open World Boss Gameplay", "link": "https://www.youtube.com/watch?v=_lf3aE3h5DE", "date_published": "2022-06-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "EXOPRIMAL Official Gameplay Trailer | Capcom Showcase 2022", "description": "Capcom revealed an all new gameplay trailer for its team based action game Exoprimal. The presentation showed off specific missions like Dino Survival, and unique abilities players will have to use to execute their objectives. Dino Survival is different every time you play it, and will adjust in difficulty based on how well you and your team are playing. There are different kinds of dinosaurs that'll force players to constantly change strategy. A closed network test is on its way. The game is expected to release in 2023.\n\n#exoprimal #gaming #capcom", "link": "https://www.youtube.com/watch?v=TIRxTo0FScs", "date_published": "2022-06-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Exoprimal Full Presentation | Capcom Showcase 2022", "description": "Capcom revealed an all new gameplay trailer for its team based action game Exoprimal. The presentation showed off specific missions like Dino Survival, and unique abilities players will have to use to execute their objectives. Dino Survival is different every time you play it, and will adjust in difficulty based on how well you and your team are playing. There are different kinds of dinosaurs that'll force players to constantly change strategy. A closed network test is on its way. The game is expected to release in 2023.\n\n#exoprimal #capcom #gaming", "link": "https://www.youtube.com/watch?v=A0Ux0l2hdag", "date_published": "2022-06-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Guerrilla Collective 3.5 Livestream", "description": "Guerrilla Collective 3.5 is a digital games showcase to reveal fresh indie game announcements, trailers, and gameplay. A Steam event page for wishlisting, demos, game ordering and more will be available. Guerrilla Collective is bringing together many of the hottest developers and publishers from around the world!\n\n#gaming #guerrillacollective", "link": "https://www.youtube.com/watch?v=udEuaaILaq8", "date_published": "2022-06-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "How Sonic Frontiers Brings Sonic Into An Open World - Developer Interview | Summer Game Fest 2022", "description": "We sat down with Takashi Iizuka, Creative Officer at Sonic Team, to discuss the Sonic Frontiers demo, the new direction for the franchise, its open world inspirations and, most importantly, find out exactly how fast Sonic can go.\n\nIn this Summer Game Fest interview, Jordan spoke to Takashi Iizuka, one of producers of Sonic Frontiers, about the process of designing a Sonic the Hedgehog open world game, as well as the game's combat system, puzzle sections and story.\n\nSonic Frontiers is slated for release Holiday 2022 on PC, Nintendo Switch, PlayStation 4/5, Xbox One and Series X/S consoles. For more Summer Game Fest coverage, stay tuned to GameSpot.\n\n#SummerGameFest #SonicFrontiers", "link": "https://www.youtube.com/watch?v=UKV_iPCmzfY", "date_published": "2022-06-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "JoJo's Bizarre Adventure: All-Star Battle R Gameplay | Summer Game Fest 2022", "description": "JoJo's Bizarre Adventure is coming back to gaming with JoJo's Bizarre Adventure: All-Star Battle R. All-Star Battle R is a remaster of 2013's JoJo's Bizarre Adventure: All Star Battle, which will include additional content. The game releases to Nintendo Switch, Playstation 4, Playstation 5, Xbox One, Xbox Series X/S, and PC on September 2, 2022.\n\n#summergamefest #jojosbizarreadventure #gaming", "link": "https://www.youtube.com/watch?v=h-qBHqnK9aw", "date_published": "2022-06-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Monster Hunter Rise: Sunbreak - A New Frontier Official Gameplay Trailer", "description": "Venture into a lush locale, the Jungle, as your quest to save the Kingdom brings you face to face with dangerous new monsters in Monster Hunter Rise: Sunbreak.\n\nPlus, sneak a glimpse at what awaits you beyond #Sunbreak's launch on June 30th with our first free title update…\n\nMonster Hunter Rise: Sunbreak arrives on Nintendo Switch on June 30, 2022.", "link": "https://www.youtube.com/watch?v=n3De5zeewqw", "date_published": "2022-06-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Monster Hunter Rise: Sunbreak Full Presentation | Capcom Showcase 2022", "description": "Monster Hunter Rise: Sunbreak is the latest expansion to the monster hunting epic. Sunbreak will bring new monsters to the game, including retruning ones like Gore Magala, which means new armor and weapon types. The trailer also shows off a new menacing dragon that players will have to overcome. Additionally, the game receives a new jungle area. Monster Hunter Rise: Sunbreak is expected to release June 30, 2022 for Nintendo Switch and PC.\n\n#monsterhunter #capcom #gaming", "link": "https://www.youtube.com/watch?v=eeQnIqtKloA", "date_published": "2022-06-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Redfall is Much More Than Another Left For Dead | Summer Game Fest 2022", "description": "We sat down with one of Redfall's directors, Harvey Smith, to talk about its new open world co-op vampire shooter Redfall.\n\nRedfall is Arkane Austin's latest open world co-op vampire hunting shooter. During Summer Game Fest 2022, Lucy James and Tamoor Hussain sat down with one of Redfall's directors Harvey Smith to talk about the game, its mechanics, and the DNA it was founded on. In the above interview, Harvey gives insights to the game's identity, including its distinct take on vampires. \n\nRedfall may be a step-away from Arkane's signature take on single-player immersive sims, but Harvey details how much of Arkane's identity remains in the game, including dynamic dialogue, a heavy emphasis on lore, and giving the players the ability to approach situations in their own way. Redfall is expected to release in 2023. More in-depth look was revealed during the 2022 Xbox & Bethesda Games Showcase.", "link": "https://www.youtube.com/watch?v=5rLqCa5iyME", "date_published": "2022-06-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil 4 Full Presentation and Gameplay | Capcom Showcase 2022", "description": "Resident Evil 4 is returning for an all new generation. During the 2022 Capcom Showcase, we get a further look into the remake. During the presentation, the game's director and producer detailed the game as a reimagining. They showed off some over the shoulder gameplay, showing protagonist Leon S. Kennedy walking and aiming through a grimy village.\n\n#residentevil4 #capcom #gaming", "link": "https://www.youtube.com/watch?v=uKem94wrsnA", "date_published": "2022-06-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil 7,2,3 Official Next-Gen Launch Trailer", "description": "Resident Evil 2, 3, and 7 are all getting a next gen upgrade. Check out the trailer showcasing the various games in their new updated state.\n\nResident Evil 2, Resident Evil 3 and Resident Evil 7 biohazard are coming to new-generation consoles! These three masterpieces developed using the RE Engine are back with cutting–edge features including ray tracing, high frame rate and 3D audio for an enhanced gameplay experience.\n\n#gaming #residentevil #capcom", "link": "https://www.youtube.com/watch?v=RErfRVmN_xw", "date_published": "2022-06-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Full Presentation | Capcom Showcase 2022", "description": "Resident Evil Village is returning with brand new DLC. Set 16 years after the events of Resident Evil Village, Ethan Winters' daughter, Rosemary, returns to the village to find answers. The DLC is called Shadows of Rose. The presentation also announced new additions to Mercenaries mode, including the ability to play as Lady Dimitrescu herself. Additionally, a third person mode is coming to Village, allowing the player to play Ethan Winters from an all new angle.\n\nResident Evil 4 is returning for an all new generation. During the 2022 Capcom Showcase, we get a further look into the remake. During the presentation, the game's director and producer detailed the game as a reimagining. They showed off some over the shoulder gameplay, showing protagonist Leon S. Kennedy walking and aiming through a grimy village.\n\nResident Evil 2 Remake, Resident Evil 3 Remake, and Resident Evil 7: Biohazard are coming to PS5 and Xbox Series X|S with new gen upgrades. The updates are available now. \n\n#residentevil #capcom #gaming \n\nTimestamps:\n0:01 Resident Evil Village Updates\n6:39 Resident Evil 4 \n11:36 Resident Evil Next Gen Updates for 2, 3, and 7", "link": "https://www.youtube.com/watch?v=KSeQtc7qhKQ", "date_published": "2022-06-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village Gold Edition Official Announcement Trailer", "description": "Resident Evil Village Gold Edition includes the base game with 3 additional major new features, including the new story content Shadows of Rose. Third Person Mode allows you to play the main story mode from a new perspective. The Mercenaries Additional Orders introduces new playable characters and stages including Lady Dimitrescu. Shadows of Rose continues the story of Ethan's daughter Rosemary\n\n#residentevil #capcom #gaming", "link": "https://www.youtube.com/watch?v=BQMGFlZCcuU", "date_published": "2022-06-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village New DLC, Mercenaries Update, and More | Capcom Showcase 2022", "description": "Shadows of Rose is the all new expansion to Resident Evil Village where you play as Ethan Winters' daughter, Rosemary. Additionally, Mercenaries is getting new playable characters including Chris Redfield, Hesisenberg, and Lady Dimitrescu. Lastly, the game will have third person mode. It is expected to be released in 2022. We learned all this during the recent Capcom Showcase 2022.\n\n#capcom #residentevil #gaming", "link": "https://www.youtube.com/watch?v=QY0m6MT9fwI", "date_published": "2022-06-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sonic Frontiers Hands On Reactions | Summer Game Fest 2022", "description": "We got some hands on time with Sonic Frontiers, the new open world entry to the Sonic franchise, at the Summer Game Fest Play Days event. Playing 15 minutes each, Dave and Jordan were able to explore, test the new combat system in boss battles and solve some puzzles to give their first impressions of the game.\n\nDrawing clear inspiration from open world games like The Legend of Zelda: Breath of the Wild, Sonic Frontiers takes Sonic in a new direction for the franchise, with open exploration, more intricate combat mechanics and puzzles to solve. In the above video, Jordan and Dave discuss their first impressions, hopes and fears for Sonic Frontiers, and get an early sense for where Sonic Frontiers might be heading.\n\n#SonicFrontiers #SummerGameFest", "link": "https://www.youtube.com/watch?v=6VBRs0aG_W4", "date_published": "2022-06-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Callisto Protocol: Next-Gen Horror | Summer Game Fest 2022 Interview", "description": "GameSpot's very own Lucy James had a chance to chat with Glen Schofield, the man behind hit games like: Dead Space, Call of Duty: Advanced Warfare, Lord of the Rings: Return of the King, and Gex 3D: Enter the Gecko about his upcoming game, The Callisto Protocol. The Callisto Protocol releases December 2, 2022 to PS5, PS4, Xbox Series X, Xbox One, and PC.\n\nThe Callisto Protocol is an upcoming horror game which looks similar to Dead Space, but was inspired by the world of PUBG. In this video interview, he discusses the design process behind Callisto Protocol, and what went into the creation of the terrifying world.\n\n#callistoprotocol #summergamefest #gaming", "link": "https://www.youtube.com/watch?v=q_9FcKpaJWs", "date_published": "2022-06-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Capcom Showcase Livestream 2022 | Summer Game Fest 2022", "description": "Tune into the Capcom Showcase 2022 on June 13th, at 3PM PT for the latest Capcom game information. The showcase will run for around 35 minutes give viewers a deeper dive into details and news on previously announced titles including Exoprimal, Resident Evil 4, and Monster Hunter Rise: Sunbreak.\r\n\r\n#Capcom #Gaming #summergamefest", "link": "https://www.youtube.com/watch?v=jGjgRcCA_T8", "date_published": "2022-06-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Warhammer 40,000 Darktide Hands On Preview - How Is It Different From Left 4 Dead & Vermintide?", "description": "We got some hands on with Warhammer 40,000 Darktide, the upcoming Grimdark 4-player co-op action game set in the 40k universe. Phil and Lucy explore what makes Darktide different from games like Vermintide and Back 4 Blood, how non-Warhammer fans might get into the game, how the classes, powers and personalities of the game works, and how big an Ogryn's knife is.\nDarktide releases on the 13th of September for PC and Xbox Series X|S.\n\n#summergamefest #warhammer40k", "link": "https://www.youtube.com/watch?v=6J_ymfyijHI", "date_published": "2022-06-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Why Pentiment Is Fallout New Vegas Designer’s Dream Project | Summer Game Fest 2022", "description": "We sat down with Josh Sawyer to talk about Pentiment, a historical mystery narrative game from Obsidian Entertainment.\n\nPenitment is the new medieval narrative mystery game from Obsidian Entertainment, the developers responsible for Outer Worlds and Grounded. Tamoor Hussain sat down with the game's director Josh Sawyer, and talked about the game's distinctive art style, its emphasis on real history, and writing a medieval mystery game.\n\nJosh Sawyer gives insight to his desire to create a historical narrative game, an idea that he's been wanting to make for nearly 20 years. In the interview, he talks about the game's inspiration, which includes titles such as Night In The Woods and Oxenfree. He also talks about the importance of Xbox Game Pass, and how the service allows for more room in the gaming space and isn't just AAA blockbusters. Pentiment was revealed during the 2022 Xbox & Bethesda Games Showcase.", "link": "https://www.youtube.com/watch?v=1sFsO6MrtAs", "date_published": "2022-06-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "A Plague Tale  Requiem - End of Innocence Gameplay Trailer | Xbox & Bethesda Games Showcase 2022", "description": "We got a dark and gruesome look at the upcoming installment in the Plague Tale saga, A Plague Tale: Requiem. The new gameplay trailer gives a different and darker look at Amicia, who appears much more ruthless than the first. The game is expected to release winter 2022.\n\n#plaguetale #xbox", "link": "https://www.youtube.com/watch?v=8WKf_tqrc6g", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Ark 2 Cinematic Trailer | Xbox & Bethesda Games Showcase 2022", "description": "This prehistoric sequel to Ark: Survival Evolved staring Vin Diseal will be available 2023.\n\nSurvive the past. Tame the future. Suddenly awakened on a primal world filled with dinosaurs and humans struggling for dominance, you must team-up with legendary heroes to confront powerful dark forces. Saddle up, and join the definitive next-gen survival experience with ARK 2!\n\n#ark2 #xbox #gaming", "link": "https://www.youtube.com/watch?v=USSr_UDQr-M", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best Xbox & Bethesda Games Showcase Trailers", "description": "We picked some of our favorite trailers from the latest Xbox and Bethesda Games showcase. Check out the trailers in the timestamps below!\n\n#xbox #bethesda #summergamefest\n\nTimestamps\n0:00 Intro\n0:05 Starfield\n14:53 Wo Long Fallen Dynasty\n16:16 Forza Motorsport\n17:22 Forza Motorsport Gameplay Overview\n22:44 Hollow Knight Silksong\n23:53 Diablo 4 Necromancer Cinematic\n26:25 Diablo 4 Gameplay Trailer\n30:58 Plague Tale Requiem Gameplay Trailer\n32:51 Ark 2 Cinematic\n33:58 Overwatch 2 Release Date Trailer\n35:49 Persona Collection Trailer\n37:18 Redfall Gameplay Trailer", "link": "https://www.youtube.com/watch?v=K-RvcOBD2aM", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cuphead: The Delicious Last Course Hands-On Reaction | Summer Game Fest 2022", "description": "Cuphead: The Delicious Last Course's Ms. Chalice makes playing Cuphead that little bit easier. Join Dave and Phil as they break down their thoughts after getting hands on with the new Cuphead DLC.\n\nCuphead's Ms. Chalice acts as an easier on ramp for people looking to get into the notoriously difficult Cuphead. In the above video, Dave and Phil chat about how Ms. Chalice plays compares to Cuphead and Mugman, and how her extra health and double jump ability make the game's bosses slightly easier. \n\nCuphead: The Delicious Last Course releases on June 30th for PC, PS4, Xbox One, Mac, and Nintendo Switch.\n\n#summergamefest  #cuphead", "link": "https://www.youtube.com/watch?v=R4YFflfVnHc", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Diablo 4 Full Presentation | Xbox & Bethesda Showcase", "description": "Learn more about Diablo IV in this latest presentation at the Xbox & Bethesda showcase which reveals a new class the Necromancer, as well as a look at gameplay!\n\n#diablo4 #xbox #summergamefest", "link": "https://www.youtube.com/watch?v=sAgxtg3FgvY", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Diablo 4 Is All About Player Choice - Developer Interview", "description": "Blizzard’s Joe Shely and Rod Fergusson speak about the studio’s upcoming game, Diablo 4. The developers break down the new additions to the Necromancer class as well as how important player choice is throughout the story and beyond.\n\nLearn more about the Nightmare Dungeons the new Diablo 4 end game, as well as all the various choices and freedoms you'll have in the game.\n\n#diablo4 #summergamefest #gaming", "link": "https://www.youtube.com/watch?v=xHaHRuP53X0", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Diablo 4 Official Gameplay Showcase Trailer | Microsoft & Bethesda Games 2022", "description": "Get a glimpse of some brand new gameplay of Diablo IV that was showcased during the Microsoft & Bethesda showcase. All the footage in the trailer was captured on an Xbox Series X. They showcase character customization so that you can make a character thats unique to you visually. They also talk about the Open World that speaks to no linear path that a player has to follow. \n\nAdditionally we hear about strongholds that we have to reclaim, which becomes a friendly town to you. We get a look at local events and a first look at a new world boss. The game has cross play at least between Xbox and PC, as specified in the trailer. PvP also makes its return, as well as Paragon points which has been reimagined.\n\n#summergamefest #diablo4 #gaming", "link": "https://www.youtube.com/watch?v=c_VkpXudWf4", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Diablo 4 Official Necromancer Cinematic Trailer | Xbox & Bethesda Showcase 2022", "description": "The Necromancer class was announced for Diablo IV at this years Xbox & Bethesda Summer Showcase. Get a glimpse of this brand new cinematic trailer showcasing the Necromancer. Command the dead with the final playable class in Diablo IV.\n\n#summergamefest #diablo4 #gaming", "link": "https://www.youtube.com/watch?v=_lqlyqSzXNI", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Escape Academy: The Hogwarts of Room Escapes | Summer Game Fest 2022", "description": "We got some hands on time with Escape Academy, and upcoming Room Escape game created by former Escape Room designers. After the lockdown, the designers wanted to keep making escape rooms, and found themselves delving into digital escape games. Dave and Jordan were able to co-op and solve the puzzles to give their first impressions of the game.\n\nWhile Room Escape games have existed ever since the advent of Flash, with games like Crimson Room starting the trend, we haven't seen physical escape room designers attempt a digital escape room like this before. The game is built with co-op in mind, just like real life escape rooms, meaning their are plenty of puzzles that are built with the idea of playing with friends. The puzzle types vary through-out rooms, and there are often timers giving players a sense of urgency. Jordan and Dave discuss their utter joy at where the game seems to be heading.\n\n#summergamefest #escapeacademy #gaming", "link": "https://www.youtube.com/watch?v=WlO4bSBxS5I", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Every Reveal for The Xbox & Bethesda Showcase in 10 Minutes", "description": "Don't want to sit through the entire Xbox and Bethesda Showcase? Don't worry, we got you. Here's everything you need to see from Starfield to Diablo IV in under 10 minutes.\n\nHere are all the games shown off in order!\nRedfall\nHollow Knight: Silk Song\nHigh On Life\nA Plague Tale: Requiem\nForza Motorsport\nFlight Simulator\nOverwatch 2\nAra: History Untold\nThe Elder Scrolls Online: High Isle\nFallout 76: The Pitt\nForza Horizon 5: Hot Wheels\nArk 2\nScorn\nFlintlock: The Siege of Dawn\nLightyear Frontier\nGunfire Reborn\nThe Last Case of Benedict Fox\nAs Dusk Falls\nNakara Bladepoint\nPentiment\nGrounded\nDiablo IV\nCocoon\nWo Long Fallen Dynasty\nPersona\nStarfield\n\n#xbox #gaming", "link": "https://www.youtube.com/watch?v=bN4dqGVnrGE", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "F1 22 Wide-Screen Gameplay | Summer Game Fest 2022", "description": "Check out over 10 minutes of F1 22 gameplay captured at Summer Games Fest 2022. This includes a race in dry condition as well as a first place win during rainy weather.\n\nF1 22 features redesigned cars, overhauled rules and features an all new Pirelli Hot Laps feature. Players can race head-to-head in split-screen multiplayer or play solo and take on the My Team career mode.\n\nF1 22 will be available for PS4, PS5, Xbox One, Xbox Series X|S, and PC on June 28, 2022. \n\n#F122 #summergamefest", "link": "https://www.youtube.com/watch?v=Z0CjEZf08s8", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Flintlock: The Siege of Dawn Gameplay Trailer | Xbox & Bethesda Games Showcase 2022", "description": "In this new trailer for Flintlock, third person action adventure, we get a look at the game's various combat senarios.  \n\n#xbox #flintlock #summergamefest", "link": "https://www.youtube.com/watch?v=qdXzSBTAa7w", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Forza Motorsport Official Gameplay Demo Trailer | Xbox & Bethesda Showcase 2022", "description": "Witness the power of Xbox Series X through Forza Motorsport. Automotive entertainment is reimagined for a new generation.\n\n#forzamotorsport #xbox #summergamefest", "link": "https://www.youtube.com/watch?v=04Fw1TsVxxg", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Forza Motorsport Official Trailer | Xbox & Bethesda Games Showcase 2022", "description": "Forza Motorsport, the latest racing simulation from Turn 10 Studios, gets a new gameplay trailer. Forza Motorsport will be available in Spring 2023.\n\n#forzamotorsport #xbox", "link": "https://www.youtube.com/watch?v=PyQCBCEI7dQ", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "HIGH ON LIFE Official Game Trailer | Xbox & Bethesda Games Showcase 2022", "description": "From the creator of Rick and Morty, Justin Roiland, comes a first person sci-fi comedy shooter, where your guns... talk to you? High On Life will be a console exclusive for Xbox Series X|S.\n\n#xbox #highonlife #gaming", "link": "https://www.youtube.com/watch?v=kx56ecTCbOU", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Half-Life Alyx Levitation Mod Gameplay Trailer | PC Gaming Show", "description": "Take a look at an extensive gameplay section from the Half-Life Alyx: Levitation Mod, a fan made project with a new 4-5 hour campign building on GameSpot's Game Of The Year from 2020. \n\nHalf-Life Alyx mod Levitation was made by modders FMPONE and Corey Laddo. \n\n#halflife #pcgamingshow #gaming", "link": "https://www.youtube.com/watch?v=0De4urRohDI", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Hollow Knight: Silksong Trailer | Xbox & Bethesda Games Showcase 2022", "description": "Hollow Knight: Silksong, the long awaited much anticipated Metroidvania, is coming to Gamepass on day one. \n\n#hollowknight #xbox", "link": "https://www.youtube.com/watch?v=0MbJnZOvjg8", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Minecraft Legends Announcement Trailer | Xbox & Bethesda Games Showcase 2022", "description": "Mojang, the creators of Minecraft, return with an all new game set in the Minecraft universe: Minecraft Legends, a new action strategy game. \n\n#xbox #minecraft", "link": "https://www.youtube.com/watch?v=vwco_HCnnV4", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 Free To Play and New Hero Announcement Trailer | Xbox & Bethesda Showcase", "description": "Overwatch 2 announces that they are going free to play in early access on October 4th! This big announcement was made as part of the Xbox and Bethesda Showcase. Additionally, we got a look at a brand new character the Junker Queen who will making her way to Overwatch 2! \n\nOverwatch 2 changes up the original Overwatch formula by dropping a tank and making it 5 versus 5!\n\n#summergamefest #overwatch2", "link": "https://www.youtube.com/watch?v=kpYPcwOu7vc", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 Junker Queen Cinematic Teaser Trailer | Xbox & Bethesda Games Showcase 2022", "description": "Check out a Overwatch 2 cinematic teaser trailer for the Junker Queen who was revealed today as part of the Xbox & Bethesda showcase. Additionally, Overwatch 2 is going free to play on October 4th for early access.\n\n#overwatch2  #junkerqueen #xbox", "link": "https://www.youtube.com/watch?v=jzITytCUahM", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PC Gaming Show Livestream 2022", "description": "Tune into the PC Gaming Showcase Presented by PC Gamer on Sunday, June 12 at 12:30pm PDT. The event will showcase never-before-seen gameplay, new trailers, interviews with developers, and announcements from across the world of PC gaming.  The PC Gaming show will be hosted by Sean Day9 Plott and Mica Burton. \n\n#PCGamer #Gaming #summergamefest", "link": "https://www.youtube.com/watch?v=YUy2Ht_lFog", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Persona Collection Trailer | Xbox & Betheasda Games Showcase 2022", "description": "The beloved Persona franchise is finally making its way to Xbox consoles. For the first time ever, Persona's mainline titles Persona 3, Persona 4, and Persona 5 Royal is not exclusive to PlayStation. They'll ba available on Xbox Game Pass this year.\n\n#xbox #atlus #persona #gaming", "link": "https://www.youtube.com/watch?v=5b8YoPy7IEU", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Redfall Official Extended Gameplay Reveal Trailer | Xbox & Bethesda Games Showcase 2022", "description": "Kicking off Xbox + Bethesda Showcase 2022 was our first look at Redfall. Arkane, the developers behind Deathloop, Dishonored, and Prey, are trying its hand at co-op vampire slaying. The extended gameplay trailer shows off characters and their unique abilities, as well as the open world players will be exploring.\n\n#redfall #xbox", "link": "https://www.youtube.com/watch?v=wUDHAhq4CXY", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Scorn New Gameplay & Release Date Trailer | Xbox & Bethesda Games Showcase 2022", "description": "The first person horror adventure shooter Scorn got an all new trailer during the Xbox & Bethesda Games Showcase, showing off body horror, gore, and its darkly distinct world. Scorn is expected to release October 21 exclusively for Xbox Series X|S and PC.\n\n#scorn #xbox", "link": "https://www.youtube.com/watch?v=L52bwGkJZsc", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Scorn Official Gameplay Trailer | PC Gaming Show 2022", "description": "Get a brief gameplay overview of Scorn. This was showcased during the PC Gaming Showcase. \n\nGet a fresh look at the horrifying labyrinth that awaits you in Scorn on 21 October 2022. \n\nAwoken in a desolate hellscape, explore a once industrial civilization that now lay in ruin. Surrounded by nightmarish bio-mechanical contraptions you’ll search for unsettling answers to find a way forward.\n\n#scorn #pcgamingshow #gaming", "link": "https://www.youtube.com/watch?v=qVrfvIbJkqg", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sea of Thieves Captains of Adventure Official Season Seven Trailer | Xbox & Bethesda Showcase", "description": "The games-as-service pirate adventure Sea of Thieves showed off the glory of sailing the seas, and the launch of its latest seventh Season, which is expected to launch in July.\n\n#seaofthieves #xbox #gaming", "link": "https://www.youtube.com/watch?v=HDoT0g2NF50", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Starfield Character Customization, Crafting, Skill Trees and Ship Building Gameplay", "description": "During the extended look at Bethesda's highly anticipated intergalactic RPG Starfield, we got insight into the game's customization. In Starfield, you'll have to completely build and customize your ship, create space bases, and craft items. Additionally, we got a brief look at the game's in-depth skill tree for your character. Starfield is expected to release in 2023.\n\n#starfield #xbox #gaming", "link": "https://www.youtube.com/watch?v=G25PGibzJzk", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Starfield Exploration and Combat Gameplay | Xbox & Bethesda Games Showcase 2022", "description": "During the extended look at Bethesda's highly anticipated intergalactic RPG Starfield, we got insight into the game's exploration and combat. From first and third person perspectives, we got a glimpse of roaming around a planet and its various wildlife. Then gunplay through tight corridors, and some grounded realism in the guns. Starfield is expected to release in 2023.\n\n#starfield #xbox", "link": "https://www.youtube.com/watch?v=4xrNc9mWS38", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Starfield NPCs And New Atlantis Gameplay | Xbox & Bethesda Showcase", "description": "During the extended look at Bethesda's highly anticipated intergalactic RPG Starfield, we got insight into the game's NPCs and one of its main hub areas, New Atlantis. The personalities that populate Bethesda's games is one of the studios defining traits, and thankfully Starfield seems to have heaping amounts. Starfield is expected to release in 2023.\n\n#starfield #xbox", "link": "https://www.youtube.com/watch?v=s5kaS1eS-KY", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Starfield Official Gameplay Reveal | Xbox & Bethesda Showcase 2022", "description": "Bethesda's long awaited intergalactic RPG finally gets a gameplay reveal. We get a look at in-game environments,   gunplay, characters, a glimpse of its story, and its in-depth character creator, including specific body trais, and even how you walk. Starfield is expected to release in 2023. \n\n#starfield #xbox #summergamefest", "link": "https://www.youtube.com/watch?v=ZHZOTFMyMyM", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Starfield Space Combat Gameplay | Xbox & Bethesda Games Showcase 2022", "description": "Check out some of the space combat you'll experience in Starfield in this latest gameplay clip that was shown during the Xbox & Bethesda Showcase. \n\n#starfield #xbox", "link": "https://www.youtube.com/watch?v=3UKX1F17rJ8", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Starfield Worlds And Scale Gameplay | Xbox & Bethesda Games Showcase 2022", "description": "Bethesda gave an in-depth look at the game's scope and size, including the many many galaxies you'll be able to travel to and explore. Each world is a fully realized planet that you can land on traverse. Starfield is expected to release in 2023.\n\n#starfield #xbox", "link": "https://www.youtube.com/watch?v=HYh7oVwikcY", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Street Fighter 6 High Level Gameplay (Hardest CPUs)", "description": "At Summer Game Fest, we pit two rank 8 CPU's against each other to duke it out in Street Fighter 6 at the highest level. \n\nYou'll get to see matches with Jamie, Ryu, Chun Li and Luke which were the four playable characters at Summer Game Fest's Play Days.  We got a chance to record these high level CPU matches at the Capcom booth for your viewing pleasure. Watch some of these intense combos from the 4 characters! \n\nYou'll get to see the new Drive System in play as well. With the Drive Gauge you are able to perform five different techniques that can enhance your offense or defense. Drive Impact is a powerful strike that can absorb an opponent’s incoming attack and can lead to a wall splat. Drive Parry is used to repel your opponent’s attack and refill your Drive Gauge. Additionally, you can cancel your Drive Parry or normal attack into a Drive Rush to quickly close in on your opponent. Overdrive Arts are similar to EX Moves from previous Street Fighter games that strengthen your Special Moves. Finally the fifth option in the new Drive System, is Drive Reversal which allows you to perform a counterattack to get you out of difficult situations. \n\nYou'll also get to see some critical arts in play as well.\n\n#summergamefest #sf6 #streetfighter6", "link": "https://www.youtube.com/watch?v=dQqzSI_4qb4", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "System Shock Trailer and Interview With Warren Spector | PC Gaming Show 2022", "description": "Check out a brand new trailer for the upcoming System Shock remake from Nightdive Studios, followed by an interview with Warren Spector, produce of the original System Shock.\n\n#systemshock #pcgamingshow", "link": "https://www.youtube.com/watch?v=SIBaVoVelnU", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Warhammer 40,000: Space Marine 2 Overview with Tim Willits and Oliver Hollis | PC Gaming Show 2022", "description": "Day9 chats with Tim Willits and Oliver Hollis about upcoming third-person shooter Warhammer 40K: Space Marine 2. \n\nWarhammer 40,000: Space Marine 2 is an upcoming third-person shooter hack-n-slash video game being developed by Saber Interactive and published by Focus Entertainment. It will be released for Microsoft Windows, PlayStation 5 and Xbox Series X/S at a date that is yet to be announced.\n\n#warhammer40k #pcgamingshowcase #wh40k", "link": "https://www.youtube.com/watch?v=PPXaRgrsIlY", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Wo Long Fall Dynasty Reveal Trailer | Xbox & Bethesda Games Showcase 2022", "description": "Wo Long Dynasty is coming from Koei Tecmo and is slated to release in 2023. This was showcased during the Xbox & Bethesda summer showcase.\n\n#wolongdynasty #xbox #summergamefest", "link": "https://www.youtube.com/watch?v=BUxaxgYwzns", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xbox + Bethesda Games Showcase 2022 Livestream", "description": "Watch the Xbox & Bethesda Games Showcase airing Sunday, June 12--it starts at 10 a.m. PDT. This Xbox Showcase 2022 will feature upcoming titles coming from various Xbox Game Studios, Bethesda, and our partners from around the world.\n\nThe Xbox Bethesda Games show will run for approximately 95 minutes and will include everything you need to know about the diverse lineup of games coming to Xbox's ecosystem, as well as upcoming releases to Game Pass on PC and Xbox. We're hoping to see new updates for Starfield, Redfall, Forza Motorsport, and much more at the Xbox and Bethesda Games Showcase.\n\n#Xbox #Bethesda #summergamefest", "link": "https://www.youtube.com/watch?v=f4x04IMjTb4", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xbox Games Studios + Kojima Productions Announcement | Xbox & Bethesda Games Showcase 2022", "description": "Hideo Kojima announces he is teaming up with Xbox Game Studios to create a brand new game. This announcement comes from the Xbox & Bethesda Games Summer Showcase 2022.\n\n#xbox #kojima #gaming", "link": "https://www.youtube.com/watch?v=6jzi5mgPKGw", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xbox and Bethesda Showcase + PC Gaming Show 2022 Livestream", "description": "Tune into the Xbox and Bethesda Games Showcase on Sunday, June 12 at 10 a.m. PT. This showcase will feature amazing titles coming from Xbox Game Studios, Bethesda, and our partners around the world. The Xbox Bethesda Showcase will include everything you need to know about the diverse lineup of games coming soon to the Xbox ecosystem, including upcoming releases to Game Pass on Xbox and PC. \r\n\r\nAt 2 p.m. PT is the PC Gaming Showcase which will showcase never-before-seen gameplay, interviews with developers, and announcements from across the world of PC gaming.  The show will be hosted by Sean Day9 Plott and Mica Burton. \r\n\r\n#Xbox #Bethesda #PCGamer #SummerGameFest", "link": "https://www.youtube.com/watch?v=Pgu_M6XJOGM", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]