[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "11 Biggest Game Releases For May 2022", "description": "April showers bring May games and this May has a little something for everyone. From slashing and shooting to racers and platforming, you’re bound to love at least one of these. Here is a list of the biggest games releasing in May 2022.\n\nSTAMPS\n00:00 - Intro\n00:16 - Sniper Elite 5\n01:01 - Evil Dead: The Game\n01:54 - Salt and Sacrifice\n02:33 - Trek to Yomi\n03:18 - Dolmen\n04:02 - Deliver Us The Moon\n04:33 - Vampire: The Masquerade - Swansong\n05:10 - Kao the Kangaroo\n05:47 - Pac-Man Museum + \n06:37 - Souliders\n07:12 - SnowRunner", "link": "https://www.youtube.com/watch?v=PpVjZziUwkY", "date_published": "2022-04-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Free PS Plus Games For May 2022 Revealed | GameSpot News", "description": "PlayStation Plus Free Games For May 2022 Might Have Leaked Early, More Evidence For The Last Of Us Remake Appears Online, and Call Of Duty: Vanguard Adds Ricochet Anti-Cheat, 54,000 More Accounts Banned. \n#GamingNews #PS5 #PSPlus\n\nAccording to the leak, the PS Plus lineup for May 2022 includes FIFA 2022, Curse of the Dead Gods, and Tribes of Midgard. May's batch of free games could be the last before the revamped PS Plus subscription launches in June with three tiers.   \n\nA new LinkedIn listing has provided more clues to the unannounced remake of The Last of Us. Credits for \"QA testing and development support + Level Point of Contact for unannounced remake project\" were found on the resume of a Naughty Dog QA employee.\n\nCall of Duty's new anti-cheat software, Ricochet, is now available for Call of Duty: Vanguard. The kernel-level PC driver launched in 2021 for Call of Duty: Warzone, and now it's available in the latest mainline entry in the series.\n\nSTAMPS\n00:00 - Intro\n00:06 - PS Plus Games\n01:04 - Last of Us Remake\n01:56 - Call of Duty", "link": "https://www.youtube.com/watch?v=GE6C-xfGf5E", "date_published": "2022-04-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 Beta Gameplay Livestream", "description": "We check out the Overwatch 2 beta, featuring 4 new maps and the new hero, Sojourn.\n\n#Overwatch", "link": "https://www.youtube.com/watch?v=pQOOFJaR9zM", "date_published": "2022-04-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends: Saviors - Official Cinematic Trailer", "description": "Check out what's coming next in Apex Legends with the reveal of Newcastle (Bangalore's brother Jackson), the next legend! Learn more in the coming days when the next Story from the Outlands drops as well on April 28th, 2022. \n\n#ApexLegends", "link": "https://www.youtube.com/watch?v=5ezttJANRCc", "date_published": "2022-04-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dune Spice Wars Hands-on Preview", "description": "The 1965 sci-fi novel Dune is enduring for a lot reasons. It takes place in a world rife with political intrigue and fearsome spycraft, where trust is just as valuable as the spice found on the planet Arrakis. That makes Dune fertile ground for the 4X approach to strategy games--Shiro Games' Dune: Spice Wars tries to leverage these multitudes to give players a whole lot more to keep track of than just the enemy soldiers amassing on your borders.", "link": "https://www.youtube.com/watch?v=wBSdkSPDdWo", "date_published": "2022-04-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Demake For Game Boy Coming | GameSpot News", "description": "Elden Ring Is Being Demade For An Actual Game Boy, Infinity Ward Seemingly Teases Modern Warfare 2 and Diablo Immortal Release Date Confirmed. \n\nReddit user Shintendo announced a demake of Elden Ring on the game’s subreddit and even posted a clip of the opening area and boss fight. Shintendo revealed they intend to show how they developed Elden Ring for actual Game Boy hardware on Twitch and archive it on their Youtube channel.\n\nInfinity Ward's social media pages have gone dark in an apparent viral marketing campaign to promote this year's Call of Duty: Modern Warfare 2. Activision Blizzard management shared some additional morsels about both projects, confirming that Modern Warfare 2 is the \"most advanced\" entry in the series so far. Activision also boasted that Warzone 2, or whatever the new game is called, will feature \"groundbreaking\" innovations.\n\nDiablo Immortal is set to launch on both iOS and Android on June 2. une 2 will also mark the beginning of an open beta test for the newly revealed PC version of the game, which will support full cross-progression with both iOS and Android.\n\nSTAMPS\n00:00 - Intro\n00:07 - Elden Ring\n00:58 - Modern Warfare 2\n02:05 - Diablo Immortal", "link": "https://www.youtube.com/watch?v=3iI_3rNyqV0", "date_published": "2022-04-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]