[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Exxon Urged Removal of US Gov't Climate Change Scientist in 2001 | The Power of Big Oil | FRONTLINE", "description": "Watch an excerpt from part two of “The Power of Big Oil,” a three-episode FRONTLINE docuseries investigating the fossil fuel industry’s history of casting doubt and delaying action on climate change. \n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate. \n\nPart two of \"The Power of Big Oil,\" “Doubt,” premieres April 26 on PBS and online: https://to.pbs.org/3EKCccm\n\nPart one, “Denial,” is now streaming: https://bit.ly/3xTxYhg\n\nPart three, “Delay,” premieres May 3 on PBS and online: https://to.pbs.org/3rByEEe\n\n“The Power of Big Oil” is a FRONTLINE Production with Mongoose Pictures in association with BBC and Arte. The series producer is Dan Edge. The producer and director of episode 2 is Gesbeen Mohammad. The editorial consultant is Russell Gold. The senior producers are James Jacoby and Eamonn Matthews. The executive producer for FRONTLINE is Raney Aronson-Rath.\n\n#ClimateChange #BigOil #Docuseries\n\nLove FRONTLINE? Find us on the PBS Video App, where there are more than 300 FRONTLINE documentaries available to watch any time: https://to.pbs.org/FLVideoApp   \n\nSubscribe on YouTube: http://bit.ly/1BycsJW \nInstagram: https://www.instagram.com/frontlinepbs \nTwitter: https://twitter.com/frontlinepbs \nFacebook: https://www.facebook.com/frontline \n\nFRONTLINE is produced at GBH in Boston and is broadcast nationwide on PBS. Funding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Additional support for FRONTLINE is provided by the Abrams Foundation, the John D. and Catherine T. MacArthur Foundation, Park Foundation, the Heising-Simons Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen. Funding for The Power of Big Oil is provided by The WNET Group’s Peril and Promise initiative, reporting on the human stories of climate change, with major funding by Dr. P. Roy and Diana T. Vagelos and additional funding from The Marc Haas Foundation, Sue and Edgar Wachenheim III, and the Cheryl and Philip Milstein family. Additional support for this program is provided by The JPB Foundation, and the GBH Planet Future Fund.", "link": "https://www.youtube.com/watch?v=oDpvlab56G8", "date_published": "2022-04-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]