[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "A Strange Loop: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nJosh Rogosin | April 26, 2022\nRather than use the stage at Feinstein's/54 Below, the cast of A Strange Loop cram into a booth for their Tiny Desk (home) concert. The protagonist of the musical is an usher, so performing in the crowd makes sense. 54 Below played a pivotal role in the musical's rise when, in 2016, composer Michael R. Jackson performed a concert version for New Musicals at 54. Little did anyone know that the show would go on to win the Pulitzer Prize for Drama in 2020. The cast reunited at \"Broadway's Supper Club\" to sing a five-song medley led by the show's author to celebrate their opening at the Lyceum Theater on Broadway.\n\nJackson explains A Strange Loop is \"a musical about a young Black gay man named Usher who works as an usher at a Broadway show who is writing a musical about a young Black gay man named Usher who works as an usher at a Broadway show... who is caught in a self-referential loop of his own self hatred.\" The ensemble of characters joining him are a collection of \"fierce but completely obnoxious\" \"Thoughts\" — literally billed in the show's Playbill as \"Thoughts 1-6.\"\n\nThe show at the Lyceum clocks in at 100 minutes with no intermission. Even in this small, Tiny Desk (home) version it's easy to get caught up in Usher's whirlwind of emotions as he's tormented by his thoughts. One can only imagine sitting in a dark theater with a bunch of strangers, laughing and crying, spiraling out together on Usher's strange loop.\n\nSET LIST\n\"Intermission Song\"\n\"We Wanna Know\"\n\"Inner White Girl\"\n\"Periodically\"\n\"Memory Song\"\n\nMUSIC AND LYRICS\nMichael R. Jackson\n\nCAST\nAntwayn Hopper\nJames Jackson, Jr.\nL Morgan Lee\nJohn-Michael Lyles\nJohn-Andrew Morrison\nJaquel Spivey\nJason Veasey\n\nBAND\nRona Siddiqui: music direction, keys\nBeth Callen: guitar\nIan Jesse: bass\nMarques Walls: drums\n\nCREDITS\nVideo by Magicshak Media\nCamera Operators: Nick Shakra, Anton Ponomarev, Maksim Kataev\nAudio: Amanda Raymond\nAudio Mix: Josh Rogosin\nDirected by Stephen Brackett\nProduced by Lilly Claar\nHair & Makeup by Kirk Cambridge Del-Pesche, Dotty Petersen, Elias Prince\nSpecial Thanks: Raja Feather Kelly, Cherie B. Tay, Barbara Whitman, Jimmy Wilson, Arnulfo Maldonado, Corey Umlauf, 321 Theatrical Management, Feinstein's/54 Below\n\nTINY DESK TEAM\nProducer: Josh Rogosin\nVideo Producer: Michael Zamora\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Joshua Bryant, Maia Stern, Ashley Pointer\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#NPRMusic #TinyDesk #StrangeLoopBway", "link": "https://www.youtube.com/watch?v=ObD7Qjai55Y", "date_published": "2022-04-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]