[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Horizon Zero Dawn Reportedly Getting A PS5 Remake | GameSpot News", "description": "The first Horizon game is potentially getting remade, along with the franchise gaining multiplayer, the PS5 has been jailbroken, and 2 million PSVR2 units are reportedly being made.\n#gaming  #PlayStation5 #PS5 \n\nAn Horizon Zero Dawn remake, the PS5 has been jailbroken, and Sony plans to make a bunch of PSVR2s. All this on today’s GameSpot News.\n\nHorizon Zero Dawn could be getting a significant upgrade, as a new report claims that \"accessibility features, graphics modes, and quality of life improvements to the gameplay itself,\" will bring Guerrilla Games' 2017 title up to the same similar standard as its 2022 sequel Horizon Forbidden West.\n\nSeveral of these upgrades can be found in the PC version of Horizon Zero Dawn that was released in 2020, although that game mostly reused the same assets as the PS4 edition.\n\nAccording to the report, Guerrilla Games is also currently working on a Horizon multiplayer game for PS5 and PC. Co-op features had been planned for Zero Dawn as far back as 2014 according to VGC's sources, but these elements were scrapped so that other areas of the game could be focused on. The idea hasn't been entirely scrapped for the mainline series and could make its way into Horizon 3.\n\nSony is also expanding the series into other forms of media, and with a Horizon TV show headed to Netflix, it wouldn't be too surprising to see some sort of announcement from the gaming side of the series. This could be a similar situation to The Last of Us Part 1 which arrived ahead of the HBO Max live-action series.\n\nIn some more PS5 news, it looks like someone has managed to crack the security on the system. The jailbreak was spotted by modder Lance McDonald--who modified Bloodborne to run at 60fps--and uploaded to Twitter, showcasing how the software can give a user access to the PS5's debug menu.\n\nAdditionally, a PS5 with the software installed can also have game backups installed on it, with McDonald's footage showing the delisted PT demo being loaded onto the system, although it wasn't playable on the system. The exploit does come with numerous limitations though, as its makers claim that it only works around 30% of the time and has multiple potential points of failure.\n\nThe exploit will only work on consoles with firmware version 4.03 from October 2021, and it is possible that PS5s with earlier firmware could run it according to the creator. The software in its current state won't be too useful to the ordinary gamer, as the creator of the exploit noted that hackers and people who are curious to see what's under the hood of the PS5 will find it worth installing.\n\n\nTIMECODES:\n00:12 - Horizon Zero Dawn PS5 remaster\n01:28 - PS5 has been jailbroken\n02:33 - PSVR2 has begun manufacturing", "link": "https://www.youtube.com/watch?v=S1kdi4bHHA0", "date_published": "2022-10-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Zelda Tears of the Kingdom Similarities You Likely Missed", "description": "We’ve compiled a list of references and displayed them side by side to show what Tears of the Kingdom might be based off of. But more importantly, Ghibli may have a bigger influence now more than any other previous Zelda games, and the astounding number of similarities we found in just a few short trailers might surprise you.\n#gaming #tearsofthekingdom #breathofthewild #zelda #ghibli #gamespot \n\nThings compared include unused Breath of the Wild concept art, such as the broken Master Sword and Ganon’s floating castle, all the way to previous games directly such as A Link to the Past and Skyward Sword. However, while fans have always known that the Zelda team takes light inspirations from Ghibli films in themes and tones, the direct references this time in Tears of the Kingdom are much more profound. \n\nIf there were only several references between Ghibli and Tears of the Kingdom, it would be easier to discount this connection. But there are almost 15 total references that are too specific to be a coincidence. Things such as a crumbling castle as it rises upwards, sky islands hidden within a circling thunderstorm around it, ancient boulders with designs on them being used as an elevator and much more show that just within several short trailers, the Zelda team is definitely showing their appreciation for Studio Ghibli.\n\nTimestamps:\n0:00 Intro\n0:25 Ancient Robots\n0:32 Surprised Zelda Animation\n0:40 Ganon's Shadow On The Wall\n0:46 Goddess Harp (Or Omega)\n0:52 Destroyed Master Sword\n1:00 Ancient Wall Designs Lit Up\n1:08 Kargarok (Non-Twilight)\n1:16 Skydiving + Loftwing Summon\n1:25 Skydiving\n1:35 Rats In Dungeon With Zelda And Link\n1:42 Old Shrine/Dungeon Concept\n1:51 Ganon's Castle In The Sky\n1:59 Ritual Using Zelda\n2:07 12 Castle In The Sky References\n5:03 3 Princess Mononoke References\n5:58 Outro", "link": "https://www.youtube.com/watch?v=gjXOrkJTfW8", "date_published": "2022-10-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Game To Save The Human Brain | MindGames", "description": "Sea Hero Quest, in both its mobile and VR forms, tasks you with sailing a small boat, memorizing maps and navigating colorful seascapes. But under the surface, it hopes to provide the data that could help humanity fight an incurable disease that affects hundreds of millions of people.\n\nWe spoke to Hugo Spiers, Professor of Cognitive Neuroscience, and developer Max Scott-Slade of indie developer Glitchers, to find out how Sea Hero Quest revolutionised dementia research around the world, and the breakthroughs the game has led to since release.\n\nTo play a selection of levels from Sea Hero Quest, email seaheroquest@ucl.ac.uk and you'll be provided with an access code for the mobile app.\n\n00:00 Intro\n00:28 What is Sea Hero Quest?\n03:29 Finding the Way\n06:01 Making Waves\n07:35 Game-Changing\n09:00 How to play Sea Hero Quest\n\nThumbnail art by Bruno Di Lucca: https://www.brunodilucca.com/project/seaheroquest\n\nSea Hero Quest: https://www.telekom.com/en/corporate-responsibility/corporate-responsibility/sea-hero-quest-game-for-good-587134\n\nHugo Spiers: https://spierslab.com/\n\nGlitchers: https://glitchers.com/\n\n#gaming #psychology #mentalhealth #dementia #alzheimersawareness #seaheroquest", "link": "https://www.youtube.com/watch?v=vLo59ObMgW8", "date_published": "2022-10-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]