[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "S. Carey: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nStephen Thompson | April 21, 2022\nSean Carey's music often evokes the comforts of home, so it only makes sense that he'd gravitate to the quiet confines of a modest kitchen in his hometown of Eau Claire, Wis. This is a Tiny Desk (home) concert in the truest sense: S. Carey performs these four songs surrounded by household appliances and a handful of his closest collaborators.\n\nCarey's fourth solo album, Break Me Open, lends itself perfectly to confined intimacy. The record came out of an intense stretch of Carey's life in which the singer got divorced, lost his father and embarked on a period of deep introspection. But it's a record about growth as well as grief.\n\nOf course, Carey had a clear musical path to follow, given that he joined Bon Iver shortly after bandleader Justin Vernon wrote his own masterful breakup album, For Emma, Forever Ago. Now, more than a decade later, he's the one healing amid the snows of western Wisconsin, just in time for the spring thaw.\n\nSET LIST\n\"Paralyzed\"\n\"Where I Was\"\n\"Rose Petals\"\n\"Island\"\n\nMUSICIANS\nS. Carey: guitar, Wurlitzer, vocals\nCourtney Hartman: guitar, vocals\nZach Hanson: percussion, vocals\nBen Lester: synth\nJeremy Boettcher: upright bass\n\nCREDITS\nVideo: Brendan Lauer and Christopher Behnen\nAudio: Brian Joseph\nMixed by S. Carey and Zach Hanson\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Michael Zamora\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Kara Frame, Joshua Bryant, Maia Stern, Ashley Pointer\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #TinyDesk #SeanCarey", "link": "https://www.youtube.com/watch?v=mpdZZhRBnOg", "date_published": "2022-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Curren$y: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBobby Carter | April 20, 2022\nCurren$y's Tiny Desk (home) concert features three key elements that make him who he is: cars, weed and, of course, music. One of the prominent champions of cannabis plays from the confines of a garage on this 4/20, a day deemed a worldwide celebration of marijuana. In front of a purple candy-coated 1965 Chevy Impala sitting on three wheel motion, the New Orleans native plays a smidgen from a catalog that spans over seventy projects to date.\n\nHis name would hold a place in the hip-hop rafters due to sheer volume alone, yet his consistency in the independent space pre-dates just about all of your favorite indie emcees. His formative years as an artist on two of the most successful independent hip-hop labels in the world (No Limit and Cash Money Records) helped develop the homegrown formula for his business. He's helped lay the groundwork for distributing projects online, selling tickets and merch without the middleman or radio play, for over 15 years. This set is mainly composed of fan favorites from his rise in the 2010s. Each song starts with the recorded track before the band takes complete control; however, they let the vocal sample from the opening number, 2018's \"Sixty Two Turbo Jet\" ride throughout. Spitta expressed his desire to play the Tiny Desk a few years back. There's no better time than now.\n\nSET LIST\n\"Sixty-Seven Turbo Jet\"\n\"Address\"\n\"Breakfast\"\n\"Airborne Aquarium\"\n\"Mary\"\n\nMUSICIANS\nCurren$y: vocals\nPrime: guitar\nJean Laphare: bass\nGroovy Murphy: drums\n\nCREDITS\nDirector and Editor: Adam Vo\nDirector of Photography: Allen Esmail\nMixed and Mastered by FluWop\nProducer: Kayla \"Rose\" Magee\nProduction House: Channel Vivid\nProduction Assistants: Joey Park, Keijuan Jacobs, John Battle, Garrett Brumfield \nExecutive Producer: Mousa\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Joshua Bryant\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Kara Frame, Michael Zamora, Maia Stern, Ashley Pointer\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #curren$y", "link": "https://www.youtube.com/watch?v=izyBoVzC0Wk", "date_published": "2022-04-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]