[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Evil Dead: The Game Captures The Horror And Humor Of Chainsawing Deadites", "description": "We played about an hour of Evil Dead: The Game with the developers recently and got a first-hand sense of how the game is balanced to capture the same feel of the movies and TV show--that the humans will kick Deadite ass, and that the Kandarian demon is an ancient force of frightening power. Both the human team, led by Bruce Cambell's iconic Ash Williams, and the demon Deadites are powerful but in very different ways, which creates an interesting challenge for turning the franchise into an asymetrical multiplayer horror game in Evil Dead: The Game. That fact led Evil Dead: The Game developer Saber Interactive to find a different way to balance its game; it still sees a group of four players facing off a horror controlled by a fifth, but both sides are active in different ways and putting up a serious fight.", "link": "https://www.youtube.com/watch?v=Jhwxm-thuyo", "date_published": "2022-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Gearbox PAX East 2022 Panel Livestream", "description": "Tune in for Gearbox Entertainment's PAX East 2022 Show, featuring a celebration of Borderlands and other exciting announcements from Gearbox Publishing.", "link": "https://www.youtube.com/watch?v=WTyqEl01SYA", "date_published": "2022-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Outriders Worldslayer Reveal Full Presentation", "description": "The “Worldslayer Reveal\" Broadcast is dedicated to unveiling Outriders Worldslayer and spotlighting the new content and systems being introduced. Get a glimpse of the new systems, locations, mechanics and more!\n\nOutriders is a 1-3 player co-op RPG shooter set in an original, dark and desperate sci-fi universe. As mankind bleeds out in the trenches of Enoch, you’ll create your own Outrider and embark on a journey across the hostile planet.\n\n#Outriders #Worldslayer", "link": "https://www.youtube.com/watch?v=DcmBrsXNHRc", "date_published": "2022-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Outriders: Worldslayer Preview", "description": "Outriders: Worldslayer is the first major expansion to People Can Fly and Square Enix's third-person shooter. Outriders: Worldslayer will include plenty of new content to the original game, including story elements with a new big bad in the form of Ereshkigal, beefed-up challenges with Apocalypse tiers, and much more. Outriders: Worldslayer expansion releases in 2022.\n\n#Outriders #WorldSlayer", "link": "https://www.youtube.com/watch?v=3UuFDJrxPbA", "date_published": "2022-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 Alpha Hands-On: Sojourn Abilities, Orisa + Bastion Rework, Push Impressions Feat Stylosa", "description": "Overwatch fans Lucy and Tamoor went hands-on with OW2 PvP and chat with their pal Stylosa about the game ahead of the upcoming Overwatch 2 beta. They discuss Sojourn, the Bastion and Orisa rework, as well as their impressions of the new mode, Push. #Overwatch2 #OW2 \n\nCheck out Stylosa's channel: https://www.youtube.com/stylosa\n\nActivision Blizzard continues to address allegations from a state of California lawsuit accusing parent company Activision Blizzard of fostering a \"frat boy culture\" of harassment and discrimination against women. For the latest on what's happening with regard to the ongoing legal action, take a look at our timeline of events:  https://www.gamespot.com/articles/activision-blizzard-lawsuits-and-investigations-timeline-of-events/1100-6494785/\n\n0:00 Introduction\n00:38 Overwatch 2 closed alpha impressions\n06:19 Sojourn abilities and how she feels to play\n12:03 Support hero changes\n12:31 Cassidy rework\n13:29 Doomfist rework\n15:50 Orisa rework\n17:11 Bastion rework\n18:40 Push mode impressions\n21:54 Should this be called Overwatch 2?\n\nWith the news that Overwatch 2 PvP is to be 'de-coupled' from PvE, Blizzard also announced that a closed beta for Overwatch 2 was in the works. GameSpot Overwatch fans Lucy and Tamoor played the closed alpha for a number of hours and roped in their pal and Overwatch content creator Stylosa to chat about the big changes coming to the game. \n\nFirst off the bat come the additions to the game, like new hero Sojourn, her abilities, and where she sits in the Overwatch damage heroes pool. Also discussed is the new mode Push, and whether or not it needs some tweaks before the game is launched, lest it goes the way of the 2cp game mode. The trio also discuss the changes Blizzard is making to heroes. Orisa, Bastion, and Doomfist have seen significant reworks, and other characters such as Cassidy have seen seemingly small, but meaningful changes. While there's no word on an Overwatch 2 release date just yet, the closed beta kicks off on April 26.", "link": "https://www.youtube.com/watch?v=KNF75PF6Mtw", "date_published": "2022-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "When You Can Play Warzone’s Godzilla & King Kong Event | GameSpot News", "description": "Godzilla And King Kong Are Coming To Call Of Duty: Warzone, Halo Infinite's Battle Royale-Like Last Spartan Standing Mode Revealed and Rocket League's New Knockout Bash Mode Turns The Game Into A Battle Royale. \n#GamingNews #Warzone #HaloInfinite\n\nActivision has revealed the Call of Duty Season 3 roadmap for both Vanguard and Warzone, which includes the Operation Monarch event centered around Godzilla and King Kong. Season 3 will arrive on April 27 and Operation Monarch releases May 11. The Vanguard update will go live on April 26 at 9 AM PT / 12 PM ET, and one for Warzone on April 27 at the same time.\n\n343 Industries provided a rundown of some of the new and returning modes fans can expect. This includes the battle royale-like Last Spartan Standing mode, which is all about fighting for survival. Last Spartan Standing will be available in Halo Infinite when Lone Wolves launches on May 3.\n\nRocket League is adding a new Limited Time Event called Knockout Bash on April 27, in which players will battle it out to be the last car standing. Hazards will also be in play, as spikes and laser grids can instantly KO any player caught by them. Knockout Bash will be live from April 27 to May 10. \n\nSTAMPS\n00:00 - Intro\n00:09 - Call of Duty\n01:27 - Halo Infinite\n02:30 - Rocket League", "link": "https://www.youtube.com/watch?v=-4jIS8NqEWs", "date_published": "2022-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Meta Quest Gaming Showcase Livestream", "description": "Tune in on 4/20 at 10am PT for the Meta Quest Gaming Showcase, featuring new game announcements and updates on titles coming in the next year from across the Quest platform.", "link": "https://www.youtube.com/watch?v=3LtDEiFc1nM", "date_published": "2022-04-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PlayStation Planning In-Game Ads, Oh No… | GameSpot News", "description": "Sony Is Also Planning An In-Game Ads Program Similar To Xbox, God Of War Ragnarok Dev Gives An Update, PS5 Users Can Now Update Their DualSense Controller On PC and COD: Warzone Update Addresses Battle Pass Issues.\n#GamingNews #Warzone #PS5\n\nGod of War: Ragnarok's Cory Barlog has provided an update on the upcoming PlayStation game and said, \"We haven't said a lot about this. That's because everybody is heads-down, hard at work. Today, April 20, is the fourth anniversary of 2018's God of War. The game sold more than 19.5 million copies\n\nAccording to a new report, Sony has begun working on a plan to place ads inside of PlayStation games through a software developer program. Sony's plan is similar to the one that Microsoft has reportedly begun development on, which is also working on methods for inserting ads in Xbox games.The goal of the project is for ads to look like they've been organically inserted into a game, much like a digital billboard in a sports stadium.\n\nRaven Software has released a new update to resolve an issue with battle pass progression in Warzone Season 2. Additionally, Raven Software announced Warzone players will get properly compensated if they log in before Season 2 ends. To further appease the community, the developer also announced that all players who log in during Season 2 will receive two 1-hour Double Battle Pass XP Tokens.\n\nSTAMPS\n00:00 - Intro\n00:05 - God of War\n00:52 - PS5 Ads\n02:04 - PS5 Controller\n02:46 - Warzone", "link": "https://www.youtube.com/watch?v=4TrcIkj213A", "date_published": "2022-04-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Saints Row - Everything We Know So Far", "description": "16 years after the series debut and 9 years after the last numbered entry, Saints Row is back and looking to reinvent itself. Even though the announcement of the game's new city and a drastically different cast of characters left fans divided, the experience is still looking to be as wild as previous entries. Just don’t expect super powers this time around. Here is everything we know about Saints Row so far.\n\nSimilar to the rest of the series, Saints Row is being developed by Volition and published by Deep Silver. With this opportunity to start over, series developer Volition wanted to create criminals that were more relatable and one way of doing that was to show those goons starting from nothing. Each of the new criminals are just trying to make ends meet and head out on their own because they are tired of working for other gangs. Their goal is to get rich and take over the fictional city of Santo Ileso, a huge and vibrant sandbox in the American south west.\n\nSaints Row is scheduled to launch on August 23, 2022. The game was originally set to release on February 25 before being delayed so that the team could do a little bit more fine tuning. The game will be released for both current and past generation consoles, as well as PC.", "link": "https://www.youtube.com/watch?v=XBw56SXsEJM", "date_published": "2022-04-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Saints Row - Ultimate Customization Showcase Livestream", "description": "Tune in for the full lowdown on ALL things customization in Saints Row.", "link": "https://www.youtube.com/watch?v=gvpnXGcyhi8", "date_published": "2022-04-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Saints Row Official Customization Trailer", "description": "Get a glimpse of all the various options you have for customizing your character in Saints Row. From shirts, pants, shoes, and hats to full combos,, underwear, overwear and even socks. Additionally take a look at all the custom rides you can create as well. \n\nSaints Row releases on August 23, 2022 on PlayStation 4, PlayStation 5, Xbox One, Xbox Series X and S, and PC.\n\n#SaintsRow", "link": "https://www.youtube.com/watch?v=TD5mZDJkNao", "date_published": "2022-04-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Saints Row Ultimate Customization Showcase (4K)", "description": "Get full lowdown on all things customization in Saints Row. \n\nThe developers at Volition bring you the most customizable Saints Row experience to date, and they are showing you an extended look at all the many customization options.  This includes customizations for your Boss, your vehicles, favorite weaponry, the Saints HQ, and even the city itself.  You can even tweak the treads of your trusty recruits and friends. Even socks are back!\n\nWe couldn’t hold this in any longer, so sit back, enjoy, and  go nuts planning your best life in Santo Ileso.\n\n#SaintsRow #BeYourOwnBoss\n\n0:00 Intro\n1:44 Saints Row Customization Trailer\n8:02 Facial Customizations\n9:52 Clothing and Body Customizations\n12:49 Car Customizations\n16:11 Weapon Customizations\n22:40 Outro", "link": "https://www.youtube.com/watch?v=jaavEloyAxM", "date_published": "2022-04-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]