[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Ubuntu 22.04 Review: It's GOOD again! + Kubuntu, Xubuntu, MATE, Budgie...", "description": "Get 100$ credit for your own Linux and gaming server: https://www.linode.com/linuxexperiment \n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\nYou can also protect your privacy by using this extension from Startpage, each install helps the channel with a small commission: https://add.startpage.com/en/protection/?campaign=4&source=aff \n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:34 Sponsor: 100$ your Linux or Gaming Server\n01:26 Ubuntu 22.04 LTS\n03:45 Look & Feel\n06:43 Desktop Features\n09:16 Applications and Snaps\n11:37 Ubuntu Flavors\n11:41 Kubuntu\n12:15 Ubuntu MATE\n13:25 Ubuntu Studio\n14:10 Lubuntu\n14:46 Xubuntu\n15:19 Ubuntu Budgie\n16:01 Good or not?\n17:29 Sponsor: Get a Laptop or Desktop with linux preinstalled\n18:11 Support the Channel\n\nThis new theme is really more of an adaptation of the new GNOME 42 libadwaita style. In the shell, you don't get these little arrows pointing to the element you clicked on, you get fully rounded menus. \n\nThe purple Aubergine color is now gone as well in the shell, replaced by the traditional Ubuntu Orange. \n\nIn the settings, you can still go dark mode, in the Appearance tab, but there's also a nice new change: accent colors! \n\nOh, and there's the new logo. At startup, and in the About page. I like it, I know a lot of people don't. It would probably look less weird if it wasn't that tall. There's also a new wallpaper, which I find really nice. I love these geometric renderings of animals, and at least it keeps the purple tones.\n\nThe apps grid is WAY more responsive, scrolls horizontally, and lets you rearrange icons as you please, into folders, or not.\n\nYou also get horizontal workspaces, which are bigger, easier to use, easier to drag your windows or your app icons into. They still keep the dock on the left side, and it now holds the trashcan, and it also displays all removeable media and network devices. \nYou can also move it to any side of the screen, and make it look like a real dock, without it extending from screen edge to screen edge. \n\nFrom GNOME 42, you also get the new screenshot UI, which isn't a dedicated app anymore, but more of an overlay.\n\nThe Ubuntu Software store finally started to catch up to the default GNOME Software, with nicer app pages, more space for screenshots, more legible information about download size, safety, and update notes. \n\nKubuntu 22.04 gets the latest KDE Plasma, version 5.24, with its new overview effect much inspired by the GNOME Activities view, the newer notification system, the new Breeze theme, and the accent colors as well. Apart from that, you also get the latest releases of Thunderbird, Firefox and LibreOffice, and all KDE frameworks are up to date.\n\nUbuntu MATE uses MATE 1.26.1 with full compatibility with the Yaru theme, including all accent colors. There's also full support for the dark theme, some interesting AI generated wallpapers, and there are a lot of improvements to the MATE Tweak tool with better reliability for desktop layout switching.\n\nUbuntu Studio still uses KDE Plasma, version 5.24 this time, with all the same changes that Kubuntu 22.04 brings. It also moves to pipewire by default.\n\nLubuntu 22.04 won't be using LXQT 1.1.0, unfortunately, so it's going to be stuck on 0.17.\n\nAs per Xubuntu 22.04, it gets XFCE 4.16, just like 21.10, but there's initial support for GTK4 and libhandy in the default greybird theme, which means that GTK4 apps from GNOME shouldn't look horrible.\n\nUbuntu Budgie uses version 10.6 of that desktop, with better support for ayatana indicators and notification tray icons, and Evolution and Thunderbird can now integrate with the desktop notification system. The GNOME Control Center is replaced by the Budgie Control Center which gives you all options to configure your desktop how you like it.", "link": "https://www.youtube.com/watch?v=oUkl1NrsBI8", "date_published": "2022-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]