[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Destiny 2: The Witch Queen Launch Day Livestream", "description": "Join David, Jean-Luc, and Phil as they dive into day 1 of Destiny 2's latest expansion, The Witch Queen.", "link": "https://www.youtube.com/watch?v=kr2-doYITs0", "date_published": "2022-02-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Don’t Lose Your Bethesda.net Saves | GameSpot News", "description": "In today’s episode of GameSpot News, Persia talks about how you can transfer your Bethesda.net saves since the launcher is closing, the headset design for PlayStation VR 2 and more. \n\nBethesda has announced it is closing its PC storefront, the Bethesda.net Launcher, later this year. Anyone who owns games through the Bethesda.net Launcher can migrate them, along with any funds in their wallet, to Steam beginning in April. Most games will have their saves automatically transferred, too, though some will require manual transfers, and one title is not supported at all, Bethesda said. Additionally, the company clarified that all Bethesda.net accounts will remain accessible.\n\nSony has shown off the final design for its upcoming PSVR 2 headset and the accompanying Sense controllers, which feature a look similar to the PS5's design aesthetic. Other features of the headset include a focus on comfort, as the hardware has a lens adjustment dial for users to dial in the distance between their eyes and the lenses, a slight weight reduction when compared to the previous PSVR model, and a new vent design to prevent fogging.\n\nAccording to VGC, 2K Games signed a \"new multi-game partnership with Lego\" that will see the company producing a number of licensed titles, the first of which are a soccer game and an open-world racing game. The soccer game, planned for release this year, is reportedly being developed by Sumo Digital, while the racing game is in the works at 2K's own studio Visual Concepts.\n\nFor more information on today’s topics, please visit gamespot.com.\n\nTimestamps:\nIntro - 00:00\nBethesda - 00:06\nPlayStation VR2 - 01:04\n2K Lego - 01:57\nOutro - 02:58", "link": "https://www.youtube.com/watch?v=snTkzCC42-g", "date_published": "2022-02-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "ELDEN RING Official Launch Trailer", "description": "Though shattered, it shall guide thee. Though fractured, it yet calls. Enact thy will. Become Lord. Seek the Elden Ring.\n\nElden Ring is an upcoming action role-playing game developed by FromSoftware and published by Bandai Namco Entertainment.\n\nElden Ring will release on PlayStation 4, Xbox Series X and Series S, Xbox One, PlayStation 5, Microsoft Windows\n\n#ELDENRING launches February 25, 2022.", "link": "https://www.youtube.com/watch?v=AKXiKBnzpBQ", "date_published": "2022-02-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokemon Day 2022 Bringing New Announcements | GameSpot News", "description": "In today’s episode of GameSpot News, Persia talks about new Pokemon announcements heading our way, new content for Rainbow 6 Siege, and more. \n\nThe Pokemon Company announced its plans for the annual Pokemon Day fan celebration, and this year it's not limited to a single day. The company announced that instead we'll see a week of announcements \"from across the franchise\" leading up to the actual date on February 27.\n\nUbisoft is kicking off Rainbow Six’s first season of this year with a bang. Demon Veil, is adding a new map and permanent game mode to the competitive shooter, along with a new Operator who can rebuild defenses.\n\nAzami is a Defender. With medium speed and health, Azami is unremarkable save for her gadget, the Kiba Barrier. The Operator can throw kunai that release gas in a small circle where they land. That gas then solidifies into a bulletproof surface, providing quick cover.\n\nCapcom has officially announced Street Fighter 6, the next entry in its popular fighting series. A teaser trailer shows a very shredded-looking Ryu preparing to fight Luke, a DLC character from Street Fighter V. \n\nIn addition to Street Fighter 6, Capcom announced the Capcom Fighting Collection, which includes 10 classic fighting games. It launches June 24 for PlayStation, Xbox, Switch, and PC.\n\nFor more information on all of our topics, please visit gamespot.com.\n\nTimestamps:\nIntro - 00:00\nPokémon - 00:07\nRainbow 6 Siege - 01:00\nStreet Fighter 6 - 02:42\nOutro - 03:59", "link": "https://www.youtube.com/watch?v=uGzx_nVS4Lc", "date_published": "2022-02-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "What’s New in Destiny 2: The Witch Queen", "description": "Bungie is changing the game with Witch Queen, the latest expansion for Destiny 2 with Hive Guardians, the new Glaive weapon, revamped Void classes, weapon crafting, a new raid and so much more. All while we face our toughest foe yet, the Hive queen Savathun. (Presented by Bungie) \n\nFor more information on Destiny 2: The Witch Queen see more details here: https://bung.ie/3LJBPlH", "link": "https://www.youtube.com/watch?v=Cm8eq37APjI", "date_published": "2022-02-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring - Everything To Know", "description": "FromSoftware's latest game, Elden Ring, releases on February 25, 2022. The upcoming game from the creators of Dark Souls, Bloodborne, and Sekiro will feature a brand new open world, and plenty of other gameplay features both new and familiar to longtime Soulsborne fans. Here's everything you need to know about Elden Ring.\n\nElden Ring is the latest game from FromSoftware - creators of Demon’s Souls, Dark Souls, Bloodborne, and of course, King’s Field. The game takes the basic action RPG mechanics of Dark Souls, but introduces a brand new open world that completely changes things up.\n\nSimilar to the Soulsborne games, as of the closed Beta, players will be able to choose from a number of starting classes, with stats they’ll be able to upgrade as they level up, allowing for a  level of freedom in creating your own builds. The starting classes thus far are Vagabond, Warrior, Hero, Bandit, Astrologer, Prophet, Samurai, Prisoner, Confessor, and Wretch - with Wretch being the level 1 build.\n\nStats you can choose to upgrade with each level are: Vigor, Mind, Endurance, Strength, Dexterity, Intelligence, Faith, and Arcane. This means, similar to prior Soulsborne games, you’ll have the freedom to choose between Strength, Quality, Dex, and varying magic builds - or any merger of those.\n\nLeveling up is only possible after meeting your first finger maiden, Melina; once you have met her, you’ll be able to level up at any of the game’s Sites of Grace - which act similar to bonfires from the Souls games.\n\nAt the Sites of Grace, you’ll be able to manage your Estus Flasks, and - like Dark Souls 3 - you’ll have a variety of Estus Flask types. You’ll have ones that refill your HP, ones that refill your FP, or Focus Points that allow you to cast magic, and a brand new Flask of Wondrous Physick, which is a customizable estus flask that will give you varying attributes depending on what crystal tears you equip to it.\n\nYou’ll also be able to upgrade how many Estus Flask uses you get by using special Golden seeds. If you recall from the game’s trailer, there are giant golden Erd Trees throughout the game, that are clearly significant. There are also smaller, lesser Erd Trees you can find throughout the game’s map. At these lesser Erd Trees, you’ll find special golden seeds, which are exactly what you need to upgrade your estus flask uses. The number of seeds you need will change as you upgrade your flask, and this isn’t the only way to obtain these seeds. Additionally, you can upgrade the recovery strength of your estus flasks.\n\n#EldenRing #GameSpot", "link": "https://www.youtube.com/watch?v=mYo6ZzGz6ig", "date_published": "2022-02-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Steam Deck - Everything To Know", "description": "Ahead of its initial launch in late February 2022, we're taking a look at everything revealed about Valve's Steam Deck so far.\n\nThe Steam Deck is a portable, handheld PC that will ship with Valve's own SteamOS (built on top of Linux). The device is billed as an entirely open platform, letting players install games outside of the Steam ecosystem, run additional PC software alongside them, or just replace the entire OS with Windows if they like. Valve is hoping that most (not all) games will work just fine on SteamOS when the Steam Deck launches, with a lot of work going into improving Proton--a compatibility layer that allows Windows games to run on Linux without native support, and without (too many) issues.\n\nSTAMPS\n00:00 - Intro\n00:30 - What is the Steam Deck?\n02:22 - Price and Versions\n03:17 - Specifications\n04:41 - Game Compatibility \n06:13 - Release Date", "link": "https://www.youtube.com/watch?v=KOtTGrct4UM", "date_published": "2022-02-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Street Fighter 6 Announcement Teaser Trailer", "description": "HERE COMES A NEW STREET FIGHTER. \n\nIt's official: Street Fighter 6 is in development! Stay tuned for more news coming Summer 2022. https://www.streetfighter.com/6\n\n#StreetFighter6 #SF6", "link": "https://www.youtube.com/watch?v=JT3Mrboykvo", "date_published": "2022-02-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]