[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Buffalo Nichols: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nKara Frame || February, 21 2022\nIn a sparse, dimly lit Austin office building, Carl “Buffalo” Nichols stands in front of the mic stand with his steel guitar. As he finger picks into the first song “Living Hell,” the stark surroundings are juxtaposed against the warmth of his raspy vocals. \n\nHe performs his Tiny Desk (home) concert solo, a testament to the engaging storytelling of the blues, a genre he reclaims on his self-titled debut album. In his three-song set, Nichols sings about not making it into heaven, living in hell and the life of someone who is lost and lonesome. But these aren’t your run of the mill, down-and-out blues songs – Nichols is adamant about making the genre current and making it Black again. Originally from Wisconsin, he mentions that he moved to the Austin, Texas music scene at the beginning of the pandemic, a fitting preface to his next song that starts with, “If you see me in your town, looking tired with my head hanging down / You may wonder what went wrong, why am I always all alone.”\n\nBuffalo Nichols’ acoustic set represents all the best parts of Tiny Desk; a humble desk, a talented artist and music that speaks for itself. \n\nSET LIST\n“Living Hell”\n“Lost & Lonesome”\n“These Things”\n\nMUSICIANS\nBuffalo Nichols: vocals, guitar\n\nCREDITS\nDirected by: Aimée M. Everett\nRecorded by: Buffalo Nichols\nMixed by: Clay Jones\nCameras by: Brad Feeser\nEdited by: Max Taeuschel\n\nTINY DESK TEAM\nProducer: Kara Frame\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Joshua Bryant, Maia Stern, Ashley Pointer\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #buffalonichols", "link": "https://www.youtube.com/watch?v=FrXXLcx4dCw", "date_published": "2022-02-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]