[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "The BEST OFFICE SUITES for Linux", "description": "Subscribe to Extended Lifecycle Support Services for CentOS 8: https://tuxcare.org/eol-linux-support\n\n150€ off the Slimbook Executive ultrabook with code executive-laptop-nick-friends: https://slimbook.es/en/executive-en\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n00:00 Intro\n00:33 Sponsor: Gain some time to plan your migration from CentOS 8\n01:32 FreeOffice\n04:02 LibreOffice\n07:20 OnlyOffice\n10:04 WPS Office\n12:09 Lightweight alternatives\n13:51 Sponsor: Get 150€ off your Slimbook Executive Ultrabook\n14:19 Support the channel\n\nFreeOffice isn't open source. It's available as a deb or an RPM, or a basic archive. No Flatpak, Snap or Appimage, though.\n\nFreeOffice does word processing, creating spreadsheets, and presentations. FreeOffice aims to be as compatible with MS Office as can be. FreeOffice gives you a choice between the classic menubar + toolbar combo, and the ribbon interface that MS office uses.\n\nIn terms of Office compatibility, I tried a few complex templates, and there seem to be a few issues on word documents, with header images not being in the right place, and elements being moved where they don't belong.\n\nFreeOffice is free of charge to download, but the free version does lack a few features.\n\nYou probably all know about Libreoffice. It has a word processor, a spreadsheet module, a presentation app, but also a flowchart /diagram editor that also doubles as a PDF editor, and a database module comparable to Microsoft Access.\n\nIt's completely open source, doesn't cost a dime, and is installable in virtually every way you'd ever want: deb, rpm, flatpak, snap, appimage, you name it.\n\nLibreOffice is compatible with the opendocument format, but also with MS office formats. The compatibility with openXML formats, like docx, xlsx or pptx isn't 100% perfect though.\n\nIn terms of interface, LibreOffice is super customizable: not only can it pick up your GTK or Qt theme, but you can also change its icons in the settings, and change how the interface looks and feels. By default, it uses the older menubar + toolbar layout, but you can change that into a ribbon interface, a simplified ribbon, a grouped bar, a sidebar, basically you can do whatever you want, and customize each toolbar to add or remove what you want.\n\nThere's another open source office suite for Linux, and that's OnlyOffice. It only offers the 3 basic modules: word processing, spreadsheets, and presentations. It's free to download and open source, and comes as a deb, an RPM, a flatpak, an appimage, or a snap package, so anyone can get it.\n\nOnlyOffice supports the Microsoft OpenXML document format, as well as the opendocument format that Libreoffice defaults to, and the older proprietary office formats as well. Compatibility seems better than FreeOffice, and LibreOffice, at least with my test templates. It actually seems pretty much identical to how MS office renders the same document.\n\nIn terms of interface, Onlyoffice isn't as customizable as LibreOffice: you only get a ribbon interface, and you can't change what's displayed in each toolbar. The ribbon will use a dedicated color for each program, if you use the light theme, so they're still easy to differentiate. Onlyoffice also supports interface scaling, with factors ranging from 100% to 200% with 25% increments.\n\nNow we come to another non open source office suite, WPS Office. You get a word processor, a spreadsheet module, and a presentation module, and you also get a PDF viewer. It offers deb and RPM packages, and it's also available on flathub, and as a snap.\n\nIn terms of compatibility, WPS opens older office docs, newer office docs, as well as their own format. Compatibility seems good, at least with openXML formats, although a little bit less perfect than OnlyOffice. It should be good enough for most people.", "link": "https://www.youtube.com/watch?v=s87xFvfeg7Y", "date_published": "2022-02-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]