[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Trueno: Tiny Desk (Home) Concert", "description": "From Sept. 15 through Oct. 15, Tiny Desk is celebrating Latinx Heritage Month with an \"El Tiny\" takeover, featuring Jessie Reyez, Susana Baca and more musicians from all corners of Latinidad.\n\nVita Dadoo | September 27, 2022\n\nWith his roots in La Boca neighborhood of Buenos Aires and arms outstretched to the rest of the world, Trueno is rewriting the playbook for Latin American hip-hop. Wearing a cap for the soccer team Boca Juniors and moving among the spaces of his childhood, the 20-year-old, premier Argentinian freestyler shows us exactly where he's from in his Tiny Desk (home) concert, an intimate performance that plays like a meditation on the music and the Argentina that has shaped him.\n\nTrueno's almost autobiographical set begins with \"DANCE CRIP,\" the first single from his recent album, BIEN O MAL, and an ode to The Sugarhill Gang's 1979 hit \"Rapper's Delight.\" Trueno's affinity for old school hip-hop is something the rapper returns to throughout his set, while also invoking percussion-forward beats and tango motifs. Trueno follows up with the album's title track, before launching into an improvised freestyle. Underneath a mural that reads \"La Boca resiste y propone\" (\"La Boca resists and proposes\"), Trueno demonstrates his lyrical dexterity and emotional range, \"Esto no lo puede hacer cualquiera, el vocero del ghetto conquistando la esfera,\" he raps, touting his neighborhood's resilience and his own.\n\nArgentina as a place of celebration and lament is the thematic center of Trueno's performance. The show takes place at a conventillo, one of many Argentinian boarding houses and microcosms of multicultural communities. Trueno concludes his set with \"TIERRA ZANTA,\" perhaps the most politically charged song in his album, which on record features the famous folk artist Victor Heredia. Here, Trueno calls out all the Andean nations by name, hinting at a larger global movement behind the song's boundaries.\n\nSET LIST\n\"DANCE CRIP\"\n\"BIEN O MAL\"\nFreestyle\n\"ARGENTINA\"\n\"TIERRA ZANTA\"\n\nMUSICIANS\nTrueno: vocals\nPedro Pasquale: guitar\nJulian Gallo: bass\nAugusto Durañona: keys\nNikko Taranto: drums\nCarlos Salas: percussion\nCaterina Finocchi: vocals\nAnabella Marin: vocals\nEl Feli: vocals\nAbel Manzotti: tuba\n\nCREDITS\nExecutive Producers: SUR CAPITAL RECORDS (por Tierra Agencia)\nExecutive Producers: Jota Ayerza, Emiliano Delorenzi\nDirectors: Facu Von Coptel & El Dorado\nSound Engineer: Jonathan Vainberg \nMix & Master: Mariano Bilinkins\nMusic Director & Arrangements: Pedro Pasquale, Panchito Cia, Axel Introini\nSound Production Manager & Monitor Engineer: Santiago Compiano\nAssistant Sound Mix: Ignacio Klappenbach\nLine Producer: Tomás Medero\nCinematographer: Enzo Codaro\nLocation Manager: Diego Ledesma\nProduction Design: Nicolas Tavella\nFirst AD: Lucas Galambos\nRecording Assistants: Luciano Di Lorenzo, Franco Olivetto\nPlayback Engineer: Juan Ravassi\nRF Engineer: Pablo Andres Gejman\nKey PA: Nicolas Vicchio\nPA: Gonzalo Abajas\nHelper Location Manager: Pablo Chalup\n2nd AD: Nicolás Dominikow\nGaffer: Federico Martini\nElectrics: Matias Carneiro, Zequeira, Esteban Pereira\nKey Grip: Nicolas Petroli\nGrips: Hernan Terry Duro, Kike Velez, Ezequiel Mansilla\nCameramen: Ismael Eduardo Guagliardi, German Guagliardi, Diego Hernan Carini, Sabena Cristian Alberto, Ricardo Daniel Guadalupe, Julia Florencia Siarri, Ignacio Acevedo\nDIT: German Covi\nAssistant DIT: Paula Montenegro\nAssistant Costume Designer: Yael Boltia Baltar\nHelper Costume Designer: Tomas Lucio Martinez\nSet Decorator: Milena Colombo\nPost Production Coordinator & Editor: Juan Raimondi\nColorist: Alejandra Lescano\nExtras: Pedro Peligro, Guido Andrés Penayo, Cristian Derrico, Tomas Inti Kuselman, Kmi 420, López Diego Sebastian, Campos Nahuel, Mateo Teiki\n\nTINY DESK TEAM\nProducer: Anamaria Sayre\nVideo Editor: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Joshua Bryant, Marissa Lorusso, Hazel Cills, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #eltiny #trueno #tinydesk", "link": "https://www.youtube.com/watch?v=2C-WmZQABLQ", "date_published": "2022-09-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]