[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "MICROSOFT isn't the ENEMY of Linux and FOSS anymore, but it's no friend either...", "description": "Get 100$ credit for your own Linux and gaming server: https://www.linode.com/linuxexperiment \nGrab a brand new laptop or desktop running Linux:https://www.tuxedocomputers.com/en#\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to a weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYouTube: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n📹 MORE VIDEOS FROM ME\nLinux news in Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\nGaming on Linux: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nI'm also on ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n🏆 FOLLOW ME ELSEWHERE:\nTwitter : http://twitter.com/thelinuxEXP\nMastodon: https://mastodon.social/web/@thelinuxEXP\nPixelfed: https://pixelfed.social/TLENick\n\nThis video is distributed under the Creative Commons Share Alike license.\n\n#linux #microsoft #foss \n\n00:00 Intro\n00:42 Sponsor: 100$ free credit for your Linux or Gaming server!\n01:41 Microsoft: the arch-enemy of Linux and FOSS\n04:24 Microsoft now loves FOSS and Linux?\n07:45 Shady Stuff: Github Copilot\n09:48 More Shady Stuff: Secure Core and Linux Boot\n11:28 Windows Store policy against FOSS app sales\n12:50 Microsoft: friend or foe?\n14:08 Sponsor: get a device that runs Linux perfectly!\n15:10 Support the channel\n\n\nSince the 90s, Microsoft hasn't demonstrated the best approach to Linux and open source. The most famous quote here is Steve Ballmer, former CEO of Microsoft, saying \"Linux is a cancer that attaches itself in an intellectual property sense to everything it touches\".\n\nhttps://www.theregister.com/2001/06/02/ballmer_linux_is_a_cancer/\n\nThere was also the still remembered \"embrace extend extinguish\", terms used by Microsoft internally to describe their strategy when they were trying to enter a market dominated by open standards.\n\nhttps://en.wikipedia.org/wiki/Embrace,_extend,_and_extinguish\n\nOther notable instances of Microsoft being hostile to open source and Linux include their faux open Microsoft Office OpenXML formats, or Microsoft doing extorting Android phone manufacturers for each phone sold because the Linux kernel supposedly infringed on one of their patents.\n\nNowadays, though, Microsoft has completely changed their stance. First, Microsoft's president, Brad Smith said \"Microsoft was on the wrong side of history when open source exploded at the beginning of the century, and I can say that about me personally\"\n\nMicrosoft's CEO, Satya Nadella, went on stage with a \"Microsoft Loves Linux\" slide. Microsoft, nowadays, uses Linux in Azure, their could offering. They ship a Linux kernel in every WIndows install, for use with the Windows Subsystem for Linux.\n\nOn top of that, Microsoft has open sourced a bunch of stuff, including .NET Core, Visual Studio Code, Powershell, the original Edge Javascript engine, their own Fluid UI framework and SDK. Microsoft is also a contributor to the Linux kernel. Microsoft also has a FOSS Fund, which attributes money to FOSS projects.\n\nBut then, there's Github copilot. Microsoft acquired Github a while back, and they quickly started using all that open source code to good use. They implemented Copilot, some AI tool that helps developers write code by auto generating methods and functions, auto filling code, and more.\n\nSince it's been proven to actually copy entire patterns, it means that Copilot is just a copyright laundering machine: it takes open source code from open repos, and it copies that code into any other repo, without any license attached to it.\n\nThen there's the requirements for some computers, that microsoft has added. For enterprise PCs, Windows has something they call Secure Core, which means that out of the box, these PCs can't boot Linux at all, you'll have to enter the BIOS and disable that feature.\n\nLast, there are still some issues that illustrate that Microsoft does NOT understand how the open source community works and reacts, which leads to a few problems. The latest one was their new app store policy on Windows. It all started from a good place: they didn't want users to have 20 clones of GIMP or LibreOFFICE that were paid for, probably insecure, and generally were just copyright ripoffs of the originals.\n\nSo they added some clauses to their policy that said open source apps can't be monetized on our store. And they pushed these changes as is, without talking it over, and announcing it beforehand.", "link": "https://www.youtube.com/watch?v=tJdHAJnKqFs", "date_published": "2022-09-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]