[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "The A's: Tiny Desk Concert", "description": "Bob Boilen | December 1, 2022\nIt was clear from the outset, those very first harmonies, that this was to be a playful, fun-filled day at the Tiny Desk. For one thing, the two A's, Amelia and Alexandra, are Tiny Desk alums. Amelia Meath made her Tiny Desk concert debut in 2015 with Nick Sanborn as Sylvan Esso. She returned in 2019 with her Vermont college mates Mountain Man which includes Alexandra Sauser-Monnig along with Molly Erin Sarlé. Alexandra's project, Daughter of Swords, was here not long before the COVID outbreak.\n\nThis summer, Amelia and Alexandra put out a delightful album of songs titled Fruit, including the yodeling a cappella cowboy tune that opens this Tiny Desk, \"When The Bloom Is On the Sage.\" Other songs include the folk song \"Swing and Turn Jubilee,\" accompanied by Alexandra on acoustic guitar, with Amelia gently stomping her thick-soled Buffalo sneakers on stones to keep the beat.\n\nAmelia and Alexandra's identical leaf-and-bird-patterned dresses, dark lipstick and even darker sunglasses add an eeriness to these sublime songs. This leads us to the final song in the set, a tune Amelia says will guide her friends on what to do upon leaving this earth. The lyrical instructions in \"When I Die\" include singing and dancing, drinking to life, flowers to perfume the air and a bonfire to light the way home. Even in the face of death, The A's kept a smile on my face.\n\nSET LIST\n\"When The Bloom Is On the Sage\"\n\"Swing and Turn Jubilee\"\n\"Werewolf\" \n\"Wedding Dress\"\n\"When I Die\"\n\nMUSICIANS\nAmelia Meath: vocals\nAlexandra Sauser-Monnig: vocals, acoustic guitar\n\nTINY DESK TEAM\nProducer: Bob Boilen\nDirector: Joshua Bryant\nAudio Engineer: Josh Rogosin \nSeries Producer: Bobby Carter\nEditor: Sofia Seidel\nVideographers: Joshua Bryant, Maia Stern, Sofia Seidel\nAudio Assistant: Neil Tevault\nProduction Assistant: Jill Britton\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Kara Frame, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #theas", "link": "https://www.youtube.com/watch?v=C3Y_thL0juU", "date_published": "2022-12-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]