[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Battlefield 1’s Guns PART 2", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down more of the weaponry of Battlefield 1, including the Cei-Rigotti rifle, the Hellfighter M1911, and a range of experimental period weaponry from the early 20th century.\n\n00:00 - Opening\n00:52 - Hellfighter M1911\n03:20 - Howell Automatic Factory\n05:45 - IMG 08/18 Low Weight Machine Gun\n07:26 - M1907 SL Sweeper\n08:53 - M1903 Experimental\n11:19 - Martini-Henry Infantry\n13:14 - M1917 MG Low Weight\n14:16 - M1909 Benét-Mercié\n15:27 - Cei-Rigotti Factory\n17:06 - RSC SMG Factory\n18:07 - ‘The Medicine’ Russian 1895 Sniper\n19:54 - SMG 08/18 Factory\n21:34 - Sjögren Inertial Slug\n22:33 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Battlefield 1 and compares them to their real-life counterparts.\n\nYou can check out C&Rsenal’s video on the Pedersen Device here - https://www.youtube.com/watch?v=cikek5njqdM\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=g317yW6Sdvo", "date_published": "2022-11-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 Ramattra Official Gameplay Trailer", "description": "Overwatch 2's latest tank hero is Ramattra, a relentless omnic fighting for the survival of his people. \n\nOverwatch’s first tempo tank, Ramattra combines various lethal playstyles as he transitions between his Omnic and Nemesis forms. Get acquainted with Ramattra’s ability kit in his Gameplay Trailer and get ready for his debut in Season 2 on December 6.\n\n#overwatch2 #overwatch #gaming", "link": "https://www.youtube.com/watch?v=sEd8OF0EFGE", "date_published": "2022-11-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Callisto Protocol Live Action TV Spot Trailer (Red Band)", "description": "Fear takes no prisoners in The Callisto Protocol’s live-action tv spot starring Josh Duhamel. Learn what it takes to survive Black Iron Prison when The Callisto Protocol launches December 2nd, 2022, on PlayStation, Xbox, and PC platforms.\n\n#callistoprotocol #gaming", "link": "https://www.youtube.com/watch?v=dUFpOpkTvqU", "date_published": "2022-11-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Warhammer 40,000: Darktide - Everything To Know", "description": "Warhammer 40K: Darktide is a first-person co-op shooter with gameplay similar to that of Warhammer Vermintide 2, developer Fatshark’s previous game.\n\nAt launch, you’ll have your pick of one of four classes. These include: \nThe Verteran Sharpshooter, a class that specializes in ranged combat. Sharpshooters start the game with a Kantrael Mk VII Lasgun as well as a standard-issue munitorum sapper shovel in case they need to get up close and personal. This class is a good choice against Elites and special enemies, has increased ammo capacity and can slow their movement for increased weak spot damage, accuracy and handling. \n\nThe Psyker Psykinetic, a class that can manipulate empyrean forces with their mind and use it to pop enemy skulls like balloons. Killing with this power, simply called Brain Burst, stores a Warp Charge that can be used to knock enemies away from them. However, Psykers are not just limited to their minds; they also get a Stub Revolver and a combat sword.  \nThe Zealot Preacher, a class that specializes in high-damage melee attacks: damage that increases based on their missing health. The Preacher is effective against armored enemies, has high melee attack speed, and can dash forward for the upper hand in combat. This class starts out with a combat axe as well as an autopistol. \n\nLastly, there's The Ogryn Skullbreaker, another melee focused class with increased damage in that category. They’re good against hordes, effective at staggering and suppression, and can revive teammates faster. The Skullbreaker starts the game with a pipe club and a Thumper.\n\nWarhammer 40,000: Darktide will release on PC via Steam and the Microsoft Store on November 30, 2022. The Xbox Series X|S version of the game does not have a release date at the time of this recording, however developer Fatshark stated the Xbox version “will launch shortly after PC.”\n\n#warhammer40k #gaming #gamespot", "link": "https://www.youtube.com/watch?v=0Hfi58Lpiq8", "date_published": "2022-11-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]