[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyNtlmLB73-7gtlBz00XOQQ", "title": "Why It's Rude to Suck at Warcraft", "description": "You enter a bright new digital world, exited to explore and hyped just to enjoy the vibe. Ten months later you're yelling at someone for standing in fire. What changed?\n\nProduced by Dan Olson\nWritten by Nathan Landel and Dan Olson\n\nChoice's channel - https://www.youtube.com/c/Choice_au\n\nBibliography\nA Reports/Books/Articles\nAsk, Kristine, ‘The Value of Calculations: The Coproduction of Theorycraft and Player Practices’ (2016) 36(3) Bulletin of Science, Technology & Society 190.\nBoellstroff, Tom, Coming of Age in Second Life: An Anthropologist Explores the Virtually Human (Princeton University Press, 2008)\nChen, Mark, ‘Leet Noobs: Expertise and Collaboration in a World of Warcraft Player Group as Distributed Sociomaterial Practice’ (PhD Thesis, University of Washington, 2010) [Not: College of Education].\nConsalvo, Mia, Cheating: Gaining Advantage in Videogames (MIT Press, 2007) 28.\nEgliston, Benjamin, ‘Play to Win: How competitive modes of play have influenced cultural practices in digital games’ (Honours Thesis, University of Sydney 2013) [Not: School of Art, Communication and English] 24.\nGenette, Gérard, Paratexts: Thresholds of Interpretation (Cambridge University Press, 1997).\nGlas, René, Battlefields of Negotiation: Control, Agency, and Ownership in World of Warcraft (Amsterdam University Press, 2013).\nGolub, Alex, ‘Being in the World (Of Warcraft): Raiding, Realism, and Knowledge Production in a Massively Multiplayer Online Game’ (2010) 83(1) Anthropological Quarterly 17.\nIser, Wolfgang, The Fictive and the Imaginary: Charting Literary Anthropology (Johns Hopkins University Press, 1993) \nLehdonvirta, Vili and Edward Castronova, Virtual Economies: Design and Analysis (The MIT Press, 2014).\nMcArthur, Victoria et al, ‘Knowing, Not Doing: Modalities of Gameplay Expertise in World of Warcraft Addons’ in CHI ’12 Extended Abstracts on Human Factors in Computing Systems (ACM, 2012) 101.\nPrax, Patrick, ‘Co-Creative Interface Development in MMORPGs - the Case of World of Warcraft Add-Ons’ (2012) 4(1) Journal of Gaming & Virtual Worlds 3.\nSkare, Roswitha, ‘Paratext’ (2020) 47(6) Knowledge Organization 511.\nSkare, Roswitha, ‘The paratext of digital documents’ (2021) 77(2) Journal of Documentation 449.\nSteinkuehler, Constance, ‘The Mangle of Play’ (2006) 1(3) Games and Culture 199.\nTaylor, T.L, ‘Does WoW Change Everything?: How a PvP Server, Multinational Player Base, and Surveillance Mod Scene Caused Me Pause’ (2006) 1(4) Games and Culture 318.\nTaylor, T.L, ‘The Assemblage of Play’ (2009) 4(4) Games and Culture 331.\nTaylor, T.L, Play Between Worlds: Exploring Online Game Culture (MIT Press, 2006).\n\nB Other\nCrusader3455, ‘MIESTRO DOES A LEGIT 2v3 AT 2500 CR’ (YouTube, 30 August 2022)\nAzAMOus, ‘It’s 2922 and You Enter Utgarde Keep’ (YouTube, 29 September 2022)\nMark Chen, ‘Mark Chen presenting Leet Noobs 10 years later’ (YouTube, 12 March 2021)\n\nhttps://www.pcgamesn.com/world-of-warcraft/wow-legion-max-camera-distance\n\nCrowdfunding: https://www.patreon.com/foldablehuman\nTwitter: https://twitter.com/FoldableHuman\n\n00:00:00 Preface\n00:01:28 Chapter 1 - Instrumental Play\n00:17:58 Chapter 2 - Paratext\n00:31:44 Chapter 3 - How Add-ons Ruined my Manchildhood\n00:40:50 Chapter 4 - Join a Guild, They Said\n00:56:45 Chapter 5 - WoW Classic, A Hellscape of Instrumental Practices\n01:12:03 Chapter 6 - Decomposing the World\n01:19:37 Conclusion", "link": "https://www.youtube.com/watch?v=BKP1I7IocYU", "date_published": "2022-11-25 23:51:03+00:00", "persistent": false, "user": null, "language": "en-US"}]