[{"source": "https://www.theguardian.com/rss", "title": "Tell us about the hobbies passed down in your family", "description": "<p>We would like to hear from people in the UK who have a shared passion for a sport, hobby or activity with a loved one</p><p>Whether you’ve taught your grandchild how to macramé, or your dad passed on a passion for playing the sitar, we want to hear about the shared hobbies that span generations in your family.</p><p>Have you got a shared interest with a family member that has made you closer over the years? Or a hobby that reminds you of a loved one? Is it something you do or used to do, together? Get in touch to tell us about it and about how it enriches your life.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/nov/25/tell-us-about-the-hobbies-passed-down-in-your-family\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/nov/25/tell-us-about-the-hobbies-passed-down-in-your-family", "date_published": "2022-11-25 17:42:37+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘All the heavy weight on my shoulders lifted’: how Crisis became a lifeline for one man experiencing homelessness", "description": "<p>After losing his job during Covid, Andrei eventually became homeless. But making contact with the homelessness charity Crisis helped him turn his life around</p><p>Before Covid, Andrei* counted himself as one of the lucky ones. He had moved to the UK from Romania to build himself a better life. Five years later, he had a job and a place to call home with a live-in landlord who had become his friend. But the pandemic turned his life upside down. The warehouse where he worked cut back on staff to meet social distancing guidelines, so his short-term contract wasn’t renewed, and he found it impossible to secure another warehouse job as many companies were making cuts.</p><p>He eventually found work with a jewellery business, but he was let go when the company began to struggle financially. With no job, he couldn’t pay his rent and, because he had never signed a formal tenancy agreement, he had no legal rights when his landlord locked him out.</p> <a href=\"https://www.theguardian.com/ending-homelessness-with-crisis-at-christmas/2022/nov/25/all-the-heavy-weight-on-my-shoulders-lifted-how-crisis-became-a-lifeline-for-one-man-experiencing-homelessness\">Continue reading...</a>", "link": "https://www.theguardian.com/ending-homelessness-with-crisis-at-christmas/2022/nov/25/all-the-heavy-weight-on-my-shoulders-lifted-how-crisis-became-a-lifeline-for-one-man-experiencing-homelessness", "date_published": "2022-11-25 09:40:44+00:00", "persistent": false, "user": null, "language": "en-UK"}]