[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCW0gH2G-cMKAEjEkI4YhnPA", "title": "Gúthwinë, Sword of Éomer by United Cutlery UNBOXING UC3383 | Lord of the Rings Collectibles Review", "description": "United Cutlery sent me one of the most unique swords in all the Lord of the Rings trilogy - Gúthwinë, the sword of Éomer! I'll give an up-close look at this replica and compare it to Andúril and Herugrim - another Rohan sword!\n\nCheck out this and Middle-earth United Cutlery products here!: https://bit.ly/3GXNB9f\n\nGúthwinë, Sword of Éomer: https://bit.ly/3GXNB9f\nHelm of Éomer: https://bit.ly/3FRrn7f\n\nOfficial Description:\nÉomer was a captain of the king’s cavalry, Marshal of the Mark, and one of Rohan’s mightiest warriors. He skillfully wielded his royal sword, Gúthwinë, and used it to slay many Orcs and Uruks of Isengard that dared trespass into Rohan. He bravely fought alongside King Theoden against the forces of Mordor at the battle of Helm’s Deep and on the Pelennor Fields. In the final stand against the dark lord Sauron, Éomer fought alongside Aragorn with the armies of Rohan and Gondor at the Gates of Mordor. This authentically detailed replica is a reproduction of the actual filming prop built by Weta Workshop and used in The Lord Of The Rings films presented by New Line Cinema. This 34” long sword was made using only the finest grade materials and craftsmanship available. It features brass-finished, cast metal hilt parts, a genuine leather-wrapped grip, and a 27” stainless steel blade with engraved fuller grooves.\n\nWhile this was sent to me by a vendor, I was under no obligation to give this item a positive review.  Any praise/criticism in my reviews is my genuine opinion/thoughts.  If you are surprised that I really enjoy a LOTR piece of memorabilia, you really shouldn't be. :)\n\n#lordoftherings #unboxing #lotr", "link": "https://www.youtube.com/watch?v=JlXAoxsypLM", "date_published": "2022-03-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]