[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Linux is NOT about choice", "description": "Install the Startpage Privacy protection extension for free: https://add.startpage.com/en/protection/?campaign=4&source=aff \n\n150€ off the Slimbook Executive ultrabook with code executive-laptop-nick-friends: https://slimbook.es/en/executive-en\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:26 Sponsor: this extension makes your web browsing prvate\n01:33 Linux OFFERS choice\n03:15 Developers have choices too\n05:42 Choice is a byproduct, not a core value\n07:57 The cost of choices\n09:39 Parting Thoughts\n10:41 Sponsor: 150€ off your Slmbook Executive Ultrabook\n11:07 Support the channel\n\nLinux desktops have traditionally offered a lot of choice. On the one hand, it means that virtually anyone can end up with the exact system they love, that works exactly how they want it, down to the smallest detail.\n\nOn the other hand, it also means that beginners don't know where to start when trying to move to Linux.\n\nFinally, that huge amount of choice also means that maintaining our desktops is an increasingly complex task: as you add features and options for everything, your number of test cases increases, and the possibility of breakage and bugs skyrockets.\n\nWhich leads us to developer choice.\n\nLet's get this out of the way: developers can do whatever they want. They're the ones creating the software we use. Whether they work on an application, on a desktop environment, on a small subsystem, or on the Linux kernel, they're the ones that make our experience with Linux possible.\n\nWhich also gives them a lot more power over all of this than us, regular users.\n\nIn any case, the time they spent is allocated however they please. If they don't want to fix a specific bug, or implement a feature they don't like, they don't HAVE to. They don't owe us, the users, anything. \n\nDevelopers also have choices: the choice to work on a new option, that has to work with every other option there is, and that will have to be maintained with each refactoring of the code, each update, each library change. They have the choice to support themes or not. To support dark mode or not, to fix a very annoying bug, or not.\n\nLinux desktops offer tons of choices. But these choices are byproducts of the free and open source nature of our programs, kernels, and apps. They're not an inherent part of the Linux experience.\n\nWe have choices because everyone can contribute some code, fork a project, create their own version of an application, or a desktop environment, and with each new project or fork, the number of possible combinations increase.\n\nWe don't have all these choices because there is an ethical obligation for them to exist., or because Linux mandates that people have every choice available to them. Nowhere has it ever been written, or agreed, that if a developer makes something based on Linux, they HAVE to implement each option that everyone wants, or thinks they need.\n\nProjects that refuse to implement certain features are not \"going against the Linux philosophy\". They're not \"ignoring their users\", they don't \"disrespect Linux\" or whatever else. They just make choices, as developers, as UX designers, as project leaders. They make the choices they want, to reach the goal they have.\n\nWhen a developer team decides to add a preference or a feature, it's not just a \"set it and forget it\" act. As everyone who has ever worked on software will tell you, each preference has a cost.\n\nAdding more preferences make testing and QA more complicated. Each option multiplies the number of cases you have to test for. Certain option combos can result in bugs, and each time you fix something on another preference, or change how something behaves, that's one more potential point of failure.", "link": "https://www.youtube.com/watch?v=kytTbwj6miM", "date_published": "2022-02-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]