[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC_7PqixGIdE-jjoHKMPYpGA", "title": "Czy kremy z filtrem mają sens?", "description": "📚 Kup moją najnowszą książkę ► https://siedem.alt.pl\n\n👉 Patronite ► https://patronite.pl/NaukowyBelkot \n📚 Moja książka ► https://altenberg.pl/geny/\n📚 E-book ► https://tinyurl.com/pnp-ebook\n🎧 Mix audio ► http://ratstudios.pl/\n\nPytanie niby letnie... No nawet nie niby... Film nagraliśmy w lecie ale przez choroby wychodzi teraz. W październikowej zwyżce temperatury i przy pięknej pogodzie. Uwierzcie mi - nawet jesienią warto taki film obejrzeć\n\n===\nRozkład jazdy:\n\n0:00 To zdradliwe Słońce\n2:35 Co nam daje raka?\n8:07 Co nam robią kremy z filtrem?\n11:54 Po co nam to robią?\n14:59 I czy to jest to, o czym się mówi?\n19:40 Czy są bezpieczne?\n24:30 Nieważne! I tak warto je stosować!\n\n===\nŹródła (wybrane):\n\nE. da Silva i in. - Use of sunscreen and risk of melanoma and non melanoma skin cancer: a systematic review and meta-analysis\nJ. van der Pols i in. - Prolonged Prevention of squamous cell carcinoma of the skin by regular sunscreen use\nA. Green i in. - Reduced melanoma after regular sunscreen use: randomized trial follow-up\nM. Sander i in. - The efficacy and safety of sunscreen use for the prevention of skin cancer\nC. Rueegg i in. - Challenges in assessing the sunscreen-melanoma association\nB. Krone i in. - Protection against melanoma by vaccination with BCG and/or vaccinia: an epideimology-based hypothesis on the nature of melanoma risk factor and its immunological control\nYong i in. - Vitamin D: one more argument for broad-spectrum ultraviolet A + ultraviolet B sunscreen protection\nR. Neale i in. - The effect of sunscreen on vitamin D: a review\nR. Waldman i in. - The role of sunscreen in the prevention of cutenous melanoma and nonmelanoma skin cancer\nM. Ghazipura i in. - Exposure to benzophenone-3 and reproductive toxicity: A systematic review of human and animal studies\nM. Matta i in. - Effect of sunscreen application under maximal use conditions on plasma cocnentration of sunscreen active ingredients", "link": "https://www.youtube.com/watch?v=nOppM3GFEN4", "date_published": "2022-10-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]