[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Choo Choo Charles Official Release Date Trailer", "description": "Choo-Choo Charles is coming to Windows on Steam December 9, 2022!\n\n#choochoocharles #gaming", "link": "https://www.youtube.com/watch?v=p1pnCCmc_OE", "date_published": "2022-10-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To MORE Hunt: Showdown Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Hunt: Showdown, including a few requests from the game’s developer, such as the Sparks Pistol, the Romero Alamo, and the Schofield Revolver.\n\n00:00 - Opening\n00:52 - Berthier Modèle 1892 Artillery Carbine\n01:46 - Colt Walker\n03:13 - Browning Auto 5\n05:10 - Mauser C69\n08:01 - Updated Sharps 1874 \n09:02 - Developer Request - Sparks Pistol\n09:54 - Developer Request - Romero Alamo\n10:56 - Developer Request - Schofield Revolver\n11:52 - Winchester Model 1887\n13:02 - Winchester Model 1894\n21:45 - Lebel 1886\n23:25 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Hunt: Showdown and compares them to their potential real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nRoyal Armouries’ Boarding Axe Carbine Video - https://www.youtube.com/watch?v=s7GnbhiNUbk&t=50s\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=4klpEDZwtnQ", "date_published": "2022-10-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Hunt Showdown Devs Respond to Firearms Expert Reacts", "description": "We got the chance to sit down with a couple of the developers of Hunt: Showdown to chat about how they implemented feedback from our firearms expert himself, Jonathan Ferguson. \n\n00:00 - Opening\n00:24 - Developer Reaction to Firearms Expert\n03:19 - Design Resources\n05:29 - Sparks LLR Updates\n07:33 - Community Engagement\n08:32 - Design Changes\n\nIn this bonus video in the Firearm Expert Reacts series, our chat with the Hunt developers covered everything from their response to the original Expert Reacts video from March 2021, what they changed in the game’s art and animation, and how they approached the game’s weapon design.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=YllsoG-ieZs", "date_published": "2022-10-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Modern Warfare II Official PC Trailer", "description": "It's time to deploy into action in COD: Modern Warfare 2. Check out the latest PC trailer that showcases the various features coming including: 4K graphics, ultrawide support, Ricochet Anti-Cheat, 500 PC customization options and more.\n\n#cod #mw2 #gaming", "link": "https://www.youtube.com/watch?v=eR15IpafwvQ", "date_published": "2022-10-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Get a Steam Deck, No Reservation | GameSpot News", "description": "Getting a Steam Deck just got a lot easier, Hideo Kojima is teasing his next project again, and Forza Horizon 5 is getting its biggest update yet.\n#SteamDeck #HideoKojima #ForzaHorizon5 \n\nNothing feels quite like good news on a Friday! For those of you still looking to order a Steam Deck, you’re in luck because you no longer have to make a reservation or wait in a virtual line to buy one. Instead, you can buy it on demand--you know, the way you purchase everything else in your life… Well, except a PS5. Valve has also unveiled the device's promised docking station, which costs $89 and ships in 1-2 weeks. This premium accessory includes not only HDMI, Displayport, and 3 USB 3.1 connectors, but also an Ethernet port.\n\nIn a tweet announcing the Deck’s new availability, Valve also noted a few nice features that were added in a recent update. These include expanded docking station options, simplified Chinese, Japanese, and Korean keyboards, better trackpad typing, and improved stability in offline mode. It also includes several advanced control commands, including remapping certain commands when holding a button, as well as nested menus for more complicated PC games.\n\nBut even though the wait for more Steam Deck is over, the wait for Hideo Kojima’s next game is still going. However it seems you won’t have to wait much longer, as his studio Kojima Productions begins to pull the curtain back on its next project, revealing that the actress Elle Fanning will appear in it. Kojima revealed this as part of PAX Australia, which is going on now in Melbourne.\n\nThe first teaser for the mysterious game was revealed during the Tokyo Game Show last month. Additional teasers are coming, and if they follow tradition, a major game event might again be the host. If that's the case, the next big gaming event this year is Gamescom Asia at the end of October. After that, Kojima's pal Geoff Keighley is hosting The Game Awards in December.\n\nSTAMPS\n00:00 - Intro\n00:08 - Steam Deck\n01:10 - Hideo Kojima\n02:20 - Forza Horizon 5 Update", "link": "https://www.youtube.com/watch?v=SU_VmmeJRF4", "date_published": "2022-10-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mapping Out Cyberpunk Edgerunners.| Cyberpunk 2077", "description": "Cyberpunk: Edgerunners, the new hit Netflix anime based on CD Projekt Red's Cyberpunk 2077, isn't just set in Night City, but it just about every scene is actually a location from the game. So, here is Mapping Out Cyberpunk: Edgerunners.\n#cyberpunkedgerunners #edgerunners #cyberpunk2077 \n\nIn this Cyberpunk: Edgerunners location guide, we take you from Arasaka Tower and the Corpo Plaza, with its holo koi fish, to the Megabuildings of Santa Domingo and Japantown, where characters like David Martinez and Lucy reside.\n\nFrom stunning views to trying to Parkour our way up a Megabuiding, this is a full stop guide of Cyberpunk: Edgerunners episodes 1, 2, 3, 4, and 5.\n\nWhen I first started Cyberpunk Edgerunners, I thought: Oh, cool! They included locations from Cyberpunk 2077 like the Memorial Park near Arasaka Tower with the holo Koi Fish. Or - of course, important locations like the Afterlife bar. And… in doing research and some exploration, that was when I discovered that the number of locations shown in Edgerunners that you can find in Cyberpunk 2077 is staggering.\n\nIf you enjoy this video, make sure to check out more from GameSpot on Cyberpunk 2077 and Cyberpunk: Edgerunners.", "link": "https://www.youtube.com/watch?v=MiUVGLc9KCU", "date_published": "2022-10-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mortal Kombat 30th Anniversary Official Trailer", "description": "Celebrate 30 years of Mortal Kombat with this latest anniversary trailer featuring video games, to movies, to animation. \n\nAs part of the anniversary, Klassic Movie Raiden will arrive in Mortal Kombat Mobile beginning Oct. 7 through Oct. 11, featuring actor Christopher Lambert’s character likeness and voice from the 1995 film. \n\n#mortalkombat #gaming", "link": "https://www.youtube.com/watch?v=Ym2_AaBCjqg", "date_published": "2022-10-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 Kiriko Official Cinematic Trailer", "description": "The protector of Kanezaka strikes again. Discover the two sides of Kiriko, the loving daughter and the deadly protector in this latest animated short.\n\nPlay Overwatch 2 for free today on Windows PC and Xbox Series X|S, Xbox One, PlayStation 5, PlayStation 4, and Nintendo Switch consoles. \n\n#overwatch #overwatch2 #gaming", "link": "https://www.youtube.com/watch?v=KTfI4JgzdLE", "date_published": "2022-10-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]