[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "18 MORE Things You STILL Didn't Know In Zelda Breath Of The Wild", "description": "The list of secrets and weird glitches in Breath of the Wild continues to grow, such as bokoblins stealing your horse, eating your own paraglider and sheikah slate, and the Yiga Blademasters able to carry around the ancient flame.\n\nIn the video above, we cover 18 facts, tips and tricks that aren’t quite as well known, ranging from secrets to glitches, some that are pretty simple and others that are fairly complex. The Legend of Zelda: Breath of the Wild has been out for four years at this point, and players have found some amazing things, intended or not, that keep the game and its sense of discovery feeling fresh.\n\n0:00 Intro\n0:15 Hinox Can Solve Puzzles For You\n0:35 Hold And Eat The Paraglider And More\n1:19 All Fairy Locations\n1:45 Ignited Flame Weapons Substitute Updrafts\n2:02 Mario Club Test Dungeon\n2:43 Skydiving Was In Taken Out Of BOTW\n3:10 Yiga With Ancient Flames\n3:34 Sidon Holds A Unique Blade\n3:45 Lizalfos Can Block Barehanded\n4:00 Promotional Art Locations\n4:29 Save File Unix Time\n5:01 Shoot Both Ropes\n5:18 Zora Use Goron Tools\n5:35 Fight 20 Enemies At Once\n6:01 Triforce Plaque Secrets\n6:21 Obstacle Course Directions\n6:44 Intro Storyboard\n7:11 Bokoblins Can Steal Your Horse\n7:33 Outro\n\n#BOTW", "link": "https://www.youtube.com/watch?v=Z0QwLr3Pf2s", "date_published": "2022-03-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New World’s Biggest Update Since Launch | GameSpot News", "description": "New World Heart of Madness update details are revealed, Fortnite leak reveals lightsabers may return and Sonic and Candy Crush collaborate. \n\nNew World’s latest update will arrive tomorrow, March 29. It features the new Tempest’s Heart expedition and a new Blunderbuss weapon. Other changes range from the removal of costs associated with moving items in storage between towns to the ability to check your inventory while moving. \n\nA Fortnite dataminer has apparently discovered that Chapter 3 Season 2 will add four different lightsabers including those that belong to Kylo Ren, Luke, Rey and Mace Windu.Lightsabers were initially added to Fortnite in 2019 and came back in May 2020 to celebrate Star Wars Day.\n\nSonic The Hedgehog and friends will appear in Candy Crush Saga in celebration of Sonic 2's theatrical release. Only those who have reached level 25 will be able to participate in this special event that will last from March 31 to April 4. \n\nSTAMPS\n00:00 - Intro\n00:07 - New World\n01:24 - Fortnite\n02:29 - Candy Crush", "link": "https://www.youtube.com/watch?v=vWpC38xn_Rc", "date_published": "2022-03-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "History of Borderlands", "description": "Few games have promised and then delivered as much mayhem as Borderlands, the loot ‘em up from Gearbox Software. With the release of its spin-off, Tiny Tina’s Wonderlands, we decided it was time to take a look back, so here’s the History of Borderlands.\n\nSince 2009, Gearbox Software's Borderlands series has been full to the brim with explosions, quirky characters, mountains of loot, and of course, hundreds of thousands of guns to collect. With the release of the latest spin-off, Tiny Tina's Wonderlands, we thought it was a perfect time to look back on how Borderlands was made, and the impact the series has had on the world of gaming.\n\nBorderlands launched shoulder to shoulder with juggernauts like Uncharted 2, Halo 3: ODST, and Modern Warfare 2 in 2009, but was a surprise hit, meaning that sequels and spin-offs, and pre-sequels weren't far behind. Borderlands was a juggernaut, with players loving its humor, gameplay, as well as mixing and matching the abilities of the playable Vault Hunters. From Handsome Jack to series mascot Claptrap, there's been no shortage of quotable and lovable Borderlands characters. The series also experimented with Tales from the Borderlands, a narrative adventure game made by Telltale Games in collaboration with Gearbox.\n\nIn our Tiny Tina's Wonderlands review, Darryn Bonthyus gave the game 7/10, saying that the game is an easily digestible adventure with fantasy flavor, but struggles to find its own identity. For more on Borderlands and Tiny Tina's Wonderlands, make sure you subscribe to GameSpot.\n\n0:00 Introduction\n0:19 Borderlands (2009)\n5:10 Borderlands 2 (2012)\n8:29 Borderlands: The Pre-Sequel! (2014)\n9:53 Tales from the Borderlands (2014)\n11:18 Borderlands 3 (2019)\n13:00 Tiny Tina's Wonderlands (2022)", "link": "https://www.youtube.com/watch?v=1qDnF2fbHF8", "date_published": "2022-03-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]