[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Highs And Lows Of Modern Warfare 2's Launch | GameSpot News", "description": "Modern Warfare 2 multiplayer launches with some high highs and low lows, Phil Spencer talks more about Call of Duty exclusivity, and EA expands its upcoming Marvel gaming lineup. All this on today’s GameSpot News.\n#Gaming #CallOfDuty #ModernWarfare2 #MW2 #MWII \n\nModern Warfare II multiplayer launches with some high highs and low lows, Phil Spencer talks more about Call of Duty exclusivity, and EA expands its upcoming Marvel gaming lineup. All this on today’s GameSpot News.\n\nCall of Duty: Modern Warfare II was just released on Friday, and it had a massive launch on PlayStation. The company has announced that Modern Warfare II has become the \"biggest PlayStation Store launch\" of all time for the Call of Duty series. This includes both preorders and day-one sales, Sony said.\n\nThe game is seemingly performing well on other platforms, too (of course), as Modern Warfare II ranks No. 1 on the Xbox best-seller list and is topping the charts on PC via Steam as well.\n\nSomething else that should come as no surprise is that the game has had its fair share of issues since releasing also. Developer Infinity Ward has had to disable attachment tuning, a new feature that allowed players to more precisely tweak their weapons, due to game crashes. Pinging is also currently unavailable in the game as a bug would lead to players being permanently pinged and their location highlighted through a match if an opponent were to ping them as their death animation played out.\n\nWe on the GameSpot team ourselves have experienced some of these issues. I myself was in the middle of tuning one of my attachments until I backed out and *poof* my tuning was gone. I also was unable to load up the campaign when multiplayer dropped without restarting the mission I was very close to beating. And I also had a price of $5000 attached to all my weapons before starting a match. Our supervising producer Aaron Sampson had random crashes, video producer Jake Dekker had issues with freezing and getting kicked out of games when someone left his party *VO trails off*\n\nHopefully Activision is able to address these issues with an upcoming patch soon. For more info on everything Modern Warfare II, check out our plethora of videos on the game here at GameSpot.\n\nTIMECODES:\n00:16 - Modern Warfare 2 launch\n02:13 - Phil Spencer on COD exclusivity\n03:09 - EA and Marvel", "link": "https://www.youtube.com/watch?v=w3-lB1ZaHas", "date_published": "2022-10-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War Ragnarok: The Mythology Behind Odin & Freya", "description": "Ragnarök is coming, and Kratos and Atreus must battle their way through the Norse apocalypse. Yet, while the end times may be upon Kratos, there are those who hope to stop the coming final battle, including the greatest of the Aesir… Odin and his wife Freya. The tale of Odin and Freya, both in legend and the game, is a fraught one, and will lie at the center of God of War Ragnarok. So let’s look at the history of Odin and Freya in Norse Mythology, discuss how that compares to their God of War counterparts, and what that might mean for God of War Ragnarok.", "link": "https://www.youtube.com/watch?v=NxMtyNcgSWA", "date_published": "2022-10-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]