[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC6oHLp5r0FcXwzxmWzL1aSg", "title": "Man Born in 1853 Talks About Childhood in the 1860s- Enhanced Video & Audio [60 fps]", "description": "This is Elihu Thomson, engineer and inventor born on March 29, 1853. In this video, he talks about some childhood memories while living in Philadelphia in the 1860s.  It was filmed on June 21, 1932.  This video has been colorized, speed-adjusted and restored with audio enhancements for clarity.\nNote: Thomson meant to say \"75 years ago\" rather than \"65 years ago\" in the beginning.  His family shipped over to America in 1857. \n\nOur new music channel - Life in the Music\n2-hour videos of music from the 1600s-1900s\nhttps://www.youtube.com/channel/UC24pSII56FIBAAI3FAu_ygw/featured\n\nElihu Thomson was born March 29, 1853, in Manchester, England. His father,\nwho worked as a mill mechanic, was thrown out of work in 1857 and decided to\nemigrate to the United States. In 1858 the family settled in Philadelphia,\nwhere Elihu grew up. His father's work as a mechanic stimulated Thomson's\ninterest in mechanical and chemical processes. From his early teens he read\nwidely, built models, and conducted simple chemical experiments. At\nPhiladelphia's Central High School Thomson was an outstanding student who\nattracted the interest of his instructors. Upon graduating in 1870 he was\noffered a teaching position at the school.\n\nBetween 1870 and 1880 Thomson taught high school in Philadelphia. At the same\ntime he and a fellow teacher named Edwin J. Houston experimented with\nelectricity and succeeded in building a practical electric arc lighting\nsystem. In 1879 a group of New England businessmen took an interest in\nthe Thomson-Houston arc lighting system and offered to finance its fabrication.\nIn 1880 Thomson moved to New Britain, Connecticut, as the company's chief\nengineer. By 1881 Thomson had designed the best arc lighting system in the\ncountry, but sales were slow. In 1882 a group of Lynn, Massachusetts,\nbusinessmen purchased the company and changed the name to the Thomson-Houston Electric Company.\n\nFor this video, I colorized it using AI optimization software, interpolated it to 60 frames/second, speed-adjusted it and refined it with De Blur, Sharpness and Stabilization.  For the audio, I remastered it using noise gate, compression, loudness normalization, EQ and a Limiter.  \n\nThis video is made for educational purposes for fair use under section 107 of the Copyright Act 1976.", "link": "https://www.youtube.com/watch?v=_oqbLSisnME", "date_published": "2022-03-19 00:00:00+00:00", "persistent": true, "user": "rumpel", "language": "en", "tags": ["archive"]}]