[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Can you use the STEAM DECK as a \"REAL\" PC?", "description": "Download Safing's Portmaster, or subscribe to the SPN, and take control of your network traffic: https://safing.io/portmaster\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\nYou can also protect your privacy by using this extension from Startpage, each install helps the channel with a small commission: https://add.startpage.com/en/protection/?campaign=4&source=aff \n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:30 Sponsor: Regain control of your internet connection\n01:13 Everyday tasks\n04:24 Gaming (yes, desktop Gaming. Don't laugh)\n06:11 Office and Productivity\n07:54 Development\n10:17 And a LOT more...\n11:18 Can you use it as a laptop?\n14:11 Sponsor: Get your Linux laptop or desktop now!\n14:39 Support the channel\n\nYou can use your Steam Deck for virtually any day to day task. You can handle files and folders, you can transfer them through the network using something like Warpinator, or you can also just use a thumb drive.\n\nInstalling applications also works, and you have access to everything that's on Flathub. You also can get any application available as an AppImage.\n\nAll of this should basically get you covered for your everyday tasks: web browsing with Firefox or Chromium, including support for any extension you want, handling your files with Dolphin, the file manager, moving them around with Warpinator or a USB drive, or installing a calendar and email app like Geary or GNOME Calendar. Spectacle handles all your screenshot needs, you can install VLC for video playback, Spotify or YTMusic Desktop for youtube music, or any number of music players for your local collection, you even have a system monitor.\n\nNote-taking is also pretty easy, thanks to Obsidian being available on the Deck, as well as Joplin, Simplenote, Standard Notes, or Cherry Tree.\n\nYou've got your complete desktop Steam client, for all your Steam Games, but you can also install the Heroic Games launcher for Epic Games and Good Old Games, or Lutris, for virtually anything else.\n\nGames will support keyboard and mouse input, or using your Steam Deck as the controller while playing on a bigger screen. Discord works as well, and you can have an audio chat using Discord while you're gaming, or you can use the regular old Steam chat if you're playing a Steam game.\n\nIf you like to record your gameplay sessions or stream them, OBS is available on Discover as well.\n\nYou can install a plethora of office suites, like LibreOffice, or OnlyOffice, or even WPS Office.\n\nFor email and calendars, you can use Evolution, or the Kontact suite, and you'll get basically outlook, but made for KDE, and a bit harder to setup.\n\nVideo conferencing works perfectly as well using the onboard mic of the Steam Deck, and a USB webcam. You have access to Skype, Discord, Microsoft Teams or Zoom.\n\nYou can't install docker, for example, or run your own local server, at least not easily. You CAN access pacman, the package manager for arch, the Linux distro on which Steam OS is based, and  you CAN use it with the \"-r\" command line option to install stuff somewhere you actually have authorization to write on, but that's going to create a few problems as you'll have to define the PATH variables to most of the things you install this way, so it will make things a bit more complex. \n\nYou can also just use virtual machines. Because, yes, the Steam Deck supports virtualization, so you can install GNOME Boxes and run Vms, in which you'll be able to install any OS, any server you want, or compile your code there.\n\nYou have FreeCAD for CAD modeling, you've got tons of tools for students for data visualisation,  writing math formulas, plotting graphs...\n\nNow, if you're thinking of bringing the Steam Deck to class or meetings, and use it as a laptop, propped on some kind of dock, using a bluetooth keyboard and mouse, I'd say don't.", "link": "https://www.youtube.com/watch?v=9BO3pH48fM0", "date_published": "2022-03-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]