[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCjr2bPAyPV7t35MvcgT3W8Q", "title": "You Should Make A Digital Bugout Bag", "description": "Support independent research and analysis by joining my Patreon page: https://www.patreon.com/thehatedone \n\n\nInternational Red Cross recommends that all persons have an emergency survival kit with multiday supplies of the most essential items. This is in case of any natural or man-made crisis resulting in a need for evacuation or a major disruption of day-to-day services. \n\nPart of this emergency kit is what I would call a digital bug out bag. It includes:\n    • copies of personal documents\n    • cell phone with chargers or extra batteries\n    • family and emergency contact information\n\nMany if not all of these copies should be physical. But paper documents can easily get destroyed by floods, fire or collapse. They can be lost or stolen and in case of theft, your paper documents are not encrypted and they could be abused for fraud; which is the last thing you want to think about in a crisis.\n\nHaving a secure digital backup gives you an additional fail safe if all else is lost. Hopefully you will never be in a situation where you need this. But it’s always better to be prepared because this can save you the precious seconds that might be decisive in an emergency situation. \n\nSo in this short tutorial, I will guide you through the process of creating an encrypted digital backup on a microSD card, how to securely copy and store your files and how to protect it from theft, loss and physical elements. \n\nI will also extend this tutorial to include emergency items and apps that could help you better navigate through a crisis situation. This won’t take long so let’s begin.\n\nI chose a microSD card for this purpose because it is the most versatile storage medium for a digital bug out bag. Technically, a USB flash drive will be the most widely accepted standard among any modern computer, laptop or even mobile devices. \n\nSources\nOfficial Veracrypt Website: https://veracrypt.fr/en/Home.html\nDownload Veracrypt: https://veracrypt.fr/en/Downloads.html\nHow To Verify Veracrypt PGP Signatures: https://veracrypt.fr/en/Digital%20Signatures.html\nHidden Volumes Security Precautions: https://veracrypt.fr/en/Security%20Requirements%20for%20Hidden%20Volumes.html\nPlausible Deniability: https://veracrypt.fr/en/Plausible%20Deniability.html\n\nKeepassXC Password Manager: https://keepassxc.org/\n\nOsmaAnd: https://osmand.net/\n\nTrail Sense: https://github.com/kylecorry31/Trail-Sense\n\nOffline Wikipedia: https://en.wikipedia.org/wiki/Wikipedia:Database_download\n\nRed Cross Survival Kit: https://www.redcross.org/get-help/how-to-prepare-for-emergencies/survival-kit-supplies.html\n\nRed Cross Emergency Preparedness: https://www.redcross.org/get-help/how-to-prepare-for-emergencies/be-informed.html\n\nSplinterItIntoAThousandPiecesAndScatterItIntoTheWinds: https://nitter.net/wikileaks/status/839100031256920064\n\nHollow coin used by spies: https://www.fbi.gov/history/famous-cases/hollow-nickel-rudolph-abel \n\nCredits\nMusic by: White Bat Audio https://www.youtube.com/c/WhiteBatAudio\n\nFollow me:\nhttps://twitter.com/The_HatedOne_\nhttps://www.reddit.com/r/thehatedone/\n\nThe footage and images featured in the video were for critical analysis, commentary and parody, which are protected under the Fair Use laws of the United States Copyright act of 1976.", "link": "https://www.youtube.com/watch?v=qqboMMBOJRE", "date_published": "2022-03-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]