[{"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Ben Shapiro, Nelk Boys Talk Elon, DeSantis, And Daily Wire on Full Send Podcast", "description": "Kyle Forgeard, leader of YouTube sensations The Nelk Boys recently dropped by Nashville, where he hit up Daily Wire co-founder Ben Shapiro for his thoughts on politics, dating, Twitter, Brittney Griner, and how a certain media and entertainment company is taking on Hollywood in an interview this week. Forgeard and his Nelk Boys cast are ...", "link": "https://www.dailywire.com/news/ben-shapiro-nelk-boys-talk-elon-desantis-and-daily-wire-on-full-send-podcast", "date_published": "2022-12-22 21:22:36+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Alleged 37-Page Staffer Guide For Kyrsten Sinema: ‘It Is Your Job To Make Her As Comfortable As Possible’", "description": "A newly-revealed alleged 37-page staffer guide for Sen. Kyrsten Sinema (I-AZ) has raised concerns among ethics experts that she might be crossing the line in terms of the tasks that she allegedly demands of her staff. The memo, obtained by The Daily Beast, is effectively a long list of dos and don&#8217;ts for staffers to ...", "link": "https://www.dailywire.com/news/alleged-37-page-staffer-guide-for-kyrsten-sinema-it-is-your-job-to-make-her-as-comfortable-as-possible", "date_published": "2022-12-22 21:11:19+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "China-Based TikTok Employees Tracked U.S. Journalists, Citizens", "description": "The China-based parent company of TikTok said Thursday that an internal investigation revealed employees obtained private data of four U.S.-based tech journalists and other American users&#8217; information. ByteDance, the Chinese tech giant that owns the video-sharing app, was accused earlier this year of tracking multiple reporters at Forbes under a covert surveillance campaign, which led ...", "link": "https://www.dailywire.com/news/china-based-tiktok-employees-tracked-u-s-journalists-citizens", "date_published": "2022-12-22 20:10:22+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "We’re One Step Closer To Solving The Mystery Of Brandan Roneel, Plus A Question From The Audience", "description": "If you haven’t watched my show today, it’s a must-watch episode regarding the man of mystery Brandan Roneel.  As I explained recently, Roneel was a man who claimed to be a prodigious philanthropist and genius who wanted to donate to my organization Blexit a quarter of a million dollars via check back in 2020. I ...", "link": "https://www.dailywire.com/news/were-one-step-closer-to-solving-the-mystery-of-brandan-roneel-plus-a-question-from-the-audience", "date_published": "2022-12-22 20:05:39+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Thursday Afternoon Update: McConnell-Schumer Omnibus Passed, Arizona’s ‘Border Wall’ Coming Down, Chip Roy Plays Hardball", "description": "This article is a companion piece to today’s Morning Wire Afternoon Update. To listen to the podcast version, click here. McConnell-Schumer Omnibus Passed The U.S. Senate passed the $1.7 trillion, 4,000-plus page omnibus spending bill Thursday afternoon by a vote of 68-29, with 18 Republicans voting in favor of the measure. Arizona&#8217;s &#8216;Border Wall&#8217; Coming Down ...", "link": "https://www.dailywire.com/news/thursday-afternoon-update-mcconnell-schumer-omnibus-passed-arizonas-border-wall-coming-down-chip-roy-plays-hardball", "date_published": "2022-12-22 18:06:17+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "U.S. Economic Growth Upwardly Revised For The Third Quarter", "description": "The Commerce Department estimated economic growth in the third quarter at a 3.2% annualized pace, marking an upward revision from 2.9%. Real gross domestic product, the sum of all final goods and services produced in the economy, increased between July and September following two straight quarters of decline. The agency’s first estimate, which was released ...", "link": "https://www.dailywire.com/news/u-s-economic-growth-upwardly-revised-for-the-third-quarter", "date_published": "2022-12-22 17:59:11+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "WaPo Mocked For ‘Eye-Opening’ Study Saying Exercise Limits COVID Risks", "description": "The Washington Post took a virtual beating on Thursday over an article detailing the results of an &#8220;eye-opening&#8221; study that compared exercise habits and coronavirus outcomes. &#8220;Regular exercise protects against fatal covid, a new study shows,&#8221; the headline read — and the article went on to lay out some of the findings of the study, ...", "link": "https://www.dailywire.com/news/wapo-mocked-for-eye-opening-study-saying-exercise-limits-covid-risks", "date_published": "2022-12-22 17:51:10+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Iowa Sports Reporter Goes Viral Over Comments About Being Sent Out In The Cold To Cover Winter Storm", "description": "Iowa sports reporter Mark Woodley has gone viral after his station ended up sending him out in the cold to cover the winter storm that has hit the state because all sports had been canceled due to the blizzard. In a clip that surfaced on Twitter on Thursday from Woodley, the KWWL sports reporter cracked ...", "link": "https://www.dailywire.com/news/iowa-sports-reporter-goes-viral-over-comments-about-being-sent-out-in-the-cold-to-cover-winter-storm", "date_published": "2022-12-22 17:43:31+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Kate Middleton Gets New Title From King Charles III", "description": "Kate Middleton has received a new extended title from King Charles III after he previously gave her the title Princess of Wales following the late-Queen Elizabeth&#8217;s death in September. The Royal Matriarch was 96. Buckingham Palace announced that the Princess of Wales has also become an Honorary Colonel of the Irish Guards, a title previously ...", "link": "https://www.dailywire.com/news/kate-middleton-gets-new-title-from-king-charles-iii", "date_published": "2022-12-22 16:36:06+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Florida Supreme Court Approves Gov. DeSantis Request To Impanel Grand Jury On Investigating COVID-19 Vaccine Manufacturers", "description": "The Florida Supreme Court approved a request from Gov. Ron DeSantis to impanel a grand jury with the intent to investigate mRNA vaccine manufacturers. DeSantis announced earlier this month he is petitioning the state’s highest court to impanel a grand jury to investigate any wrongdoing related to COVID vaccines. “It is against the law to ...", "link": "https://www.dailywire.com/news/florida-supreme-court-approves-gov-desantis-request-to-impanel-grand-jury-on-investigating-covid-19-vaccine-manufacturers", "date_published": "2022-12-22 16:17:13+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "18 GOP Senators Vote For Omnibus With $750K Earmark For Group Wanting Trans ‘Discourse’ In Schools And ICE Dismantled", "description": "Eighteen Republican senators voted Thursday to pass a $1.7 trillion “omnibus” bill that not only funds the federal government for another fiscal year, but is also packed with earmarks, including a $750,000 commitment to a trans group that wants transgender &#8220;history and discourse&#8221; engrained in schools and primary education. This Los Angeles-based group, called the ...", "link": "https://www.dailywire.com/news/18-gop-senators-vote-for-omnibus-with-750k-earmark-for-group-wanting-trans-discourse-in-schools-and-ice-dismantled", "date_published": "2022-12-22 16:13:13+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Here Are The 18 Republicans Who Just Screwed Over America By Supporting The McConnell-Schumer $1.7 Trillion Spending Bill", "description": "Eighteen Republicans just looked their GOP colleagues and voters in the eye and told them to eat dirt. On Thursday, the McConnell-Schumer $1.66 trillion omnibus spending bill passed by a vote of 68 &#8211; 29 with 18 Republicans supporting the measure. In doing so, these so-called conservatives not only increased wasteful spending, but cut off ...", "link": "https://www.dailywire.com/news/here-are-the-18-republicans-who-just-screwed-over-america-by-supporting-the-mcconnell-schumer-1-7-trillion-spending-bill", "date_published": "2022-12-22 15:52:03+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘That Situation Has Gotten Far Worse In The Last Few Years’: Most College Students Self-Censor, Fear Disagreeing With Professor", "description": "Alarming proportions of conservative college students at more than 200 American universities said in a national survey they self-censor their views inside and outside of the classroom out of fear of damaging their reputation. The Foundation for Individual Rights and Expression (FIRE), a nonprofit organization defending free speech and free thought, released its third annual ...", "link": "https://www.dailywire.com/news/that-situation-has-gotten-far-worse-in-the-last-few-years-most-college-students-self-censor-fear-disagreeing-with-professor", "date_published": "2022-12-22 15:45:18+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Sam Bankman-Fried Released On $250 Million Bail", "description": "Former FTX CEO Sam Bankman-Fried will be released on $250 million bail, a federal judge ruled on Thursday. FTX filed for bankruptcy last month after users learned that the company was intertwined with sister firm Alameda Research; both were controlled by Bankman-Fried and other young executives working from a luxury penthouse in The Bahamas. The ...", "link": "https://www.dailywire.com/news/sam-bankman-fried-released-on-250-million-bail", "date_published": "2022-12-22 15:40:53+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘It Wouldn’t Be Allowed’: Brooke Shields Reflects On ‘Blue Lagoon’ And Why It Could Never Be Made Again", "description": "Hollywood star Brooke Shields reflected on the coming-of-age film she did in the 1980s and explained that what happened in the film &#8220;wouldn&#8217;t be allowed&#8221; today. During the &#8220;Now What?&#8221; podcast, the 57-year-old actress and her former co-star on the film Christopher Atkins got together on Shield&#8217;s podcast and discussed how &#8220;Blue Lagoon&#8221;, a movie ...", "link": "https://www.dailywire.com/news/it-wouldnt-be-allowed-brooke-shields-reflects-on-blue-lagoon-and-why-it-could-never-be-made-again", "date_published": "2022-12-22 15:33:20+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "The FBI Blames ‘Conspiracy Theorists’ For ‘Misinformation’ By Publishing The FBI’s Own Emails", "description": "Who are you going to believe? The FBI or your own lyin&#8217; eyes? That was the question posed to all Americans by the G-Men on Wednesday after the federal agency finally addressed &#8220;The Twitter Files&#8221; — leaked emails showing rampant collusion between the social media platform and law enforcement to censor and limit certain kinds ...", "link": "https://www.dailywire.com/news/the-fbi-blames-conspiracy-theorists-for-misinformation-by-publishing-the-fbis-own-emails", "date_published": "2022-12-22 15:23:50+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Arizona Governor Doug Ducey Will Take Down Shipping Container ‘Border Wall’ One Week After Biden Lawsuit", "description": "Republican Arizona Gov. Doug Ducey agreed to remove the shipping containers on federal lands currently acting as a wall along the state’s southern border. A lawsuit from the Biden administration last week claimed that the makeshift wall had been erected “unlawfully and without authority,” thereby “damaging the United States.” The government of Arizona agreed to ...", "link": "https://www.dailywire.com/news/arizona-governor-doug-ducey-will-take-down-shipping-container-border-wall-one-week-after-biden-lawsuit", "date_published": "2022-12-22 15:17:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Dolly Parton Shares Secret To Her 56-Year Marriage: ‘It Was Meant To Be’", "description": "Dolly Parton has some thoughts on what makes for a long and happy marriage. The 76-year-old country music legend has been married to Tennessee businessman Carl Thomas Dean since 1966 and says it’s a combination of humor and picking the right partner that has kept them going for 56 years. &#8220;I like it when people ...", "link": "https://www.dailywire.com/news/dolly-parton-shares-secret-to-her-56-year-marriage-it-was-meant-to-be", "date_published": "2022-12-22 15:03:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "NFL Legend Franco Harris’ Final Interview Shows Steelers Star Smiling With No Signs Of Trouble", "description": "NFL legend Franco Harris&#8217; final interview took place just hours before his death, and in it the Steelers star is seen smiling and laughing with no signs of trouble. He was 72. During an interview that took place on December 20, Harris appeared on the &#8220;Not Just Football With Cam Heyward&#8221; show to talk about ...", "link": "https://www.dailywire.com/news/nfl-legend-franco-harris-final-interview-shows-steelers-star-smiling-with-no-signs-of-trouble", "date_published": "2022-12-22 14:55:57+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "James Webb Telescope Finds Invisible Areas Of Star Birth", "description": "A new era of discovering how stars are born is at hand, as NASA’s James Webb Telescope observed the Cosmic Cliffs, a star-forming region inside the NGC 3324 star cluster in the Carina Nebula, and found invisible areas of star birth that had never been seen before. The Webb Telescope discovered behind heretofore impenetrable dust ...", "link": "https://www.dailywire.com/news/james-webb-telescope-finds-invisible-areas-of-star-birth", "date_published": "2022-12-22 14:42:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Senate Passes Monster Spending Package With Backing From At Least 18 Republicans", "description": "The Senate passed a $1.7 trillion spending package on Thursday on a 68-29 vote, with at least 18 Republicans joining Democrats to push the massive omnibus over the line. Congressional leaders are rushing to get the bill through Congress and to President Joe Biden’s desk before the federal government hits its Friday deadline and runs ...", "link": "https://www.dailywire.com/news/senate-passes-monster-spending-package-with-backing-from-at-least-18-republicans", "date_published": "2022-12-22 14:37:21+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "The Not-So-Great Migration: How America’s ‘Electoral Refugees’ Influenced The 2022 Midterms", "description": "Many voters on the Right, myself included, are justifiably angry about just how wrong every single poll, prediction, and political figurehead was about the prospects of the 2022 midterm elections. To be fair to the pollsters, this was not an abnormal event. Polls are regularly wrong — sometimes in spectacular fashion. It is all too ...", "link": "https://www.dailywire.com/news/the-not-so-great-migration-how-americas-electoral-refugees-influenced-the-2022-midterms", "date_published": "2022-12-22 14:32:37+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Former Broncos Running Back Ronnie Hillman Dies At 31", "description": "Former Denver Broncos running back Ronnie Hillman passed away Wednesday, according to a statement from his family. He was 31. Hillman was diagnosed with renal medullary carcinoma, a rare form of kidney cancer, back in August, CNN reported. Hillman’s former Broncos teammates, Derek Wolfe and Orlando Franklin, who both now work as hosts on 104.3 ...", "link": "https://www.dailywire.com/news/former-broncos-running-back-ronnie-hillman-dies-at-31", "date_published": "2022-12-22 14:11:53+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Notorious Serial Killer ‘The Serpent’ To Be Released From Prison", "description": "A notorious French serial killer known as “The Serpent” or the “Bikini Killer” will be released from prison in Nepal due to his age. Charles Sobhraj, 78, has spent the last 19 years in jail for murdering two tourists in Kathmandu in 1975, the BBC reported. He also spent 20 years in prison in India ...", "link": "https://www.dailywire.com/news/notorious-serial-killer-the-serpent-to-be-released-from-prison", "date_published": "2022-12-22 14:00:59+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Openly Gay’ GOP Rep-Elect Accused Of Resumé Fraud Divorced Woman Two Weeks Before Campaign Launch: Report", "description": "Rep.-elect George Santos (R-NY), who ran as &#8220;openly gay,&#8221; divorced his wife just two weeks before he filed paperwork to run for office in 2020, according to a new report. Santos, who has been repeatedly accused of misrepresenting himself on the campaign trail, did not disclose his previous marriage to a woman or the later ...", "link": "https://www.dailywire.com/news/openly-gay-gop-rep-elect-accused-of-resume-fraud-divorced-woman-two-weeks-before-campaign-launch-report", "date_published": "2022-12-22 13:32:43+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Stanford’s New ‘Harmful Word List’ Is Right Out Of Ruth Bader Ginsburg’s Playbook From 45-Years-Ago", "description": "Earlier this year, Stanford University released a &#8220;harmful words&#8221; list that includes dozens of everyday sayings and verbiage that it deemed hateful for one social justice warrior reason or another. For many, it was a sign that the Left had gone one step further into insanity. Unfortunately, that kind of speech code is nothing new. ...", "link": "https://www.dailywire.com/news/stanfords-new-harmful-word-list-is-right-out-of-ruth-bader-ginsburgs-playbook-from-50-years-ago", "date_published": "2022-12-22 13:29:17+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Monty Python’ Clip Mocking Trans Ideology Goes Viral: ’40 Years Ahead Of Their Time’", "description": "A clip from the comedy film “Monty Python&#8217;s Life of Brian” is making rounds on social media, with viewers noticing how it’s a commentary on trans ideology that seemed to predict modern arguments. “For anyone wondering why [Elon Musk] loves Monty Python. Just 40 years ahead of their time!” the original poster shared.  Musk commented ...", "link": "https://www.dailywire.com/news/monty-python-clip-mocking-trans-ideology-goes-viral-40-years-ahead-of-their-time", "date_published": "2022-12-22 13:12:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Sen. James Lankford Paints Frightening Picture Of What Is Happening At Southern Border", "description": "Oklahoma GOP Senator James Lankford painted a frightening picture of what is happening at the southern border, during a debate on the Senate floor over a proposed omnibus spending package. Lankford began by noting the lassitude of the Department of Homeland Security (DHS) in reporting the massive numbers of illegal immigrants crossing into the U.S. ...", "link": "https://www.dailywire.com/news/sen-james-lankford-paints-frightening-picture-of-what-is-happening-at-southern-border", "date_published": "2022-12-22 13:06:52+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Massive Changes To Retirement System Buried In Behemoth Omnibus Bill", "description": "Significant changes to the retirement system are included in the $1.7 trillion omnibus bill moving through Congress. The 4,155-page piece of legislation could codify $858 billion in defense spending and nearly $773 billion for discretionary programs. Among other provisions, the bill funds border security for foreign nations, offers contributions for LGBTQ pride centers, and christens various ...", "link": "https://www.dailywire.com/news/massive-changes-to-retirement-system-buried-in-behemoth-omnibus-bill", "date_published": "2022-12-22 12:49:23+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Life Expectancy Drops For Second Straight Year, Lowest Since 1996", "description": "Life expectancy in 2021 in the U.S. dropped for its second straight year, reaching its lowest level since 1996, according to data released by the Centers for Disease Control and Prevention (CDC) on Wednesday. The report from the National Center for Health Statistics, which is part of the CDC, attributed the drop to increased deaths due ...", "link": "https://www.dailywire.com/news/life-expectancy-drops-for-second-straight-year-lowest-since-1996", "date_published": "2022-12-22 12:17:35+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Eight Actors Who Walked Away From Hollywood And Never Looked Back", "description": "Over the years, after all the hard work and fame, dozens of actors have left the world of entertainment and never looked back. Celebrities who initially found success in their craft — like Gene Hackman, Rick Moranis, and Delores Hart — eventually decided a quiet life with their family and children was all they wanted. ...", "link": "https://www.dailywire.com/news/eight-actors-who-walked-away-from-hollywood-and-never-looked-back", "date_published": "2022-12-22 12:10:36+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Marines Receive Woke Report Which Says To Stop Calling Drill Instructors ‘Sir,’ ‘Ma’am’", "description": "An academic report commissioned by the United States Marines urged Marines to stop calling their drill instructors “sir” and “ma’am” to avoid “misgendering” the instructors. The 739-page report from the University of Pittsburgh — which was catalyzed by a new congressional mandate —featured PhD biologists Bradley C. Nindl and Mita Lovalekar heading a team of ...", "link": "https://www.dailywire.com/news/marines-receive-woke-report-which-says-to-stop-calling-drill-instructors-sir-maam", "date_published": "2022-12-22 11:51:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Political Theater Trumps Peace As Starstruck Uniparty Fawns Over Zelensky", "description": "If there’s one thing the Washington political class admires, it’s a shameless fund raiser. Ukrainian President Volodymyr Zelensky is currently in the capital, putting on a master class in separating starstruck sycophants from their our cash. It’s no wonder the folks whose careers are paid for with panhandled proceeds are treating him like a rock ...", "link": "https://www.dailywire.com/news/political-theater-trumps-peace-as-starstruck-uniparty-fawns-over-zelensky", "date_published": "2022-12-22 11:43:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Judge Rules Universal Can Be Sued For Allegedly Misleading Movie Trailer After Fans Notice Ana De Armas Was Cut From ‘Yesterday’", "description": "Two men just gained major ground in a lawsuit against Universal Studios that dealt with allegedly misleading movie trailers, specifically referencing a promo for “Yesterday&#8221; that included actress Ana de Armas despite her not being in the final cut. Plaintiffs Paul Michael Rosza and Conor Woulfe were attempting to head up a $5 million class ...", "link": "https://www.dailywire.com/news/judge-rules-universal-can-be-sued-for-allegedly-misleading-movie-trailer-after-fans-notice-ana-de-armas-was-cut-from-yesterday", "date_published": "2022-12-22 11:25:53+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Two Charged For Hacking Ring Doorbells And Using Them To Taunt Police", "description": "Two men were charged after they allegedly hacked Ring cameras, placed false emergency phone calls, and mocked responding police officers while live-streaming the incidents on social media. Ring, which Amazon acquired in 2018 for $1 billion, offers products that use outdoor doorbell cameras for convenience and home security purposes. Kya Nelson of Wisconsin and James ...", "link": "https://www.dailywire.com/news/two-charged-for-hacking-ring-doorbells-and-using-them-to-taunt-police", "date_published": "2022-12-22 10:37:31+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Follow The Money: Why Foreign Influence On University Campuses Is A Threat To National Security", "description": "When it comes to America’s national security, we think of energy grids, water supply systems, and espionage by foreign governments. Our university system, however, receives very little attention — and it should. The fact is America’s universities are wittingly and unwittingly putting U.S. national security at risk as they have been infiltrated by foreign countries. ...", "link": "https://www.dailywire.com/news/follow-the-money-why-foreign-influence-on-university-campuses-is-a-threat-to-national-security", "date_published": "2022-12-22 10:32:23+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "James Cameron Already Shot ‘Avatar’ 3 And 4 To Avoid ‘Stranger Things’ Effect, Teens Who ‘Look Like They’re 27’", "description": "While “Avatar 2: The Way of Water” was by no means a guaranteed success, director James Cameron already shot scenes for the third and fourth installments of the franchise. The filmmaker explained to Entertainment Weekly that he did it to avoid a common problem in Hollywood that happens when years pass between sequels — actors to ...", "link": "https://www.dailywire.com/news/james-cameron-already-shot-avatar-3-and-4-to-avoid-stranger-things-effect-teens-who-look-like-theyre-27", "date_published": "2022-12-22 10:02:13+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Senator Blasts Biden For Compiling ‘Naughty List’ Of Peddlers Of ‘Misinformation’ Like The Lab-Leak Theory", "description": "A Republican senator said President Joe Biden is this year’s Grinch for weaponizing the government to censor or attack Americans for engaging in &#8220;misinformation&#8221; by questioning official government lines.", "link": "https://www.dailywire.com/news/senator-blasts-biden-for-compiling-naughty-list-of-peddlers-of-misinformation-like-the-lab-leak-theory", "date_published": "2022-12-22 09:33:15+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Experts Tell Hospitals: Stop Testing New Admissions For COVID", "description": "A panel of infectious disease experts is urging hospitals to stop testing new admissions for COVID. In a new study, 12 experts affiliated with the Society for Healthcare Epidemiology of America (SHEA), argued that when hospitals employ masking and proper ventilation, testing for the virus can have deleterious effects, including “delays in patient placement&#8221; and ...", "link": "https://www.dailywire.com/news/experts-tell-hospitals-stop-testing-new-admissions-for-covid", "date_published": "2022-12-22 08:38:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Once In A Generation Type Event’: ‘Bomb Cyclone’ Targets United States, Canceling Flights", "description": "In what the National Weather Service (NWS) is calling a “once in a generation type event,” a winter storm system blanketing the continental United States has already forced the cancellation of over 1,000 flights and threatens thousands more as the Christmas weekend approaches. In 37 states, in an area that stretches down to the Texas-Mexico ...", "link": "https://www.dailywire.com/news/once-in-a-generation-type-event-bomb-cyclone-targets-united-states-cancelling-flights", "date_published": "2022-12-22 08:09:20+00:00", "persistent": false, "user": null, "language": "en-US"}]