[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Massive UK Moderna partnership", "description": "UK cements 10-year-partnership with Moderna in major boost for vaccines and research\n\nhttps://www.gov.uk/government/news/uk-cements-10-year-partnership-with-moderna-in-major-boost-for-vaccines-and-research\n\nhttps://www.gov.uk/government/news/moderna-to-open-vaccine-research-and-manufacturing-centre-in-uk\n\nModerna to invest in mRNA research and development (R&D) in the UK,\n\nand build a state-of-the-art vaccine manufacturing centre,\n\nwith the ability to produce up to 250 million vaccines a year\n\nSuggested advantages\n\nNHS patients will have access to a UK-made supply of COVID-19 jabs,\n\nas well as cutting-edge vaccines developed for other respiratory diseases, \n\nsuch as flu and respiratory syncytial virus (RSV)\n\nCreate more than 150 jobs\n\nFurther future-proof the UK against potential pandemics, \n\nspeedy access to the latest advancements in vaccine technology\n\nUK cements its status as a life sciences superpower.\n\nThe partnership with Moderna\n\nUK Health Security Agency (UKHSA) working with Moderna,\n\nto ensure early vaccine development, \n\nsupporting the G7 mission to get from variant to vaccine in 100 days.\n\nNHS patients access to Moderna’s COVID-19 vaccines,\n\nthat can protect against multiple variants. \n\nThis is the finalisation of the partnership, \nled by the Vaccine Taskforce.\n\nSecretary of State for Health and Social Care, Steve Barclay\n\nIt is vital we invest in fighting future variants of this disease, (covid),\n\nas well as other deadly viruses that are circulating, \n\nsuch as seasonal flu and RSV, \n\nand this partnership with Moderna will also strengthen our ability to respond to any future pandemics.\n\nWe are also told\n\nModerna worked closely with the Vaccine Taskforce during the pandemic, \n\nThe company has now committed to invest substantial funding in UK-based research and development activities,\n\nover a 10-year period. \n\nPerhaps, most concerning of all\n\nThis will include running a significant number of clinical trials in the UK\n\nand it has also pledged to fund grants for UK universities, \n\nincluding PhD places and research programmes.\n\nNot mentioned in press release\n\nFull explanation as to why the focus is exclusively on mRNA vaccines, rather than tired and tested traditional vaccines.\n\nWhy the UK government needs Moderna?\n\nThe partnership will issue guarantees that the funding will in no way influence the agenda of the employed scientists.\n\nA graduate student will be awarded his or her PhD, based purely on the quality of the research.\n\nThere will be no sanction of scientists that offer alternative views to the prevailing narrative.\n\nScientists will not be threatened or cajoled in any way.\n\nWithin reason, scientists will be able to choose what they want to research, not be ordered into proving a desired concept.\n\nScience will not be used to provide evidence for a development that looks profitable.\n\nScience and medicine will never be subjugated to commercial interests.\n\nThere will be independent oversight of the partnership.\n\nIf promising none mRNA vaccine looks interesting this will not squashed.\n\nExtensive studies will be carried out on systemic distribution of the mRNA\n\nAll organs will be examined for damage caused by systemic distribution of mRNA\n\nBrain, heart, lungs, liver, kidneys, spleen.\n\nAdverse effects on physiological systems will be closely monitored\nAll results will be published, whether negative or positive.\n\nThere will be no publication bias, (where favourable results are published and publicised, while less favourable results are squashed).\n\nResearch reports will not be ghost written by Moderna or representatives of the partnership.\n\nThe peer review process will have guaranteed anonymity, i.e. will be blind.\n\nFull, anonymised source data will be in the public domain for independent analysis.\n\nAll adverse events will be published in full, combined with all relevant pathophysiological data, blood results, clinical examinations, investigation results, histology.\n\nAll recruits to clinical trials will receive full information disclosure, so they can give full informed consent before agreeing to be a trial participant.\n\nFull accounts, including commercial profits will be placed into the public domain, at least every year.\n\nStudies on intramuscular injection technique to prevent systemic administration.\n\nTimetable\n\nConstruction is expected to commence in early 2023, \n\nwith the first mRNA vaccine expected to be produced in the UK in 2025.\n\nDr Jenny Harries, Chief Executive of UKHSA\nI’m delighted that… \n\nStéphane Bancel, Chief Executive Officer of Moderna\nOur new state-of-the-art facility will bring mRNA manufacturing to UK shores, \nEct. Ect.\n\nNOTES TO EDITORS:\n\nthe details of the strategic partnership between the government and Moderna are commercially sensitive", "link": "https://www.youtube.com/watch?v=hDLx1IAITTg", "date_published": "2022-12-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]