[{"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Wielka Brytania. Mama cała w tatuażach. \"Nie wpuścili mnie na wigilię syna w szkole\"", "description": "Melissa Sloan, 45-letnia, uzależniona od tatuaży Walijka, powiedziała, że nie została wpuszczona na szkolną wigilię swojego dziecka. Nauczyciel kazał jej zostać na zewnątrz i oglądać uroczystość przez okno. - To zdarzało się wcześniej - powiedziała matka dwójki, która ma 800 tatuaży na całym ciele, z twarzą włącznie. Dodała, że nie może znaleźć pracy i nie wpuszczają jej miejscowe puby.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-22/wielka-brytania-mama-cala-w-tatuazach-nie-wpuscili-mnie-na-wigilie-syna-w-szkole/", "date_published": "2022-12-22 21:02:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Brazylia. Instagramerka Anna Clara Rios opowiedziała o traumatycznym doświadczeniu podczas lotu", "description": "Gdy zasnęła, pasażer samolotu zaczął fotografować jej miejsca intymne. Instagramerka Anna Clara Rios z Brazylii opowiedziała o wszystkim w mediach społecznościowych. Jeszcze podczas rejsu zawiadomiła służby, a po wylądowaniu mężczyznę wyprowadziła z pokładu policja.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-22/brazylia-instagramerka-anna-clara-rios-opowiedziala-o-traumatycznym-doswiadczeniu-podczas-lotu/", "date_published": "2022-12-22 19:06:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Białoruś. Alaksandr Łukaszenka obawia się ataku ze strony sąsiadów", "description": "- Nie możemy wykluczyć rozpętania agresji przeciwko naszemu krajowi. Przynajmniej widzimy taką gotowość ze strony naszych sąsiadów - stwierdził na spotkaniu z wojskiem i siłami bezpieczeństwa przywódca Białorusi Alaksandr Łukaszenka. Opowiedział też o przeprowadzonych ćwiczeniach sił natychmiastowego reagowania.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-22/bialorus-alaksandr-lukaszenka-obawia-sie-ataku-ze-strony-sasiadow/", "date_published": "2022-12-22 18:08:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Rosyjski propagandysta Sołowjow: Im więcej palimy w Ukrainie, tym łatwiej będzie uderzyć w Europę", "description": "Szokujące słowa kremlowskiego propagandzisty, prezentera państwowego kanału Rossija 1 Władimira Sołowjowa. Dziennikarz stwierdził, że im więcej Rosja pali w Ukrainie, tym łatwiej będzie uderzyć w Europę i Stany Zjednoczone. Użył sformułowania europejska, nazistowska swołocz. Dostał także szału na widok ukraińskiej flagi w rękach prezydenta Ukrainy Wołodymyra Zełenskiego w Kongresie USA.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-22/rosyjski-propagandysta-solowjow-im-wiecej-palimy-w-ukrainie-tym-latwiej-bedzie-uderzyc-w-europe/", "date_published": "2022-12-22 16:32:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Ukraina. Minister obrony Rosji Siergiej Szojgu wizytuje na froncie", "description": "Resort obrony Federacji Rosyjskiej poinformował, że Siergiej Szojgu przeprowadził inspekcję jednostek Sił Zbrojnych Rosji w strefie specjalnej operacji wojskowej. Kilka dni temu media informowały o jego wizycie w pobliżu frontu.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-22/ukraina-minister-obrony-rosji-siergiej-szojgu-wizytuje-na-froncie/", "date_published": "2022-12-22 16:20:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Wielka Brytania: Zmarł po tym, jak ugryzł go pies. \"Rokowania były bardzo złe\"", "description": "61-letniego właściciela sklepu ugryzł pies, którym się opiekował. Mężczyzna zwlekał z udaniem się do lekarza. Jego stan pogarszał się coraz bardziej. Lekarzom nie udało się go uratować.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-22/wielka-brytania-zmarl-po-tym-jak-ugryzl-go-pies-rokowania-byly-bardzo-zle/", "date_published": "2022-12-22 15:53:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Australia: Przez 24 godziny dryfował na kawałku drewna. Otaczały go rekiny i krokodyle", "description": "31-latek w Australii przetrwał niemal 24 godziny na wzburzonym morzu otoczony przez rekiny i krokodyle, trzymając się jedynie kawałka drewna z jego rozbitej łodzi. Sukces akcji ratowniczej okrzyknięto świątecznym cudem.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-22/australia-przez-24-godziny-dryfowal-na-kawalku-drewna-otaczaly-go-rekiny-i-krokodyle/", "date_published": "2022-12-22 15:35:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "USA: Trójnogi jeleń zaplątał się w lampki choinkowe. Potrzebna była pomoc", "description": "Jeleń z Oregonu, nazywany przez mieszkańców Tripodem, zaplątał się porożem w lampki choinkowe. Na szczęście pracownicy departamentu ds. dzikiej przyrody pomogli mu się uwolnić.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-22/usa-trojnogi-jelen-zaplatal-sie-w-lampki-choinkowe-potrzebna-byla-pomoc/", "date_published": "2022-12-22 15:24:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "USA: Trwają poszukiwania 5-miesięcznego dziecka. Jego brata znaleziono na lotnisku", "description": "Trwają poszukiwania pięciomiesięcznego chłopca, który wraz z bratem został porwany w stanie Ohio w USA. Drugie z dzieci odnaleziono porzucone na lotnisku dzień po zniknięciu bliźniaków. Samochód, w którym byli chłopcy ukradła 24-latka z kryminalną przeszłością. Była karana za znęcanie się nad własnym dzieckiem.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-22/usa-trwaja-poszukiwania-5-miesiecznego-dziecka-jego-brata-znaleziono-na-lotnisku/", "date_published": "2022-12-22 15:16:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Wołodymyr Zełenski: W drodze z USA spotkałem się z przyjacielem Ukrainy prezydentem Andrzejem Dudą", "description": "Wołodymyr Zełenski spotkał się w drodze z USA z przyjacielem Ukrainy prezydentem Andrzejem Dudą. Ukraiński prezydent napisał o rozmowie po polsku na Instagramie. Dziękujemy za mocne wsparcie. Wideo ze spotkania obu prezydentów zamieścił na Twitterze były szef BBN Paweł Soloch.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-22/wolodymyr-zelenski-w-drodze-z-usa-spotkalem-sie-z-przyjacielem-ukrainy-prezydentem-andrzejem-duda/", "date_published": "2022-12-22 14:44:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Wielka Brytania: Zaczepił kobietę na ulicy. Ma zapłacić grzywnę za molestowanie", "description": "Mężczyzna z Wielkiej Brytanii zaczepiał kobietę na jednej z londyńskich ulic. Otrzymał 100 funtów grzywny za molestowanie seksualne. Został złapany podczas tajnej operacji policyjnej.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-22/wielka-brytania-zaczepil-kobiete-na-ulicy-otrzymal-wyrok-za-molestowanie/", "date_published": "2022-12-22 12:59:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Jerzy Marek Nowakowski: Wizyta amerykańska Zełenskiego to przekaz do obywateli Stanów Zjednoczonych", "description": "- Wizyta amerykańska Zełenskiego to nie była wizyta u Bidena. To nie była wizyta w Kongresie. To był przekaz do obywateli Stanów Zjednoczonych po to, żeby amerykański wyborca był przekonany, że aktywność amerykańska na Ukrainie, te miliardy, które idą z jego kieszeni na Ukrainę, mają sens - ocenił Jerzy Marek Nowakowski, prezes Stowarzyszenia Euro-Atlantyckiego, były ambasador w Armenii i Łotwie.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-22/jerzy-marek-nowakowski-wizyta-amerykanska-zelenskiego-to-przekaz-do-obywateli-stanow-zjednoczonych/", "date_published": "2022-12-22 11:14:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Brytyjskie ministerstwo obrony: Białoruś szkoli rosyjskich rezerwistów. \"Odwrócenie ról\"", "description": "Siły zbrojne Białorusi prawdopodobnie przyjęły w ostatnim czasie znaczącą, choć bardziej dyskretną rolę w szkoleniu tysięcy nowo zmobilizowanych rosyjskich rezerwistów – poinformowało brytyjskie ministerstwo obrony. Zdaniem resortu ma to świadczyć o przeciążeniu rosyjskiego systemu wojskowego.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-22/brytyjskie-ministerstwo-obrony-bialorus-szkoli-rosyjskich-rezerwistow-odwrocenie-rol/", "date_published": "2022-12-22 08:36:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Peru: Policjanci przebrani za Mikołaja i elfy. Aresztowali członków gangu narkotykowego", "description": "Młot do wyważania zamiast worka z prezentami - tak wyposażony Święty Mikołaj odwiedził posesję w Peru. Osoby, które były w środku zdecydowanie nie zasługiwały na świąteczne prezenty, można powiedzieć, że nawet rózga, to dla nich za mało. Trzej mężczyźni i kobieta to członkowie gangu, który zajmuje się handlem narkotykami.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-22/peru-policjanci-przebrani-za-mikolaja-i-elfy-aresztowali-czlonkow-gangu-narkotykowego/", "date_published": "2022-12-22 08:25:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Niemieckie media o wizycie Zełenskiego w USA: Akt desperacji", "description": "W 300. dniu rosyjskiej inwazji na Ukrainę Wołodymyr Zełenski złożył wizytę w Stanach Zjednoczonych, gdzie rozmawiał osobiście z prezydentem Joe Bidenem. Podróż prezydenta Ukrainy była szeroko komentowana przez światowe media. Korespondentka niemieckiej telewizji ARD w Waszyngtonie Gudrun Engel nazwała wizytę aktem desperacji.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-22/niemieckie-media-o-wizycie-zelenskiego-w-usa-akt-desperacji/", "date_published": "2022-12-22 07:16:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Wołodymyr Zełenski w Kongresie: Wasze pieniądze to inwestycja w globalne bezpieczeństwo i demokrację", "description": "- Wasze wsparcie jest kluczowe nie tylko, by utrzymać pozycję w walce, ale też dokonać punktu zwrotnego i wygrać na polu bitwy. Mamy artylerię. Tak, dziękujemy wam za wszystko, co mamy. Czy to wystarczy? Szczerze mówiąc, nie bardzo - mówił prezydent Wołodymyr Zełenski w przemówienie przed połączonymi izbami Kongresu.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-22/wolodymyr-zelenski-w-kongresie-wasze-pieniadze-to-inwestycja-w-globalne-bezpieczenstwo-i-demokracje/", "date_published": "2022-12-22 05:16:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}]