{"entries": [{"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/twoje-pieniadze/vat-na-paliwa-wroci-z-8-proc-na-23-proc-analityk-ceny-nie-powinny-wzrosnac/bnpgyfd", "title": "VAT na paliwa wróci z 8 proc. na 23 proc. Analityk: ceny nie powinny wzrosnąć", "date_published": "2022-12-22 20:50:28+00:00", "description": "Powrót 23 proc. VAT nie powinien wpłynąć na średnią cenę paliw — ocenia analityk. Jego zdaniem stabilna sytuacja powinna utrzymać się w kolejnych tygodniach.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/senat-usa-przyjal-projekt-budzetu-jest-w-nim-45-mld-dol-dla-ukrainy/d27vx8k", "title": "Senat USA przyjął projekt budżetu. Jest w nim 45 mld dol. dla Ukrainy i zakaz TikToka", "date_published": "2022-12-22 19:54:08+00:00", "description": "Senat USA przegłosował w czwartek projekt budżetu federalnego, wraz z pakietem 45 mld dol. pomocy gospodarczej i wojskowej dla Ukrainy. Budżet wciąż musi zostać przyjęty przez Izbę Reprezentantów do piątku, by uniknąć tzw. shutdownu.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/dgp-polska-skierowala-do-tsue-skarge-przeciwko-brukseli/yyg7n6k", "title": "\"DGP\": Polska skierowała do TSUE skargę przeciwko Brukseli. Chodzi o milion euro dziennie", "date_published": "2022-12-22 19:23:46+00:00", "description": "Polska skierowała do Trybunału Sprawiedliwości Unii Europejskiej skargę przeciwko Komisji Europejskiej — donosi, powołując się na swoje ustalenia, \"Dziennik Gazeta Prawna\".", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/niemieckie-patrioty-w-polsce-jest-termin/43e6v7b", "title": "Niemieckie patrioty w Polsce. Jest termin", "date_published": "2022-12-22 18:53:37+00:00", "description": "Niemieckie zestawy przeciwlotnicze Patriot pojawią się w Polsce na przełomie stycznia i lutego. Poinformował o tym na antenie Radia Zet wiceminister obrony Marcin Ociepa.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/unia-europejska-formalnie-zatwierdzila-limit-ceny-gazu/4408fq9", "title": "Unia Europejska formalnie zatwierdziła limit ceny gazu", "date_published": "2022-12-22 18:13:25+00:00", "description": "Ministrowie państw UE, odpowiedzialni w swoich rządach za kwestie energetyki i klimatu, porozumieli się na temat mechanizmu limitów cen gazu w Unii. Ma on gwarantować, że ceny surowca państwach wspólnoty nie będą zbyt wysokie.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gielda/dino-nie-zwalnia-tempa-polska-siec-bije-rekordy/8rkfg5j", "title": "Dino nie zwalnia tempa. Polska sieć bije rekordy", "date_published": "2022-12-22 16:43:14+00:00", "description": "Mijający rok Dino niewątpliwie może zaliczyć do udanych. Polska sieć marketów otworzyła ponad 250 sklepów, a jej przychody wzrosły o prawie 50 proc. Ponadto Dino właśnie pobiło rekord na giełdzie.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/finanse/malo-kto-wierzy-w-pozytywny-dla-bankow-scenariusz-frankowy-ale-sektor-i-tak-moze/jqf2tt1", "title": "Mało kto wierzy w pozytywny dla banków scenariusz frankowy. Takie mogą być konsekwencje", "date_published": "2022-12-22 16:29:47+00:00", "description": "Coraz bardziej realny staje się scenariusz, w którym banki poniosą ogromne koszty związane z hipotekami frankowymi. Małe są bowiem szanse, że nadchodzący wyrok Trybunału Sprawiedliwości Unii Europejskiej w sprawie tzw. opłaty za udostępnienie kapitału będzie dla nich korzystny. Choć koszt szacowany przez UKNF na poziomie 100 mld zł może wydawać się szokującą wartością w zestawieniu z kapitałami branży wynoszącymi 190 mld zł i rocznym zyskiem sięgającym ostatnio około 10 mld zł, to prawdopodobnie nie będzie aż tak źle. Ostateczny koszt może być niższy, a poza tym banki mają już sporo zawiązanych rezerw. Ich zdolność do absorbcji frankowego brzemienia zwiększa też dobra dochodowość ich podstawowego biznesu. Pod warunkiem że rządzący nie będą wprowadzać kolejnych obciążeń sektora. Niektóre instytucje zniosą trudniej obciążenie wynikające z rezerw na franki, inne poradzą sobie bez kłopotów.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/twoje-pieniadze/ceny-karpia-szaleja-organizacja-producentow-polski-karp-odpowiada-i-podaje-kwoty/f0gt3cb", "title": "Ceny karpia szaleją? Organizacja Producentów Polski Karp odpowiada i podaje kwoty", "date_published": "2022-12-22 16:22:17+00:00", "description": "Do Wigilii zostały już niespełna dwa dni. Tegoroczne święta mają być najdroższe w historii, a to ze względu na szalejącą w kraju inflację, która w listopadzie sięgnęła 17,5 proc. Wzrost cen nie ominął też wigilijnych potraw, a media pełne są doniesień o rekordowych kwotach, jakie trzeba zapłacić m.in. karpia. Branżowa organizacja producentów tej ryby postanowiła zająć stanowisko w sprawie.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/prawo/pis-chce-zmian-w-kodeksie-wyborczym-co-proponuje/nj14kql", "title": "PiS chce zmian w Kodeksie wyborczym. Co proponuje?", "date_published": "2022-12-22 15:44:10+00:00", "description": "Prawo i Sprawiedliwość złożyło w czwartek w Sejmie projekt zmian w Kodeksie wyborczym. Przewiduje m.in. likwidację oddzielnych komisji do przeprowadzenia i ustalenia wyniku wyborów.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/stopy-procentowe-dobra-wiadomosc-dla-kredytobiorcow-banki-przekonane-ze-to-koniec/3c2lr1v", "title": "Dobra wiadomosć dla kredytobiorców. Banki przekonane, że to koniec podwyżek stóp", "date_published": "2022-12-22 15:38:16+00:00", "description": "Ekonomiści mają dobre wieści dla kredytobiorców: prognozują, że przerwa w cyklu podwyżek stóp procentowych przerodzi się w jego koniec. Wskazują też, kiedy możliwe są pierwsze obniżki.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/epidemia-grypy-i-rsv-tematem-sztabu-kryzysowego-polowa-zakazen-to-dzieci/bcvd0ke", "title": "Epidemia grypy i RSV tematem sztabu kryzysowego. Połowa zakażeń to dzieci", "date_published": "2022-12-22 15:20:31+00:00", "description": "Nawet 80 proc. szpitalnych łóżek dla dzieci jest zajętych — wynika z informacji przekazanych przez resort zdrowia. Coraz większym problemem jest groźny dla dzieci wirus RSV.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/wolodymyr-zelenski-spotkal-sie-z-andrzejem-duda-w-drodze-powrotnej-z-usa/pl155vc", "title": "Wołodymyr Zełenski spotkał się z Andrzejem Dudą w drodze powrotnej z USA", "date_published": "2022-12-22 15:19:34+00:00", "description": "W drodze do domu spotkałem się z przyjacielem Ukrainy – prezydentem Polski Andrzejem Dudą — poinformował Wołodymyr Zełenski, który wracał ze swojej pierwszej zagranicznej wizyty od czasu rosyjskiej agresji. \"Dziękujemy za niezmienne i mocne wsparcie!\" — dodał.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/gospodarka-usa-radzi-sobie-lepiej-niz-sadzono-fed-zaciera-rece/cv0409g", "title": "Gospodarka USA radzi sobie lepiej, niż sądzono. Fed ma zielone światło", "date_published": "2022-12-22 15:06:06+00:00", "description": "Gospodarka USA urosła w trzecim kwartale mocniej, niż wcześniej szacowano — wynika z opublikowanych w czwartek danych. Ponadto liczba Amerykanów składających wnioski o zasiłek dla bezrobotnych wzrosła w zeszłym tygodniu mniej od prognoz. Siła rynku pracy sprawia, że ​​amerykański bank centralny nie schodzi z kursu i nie ustępuje w kwestii podwyżek stóp procentowych.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/prawo/ustawa-abolicyjna-weszla-w-zycie-nie-bedzie-kary-za-wybory-kopertowe/591ges8", "title": "Ustawa abolicyjna weszła w życie. Nie będzie kary za wybory kopertowe", "date_published": "2022-12-22 14:51:09+00:00", "description": "W czwartek weszła w życie tzw. ustawa abolicyjna, która wprowadza amnestię obejmującą darowanie kar za popełniony w czasie obowiązywania epidemii COVID-19 czyn polegający na przekazaniu Poczcie Polskiej spisu wyborców w związku z zarządzonymi na 10 maja 2020 r. wyborami Prezydenta RP.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gielda/kursy-walut/niepokojaca-prognoza-dla-zlotego-poczatek-roku-moze-przyniesc-przecene/c6vj3tx", "title": "Niepokojąca prognoza dla złotego. Początek roku może przynieść przecenę", "date_published": "2022-12-22 14:27:12+00:00", "description": "Choć złoty odrobił już większość strat, które poniósł od rosyjskiej inwazji, początek roku może być trudny dla naszej waluty. Analitycy ING ostrzegają przed możliwą przeceną i ostrzegają przed nadmiernym optymizmem w kwestii odblokowania środków na KPO.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/lifestyle/jedzenie/sol-bambusowa-najdrozsza-sol-na-swiecie-proces-produkcji/z10mzzk", "title": "Oto najdroższa sól na świecie. By ją uzyskać, potrzeba miesiąca pracy i 1000 st. C", "date_published": "2022-12-22 14:17:00+00:00", "description": "Sól bambusowa powstaje poprzez umieszczenie soli morskiej wewnątrz bambusa i uprażenie jej. Wysokiej jakości sól bambusowa kosztuje około 380 złotych za 250-gramowy słoik, co czyni ją najdroższą solą na świecie. Koreańczykom taka cena jednak nie przeszkadza. Poniżej znajduje się transkrypcja materiału wideo.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/podaz-pieniadza-i-kredyty-hipoteczne-widac-hamowanie-gospodarki/jwzn3b2", "title": "Podaż pieniądza i kredyty hipoteczne. Widać hamowanie gospodarki", "date_published": "2022-12-22 14:08:42+00:00", "description": "Podaż pieniądza w listopadzie zwiększyła się o 10,7 mld zł do — podał w czwartek NBP. Podaż pieniądza ostatnio rośnie wolniej, co świadczy o hamowaniu aktywności gospodarczej. Widać to także w najnowszych danych NBP o kredytach hipotecznych. To dobra wiadomość w kontekście walki z inflacją.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/biznes/rzad-obiecuje-kredyty-na-2-proc-prezes-zbp-ostrzega-przed-ryzykiem/bnbnx6n", "title": "Rząd obiecuje kredyty na 2 proc. Prezes ZBP ostrzega przed ryzykiem", "date_published": "2022-12-22 13:58:00+00:00", "description": "Według planów rządu kredyty z gwarantowanym oprocentowaniem na poziomie 2 proc. mają być dostępne od połowy 2023 r. Prezes Związków Banków Polskich ostrzega, że wprowadzenie programu w czasach wysokich stóp procentowych może poskutkować \"trudnościami z udźwignięciem programu\".", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/biskup-twierdzi-ze-za-jego-luksusowy-styl-zycia-odpowiada-bog-fbi-ma-wlasna-teorie/t5gh13t", "title": "Biskup twierdzi, że za jego luksusowy styl życia odpowiada Bóg. FBI ma własną teorię", "date_published": "2022-12-22 13:49:35+00:00", "description": "Rzucający się w oczy biskup Brooklynu, który został okradziony podczas transmitowanego na żywo nabożeństwa kościelnego w lipcu, został aresztowany i oskarżony o próbę wymuszenia, oszustwo bankowe i składanie fałszywych zeznań.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/rosja-traci-kolejny-kontrakt-bulgaria-paliwo-jadrowe-kupi-w-usa/03zc8ph", "title": "Rosja traci kolejny kontrakt. Bułgaria paliwo jądrowe kupi w USA", "date_published": "2022-12-22 13:39:56+00:00", "description": "Bułgarski rząd podpisał umowę z amerykańską firmą Westinghouse na dostawy paliwa jądrowego do jednego z dwóch bloków jądrowych elektrowni w Kozłoduju nad Dunajem. Wcześniej dostarczali je Rosjanie.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/technologie/nowe-technologie/caroline-ellison-grozi-do-110-lat-wiezienia-w-zwiazku-z-upadkiem-ftx/95248bh", "title": "Grozi jej do 110 lat więzienia. Przyznała się do siedmiu zarzutów w związku z upadkiem FTX", "date_published": "2022-12-22 13:24:15+00:00", "description": "Caroline Ellison, była CEO Alameda Research, po zawarciu ugody z Departamentem Sprawiedliwości może otrzymać maksymalny wyrok 110 lat więzienia. Tak wynika z porozumienia Ellison z prokuratorami z Południowego Dystryktu Nowego Jorku, datowanego na 18 grudnia.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/lifestyle/podroze/wyjedz-w-niezapomniana-podroz-jedwabnym-szlakiem-po-azji/sc9vd2n", "title": "Wyjedź w niezapomnianą podróż Jedwabnym Szlakiem po Azji", "date_published": "2022-12-22 13:19:00+00:00", "description": "Zachęcamy do odkrycia Azji Środkowej i wyruszenia w podróż śladami legendarnego Jedwabnego Szlaku. Najlepszy czas na zwiedzanie Azji to okres od listopada do maja, temperatury oscylują wtedy w granicach 20-25 stopni, a wilgotność powietrza jest stosunkowo niska. Azja Środkowa od lat urzeka turystów swą różnorodnością, dużą liczbą zabytków, niezwykłą przyrodą i wyśmienitą kuchnią. To właśnie w Azji Centralnej spotkasz lazurowe kopuły świątyń, unikalną przyrodę, kolorowe bazary pachnące egzotycznymi przyprawami oraz wiele zabytków wpisanych na listę światowego dziedzictwa UNESCO. Azja Środkowa ma niesamowity turystyczny potencjał, a jednocześnie nadal jest nieodkryta i tajemnicza. W artykule polecamy sprawdzone i doceniane przez uczestników wycieczki objazdowe od biura podróży Albatros. Zapraszamy!", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/komisja-europejska-zdecydowala-na-polski-rynek-gazu-poplyna-miliardy/ygpzv7p", "title": "Komisja Europejska zdecydowała. Do polskich firm gazowych popłyną miliardy", "date_published": "2022-12-22 12:54:55+00:00", "description": "Komisja Europejska zatwierdziła polski program o wartości 3 mld euro na wsparcie firm działających na polskim rynku gazu w kontekście wojny Rosji z Ukrainą.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/nie-tylko-wzrost-kosztow-tak-wojna-w-ukrainie-wplywa-na-polskie-firmy/cnfqvpj", "title": "Nie tylko wzrost kosztów. Tak wojna w Ukrainie wpływa na polskie firmy", "date_published": "2022-12-22 12:49:10+00:00", "description": "W najnowszym badaniu Głównego Urzędu Statystycznego polscy przedsiębiorcy odpowiedzieli na pytania o wpływ wojny w Ukrainie na ich działalność. Największy odsetek firm wskazuje na wzrost kosztów. Nie jest to jednak jedyny czynnik związany z wojną, który zakłóca działanie polskiego biznesu.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/wroclaw-awaria-sieci-cieplowniczej-duza-czesc-miasta-bez-ogrzewania/28wqdpy", "title": "Awaria sieci ciepłowniczej we Wrocławiu. Duża część miasta bez ogrzewania", "date_published": "2022-12-22 12:45:18+00:00", "description": "W Wrocławiu doszło do awarii sieci ciepłowniczej. Duża część miasta pozbawiona jest ciepłej wody i ogrzewania. Problemy z dostawą ciepła dotyczą też biur i budynków użyteczności publicznej. Placówki edukacyjne apelują o wcześniejszy odbiór dzieci.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/prawo/praca/pracownik-zwolniony-za-homofobie-przywrocony-do-pracy-w-ikei/mw90l00", "title": "Zwolniony za homofobię wraca do Ikei. Jest wyrok, będzie apelacja", "date_published": "2022-12-22 12:42:20+00:00", "description": "Sąd pracy odmówił odszkodowania pracownikowi Ikei, który został zwolniony po zamieszczeniu wpisów atakujących społeczność LGBT. Uznał, że nie doszło w tym przypadku do dyskryminacji, ale jednocześnie przywrócił zwolnionego do pracy. Wyrok jest nieprawomocny. Zapowiadana jest apelacja. Jeśli zostanie utrzymany, to Ikea będzie musiała przyjąć z powrotem byłego pracownika.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/firmy/nik-skontroluje-przejecie-lotosu-przez-orlen-banas-sprawa-jest-powazna/dmtx4xq", "title": "NIK skontroluje przejęcie Lotosu przez Orlen? Banaś: sprawa jest bardzo poważna", "date_published": "2022-12-22 12:18:35+00:00", "description": "Prezes Najwyższej Izby Kontroli Marian Banaś uważa, że powinno dojść do kontroli przejęcia Lotosu przez Orlen. W rozmowie z \"Rzeczpospolitą\" nie wykluczył także zbadania umów płockiego koncernu z Saudi Aramco.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/prawo/kilkadziesiat-pozwow-o-wibor-w-polskich-sadach/6w4153m", "title": "Kilkadziesiąt pozwów o WIBOR w polskich sądach", "date_published": "2022-12-22 12:15:03+00:00", "description": "Pierwsi klienci banków, którym udzielono kredytów złotowych o zmiennym oprocentowaniu, wnoszą sprawy do sądów. Prowadzą je często kancelarie wyspecjalizowane dotąd w sprawach frankowych.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/putin-straszy-eksalacja-wojny-sily-jadrowe-rosji-zwieksza-gotowosc-bojowa/1ff5j6m", "title": "Putin straszy eksalacją wojny. Siły jądrowe Rosji zwiększą \"gotowość bojową\"", "date_published": "2022-12-22 12:08:06+00:00", "description": "— Siły zbrojne i możliwości bojowe naszych sił zbrojnych rosną stale i każdego dnia. I ten proces, oczywiście, będziemy kontynuować — powiedział prezydent Rosji Władimir Putin podczas transmitowanego przez telewizję spotkania z rosyjskimi wojskowymi.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/o-takiej-armii-marzy-putin-eksperci-to-niemozliwe/y27xs51", "title": "O takiej armii marzy Putin. Eksperci: to niemożliwe", "date_published": "2022-12-22 11:45:26+00:00", "description": "Rosjanie przygotowują odpowiedź na przystąpienie do NATO Szwecji oraz Finlandii. Rosyjski minister obrony Siergiej Szojgu zapowiedział powiększenie armii do 1,5 mln żołnierzy. Zdaniem analityków z amerykańskiego Instytutu Studiów nad Wojną (ISW) nie wydaje się to jednak możliwe w bliskiej perspektywie.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/nabe-przejmuje-polski-wegiel-jacek-sasin-podpisal-umowe-spoleczna/zlvdj52", "title": "NABE przejmuje polski węgiel. Jacek Sasin podpisał Umowę Społeczną", "date_published": "2022-12-22 11:18:00+00:00", "description": "Podpisana w czwartek Umowa Społeczna to \"zielone światło\" dla utworzenia Narodowej Agencji Bezpieczeństwa Energetycznego. Instytucja będzie odpowiedzialna za polski węgiel. Umowa ma z kolei zabezpieczyć m.in. górników.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/nabe-przejmuje-polski-wegiel-umowa-spoleczna-podpisana/zlvdj52", "title": "NABE przejmuje polski węgiel. Umowa Społeczna podpisana", "date_published": "2022-12-22 11:18:00+00:00", "description": "Wicepremier, minister aktywów państwowych Jack Sasin podpisał Umowę Społeczną, która dotyczy transformacji sektora elektroenergetycznego i branży górnictwa węgla brunatnego. Umowa ta związana jest z planami wydzielenia ze spółek z udziałem Skarbu Państwa wytwórczych i wydobywczych aktywów węglowych. Jest to końcowy etap przygotowań do powołania Narodowej Agencji Bezpieczeństwa Energetycznego.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/nabe-przejmuje-energetyke-weglowa-jacek-sasin-podpisal-umowe-spoleczna/zlvdj52", "title": "NABE przejmuje polską energetykę węglową. Sasin: umowa społeczna daje zielone światło", "date_published": "2022-12-22 11:18:00+00:00", "description": "Podpisana w czwartek umowa społeczna to \"zielone światło\" dla utworzenia Narodowej Agencji Bezpieczeństwa Energetycznego. Instytucja będzie odpowiedzialna za polską energertykę węglową. Umowa ma z kolei zabezpieczyć m.in. pracowników z sektora energetycznego. Ostatecznej daty powstania NABE nie ma, ale według harmonogramu ma to być koniec III kw. 2023 r.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/inflacja-w-turcji-przekracza-80-proc-bank-centralny-wciska-hamulec/jzlyb9n", "title": "Erdogan inflacji się nie boi. Turecki bank centralny wciska hamulec", "date_published": "2022-12-22 11:15:33+00:00", "description": "Mimo rekordowej inflacji, która przekroczyła 80 proc., bank centralny Turcji — zgodnie z wytycznymi prezydenta Erdoğana — przez kilka ostatnich miesięcy obniżał stopy procentowe. W czwartek wyhamował z obniżkami.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/czeslaw-michniewicz-zegna-sie-z-kadra-imponujace-zarobki-w-11-miesiecy/mlysgb7", "title": "Czesław Michniewicz żegna się z kadrą. Imponujące zarobki w 11 miesięcy", "date_published": "2022-12-22 10:40:13+00:00", "description": "Polski Związek Piłki Nożnej poinformował, że z dniem 31 grudnia 2022 r. Czesław Michniewicz przestanie pełnić funkcję selekcjonera reprezentacji Polski. To było 11 miesięcy wzlotów i upadków oraz dobrych zarobków.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/finanse/prezydent-poszedl-rzadowi-na-reke-czesc-wydatkow-wypada-z-reguly-wydatkowej/z62tqk8", "title": "Prezydent poszedł rządowi na rękę. Część wydatków wypada z reguły wydatkowej", "date_published": "2022-12-22 10:20:23+00:00", "description": "Prezydent Andrzej Duda podpisał nowelizację ustawy o podatku od niektórych instytucji finansowych oraz niektórych innych ustaw — przekazała w czwartek Kancelaria Prezydenta RP. Ustawa pozwala wyłączyć w tym roku część wydatków państwa z reguły wydatkowej.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wyciekly-zdjecia-rzecznika-putina-z-imprezy-uwage-zwraca-luksusowy-gadzet/wcnysvb", "title": "Wyciekły zdjęcia rzecznika Putina z imprezy. Uwagę zwraca luksusowy gadżet", "date_published": "2022-12-22 10:12:35+00:00", "description": "Rzecznik Kremla Dmitrij Pieskow przed wzniesieniem toastu zapomniał zdjąć z nadgarstka zegarek wart 6 mln rubli (ponad 360 tys. zł). Działo się to w trakcie imprezy urodzinowej Swietłany Iwanow, żony rosyjskiego wiceministra obrony. Timur Iwanow natychmiast naprawił błąd Pieskowa i zakrył luksusowy gadżet rękawem od jego swetra. Zdjęcia z tego wydarzenia pojawiły się w materiale opublikowanym na youtubowym kanale Team Navalny.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/firmy/zmowa-cenowa-przy-sprzedazy-wegla-uokik-wszczyna-postepowanie/qwld85x", "title": "Zmowa cenowa przy sprzedaży węgla? UOKiK wszczyna postępowanie", "date_published": "2022-12-22 09:56:42+00:00", "description": "Urząd Ochrony Konkurencji i Konsumentów wszczął postępowanie antymonopolowe przeciw Przedsiębiorstwu Wielobranżowemu Atex. UOKiK sprawdza, czy spółka narzucała partnerom handlowym ceny, po których odsprzedawali oni węgiel.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/koniunktura-gospodarcza-w-tych-branzach-pesymizm-jest-najwiekszy/ds2x5ht", "title": "Nowe dane o stanie polskiej gospodarki. W tych branżach pesymizm jest największy", "date_published": "2022-12-22 09:45:12+00:00", "description": "W grudniu większość firm negatywnie ocenia koniunkturę gospodarczą — wynika z najnowszego raportu Głównego Urzędu Statystycznego. Najbardziej pesymistyczne oceny formułują firmy z branż: budownictwo, przetwórstwo przemysłowe oraz zakwaterowanie i gastronomia.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/technologie/digital-poland/maria-jeleniewska-krolowa-tiktoka-w-cyfrowych-historiach/sqn6l63", "title": "\"Na TikToku można zarabiać tak, aby spełniać marzenia\". Maria Jeleniewska o tym, jak zdobyć miliony", "date_published": "2022-12-22 09:20:26+00:00", "description": "Telefon i aplikacje, jakie oferuje to cyfrowe narzędzie, najlepiej uwalniają moją kreatywność – mówi w rozmowie z Business Insider Polska influencerka Maria Jeleniewska. Jej kreatywność przyciągnęła ponad 13 milionów obserwatorów i sprawiła, że Maria stała się królową polskiego TikToka. W rozmowie z Nell Przybylską mówi o tym, jak zdobyć milionową rzeszę fanów i z czym się to wiąże.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/szwedzki-rzad-apeluje-o-zaopatrzenie-sie-w-latarki-i-zywnosc-wylaczali-reaktory-teraz/v50qe4m", "title": "Szwedzki rząd apeluje o zaopatrzenie się w latarki i żywność. Wyłączali reaktory, teraz brakuje prądu", "date_published": "2022-12-22 09:03:41+00:00", "description": "Rząd Szwecji zaapelował w środę do społeczeństwa o przygotowanie się na możliwość wystąpienia zimą wyłączeń prądu. Według władz ryzyko czasowego braku prądu jest realne, gospodarstwa domowe powinny posiadać m.in. radio, latarkę oraz zapasy żywności. Szwedzi zaczynają tęsknić za wyłączonymi reaktorami jądrowymi.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/twoje-pieniadze/budzet-domowy/w-tym-jestesmy-absolutna-potega-nikt-nie-hoduje-tylu-karpi-co-polska/k56p8vy", "title": "W tym jesteśmy absolutną potęgą. Nikt nie hoduje tylu karpi co Polska", "date_published": "2022-12-22 08:56:40+00:00", "description": "Polska od lat jest największym producentem karpia w UE. Nasi dostawcy odpowiadają za ok. 30 proc. całej produkcji we wspólnocie. Tuż przed Świętami Bożego Narodzenia sprzedaje się ponad 90 proc. wolumenu. Hodowcy mają jednak duży problem z suszą.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/firmy/byly-senator-po-w-tarapatach-jest-winny-wlochom-6-mln-zl/2ccv9tp", "title": "Były senator PO w tarapatach. Jest winny Włochom 6 mln zł", "date_published": "2022-12-22 08:40:24+00:00", "description": "Sąd Apelacyjny w Warszawie oddalił skargę złożoną przez Tomasza Misiaka na decyzję Międzynarodowego Sądu Arbitrażowego w sprawie sprzedaży akcji Work Service S.A. Oznacza to, że były senator jest winien prawie 6 mln zł włoskiej firmie GI Group, z którą podpisał umowę sprzedaży tych akcji.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/twoje-pieniadze/nieruchomosci/co-z-nowym-podatkiem-od-mieszkan-jest-komunikat-ministerstwa/yw7ljp4", "title": "Co z nowym podatkiem od mieszkań? Jest komunikat ministerstwa", "date_published": "2022-12-22 08:39:48+00:00", "description": "Ceny mieszkań i najmu rosną, a coraz więcej lokali przechodzi w ręce firm i funduszy, zarabiających na najmie instytucjonalnym. Receptą na to może być nowy podatek. Co się z nim dzieje?", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/zapalanie-latarni-gdy-mieszkaniec-wysle-sms-to-odpowiedz-na-kryzys/dqvg6s2", "title": "Zapalanie latarni, gdy mieszkaniec wyśle SMS. Tak niemiecka miejscowość oszczędza prąd", "date_published": "2022-12-22 08:22:08+00:00", "description": "Niemiecka agencja prasowa dpa podaje, że niewielka miejscowość w Szlezwiku-Holsztynie, położona przy duńskiej granicy znalazła nowy sposób na oszczędzanie prądu. Jeśli mieszkańcy chcą zapalonych latarni... muszą wysłać sms o treści \"ŚWIATŁO\".", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/prawo/praca/sygnalisci-beda-mogli-donosic-do-urzedow-na-jakich-zasadach/sgtzs4v", "title": "Urzędy podrzucą sobie donosy. Rząd zmienia projekt o sygnalistach", "date_published": "2022-12-22 08:16:24+00:00", "description": "Pracownik, który chce poinformować o defraudacji, korupcji lub innym naruszeniu prawa w firmie, sam wybierze urząd, do którego złoży zgłoszenie. Urzędnicy będą mogli je jednak przekazywać do innego, właściwego — ich zdaniem — organu. W praktyce jednostki publiczne będą mogły więc przerzucać się donosami, które zawierają wiele wrażliwych danych. Karuzela zgłoszeń może doprowadzać do wycieku informacji o nieprawidłowościach w firmach.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gielda/kursy-walut/kurs-franka-frank-szwajcarski-chfpln-22-grudnia-2022/zdwv0p6", "title": "Kurs franka 22 grudnia poniżej 4,75 zł", "date_published": "2022-12-22 08:07:31+00:00", "description": "Frank szwajcarski poniżej 4,75 zł. W czwartek rano 22 grudnia 2022 r. kurs tej waluty wobec polskiego złotego wynosi 4,7376.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gielda/kursy-walut/kurs-euro-eurpln-notowania-walut-22-grudnia-2022/6z7pgrb", "title": "Kurs euro 22 grudnia w okolicach 4,65", "date_published": "2022-12-22 08:02:56+00:00", "description": "Kurs euro w okolicach 4,65. W czwartek rano 22 grudnia 2022 r. kurs EUR/PLN wynosił 4,6598 zł.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gielda/kursy-walut/kurs-dolara-usdpln-notowania-walut-22-grudnia-2022/786gq66", "title": "Kurs dolara 22 grudnia poniżej 4,4 zł", "date_published": "2022-12-22 08:00:00+00:00", "description": "Kurs dolara poniżej 4,4 zł. W czwartek rano 22 grudnia 2022 r. kurs USD/PLN wynosi 4,3792.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/twoje-pieniadze/wazne-zmiany-od-1-stycznia-wyzsze-pensje-wyzsze-skladki-na-zus/9f7kzb6", "title": "Ważne zmiany od 1 stycznia. Wyższe pensje, wyższe składki na ZUS", "date_published": "2022-12-22 07:28:22+00:00", "description": "Od nowego roku wyższa będzie kwota minimalnego wynagrodzenia i prognozowanego przeciętnego wynagrodzenia w 2023 r. Zmienią się w związku z tym wysokości składek na ubezpieczenia społeczne obliczane przez przedsiębiorców — przypomina Zakład Ubezpieczeń Społecznych.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/twoje-pieniadze/praca/rekordzistka-pracowala-cztery-dni-z-rzedu-od-6-do-24-sklepowa-luka-kadrowa-sie/jhqlhq8", "title": "Rekordzistka pracowała \"cztery dni z rzędu od 6 do 24\". Sklepowa luka kadrowa się powiększa", "date_published": "2022-12-22 06:55:26+00:00", "description": "Sieci handlowe znajdują się w coraz trudniejszym położeniu. Mimo podwyżek płac wciąż nie są w stanie wypełnić wszystkich wakatów. Pracownicy w niepełnych zespołach są przeciążeni, a kolejki do kas wydłużają się coraz bardziej.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/finanse/handel/zaskakujace-informacje-w-handlu-te-sklepy-klienci-omijaja-szerokim-lukiem/w1j9tvn", "title": "Zaskakujące informacje w handlu. Te sklepy klienci omijają szerokim łukiem", "date_published": "2022-12-22 06:54:20+00:00", "description": "Klienci zaczęli omijać sklepy z elektroniką. Kupujemy coraz mniej telewizorów czy tabletów. I oszczędzamy. Jak opisuje \"Rzeczpospolita\", aż ż 13,5 mln gospodarstw kupuje towary pod markami własnymi.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/twoje-pieniadze/to-ma-byc-nowe-500-plus-minister-o-szczegolach-programu-pierwsze-mieszkanie/b301nc5", "title": "To ma być nowe 500 plus. Minister o szczegółach wielkiego programu PiS", "date_published": "2022-12-22 06:38:35+00:00", "description": "Jak zapowiada minister rozwoju i technologii Waldemar Buda, program \"Pierwsze mieszkanie\" będzie jak 500 plus. Zapewnił, że będzie to pierwszy powszechny program mieszkaniowy, który będzie realnie działał na dużą skalę.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/poradnik-finansowy/kredyty/jak-wyglada-proces-przeniesienia-kredytu-hipotecznego-na-inna-nieruchomosc/9gbhrx9", "title": "Przeniesienie kredytu hipotecznego na inną nieruchomość – czy to możliwe?", "date_published": "2022-12-22 06:30:00+00:00", "description": "Biorąc kredyt hipoteczny na kilkadziesiąt lat, nie da się przewidzieć, jak potoczy się życie. Na szczęście istnieje opcja przeniesienia kredytu na inną nieruchomość. Powodów takiej decyzji może być wiele. Niezależnie od sytuacji, warto znać odpowiedzi na podstawowe pytania. Pozwala to uniknąć potencjalnych problemów i konsekwencji błędnych decyzji. Jak wygląda proces przeniesienia kredytu hipotecznego? Kiedy i jak o to wnioskować? Ile może kosztować cały proces?", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/prawo/praca/praca-nie-dla-obcokrajowcow-powstanie-lista-chronionych-zawodow/fg4463x", "title": "Praca nie dla obcokrajowców. Powstanie lista chronionych zawodów", "date_published": "2022-12-22 06:27:31+00:00", "description": "Powstanie lista zawodów, w których nie będzie można zatrudniać obcokrajowców spoza UE bez sprawdzenia, czy na to stanowisko nie ma chętnych Polaków. Rząd wprowadzi takie rozwiązania, ale tylko wtedy, gdy wzrośnie bezrobocie — pisze w czwartek \"Dziennik Gazeta Prawna\".", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/twoje-pieniadze/tyle-wyda-na-swieta-przecietny-polak-rosnie-liczba-oszczednych/lyz148j", "title": "Tyle wyda na święta przeciętny Polak. Rośnie liczba oszczędnych, ale nie tylko", "date_published": "2022-12-22 06:22:17+00:00", "description": "Jak wynika z sondażu DGP i RMF FM, zauważalnie więcej Polaków wyda na Święta Bożego Narodzenia mniej niż rok wcześniej. Z drugiej strony rośnie jednak także liczba tych, którzy przeznaczą na nie nawet powyżej trzech tysięcy złotych.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/technologie/z-tym-oszustwem-na-pesel-zetknal-sie-co-czwarty-polak-dzialamy-zbyt-pochopnie/wrpf8gg", "title": "Z tym oszustwem zetknął się co czwarty Polak. \"Zbyt pochopnie dzielimy się tym w sieci\"", "date_published": "2022-12-22 06:08:46+00:00", "description": "To już prawdziwa plaga. Nawet 27 proc. Polaków otrzymało w ostatnim czasie telefon lub e-mail z prośbą o podanie numeru PESEL od oszustów podających się za bank, dostawcę prądu lub internetu. Dane, którymi dzielimy się pochopnie, mogą łatwo wykorzystać.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/piec-najciekawszych-wydarzen-w-gospodarce-teraz-22122022/ywvm3cy", "title": "Oczekiwania inflacyjne mamy najmniejsze od ponad roku", "date_published": "2022-12-22 06:02:43+00:00", "description": "Wygląda na to, że powoli spadają nam oczekiwania inflacyjne, co może okazać się kluczowe w obniżaniu samej inflacji w przyszłym roku. Sprzedaż detaliczna w listopadzie wypadła lepiej od oczekiwań. Niemcy jednak wyłączą wkrótce swoje elektrownie atomowe, a na giełdzie w USA coraz gorzej radzi sobie Tesla, a coraz lepiej – Nike, które twierdzi, że problemy z logistyką i dostawami w końcu się skończyły. Oto pięć najciekawszych wydarzeń w gospodarce teraz.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/technologie/motoryzacja/ile-beda-kosztowac-samochody-w-2023-siedem-najwazniejszych-prognoz/ez5cmf9", "title": "Siedem najważniejszych prognoz dla motoryzacji. \"2023 będzie rokiem warsztatów\"", "date_published": "2022-12-22 05:43:43+00:00", "description": "Jak będzie wyglądał 2023 r. w motoryzacji? Po skokowych wzrostach cen może czekać nas niespodzianka. Sprzedawcy nowych samochodów mogą znaleźć się w tarapatach, ale z drugiej strony mniejsze apetyty klientów sprawią, że w biznesie pojawi się nowa, szybko rozwijająca się nisza obejmująca używane pojazdy. Oto siedem prognoz dotyczących polskiego rynku samochodów, sformułowanych przez Michała Knittera, wiceprezesa Carsmile.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/swiatowe-media-o-przemowieniu-zelenskiego-w-usa-nowa-faza-wojny/fkgj78z", "title": "Światowe media o przemówieniu Zełenskiego w USA. \"Nowa faza wojny\"", "date_published": "2022-12-22 05:42:11+00:00", "description": "Pierwsza zagraniczna wizyta Prezydenta Ukrainy i jego przemówienie w Kongresie odbiły się dużym echem w światowych mediach. Zarówno amerykańska stacja CNN, jak i włoska agencja prasowa Ansa, wskazały, że przemówienie oznacza nową fazę wojny. Wytłumaczyły także, na czym ma polegać przewidywany przez nie zwrot. Korespondenta z niemieckiej ARD była natomiast sceptyczna co do skutków, jakie może przynieść wizyta.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/prawo/zamiana-wibor-u-na-wiron-co-z-obligacjami-i-innymi-instrumentami-finansowymi/myg3yvp", "title": "WIRON namiesza nie tylko w kredytach. Rynek ma tylko rok na przygotowanie się do zmiany", "date_published": "2022-12-22 05:29:28+00:00", "description": "Narodowa Grupa Robocza ogłosiła, że od 2025 r. nowym wskaźnikiem referencyjnym będzie WIRON. Zastąpi on mający prawie 30 lat WIBOR. Wiele osób myśli, że nastąpi to automatycznie na podstawie rozporządzenie ministra finansów. Tak jednak nie będzie w wielu umowach o kredyt hipoteczny, a także w przypadku obligacji korporacyjnych. Rynek finansowy czeka więc duże wyzwanie.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/zelenski-z-przemowieniem-w-kongresie-poruszajace-slowa/d080f8p", "title": "Zełenski z przemówieniem w Kongresie. Poruszające słowa: jeden terrorysta znalazł drugiego", "date_published": "2022-12-22 05:19:52+00:00", "description": "Zełenski apelował o więcej broni dla Ukrainy i argumentował, że jeśli Rosja nie zostanie powstrzymana, nie skończy w Ukrainie. Wskazał, że pieniądze przekazane Kijowowi to \"nie dobroczynność\". Przekonywał również, że Rosja wraz ze swoimi sprzymierzeńcami może zaatakować kolejne kraje. — Jeden terrorysta znalazł drugiego. To tylko kwestia czasu, kiedy uderzą przeciwko waszym innym sojusznikom — przestrzegał.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gielda/wiadomosci/nbp-mial-kupic-100-ton-zlota-nie-wyszlo-2-mld-zl-przeszly-kolo-nosa/gvf4ckl", "title": "NBP wyleczył się z gorączki złota? Prezesowi przeszły koło nosa ponad 2 mld zł", "date_published": "2022-12-22 05:09:00+00:00", "description": "Ponad rok temu prezes NBP zapowiadał, że jak pozostanie na stanowisku na kolejne sześć lat, będzie chciał zwiększyć polskie rezerwy złota w 2022 r. aż o 100 ton. Nominację zyskał, ale o złocie zrobiło się cicho. Tymczasem na świecie banki obkupiły się w kruszec, bijąc rekordy. Eksperci nie dziwią się tej gorączce złota, choć z jego ceną bywało różnie. Gdyby NBP kupił 100 ton w styczniu, teraz miałby z tego ponad 2 mld zł czystego zysku.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/czlonek-rady-nadzorczej-rafinerii-gdanskiej-wstrzymal-sie-od-glosu-chodzi-o-umowy-z/yf39jft", "title": "Członek rady nadzorczej Rafinerii Gdańskiej odwołany. Nie poparł umów z Saudi Aramco [TYLKO U NAS]", "date_published": "2022-12-22 05:03:00+00:00", "description": "Paweł Przychodzeń, bliski współpracownik ministra koordynatora służb specjalnych i szefa resortu spraw wewnętrznych Mariusza Kamińskiego, został odwołany z rady nadzorczej Rafinerii Gdańskiej. Z ustaleń Business Insider wynika, że wstrzymał się od głosu w sprawie umów, jakie Orlen ostatecznie zawarł z Saudyjczykami, a które dotyczyły sprzedaży 30 proc. udziałów w Rafinerii Gdańskiej. Nasi informatorzy wskazują, że Przychodzeń, miał szereg zastrzeżeń dotyczących zapisów, które znalazły się w dokumentach. Wyleciał z rady nadzorczej rafinerii w dzień ogłoszenia przez Orlen finalizacji umów z arabskim inwestorem.", "persistent": false, "language": "en-US"}], "source": {"url": "https://businessinsider.com.pl/.feed", "title": "Business insider"}}