[{"source": "https://www.computerworld.com/index.rss", "title": "Why enterprises should embrace remote work in 2023", "description": "<article>\n\t<section class=\"page\">\n<p>Many businesses are looking to cut costs as economies face recession, but some enterprises may be ignoring one of the most effective ways to trim the fat while boosting productivity — by <a href=\"https://www.computerworld.com/article/3670738/the-new-workplace-will-be-distributed-digital-and-full-of-purpose.html\">embracing remote working</a>.</p><h2><strong>The power is in your hands</strong></h2>\n<p>We know Macs, iPhones, and iPads have been seeing <a href=\"https://www.computerworld.com/article/3679730/jamf-q3-data-confirms-rapid-mac-adoption-across-the-enterprise.html\">increased deployment across the enterprise</a>. We also know (because <a href=\"https://www.applemust.com/7-reasons-ibm-says-every-enterprise-should-support-macs/\" rel=\"nofollow noopener\" target=\"_blank\">IBM</a>, SAP and so many companies tell us) that businesses that embrace Apple kit also see reduced overall cost of ownership and lower tech support costs. Employee choice<a href=\"https://www.computerworld.com/article/3649793/using-choice-to-keep-and-retain-talent-amid-the-great-resignation.html\"> delivers big benefits</a>.</p><p class=\"jumpTag\"><a href=\"https://www.computerworld.com/article/3684050/why-enterprises-should-embrace-remote-work-in-2023.html#jump\">To read this article in full, please click here</a></p></section></article>", "link": "https://www.computerworld.com/article/3684050/why-enterprises-should-embrace-remote-work-in-2023.html#tk.rss_all", "date_published": "2022-12-22 19:39:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.computerworld.com/index.rss", "title": "BrandPost: How to Orchestrate Enterprise IT Like a Maestro", "description": "<article>\n\t<section class=\"page\">\n<p>With the competition just a click away, customer experience is everything. Consumers have unprecedented access to new digital services like never before. They are enjoying easier, faster, seamless, and personalized experiences. Looking forward, providers of these services must capitalize on embedded opportunities as the key to differentiating themselves and outcompeting in their markets. </p><p>Embedded opportunities are everywhere, across most, if not all, industries. In finance, embedded payments can make life easier for all parties with a single touch — removing the need to swipe, insert, or even tap a card. Customers automatically pay through an app at the end of their buying journey. Think of your ordering and pick-up experience through your favorite coffee shop app — a quick, accurate, and ultimately delightful start to your day, as you didn’t have to wait too long, of course.</p><p class=\"jumpTag\"><a href=\"https://www.computerworld.com/article/3684111/how-to-orchestrate-enterprise-it-like-a-maestro.html#jump\">To read this article in full, please click here</a></p></section></article>", "link": "https://www.computerworld.com/article/3684111/how-to-orchestrate-enterprise-it-like-a-maestro.html#tk.rss_all", "date_published": "2022-12-22 15:38:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.computerworld.com/index.rss", "title": "BrandPost: Mainframe Is a Part of Your Cloud Strategy. Now What?", "description": "<article>\n\t<section class=\"page\">\n<p>If Mainframe were an athlete, it would have multiple MVP titles. So would Cloud. Now, this sounds like the beginning of a championship team. But just as great players alone don’t bring home the pennant (or trophy, depending on your sport), neither do great technologies. You have to bring those “players” on your IT roster together and integrate them into a cohesive unit that allows each one to shine. That’s what makes a championship team.</p><p>Now, in sports, players get an off-season and time to rest. In the world of business — and the technology that runs it — there is no off-season. Your IT stack needs to be ready 24x7x365. That means every one of the platforms on your IT roster needs to know its position and be able to perform at its best and work seamlessly with the rest of the squad.</p><p class=\"jumpTag\"><a href=\"https://www.computerworld.com/article/3684172/mainframe-is-a-part-of-your-cloud-strategy-now-what.html#jump\">To read this article in full, please click here</a></p></section></article>", "link": "https://www.computerworld.com/article/3684172/mainframe-is-a-part-of-your-cloud-strategy-now-what.html#tk.rss_all", "date_published": "2022-12-22 15:38:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.computerworld.com/index.rss", "title": "2022's top Google Assistant advice for Android", "description": "<article>\n\t<section class=\"page\">\n<p>One of Android's most underappreciated advantages is its tight integration with the excellent Google Assistant voice command genie.</p><p>It's easy to take Assistant for granted, being a person who carries around an Android phone every day. It's just always <em>there</em>, usually quietly waiting. And it's certainly not perfect.</p><p>But Assistant can do some spectacularly useful stuff. And all it takes is 10 minutes with an iPhone to remind yourself just how good we've got it.</p><p>These bits of advanced Google Assistant knowledge from Android Intelligence over the past year will help you tap into some of the service's most advanced and out-of-sight possibilities. Check 'em out, store 'em deep in your brain's internal storage, and be sure to come <a href=\"https://www.androidintel.net\" rel=\"noopener nofollow\" target=\"_blank\"><strong>sign up for my Android Intelligence newsletter</strong></a> when you're done to get even more off-the-beaten-path knowledge in your inbox every Friday — direct from me to you.</p><p class=\"jumpTag\"><a href=\"https://www.computerworld.com/article/3682776/google-assistant-android-2022.html#jump\">To read this article in full, please click here</a></p></section></article>", "link": "https://www.computerworld.com/article/3682776/google-assistant-android-2022.html#tk.rss_all", "date_published": "2022-12-22 11:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]