{"entries": [{"source": "https://www.engadget.com/rss.xml", "link": "https://www.engadget.com/bytedance-tiktok-employees-us-user-data-journalists-210339650.html?src=rss", "title": "ByteDance fired four employees who accessed US journalists' TikTok data", "date_published": "2022-12-22 21:03:39+00:00", "description": "<p><a href=\"https://www.engadget.com/tag/bytedance/\"><ins>ByteDance</ins></a> says it has fired four employees who accessed the data of several <a href=\"https://www.engadget.com/tag/tiktok/\"><ins>TikTok</ins></a> users located in the US, including journalists. According to <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=c813ae39-7d58-41cb-ac66-ad830606ceef&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=The+New+York+Times&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiJjODEzYWUzOS03ZDU4LTQxY2ItYWM2Ni1hZDgzMDYwNmNlZWYiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cubnl0aW1lcy5jb20vMjAyMi8xMi8yMi90ZWNobm9sb2d5L2J5dGUtZGFuY2UtdGlrLXRvay1pbnRlcm5hbC1pbnZlc3RpZ2F0aW9uLmh0bWw_c21pZD10dy1zaGFyZSIsImNvbnRlbnRVdWlkIjoiM2UyOGY2M2YtMmJlZi00MmIwLWJlMWEtY2YwZTVkMDYzODNhIn0&amp;signature=AQAAAYPwXAJfe73m4JFqguhpCkqsiUxuoXZk0U2e00DaAzmG&amp;gcReferrer=https%3A%2F%2Fwww.nytimes.com%2F2022%2F12%2F22%2Ftechnology%2Fbyte-dance-tik-tok-internal-investigation.html%3Fsmid%3Dtw-share\"><em><ins>The New York Times</ins></em></a>, an investigation conducted by an outside law firm found that the employees were trying to locate the sources of leaks to reporters. Two of the employees were in the US and two were in China, where ByteDance is based.</p><p>The company reportedly determined that members of a team responsible for monitoring employee conduct accessed the IP addresses and other data linked to the TikTok accounts of a reporter from <a href=\"https://www.engadget.com/tiktok-owner-bytedance-reportedly-pushed-pro-china-messages-topbuzz-024207681.html\"><em><ins>BuzzFeed News</ins></em></a><em>&nbsp;</em>and <a href=\"https://www.ft.com/content/e873b98a-9623-45b3-b97c-444a2fde5874\"><ins>Cristina Criddle of the </ins><em><ins>Financial Times</ins></em></a>. The employees are also said to have accessed the data of several people with ties to the journalists. <a href=\"https://www.forbes.com/sites/emilybaker-white/2022/12/22/tiktok-tracks-forbes-journalists-bytedance/?sh=4d5d16707da5\"><em><ins>Forbes </ins></em><ins>claims</ins></a> that ByteDance tracked three of its reporters who previously worked for <em>BuzzFeed News</em>. All three of those publications have published reports on TikTok, including on its alleged ties to the Chinese government. Engadget has contacted ByteDance for comment.</p><span id=\"end-legacy-contents\"></span><p>“The misconduct of those individuals, who are no longer employed at ByteDance, was an egregious misuse of their authority to obtain access to user data. This misbehavior is unacceptable, and not in line with our efforts across TikTok to earn the trust of our users,\" ByteDance said in a statement to <a href=\"https://variety.com/2022/digital/news/bytedance-fires-employees-data-us-tiktok-journalists-1235468448/\"><em><ins>Variety</ins></em></a>. \"We take data security incredibly seriously, and we will continue to enhance our access protocols, which have already been significantly improved and hardened since this incident took place.”</p><p>In October, <a href=\"https://www.forbes.com/sites/emilybaker-white/2022/10/20/tiktok-bytedance-surveillance-american-user-data/\"><em><ins>Forbes </ins></em><ins>reported</ins></a> that members of ByteDance’s Internal Audit and Risk Control department planned to use TikTok to track the locations of specific US citizens. <a href=\"https://www.engadget.com/tiktok-denies-allegations-forbes-061004399.html\"><ins>ByteDance refuted those claims</ins></a>, but the report tracks with the results of the internal investigation. The company told the <em>Times </em>it has restructured that department and prevented it from accessing any US data.</p><p>“No matter what the cause or the outcome was, [the employees'] misguided investigation seriously violated the company’s Code of Conduct and is condemned by the company,\" ByteDance CEO Rubo Liang reportedly told employees in a memo. \"We simply cannot take integrity risks that damage the trust of our users, employees, and stakeholders. We must exercise sound judgment in the choices we make and be sure they represent the principles we stand behind as a company.”</p><p>Word of the investigation and employees' dismissal comes amid various attempts to ban TikTok in the US. <a href=\"https://www.engadget.com/georgia-tiktok-wechat-telegram-ban-211015416.html\"><ins>More than a dozen states</ins></a>, including Georgia and Texas, have blocked the app on government-owned devices. Earlier this month, a bipartisan bill sought to <a href=\"https://www.engadget.com/senate-house-tiktok-ban-bill-anti-social-ccp-act-205120387.html\"><ins>effectively ban</ins></a> TikTok from US consumer devices, along with other social apps that have ties to China, Russia, Cuba, Iran, North Korea and Venezuela.</p><p>Meanwhile, the Senate has passed <a href=\"https://www.engadget.com/congress-attempts-ban-tiktok-on-government-devices-through-17-trillion-spending-bill-204028363.html\"><ins>a $1.7 trillion spending bill</ins></a>, which includes a measure that would ban TikTok on most devices issued by the federal government. There will be some exceptions for elected officials, congressional staff and law enforcement. The House is yet to vote on the omnibus bill but is expected to pass it on Thursday evening.&nbsp;</p><p>According to the <em>Times</em>, ByteDance said the fired employees accessed historical data that it plans to delete from its own data servers in the US and Singapore. The company <a href=\"https://www.engadget.com/tiktok-user-data-us-200500287.html/\"><ins>said in June</ins></a> that all of TikTok's TikTok user traffic is being routed to Oracle's servers. That's now the \"default storage location of US user data,\" but at the time ByteDance continued to back up the data on its own servers.</p>", "persistent": false, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "link": "https://www.engadget.com/youtube-nfl-sunday-ticket-deal-155108503.html?src=rss", "title": "YouTube will be the home of NFL Sunday Ticket starting in 2023", "date_published": "2022-12-22 15:51:08+00:00", "description": "<p><a href=\"https://www.engadget.com/tag/youtube/\"><ins>YouTube</ins></a> is ready for some more football. The streaming service has snagged the rights to the NFL Sunday Ticket package, which offers access to out-of-market games that air on FOX and CBS each Sunday. DirecTV, the current home of Sunday Ticket, has <a href=\"https://www.engadget.com/2014-10-01-directv-nfl-sunday-ticket-renewed.html\"><ins>held the rights</ins></a> since 1994, but the bundle will move to Google’s streaming service next season.</p><p>Apple and Amazon were also believed to be in talks for Sunday Ticket. Apple was <a href=\"https://www.engadget.com/nfl-apple-sunday-ticket-directv-193022880.html\"><ins>reportedly the frontrunner</ins></a> at one point, but it's said to have dropped out of the race last week, leaving Amazon and Google to duke it out.</p><span id=\"end-legacy-contents\"></span><p>Sunday Ticket will be available as an add-on for YouTube TV subscribers or as a standalone option on YouTube Primetime Channels, an à la carte service that <a href=\"https://www.engadget.com/youtube-showtime-paramount-primetime-channels-tv-movies-170458712.html\"><ins>debuted last month</ins></a>. YouTube hasn’t revealed how much it will charge for Sunday Ticket yet. Sunday Ticket plans for the 2022 season on DirecTV started at $294.</p><div id=\"527361aa7ee24cd3919941ebb5a9dee5\"><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">NFL 👏 Sunday 👏 Ticket 👏 is coming to YouTube Primetime Channels and <a href=\"https://twitter.com/YouTubeTV?ref_src=twsrc%5Etfw\">@YouTubeTV</a> in *2023*. <a href=\"https://t.co/c8sbA25IXw\">pic.twitter.com/c8sbA25IXw</a></p>— YouTube (@YouTube) <a href=\"https://twitter.com/YouTube/status/1605934302432149504?ref_src=twsrc%5Etfw\">December 22, 2022</a></blockquote></div><p>YouTube and the NFL didn’t announce the terms of the deal. According to <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy53c2ouY29tL2FydGljbGVzL3lvdXR1YmUtY2VtZW50cy1pdHMtdHYtc2hpZnQtd2l0aC1uZmwtc3VuZGF5LXRpY2tldC1kZWFsLTExNjcxNzExODM2P21vZD1TZWFyY2hyZXN1bHRzX3BvczEmcGFnZT0xIiwiY29udGVudFV1aWQiOiIyMTc5NTM1Mi05Nzc3LTRkZDUtODJhNC02ODA1OGY4MTVmYjQifQ&amp;signature=AQAAAcJiwRY8yrtLUafLRL6OZNK5Mygir4z3BgjhY2GvGeV1&amp;gcReferrer=https%3A%2F%2Fwww.wsj.com%2Farticles%2Fyoutube-cements-its-tv-shift-with-nfl-sunday-ticket-deal-11671711836%3Fmod%3DSearchresults_pos1%26page%3D1\"><em><ins>The Wall Street Journal</ins></em></a>, YouTube will pay $2 billion per year in a seven-year pact. That's around $500 million more per season that DirecTV is paying. However, DirecTV is <a href=\"https://variety.com/2022/digital/news/youtube-tv-nfl-sunday-ticket-2023-season-1235468074/\"><ins>believed to have</ins></a> between 1.5 million and 2 million Sunday Ticket subscribers, and it has been losing money on the package for years.</p><p>In <a href=\"https://nflcommunications.com/Pages/NFL-AND-GOOGLE-PARTNER-TO-BRING-FANS-THE-NEXT-GENERATION-OF-NFL-SUNDAY-TICKET-ON-YOUTUBE-TV-AND-YOUTUBE-PRIMETIME-CHANNELS.aspx\"><ins>a statement</ins></a>, the NFL said it and \"YouTube will work together to determine additional ways to support distribution of NFL Sunday Ticket in commercial establishments such as bars and restaurants.\" The <em>Journal </em>suggested that could lead to YouTube paying the league another $200 million per year.</p><p>The NFL and YouTube have been partners for several years, dating back to the debut of the league's main channel on the platform in 2015. Two years ago, YouTube TV subscribers gained access to <a href=\"https://www.engadget.com/youtube-tv-nfl-network-sports-plus-add-on-170157380.html\">NFL Network and NFL RedZone</a>. Those will stay on YouTube TV under the terms of the expanded pact. Additionally, the two sides will grant some YouTube creators access to certain NFL tentpole events for content opportunities.</p><p>The Sunday Ticket agreement is a major coup for Google. YouTube TV is already home to other sports networks, such as those from the NBA and MLB, but having exclusive rights to a bundle that offers many out-of-market NFL games is likely to draw more users to the streaming service. Amazon Prime Video has an 11-year deal to <a href=\"https://www.engadget.com/amazon-thursday-night-football-2022-season-184224274.html\"><ins>stream Thursday Night Football</ins></a> games that started this season. Apple is pushing further into live sports as well, with a 10-year deal to stream every Major League Soccer game via Apple TV <a href=\"https://www.engadget.com/apple-tv-mls-soccer-streaming-subscription-service-171000757.html\">starting in 2023</a>.</p>", "persistent": false, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "link": "https://www.engadget.com/best-games-for-ps5-playstation-5-171511880.html?src=rss", "title": "The best PlayStation 5 games for 2023", "date_published": "2022-12-22 15:30:06+00:00", "description": "<p>Welcome to our first update to Engadget’s best games list for PlayStation 5. As always, we have looked for games that generally offer meaningful improvements over their last-gen counterparts when played on PS5, or are exclusive to the system. Our 2022 update sees two third-party titles – <em>Deathloop</em> and <em>Final Fantasy VII Remake</em> – join the overwhelmingly Sony fray. We'll be updating this periodically, so, if a game's just been released and you don't see it, chances are that the reason for its absence is that we haven't played through it yet. Either that or we hate it.</p><h2>Stray</h2><p></p><p><em>Stray</em> a perfectly contained adventure game that has you embodying a cat in a post-apocalyptic world humans have left behind. It has plenty of fresh ideas, each one pared down to its purest form. Plenty of actions in <em>Stray</em> exist simply because they make sense for a cat protagonist (and probably because they’re cute as hell). There’s a discrete button to meow, and the robots the cat shares its world with react with shock and frustration when you cut across their board game, throwing pieces to the floor. It’s possible to curl up and sleep basically any time, anywhere – even directly on top of a robot stranger. When the cat gets pets and cuddles from the robots, it purrs and the DualSense’s haptics fire up in response. The environmental puzzles take advantage of this cat-level perspective, inviting players to look at the world with different, light-reflective eyes.</p><span id=\"end-legacy-contents\"></span><p>As well as puzzle-solving, ledge-leaping and blob-dodging, <em>Stray</em> introduces a world of lighthearted dystopia, where robots don’t hate the humans that came before them. Instead, they attempt to cultivate plants that can survive in the dark, just because people would have liked that. Compared with most dystopian cyberpunk games, <em>Stray</em> is downright joyful.</p><h2>God of War: Ragnarök</h2><p></p><p>2018’s <em>God of War</em> was a brilliant reinvention for a franchise that was in desperate need of a reboot. For an encore, all Sony’s Santa Monica Studio did was every single stake they could. <em>God of War Ragnarök </em>is a massive adventure, taking protagonist Kratos and his son Atreus all over the nine Norse realms as they prepare for Ragnarök, a mythical event essentially meant to bring about the end of the world. Along the way, Kratos and Atreus get up close and personal with even more of the Norse gods, including stunning encounters with the drunken but deadly Thor and, of course, Odin himself.</p><p>The combat in <em>Ragnarök</em> remains one of the most satisfying gaming experiences I can think of – it’s fluid and extremely customizable. And once you get into a groove and power up Kratos, it’s truly a god-like experience. There’s also a much greater variety of enemies this time out, from the smaller grunts you mow through to bigger and more intense boss battles. There are more realms to visit, more sidequests than ever and an endgame sequence that’s up there with the biggest battles any God of War game has ever put to screen. The backdrop for all this is some of the most beautifully detailed and varied environments you can find, from the swampy confines of Vanaheim and the fiery to the frozen tundra of Midgard. On the PS5, you can choose between native 4K visuals or high frame rates up to 120Hz, provided your TV can handle it.</p><h2>The Last of Us</h2><p></p><p><em>The Last of Us</em> and its sequel may have originally come out for the PS3 and PS4, respectively, but they also provide two excellent PS5 experiences. <em>The Last of Us Part I</em> is a complete visual remake for the PS5 of the 2013 original, with massively improved character models and environments, along with native 4K visuals or frame rates up to 120 fps. <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9MYXN0LVVzLVBhcnQtSUktUGxheVN0YXRpb24tNC9kcC9CMDdESlJGU0RGP3RhZz1nZGd0MGMtcC1vLWR4LTIwIiwiY29udGVudFV1aWQiOiI0NTJkNjcyOS1mMTM2LTQ3NWMtOWJjNS01OGY4ZTBlYmNjNjQifQ&amp;signature=AQAAAYeyu0p_pWAyd4mjRvmr54p4LzrpcsVkQLHQwtS4Ftws&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FLast-Us-Part-II-PlayStation-4%2Fdp%2FB07DJRFSDF\"><em>The Last of Us Part II</em></a> originally launched for the PS4 in 2020, and developer Naughty Dog released a patch for it last year unlocking 60 fps gameplay on the PS5. There weren’t any other major updates, but the game already looked amazing on the PS4 so there wasn’t a ton to change here. Either way, the PS5 is the best place to experience these two games.</p><p>Both games feature a sprawling post-pandemic adventure story, following survivors Joel and Ellie through a gorgeously rendered but terrifying world where zombie-like Infected and regular humans alike are out for your blood. You’ll never really feel like you have enough supplies to survive, so you need to make every shot count – or figure out how to sneak around enemies or craft tools that’ll get you out of tight spots. There’s an ever-present sense of danger in these games, while the stories focus on human connection in all its messy glory; the tone is often extremely grim, but there are moments of levity, humor and hope sprinkled throughout the ruined world. <em>The Last of Us Part I</em> and <em>Part II</em> both put you through an intense, violent and emotional experience, but they remain a journey worth taking.</p><h2>Rollerdrome</h2><p></p><p><em>Rollerdrome</em> is lush. It’s incredibly stylish, taking cues from 1970s Hollywood sci-fi but with an attractive cel-shaded filter over every scene. Even better than its stunning visuals, <em>Rollerdrome</em> has smooth, precise mechanics that allow players to fall into a flow in every level. The game is all about gliding through the environments on rollerblades, picking up speed and doing tricks while dodging and shooting enemies, managing weapons and controlling time – and it all comes together in a thrilling dystopian bloodsport.</p><p>It’s a joy to dodge, dodge, dodge and then leap into the air, slow down time and take out the people shooting at you, refilling ammo and collecting health in the process. Meanwhile, an unsettling story of corporate greed unfolds naturally beneath the rollerblading bloodshed, keeping the stakes high. <em>Rollerdrome</em> was a sleeper hit of 2022, so if you’ve been napping on this one, now’s the time to wake up and play.</p><h2>Overwatch 2</h2><p></p><p>Even though Blizzard has improved the onramp for new players this time around, <em>Overwatch 2 </em>still has a steep learning curve. Stick with it, though, and you’ll get to indulge in perhaps the best team shooter around. <em>Overwatch 2</em> has a deceptively simple goal — stand on or near an objective and keep the other team away long enough to win. It’s much more complex in practice. To the untrained eye, matches may seem like colorful chaos, but <em>Overwatch 2</em> has a deceptively simple goal — stand on or near an objective and keep the other team away long enough to win.</p><p>It’s much more complex in practice. Blizzard reduced the number of players on each team from six to five. That, along with across-the-board character tweaks, has made gameplay faster-paced and more enjoyable compared with the original <em>Overwatch</em>. There's a greater emphasis on individual impact, but you'll still need to work well with your teammates to secure a victory.</p><p>Now featuring a cast of more than 30 heroes, each with distinct abilities and playstyles, you’ll surely find a few <em>Overwatch 2</em> characters that you can connect with. The first batch of new heroes are all a blast to play. There are many great (though often fairly expensive) new skins to kit them out with too. The game looks and sounds terrific too, thanks to Blizzard’s trademark level of polish. At least until you figure out how to play <em>Overwatch 2</em>, you can marvel at how good it looks.</p><h2>Astro’s Playroom</h2><p></p><p>It’s odd to start a best games list with a title that comes free with the console, but if you’re anything like my son, who swiftly deleted <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy5wbGF5c3RhdGlvbi5jb20vZW4tdXMvZ2FtZXMvYXN0cm9zLXBsYXlyb29tLyIsImNvbnRlbnRVdWlkIjoiNDUyZDY3MjktZjEzNi00NzVjLTliYzUtNThmOGUwZWJjYzY0In0&amp;signature=AQAAARyhZ2-STAUhBsc4fQ5UbMgeniWiOVLoWpihjV5FSKpr&amp;gcReferrer=https%3A%2F%2Fwww.playstation.com%2Fen-us%2Fgames%2Fastros-playroom%2F\"><em>Astro’s Playroom</em></a> to make space for various Call of Duty titles, I’m here to tell you to give the pack-in title another shot. <em>Astro’s Playroom</em> is a love letter to both 3D platformers and the PlayStation itself. It’s also, to date, the title that makes the best use of Sony’s DualSense controller, with incredible haptic feedback and clever usage of the pad’s adaptive triggers. (Although, eight years on, I’m still not convinced anyone has found a compelling reason for that touch pad.) It’s a game that even completionists can finish within six hours or so, but those six hours were among the most fun I’ve had with the PS5 so far.</p><h2><strong>Final Fantasy VII Remake: Intergrade</strong></h2><p></p><p>We thought it would never happen. <em>Final Fantasy VII</em> was an iconic JRPG that’s credited with opening up the genre to the west. It peppered the Top 10 lists of the best games of all-time and introduced the long-running Japanese RPG series to polygons, 3D maps, and countless other innovations of 32-bit consoles. 23 years later, and three PlayStation iterations later, Square Enix dared to remake, not remaster, the game. It would be, contentiously, episodic, expanding out the story of Midgar and the opening part of the game into a single game.</p><p>It’s all very different. It’s also gorgeous, with a modern battle system that no longer focuses on static characters and menu choices. Somehow, and we were ready to be underwhelmed, the battle system works. <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=ffe106af-8248-4af3-9098-a2d4fd637766&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=GameStop&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiJmZmUxMDZhZi04MjQ4LTRhZjMtOTA5OC1hMmQ0ZmQ2Mzc3NjYiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuZ2FtZXN0b3AuY29tL3ZpZGVvLWdhbWVzL3BsYXlzdGF0aW9uLTUvcHJvZHVjdHMvZmluYWwtZmFudGFzeS12aWktcmVtYWtlLWludGVyZ3JhZGUtLS1wbGF5c3RhdGlvbi01LzI5Njk1NS5odG1sPyIsImNvbnRlbnRVdWlkIjoiNDUyZDY3MjktZjEzNi00NzVjLTliYzUtNThmOGUwZWJjYzY0In0&amp;signature=AQAAAafv3Epls3ZHNu7i50nd9W8E6u-MoLqkBxudJ5uF16H3&amp;gcReferrer=https%3A%2F%2Fwww.gamestop.com%2Fvideo-games%2Fplaystation-5%2Fproducts%2Ffinal-fantasy-vii-remake-intergrade---playstation-5%2F296955.html%3F\"><em>FF7R’s</em></a> fights are slicker and more enjoyable than those in Final Fantasy XV, the latest entry in the series. Each character, from iconic mercenary Cloud through to eco-terrorist Barret and flower girl Aerith, play in entirely different ways, using the space between themselves and enemies in very different ways. Some sub-missions and distractions feel like they’re there solely to eke some more hours out of your playthrough, but the world of the original has been thoughtfully reimagined, so it’s a minor complaint.</p><p>For anyone that bought the PS4 iteration, the upgrade to PS5 is free. However, it costs money to gain access to the PS5-exclusive DLC chapter featuring ninja Yuffie. Offering another battle style to experiment with and master, two new extra chapters run alongside the events of the first installment of this remake. Moments of the game feel like they were built to tease how capable the newest PlayStation is, with Yuffie zipping down poles through vertiginous levels, wall-running and mixing up long-range and short-range attacks in a completely different way to Cloud, Aerith and the rest. It suffers a little from trying to tie in <em>FF7</em> lore from old spin-off titles, but it’s a satisfying distraction as we wait for the second part – <em>Final Fantasy VII Rebirth</em> – to arrive in 2023.</p><h2>Demon's Souls</h2><p></p><p>Bluepoint’s <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9EZW1vbnMtU291bHMtUGxheVN0YXRpb24tNS9kcC9CMDhGQzVUVEJGP3RhZz1nZGd0MGMtcC1vLWR4LTIwIiwiY29udGVudFV1aWQiOiI0NTJkNjcyOS1mMTM2LTQ3NWMtOWJjNS01OGY4ZTBlYmNjNjQifQ&amp;signature=AQAAAUF0PsZEHi2Zg-LFgwFicrQJiToXGJ6Ch6zVDmU354H3&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FDemons-Souls-PlayStation-5%2Fdp%2FB08FC5TTBF\"><em>Demon’s Souls</em></a> remake won’t be for everyone — no Souls game is. The original <em>Demon’s Souls</em> was a sleeper hit in 2009 on the PS3, establishing the basic formula that would later be cemented with <em>Dark Souls</em>, and then aped by an entire industry to the point where we now essentially have a “Soulslike'' genre. Today, that means challenging difficulty, grinding enemies for souls to level up, the retrieval of your corpse to collect said souls, a labyrinthine map to explore and, if you’re doing Soulslike right, some show-stopping boss fights to contend with. As a progenitor to the genre, <em>Demon’s Souls</em> has most of those in abundance. But rather than a huge sprawling map, it uses a portal system, with mini labyrinths to work through. Its bosses are also not quite on the level of impressiveness or difficulty of a more modern Dark Souls game.</p><p>Bluepoint has been faithful to the original, then, but graphically <em>Demon’s Souls </em>is a true showcase of what the PS5 can do, with gorgeous high-resolution visuals, smooth frame rates and swift loading. While the graphics certainly catch your eye, it’s the smoothness and loading times that are the most impactful. The original ran at 720p, and… depending on what you were doing 25 to 30 fps, while the remake lets you pick between a locked 30 or 60 fps at 4K or 1440p. And in a game that will likely kill you hundreds of times, waiting two seconds to respawn instead of thirty is transformative.</p><h2>God of War</h2><p></p><p>Sony's God of War series had laid dormant for half a decade when its latest incarnation hit stores in early 2018, and for good reason. Antiquated gameplay and troubling themes had made it an ill-fit for the modern gaming landscape. No more. SIE Santa Monica Studio's <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=ffe106af-8248-4af3-9098-a2d4fd637766&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=GameStop&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiJmZmUxMDZhZi04MjQ4LTRhZjMtOTA5OC1hMmQ0ZmQ2Mzc3NjYiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuZ2FtZXN0b3AuY29tL3ZpZGVvLWdhbWVzL3Byb2R1Y3RzL2dvZC1vZi13YXItLS1wbGF5c3RhdGlvbi00LzEyNzUwNy5odG1sIiwiY29udGVudFV1aWQiOiI0NTJkNjcyOS1mMTM2LTQ3NWMtOWJjNS01OGY4ZTBlYmNjNjQifQ&amp;signature=AQAAASwD9StCBfDFThDbPQpbMxKSp5N6gyzIEbGG3uzxHnzI&amp;gcReferrer=https%3A%2F%2Fwww.gamestop.com%2Fvideo-games%2Fproducts%2Fgod-of-war---playstation-4%2F127507.html\"><em>God of War</em></a> manages to successfully reboot the series while turning the previous games' narrative weaknesses into its strengths. Kratos is now a dad, the camera is now essentially strapped to his shoulder and Sony has what is sure to become a new series on its hands.</p><p>The first outright PS4 game on this collection, <em>God of War</em> has at least been patched for better performance on PS5, allowing it to output at 4K/60. For those subscribed to PS Plus, this one’s available for free as part of the <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy5wbGF5c3RhdGlvbi5jb20vZW4tdXMvcHMtcGx1cy8iLCJjb250ZW50VXVpZCI6IjQ1MmQ2NzI5LWYxMzYtNDc1Yy05YmM1LTU4ZjhlMGViY2M2NCJ9&amp;signature=AQAAAYGp-SQg1xwma8AZY5BajQ6fC0TUQg01gDQoGJYjkmRo&amp;gcReferrer=https%3A%2F%2Fwww.playstation.com%2Fen-us%2Fps-plus%2F\">PlayStation Plus Collection</a> on PS5.</p><h2>Ghost of Tsushima: The Director's Cut</h2><p></p><p>This tale of samurai vengeance is like Japanese cinema come to life. There are multiple betrayals, the sad deaths of several close allies, tense sword fights, villages and castles under siege, and even a ‘Kurosawa mode’ black-and-white filter you employ for the entire game. The world of feudal Japan, with some creative liberties, is gorgeous, with fields of grass and bullrushes to race through on your faithful steed, temple ‘puzzles’ to navigate around and fortresses to assess and attack.</p><p>As you make your way through the main story quest, and more than enough side quests and challenges, you unlock more powerful sword techniques and stances, as well as new weapons and forbidden techniques that are neatly woven in the story of a samurai pushed to the edge. It still suffers from one too many fetch quests, artifacts scattered across Japan’s prefectures, but the sheer beauty of <em>Ghost of Tsushima</em> tricks you into believing this is the greatest open-world game on PlayStation. Don’t get me wrong — it’s up there.</p><p>With the new <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9HaG9zdC1Uc3VzaGltYS1EaXJlY3RvcnMtQ3V0LVBTNS9kcC9CMDk4VFY1WFBYP3RhZz1nZGd0MGMtcC1vLWR4LTIwIiwiY29udGVudFV1aWQiOiI0NTJkNjcyOS1mMTM2LTQ3NWMtOWJjNS01OGY4ZTBlYmNjNjQifQ&amp;signature=AQAAARgfrm2sRkVOyaOOpEDs4J94q79CF_7IfAGfd7-N9qo1&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FGhost-Tsushima-Directors-Cut-PS5%2Fdp%2FB098TV5XPX%3F\"><em>Director’s Cut</em></a> edition on the PS5, you also get dynamic frame-rates up to 60 FPS, ensuring the game looks and feels even more like a tribute to Japanese cinematic auteurs of the past. There are also DualSense tricks, like a bow that tangibly tightens as you pull on trigger buttons, and subtle rumble as you ride across the lands of Tsushima, <em>Director’s Cut </em>adds a new, surprisingly compelling DLC chapter. As you explore the Iki isle, the game adds a few more tricks to Jin’s arsenal, and deepens the relationship and history between the game’s hero and his father.</p><p>Without spoiling what happens, the game smartly threads the original story into the DLC, ensuring it feels solidly connected to the main game, despite DLC status.</p><h2>Deathloop</h2><p></p><p><a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=ffe106af-8248-4af3-9098-a2d4fd637766&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=GameStop&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiJmZmUxMDZhZi04MjQ4LTRhZjMtOTA5OC1hMmQ0ZmQ2Mzc3NjYiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuZ2FtZXN0b3AuY29tL3ZpZGVvLWdhbWVzL3Byb2R1Y3RzL2RlYXRobG9vcC0tLXBsYXlzdGF0aW9uLTUvMjMyODUwLmh0bWw_IiwiY29udGVudFV1aWQiOiI0NTJkNjcyOS1mMTM2LTQ3NWMtOWJjNS01OGY4ZTBlYmNjNjQifQ&amp;signature=AQAAAWAEepFdrgDmk9qK3G2VKJY-JF2vj9AMhIWZwXeKGDX5&amp;gcReferrer=https%3A%2F%2Fwww.gamestop.com%2Fvideo-games%2Fproducts%2Fdeathloop---playstation-5%2F232850.html%3F\"><em>Deathloop</em></a>, from the studio that brought you the Dishonored series, is easy enough to explain: You’re trapped in a day that repeats itself. If you die, then you go back to the morning, to repeat the day again. If you last until the end of the day, you still repeat it again. Colt must “break the loop” by efficiently murdering seven main characters, who are inconveniently are never in the same place at the same time. It’s also stylish, accessible and fun.</p><p>While you try to figure out your escape from this time anomaly, you’ll also be hunted down by Julianna, another island resident who, like you, is able to remember everything that happens in each loop. She’ll also lock you out of escaping an area, and generally interfere with your plans to escape the time loop. (The online multiplayer is also addictive, flipping the roles around. You play as Julianna, hunting down Colt and foiling his plans for murder. )</p><p>As you play through the areas again (and again) you’ll equip yourself with slabs that add supernatural powers, as well as more potent weapons and trinkets to embed into both guns and yourself. It’s through this that you’re able to customize your playstyle or equip yourself in the best way to survive Julianna and nail that assassination. Each time period and area rewards repeat exploration, with secret guns, hidden conversations with NPCs and lots of world-building lore to discover for yourself.</p><h2>Marvel’s Spider-Man Ultimate Edition</h2><p></p><p>Finally, you don't have to pick up <em>Spider-Man 2</em> on the GameCube to get your web-slinging fix anymore. For almost 15 years, that game was held as the gold standard for a Spider-Man game, and I'll let you into a secret: It wasn't actually that good. <em>Marvel's Spider-Man</em>, on the other hand, is a tour de force. Featuring the best representation of what it's like to swing through New York City, well, ever, Insomniac's PlayStation exclusive also borrows liberally from the Batman: Arkham series' combat and throws in a story that, although it takes a while to get going, ends up in a jaw-dropping place.</p><p>With the launch of the PS5, Insomniac released a <em>Miles Morales</em> spin-off game, which follows the eponymous character as he attempts to protect NYC in Peter Parker’s absence. Both parts are available packaged together as <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=ffe106af-8248-4af3-9098-a2d4fd637766&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=GameStop&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiJmZmUxMDZhZi04MjQ4LTRhZjMtOTA5OC1hMmQ0ZmQ2Mzc3NjYiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuZ2FtZXN0b3AuY29tL3ZpZGVvLWdhbWVzL3Byb2R1Y3RzL21hcnZlbHMtc3BpZGVyLW1hbi1taWxlcy1tb3JhbGVzLXVsdGltYXRlLWVkaXRpb24tLS1wbGF5c3RhdGlvbi01LzIyNTM0MS5odG1sPyIsImNvbnRlbnRVdWlkIjoiNDUyZDY3MjktZjEzNi00NzVjLTliYzUtNThmOGUwZWJjYzY0In0&amp;signature=AQAAAZZA74XiVAN7YoRsaRnrFR--B5EvrDn0jHlTByU91NQY&amp;gcReferrer=https%3A%2F%2Fwww.gamestop.com%2Fvideo-games%2Fproducts%2Fmarvels-spider-man-miles-morales-ultimate-edition---playstation-5%2F225341.html%3F\"><em>Spider-Man Ultimate Edition</em></a>— it has a longer name than that but let's not — and benefit from improved framerates, resolution and ray tracing (although not necessarily all at the same time!) With the full graphical package enabled, you’ll be playing at 30 frames per second in 4K, or you can pick between a pair of performance options: 4K/60 with no ray tracing, or 1080p/60 with ray-tracing. Whatever mode you pick, you’ll benefit from loading times that finally make the game’s fast travel system… fast.</p><h2>Resident Evil Village</h2><p></p><p><a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9SZXNpZGVudC1FdmlsLVZpbGxhZ2UtUGxheVN0YXRpb24tNS1TdGFuZGFyZC9kcC9CMDhUWUNXSzNDP3RhZz1nZGd0MGMtcC1vLWR4LTIwIiwiY29udGVudFV1aWQiOiI0NTJkNjcyOS1mMTM2LTQ3NWMtOWJjNS01OGY4ZTBlYmNjNjQifQ&amp;signature=AQAAAQz8NecIvyAf97jSKuf5lrxEomIxgG0K7P9VWXZSN8vw&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FResident-Evil-Village-PlayStation-5-Standard%2Fdp%2FB08TYCWK3C\"><em>Resident Evil Village</em></a> is delightful. It’s a gothic fairy tale masquerading as a survival-horror game, and while this represents a fresh vibe for the franchise, it’s not an unwelcome evolution. The characters and enemies in Village are full of life — even when they’re decidedly undead — and Capcom has put a delicious twist on the idea of vampires, werewolves, sea creatures, giants and creepy dolls. The game retains its horror, puzzle and action roots, and it has Umbrella Corporation’s fingerprints all over it. On PS5, the game is gorgeous and it plays nicely with the DualSense controller, adding haptic feedback to weapons and terrifying situations alike. It simply feels like developers had fun with this one, and so will you.</p><h2>Returnal</h2><p></p><p><a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=ffe106af-8248-4af3-9098-a2d4fd637766&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=GameStop&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiJmZmUxMDZhZi04MjQ4LTRhZjMtOTA5OC1hMmQ0ZmQ2Mzc3NjYiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuZ2FtZXN0b3AuY29tL3ZpZGVvLWdhbWVzL3BsYXlzdGF0aW9uLTUvcHJvZHVjdHMvcmV0dXJuYWwtLS1wbGF5c3RhdGlvbi01LzIzNDQ3MC5odG1sPyIsImNvbnRlbnRVdWlkIjoiNDUyZDY3MjktZjEzNi00NzVjLTliYzUtNThmOGUwZWJjYzY0In0&amp;signature=AQAAAWI7_GcIaDdBnnDldmNe2DdpbqbQGbJSWgylHqHYXAW7&amp;gcReferrer=https%3A%2F%2Fwww.gamestop.com%2Fvideo-games%2Fplaystation-5%2Fproducts%2Freturnal---playstation-5%2F234470.html%3F\"><em>Returnal</em></a><em>&nbsp;</em>is a third-person action game, a roguelite, a bullet-hell shooter and very hard, perhaps not in that order. The setup is basically that you’re stuck in a death loop, but you’re aware of it, and must learn the patterns and weaknesses of enemies — and master your own — in order to progress. <a href=\"https://www.engadget.com/returnal-review-ps5-shooter-133029657.html\">As <em>Devindra Hardwar </em>explains</a>, it leans heavily on the dark sci-fi of <em>Alien</em>,<em> Edge of Tomorrow</em> and <em>Event Horizon</em> but makes something new and unique in the process.</p><p>It’s made by the team behind <em>Resogun</em>,<em> Nex Machina</em> and <em>Super Stardust HD</em>, and you can tell, for better or worse. As you’d expect from a team that’s spent the past decades making shooters, the movement, gunplay and enemy attack patterns are incredibly well tuned. But on the flipside, from a studio used to smaller productions, the complexity and ambition of <em>Returnal</em> leads to a lack of polish that some may find unacceptable in a $70 game. If you can look past that, there’s a hell of a game waiting for you here.</p><h2>Sekiro: Shadows Die Twice</h2><p></p><p><a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9TZWtpcm8tU2hhZG93cy1EaWUtVHdpY2UtUGxheVN0YXRpb24tNC9kcC9CMDdESldCWUpOP3RhZz1nZGd0MGMtcC1vLWR4LTIwIiwiY29udGVudFV1aWQiOiI0NTJkNjcyOS1mMTM2LTQ3NWMtOWJjNS01OGY4ZTBlYmNjNjQifQ&amp;signature=AQAAAc4Vutg-7Mctuq7keOO2Sls8TJLTnhYALM99CdquyMiL&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FSekiro-Shadows-Die-Twice-PlayStation-4%2Fdp%2FB07DJWBYJN\"><em>Sekiro: Shadows Die Twice</em></a> isn't just another Dark Souls game. FromSoftware's samurai adventure is a departure from that well-established formula, replacing slow, weighty combat and gothic despair for stealth, grappling hooks and swift swordplay. Oh, and while it's still a difficult game, it's a lot more accessible than Souls games — you can even pause it! The result of all these changes is something that's still instantly recognizable as a FromSoftware title, but it's its own thing, and it's very good. While the game has yet to receive a proper PS5 upgrade, the extra grunt of Sony’s next-gen console does allow the game to finally run at a locked 60fps — something the PS4 Pro couldn’t handle.</p><p></p>", "persistent": false, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "link": "https://www.engadget.com/google-is-making-its-internal-video-blurring-privacy-tool-open-source-150052840.html?src=rss", "title": "Google is making its internal video-blurring privacy tool open source", "date_published": "2022-12-22 15:00:52+00:00", "description": "<p>Google has announced that two of its latest <a href=\"https://www.whitehouse.gov/ostp/news-updates/2022/06/28/advancing-a-vision-for-privacy-enhancing-technologies/\">privacy-enhancing technologies</a> (PETs), including one that blurs objects in a video, will be provided to anyone for free via open source. The new tools are part of Google's <a href=\"https://blog.google/technology/safety-security/how-we-make-every-day-safer-with-google/\">Protected Computing</a> initiative designed to transform &quot;how, when and where data is processed to technically ensure its privacy and safety,&quot; the company said.</p><p>The first is an internal project called Magritte, <a href=\"https://github.com/google/magritte\">now out on Github</a>, which uses machine learning to detect objects and apply a blur as soon as they appear on screen. It can disguise arbitrary objects like license plates, tattoos and more. &quot;This code is especially useful for video journalists who want to provide increased privacy assurances,&quot; Google wrote in the blog. &quot;By using this open-source code, videographers can save time in blurring objects from a video, while knowing that the underlying ML algorithm can perform detection across a video with high-accuracy.&quot;</p><span id=\"end-legacy-contents\"></span><p>The other with the unwieldy name &quot;Fully Homomorphic Encryption (FHE) Transpiler, allows developers to perform computations on encrypted data without being able to access personally identifiable information. Google says it can help industries like financial services, healthcare and government, &quot;where a robust security guarantee around the processing of sensitive data is of highest importance.&quot;</p><p>Google notes that PETs are starting to enter the mainstream after being mostly an academic exercise. The White House recently <a href=\"https://www.whitehouse.gov/ostp/news-updates/2022/06/28/advancing-a-vision-for-privacy-enhancing-technologies/\">touted the technology</a>, saying &quot;it will allow researchers, physicians, and others permitted access to gain insights from sensitive data without ever having access to the data itself.&quot; Google noted that both the US and UK governments are <a href=\"https://www.nist.gov/news-events/news/2022/11/winners-announced-first-phase-uk-us-privacy-enhancing-technologies-prize\">held a contest this year</a> to develop PET solutions around financial crime and public health emergencies.</p>", "persistent": false, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "link": "https://www.engadget.com/2022-was-a-surprisingly-great-year-for-monitors-144552673.html?src=rss", "title": "2022 was a surprisingly great year for monitors", "date_published": "2022-12-22 14:45:52+00:00", "description": "<p>I don't know if this is a delayed effect of the remote working trend or simply a bunch of technologies all maturing at the same time (or possibly both), but 2022 was an unusually great year for monitors. So before we move onto a new generation of gadgets in 2023, I just wanted to take a little time to recap some of the standout displays that came out in the last 12 months.</p><p>Before we even get to specific models, this year we saw the arrival of two new major players in the gaming monitor space thanks to <a href=\"https://www.engadget.com/sony-inzone-gaming-hardware-hands-on-specs-price-availability-210013674.html\">Sony’s Inzone brand</a> and <a href=\"https://www.engadget.com/hyper-x-armada-25-hands-on-specs-price-release-no-stand-no-problem-101534103.html\">HyperX’s line of Armada displays</a>. For a company like Sony that's responsible for some of the most popular consoles of all time, this move was both a surprise yet also feels a bit late. That's because while Sony has dabbled with gaming displays in the past (remember that weird <a href=\"https://www.engadget.com/2011-06-07-sonys-24-inch-playstation-3d-display-first-hands-on.html\">Playstation 3D TV from 2011</a>), the company has largely refrained from expanding into the wider gaming hardware and accessories market — especially when it comes to PC peripherals.</p><span id=\"end-legacy-contents\"></span><figure><img alt=\"As part of Sony's new Inzone brand, the M9 is part of the company's first big push into PC gaming hardware. \" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/18880100-8170-11ed-baf7-a432f2bb0049\" /><figcaption></figcaption><div class=\"photo-credit\">Sam Rutherford/Engadget</div></figure><p>That said, while Sony's line of  Inzone devices is made up of headphones and monitors that share a similar design with the Playstation 5 and a few exclusives features, it's important to note that the devices come from Sony Electronics (the company that makes TVs and wireless earbuds) and not Sony Interactive Entertainment (aka the Playstation people). That means you won't find any explicit Playstation logos, but what you do get is some of the fancy tech found on Sony's other premium gadgets like its flagship <a href=\"https://www.engadget.com/sony-wh-1000xm5-review-160045478.html\">WH-1000XM5 wireless headphones</a>.</p><p>As for monitors, after testing it out earlier this year, I found the Inzone M9 to be one of the best 4K gaming displays for the money. Now going for just $799 (down from its $899 launch price), you get a 27-inch display with VRR and NVIDIA G-Sync support, DisplayHDR 600 certification and full array local dimming. I also appreciate some of the smaller touches Sony included such as a built-in KVM switch and surprisingly decent onboard stereo speakers, the latter of which makes it really easy to hook up a PC or a PS5 and just start gaming without worrying about audio.</p><figure><img alt=\"Unlike other monitors, HyperX's line of Armada gaming displays has ditched the traditional desktop stand in favor of an included monitor arm for a less cluttered and more adjustable setup. \" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/6b9fabe0-8170-11ed-97ff-b36442ee25c3\" /><figcaption></figcaption><div class=\"photo-credit\">Sam Rutherford/Engadget</div></figure><p>Meanwhile, HyperX (<a href=\"https://www.engadget.com/hp-buys-hyperx-144456046.html\">which is now owned by HP</a>) has also joined the fray this year with its line of <a href=\"https://www.engadget.com/hyper-x-armada-25-hands-on-specs-price-release-no-stand-no-problem-101534103.html\">Armada gaming monitors</a>. Similar to Sony, HyperX's first batch of displays features a small twist on the standard formula because, instead of shipping with a traditional desktop stand, both of its new monitors are only available with a bundled monitor arm. And when combined with a 25-inch panel that offers a 1080p resolution and a 240Hz refresh rate for just $450 or a 2,560 x 1440 display with a 165Hz for $500 on the 27-inch model, what you get are some great mid-range displays, particularly for anyone looking to keep clutter to a minimum.</p><figure><img alt=\"Alienware 34 Curved QD-OLED gaming monitor\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-05/46a65370-cd61-11ec-b927-5462376515d1\" /><figcaption>Alienware's AW3423DW was the first QD OLED monitor on market when it went on sale earlier this spring. </figcaption><div class=\"photo-credit\">Devindra Hardawar/Engadget</div></figure><p>Another important milestone in 2022 was the release of the first batch of QD-OLED monitors, headlined by the <a href=\"https://www.engadget.com/alienware-qd-oled-gaming-monitor-ultrawide-review-140012704.html\">Alienware AW3423DW</a>. The really nice thing about QD-OLED displays is that they combine the super saturated colors and pure blacks you get with traditional OLED panels, but with much better brightness, not to mention less blooming and wider viewing angles (when compared to conventional LCD displays). When you factor in its huge ultra-wide format and 175Hz refresh rate, you get what's arguably the best overall gaming monitor on the market. And while Alienware was the first company to release a QD-OLED monitor, other companies <a href=\"https://twitter.com/msigaming/status/1595650709256810496?s=20&amp;t=hSbu056kBpiS2paTEZWtqA\">like MSI have their own rivals</a> coming soon.</p><figure><img alt=\"With a massive 55-inch 4K display, Samsung's Odyssey Ark is one of the biggest gaming monitors on the market. \" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/91f6ffb0-816f-11ed-91ff-d70eba47d0b7\" /><figcaption>With a massive 55-inch 4K display, Samsung's Odyssey Ark is one of the biggest gaming monitors available today. </figcaption><div class=\"photo-credit\">Sam Rutherford/Engadget</div></figure><p>Alternatively, for people who don't care about costs and just want the biggest and baddest gaming display on the market, <a href=\"https://www.engadget.com/samsung-odyssey-ark-hands-on-specs-price-taking-gaming-monitors-to-a-whole-new-dimension-140056568.html\">Samsung's Odyssey Ark</a> was one of the most memorable gadgets I've used all year. With a massive 55-inch 4K panel and a 1000R curve, the Ark wraps around you like some kind of spaceship cockpit. And if that wasn't enough, you can even rotate it into portrait mode, which delivers one of the most unique gaming setups I've ever experienced. The downside is that while the Ark has four HDMI inputs and a special Multi View mode (which is basically a souped-up picture-in-picture feature), due to a limitation with HDMI, it can only display content from one external source at a time. But if you have$3,500 lying around and want the most jaw-dropping monitor that came out this year, the Odyssey Ark can't be beat.</p><p>I also recently had the chance to check out <a href=\"https://www.engadget.com/lg-27gr95qe-us-pricing-availability-announced-181515149.html\">LG’s latest UltraGear gaming monitors</a> with their new 240HZ displays, which is the highest refresh rate you can get from any OLED monitor on sale today. LG’s new panels mean you can get both the deep blacks and vibrant colors OLED screens are known for <em>and</em> the kind of refresh rates that previously were only available from IPS displays. The downside though is that with a max brightness of just 200 nits, the new UltraGears aren’t ideal for gaming in bright rooms.</p><figure><img alt=\"Not only does LG's latest 45-inch gaming monitor boast a super fast 240Hz display, it also features a very curvy 800R radius that delivers a cocoon-like experience. \" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/4a7afb00-816f-11ed-a94e-8356812dea64\" /><figcaption>Not only does LG's latest 45-inch gaming monitor boast a super fast 240Hz display, it also features a very curvy 800R radius that delivers a cocoon-like experience. </figcaption><div class=\"photo-credit\">Sam Rutherford/Engadget</div></figure><p>But as someone who’s been waiting a long time for OLED panels to become more mainstream, it’s really encouraging to see more products get added to the mix. That’s because while there are a handful of OLED monitors out right now (like the aforementioned Alienware AW3423DW), pickings are still pretty slim. Some like the <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy5sZy5jb20vdXMvdHZzL2xnLW9sZWQ0MmMycHVhIiwiY29udGVudFV1aWQiOiIwYzVmYzYyNi1iZGZjLTRlODctYTgxNi0wYzg5MzgyYjJkZDcifQ&amp;signature=AQAAAaxJQEkTJRYrEHkoezYgDC01fILUyd168adcwOrE37UF&amp;gcReferrer=https%3A%2F%2Fwww.lg.com%2Fus%2Ftvs%2Flg-oled42c2pua\">LG C2</a> are actually just TVs that are also being pushed as large-format desktop displays. Meanwhile, <a href=\"https://rog.asus.com/us/monitors/above-34-inches/rog-swift-oled-pg42uq-model/\">ASUS' ROG Swift OLED line</a> uses the exact same panels LG uses in the C2, but with a few tweaks like a built-in heatsink and a DisplayPort 1.4 jack for improved gaming performance.</p><p>But perhaps the bigger issue is that, essentially, all the OLED monitors available right now are rather large. The smallest C2 and <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9BU1VTLVN3aWZ0LUdhbWluZy1Nb25pdG9yLVBHNDJVUS9kcC9CMEJCU1YxTEs1P3RhZz1nZGd0MGMtcC1vLWR3LTIwIiwiY29udGVudFV1aWQiOiIwYzVmYzYyNi1iZGZjLTRlODctYTgxNi0wYzg5MzgyYjJkZDcifQ&amp;signature=AQAAAe3n_-vW670Bj_zGDbP1bIi8RPRVoKm6qMegrbq1f9Os&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FASUS-Swift-Gaming-Monitor-PG42UQ%2Fdp%2FB0BBSV1LK5\">ROG Swift OLED</a> models measure 42 inches across, while the Alienware AW3423DW isn't much better with its 34-inch ultra-wide panel. But with LG's new UltraGear OLED, we're finally getting something in a more manageable size along with one of the highest refresh rates we've seen on an OLED monitor to date.</p><figure><img alt=\"Featuring an unusual 16:18 aspect ratio, LG's DualUp monitor is designed to provide additional vertical screen space without needing to rotate a display into portrait mode. \" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/d6674070-816e-11ed-93ef-80fd7a2808c7\" /><figcaption>Featuring an unusual 16:18 aspect ratio, LG's DualUp monitor is designed to provide additional vertical screen space without needing to rotate a display into portrait mode. </figcaption><div class=\"photo-credit\">LG</div></figure><p>Meanwhile, for anyone who isn’t a gamer, there were also some interesting new productivity displays that came out this year. That's because while technically it was announced last year, 2022 also saw the release of <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy5sZy5jb20vdXMvbW9uaXRvcnMvbGctMjhtcTc4MC1iIiwiY29udGVudFV1aWQiOiIwYzVmYzYyNi1iZGZjLTRlODctYTgxNi0wYzg5MzgyYjJkZDcifQ&amp;signature=AQAAATUenM_BpY2R8xW_LiCefmvMu0jWidWB_Oxi2HaZRR8y&amp;gcReferrer=https%3A%2F%2Fwww.lg.com%2Fus%2Fmonitors%2Flg-28mq780-b\">LG's DualUp monitor</a> with its funky 16:18 aspect ratio. When combined with its included arm, you’ll enjoy a setup that boasts a ton of vertical screen real estate without needing to stack multiple displays or having to deal with a screen that's too skinny when rotated into portrait mode. And, thanks to a color gamut that covers 98 percent of the DCI-P3 spectrum, the DualUp can handle a lot more than just really tall spreadsheets. LG even included support for power output of up to 90-watts, so you can get video from a laptop and keep it charged all with a single USB-C cable.</p><p>Finally, while it still needs a bit of refinement, Corsair just released its huge 45-inch gaming monitor with a bendable display called the <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy5jb3JzYWlyLmNvbS91cy9lbi94ZW5lb24tZmxleC1iZW5kYWJsZS11bHRyYS13aWRlLWdhbWluZy1kaXNwbGF5IiwiY29udGVudFV1aWQiOiIwYzVmYzYyNi1iZGZjLTRlODctYTgxNi0wYzg5MzgyYjJkZDcifQ&amp;signature=AQAAAYiW9qzn36os4ZUj745WwwCk-guIQS9j_OfbKoJu1TyG&amp;gcReferrer=https%3A%2F%2Fwww.corsair.com%2Fus%2Fen%2Fxeneon-flex-bendable-ultra-wide-gaming-display\">Xeneon Flex</a>. Now I know that the ability to manually transform a monitor from flat to curved might seems kind of silly (and it probably is, especially when gadgets like the <a href=\"https://www.engadget.com/lg-oled-flex-flat-panel-curved-display-121941054.html\">LG OLED Flex exists</a> and features built-in motors), but it's nice to see more companies experiment with bendy screen tech. And who knows, maybe they can add a feature where the monitor goes into gaming mode when you bend it allowing your battle station to shift gears depending on the kind of work (or play) you're doing.</p><div id=\"36c174ba14fa479cbfe13e0b02ad3cab\"></div><p>Regardless, with more people working remotely than ever, it's nice to have more choices when it comes to kitting out your setup. And I haven't even talked about some of the other innovations from adjacent categories like TVs, laptops and phones such as the <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=358591a8-2981-451c-a839-e645b5522820&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Razer+Online+Store&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiIzNTg1OTFhOC0yOTgxLTQ1MWMtYTgzOS1lNjQ1YjU1MjI4MjAiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cucmF6ZXIuY29tL2dhbWluZy1sYXB0b3BzL1JhemVyLUJsYWRlLTE1L1JaMDktMDQyMU5FRzMtUjNVMSIsImNvbnRlbnRVdWlkIjoiMGM1ZmM2MjYtYmRmYy00ZTg3LWE4MTYtMGM4OTM4MmIyZGQ3In0&amp;signature=AQAAAZ5KEIU7qMIw8mIU_dHB5K5mZ9sUWKisfmvVEvUXlxMR&amp;gcReferrer=https%3A%2F%2Fwww.razer.com%2Fgaming-laptops%2FRazer-Blade-15%2FRZ09-0421NEG3-R3U1\">240Hz OLED display option</a> on the <a href=\"https://www.engadget.com/razer-blade-15-2022-review-a-real-treat-if-youve-got-the-cash-160032467.html\">Razer Blade 15</a>, new <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy55b3V0dWJlLmNvbS93YXRjaD92PXoyT1ViS2ZOTkM0IiwiY29udGVudFV1aWQiOiIwYzVmYzYyNi1iZGZjLTRlODctYTgxNi0wYzg5MzgyYjJkZDcifQ&amp;signature=AQAAAT9q_-VblxsQMobWDcbAiD6Rc2ITU0pfUaCYTkQDy__7&amp;gcReferrer=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Dz2OUbKfNNC4\">LED.EX TVs from Panasonic</a> or the improved under-display-camera on the Galaxy Z Fold 4. (I recently used the UDC on my Z Fold 4 to dial into a video meeting, and not a single person complained about its image quality). Still, 2022 has been a great year for monitors and as we get closer to CES 2023, I'm expecting to see that momentum continue into next year.</p>", "persistent": false, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "link": "https://www.engadget.com/how-to-delete-all-your-facebook-and-meta-owned-accounts-141517953.html?src=rss", "title": "How to permanently delete all your Facebook and Meta-owned accounts", "date_published": "2022-12-22 14:15:17+00:00", "description": "<p>It’s never exactly easy to pull the plug on a social media account you’ve had for years. For many of us, our accounts are filled with years of photos, memories and memes that aren’t easy to part with ,even if we are ready to stop the daily scrolling habit. For Facebook, Instagram and other Meta-run services, deleting an account entirely isn’t necessarily straightforward, either.</p><p>And even though all the services are run by the same company, there isn’t one centralized way to delete all your Meta-associated accounts. The good news is that removing these accounts is in many cases a lot easier than it has been in the past, even if there are sometimes a few extra steps involved. Keep reading to find out exactly how to delete your Facebook, Instagram, Messenger, WhatsApp and Oculus accounts.</p><span id=\"end-legacy-contents\"></span><h2>First, download your data</h2><p>Regardless of your reasons for wanting to leave your accounts behind, it’s worth it to take the time to download all your data before you delete them for good. Downloading your data will ensure you have a record of your prior posts, messages, photos and other activity.</p><p>These data archives look a little different for each service, but in general they contain your previous posts, a record of what accounts you follow, your messages and even some of your past activity on the services. Some, like Facebook, will even provide a record of what the site’s advertisers know about you.</p><p>In other words: it’s a lot of data. And it may not seem like a lot of that is worth hanging onto, but if you’ve used an account for years it’s a good way to preserve a record of your past photos, videos and other posts. (Though you should also be prepared for it to surface some data you might not want to remember, like conversations with former partners or cringey college photos.)</p><p>On <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=2d66651e-658e-4baa-bc4e-ded0c126e805&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Portal+from+Facebook&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiIyZDY2NjUxZS02NThlLTRiYWEtYmM0ZS1kZWQwYzEyNmU4MDUiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuZmFjZWJvb2suY29tL3ByaXZhY3kvZ3VpZGUvZHlpLyIsImNvbnRlbnRVdWlkIjoiOWExMTI2MjgtYmI3OC00MmM5LTgzNjktMzkzZDViNDAzMGZjIn0&amp;signature=AQAAAU9PNJ2ysLkSk9VQsalZaF1AhEdNvPan-ARQ9qOxxdRq&amp;gcReferrer=https%3A%2F%2Fwww.facebook.com%2Fprivacy%2Fguide%2Fdyi%2F\">Facebook</a>, you can access your archive from: Settings &amp; Privacy -&gt; Settings -&gt; Your Facebook Information -&gt; download your information -&gt; request download.</p><p>On <a href=\"https://help.instagram.com/181231772500920\">Instagram</a>, it’s More -&gt; Settings -&gt; Privacy and Security -&gt; Data download -&gt; Request download.</p><p>On <a href=\"https://faq.whatsapp.com/526463418847093/?cms_platform=iphone\">WhatsApp</a>, it’s Settings -&gt; Account -&gt; Request account info. (Of note, WhatsApp’s reports don’t include the content of your actual messages. If you want to preserve a copy of your messages, you’ll need <a href=\"https://faq.whatsapp.com/1180414079177245/?cms_platform=android\">to export</a> your chat history on each message thread you wish to hang onto.</p><p>On<a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=2d66651e-658e-4baa-bc4e-ded0c126e805&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Portal+from+Facebook&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiIyZDY2NjUxZS02NThlLTRiYWEtYmM0ZS1kZWQwYzEyNmU4MDUiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuZmFjZWJvb2suY29tL2hlbHAvbWVzc2VuZ2VyLWFwcC83MTM2MzUzOTYyODg3NDEiLCJjb250ZW50VXVpZCI6IjlhMTEyNjI4LWJiNzgtNDJjOS04MzY5LTM5M2Q1YjQwMzBmYyJ9&amp;signature=AQAAAbDlQzc3faBv3Pj3sMqh_gjd9Lc0_WlnyRQwI_PbSSxD&amp;gcReferrer=https%3A%2F%2Fwww.facebook.com%2Fhelp%2Fmessenger-app%2F713635396288741\"> Messenger</a>, downloads have to be initiated through the mobile app. On both Android and iOS, go to  Account Settings (located in the “chats” tab) -&gt; Your Facebook Information -&gt; Download your information. You’ll then be able to specify a few aspects of the data, like the media quality, data format and date range you want the download to cover.</p><p>For <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy5tZXRhLmNvbS9oZWxwL3F1ZXN0L2FydGljbGVzL2FjY291bnRzL3ByaXZhY3ktaW5mb3JtYXRpb24tYW5kLXNldHRpbmdzLyIsImNvbnRlbnRVdWlkIjoiOWExMTI2MjgtYmI3OC00MmM5LTgzNjktMzkzZDViNDAzMGZjIn0&amp;signature=AQAAAQmWuGj3kL2Zp3NJPTUxSOkOir8i3dMz9cviB0cAFB10&amp;gcReferrer=https%3A%2F%2Fwww.meta.com%2Fhelp%2Fquest%2Farticles%2Faccounts%2Fprivacy-information-and-settings%2F\">Oculus</a> and Meta Quest users, you can use the “download your information” tool linked <a href=\"https://auth.meta.com/?redirect_uri=https%3A%2F%2Fauth.meta.com%2Fsettings%2Fdyi%2F\">here</a>.</p><p>Once you have your data archives stashed away, you’ll be ready to permanently nuke your accounts. Though, like the data downloads, it can take up to several days for the process to be complete.</p><h2>How to delete Facebook</h2><figure><img alt=\"Facebook app logo is seen in this illustration taken, August 22, 2022. REUTERS/Dado Ruvic/Illustration\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-08/c62c13a0-23ba-11ed-bfff-2267abb0c9b2\" /><figcaption></figcaption><div class=\"photo-credit\">Dado Ruvic / reuters</div></figure><p>Before you permanently delete Facebook, a word of caution: nuking your account will also nuke third-party accounts where you’ve also used Facebook to log-in. In some cases, you might be able to recover them via the app’s support channels, but there’s no guarantee. Follow the steps <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=2d66651e-658e-4baa-bc4e-ded0c126e805&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Portal+from+Facebook&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiIyZDY2NjUxZS02NThlLTRiYWEtYmM0ZS1kZWQwYzEyNmU4MDUiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuZmFjZWJvb2suY29tL2hlbHAvMTAwNzU0NTEzNDEyODAyIiwiY29udGVudFV1aWQiOiI5YTExMjYyOC1iYjc4LTQyYzktODM2OS0zOTNkNWI0MDMwZmMifQ&amp;signature=AQAAAZehitZmb_AoKZRkX6LYLqIdF9KuM3waQHJtNP2lVM0T&amp;gcReferrer=https%3A%2F%2Fwww.facebook.com%2Fhelp%2F100754513412802\">here</a> to review which apps and websites you use Facebook as a log in.</p><p>Likewise, if your Oculus account is linked to your Facebook identity, then deleting your Facebook will also permanently delete your Oculus account, including your past purchases. (Of note, Meta now allows VR users to create a separate <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=6f7ae225-b81d-43cd-a3c7-b24c85091f6f&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Oculus&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2ZjdhZTIyNS1iODFkLTQzY2QtYTNjNy1iMjRjODUwOTFmNmYiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cub2N1bHVzLmNvbS9ibG9nL21ldGEtYWNjb3VudHMvIiwiY29udGVudFV1aWQiOiI5YTExMjYyOC1iYjc4LTQyYzktODM2OS0zOTNkNWI0MDMwZmMifQ&amp;signature=AQAAAeLPXz1ymLr-faZZAu0FupLSEMjLHeyzmjtb2PdXQTiz&amp;gcReferrer=https%3A%2F%2Fwww.oculus.com%2Fblog%2Fmeta-accounts%2F\">“Meta account”</a> that doesn’t rely on Facebook.)</p><p>Once you’re sure you’re ready to delete, you can find the option from Settings &amp; Privacy -&gt; Settings -&gt; Your Facebook Information -&gt; Deactivation and Deletion -&gt; Delete Account -&gt; Continue to account deletion -&gt; Delete Account</p><p>However, even after you’ve smashed the final “delete” button, Facebook <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=2d66651e-658e-4baa-bc4e-ded0c126e805&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Portal+from+Facebook&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiIyZDY2NjUxZS02NThlLTRiYWEtYmM0ZS1kZWQwYzEyNmU4MDUiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuZmFjZWJvb2suY29tL2hlbHAvMjI0NTYyODk3NTU1Njc0Lz9oZWxwcmVmPXBvcHVsYXJfYXJ0aWNsZXMiLCJjb250ZW50VXVpZCI6IjlhMTEyNjI4LWJiNzgtNDJjOS04MzY5LTM5M2Q1YjQwMzBmYyJ9&amp;signature=AQAAAdljtlHKCOwxX84rIJdLRzOqwYvi4GHS8nFqg4NI-4fA&amp;gcReferrer=https%3A%2F%2Fwww.facebook.com%2Fhelp%2F224562897555674%2F%3Fhelpref%3Dpopular_articles\">notes</a> that it still takes around 30 days for your information to be purged entirely. That also means that if you do happen to change your mind within 30 days, you can cancel the request. According to the company, it can take up to 90 days for the deletion process to complete, though your profile and other info won’t be visible to others on Facebook during that time.</p><h2>How to delete Instagram</h2><figure><img alt=\"Bangkok, Thailand - July 27, 2019 : Instagram user liking his own photo on Instagram.\" src=\"https://s.yimg.com/os/creatr-images/2019-11/4ea3da70-fece-11e9-bb89-0b1abeb48570\" /><figcaption></figcaption><div class=\"photo-credit\">Wachiwit via Getty Images</div></figure><p>For <a href=\"https://help.instagram.com/370452623149242\">Instagram</a>, you need to go to the “delete your account” page, which can be found <a href=\"https://www.instagram.com/accounts/remove/request/permanent/\">here</a>. From there, you’ll have to select a reason from the drop-down menu, and enter your password.</p><p>As with Facebook, Instagram notes that it can take “up to 90 days from the beginning of the deletion process to delete all the things you've posted,” though posts won’t be visible to others on the platform during that time.</p><h2>How to delete Facebook Messenger</h2><p>If you delete a Facebook account, your Messenger account will also be permanently deleted so you don’t need to go through extra steps if you’ve already purged your Facebook presence. But it’s also worth noting that simply deactivating your Facebook <em>won’t</em> affect your ability to use Messenger or other users’ ability to find you on the app.</p><p>If, however, you happen to use Messenger <em>without</em> an associated Facebook account, you can delete your account <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=2d66651e-658e-4baa-bc4e-ded0c126e805&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Portal+from+Facebook&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiIyZDY2NjUxZS02NThlLTRiYWEtYmM0ZS1kZWQwYzEyNmU4MDUiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuZmFjZWJvb2suY29tL2hlbHAvbWVzc2VuZ2VyLWFwcC80NTg5MDgyNjE5NTIzODQiLCJjb250ZW50VXVpZCI6IjlhMTEyNjI4LWJiNzgtNDJjOS04MzY5LTM5M2Q1YjQwMzBmYyJ9&amp;signature=AQAAAbdNF7LPfbWGDqZ9nuvEeKsRlPlnb-hutnqx_VHzm9uX&amp;gcReferrer=https%3A%2F%2Fwww.facebook.com%2Fhelp%2Fmessenger-app%2F458908261952384\">via the app</a>. On Both iOS and Android: Account Settings -&gt; Delete Your Account and Information and enter your password.</p><h2>How to delete WhatsApp</h2><p>WhatsApp accounts can be <a href=\"https://faq.whatsapp.com/262301441608212/?cms_platform=iphone&amp;locale=en_US\">deleted</a> directly from the app via Settings -&gt; Account -&gt; Delete My Account. The app will then prompt you to enter your phone number. As with facebook and Instagram, the company says the full deletion process can take up to 90 days.</p><h2>How to delete an Oculus or Meta account</h2><figure><img alt=\"The Meta Quest Pro headset and Quest Touch Pro controllers.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-10/93684f66-56f0-11ed-b7f5-1df3c123e21b\" /><figcaption></figcaption><div class=\"photo-credit\">Sam Rutherford/Engadget</div></figure><p>As noted above, if you used Facebook to login to your Oculus account, then deleting Facebook will take care of it. If, however, your Oculus login was separate, you need to log in to your account on Oculus’ website from a browser, then navigate to My Profile -&gt; Privacy Center -&gt; Delete Your Oculus Account.</p><p>Of note, this process will only work until January 1, 2023, when Meta will force all Oculus accounts to migrate to the new Meta accounts mentioned above. For those newer Meta accounts, you can <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy5tZXRhLmNvbS9oZWxwL2FjY291bnRzL2RlbGV0ZS1tZXRhLWFjY291bnQvIiwiY29udGVudFV1aWQiOiI5YTExMjYyOC1iYjc4LTQyYzktODM2OS0zOTNkNWI0MDMwZmMifQ&amp;signature=AQAAAax7RkNvTtiVsPv8OLUCwyD9knoHpuROwxs4YHEHQNw2&amp;gcReferrer=https%3A%2F%2Fwww.meta.com%2Fhelp%2Faccounts%2Fdelete-meta-account%2F\">delete</a> your presence by heading to <a href=\"https://auth.meta.com/settings\">auth.meta.com/settings</a>, logging in, selecting “delete your account,” entering your password again and choosing “delete your data.”</p><p>Again, keep in mind this will prevent you from using your VR headset, and will remove any past purchases you’ve made.</p>", "persistent": false, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "link": "https://www.engadget.com/best-shows-to-binge-watch-over-the-holidays-in-2022-141502077.html?src=rss", "title": "The best shows to binge watch over the holidays in 2022", "date_published": "2022-12-22 14:15:02+00:00", "description": "<p>This year was a bit of a reset for the entertainment industry, with more people returning to theaters and more must-watch TV shows hitting streaming networks. That's a fairly major change from 2021, when many movies hit services like HBO Max on the same day as theaters. But if you've gotten used to catching up on everything on your couch, don't worry — there's still <em>plenty</em> to watch over the holidays. (And be sure to <a href=\"https://www.engadget.com/what-to-watch-over-the-2021-holidays-150002581.html\">check out our recommendations from last year</a>, which are still good, I swear!)</p><h2><a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy5oYm9tYXguY29tLyIsImNvbnRlbnRVdWlkIjoiNDcxNGYxYmEtMDA2MS00YTljLTk2NjYtMTBkOWU3MGFjZTIxIn0&amp;signature=AQAAASfGuqU2mpdv8SWZMgcprrkWkvquVsIS-3gvWY0cPSUK&amp;gcReferrer=https%3A%2F%2Fwww.hbomax.com%2F\">HBO Max</a></h2><div id=\"41199c1fe84441ad824c863f2a6061bd\"></div><h3>Station Eleven</h3><p>Perhaps the best piece of media I've seen this year, <em>Station Eleven</em> is an adaptation of Emily St. John's novel about a society-collapsing swine flu epidemic. Wait, don't run away! While the series may evoke the worst of our COVID experience at first, it also transforms into a hopeful tale about the power of stories (and pop culture!) and human connection. It delivers something we could all use right now: Hope.</p><span id=\"end-legacy-contents\"></span><h3>Tuca and Bertie Season 3</h3><p>After being unceremoniously canceled by Netflix in 2020, the cartoon duo of Tuca and Bertie found a new home on Cartoon Network last year. The third and (unfortunately) final season of the series aired this year, and it remains a delight. Created by Lisa Hanawalt and executive produced by Raphael Bob-Waksberg (<em>BoJack Horseman)</em>, it follows a pair of friends as they deal with life, love and simply existing in their '30s.</p><h3>Also on HBO Max:</h3><p><em>The White Lotus</em> (Season 2): Mike White's series on the exploits of privileged resort guests, this time in Sicily instead of Hawaii, remains a delight.</p><p><em>Harley Quinn </em>(Season 3): This show remains one of the best DC series currently airing. Tune in for a comedic and more adult spin on your Batman faves.</p><h2><a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=85d85ef3-fac9-418f-9573-418cf162cd0c&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Disney%2B&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI4NWQ4NWVmMy1mYWM5LTQxOGYtOTU3My00MThjZjE2MmNkMGMiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuZGlzbmV5cGx1cy5jb20vIiwiY29udGVudFV1aWQiOiI0NzE0ZjFiYS0wMDYxLTRhOWMtOTY2Ni0xMGQ5ZTcwYWNlMjEifQ&amp;signature=AQAAAXg7o2rY-cVERNSEwWrWTBHmeLQO32h-LwEASerbZPHc&amp;gcReferrer=https%3A%2F%2Fwww.disneyplus.com%2F\">Disney+</a></h2><div id=\"592df43aa4db4ce7879096e7edf89b57\"></div><h3>Andor</h3><p>Yes, it's another Star Wars show, but <em>Andor</em> ended up being one of the biggest surprises of the year. Created by Tony Gilroy (who helped transform <em>Rogue One</em> into a stellar film), it centers on Cassian Andor (Diego Luna), a small-time thief with a healthy distrust for the Empire. The show follows his journey towards becoming a member of the rebels, and in doing so it also serves as a blueprint for taking down authoritarian systems.</p><h3>Fire of Love</h3><p>Katia and Maurice Krafft were a rare couple, two expert volcanologists who were also madly in love. They dedicated their lives to documenting active volcanoes, often by directly confronting lava flows, rock explosions and acid lakes. <em>Fire of Love</em> unearths their original footage to show just how far they went in the name of science. But it also paints a portrait of a truly rare couple, one whose contributions we still owe much to.</p><h3>Also on Disney+:</h3><p><em>Tales of the Jedi: </em>A short animated series that gives us a bit more backstory on Ahsoka Tano and... Count Dooku? If you've been interested in the <em>Star Wars</em> cartoons, but don't want to slog through tons of old episodes, this is a good start.</p><p><em>Bluey</em>: This remains the best kids show on TV. Bluey's latest season is as funny and poignant as ever. It's the rare show that can teach both kids and their parents.</p><h2><a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=2a170a1e-7e5c-4edd-b5dd-ea6d3bd9416a&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Netflix&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiIyYTE3MGExZS03ZTVjLTRlZGQtYjVkZC1lYTZkM2JkOTQxNmEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cubmV0ZmxpeC5jb20vIiwiY29udGVudFV1aWQiOiI0NzE0ZjFiYS0wMDYxLTRhOWMtOTY2Ni0xMGQ5ZTcwYWNlMjEifQ&amp;signature=AQAAATHTPiSDJgzceg1G1qVZrkWKGHgcruPccvyvkUqGl_Qc&amp;gcReferrer=https%3A%2F%2Fwww.netflix.com%2F\">Netflix</a></h2><div id=\"1858a076f01845aa8d1a838f1b0a2ba6\"></div><h3>Cyberpunk: Edgeunners</h3><p><em>Cyberpunk 2077 </em>had a notoriously rocky game launch, but the setting of Night CIty was always compelling. <em>Edgerunners </em>is an anime spin on that universe, centering on a plucky street kid who finds himself equipped with a military-grade spine implant. You know, typical teenage stuff. Will his newfound power keep him on the wrong side of the law? And will he ever get revenge against the people who ruined his life? The show doesn't do much new, but it features genuinely compelling characters and some of the best animation in recent years.</p><h3>The Midnight Club</h3><p>Mike Flanagan can do no wrong. The talent behind <em>Midnight Mass</em>, <em>Doctor Sleep</em>, and the excellent “<em>Haunting of…” </em>horror shows on Netflix has now set his sights on a Christopher Pike adaptation, and the results are glorious. The show, co-created by Leah Fong, follows a group of terminally ill teenagers as they tell spooky stories and explore the supernatural mysteries of their hospice mansion. It's a meditation on the power of storytelling, but also yet another Flanagan exploration of the value of life.</p><h3>Also on Netflix:</h3><p><em>Wednesday: </em>Come to see Tim Burton finally get his shot at The Addams Family, stay for Jenna Ortega's perfectly deadpan performance.</p><h2><a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=ca19dea0-e7ad-4f54-beed-6302bce56589&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Hulu&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiJjYTE5ZGVhMC1lN2FkLTRmNTQtYmVlZC02MzAyYmNlNTY1ODkiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuaHVsdS5jb20vd2VsY29tZSIsImNvbnRlbnRVdWlkIjoiNDcxNGYxYmEtMDA2MS00YTljLTk2NjYtMTBkOWU3MGFjZTIxIn0&amp;signature=AQAAAei3HyeokB_2Jabwq9oExnpfXKFtXc5G6ix4_bmA4aWv&amp;gcReferrer=https%3A%2F%2Fwww.hulu.com%2Fwelcome\">Hulu</a></h2><div id=\"402dc862acc34aceb71460419bccff71\"></div><h3>The Bear</h3><p>Can an award-winning chef truly come back home and save his family's beleaguered sandwich shop? Or is he just trying to work through the death of his brother the only way he knows? <em>The Bear</em> captures the energy and madness of kitchen life better than any TV show — forget all the glossy stuff you've seen on <em>Chef's Table</em>. But amid the insanity, it's the story of a found family banding together to mourn and save the place they all love.</p><h3>The Dropout</h3><p>What makes Elizabeth Holmes tick? This series, which stars Amanda Seyfried as the notorious Theranos founder, paints a more complete picture of Holmes than the <a href=\"https://www.engadget.com/2019-03-09-the-inventor-hbo-theranos.html\">2019 HBO documentary <em>The Inventor</em></a>. We see Holmes' early life, as well as her initial connection with Sunny Balwani (Naveen Andrews, perhaps the best TV adaptation glow-up any South Asian man can hope for). After proving her smarts in college, she sets off to build the world's best blood testing machine with Theranos. We all know how that went. When the hype around Theranos starts to fall apart, <em>The Dropout</em> turns into a fascinating portrait of self-deception.</p><h3>Also on Hulu:</h3><p><em>Fleishman is in Trouble</em>: Toby Fleishman is going through a divorce. But as he starts to rebuild his own identity, he also needs to deal with the wreckage of his marriage (and find his missing ex-wife).</p><h2><a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=4130e2f0-a14f-4c5e-bdab-cd52ac7d8e79&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Apple&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI0MTMwZTJmMC1hMTRmLTRjNWUtYmRhYi1jZDUyYWM3ZDhlNzkiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYXBwbGUuY29tL2FwcGxlLXR2LXBsdXMvP2l0c2NnPTEwMDAwJml0c2N0PWF0di0wLWFwbF9ocC1wbW9fbHJuLWFwbC1hdmwtMjEwOTE2IiwiY29udGVudFV1aWQiOiI0NzE0ZjFiYS0wMDYxLTRhOWMtOTY2Ni0xMGQ5ZTcwYWNlMjEifQ&amp;signature=AQAAAXSc_phjF4NAYPsbO8CQpNLg3O3XZS2X5rv7Nt6JKeOL&amp;gcReferrer=https%3A%2F%2Fwww.apple.com%2Fapple-tv-plus%2F%3Fitscg%3D10000%26itsct%3Datv-0-apl_hp-pmo_lrn-apl-avl-210916\">Apple TV+</a></h2><div id=\"038576c088a04ae59b9dd5ab4e6fec59\"></div><h3>Severance</h3><p>Taking the idea of work/life balance a step too far, <em>Severance</em> follows a group of people who’ve received a procedure that completely splits their memories between home and office life. The result is two completely separate personalities within the same body, both trapped in their respective cages. <em>Severance</em> is a bit of a slow burn, but it’s a fascinating exploration of corporate control akin to Terry Gilliam’s <em>Brazil. </em>(Be sure to check out our interview with the creator of the show, Dan Erickson, <a href=\"https://www.engadget.com/engadget-podcast-apple-studio-display-ipad-air-123022577.html\">on the Engadget Podcast</a>.)</p><h3>Pachinko</h3><p>An adaptation of Min Jin Lee’s 2017 novel, <em>Pachinko</em> follows a Korean family across several generations starting in 1917 and reaching into the late ‘80s. We see a young fish seller fall in love and make her way to Japan as an outsider, while her grandson struggles to maintain his identity in the pressure-filled business world. <em>Pachinko</em> has almost everything you’d want in a family epic: Children struggling to live up to their parents’ standards, forbidden love and the constant threat of generational trauma. Also, it has one of the best opening sequences of the year.</p><h2>Other things to watch</h2><div id=\"4d4ac25b07b44641a193654976b0cd73\"></div><p><em>The Good Fight</em> (<a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=b0d3a482-802c-4eb1-9616-94f7490562f7&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Paramount+Plus&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiJiMGQzYTQ4Mi04MDJjLTRlYjEtOTYxNi05NGY3NDkwNTYyZjciLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cucGFyYW1vdW50cGx1cy5jb20vPyIsImNvbnRlbnRVdWlkIjoiNDcxNGYxYmEtMDA2MS00YTljLTk2NjYtMTBkOWU3MGFjZTIxIn0&amp;signature=AQAAAeTqgWLfbBliVgqLCVrnL72vPl8JdtDOIOmPMTCEQMWi&amp;gcReferrer=https%3A%2F%2Fwww.paramountplus.com%2F%3F\">Paramount+</a>): Over its six-season span, <em>The Good Fight </em>tackled the insanity of our current social and political environment better than any other TV show. It’s first and foremost a legal procedural, but coming from the minds of Michelle and Robert King, it ends up being so much more.</p><p><em>Gangs of London</em> (<a href=\"https://www.amcplus.com/\">AMC+</a>): Now on its second season, <em>Gangs of London</em> is one of the most brutal crime shows on TV. It’s part gangster epic, part martial arts smackdown (it comes from Gareth Evans, director of <em>The Raid </em>films). While the plot becomes increasingly ludicrous, it’s worth a watch just for the sheer ambition of its action sequences, many of which go far harder than anything we’ve seen in American films lately.</p>", "persistent": false, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "link": "https://www.engadget.com/the-morning-after-avatar-sequel-crashed-some-movie-projectors-in-japan-121539854.html?src=rss", "title": "The Morning After: 'Avatar' sequel crashed some movie projectors in Japan", "date_published": "2022-12-22 12:15:39+00:00", "description": "<p>In Japan, the big premiere week of James Cameron’s Avatar sequel was hit with <a href=\"https://www.engadget.com/avatar-sequels-cutting-edge-tech-crashed-some-movie-projectors-in-japan-094828843.html\">technical problems in some movie theaters</a>. One venue in central Japan was forced to reduce the 48 fps frame rate down to the traditional 24 fps – one of the major technical innovations of <em>Avatar: The Way of Water</em>. The Avatar sequel is actually available in multiple formats, including 2D 48 fps, 3D 48 fps and regular 24 fps. If you see the 48 fps version, it only uses the HFR tech for action sequences, while dialog and slower scenes are dialed down to 24 fps by duplicating frames. Intrigued by high frame rates? Check out Devindra Hardawar’s (spoiler-free) review of <em>Avatar: The Way of Water</em>, right <a href=\"https://www.engadget.com/avatar-the-way-of-water-review-hfr-high-frame-rate-170058030.html\">here</a>.</p><p>Despite being the widest movie release of all time in Japan, <em>Avatar: The Way of Water</em> failed to claim the top ranking last weekend, beaten by the anime basketball movie calle<em>d The First Slam Dunk</em>.</p><p>– Mat Smith</p><p><em>The Morning After isn’t just a</em><a href=\"https://www.engadget.com/about/newsletter/\"><em> newsletter</em></a><em> –  it’s also a daily podcast. Get our daily audio briefings, Monday through Friday, by</em><a href=\"https://www.engadget.com/2019-08-01-engadget-podcasts.html\"><em> subscribing right here</em></a><em>.</em></p><p></p><h3>The biggest stories you might have missed</h3><ul><li><p><a href=\"https://www.engadget.com/tesla-report-layoffs-hiring-freeze-160001808.html\">Tesla reportedly plans more layoffs as the company’s stock tanks</a></p></li><li><p><a href=\"https://www.engadget.com/best-co-op-games-for-pc-nintendo-switch-ps-4-and-more-141542259.html\">The best co-op games for PC, Nintendo Switch, PS5 and more</a></p></li><li><p><a href=\"https://www.engadget.com/nike-training-club-netflix-workout-videos-215051444.html\">Nike brings workout videos to Netflix on December 30th </a></p></li><li><p><a href=\"https://www.engadget.com/nasa-officially-retires-its-in-sight-mars-lander-190245298.html\">NASA officially retires its InSight Mars lander</a></p></li><li><p><a href=\"https://www.engadget.com/year-in-review-2022-reality-bites-150000912.html\">How the tech titans crashed head-first into reality</a></p></li></ul><h2><a href=\"https://www.engadget.com/lg-ultra-gear-gaming-monitors-hands-on-setting-a-new-bar-for-oled-refresh-rates-153046589.html\">Hands-on with LG's 240Hz UltraGear gaming monitors</a></h2><h3>Setting a new bar for OLED refresh rates.</h3><a href=\"https://www.engadget.com/lg-ultra-gear-gaming-monitors-hands-on-setting-a-new-bar-for-oled-refresh-rates-153046589.html\"><figure><img alt=\"TMA\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/427cdb90-81eb-11ed-bf6b-662b686524f5\" /><figcaption></figcaption><div class=\"photo-credit\">Engadget</div></figure></a><p>Earlier this year, Alienware released what’s arguably the best all-around gaming monitor on the market right now: the AW3423DW. But last week, LG quietly announced its latest batch of UltraGear gaming monitors. LG’s monitors are available in two sizes intended for slightly different use cases. There’s the 27-inch option with a flat panel, meant for both general use and more demanding competitive play, while the 45-inch monitor has a curved display with an 800R radius, designed to deliver a more immersive experience. Regardless of which one you pick, both feature 240Hz refresh rates – the highest you can get from any OLED monitor available today.</p><p><a href=\"https://www.engadget.com/lg-ultra-gear-gaming-monitors-hands-on-setting-a-new-bar-for-oled-refresh-rates-153046589.html\"><strong>Continue reading.</strong></a></p><p></p><h2><a href=\"https://www.engadget.com/ukraine-strikes-deal-with-space-x-to-receive-over-10000-more-starlink-antennas-143245809.html\">Ukraine strikes deal with SpaceX for thousands more Starlink antennas</a></h2><h3>Several EU countries will reportedly share the costs.</h3><h3></h3><p>Ukraine will receive an additional 10,000-plus Starlink satellite dishes from Elon Musk's SpaceX to help provide internet amid Russian attacks on communications infrastructure. Financial issues around the terminals have reportedly been resolved, with several European countries stepping up to share the costs, according to Ukraine's deputy prime minister Mykhailo Federov.  The 10,000 new terminals add to the 22,000 already received and will be used to &quot;stabilize connections for critical situations,&quot; according to Federov. &quot;There is no alternative to satellite connections,&quot; he added.</p><p><a href=\"https://www.engadget.com/ukraine-strikes-deal-with-space-x-to-receive-over-10000-more-starlink-antennas-143245809.html\"><strong>Continue reading.</strong></a></p><p></p><h2><a href=\"https://www.engadget.com/best-free-games-163045609.html\">The best free games for 2023</a></h2><h3>Some great games don't cost a thing.</h3><a href=\"https://www.engadget.com/best-free-games-163045609.html\"><figure><img alt=\"TMA\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/42291640-81eb-11ed-ab5f-0311fc461fb8\" /><figcaption></figcaption><div class=\"photo-credit\">Blizzard</div></figure></a><p>Free games used to mean ropey puzzle games and knock-off clones of games that had a price tag. But now, courtesy of in-app payments and the ease of offering both a sample of a title alongside its full-fat version, there are plenty of great games to play without spending a dime. Following the continued success of titles like <em>Fortnite</em>, the level of quality across mobile, PC and consoles has never been higher. Put your card away, and consider this your starting point. Oh and while it’s not in the current edition of our guide, <a href=\"https://www.engadget.com/vampire-survivors-ios-android-mobile-free-005055880.html\">check out <em>Vampire Survivors</em> too</a> — my latest addiction, and free-to-play on smartphones.</p><p><a href=\"https://www.engadget.com/best-free-games-163045609.html\"><strong>Continue reading.</strong></a></p><p></p><span id=\"end-legacy-contents\"></span><h2><a href=\"https://www.engadget.com/canada-zero-emissions-vehicle-sales-mandate-ev-181557036.html\">Canada plans to enforce an ambitious zero-emission vehicle sales quota by 2026</a></h2><h3>At least 20 percent of new vehicles sold will need to be zero-emission models.</h3><h3></h3><p>The Canadian government has announced enforceable quotas for zero-emission vehicle sales. By 2026, a fifth of all new passenger cars, trucks and SUVs sold in the country will need to be zero-emission models, such as electric or hydrogen fuel cell vehicles. &quot;We're moving forward with a regulated sales target that requires at least 20 percent of new vehicles sold by 2026 to be zero emission, increasing that to 60 percent by 2030 and 100 percent by 2035,&quot; Julie Dabrusin, parliamentary secretary to the Minister of Environment and Climate Change. There's still some way to go. In the first six months of 2022, EVs (including plug-in hybrid models) made up 7.2 percent of new car registrations.</p><p><a href=\"https://www.engadget.com/canada-zero-emissions-vehicle-sales-mandate-ev-181557036.html\"><strong>Continue reading.</strong></a></p><p></p>", "persistent": false, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "link": "https://www.engadget.com/robocall-company-may-receive-the-largest-fine-ever-from-the-fcc-110759522.html?src=rss", "title": "Robocall company may receive the largest FCC fine ever", "date_published": "2022-12-22 11:07:59+00:00", "description": "<p>The FCC has proposed a $299,997,000 fine against \"the largest robocall firm\" it has ever investigated, the regulator <a href=\"https://www.fcc.gov/document/fcc-proposes-largest-fine-ever-against-auto-warranty-scam-robocaller\">announced</a>. It would be the FCC's largest fine ever, and targets a firm that made over 5 billion calls in three months, enough \"to have called each person in the United States 15 times,\" it wrote.&nbsp;</p><p>The operation is run by Roy Cox, Jr. and Michael Aaron Jones via their Sumco Panama company, along with  other domestic and foreign entities. In July of this year, the FCC issued its first ever \"K4 Notice\" and \"N2 Order\" directing all US telephone providers to stop carrying traffic related to the car warranty scam calls. \"This resulted in a massive, 99 percent drop in the volume of such calls since June, according to [spam blocking app] <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy5yb2Jva2lsbGVyLmNvbS9ibG9nLzIwMjItY2FyLXdhcnJhbnR5LWNhbGwtdHJlbmRzIiwiY29udGVudFV1aWQiOiI0NzlhMGU0OC1kMzhlLTRiM2QtOTdiMi0xYmE2MzU0MWJmOWMifQ&amp;signature=AQAAASfFfQE5130bAKGw6WObLI7ovLEod5iI61An7ND4iDUp&amp;gcReferrer=https%3A%2F%2Fwww.robokiller.com%2Fblog%2F2022-car-warranty-call-trends\">RoboKiller</a>,\" the FCC wrote.&nbsp;</p><span id=\"end-legacy-contents\"></span><p>The FCC proposed its largest-ever fine because it found the robocallers met the criteria for \"egregious violations.\" Consumers described the calls as \"incessant\" and \"harassment,\" and the robocallers used dirty practices like calling health care workers from spoofed hospital numbers. The firm also violated multiple FCC rules, like failing to identify the caller at the start of a message.&nbsp;</p><p>In the calls, a message would open with something like \"we've been trying to reach you concerning your car's extended warranty,\" and prompt you to speak to a scam \"warranty specialist.\" Robokiller <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy5yb2Jva2lsbGVyLmNvbS9ibG9nLzIwMjItY2FyLXdhcnJhbnR5LWNhbGwtdHJlbmRzIiwiY29udGVudFV1aWQiOiI0NzlhMGU0OC1kMzhlLTRiM2QtOTdiMi0xYmE2MzU0MWJmOWMifQ&amp;signature=AQAAASfFfQE5130bAKGw6WObLI7ovLEod5iI61An7ND4iDUp&amp;gcReferrer=https%3A%2F%2Fwww.robokiller.com%2Fblog%2F2022-car-warranty-call-trends\">advises</a> users to avoid the calls in the first place if possible, not follow prompts, and above all, never provide personal information like banking details.</p>", "persistent": false, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "link": "https://www.engadget.com/two-top-fbx-executives-plead-guilty-to-fraud-and-are-cooperating-with-prosecutors-101009292.html?src=rss", "title": "Two top executives plead guilty to fraud in FTX case", "date_published": "2022-12-22 10:10:09+00:00", "description": "<p>Top FTX executives close to Sam Bankman-Fried, Caroline Ellison and Zixiao &quot;Gary&quot; Wang, have <a href=\"https://www.sec.gov/news/press-release/2022-234\">pleaded guilty to fraud</a> and are cooperating with prosecutors. The pair were convicted &quot;in connection with their roles in the fraud that contributed to FTX's collapse,&quot; said Damian Williams, the US Attorney for the Southern District of New York in a <a href=\"https://twitter.com/SDNYnews/status/1605745361842327552\">press conference</a>.</p><p>Ellison, the former CEO of FTX sister company Alameda Research and ex-girlfriend of Bankman-Fried, pleaded guilty to seven counts and faces up to 110 years in prison. Former FTX co-founder Wang pleaded guilty to four counts and faces 50 years. Depending on the level of cooperation, however, they could receive lighter sentences. The pair also face civil fraud charges filed by the Securities and Exchange Commission (SEC) and Commodity Future Trading Commission (CFTC). Both were released on $250,000 bonds.</p><span id=\"end-legacy-contents\"></span><div id=\"809407e0d5f74f6c81012ff5c5fda84f\"><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Statement of U.S. Attorney Damian Williams on U.S. v. Samuel Bankman-Fried, Caroline Ellison, and Gary Wang <a href=\"https://t.co/u1y4cs3Koz\">pic.twitter.com/u1y4cs3Koz</a></p>— US Attorney SDNY (@SDNYnews) <a href=\"https://twitter.com/SDNYnews/status/1605745361842327552?ref_src=twsrc%5Etfw\">December 22, 2022</a></blockquote></div><p>The announcement was made as Bankman-Fried was being <a href=\"https://www.engadget.com/ftx-founder-sam-bankman-fried-agrees-to-extradition-to-the-us-003250204.html\">extradited</a> from the Bahamas to New York, and add to his mounting legal woes. Wang's lawyer Ilan Graff said that his client has &quot;accepted responsibility for his actions and takes seriously his obligations as a cooperating witness,&quot; according to <a href=\"https://www.washingtonpost.com/business/2022/12/21/caroline-ellison-fraud-charges/\"><em>The Washington Post</em></a>.&nbsp;</p><p>Despite their cooperation, the SEC didn't mince words in laying out its case against Ellison and Wang. &quot;Mr. Bankman-Fried, Ms. Ellison, and Mr. Wang were active participants in a scheme to conceal material information from FTX investors,&quot; said SEC deputy director of enforcement, Sanjay Wadhwa. &quot;By surreptitiously siphoning FTX’s customer funds onto the books of Alameda, defendants hid the very real risks that FTX’s investors and customers faced.&quot;</p><p>Bankman-Fried, meanwhile, is accused of a long list of misdeeds by multiple agencies, including the SEC, Department of Justice and CFTC. Those include defrauding FTX investors and customers of more than $1.9 billion, multiple counts of wire fraud, conspiracy to defraud investors by sharing misleading information and &quot;surreptitiously&quot; siphoning customer funds. The CFTC also alleges that Bankman-Fried and his cohorts &quot;took hundreds of millions of dollars in poorly-documented 'loans' from Alameda,&quot; which they then used to purchase real estate and make political donations.</p>", "persistent": false, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "link": "https://www.engadget.com/meta-quest-2-is-getting-faster-thanks-to-an-update-090206374.html?src=rss", "title": "The Meta Quest 2's latest update overclocks its GPU to improve performance", "date_published": "2022-12-22 09:02:43+00:00", "description": "<p>The two-year-old <a href=\"https://www.engadget.com/oculus-quest-2-review-vr-facebook-headset-173026291.html\">Meta Quest 2</a> is now faster due to a surprise performance boost in the <a href=\"https://developer.oculus.com/blog/boost-app-performance-525-mhz-gpu-frequency-meta-quest-2/\">headset's latest update</a>. Meta boosted the maximum frequency from 490 MHz to 525 MHz, giving all Quest 2 headsets up to 7 percent more performance.&nbsp;</p><p>&quot;No integration or coding is needed to start reaping the benefits of this improvement — the dynamic clocking system will automatically increase the frequency as it detects that your app would benefit from it,&quot; Meta wrote. To get the extra speed, all you'll need to do is either a doff/don (take it off and put it back on) or sleep cycle by clicking the power button twice.</p><span id=\"end-legacy-contents\"></span><p>What's more, if you have dynamic foveation enabled in your app, the GPU will boost from 490 MHz to 525 MHz to maintain higher visual quality rather than increasing foveation (foveation lowers image detail depending on what you're looking at). The result should be better overall image quality.&nbsp;</p><p>Quest 2 owners will benefit from the extra speed with no app changes, but developers could also update apps, using the extra power to boost resolution. In any case, it makes the headset more useful in the final year of its lifespan, with the Quest 3 <a href=\"https://www.engadget.com/meta-quest-3-2023-233025187.html\">set to launch next year</a>.&nbsp;</p>", "persistent": false, "language": "en-US"}], "source": {"url": "https://www.engadget.com/rss.xml", "title": "Engadget"}}