[{"source": "https://www.theguardian.com/rss", "title": "How having a debit card and banking app taught a 12-year-old financial literacy", "description": "<p>Rebecca Hill and James Hasler are keen for their daughter to develop an understanding of how to manage her money, so they signed her up for a child-friendly debit card and app – and have been impressed by the results</p><p>After Rebecca Hill’s family lost their home when she was a teenager, she vowed that she would never find herself in the same situation. It was a salutary lesson, perhaps a life-forming one. “I’ve always been very mindful about how I manage my money based on what I want to achieve,” she says, “and when James [her husband] and I decided we wanted to start a family, we talked a lot about how we were going to manage the money aspect of it.”</p><p>Hill later went into the world of finance and, now a consultant for her own firm, Wise Sherpa, she is determined that her daughter, Maddie, learns about the value of money and the importance of saving from a young age. “Money isn’t the most important thing in life, but how you manage money does matter,” she says.</p><p>Rebecca Hill and husband James Hasler are focused on teaching Maddie financial literacy by allowing her to control her own money</p> <a href=\"https://www.theguardian.com/financial-literacy-for-all-the-family/2022/dec/22/how-having-a-debit-card-and-banking-app-taught-a-12-year-old-financial-literacy\">Continue reading...</a>", "link": "https://www.theguardian.com/financial-literacy-for-all-the-family/2022/dec/22/how-having-a-debit-card-and-banking-app-taught-a-12-year-old-financial-literacy", "date_published": "2022-12-22 11:55:09+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Building motivation: top tips on", "description": "<p>When it comes to reaching your fitness goals, the fun factor is key</p><p>While Jane Fonda launched a million workouts from the US and Jackie Chan went on to spark a worldwide craze for martial arts from Hong Kong, Britain’s most famous fitness guru is Derrick Errol Evans, AKA 90s legend Mr Motivator – who seemed to understand that our entire problem with exercise was motivating ourselves to bother. Some 30 years on, the situation hasn’t changed: according to Public Health England, about <a href=\"https://www.gov.uk/government/publications/health-matters-physical-activity/health-matters-physical-activity-prevention-and-management-of-long-term-conditions\" rel=\"nofollow\">34% of men and 42% of women were not active enough for good health</a>. So why do we still struggle to get moving?</p><p>“Fundamentally, we’re motivated to do something when it feels as if the costs of doing it are outweighed by the benefits of getting it done,” says Caroline Webb, author of How to Have a Good Day, who uses psychology, neuroscience and behavioural economics to glean insights on how to improve our daily wellbeing. “It’s normal to find it hard to get motivated to do things where the benefits are mostly long term rather than immediate, because it’s easier for our brain to process concrete rather than abstract things.”</p> <a href=\"https://www.theguardian.com/motivation-with-peloton/2022/dec/22/work-out-the-perfect-workout-top-tips-to-get-your-exercise-goals-on-track\">Continue reading...</a>", "link": "https://www.theguardian.com/motivation-with-peloton/2022/dec/22/work-out-the-perfect-workout-top-tips-to-get-your-exercise-goals-on-track", "date_published": "2022-12-22 10:35:12+00:00", "persistent": false, "user": null, "language": "en-UK"}]