[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCjr2bPAyPV7t35MvcgT3W8Q", "title": "Threat Modeling, Hacking Tails and Peer-to-Peer Decentralization | The Hated One w/ Closed Ntwrk", "description": "Closed Ntwrk and The Hated One meet again for another podcast episode! We discus Cwtch, Briar, threat models, and Tails.\nSupport independent research and analysis by joining my Patreon page: https://www.patreon.com/thehatedone \n\nTimestamps:\n00:00:00 The Hated One remembers to be a human\n00:01:50 The comments and feedback from the previous episode\n00:03:20 Correcting our mistake - spelling out Cwtch.im\n00:04:32 Cwtch vs Briar\n00:09:00 Configuring Brair to run with full-device Orbot\n00:11:30 The limitation of peer-to-peer networks without an internet connection\n00:16:40 Different ways of incentivizing decentralized networks\n00:29:00 User experience has to be easy - Closed Ntwrk's issues with Briar\n00:30:15 The Hated One dies mid podcast\n00:36:10 Tradeoffs of centralized and decentralized platforms\n00:38:15 Threat models\n00:39:24 Closed Ntwrk's biggest mistake of his entire life (he will burn in hell for this)\n00:50:57 Threat models are fluid\n00:55:05 The benefits of VPS self-hosting\n01:22:00 The benefits of diverse opinion and threat models\n01:29:00 More bloomerism and  hopium\n01:35:30 The different approaches to teaching privacy by THO and Closed Ntwrk\n01:45:00 Small open source developers are fighting the big tech \n01:54:30 What's the first and the most important step to start your privacy journey\n02:07:50 Assume your security will be breached\n02:13:50 How the FBI hired Facebook to hack a Tails user\n\nFollow me:\nhttps://twitter.com/The_HatedOne_\nhttps://www.reddit.com/r/thehatedone/\n\nThe footage and images featured in the video were for critical analysis, commentary and parody, which are protected under the Fair Use laws of the United States Copyright act of 1976.", "link": "https://www.youtube.com/watch?v=qCn9ik_nndI", "date_published": "2022-04-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]