[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "23 Minutes of MLB The Show 22 Gameplay", "description": "Watch as the Oakland Athletics take on the San Francisco Giants in the Battle of the Bay in MLB The Show 22 on Xbox Series X. \n\nGet a glimpse of over 20 minutes of gameplay in an epic struggle between both teams at the Oracle Park in San Francisco. Find out who wins in this showdown. MLB The Show 22 will be playable for those who purchased the Deluxe Edition or MVP Edition on April 1st otherwise the full release will be coming on April 5th.\n\nMLB The Show 22 is being released for the PlayStation 4, Playstation 5, Xbox One, Xbox Series X and S, as well as the Nintendo Switch for the first time in the franchise. You can bring your cross saves on the go and play MLB The Show 22 wherever you go. \n\nThis year Shohei Otani makes his way as the MLB The Show 22 cover star with his versatile ability for pitching and hitting.\n\n#MLBTheShow22", "link": "https://www.youtube.com/watch?v=boH0m36Gof4", "date_published": "2022-04-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "More PlayStation Acquisitions Coming | GameSpot News", "description": "PlayStation president says more acquisitions are coming, 2 of April’s Xbox Games with Gold are available now, and Halo Infinite will get content inspired by the TV show.  \n\nSony Interactive Entertainment president Jim Ryan has promised that the company will continue to acquire more studios in the future following a big buying spree in 2021. Sony acquired five studios in 2021, and in 2022 so far, it announced deals to buy Destiny 2 developer Bungie and Jade Raymond's Haven Studios.\n\nNew free Games With Gold games available now for Xbox Live Gold and Game Pass Ultimate subscribers. Right now, subscribers can claim Another Sight and Outpost Kaloki X. In the back half of April, subscribers can grab the off-road racing game MX vs. ATV Alive.\n\n343 Industries community director Brian Jarrard confirmed Halo Infinite will one day feature content inspired by the Paramount+ TV show. He did not provide any hints at when the content might arrive.\n\nSTAMPS\n00:00 - Intro\n00:05 - PlayStation\n01:20 - Xbox\n02:12 - Halo Infinite", "link": "https://www.youtube.com/watch?v=vqEfN3ugTpQ", "date_published": "2022-04-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Persona 4 Arena Ultimax Livestream | Congrats, It's Friday", "description": "It's time to kick back, relax, and throw some god hands at each other.\r\n\r\nOur favorite fighting game about high schoolers who jump into TVs is back on the PS4 and PC. A sequel to the beloved Atlus JRPGs, Persona 4 and Persona 3, Arena Ultimax (known in Japan as Persona 4: The Ultimax Ultra Suplex Hold) is a wonderful fighting game and certainly not one to be missed.\r\n\r\nGameSpot's Persona Boys; Evan Langer, Ben Janca, and Jean-Luc Seipke, are here to hang out and have a good time with you! Challenge us in the ring or just vibe on this chill Friday.", "link": "https://www.youtube.com/watch?v=74xYAGM6Ohk", "date_published": "2022-04-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Weird West Review", "description": "Weird West slings a few effective yarns, but fumbles when it comes to dealing in lead.\n\nWolfEye Studios and Devolver Digital's Weird West is now available on PC, PS4, and Xbox One. You can read the full written Weird West review by Justin Clark on GameSpot: https://www.gamespot.com/reviews/weird-west-review-occult-of-personality/1900-6417853/", "link": "https://www.youtube.com/watch?v=s14aAMeAG70", "date_published": "2022-04-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "E3 2022 Officially Canceled | GameSpot News", "description": "E3 is officially canceled, Xbox Game Pass could be getting a family plan and Battlefield 2042 is getting major map changes. \n\nA spokesperson for the ESA told VentureBeat that E3 will return in 2023 with a \"reinvigorated showcase that celebrates new and exciting video games and industry innovations.\" While E3 2022 may not be going ahead, Geoff Keighley's annual Summer Game Fest is coming back this year, though there are no details yet regarding the specifics of the show.\n\nAccording to a report from Windows Central, Microsoft has wanted to create a Family Plan.\nThis plan will reportedly use Microsoft's Family Account system already in place for Office 365, and up to five players within the same country can share a subscription.\n\nIn a new blog post, Battlefield community lead Adam Freeman outlined all the feedback DICE has gathered from the game's community and the changes it will be making as a result, with most of those initially revolving around Battlefield 2042's Renewal and Kaleidoscope maps. All of those concerns are being addressed and will be coming in the near future.\n\nSTAMPS\n00:00 - Intro\n00:06 - E3\n01:41 - Xbox Game Pass\n02:50 - Battlefield 2042", "link": "https://www.youtube.com/watch?v=7COOpWTjS-g", "date_published": "2022-03-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New PS Plus Feels Boring Compared to Xbox Game Pass", "description": "GameSpot's console crew Lucy, Tamoor, and Jordan, break down why Sony's new PlayStation Plus tiers aren't setting the gaming world on fire.\n\nLearn more about what the crew think of this new subscription service from Sony.\n\n#PlayStationPlus #GamePass\n\nAfter months of speculation, PlayStation has finally announced changes to its PlayStation Plus scheme. PS+ will now offer three tiers: PlayStation Plus Essential, which is akin to the current PS Plus subscription, PS Plus Extra, which offers a library of 400 PS4 and PS5 games to download and play, and the most expensive tier, PS Plus Premium, which offers an additional 350 games from the PlayStation, PS2, PS3, and PSP libraries. \n\nComparisons are already being made to Xbox Game Pass, Microsoft's subscription service that offers a rotating catalogue of over 100 games, and day one releases of major Xbox titles. So we gathered GameSpot's trusty Console Crew: Tamoor Hussain, Jordan Ramée, and Lucy James to discuss the pros and cons of PlayStation's new tiers, and the gang are... not exactly impressed. \n\nFor more on changes to PlayStation Plus, as well as updates as to the games leaving and joining Xbox Game Pass, make sure to keep your eyes on GameSpot.", "link": "https://www.youtube.com/watch?v=36GViN7DMZQ", "date_published": "2022-03-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Warhammer 40,000: Darktide - Release Date Trailer", "description": "Warhammer 40,000: Darktide will release September 13, 2022, on PC and Xbox series X|S. \n\nFight together with your friends against hordes of enemies in this new Warhammer 40,000 experience. From the developers of the best-selling and award-winning co-op action franchise Vermintide, Warhammer 40,000: Darktide is a visceral 4-player co-op action game set in the hive city of Tertium.", "link": "https://www.youtube.com/watch?v=0Q_cbBr_t0M", "date_published": "2022-03-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]