[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Los Rivera Destino: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space. \n\nFelix Contreras | March 31, 2022\n“Mi padre dice asustado / Que me salga de su lado / ‘Ellos son marijuanos,’” (“My father warned me / That I shouldn’t hang out with you all / ‘They are a bunch of potheads,’”) Los Rivera Destino sings in the song “Mis Amigos.” “Pero son mis hermanos / Y los quiero asi! (“That may be, but I love those potheads anyway!”)\n\nThe tongue in cheek ode to pasto (marijuana) set to the classic Latin genre bolero perfectly exemplifies how the Puerto Rican group Los Rivera Destino not only delivers impeccable musicianship and a reverential embrace of nostalgia, but also lots of humor.\n\nAll of that is on full display in its Tiny Desk (home) concert recorded in its hometown of San Juan, Puerto Rico. College friends Carlos Figueroa, Fernando Tarrazo and Antonio Sánchez started out making satirical YouTube videos about Puerto Rican politics. But as music became part of their schtick, they broke out as recording artists with a slowed-down bolero version of the reggaeton classic “Te Boté.” Next thing they knew, megastar Bad Bunny wanted to record with them.\n\nThe group’s musical trajectory now finds the three friends seated behind their “desk” for a performance that is equal parts serious and three-ring circus. Los Rivera Destino’s clever wordplay dominates the first song, “Edgar Allan Poe,” before it launches into a bolero and bossa nova-tinged live version of “Castigo.” Originally recorded with the group’s compay (close friend) Pedro Capó, it’s performed here with a four-piece band that displays the kind of musical versatility that seems commonplace in Puerto Rico. \n\n“Mis Amigos” is a deliriously funny ode to smoking weed. If you don’t speak Spanish, pay close attention to the translated lyrics, which do a great job interpreting both the meaning and the humor of these incredibly talented comedy writers. The last song, “Pancakes,” a loving tribute to the doughy breakfast food, wraps up this visual and lyrical treat of a performance by a group that has carved out a singular place in Latin music. \n\nSET LIST\n“Edgar Allan Poe”\n“Castigo”\n“Mis Amigos”\n“Pancakes”\n\nMUSICIANS\nFernando Tarrazo: bongos, guitar, vocals\nAntonio Sánchez: egg shaker, vocals\nCarlos Figueroa: vocals\nHiram Molina: Puerto Rican cuatro, bass, keys, vocals\nDiego López: keys, sampler, vocals\nDavid Díaz: bass, guitar, vocals\nBennett Service: drums\nJomar Figueroa: whistle, vocals\n\nCREDITS\nProducer: Guri Bellaflores\nDirector: César Berríos\n\nTINY DESK TEAM\nProducer: Felix Contreras, Anamaria Sayre\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Joshua Bryant, Maia Stern, Ashley Pointer\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#eltiny #nprmusic #losriveradestino", "link": "https://www.youtube.com/watch?v=tarsyQZCMUs", "date_published": "2022-03-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]