[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Romanian perspectives", "description": "A discussion with Daniela on the pandemic in Romania and other interesting sociocultural factors.", "link": "https://www.youtube.com/watch?v=dkWBn8cCmJI", "date_published": "2022-02-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Discussions with pulmonologist working in India", "description": "Doctor Maheshwari is a senior pulmonologist who has been working on the frontline with covid patients all through the pandemic. These are a snap shot of his experiences.", "link": "https://www.youtube.com/watch?v=JU2CFrUt8vA", "date_published": "2022-02-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Were lockdowns ineffective?", "description": "Putting belief to the test,    LITERATURE REVIEW AND META-ANALYSIS OF THE EFFECTS OF LOCKDOWNS ON COVID-19 MORTALITY, January 2022, Studies in Applied Economics.\n\nBio plausibility is not always correct when applied\n\nEarly epidemiological studies predicted large effects of NPIs. \n\nImperial College London, Ferguson et al. (2020) predicted that suppression strategy based on a lockdown would reduce COVID-19 mortality by up to 98%. \n\nFerguson, Neil M, Daniel Laydon, Gemma Nedjati-Gilani, Natsuko Imai, Kylie Ainslie, Marc Baguelin, Sangeeta Bhatia, et al. 2020. “Impact of Non-Pharmaceutical Interventions (NPIs) to Reduce COVID- 19 Mortality and Healthcare Demand,” March, 20. \n\nhttps://sites.krieger.jhu.edu/iae/files/2022/01/A-Literature-Review-and-Meta-Analysis-of-the-Effects-of-Lockdowns-on-COVID-19-Mortality.pdf\n\nSystematic review and meta-analysis\n\nTo determine whether there is empirical evidence to support the belief that “lockdowns” reduce COVID-19 mortality. \n\nLockdowns\n\nThe imposition of at least one compulsory, non-pharmaceutical intervention (NPI). \n\nNPIs \n\nGovernment mandates\n\nLimit internal movement, close schools and businesses, ban international travel. \n\nThis study\n\nSystematic search and screening procedure\n\n18,590 studies identified\n\nAfter three levels of screening, \n\n34 studies ultimately qualified. \n\nOf those 34 eligible studies, \n\n24 qualified for inclusion in the meta-analysis. \n\nThree groups of study\n\nLockdown stringency index studies\n\nShelter-in-place- order (SIPO) studies\n\nSpecific NPI studies\n\nOxford COVID-19 Government Response Tracker (OxCGRT) \n\nThe nine metrics used to calculate the Stringency Index are: school closures; workplace closures; cancellation of public events; restrictions on public gatherings; closures of public transport; stay-at-home requirements; public information campaigns; restrictions on internal movements; and international travel controls.\n\nA higher score indicates a stricter response (i.e. 100 = strictest response). \n\n186 countries covered\n\nCountries with more than one million citizens are included, 153 countries in tota. \n\nAn analysis of each of these three groups support the conclusion that lockdowns have had little to no effect on COVID-19 mortality. \n\nStringency index studies\n\nFind that lockdowns in Europe and the United States only reduced COVID-19 mortality by 0.2% on average. \n\nShelter-in-place- order (SIPO) studies\n\nSIPOs were also ineffective, \n\nonly reducing COVID-19 mortality by 2.9% on average. \n\nSpecific NPI studies\n\nalso find no broad-based evidence of noticeable effects on COVID-19 mortality. \n\nConclusion\n\nWhile this meta-analysis concludes that lockdowns have had little to no public health effects, \n\nthey have imposed enormous economic and social costs where they have been adopted. \n\nIn consequence, lockdown policies are ill-founded and should be rejected as a pandemic policy instrument. \n\nCritique\n\nWe exclude papers which analyze the effect of early lockdowns in contrast to later lockdowns. \n\nRetrospective study\n\nPick your own end points\n\nVast array of differing countries and circumstances\n\nE.g. compliance in US, Germany, Italy, China\n\nInferences from past to the future\n\nPandemic fatigue\n\nHerby (2021) illustrates, voluntary behavior changes are essential to a society’s response to an pandemic,\naccount for up to 90% of societies’ total response to the pandemic \n\nWritten by economists, principle, damage that lockdowns did to the economy\n\nWere papers chosen to support the theme?\n\nMost of the papers used were by economists, not scientists or medical people\n\nOutcomes were solely deaths, did not include 'cases, hospitalizations or other measures’\n\nThose who were going to die were going to die whether you locked down or not\n\nThe disease itself and the fitness of the patients was largely the determinant\n\nDo not consider the wider factors that could also have affected the economy had there not been lockdowns\n\nE.g. mayhem would have ensued for hospital capacity and routine medical care without lockdowns \n\nRetrospectoscope\n\nThis debate may follow party lines\n\nGrowing anti-science feeling in the US\n\nA future epidemic agent could have totally different characteristics\n\nBella\nOmicron today keeps the Delta away", "link": "https://www.youtube.com/watch?v=fcC_2V-5zfU", "date_published": "2022-02-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]