[{"source": "https://lukesmith.xyz/rss.xml", "title": "Minimizing Liabilities Is Making It.", "description": "<p>The default way to look at financial &ldquo;independence&rdquo; nowadays is to think that means &ldquo;making a lot of money.&rdquo;\nThat&rsquo;s understandable.</p>\n<p>But then you see stuff like this:</p>\n\n<figure class=\"titleimg\"><img alt=\"60% of millennials earning over $100,000 say they're living paycheck to paycheck.\" src=\"https://lukesmith.xyz/pix/millennial-paycheck.jpg\" /></figure>\n\n<p>Or this:</p>\n\n<figure class=\"title\"><img src=\"https://lukesmith.xyz/pix/net-worth.jpg\" /><figcaption>It takes until 30 for a person to be as rich as they were when they were born. (And this is average net worth, median would be significantly worse.)</figcaption></figure>\n\n<p>The longer you mentally analyze the second picture, the more depressing it will get. Obviously the negative net worth early in life is kids losing around $10,000 a year in value by going to college, but the truly depressing thing is that after that period, their net worth increases only by an average of about $5,000 a year.</p>\n<p>That means they might have $5,000 more in the bank or $5,000 paid off of their student loans or $5,000 going to equity in a house, but no combination greater than that.</p>\n<h2 id=\"how-does-this-happen\">How does this happen?</h2>\n<p>How is it that people alive in the period of the highest and most productive technology are working more than Medieval serfs?</p>\n<p>Let&rsquo;s put it in simple terms by defining &ldquo;making it:&rdquo;</p>\n<dl>\n<dt>Making it:</dt>\n<dd>Earning or having significantly more money than you spend or owe.</dd>\n</dl>\n<p>Or in pseudomath:</p>\n<p><math xmlns=\"http://www.w3.org/1998/Math/MathML\">income - liabilities = comfortability</math></p>\n<p>To increase comfortablity, you can increase your income or decrease your liabilities.\nThis is a simple equation.</p>\n<p>By &ldquo;liabilities&rdquo; I mean:</p>\n<ul>\n<li>the cost of food you have to eat to live</li>\n<li>the cost of the place you need to live</li>\n<li>the payments for goods and services you actually need (power, or perhaps a car, etc.)</li>\n<li>debts</li>\n</ul>\n<p>The <em>problem</em> I would estimate is that people focus <strong>all of their time, money and interest on increasing their income and focus quite literally none on <em>decreasing</em> their liabilities</strong>, which is actually substantially easier anyway.</p>\n<p>In fact, the modern economy, including all the bad advice it gives to people can generally be thought of a system that is desperatly trying to <em>increase</em> everyone&rsquo;s liabilities within it.\nFinancial libabilities, debt and others, breed even more financial liabilities.</p>\n<h3 id=\"the-lifestory-of-basically-everyone-nowadays\">The Lifestory of Basically Everyone Nowadays</h3>\n<p>Let&rsquo;s illustrate this with the story of most people you know:</p>\n<ol>\n<li>&ldquo;I&rsquo;m going to the best college I can because everyone told me to.&rdquo;</li>\n<li>&ldquo;I need to pay off my $40,000+ in student loans, so I need to move to the city and get a good job.&rdquo;</li>\n<li>&ldquo;I get paid well, so I need a better car and other stuff to match.&rdquo;</li>\n<li>&ldquo;I still have loan debt, car debt and now credit card debt, but now I have a good credit score, so I&rsquo;ll use all my savings to pay 20% of an expensive house I&rsquo;ll be paying off for 25 years.&rdquo;</li>\n<li>&ldquo;Oh my boss wants me to humiliate myself for sodomy month or get the Coofid vaccine or the Mark of the Beast to keep my job. I have at least a quarter of a mil invested in my life here, so I can&rsquo;t just leave. Be realistic.&rdquo;</li>\n<li>&ldquo;Yeah the economy is really bad and I lost a lot of investments. Either way, this is my career and what I&rsquo;m trained for. It&rsquo;d be hard to retrain. I made the right choices, I just got unlucky.&rdquo;</li>\n<li>&ldquo;Well, I&rsquo;m 60 and it&rsquo;s time for retirement! Now that my body is broken I can start enjoying life!&rdquo;</li>\n<li><em>*Dies of seed-oil-induced heart attack.*</em></li>\n</ol>\n<p>It&rsquo;d be wrong to singularly blame student loans for all of this, but there is a tangible sense in which opening up any new massive monthly liability to the system encourages people to open up more to cover for it.</p>\n<p>No one is ever told that this is the inevitable end of increasing liabilities: you need more and more liabilities.</p>\n<h3 id=\"which-way-millennial\">&ldquo;Which way Millennial?&rdquo;</h3>\n<p>Millennials come in two financial categories: around 90% of them are extreme consoomers who cannot not spend every penny of their salaries on subscriptions, plastic toys and coffee and seem to view the fact they get calls from collections agencies as some unpreventable outcome of &ldquo;capitalism.&rdquo;</p>\n<p>The other 10% are the exact opposite: they are contemplating living in the trunk of their 1990&rsquo;s Corolla parked in the parking lot of their job site so they can save 97% of their income.\nWhen they plan on buying a house or getting married, they are quixotically salivating on how much money they can save on monthly bills.</p>\n<h2 id=\"the-endgame\">The Endgame</h2>\n<p>I will go ahead and say, I consider the ideal not even to be rich, but to not need money to live a comfortable life because you have put yourself in a geographic and behavioral position where you can survive on as little as possible.</p>\n<p>Either way, my mindset (as the second type of millennial) has always been &ldquo;How can I absolutely minimize the amount of money I need to live?&rdquo;</p>\n<ul>\n<li>&ldquo;What is the cheapest place to rent?&rdquo;</li>\n<li>&ldquo;What is the cheapest-per-calorie real food for me to eat?&rdquo;</li>\n<li>&ldquo;What &ldquo;needs&rdquo; are not really needs and can I go without?&rdquo;</li>\n</ul>\n<p>The implicit goal was to live on as little as possible: that&rsquo;s what actually maximizes your life&rsquo;s freedom.\nIf you can live on less than, say, $500 a month, even working as a part-time wagie, you will be plenty to pay bills, save a significant amount and have lots of free time.</p>\n<p>For young single guys in computer science, this is especially ideal, since your hobbey/craft doesn&rsquo;t cost anything to tinker with.</p>\n<p>In my late twenties, right before I bought my house, I was living in a college town with a monthly budget <strong>including my rent</strong> of around $400 ($300 was rent $100 was basically groceries). Probably went over that $100 most months, but never by much. This is also when I started <a href=\"https://lukesmith.xyz/articles/making-free-money-off-credit-cards\">churning credit cards</a> to make a significant portion of my little expenditure back.</p>\n<h2 id=\"behavioral-patterns-over-life\">Behavioral Patterns over Life</h2>\n<p>As you&rsquo;re saving money to buy/pay off a permanent dwelling place, most important is cultivating permanent behaviors that will reduce your need for money and &ldquo;the system.&rdquo;</p>\n<p>If you take the &ldquo;high&rdquo;-income, high-liability route, you&rsquo;re going to be establishing wasteful antipatterns your early life and when you need to buckle down and root those out, it will be more difficult because it will be the egotistically trying task of going from showly and &ldquo;easy&rdquo; pleasure spending to a Spartan budget.</p>\n<p>It&rsquo;s much easier to have a solid foundation of low spending. I said in that video years ago on getting Trumpbux that all money you earn and spend should be directly weaponized to decrease your reliance on money. Property, tools, plants, skills. These are investments much more substantial than investing in boomer stocks because they lessen your need for money.</p>\n<h3 id=\"worst-case-scenario\">Worst Case Scenario</h3>\n<p>As a passing remark, I&rsquo;ll add that the other benefit of focusing on minimizing liabilities is that it makes you significantly less reliant on &ldquo;the system&rdquo; and more robust in the case of disaster.</p>\n<p>&ldquo;Training&rdquo; to get a highly specific corporate job is not going to help you in all possible scenarios in the way that simple the simple craftsmanship of someone who fixes their own cars and things.</p>", "link": "https://lukesmith.xyz/articles/minimizing-liabilities-is-making-it/", "date_published": "2022-07-16 16:10:08+00:00", "persistent": true, "user": null, "language": "en-US"}]