[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Andrew Bird and Iron & Wine: Tiny Desk Concert", "description": "Bob Boilen | August 12, 2022\nI'd been entertained and enchanted by the many of the 150 or so small concerts Andrew Bird performed on Instagram during the pandemic. Then I heard his new album, Inside Problems, and invited him to the desk. It had been six years since his first Tiny Desk performance, which was with a band; this time, I wanted an intimate solo performance. He and Iron & Wine's Sam Beam were becoming friends and touring together, and Andrew's idea was to have Sam perform on the final tune. But as they played together night after night on tour, that one song turned into four, and an Andrew Bird and Iron & Wine Tiny Desk was born.\n\nSam Beam is no stranger to the desk either. His first concert was a solo show in 2011, when the series was just a few years old. He returned with Calexico in 2019.\n\nThe two of them together are playful, poking fun at one another. \"We started learning each other's songs,\" Andrew says, \"I love Sam's writing\" — to which Sam retorts, \"I love your handwriting.\" The silly smiles launch them into the Iron & Wine song \"Flightless Bird, American Mouth\" from 2007.\n\nAn absolute favorite moment is when they perform Andrew Bird's \"Left Handed Kisses,\" performed originally as a duet with Fiona Apple and remade here with serious fun by our dynamic duo.\n\nThis concert occurred near the end of a nearly 30-city tour postponed by COVID. The two met in the waters of Yosemite in 2021, and I wouldn't be surprised to see more from this musical friendship in the years to come.\n\nSET LIST\n\"Make a Picture\"\n\"Flightless Bird, American Mouth\"\n\"Left Handed Kisses\"\n\"Orpheo Looks Back\"\n\nMUSICIANS\nAndrew Bird: vocals, violin, guitar, loop pedals\nSam Beam: guitar, vocals\n\nTINY DESK TEAM\nProducer/Series Creator: Bob Boilen \nAudio Engineer: Josh Rogosin \nDirector: Kara Frame \nSeries Producer: Bobby Carter \nEditor: Michael Zamora \nVideographers: Kara Frame, Michael Zamora, Pierre Kattar \nProduction Assistants: Jill Britton, Alanté Serene, Joby Tanseco\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #AndrewBird #IronAndWine", "link": "https://www.youtube.com/watch?v=WVfbIWC7wmE", "date_published": "2022-08-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]