[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Escape From Tarkov’s Guns PART 5", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down more of the weaponry of Escape From Tarkov, including the Chiappa Rhino, the ADAR 2-15 and a hideously cursed Glock 18C.\n\n00:00 - Opening\n00:38 - ADAR 2-15\n02:25 - MTs 255 Revolving shotgun\n03:57 - Chiappa Rhino\n05:28 - H&K G28 \n08:17 - Glock 18C\n09:24 - Rifle Dynamics RD-704 AK\n12:30 - FN SCAR-L\n15:20 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down more of the guns of Escape From Tarkov and compares them to their potential real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=offyCsakbRc", "date_published": "2022-08-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Madden NFL 23 - Everything To Know", "description": "EA's latest entry in the Madden series brings players back onto the gridiron for another year of football. In this video we break down everything players need to know including some new gameplay mechanics like Fieldsense, as well as changes to the classic Franchise mode.\n\nThe year is 2022, which means we are yet again receiving another Madden game to start the football season. For those of you thinking this might just be yet another Madden…well, you're probably right, but hey, you know, and I know the real reason we keep coming back for more: Roster Updates. All jokes aside stick around as I break down everything to know about Madden 23, so you can see if this might be the Madden for you.\n\nMadden 23's biggest change to the core gameplay is what EA is calling Fieldsense, an overhaul to several of the game's on-field mechanics. New tackle animations and game logic have redressed the play-by-play nature of the sport. punchout fumbles and more team gang tackles intend to bring an extra level of oomph and aggression to the game – something EA refers to as the Hit Everything feature.\n\nWe're gonna have lots of Madden coverage coming this month. I'm working on getting a Livestream set up for you guys the week the game comes out. Be sure to keep an eye out for Mark Delaney's official Madden review after the game launches as well. If you're interested in Franchise mode or want to play Ultimate Team but don't want to spend a dime, let me know! Based on your comments, I'll get more vids cooking for y'all catered to what you guys want to see. Thanks for watching.", "link": "https://www.youtube.com/watch?v=-O3YqlFgzRI", "date_published": "2022-08-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Marvel's Spider-Man Is Fantastic On Steam Deck | Settings Recommendations", "description": "The PC release on Spider-Man not only brings better graphics, but the option to play on the go thanks to the Steam Deck.\n#gaming #marvelsspiderman #steamdeck \n\nEverything we talk about in this video is based on our time with a pre-release version of the game. Sony told us up front that they are still working on optimization and warned us about certain issues they plan to fix. In fact we got a big fat update just a few days before this video launched, offering some major improvements So it's possible some of the issues we talk about will be improved down the line in future patches.\n\nMarvel’s Spider-Man Remastered is out now on PC. The port includes ultrawide support, an unlocked frame rate, improved shadows, ray-traced reflections at varying quality levels, Nvidia Deep Learning Super Sampling (DLSS), Nvidia Deep Learning Anti-Aliasing (DLAA) and more. The game also supports the DualSense controllers as well as mouse and keyboard setups. Cloud saves and achievements are supported on both the Epic Games Store and Steam.\n\nMarvel’s Spider-Man: Miles Morales will also come to PC sometime in Fall 2022. \n\nMarvel's Spider-Man originally launched on PlayStation 4 in September 2018. The remastered version came packaged with the ultimate edition of Marvel's Spider-Man: Miles Morales, which launched with the PlayStation 5 on November 12, 2020. Marvel's Spider-Man 2 was announced during the PlayStation showcase in September 2021, featuring Peter Parker and Miles Morales teaming up to fight crime. A PC version of the sequel as yet to be confirmed.", "link": "https://www.youtube.com/watch?v=cf0fMQ_ckHQ", "date_published": "2022-08-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Alone In The Dark Is A Modern Reimagining Of A Survival Horror Classic", "description": "Announced at THQ Nordic's 2022 games showcase, the new Alone in the Dark reboots the 1992 original, updating the story and refreshing its classic gameplay.\n#gaming #gamename #gamespot \n\nPublisher THQ Nordic is rebooting Alone in the Dark--but rather than a new game in the series, developer Pieces Interactive is returning to the 1992 original to put a modern spin on the game that helped give rise to the modern survival horror genre. The new game is a third-person title that reimagines the original game, making adjustments to its story and gameplay, while attempting to capture the suspense and atmosphere that made Alone in the Dark so memorable.\n\nTHQ announced the return of Alone in the Dark during its 2022 game showcase, in which it showed off a trailer that gives a sense of the expanded, more cinematic version of the tale the reboot will tell. GameSpot got an expanded look at the game, which included an explanation of its story, setting, characters, and gameplay. Like the original Alone in the Dark, the reboot is largely set in a mansion called Derceto Manor in the 1920s American South. This time, however, it's not a mansion, but a mental hospital for rich clients--and the game will include additional settings, as well.\n\nAlso returning from the original are Alone in the Dark's playable characters, Edward Carnby and Emily Hartwood. Both are playable in the new game, and both play a larger part in the other character's story. In fact, like in later survival horror games such as Resident Evil 2, the stories experienced by Edward and Emily are different from one another, taking you through a different tale depending on which you choose.\n\nAlone in the Dark is slated to release on PlayStation 5, Xbox Series X|S, and PC, but THQ Nordic hasn't yet announced a release date.", "link": "https://www.youtube.com/watch?v=e1Vrrl0CdV4", "date_published": "2022-08-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Alone In The Dark Official Reveal Trailer", "description": "Make your way back to Derceto Manor in this reimagination of Alone in the Dark. Emily Hartwood is on the search for her uncle who has gone missing. Edward Carnby private investigator helps aid her in her search. They arrive together at Derceto Manor where they encounter strange residents, portals to nightmarish worlds, dangerous monster and much more.\n\n#aloneinthedark #gaming", "link": "https://www.youtube.com/watch?v=S-9Oil-PfNA", "date_published": "2022-08-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "I Heart Metal Gear Solid (ft. YongYea, Super Bunnyhop, and More!)", "description": "While Hideo Kojima had been creating games for some time, including Metal Gear on the NES, its as Hideo Kojima’s Metal Gear Solid on the PSX that introduced him as a true auteur. From MGS1 to Death Stranding, Kojima has become synonymous with quality, and Metal Gear Solid has become one of gaming’s most iconic franchises of all time.\n#iheartgaming #gamespot #metalgearsolid #mgs1 #kojima #yongyea #skillup #superbunnyhop #jakebaldino \n\nJoin YongYea, Super BunnyHop, SkillUp, Jake Baldino of gameranx, RogersBase, Ink Ribbon, The Salt Factory, and Tamoor Hussain and Lucy James of Giant Bomb as they discuss the absolutely massive impact of Metal Gear Solid 1, and how much it meant to them.\n\nFrom connecting with Otacon as a gamer and otaku and crying over the death of Sniper Wolf, to how absolutely iconic Solid Snake is, the crew chat about how much the characters resonated with them. Meanwhile, they discuss how wild it was going up against Psycho Mantis, and what how revolutionary the 4th wall breaks of the Psycho Mantis fight were.\n\nRalph talks about his favorite moment of being in an elevator, only to realize there were invisible enemies surrounding him the entire time, while Super Bunnyhop talks about the deeper themes of Metal Gear Solid, and how it introduced gamers to concepts like the military-industrial complex.\n\nMetal Gear Solid 1 rocked the world when it came out, and Hideo Kojima became one of gaming’s most prominent figures along side MGS1, and here is the love letter to how much of an impact Metal Gear Solid had to the individuals who played it.\n\nLet us know what future episodes you’d like to see, and what guests you hope to see on! And consider checking out our previous episodes on Dark Souls, Skyrim, and Final Fantasy VII!\n\n00:00 - What is Metal Gear Solid\n01:55 - Sniper Wolf\n02:46 - Can love bloom on the battlefield?\n03:51 - Deep story\n05:17 - Iconic scene: the Elevator\n06:30 - Iconic scene: Psycho Mantis\n08:30 - The legacy of Metal Gear Solid\n\n🎥 Watch I Heart Dark Souls: I Heart Dark Souls (ft. Otzdarva, Iron Pineapple, and More!)\nhttps://www.youtube.com/watch?v=Y0-OIBXkqsU", "link": "https://www.youtube.com/watch?v=mu0KLJsW-Ao", "date_published": "2022-08-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Multiversus Season 1 Gets A New Release Date | GameSpot News", "description": "Multiversus season 1 is dropping soon, THQ Nordic announced a ton of new games, and Sonic Frontiers isn't getting a delay.\n#Gaming #Multiversus #Sonic \n\nMultiversus’ season 1 launch gets a new date, new announcements from THQ Nordic, and Sonic Frontiers is sticking to its release among a sea of delays. All this on today’s GameSpot News.\n\nWhat began as an indefinite delay has turned into a short one-week wait, as MultiVersus Season 1 has been confirmed for a August 15 start date, while also confirming that the first new character of the season--Morty Smith from Rick and Morty--will debut eight days later on August 23.\n\nMorty isn't the only character confirmed for MultiVersus Season 1, as his grandpa Rick Sanchez will also join the roster during the game's inaugural season. No release date has been announced for Rick's addition.\n\nThe developers also shared a snapshot of what the first season of MultiVersus will be adding to the game, including online ranked lobbies, a single-player arcade mode, and more characters beyond the already confirmed Rick and Morty.\n\nJust waiting on that Larry David announcement now.\n\nTHQ Nordic had a massive showcase today, including new game announcements.\n\nThe rumors were true: a new Alone in the Dark is coming, returning the series all the way back to its 1992 roots to revisit key elements of a game that helped give birth to the survival horror genre. \n\nIt features a lot of elements from the 1992 title, including its setting, Derceto Manor, and its two main playable characters: private detective Edward Carnby and Emily Hartwood.\n\nAmnesia: The Dark Descent and SOMA writer Mikael Hedberg will be penning the game’s script, who says that the story will be more active than the original; expect cinematic cutscenes and voiced dialogue, in addition to notes, letters, and other items you'll find as you explore Derceto Manor and the rest of the world.\n\nWreckreation is coming from Three Fields Entertainment, a studio made up of developers from Electronic Arts and Criterion Games, including folks who previously worked on the Burnout and Need for Speed series, and it's clear the \"wreck\" side of the game draws inspiration from those beloved racing titles. \n\nStunts, crashes, and takedowns are a big part of the events you'll compete in, and it sounds like just about everything in the game will provide you opportunities for those competitions. Instead of covering a city, Wreckreation takes place in its own drivable state, made up of four different counties that you can explore to discover shortcuts, challenges, and breakable billboards. There are 400 square kilometers of area in the game, and you can drive on all of it, according to Three Fields.\nFor more information on all the announcements made during today’s presentation, head to GameSpot dot com.", "link": "https://www.youtube.com/watch?v=fxCtqbvM0gc", "date_published": "2022-08-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "SpongeBob SquarePants: The Cosmic Shake Official Trailer", "description": "SpongeBob and his buddy Balloon-Patrick are ready for a new adventure! \n\nTravel to the Prehistoric Kelp Forest, Wild West Jellyfish Fields and more in this new trailer for SpongeBob SquarePants: The Cosmic Shake! \n\nSpongeBob SquarePants: The Cosmic Shake is coming to PC, PlayStation 4, Xbox One and Nintendo Switch.\n\n#spongebob #gaming", "link": "https://www.youtube.com/watch?v=_xWuMjxw8kk", "date_published": "2022-08-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "THQ Nordic Digital Showcase 2022 Livestream", "description": "Tune in for the second annual THQ Nordic Digital Showcase featuring a look at games like SpongeBob, Destroy All Humans! 2, Outcast 2, Jagged Alliance 3, and new announcements and surprises.\r\n\r\n#thqnordic #gaming", "link": "https://www.youtube.com/watch?v=SdWS5VIdwXE", "date_published": "2022-08-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Completionist, Exclusive God of Work Clip, and Fancasting Our Own Sitcom | After Dark Ep 157", "description": "We are joined by Jirard \"The Completionist\" Khalil to talk about his new show at G4, God of Work. We also talk about Spider-Man on steam deck, Cult of the Lamb, Netflix's Sandman, and pick video game characters best suited for office jobs.\n\n#gaming # #gamespotafterdark @ThatOneVideoGamer​", "link": "https://www.youtube.com/watch?v=7EGn-pSPdcI", "date_published": "2022-08-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Wreckreation Official 4K Announcement Trailer", "description": "Check out Wreckreation a brand new racing game where you home is your own MixWorld, a 400 kilometers big racing realm that you can create, shape and wreck!\n\nThe team behind Burnout and Need For Speed series Three Fields Entertainment brings you this ultimate open-world sandbox experience to race in.\n\n#wreckreation #gaming #racing", "link": "https://www.youtube.com/watch?v=I13wJvkQCCM", "date_published": "2022-08-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]