[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "I Heart Red Dead Redemption 2 (ft. Jake Baldino, Brandon Jones, and More!)", "description": "Red Dead Redemption 2, the prequel to Rockstar's beloved Red Dead Redemption, features a number of brand new faces - like Arthur Morgan, and plenty of familiar ones - like fan favorite John Marston. Red Dead 2 has become notable for its compelling characters and incredible story it weaves.\n#iheartgaming #reddeadredemption2 #rdr2 #reddead2 \n\nJoin Jake Baldino of gameranx, Brandon Jones of Easy Allies, Jared Petty of Kinda Funny, Gav Murphy of RKG, Lucy James of Giant Bomb, Cade Onder of ComicBook.com, DaveControl, plus Kurt Indovina and Jake Dekker of GameSpot as they discuss their love for Red Dead Redemption 2, and just how much the story and characters meant to them.\n\nJared Petty and Gav Murphy discuss how much they loved their horses, while Jake Baldino and Jared Petty talk about the leadership and eventual downfall of Dutch van der Linde. DaveControl, Gav Murphy, and Jake Dekker gush about their love for Arthur Morgan, while Lucy James and Kurt Indovina shudder in disgust at the thought of Micah, as Kurt revels in Arther and Micah's fight.\n\nMeanwhile, Brandon Jones and Jared Petty talk about how great it was to play as John Marston again during the game's epilogue. They all go over some of their favorite moments, including stumbling across a UFO in the game, getting drunk with Lenny, and the incredible plantation scene when the whole gang heads out to rescue Jack Marston.\n\nLet us know what future episodes you'd like to see, and what guests you hope to see on! And consider checking out our previous episodes on Dark Souls, Skyrim, Final Fantasy VII, Metal Gear Solid, and Resident Evil 4!", "link": "https://www.youtube.com/watch?v=_id8oiVPy74", "date_published": "2022-08-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Nintendo Won't Raise the Price of the Switch | GameSpot News", "description": "Sony's increasing the price of the PS5 in some regions, but Nintendo is firm it won't do the same for the Switch. Despite a rumor, Amazon is reportedly not buying EA; and Wo Long: Fallen Dynasty gets an all new trailer.\n\nSpeaking to Eurogamer, Nintendo's president said in a statement: \"we will determine our future pricing strategies through careful and continued deliberations,\" and do not have any plans to \"increase the trade price of its hardware.\" Instead, Nintendo is decreasing the size of Switch packaging to help with shipping issues, by making the cardboard box it comes in 20% smaller, which in turn will help the company's bottom line by using fewer materials. \n\nEarly this morning a report suggested that Amazon was set to announce an acquisition of Electronic Arts later today. However, it didn't take long for the report to be denied. After all, EA is reportedly pursuing a sale or merger, and is said to have had talks with Disney, Apple, Comcast, and, of course, Amazon. But as of now, there is no official news to report on of the behemoth developer/publisher being purchased at this time. \n\nSouls-like fans have been eating well recently, because today we got a trailer for Wo Long: Fallen Dynasty, a new Souls-like action game from Ninja Gaiden, Nioh, and Stranger of Paradise developer Team Ninja. The trailer is filled with sword fighting, Chinese martial arts, and otherworldly enemies and environments players will be exploring. \n\nHere's your friendly reminder that Destiny 2 and all its expansions are free to play until August 30. So if you've always been curious, now's a good time to dip your toes in.\n\nSTAMPS\n00:00 Intro\n00:16 Nintendon't Raise the Praise\n01:38 Amazon Isn't Buying EA\n03:16 Wo Lo: Fallen Dynasty Gameplay\n03:50 Destiny 2 is Free / Outro", "link": "https://www.youtube.com/watch?v=XTB6YUQlWZk", "date_published": "2022-08-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Saints Row Reboot is a Mess | GameSpot After Dark Ep 159", "description": "This week Jordan and Jake talk about the unfortunate state of the Saints Row reboot, Jean-Luc has been playing indie souls-like Thymesia and laundromat/arcade simulator Arcade Paradise, and we talk about the biggest announcements from gamescom.\n\n#gaming #saintsrow #gamescom #gamespotafterdark", "link": "https://www.youtube.com/watch?v=Cfy6cUPvYgA", "date_published": "2022-08-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Playstation 5 Gets a Price Increase | GameSpot News", "description": "The Playstation 5 gets a price increase, Lies of P gets a new gameplay trailer, and Battlefield 2042 gets a Season 2 update.\n\nSony Interactive Entertainment is increasing the price of the PlayStation 5 across various regions, citing global economic challenges and adverse currency trends as the primary reason. Sony Interactive Entertainment’s CEO Jim Ryan stated in a blog post that the price increase is going to affect all of Europe, the UK, the Middle East, Africa, Asia, and parts of North America. Due to the current strength of the dollar, The United States will not be affected by the change.\n\nLies of P, the newest entry in the Soulsborne genre got a 6 minute gameplay trailer today after being shown off at Opening Night Live. The gameplay looks to emulate that feeling directly with attacks and parries that also incorporate Pinocchio’s mechanical arm to shock or grapple enemies. Swords, hammers, and shields are your primary tools for bashing baddies. Developer Neowiz has not set a hard and fast release date yet, but expect to explore the desolate world of Lies of P in early 2023.\n\nEA and DICE have announced the first details on Battlefield 2042 Season 2. The sophomore season is called Master of Arms, and it's set for release on August 30 on all platforms. The new map, Stranded, players will fight for control of the ship, and can go inside it for close-quarters combat. We're also seeing the addition of a healer and support specialist who can revive and refill their gadgets. He also has a minigun. Additionally, Battlefield 2042 introduces a new feature called Assignments, which are progression tracks that allow players to unlock more weapons that were previously available only in Battlefield Portal.\n\nSTAMPS\n00:00 Intro\n00:10 PS5 Price Increase In Many Regions Outside the US\n01:10 I'm A Real SoulsBorne Game!\n02:17 Battlefield 2042 Season 2 Revealed \n03:04 Outro", "link": "https://www.youtube.com/watch?v=S2-AkVd-rgw", "date_published": "2022-08-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Warframe Styanax Official Anime Short", "description": "Warframe reveals the 50th Warframe Styanax, coming in the Veilbreaker Update in September. Revealed in this animated trailer “Ascension Day”, Styanax is inspired by the heroic warriors of ancient myth, a paragon of justice and the Lotus’ deadly spear. \n\nPrepare to command the battlefield with Styanax when he launches alongside our Veilbreaker update in September. Coming Soon to PC, Xbox, PlayStation, and Nintendo Switch!\n\n#warframe #gaming", "link": "https://www.youtube.com/watch?v=bSVwtO5i2UM", "date_published": "2022-08-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Wo Long: Fallen Dynasty Official Gameplay Trailer", "description": "Prepare yourself for the dark Three Kingdoms filled with demons and get a glimpse of some of the sword-based action rooted in Chinese martial arts, where actions flow gracefully between offensive and defensive maneuvers. \n\nCurrently in development for the Xbox Series X|S, Xbox One, PlayStation5, PlayStation4, and on PC via Windows and Steam®️. The game is scheduled to release in early 2023.", "link": "https://www.youtube.com/watch?v=b1E64Zt4CwU", "date_published": "2022-08-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Minutes of High On Life Gameplay | gamescom 2022", "description": "Get a glimpse of more than just combat in this High On Life gameplay clip. You'll get to see the talking gun interact with other NPCS, as well as getting a talking knife. \n\nHigh On Life is coming to Xbox One and Xbox Series X|S and PC via Steam and Epic Games Store on December 13.\n\n#highonlife #gamescom #gaming", "link": "https://www.youtube.com/watch?v=CLNkRL-Brrk", "date_published": "2022-08-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Season 2 Master of Arms Gameplay Trailer", "description": "Battlefield 2042's Season 2 Master of Arms is launching August 30, 2022. Head to a drained Panamanian lake and the new map Stranded where you’ll reap the benefits of the Dark Market. Check out new Specialist Charlie Crawford who utilizes a minigun and teamwork skills to support your squad.\n\nBattlefield 2042 is a first-person shooter made up of three distinct multiplayer experiences. All-Out Warfare features the next generation of fan-favorite modes Conquest and Breakthrough, Battlefield Portal allows players to discover battles from the past, present, and future as well as to create and change the rules of war, while Battlefield Hazard Zone brings a tense, squad-focused survival experience. \n\n#battlefield2042 #gaming", "link": "https://www.youtube.com/watch?v=mOiNGnDX3KE", "date_published": "2022-08-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Harvestella Gameplay Presentation | Nintendo Treehouse August 2022", "description": "Check out a gameplay demo for Harvestella that was showcased during the Nintendo Treehouse Live August 2022. We get a look at various gameplay mechanics and much more.\n\nHarvestella is releasing on November 4, 2022.\n\n#nintendo #harvestella #gaming", "link": "https://www.youtube.com/watch?v=Q8D9mn-s1Tc", "date_published": "2022-08-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "High on Life Full Presentation | gamescom 2022 Xbox Booth", "description": "We got a deeper dive into High on Life during the Xbox Booth showcase at gamescom with Mikey Spano (CCO and Art Director) and Matty Studivan (Executive Producer) from Squanch Games. Learn more about a run through a bounty. From various dialogue trees, to combat, and much more.\n\n#xbox #gamescom #highonlife #gaming", "link": "https://www.youtube.com/watch?v=zqVMUyQmRyU", "date_published": "2022-08-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Lies of P - 5 Minutes of 4K Gameplay", "description": "Check out 5 minutes of gameplay from Lies of P, the upcoming action game that boldly says, what if Pinocchio but Bloodborne?\n\nIn this new Lies of P gameplay clip you'll get to see some combat against a variety of enemies including bosses, as well as a look at crafting different weapons, upgrading and swapping various arm attachments, exploration, and much more. Lies of P was playable at gamescom 2022 at the Microsoft booth. \n\nLies of P will be releasing on PlayStation 5, Windows PC, and Xbox Series X in 2023.\n\n#gaming #liesofp #gamescom", "link": "https://www.youtube.com/watch?v=Wm-51cb9fc0", "date_published": "2022-08-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Lies of P Full Presentation | gamescom 2022 Xbox Booth", "description": "Learn more about Lies of P in this stage breakout from the Xbox Booth at gamescom 2022. The developers share more on the story of Lies of P and how Pinocchio inspired their world. We get to learn more about various gameplay mechanics and much more. Lies of P is scheduled to release in 2023.\n\n#gamescom #xbox #liesofp #gaming \n\nTimestamps\n0:00 Intro gamescom Trailer\n2:55 Lies of P Interview\n4:05 How Pinocchio was the inspiration\n6:37 Deep Dive on Story of Lies of P\n10:00 How Lying Impacts the Game", "link": "https://www.youtube.com/watch?v=7mru_M370uU", "date_published": "2022-08-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Madden NFL 23 Review", "description": "On the field, Madden 23 is the best the series has been in a long time, but several of the surrounding pieces feel like they're on injured reserve.", "link": "https://www.youtube.com/watch?v=m04C6N5Fs3I", "date_published": "2022-08-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "NHL 23 Official Reveal Trailer", "description": "EA SPORTS NHL 23 launches on October 14th featuring Trevor Zegras and Sarah Nurse as your cover athletes. \n\nGet a glimpse of what's to come with the latest NHL release in this new trailer.\n\n#nhl23 #gaming", "link": "https://www.youtube.com/watch?v=7z8QTmzdfRU", "date_published": "2022-08-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Nintendo Treehouse Splatoon 3 and Harvestella Full Showcase (Auguest 25, 2022)", "description": "In the latest Nintendo Treehouse we learned more about Splatoon 3's single player, some new weapons, strategies, and a gameplay demo of Harvestella. \n\n#nintendo #splatoon3 #harvestella #gaming \n\nTimestamps\n0:00 Introduction\n1:00 Single Player Story Mode\n3:45 First Stage\n10:00 Second Stage with Splatana\n15:39 Third Stage with Tri-Stinger\n24:59 New Splash-o-matic Weapon\n29:56 Carbon Roller\n33:45 Scorched Gorge Map\n36:59 Splat Charger\n40:47 Eeltail Alley Map\n49:15 Harvestella Gameplay Demo", "link": "https://www.youtube.com/watch?v=TBl7KMAngRE", "date_published": "2022-08-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Off the Grid Cinema Switcher Part One Trailer", "description": "Off the Grid Cinema is a set of stories from the universe of Off the Grid brought to life by Neil Blomkamp. Off the Grid is a cyberpunk battle royale being developed by Gunzilla Games.\n\nSwitcher Part One unfolds amid a corporate war in the dystopian Pacific. Mercs working for the opposing factions engage in a brutal fight for a refugee convoy, with unpredictable consequences.  \n\n#offthegrid #gamescom #gaming", "link": "https://www.youtube.com/watch?v=WYcGvFD8tUs", "date_published": "2022-08-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Phil Spencer Feels Good About the Activision Blizzard Deal | GameSpot News", "description": "Phil Spencer feels good about the Activision Blizzard Acquisition, Dead Island 2 finally gets a gameplay trailer, and Masahiro Sakurai Starts a Youtube Channel. \n\nPhil Spencer is confident that the Activision Blizzard deal will go through while he waits for approval from a panel of countries. Playstation raised concerns about Microsoft having too much exclusivity on IPS. Phil Spencer also mentioned to Bloomberg that it's \"something we're just going to see less and less of\", and believes console exclusives have been fading for some time now. This comes as more and more Sony exclusive games head to PC and Game Pass.\n\nDead Island 2 got a gameplay trailer for the first time in years, showing off some gore filled moments with a hands on experience in person during GamesCom. The game is expected to launch on February 3rd, 2023.\n\nSuper Smash Bros creator Masahiro Sakurai is starting a YouTube channel on game design, appropriately called Masahiro Sakurai on Creating Games. He detailed his vision to create bite-size videos about a range of topics in video game design, with an emphasis on classic games.\n\nSTAMPS\n00:00 Intro\n00:12 Phil Spencer Feels Good About The Activision Blizzard Acquisition\n01:04 Phil Spencer Comments On Console Exclusivity \n02:10 Dead Island 2 Gets A Gameplay Trailer\n03:11 Masahiro Sakurai Gets a YouTube Channel\n03:42 Outro", "link": "https://www.youtube.com/watch?v=p56aAYdAEkk", "date_published": "2022-08-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Plague Tale Requiem Full Presentation | gamescom 2022 Xbox Booth", "description": "We get a deeper dive on a Plague Tale Requiem during this segment at the Xbox Booth Showcase. Get more insight on the game from game director Kevin Choteau from Asobo Studios. The game now has 300,000 rats compared to the 5,000 in Plague Tale Innocence. \n\n#xbox #gamescom #gaming", "link": "https://www.youtube.com/watch?v=l6MyYK6fVdg", "date_published": "2022-08-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xbox Booth @ gamescom 2022 Livestream (Lies of P, High On Life, Grounded, and More)", "description": "Live from gamescom 2022, the Xbox booth will be showing off some of the games they have on the show floor, including Pentiment, Age of Empires IV, Sea of Thieves, Grounded, Lies of P, A Plague Tale: Requiem, and more!\n\n#gamescom #xbox #gaming", "link": "https://www.youtube.com/watch?v=4Mf84rmZ3rQ", "date_published": "2022-08-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xbox gamescom Booth 2022 Full Showcase", "description": "During gamescom 2022, Xbox had a showcase from their booth to highlight 12 games with their developers. We got to deep dive into games like Lies of P, Grounded, Sea of Thieves, Microsoft Flight Simulator, High on Life and much more. Check out the timestamps below for each game.\n\n#xbox #gamescom #gaming \n\nTimestamps\n0:00 Intro\n1:00 Microsoft Flight Simulator\n28:36 A Plague Tale Requiem\n46:35 Sea of Thieves\n01:19:00 Lies of P\n01:38:16 Gunfire Reborn\n01:50:05 High On Life\n02:05:31 Planet of Lana\n02:21:17 Grounded\n02:51:14 Pentiment\n03:14:47 Under the Waves\n03:37:48 Minecraft Legends\n04:08:05 Age of Empires IV", "link": "https://www.youtube.com/watch?v=3B8HSPzGEGw", "date_published": "2022-08-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]