[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Adekunle Gold: Tiny Desk (Home) Concert", "description": "This year, NPR Music is celebrating Black Music Month with an array of brand new Tiny Desk concerts — both from home and from behind our beloved Desk. Together, these artists represent the past, present and future of Black music. This month of carefully curated shows is a celebration of Black artists expressing themselves in ways we've never seen before, and of the Tiny Desk’s unique way of showcasing that talent. \n\nAshley Pointer | June 2, 2022\nAttention passengers: Please make sure your seat belts are fastened and tray tables are stored away as Adekunle Gold is ready for takeoff. The shape of the Nigerian singer-songwriter's Tiny Desk (home) concert mimics a flight pattern sonically and energetically, starting off laid back and ascending to greater heights that'll make you dance and move your feet.\n\nAG's career first picked up steam after the release of his debut single \"Sade,\" a highlife cover of One Direction's \"Story of My Life,\" in 2014; then, he released his debut album Gold in 2016. Three albums later, the Yoruba sensation's sound has evolved from highlife to Afropop.\n\nAG filmed his (home) concert with his band in Los Angeles, inside a retro, faux airport terminal – home of AG Baby Airlines. Opening with \"Sinner,\" a modern take on the Biblical story of King David and Bathsheba, the band's arrangement translates seamlessly live, with AG's smooth vocals complimented by violin and driven by steady, rhythmic drums.\n\nClosing his set with the uptempo and jaunty \"Okay,\" a reliable banger from his record Afro Pop, Vol. 1, AG explains: \"It's such an energy giver — the people turn up, and we are about to turn up now.\" Embarking on his first North American Tour Catch Me If You Can, which has its first stop today in Boston — as noted on the AG Baby Airlines signage — \"turn up\" is precisely the correct term as AG Baby is letting you know that he may be bringing his signature soulful Afropop to a city near you.\n\nSET LIST\n\"Sinner\"\n\"Something Different\"\n\"One Woman\"\n\"Okay\"\n\nMUSICIANS\nAdekunle Gold: vocals\nOmar Perrin: keys/MD\nCam Griffin: guitar\nDarius Woodley: drums\nClark Sims: bass\nLulu V: violin\n\nCREDITS\nDirector: Robin Burke\nProducer: Kristene Lew, Kat Boyd\nCreative Director: Grace Hsiu\nProducer: 1983 Creative\nDirector of Photography: Mikey Van Beuren\nCamera Operators: Danny Corey, Kyle Messina\n1st AC: Dima Shorin, Garrett Hoffmann\n2nd AC: Natasha Abdul\nEditors: Wolf De Burgo, Cole Benton\nGaffer: Adam Schaffer\nElectric: Wesley Aharoni\nKey Grip: Ryan Silver\nAudio Engineer: Liz Robson\nAssistant Engineer: Anthony Culpepper\nMix Engineer: Bakare Michael\nMix and Master Engineer: Mike Tucci \nTruck PA: Herbie Finn Bailey De Vos\nSet PA: Patrick Amirbehboody\nManagement: Elizabeth Sobowale, Ola Fowosere\nExtra: Tyler Lazalere, Zoë Montano, Dionte Goodlett\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Michael Zamora\nAudio Mastering: Andie Huether\nAnimation: Kaz Fantone\nTiny Production Team: Bob Boilen, Josh Rogosin, Joshua Bryant, Maia Stern, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #tinydeskconcert #adekunlegold", "link": "https://www.youtube.com/watch?v=r-gkSte4QdA", "date_published": "2022-06-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]