[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "College, Inc. (full documentary) | FRONTLINE", "description": "FRONTLINE follows the money to uncover how Wall Street and a breed of for-profit universities transformed the way we think about college in America. (Aired 2010)\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nIn “College, Inc.,” correspondent Martin Smith investigates the promise and explosive growth of the for-profit higher education industry. Through interviews with school executives, government officials, admissions counselors, former students, and industry observers, the documentary explores the tension between the industry — which says it's helping an underserved student population obtain a quality education and marketable job skills — and critics who charge the for-profits with churning out worthless degrees that leave students with a mountain of debt. At the center of it all stands a vulnerable population of potential students, often working adults eager for a university degree to move up the career ladder. \n\nLove FRONTLINE? Find us on the PBS Video App, where there are more than 300 FRONTLINE documentaries available to watch any time: https://to.pbs.org/FLVideoApp​ \n\n#Documentary #College #StudentLoans\n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nFRONTLINE is produced at GBH in Boston and is broadcast nationwide on PBS. Funding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; the Heising-Simons Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.\n\nCHAPTERS:\nPrologue - 00:00\nWall Street and Higher Education - 00:52\nThe For-Profit University Business Model - 07:07\nHow For-Profit Colleges Sell Themselves - 16:27\nWhat It Takes To Revive A Failing College - 27:08\nCorinthian and Students in Debt  - 34:01\nLobbying Against Tougher Regulations - 46:15\nCredits - 52:34", "link": "https://www.youtube.com/watch?v=ULUtX4fZKlk", "date_published": "2022-06-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]