[{"source": "https://www.theguardian.com/rss", "title": "Why has Putin’s Russia waged war on Ukraine? – video explainer", "description": "<p>Vladimir Putin has plunged Europe back into war and a conflict that ‘I think will reverberate far beyond Ukraine and have huge implications for Europe, for the rest of the world’, says Guardian foreign correspondent Luke Harding. Reporting from Kyiv, he examines why the Russian president launched a full-scale invasion of its neighbour, if Putin can be stopped, and what might come next</p><ul><li><a href=\"https://www.theguardian.com/world/2022/feb/24/kyiv-ukraine-russia-invasion\">Stay or flee? Kyiv comes to terms with disaster of Russian invasion&nbsp;<br /></a></li><li><a href=\"https://www.theguardian.com/world/series/ukraine-live/latest\">Follow live updates here</a><br /></li></ul> <a href=\"https://www.theguardian.com/world/video/2022/feb/24/why-has-putins-russia-waged-war-on-ukraine-video-explainer\">Continue reading...</a>", "link": "https://www.theguardian.com/world/video/2022/feb/24/why-has-putins-russia-waged-war-on-ukraine-video-explainer", "date_published": "2022-02-24 23:37:13+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Teaching in further education alongside his industry job gave an IT expert the variety he craved", "description": "<p>Keen for a new challenge, IT professional Christian Nunez Fuentes took a course at Bedford college … and soon ended up teaching there himself</p><p>Christian Nunez Fuentes’s path into further education (FE) has been one of twists and turns. Brought up in Peru, at the age of 22 he moved to the UK to study English – a language he proceeded to learn from scratch. That led to a 13-year career in retail IT, initially as a technician and then as a business account manager and supervisor, in areas such as customer service, logistics and sales.</p><p>Deciding it was time for a change, in 2016 Nunez Fuentes set up his own web design company. At the same time he took a Higher National Certificate (HNC) and Higher National Diploma (HND) in computing and systems development at Bedford college, an FE provider based in the town of the same name.</p><p>Working in the industry as well as teaching lets Nunez Fuentes keep on top of the latest developments, benefiting his students</p> <a href=\"https://www.theguardian.com/further-education-share-your-skills/2022/feb/24/teaching-in-further-education-alongside-his-industry-job-gave-an-it-expert-the-variety-he-craved\">Continue reading...</a>", "link": "https://www.theguardian.com/further-education-share-your-skills/2022/feb/24/teaching-in-further-education-alongside-his-industry-job-gave-an-it-expert-the-variety-he-craved", "date_published": "2022-02-24 10:45:52+00:00", "persistent": false, "user": null, "language": "en-UK"}]