[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Shirley Caesar: Tiny Desk (Home) Concert", "description": "NPR Music's Tiny Desk series will celebrate Black History Month with Tiny Desk (home) concerts featuring legends in the world of R&B, jazz, gospel, and hip-hop. Each artist in this legacy lineup has helped to define Black music as we know it and will be performing a Tiny Desk concert for the first time.\n\nMitra I. Arthur | February 25, 2022\nDuring a moment of testimony in her Tiny Desk (home) Concert, Pastor Shirley Caesar declares, \"I'm beginning to feel something moving on the inside.\" It is impossible to witness a performance from the \"First Lady of Gospel Music\" and there not be a moment where the spirit moves her to dance, punctuated — in true gospel fashion — by a band led by her longtime organist and music director, Michael Mathis.\n\nAs one of the most iconic figures in traditional gospel music, Pastor Shirley Caesar has amassed 18 Dove Awards, 14 Stellar Awards, 11 Grammys in addition to a Lifetime Achievement Award, and an induction into the Gospel Music Hall of Fame. During her seven decades-long career, she has collaborated with fellow traditional gospel figures including Inez Andrews, Dorothy Norwood, Dottie Peoples, Milton Brunson, and her mentor Albertina Walker, as well as contemporary artists such as Kirk Franklin, Whitney Houston, Patti LaBelle, Anthony Hamilton, J. Moss and Tye Tribbett.\n\nPastor Caesar recently became familiar to those outside of the gospel sphere when an excerpt of her song \"Hold My Mule\" went viral in 2016, shooting the song to the top of Billboard's Hot Gospel Songs chart. For those hoping to hear \"I got beans, greens, potatoes, tomatoes...\" be sure to stick around to the very end of this Tiny Desk — Pastor Caesar has a treat for you.\n\nWith a vast discography, this set offers just a brief sampling of Pastor Caesar's music ministry, including 2016's \"It's Alright, It's Ok,\" the 1989 classic \"I Remember Mama,\" the charged \"Armor of God\" and \"Take Your Knee Off My Neck,\" Pastor Caesar's response to the death of George Floyd at the hands of a Minneapolis police officer.\n\nSET LIST\n\"It's Alright, It's Ok\"\n\"I Remember Mama\"\n\"Armor Of God\"\n\"Take Your Knee Off My Neck\"\n\nMUSICIANS\nShirley Caesar: vocals\nMichael Mathis: musical director, organ\nCriss Johnson: guitar\nWillie Riddick: bass \nAaron Meadows: drums\nRyan McCorkle: keys\nLisa Powell: vocals\nDonald Gore: vocals\nAvery Evans: vocals\n\nCREDITS\nProducers: Michael Mathis, Jonathan Anderson\nVideo Production: Benton L. Aladdin for TAG Studios\nCamera Operators: Horace Hall, Nyla Carter, Rayshon DeLoach\nAudio Engineers: Emmanuel Aluko, Reprondre DeLoach\nProduction Assistants: Quaford Coleman, Cherie Clinton\nExecutive Producers: Shirley Caesar, Carolyn Sanders\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Joshua Bryant\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Maia Stern, Ashley Pointer\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=p3wLRo9zE5w", "date_published": "2022-02-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "From 'Milkshake' to Veggies, Kelis and Ron Finley Share Their Farm Journeys", "description": "Grammy-nominated recording artist Kelis has long had a creative connection to food. It's right there in her music, with tracks like \"Milkshake,\" \"Midnight Snacks,\" and \"Jerk Ribs\" — she even has an entire album titled Food. But Kelis' passion for gastronomy extends beyond her music: She graduated from Le Cordon Bleu, released her own cookbook, and most recently, bought a farm in Temecula, Calif., where she lives with her family. \n\nJust a few hours away in South Central Los Angeles, Ron Finley, the \"Gangsta Gardener,\" is spreading his own message of urban gardening. You might recognize him from his Masterclass — it's one of the platform's most popular courses — or his TED talk on guerrilla gardening, which has amassed over a million views. \n\nIn 2010, Finley planted fruits and vegetables on the parkway in front of his house, which violated a Los Angeles city code that he eventually got changed. Since then, he's worked to build gardens throughout his city, with the goal of turning food deserts into food sanctuaries.\n\nWe arranged for the two of them to chat — Kelis from her farm, Ron in his garden — about the joys of growing your own food, the relationship between Black people and the land, and how to handle a mean rooster.", "link": "https://www.youtube.com/watch?v=fv3kgm18Q7I", "date_published": "2022-02-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]