[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "All-New PlayStation Plus: Everything You Need To Know", "description": "The all-new PlayStation Plus is a service made of three membership plans, each offering a wide selection of games for all tastes to download or stream. Here’s everything you need to know about it.\n(Presented by PlayStation Plus)\n\nKicking off with PlayStation Plus Essential. For $9.99 a month, or $59.99 for the year, you get a number of benefits including online multiplayer, exclusive discounts in the PlayStation Store, all-important cloud storage for your saved games, the ability to share your games online with your friends using Share Play, and two monthly games to add to your library.\n\nNext up is the PlayStation Plus Extra plan, which provides all the same benefits as the Essential plan, as well as access to the Game Catalog: a frequently updated library of hundreds of PlayStation 4 and 5 games that you can download and enjoy. \n\nAnd finally, PlayStation Plus Premium. This plan includes all the benefits of PlayStation Plus Essential and Extra, but also adds a number of additional ones, including Game Trials.\n\n#Gaming #Playstation #PSN #godofwar", "link": "https://www.youtube.com/watch?v=h0B6seIT6EA", "date_published": "2022-07-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "I Heart Dark Souls (ft. Otzdarva, Iron Pineapple, and More!)", "description": "While Dark Souls isn't the first game in FromSoftware's now massively successful Soulsborne series, it was one of the most influential, spawning an entire genre of games influenced by its mechanics dubbed Souls-likes. Dark Souls has also gained passionate fans all around the globe. This is the story of Dark Souls, as told by those fans.\n\nJoin Adam Mason, Brad Ellis of Easy Allies, Caddicarus, Chris Morris, Dave Jewitt, DaveControl, Gav Murphy and Rory Powers of RKG, Super BunnyHop, HeyZeusHeresToast, Iron Pineapple, Jessie Gender, LobosJR, Lucy James and Tamoor Hussain of Giant Bomb, Marz, Otzdarva, Prod, Quelaag, and Sinclair and Sophie of SinclairLore as they tell the story of Dark Souls, and discuss the impact it had on both them and gaming.\n\nThe story of Dark Souls is told through though simple moments like finding shortcuts back to a bonfire in Undead Burg or Firelink Shrine, to the stunning moment when players first reach Anor Londo, to one of Dark Souls steepest challenges in the fight with Ornstein & Smough. The low moments like getting cursed in The Depths, to traversing the treacherous terrain of Blighttown are highlighted, all while leading to that rewarding feeling of overcoming an obstacle that at first felt insurmountable.\n\nLobosJR sings one of his favorite tracks of the game with the Asylum Demon fight, while Marz, Super Bunnyhop, and Sophie sing the famous \"pling pling plong\" of Gwyn's theme. Meanwhile, some curse every moment they spent in PvP, while others share their favorite moments of low-level PvP runs with evil glee.\n\nEnjoy the premiere episode of I ❤️ Gaming with I ❤️ Dark Souls, and let us know what future episodes you'd like to see, and what guests you hope to see on.\n\n#darksouls #gaming #iheartgaming #gamespot", "link": "https://www.youtube.com/watch?v=Y0-OIBXkqsU", "date_published": "2022-07-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Assassin’s Creed Leak Explained | GameSpot News", "description": "New Assassin’s Creed details have leaked, plus Last of Us Part 1 and Nintendo Switch Sports are getting new features.\n#GamingNews #AssassinsCreed #TLoU \n\nKotaku reported on Project Red's existence, while Bloomberg's Jason Schreier said Project Red is part of AC Infinity as opposed to a separate game. Sources speaking to Kotaku said this game, whatever it may be, could be set in Asia. Reporter Jeff Grubb of GameSpot sister site Giant Bomb previously said it may be set in Japan. During an earnings report call, the company mentioned a delay for another \"smaller, premium unannounced title.\" Reports now indicate the game in question is Assassin's Creed Rift, a new standalone AC game that was originally meant to be a DLC episode for Assassin's Creed Valhalla.\n\nNaughty Dog has revealed more details on how the game has been remade for PS5 and PC in a new deep-dive video. While the core gameplay is essentially the same, players can expect graphical upgrades, new features, and enhancements that make the game more accessible. Some of the new features outlined in a PS Blog post include a new permadeath mode, a speedrun mode, an updated photo mode, unlockable costumes for Joel and Ellie, and a model-viewer mode.\n\nNintendo has announced that it will be adding full motion control support for soccer in Switch Sports on July 26. The upcoming free update is scheduled to go live at 6PM PT / 9PM ET and will include a number of new features including the ability for players to use the motion of their legs to kick the soccer ball in-game when using the leg strap accessory. Players will also be able to use their hands by jogging in place to dash in-game. Nintendo explained that playing this way will translate users' in-game kicks to be more powerful.\n\nSTAMPS\n00:00 - Intro\n00:08 - Assassin’s Creed\n01:43 - The Last of Us Part 1\n02:49 - Nintendo Switch Sports", "link": "https://www.youtube.com/watch?v=oQkj4FSX5Y8", "date_published": "2022-07-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Last of Us Part I - Official Features and Gameplay Overview Trailer", "description": "Take a look at some new gameplay for The Last Of Us Part 1 from the team at Naughty Dog. Co-President Neil Druckmann, Game Director Matthew Gallan, Creative Director and Writer Shaun Escayg showcase how the game was rebuilt for the PS5, and detail accessibility options, changes to gameplay, visual enhancements and more. The Last Of Us Part 1 launches on September 2 for PlayStation 5.\n\n#thelastofus #playstation5 #gaming", "link": "https://www.youtube.com/watch?v=AS2Kt7waNQo", "date_published": "2022-07-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Will Resident Evil 4 Remake Learn from the Mistakes of RE3? | GameSpot After Dark Episode 154", "description": "This week we talk about the cat game, our hopes and concerns for Resident Evil 4 remake, and why modern Assassin's Creed is so boring.\n\n0:00:00 -  Intro\n0:03:26 - Escape Academy\n0:13:56 - Poinpy\n0:17:15 - Into the Breach\n0:31:08 - PowerWash Simulator\n0:40:07 - Stray\n0:48:21 - The Modern Assassin's Creed is Boring Rant\n1:15:06 - Resident Evil 3 Remake\n01:22:06 - Are We Worried About Resident Evil 4 Remake?\n01:27:12 - Outro\n\n#gaming #gamespotafterdark #residentevil", "link": "https://www.youtube.com/watch?v=7higQtCTDIg", "date_published": "2022-07-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Free GTA Online Expansion Announced | GameSpot News", "description": "GTA Online is getting a free update called Criminal Enterprises, Ubisoft has announced a delay of Avatar: Frontiers of Pandora and Dragon Ball: The Breakers has gotten an official release date.\n#GamingNews #GTA #DragonBall \n\nGTA Online’s next free expansion is called Criminal Enterprises. In the expansion you will take on a new mission called Operation Paper Trail as an agent of the International Affairs Agency to see if the Duggan petrochemical family are deliberately manipulating the fuel market. Rockstar says fans should keep an eye out for a \"comprehensive list\" of \"new gameplay and experience improvements\" across all of GTA Online. The developer will share further details on the gameplay and balance changes for the Criminal Enterprises expansion on July 26 when the expansion arrives. As usual, this new update is coming to PS5, PS4, Xbox One, Xbox Series X|S, and PC, but not PS3 or Xbox 360.\n\nIn other news, Bandai Namco has confirmed Dragon Ball: The Breakers will release on October 14. The game pits seven \"survivors\"--non-powered human characters--against one player controlling iconic villains (or Raiders) from across the Dragon Ball universe. The seven must survive until the end of the match, using items and perks against the villain, who wins by eliminating all other players. \n\nA closed network test for Dragon Ball: The Breakers was also confirmed, which will take place on August 5-6 across four sessions. The times for those sessions is as follows: \n\nAugust 5\n7 PM PT / 10 PM ET to 11 PM PT / 2 AM ET\n\nAugust 6\n5 AM PT / 8 AM ET to 9 AM PT / 12 PM ET\n11 AM PT / 2 PM ET to 3 PM PT / 6 PM ET\n7 PM PT / 10 PM ET to 11 PM PT / 2 AM ET\n\nAnnounced today as part of its earnings briefing, Ubisoft revealed the new Avatar game will not launch on schedule and is now aiming for release next fiscal year which begins April 1 2023 and ends June 30, 2024.\nSTAMPS\n00:00 - Intro\n00:10 - GTA Online\n01:56 - Dragon Ball: The Breakers\n02:50 - Avatar: Frontiers of Pandora", "link": "https://www.youtube.com/watch?v=hhBPMxDdSLQ", "date_published": "2022-07-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Gotham Knights Official Batgirl Character Trailer", "description": "Learn more about Batgirl in this latest character trailer showcasing her moves, and much more.\n\nGotham City still has a Bat, and she’s going to make sure everyone knows it. Protecting people runs in her veins and will always be a part of who she is, no matter her identity. The people of Gotham need a symbol to believe in, and there’s no one better than Batgirl to be that symbol. \n\nGothem Knights is releasing October 25th, 2022 on Xbox Series X and S, PlayStation 5 and PC.\n\n#gothamknights #batgirl #gaming", "link": "https://www.youtube.com/watch?v=NqMhn9IhZJA", "date_published": "2022-07-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Live A Live Video Review", "description": "Live A Live is a beautiful remake of an overlooked classic that should not be missed by JRPG fans.\n\n#livealive #gaming #review", "link": "https://www.youtube.com/watch?v=fa6EC6GMwh0", "date_published": "2022-07-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Saints Row Hands-on Preview", "description": "The new Saints Row feels a lot like a game from a different era, but with a bunch of additions that make it more than just a nostalgic return to the past.\n\nWe played about four hours of Saints Row at a recent preview event, which encompassed the beginning of the game. As with the original Saints Row, the new game is all about creating your own criminal empire--but you have a long way to go before that happens. It's set in the new city of Santo Ileso, a fictional location in the United States' Southwest that mixes an urban center, suburbs, and desert locations, and carries the vibe of places such as Las Vegas or Albequrque, without being quite like either.\n \nThough we know you're eventually going to become a crime kingpin, the game starts with your humble beginnings, when your character is living in a dingy apartment with three friends: mechanic and driving wiz Neenah, entrepreneurial expert Eli, and shirtless DJ and resident cook Kev. Everyone in the group is familiar with petty crime, and both Neenah and Kev are members of local gangs. Neenah's with Los Panteros, a gang that's focused on cars and weight-lifting, while Kev hangs around with the Idols, a band of techno-anarchists who believe in a decentralized future. You're a member of the third \"gang\" in town, and the only legitimate one: a private military corporation called Marshall Defense Industries.\n\nSo at the start of Saints Row, your goal is to climb the corporate ladder as a mercenary at Marshall, mostly focused on bringing home enough rent money to keep you and your friends from eviction. Trying to find a way to \"pull yourself up by your bootstraps\" and fight an economic system stacked against you is a pretty pervasive theme in Saints Row--at one point, Neenah mentions the driving force for her doing crimes is to earn money to pay off her student loans. Your character is already a talented killer full of bravado, so the opportunity to earn bonus pay for performing well incentivizes you to become a one-person maverick murder machine.", "link": "https://www.youtube.com/watch?v=J7e40_DjGoU", "date_published": "2022-07-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]