[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Allison Russell: Tiny Desk Concert", "description": "Ann Powers: September 14, 2022 \n“I am grateful and I am proud for this circle of goddesses,” said Allison Russell during her joyful, rousing Tiny Desk set, reaching toward the six women surrounding her. Russell has cultivated this band’s harmoniousness in the year she’s been touring in support of her astounding, unclassifiable album Outside Child, which tells the singer’s life story, from her childhood escaping abuse through an itinerant adolescence and young adulthood anchored, finally, by the love and community she’s found as a feminist and a music-maker. This group — three string players, two guitarists, a drummer and Russell on her banjo and clarinet — embodies healing community, and its interplay and gospelized group vocals turbo-charged every song.\n \nRussell, who burned a little palo santo wood and placed portraits of Prince and Joni Mitchell nearby as talismans before performing, began her set by invoking the ancestors with “Quasheba.” She continued with the incantatory “4th Day Prayer,” a spell cast to undo the oppression of childhood trauma. The intense interplay of cellists Larissa Maestro and Monique Ross and violinist Chauntee Ross undergirded the propulsive arrangement. The blues-rooted “Nightflyer” followed; drummer Megan Coleman’s green satin angel-wing sleeves shimmered as she marked a beat that guitarists Joy Clark and Mandy Fer intensified. Then came “You’re Not Alone,” a song Russell originally wrote as part of the Americana supergroup Our Native Daughters, just rereleased as a duet with Brandi Carlile. “La musique nous réunit / Une famille,” Russell sang in Québécois French. “A family,” she repeated. That’s what her music makes.\n\nSET LIST\n“Quasheba”\n“4th Day Prayer”\n“Nightflyer”\n“You’re Not Alone”\n\nMUSICIANS\nAllison Russell: lead vocals, banjo, clarinet\nMonique Ross: cello, vocals\nChauntee Ross: violin, vocals\nLarissa Maestro: cello, vocals\nMandy Fer: electric guitar, vocals\nJoy Clark: acoustic guitar, vocals\nMegan Coleman: drums\n\nTINY DESK TEAM\nProducer/Series Creator: Bob Boilen \nAudio Engineer: Josh Rogosin \nDirector: Kara Frame \nSeries Producer: Bobby Carter \nEditor: Joshua Bryant\nVideographers: Kara Frame, Michael Zamora, Joshua Bryant\nAudio Assistant: Neil Tevault\nProduction Assistants: Joby Tanseco, Jill Britton\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#TinyDesk #NPRMusic #AllisonRussell", "link": "https://www.youtube.com/watch?v=Ffs7szmBmCU", "date_published": "2022-09-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]