[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "APPLE-LIKE battery life on LINUX! Tuxedo Pulse 15 (2022) Review", "description": "Make sure your Python applications stay relevant for longer: https://bit.ly/3CyfKnL \nGrab a brand new laptop or desktop running Linux:https://www.tuxedocomputers.com/en#\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to a weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYouTube: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n📹 MORE VIDEOS FROM ME\nLinux news in Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\nGaming on Linux: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nI'm also on ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n🏆 FOLLOW ME ELSEWHERE:\nTwitter : http://twitter.com/thelinuxEXP\nMastodon: https://mastodon.social/web/@thelinuxEXP\nPixelfed: https://pixelfed.social/TLENick\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\nThis video is distributed under the Creative Commons Share Alike license.\n\n#linux #laptop #tuxedo \n\n00:00 Intro\n00:32 Sponsor: Extend the life of your Python apps with TuxCare\n01:23 Battery Life & Performance\n04:20 Build Quality & I/O\n07:08 Keyboard and touchpad\n08:39 Display\n09:23 Webcam, Mic & Speakers\n10:42 Configuration and specs\n12:57 Sponsor: Tuxedo also has other laptops!\n13:43 Support the channel\n\nThis device is 15 inch, and has room to spare inside, which it filled with a 91Wh battery. It also uses a low TDP Ryzen 7 5700U, with 8 cores and 16 threads, and it powers a 1440p screen, which goes up to 165Hz.\n\nPlaying Youtube videos in a loop on the default performance mode, with 50% brightness, over wifi, and the display running at 165Hz, it lasted for 10h.\n\nWhen reducing the refresh rate to 40hz instead, it managed to last for 12 and a half Hours in total.\n\nOn more \"real life\" activities, like writing documents, watching the occasional video, listening to music, and browsing the web, at 165Hz, the Pulse 15 lasted for 12H.\n\nWhen putting it in powersave mode, with the display at 40Hz, and the same activities, it lasted for 14 hours.\n\nSpeaking of performance, the Ryzen 7 5700U is a good option. It works using 35W of power, and on Geekbench, I gets 1254 in single core, and 8113 in multi core.\n\nIt's made of a magnesium and aluminium alloy that doesn't attract fingerprints, and is pretty durable.\n\nIt's also a very lightweight laptop, at 1.5kg.\n\nThe chassis has very minimal deck flex, on the palm rests, and the keyboard, and the only part that felt a little flimsy was the middle of the bottom bezel when opened.\n\nYou can also open the laptop to upgrade the RAM and the SSD. \n\nOn the left, you have a kensington lock, a pop up gigabit ethernet jack, a USB 2.0 port, a USB 3.2 Gen 2 port,an audio jack, and a micro SD card reader.\n\nOn the right, you have the barrel charger, an HDMI 2.0 port, another USB 3.2 Gen 2 pt, and a USB C port that does display port 1.4, and power delivery, although the CPU will only run at 25W when charging through this port.\n\nYou also get Wifi 6, and bluetooth 5.1.\n\nThe keyboard is still excellent. I loved it on my own SLimbook Pro X14, and on the KDE Slimbook I reviewed recently, and I still think it's fantastic now.\n\nThe touchpad is disappointing, though. It's not glass, but it's precise enough, and it works well with gestures. It is, however, not centered, which doesn't make sense if you don't a numpad, as the whole keyboard is centered, and it's a bit small. It could have been expanded a little bit, and it rattles when clicking or dragging your finger.\n\nTHe display is 15.6 inches, 16:9, and it runs at 2560x1440. It covers 95% of sRGB, has a contrast ratio of 800:1, and it gets relatively bright, at 350 nits. It has an anti glare coating, and the viewing angles are great.\n\nThe webcam is hosted on the top bezel, and it's only 720p. It's not atrocious.\n\nTHe microphone isn't bad at all, though. It's no studio mic and you'll get better results with any USB microphone, but it's decent.\n\nAs per the speakers, they're also pretty good, good amount of bass, no distortion even at max volume, they don't sound tinny at all.", "link": "https://www.youtube.com/watch?v=O5IZvAlCzwg", "date_published": "2022-09-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]