[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "14 Biggest Game Releases for March 2022", "description": "Similar to February, March is stacked with great game releases. In this video, DeVante talks about the 14 biggest game releases heading our way this month.\n\nWith March, depending on your place on Earth, comes Spring weather! But no matter where you are, March is also bringing some great games to add to your backlog (we know you’re not done with Horizon and Elden Ring yet).\n\n00:00 - Intro\n00:18 - Babylon's Fall\n01:21 - Gran Turismo 7\n02:21 - Triangle Strategy\n02:48 - AC Valhalla: Dawn of Ragnarok\n03:28 - WWE 2K22\n04:02 - GTA V\n04:14 - Tunic\n04:40 - Persona 4 Arena Ultimax\n05:14 - Stranger Of Paradise Final Fantasy Origin\n05:47 - GhostWire: Tokyo\n06:51 - Kirby and the Forgotten Land\n07:16 - Tiny Tina's Wonderlands\n08:09 - Crusader Kings III\n08:58 - Death Stranding Director's Cut", "link": "https://www.youtube.com/watch?v=kCT61mSrFlc", "date_published": "2022-02-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "8 Minutes Of Elden Ring Running On Steam Deck", "description": "How does FromSoftware's latest run on Valve's new portable PC? Take a look for yourself!\n\nElden Ring and Steam Deck share a launch date, so of course we had to know how the game looks and runs on the system. We set the game to medium graphic settings and get a solid performance outside of the occasional frame hitching, although that issue seems to be PC wide and not Steam deck Specific.\n\nIf you want to know more about the Steam Deck, check out our full review from Alessandro Barbosa who said, \"The Steam Deck is a wonderfully constructed and powerful portable PC that can, in the right hands, be a lot more than what Valve envisions with SteamOS, given your patience to work with Linux or replace it entirely.\"\n\nIf you want to know more about Elden Ring, check out Tamoor Hussain's review in progress. He gave it a 10/10 saying, \"From Software's latest is a masterpiece of open-world design that places exploration and player agency at the heart of the experience.\"\n\n#EldenRing #SteamDeck", "link": "https://www.youtube.com/watch?v=b2yQGgWehqs", "date_published": "2022-02-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Golden Seeds Guide: Where to Find 25", "description": "Golden Seeds are vital items you can find in Elden Ring. You can use Golden Seeds to upgrade your Flasks of Tears and give them more charges. You'll find these Golden Seeds scattered across the Lands Between, throughout Limgrave, Liurnia, Caelid, Atlus Plateau, and more. So here's a starting guide on 25 of them that we found so far. \n\nTime stamps below:\n\n0:00 - Intro\n0:43 - Starting Gift\n0:53 - Limgrave, Fringefolk Hero’s Grave\n1:34 - Limgrave, Stormhill Shack\n1:51 - Limgrave, Weeping Peninsula\n2:05 - Limgrave, Fort Haight\n2:19 - Limgrave, Stormveil Castle\n2:36 - Limgrave, Roderika\n3:21 - Liurnia, Academy Gate Town\n3:42 - Liurnia, Ravine-Veiled Village\n3:59 - Liurnia, Caria Manor\n4:24 - Liurnia, Academy of Raya Lucaria\n4:48 - Siofra River\n5:26 - Caelid, Sellia Town of Sorcery\n5:39 - Caelid, Southern Aeonia Swamp Bank\n5:53 - Caelid, War-Dead Catacombs\n6:09 - Atlus Plateau, Erdtree-Gazing Hill\n6:28 - Atlus Plateau, Atlus Highway\n6:45 - Atlus Plateau, Windmill Village\n7:00 - Atlus Plateau, Outer Wall Phantom Tree 1 & 2\n7:22 - Atlus Plateau, Leyndell Tree Spirit\n7:41 - Atlus Plateau, Leyndell West Capital Rampart\n7:56 - Mt. Gelmir, Seethewater River\n8:13 - Mt. Gelmir, Ninth Mt. Gelmir Campsite\n8:30 - Forbidden Lands\n\n#EldenRing", "link": "https://www.youtube.com/watch?v=Qrvxa5WHEh8", "date_published": "2022-02-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring PS5 Saves Being Lost | GameSpot News", "description": "In today’s episode of GameSpot News, Persia talks about Elden Ring losing PS5 saves, Steam Deck 2 already being discussed, and more.\n\nIn a message posted February 25, Bandai Namco said there were several \"main items to be revised\" in Elden Ring, primarily in the PC version, including an issue with the mouse sensitivity being too high, frame rate issues, and more.\n\nOn PS5, save data can be lost if the PS5 shuts off before closing the game--either when it was fully powered or in rest mode--so if you were using rest mode as an artificial pause button, you may want to reconsider.\n\nIf you were among the first batch of people to reserve a Steam Deck last year, make sure you're checking your inbox. Emails began going out at around 10 AM PT / 1 PM ET. Once it arrives, you'll be able to make your final payment, confirm your shipping details, and (barring any delays) likely get your hands on Steam Deck next week. Despite the Steam Deck not quite out yet, there are reportedly already discussions of a Steam Deck 2.\n\nFor all of the Deep Rock Galactic fans out there, the game is celebrating it’s 4 year anniversary with a big in-game event and livestream.\n\nFor more information on all of our topics, please visit gamespot.com.\n\nTimestamps:\n00:06 - Elden Ring Launch Issues\n01:19 - Steamdeck 2 Already Being Planned\n02:28 - Deep Rock Galactic 4 Year Anniversary Announcement", "link": "https://www.youtube.com/watch?v=V_xBp-qRdRU", "date_published": "2022-02-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To MORE Destiny 2 Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down more of the guns from Destiny 2, including The Huckleberry submachine gun, the Sweet Business Minigun, and the conjoined Sturm and Drang pistols.\n\n00:00 - Opening\n00:37 - The Huckleberry\n04:10 - MIDA Multi Tool\n06:05 - Sturm and Drang\n08:44 - Sweet Business\n12:00 - Tommy’s Matchbook\n14:41 - Multimach CCX\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down more of the guns from Destiny 2 and compares them to their potential real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=umgDJwmzfeQ", "date_published": "2022-02-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "7 Reasons Elden Ring Should be Your First Soulsborne", "description": "Still immune to the charms of FromSoftware's iconic and influential 'Soulsborne' games? We've got seven incredibly good reasons why Elden Ring is the game to finally change your mind. (Presented by BANDAI NAMCO)", "link": "https://www.youtube.com/watch?v=cJj85tMEvxo", "date_published": "2022-02-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Where To Go First | Beginners Guide", "description": "Elden Ring is massive and like other FromSoftware games, it can be challenging. Here a guide on where to go first so you don’t get lost or overwhelmed by area you’re not quite ready for.\n\nSo you’ve just stepped foot in Limgrave for the first time and you’re wondering what you should do first. This beginning area of Elden Ring is big and offers lots of things to do as well as secrets to find. With this starter path, you’ll be ready to take on any challenges that come your way.\n\nIn this Elden Ring beginner's guide, we’re taking you step by step from your first Site of Grace to your second, third and beyond. We’re giving you some key locations to visit in order to obtain items that will make your time in The Lands Between even more enjoyable and, at times, less challenging. And for those looking for an easier way to explore Elden Ring’s second location, we show a hidden path that does not involve fighting a boss character.\n\nWe have a separate video to help you choose which Elden Ring class is right for you, as well as more guide content, so make sure you subscribe to GameSpot on YouTube and check out the written versions on gamespot.com. In our Elden Ring review in progress, Tamoor Hussain awarded the game 10/10, calling it \"a masterpiece of open-world design that places exploration and player agency at the heart of the experience.\"\n\n#EldenRing", "link": "https://www.youtube.com/watch?v=PYFN6HZ4-_U", "date_published": "2022-02-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Play Elden Ring Early On Xbox… At Your Own Risk | GameSpot News", "description": "In today’s episode of GameSpot News, Persia talks about a way to play Elden Ring early on Xbox, Elden Ring’s day one patch, and more.\n\nFrom Software's hugely anticipated RPG Elden Ring launches tomorrow, but you may not need to wait until then to start playing. It is already February 25 in some parts of the world, and some gamers have found that changing your Xbox region to, say, New Zealand or Australia, will allow you to start playing Elden Ring right now. This also requires a digital copy of the game and could get you banned, so try this at your own risk.\n\nAnd before you start up Elden Ring for the first time you'll need to download a day-one patch. The patch promises some fixes to various bugs and slight tweaks to elements like player controls and game balance.\n\nSome of the other fixes mentioned were various text and balance adjustments, NPC event fixes, and more. We’ve got the full list for the day one patch on gamespot.com.\n\nMarch 2022's reported Games With Gold lineup includes the post-societal adventure game The Flame in the Flood, the action-based soccer game Street Power Soccer, and the RPG Sacred 2: Fallen Angel. SpongeBob's Truth or Square, which has players using Plankton's memory machine to find the formula to the Krabby Patty secret formula, is also included in March with Games With Gold.\n\n#EldenRing", "link": "https://www.youtube.com/watch?v=saJh-jaiZoM", "date_published": "2022-02-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Steam Deck Review", "description": "The Steam Deck delivers on its promise of high-performance mobile gaming with impressive game performance and an intelligent hardware design.\n\nWith cutting-edge hardware, thoughtfully designed ergonomics, a satisfying controller layout, and a software layer that simplifies PC gaming, the Steam Deck makes it a breeze to link to your Steam account and get started with your library on the go. Better yet, it comes in at a reasonable price, starting at $400 and reaching only $650 for its highest-tier model--essentially half the price of its closest competitors. While that alone is impressive, it's in how well the Steam Deck performs that it becomes clear that it doesn't have much competition at all. With its AMD Zen 2 and RDNA 2 APU, it's head-and-shoulders above the Intel XE and Radeon Vega-powered portable gaming devices that made it to market first, creating a situation where you shouldn't really be looking at an alternative if you can get your hands on a Steam Deck. \n\nThe Steam Deck is now available  You can read the full written Steam Deck review by Alessandro Barbosa on GameSpot.", "link": "https://www.youtube.com/watch?v=6wcZqSXKnAo", "date_published": "2022-02-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]