[{"source": "https://www.theguardian.com/rss", "title": "Leading a hybrid team: four tips to get the best out of your staff – wherever they are", "description": "<p>A mix of remote and in-person work is the new normal for many of us. But as a manager, how do you ensure it’s a success?</p><p>In the past two years or so, we’ve seen dramatic changes to how we work. But now, as we settle into a “new normal”, it’s clear that hybrid working is here to stay.</p><p>For many, this more flexible way of working is a welcome shift. Last year, research published by the <a href=\"https://www.ons.gov.uk/employmentandlabourmarket/peopleinwork/employmentandemployeetypes/articles/businessandindividualattitudestowardsthefutureofhomeworkinguk/apriltomay2021\" rel=\"nofollow\">Office for National Statistics</a> (ONS) found that 85% of employees who were working from home wanted a hybrid approach to work in the future. “It provides a level of flexibility and, if implemented well, gives a really strong balance of autonomy and collaboration,” says <a href=\"http://leechambers.org\" rel=\"nofollow\">Lee Chambers</a>, a business psychologist and founder of Essentialise Workplace Wellbeing.</p> <a href=\"https://www.theguardian.com/hybrid-work-with-hp/2022/jun/10/leading-a-hybrid-team-four-tips-to-get-the-best-out-of-your-staff-wherever-they-are\">Continue reading...</a>", "link": "https://www.theguardian.com/hybrid-work-with-hp/2022/jun/10/leading-a-hybrid-team-four-tips-to-get-the-best-out-of-your-staff-wherever-they-are", "date_published": "2022-06-10 13:28:29+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘Going green is expensive’: and four more sustainable business myths, busted", "description": "<p>Moving towards a net zero future has many benefits for small businesses, and it’s easier and more rewarding than you might think. Here, we address five common misconceptions</p><p>Although the vast majority of small and medium enterprise (SME) founders recognise the importance of sustainability, when it comes to implementing their own green strategy, many find reasons not to do so. Whether it’s the perceived cost, or feeling like their business is too small to make a real difference, taking steps towards net zero can feel overwhelming.</p><p>The truth is, taking your first steps towards sustainability is much easier than you probably think. Don’t believe us? Well, here are five common sustainable business myths, busted.</p> <a href=\"https://www.theguardian.com/green-to-grow-your-business/2022/jun/10/going-green-is-expensive-and-four-more-sustainable-business-myths-busted\">Continue reading...</a>", "link": "https://www.theguardian.com/green-to-grow-your-business/2022/jun/10/going-green-is-expensive-and-four-more-sustainable-business-myths-busted", "date_published": "2022-06-10 13:22:13+00:00", "persistent": false, "user": null, "language": "en-UK"}]