[{"source": "http://rss.cnn.com/rss/edition.rss", "title": "Russians locked Ukrainians in basement for 3 weeks. CNN visits 'horrific' conditions", "description": "CNN's Ed Lavandera visits a Ukrainian village where survivors say Russians rounded up the villagers at gunpoint and locked them in a basement for three weeks.", "link": "https://www.cnn.com/videos/world/2022/04/22/ukraine-russia-school-basement-lavandera-pkg-lead-vpx.cnn", "date_published": "2022-04-22 23:08:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Ukrainians come under fire while fleeing home country", "description": "Humanitarian corridors meant to safely evacuate Ukrainian residents are failing due to a lack of Russian ceasefire. Ukraine's military says residents are coming under fire while trying to leave the country. CNN's Matt Rivers reports.", "link": "https://www.cnn.com/videos/world/2022/04/22/ukrainian-corridors-unsafe-due-to-russian-shelling-rivers-dnt-lead-vpx.cnn", "date_published": "2022-04-22 22:25:29+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Against all odds, a Ukrainian artist and his curators bring 'Fountain of Exhaustion' to Venice", "description": "On the evening on February 24, just hours after Russia launched its full-blown attack on Ukraine, art curator Maria Lanko got into her car and left her home in Kyiv. Unsure of her exact plan, and with a potentially dangerous journey ahead, she packed only a few personal items into her trunk along with 78 bronze funnels belonging to one of the country's most important living artists, Pavlo Makov. Her mission was to drive them out of the country to safety.", "link": "https://www.cnn.com/style/article/ukraine-pavilion-pavlo-makov-venice-biennale/index.html", "date_published": "2022-04-22 21:58:21+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "A new era for travel leaves some travelers confused on masks", "description": "CNN's Pete Muntean put the new, nationwide patchwork of mask rules at airports and transit hubs to the test. This comes after a federal judge in Florida struck down the Biden administration's mask mandate for airplanes and other public transport methods, and a Biden administration official says the order is no longer in effect while the ruling is reviewed.", "link": "https://www.cnn.com/videos/business/2022/04/22/travel-mask-mandate-confusion-muntean-pkg-lead-vpx.cnn", "date_published": "2022-04-22 21:06:06+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Russia acknowledges casualties for the first time since guided-missile cruiser sank", "description": "At least one person was killed and another 27 are missing after the Moskva, the flagship of Russia's Black Sea fleet, sunk earlier this month, according to Russian state media.", "link": "https://www.cnn.com/2022/04/22/europe/moskva-russia-casualties-intl/index.html", "date_published": "2022-04-22 21:03:42+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "This man is trolling his airline with PowerPoint presentations to find his missing bag", "description": "We all know that sinking feeling when you're at baggage reclaim, waiting for your bag to arrive -- and everyone else seems to be getting theirs first. Normally, you're predicting something that won't happen -- your bag pops out just as you think it's lost forever. But some unlucky people's worst fears are realized -- and sometimes, that means losing precious items of huge sentimental value.", "link": "https://www.cnn.com/travel/article/airtag-travel-missing-baggage-aer-lingus/index.html", "date_published": "2022-04-22 20:57:45+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "European Central Bank buckles down on price stability", "description": "European Central Bank President Christine Lagarde says the war in Ukraine has derailed Covid recovery. Now the bank is focused on price stability, taming inflation and ensuring growth is strong.", "link": "https://www.cnn.com/videos/business/2022/04/22/european-central-bank-president-inflation-price-stability-qmb-vpx.cnnbusiness", "date_published": "2022-04-22 20:30:14+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "An American couple traveled to rescue Ukrainian orphans. Their attempt led to a child trafficking investigation", "description": "When Russian bombs started dropping on Ukraine in late February, a country singer half a world away in Nashville says he felt the panic of a parent whose child is in danger.", "link": "https://www.cnn.com/2022/04/22/us/ukraine-orphans-rescue-missions-invs/index.html", "date_published": "2022-04-22 20:23:42+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Montreal Canadiens icon and hockey Hall of Famer Guy Lafleur dies at 70", "description": "Montreal Canadiens icon and Hockey Hall of Famer Guy Lafleur died at age 70, the team announced on Friday.", "link": "https://www.cnn.com/2022/04/22/sport/guy-lafleur-dies-montreal-canadiens-spt-intl/index.html", "date_published": "2022-04-22 16:28:16+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Locked out of classrooms, Afghan girls are taking drastic measures", "description": "When Heela came out tops in her 9th grade school grades last year, the 14-year-old girl ran home full of excitement, bursting to tell her family the happy news.", "link": "https://www.cnn.com/2022/04/22/opinions/afghanistan-taliban-girls-education-media-frogh/index.html", "date_published": "2022-04-22 16:01:39+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Watch: A YouTuber crashed his plane. The FAA said he did it on purpose", "description": "Trevor Jacob posted a YouTube video in December showing him parachuting to safety from a crashing airplane. But now, the FAA says Jacob was \"careless and reckless\" and crashed it on purpose.", "link": "https://www.cnn.com/videos/business/2022/04/22/youtuber-trevor-jacob-crashed-plane-faa-jg-orig.cnn-business", "date_published": "2022-04-22 15:24:35+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Will all eyes on Putin, Navalny's message of resistance is gaining traction", "description": "• The new journalism uncovering poisoning and war crimes", "link": "https://www.cnn.com/2022/04/22/world/who-is-alexey-navalny/index.html", "date_published": "2022-04-22 15:01:39+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "4 ways Russia is trying to prove it can live with sanctions", "description": "Russian President Vladimir Putin has devoted considerable airtime over the past few weeks to reassuring the Russian public that sanctions hurt the West more than they hurt Russia.", "link": "https://www.cnn.com/2022/04/22/business/russia-living-with-sanctions/index.html", "date_published": "2022-04-22 14:55:03+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "New audio reveals McCarthy said Trump admitted bearing some responsibility for Capitol attack", "description": "In the days following the January 6 insurrection, House Minority Leader Kevin McCarthy told Republican lawmakers on a private conference call that then-President Donald Trump had admitted bearing some responsibility for the deadly attack, according to new audio -- a significant admission that sheds light on Trump's mindset in the immediate aftermath of the US Capitol riots.", "link": "https://www.cnn.com/2022/04/22/politics/trump-january-6-responsibility-book/index.html", "date_published": "2022-04-22 14:40:08+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Forest bathing could be the key to feeling better -- and you can even do it at work", "description": "You are walking slowly through a forest with birds gently chirping around you. The wind glides through the trees, and you bend down to scoop up some earth, noticing the aroma.", "link": "https://www.cnn.com/2022/04/22/health/forest-bathing-wellness/index.html", "date_published": "2022-04-22 14:09:13+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "The bloody cell phone of a woman missing in Houston since April 15 has been found", "description": "The family of a 24-year-old woman last seen in Houston on April 15, is pleading for help in finding her after her bloody cell phone was discovered near a park in West Houston following her disappearance.", "link": "https://www.cnn.com/2022/04/22/us/felicia-marie-johnson-missing-houston/index.html", "date_published": "2022-04-22 14:00:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "January 6 to take center stage at disqualification hearing for Marjorie Taylor Greene", "description": "A potentially precedent-setting disqualification hearing will kick off Friday in an Atlanta courtroom to determine if Republican Rep. Marjorie Taylor Greene of Georgia is constitutionally barred from running for reelection because of her role in the January 6 insurrection.", "link": "https://www.cnn.com/2022/04/22/politics/marjorie-taylor-greene-disqualification/index.html", "date_published": "2022-04-22 13:47:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Over 4 million in the Southwest face an 'extremely critical' fire danger Friday as strong winds hit region", "description": "Hot, dry and windy conditions mean some drought-stricken areas of the Southwest face an \"extremely critical\" threat of fire Friday, from central and eastern New Mexico to eastern Colorado, including Denver.", "link": "https://www.cnn.com/2022/04/22/weather/southwest-fire-danger/index.html", "date_published": "2022-04-22 13:39:16+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Nicolas Cage shows off his silly side playing himself (sort of) with 'Massive Talent'", "description": "Nicolas Cage appears to have a great time spoofing his career in \"The Unbearable Weight of Massive Talent,\" but unlike many movies about Hollywood, audiences should have tons of fun too. Flanked by a very funny Pedro Pascal, the movie nearly buckles under its own weight at times but possesses enough goofy charm to validate this breezy exercise in Cage unleashed.", "link": "https://www.cnn.com/2022/04/22/entertainment/unbearable-weight-of-massive-talent-review/index.html", "date_published": "2022-04-22 13:29:04+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "We need to do more to prevent burnout among health care workers", "description": "Almost two decades ago, I was a resident physician working in the Cardiac Intensive Care Unit at Johns Hopkins Bayview when I got word that my mother had been diagnosed with metastatic breast cancer. Despite feeling supported by those in my residency program, my first instinct was not to fly to India to be with her as soon as possible. Instead, I thought about what would happen to my patients and how much of a burden I would be putting on my fellow residents who would be pulled from other rotations to cover my shifts. I finished up my shifts and by the time I got to India, she had already undergone surgery.", "link": "https://www.cnn.com/2022/04/22/perspectives/physician-mental-health/index.html", "date_published": "2022-04-22 13:20:43+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "'The sound of money': Wind energy is booming in deep-red Republican states", "description": "Driving west from Oklahoma City to the outskirts of Weatherford, wind turbines don't just dot the landscape; they dominate it.", "link": "https://www.cnn.com/2022/04/22/politics/wind-energy-oklahoma-republican-states-climate/index.html", "date_published": "2022-04-22 13:20:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Listen to Navalny's moving message to the Russian people", "description": "\"Navalny\" premieres Sunday, April 24, at 9 p.m. ET on CNN. The fly-on-the-wall documentary follows Russian opposition leader Alexey Navalny through his political rise, poisoning and search for the truth.", "link": "https://www.cnn.com/videos/world/2022/04/19/navalny-message-to-russians-origseriesfilms-5.cnn", "date_published": "2022-04-22 13:05:36+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Scientists restart Large Hadron Collider in quest for dark matter", "description": "Deep underneath the Alps, on the Swiss-French border, something significant just happened in the world of physics. The Large Hadron Collider, Earth's most powerful particle accelerator, was restarted on Friday morning after a three-year hiatus for upgrades.", "link": "https://www.cnn.com/2022/04/22/world/hadron-collider-relaunch-scli-intl-scn/index.html", "date_published": "2022-04-22 13:04:13+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Cristiano Ronaldo returns home with his newborn daughter after the death of her twin brother", "description": "Football superstar Cristiano Ronaldo said on Instagram that his partner, Georgina Rodríguez, and their newborn daughter returned home on Thursday following the death of their newborn son.", "link": "https://www.cnn.com/2022/04/22/football/cristiano-ronaldo-newborn-daughter-son-spt-intl/index.html", "date_published": "2022-04-22 13:04:06+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Former Kenyan President Mwai Kibaki dies at 90", "description": "Mwai Kibaki, one of the biggest names in Kenyan politics and the nation's third president, has died, Kenyan President Uhuru Kenyatta has announced. He was 90.", "link": "https://www.cnn.com/2022/04/22/africa/kenya-mwai-kibaki-obit-intl/index.html", "date_published": "2022-04-22 12:58:23+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Yes, your kid can change the world. Here's how", "description": "It has become harder for children to experience childhood as a time of blissful ignorance about the state of our planet. Climate change, racism, discrimination, poverty and gun violence are affecting their daily lives, giving them plenty to be upset about it and often inspiring them to fight for change. Role models such as Greta Thunberg and Malala Yousafzai prove that sometimes when kids take action, adults listen.", "link": "https://www.cnn.com/2022/04/22/health/kids-activism-parenting-wellness/index.html", "date_published": "2022-04-22 12:54:56+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Fighting fewer colds, some travelers will still mask while flying", "description": "Jessie Festa was seated on an Alaska Airlines flight at Seattle-Tacoma International Airport waiting to take off for Pasco, Washington, when a flight attendant announced wearing masks during the flight was no longer required.", "link": "https://www.cnn.com/travel/article/travelers-still-masking-wellness/index.html", "date_published": "2022-04-22 12:40:39+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "More companies look to ventilation systems to control the spread of Covid-19 and other viruses", "description": "Americans are abandoning their masks. They're done with physical distancing. And, let's face it, some people are just never going to get vaccinated.", "link": "https://www.cnn.com/2022/04/22/health/ventilation-covid-companies-khn/index.html", "date_published": "2022-04-22 12:20:47+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Struggling factories and booming airlines put Fed in a bind", "description": "How should policymakers react when two core parts of the economy are headed in different directions?", "link": "https://www.cnn.com/2022/04/22/investing/premarket-stocks-trading/index.html", "date_published": "2022-04-22 11:44:36+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Didier Drogba: Chelsea great hopes club's new owners can 'carry on the vision and passion of the fans'", "description": "Chelsea great Didier Drogba has said he hopes the club's new owners, whoever they will be, will \"carry on the vision and the passion of the of the fans.\"", "link": "https://www.cnn.com/2022/04/22/football/didier-drogba-chelsea-ivory-coast-spt-intl/index.html", "date_published": "2022-04-22 11:19:08+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Republicans build momentum as they drive anti-LGBTQ legislation nationwide", "description": "Former President Donald Trump recently likened teaching kids about gender and pronouns to \"child abuse.\"", "link": "https://www.cnn.com/2022/04/22/politics/republicans-anti-lgbtq-legislation/index.html", "date_published": "2022-04-22 11:02:12+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Netflix may clamp down on password sharing. Here's what that means", "description": "Netflix shares plunged this week after the platform reported its first subscriber loss in more than a decade. One factor the company pointed to as hurting revenue: widespread password sharing.", "link": "https://www.cnn.com/2022/04/22/media/netflix-passwords-sharing/index.html", "date_published": "2022-04-22 10:33:43+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Residents of embattled Donbas village are determined to stay", "description": "Galina Nikolaevna is weeping in the wreckage of her home in the village of Kamyshevakha in the Donbas region of eastern Ukraine. Two days ago, a couple of Russian shells landed on the house and the garage, making it uninhabitable.", "link": "https://www.cnn.com/2022/04/21/europe/ukraine-russia-donbas-on-the-ground-intl-cmd/index.html", "date_published": "2022-04-22 10:33:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Russian tennis star Andrey Rublev says Wimbledon ban is 'illogical' and 'discriminatory'", "description": "Russian tennis star Andrey Rublev said that the decision made by Wimbledon organizers to ban Russian and Belarusian players from competing because of the war in Ukraine is \"illogical\" and amounts to \"complete discrimination.\"", "link": "https://www.cnn.com/2022/04/22/tennis/andrey-rublev-wimbledon-russia-belarus-ban-spt-intl/index.html", "date_published": "2022-04-22 10:28:16+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "A vitriolic election campaign marked by anti-Islam narratives has left many French Muslims feeling marginalized", "description": "", "link": "https://www.cnn.com/collections/intl-french-election-0422/", "date_published": "2022-04-22 10:23:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "To my son, born during the climate crisis: Get mad and get ready", "description": "Dear River,", "link": "https://www.cnn.com/travel/article/climate-change-bill-weir-letter-to-son-wt-scn/index.html", "date_published": "2022-04-22 10:13:46+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "She defied the odds to lead the first all-women fishing cooperative. Now they stand to lose it all", "description": "The Zambezi River is one of the largest bodies of water in Africa. It rises in Zambia, then it curves, snake-like on its 2,500km journey first to the west through Angola, skimming Namibia and Botswana, then flowing south along the border between Zambia and Zimbabwe, before finally running eastward through Mozambique, heading for the ocean.", "link": "https://www.cnn.com/2022/04/22/africa/as-equals-zambezi-river-women-fishing-zimbabwe-climate-intl-cmd/index.html", "date_published": "2022-04-22 10:04:47+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "'We don't realize how strong we actually are': How Alexey Navalny became Russia's opposition leader", "description": "Russian opposition leader. Anti-corruption campaigner. Assassination attempt survivor. Prisoner.", "link": "https://www.cnn.com/2022/04/22/politics/who-is-alexey-navalny/index.html", "date_published": "2022-04-22 10:02:50+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Portuguese prosecutors say man named formal suspect in McCann case", "description": "Portuguese prosecutors said on Thursday a man had been formally identified as a suspect in the disappearance of British toddler Madeleine McCann 15 years ago.", "link": "https://www.cnn.com/2022/04/22/world/madeleine-mccann-case-portuguese-formal-suspect-intl-scli/index.html", "date_published": "2022-04-22 09:59:02+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Chinese officials slam YouTube for removing account of Hong Kong's expected next leader", "description": "Chinese officials have slammed YouTube for taking down the account of a politician expected to become the next leader of Hong Kong, accusing the video sharing company of interfering in the country's internal affairs.", "link": "https://www.cnn.com/2022/04/22/tech/hong-kong-beijing-youtube-john-lee-intl-hnk/index.html", "date_published": "2022-04-22 09:29:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Venice to charge daytrippers €10 to enter", "description": "As the poster child for overtourism, Venice has long been a city of mounting lines, uncomfortable crowding and mushrooming Airbnbs which are blamed for pricing locals out of the city.", "link": "https://www.cnn.com/travel/article/venice-entry-reservation-fee/index.html", "date_published": "2022-04-22 09:10:12+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Budweiser brewer AB InBev is selling its stake in 11 Russian breweries", "description": "Anheuser-Busch InBev said on Friday it would sell its stake in Russian joint-venture AB InBev Efes which will result in a $1.1 billion impairment charge in its first quarter results.", "link": "https://www.cnn.com/2022/04/22/business/budweiser-russian-breweries/index.html", "date_published": "2022-04-22 08:54:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Hong Kong museum removes controversial Tiananmen painting", "description": "For the last three months, Hong Kong's art galleries have been closed to the public as part of failed efforts to curtail the Omicron variant's charge through the city. But as restrictions eased Thursday, visitors returned to one museum to find some works from its contemporary Chinese art collection conspicuously absent.", "link": "https://www.cnn.com/style/article/m-museum-tiananmen-painting/index.html", "date_published": "2022-04-22 08:29:21+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "If we want to solve climate change, businesses need to invest in our planet", "description": "Environmentalists' traditional role is to hold governments and corporations accountable and to inform, motivate and engage the broader public of the dangers posed by government inaction or corporate malfeasance. And our relationships with both government and business have often been uneasy.", "link": "https://www.cnn.com/2022/04/22/opinions/kathleen-rogers-earth-day-climate-business-invest-planet-scn-c2e/index.html", "date_published": "2022-04-22 08:13:57+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "'How could it be this bad?' Hong Kong and Shanghai's global standing diminishes", "description": "The glittering skylines of Hong Kong and Shanghai have long been associated with wealth and glamor.", "link": "https://www.cnn.com/2022/04/22/china/china-hubs-shanghai-hong-kong-covid-intl-hnk-mic/index.html", "date_published": "2022-04-22 08:04:17+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Tiger Woods-designed golf course opening in Florida", "description": "Tiger Woods announced that he has designed two 18-hole putting courses at the PopStroke Sarasota entertainment center in Florida scheduled to open on April 28.", "link": "https://www.cnn.com/2022/04/22/golf/tiger-woods-putting-course-opening-spt-intl/index.html", "date_published": "2022-04-22 07:58:52+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Tyson Fury vs. Dillian Whyte: 94,000 fans to watch the biggest heavyweight fight of the 21st century", "description": "\"Who would have thought it?\" Tyson Fury asked, almost incredulous. \"Even we didn't think we'd be doing 90-odd thousand at Wembley.\"", "link": "https://www.cnn.com/2022/04/22/sport/tyson-fury-dillian-whyte-wembley-stadium-spt-intl/index.html", "date_published": "2022-04-22 07:54:10+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "This wildlife photographer doesn't just shoot landscapes -- she's changing them at the same time", "description": "Emma Gatland grabbed her fish-eye lens and pointed it up towards the sky.", "link": "https://www.cnn.com/travel/article/emma-gatland-photographer-scn-south-africa-wildlife-spc-intl/index.html", "date_published": "2022-04-22 07:39:59+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "CO2 is causing wild weather swings in Europe", "description": "Europe swung from unusually cold temperatures in the spring to its hottest summer on record last year, smashing temperature and daily rain records, while Mediterranean wildfires burned through land around the size of Cyprus.", "link": "https://www.cnn.com/2022/04/22/europe/europe-climate-copernicus-summer-2021-intl/index.html", "date_published": "2022-04-22 07:17:09+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Chinese court sentences US citizen Shadeed Abdulmateen to death for murder", "description": "A Chinese court sentenced an American citizen to death on Thursday for allegedly murdering his former girlfriend, state media reported.", "link": "https://www.cnn.com/2022/04/22/china/shadeed-abdulmateen-death-sentence-china-us-citizen-intl-hnk/index.html", "date_published": "2022-04-22 04:44:19+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Russian troops use rape as 'an instrument of war' in Ukraine, rights groups allege", "description": "When Russian troops invaded Ukraine and began closing in on its capital, Kyiv, Andrii Dereko begged his 22-year-old stepdaughter Karina Yershova to leave the suburb where she lived.", "link": "https://www.cnn.com/2022/04/22/europe/ukraine-sexual-violence-allegations-russia-cmd-intl/index.html", "date_published": "2022-04-22 04:20:39+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "'The city completely lost its shine': Expats vent about Shanghai's strict Covid measures", "description": "In Shanghai, once seen as a haven for foreigners, there is a sudden rush to get out. Harsh Covid restrictions are not only crushing social freedoms and grounding businesses to a halt in the financial hub, but they're also making access to basic necessities near impossible for some. CNN's David Culver talks to quarantined expats about what they're experiencing.", "link": "https://www.cnn.com/videos/world/2022/04/21/shanghai-china-covid-expat-exodus-culver-dnt-ac360-vpx.cnn", "date_published": "2022-04-22 01:30:17+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "'People praying as hell rains down': CNN reporter shows the reality of life beneath bombardment", "description": "A dozen people hide in the basement of a bombed-out theater in Rubizhne, Ukraine. They are constantly terrorized by the sounds of war. CNN's Ben Wedeman reports.", "link": "https://www.cnn.com/videos/world/2022/04/22/ukraine-rubizhne-civilians-trapped-in-theater-pkg-ac360-wedeman-vpx-intl.cnn", "date_published": "2022-04-22 01:09:15+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Iconic horror movie prop can be yours for a scary price", "description": "How much would you bid for an ax used in one of the most iconic horror movies of all time? CNN's Jeanne Moos reports that the ax from \"The Shining\" won't kill you -- though the price might.", "link": "https://www.cnn.com/videos/business/2022/04/21/shining-ax-auction-moos-orig-gr-vpx.cnn", "date_published": "2022-04-22 00:31:43+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/edition.rss", "title": "Obama warns the foundation of democracy is at risk like never before", "description": "Former President Barack Obama called on tech companies to provide greater transparency about the way they promote content and for stricter regulation of the industry to combat what he called the \"disinformation problem.\" CNN's Donie O'Sullivan has more.", "link": "https://www.cnn.com/videos/business/2022/04/21/obama-disinformation-speech-osullivan-pkg-ebof-vpx.cnn", "date_published": "2022-04-22 00:11:52+00:00", "persistent": false, "user": null, "language": "en-US"}]