[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCHnyfMqiRRG1u-2MsSQLbXA", "title": "The Man Who Accidentally Killed The Most People In History", "description": "One scientist caused two environmental disasters and the deaths of millions. A part of this video is sponsored by Wren. Offset your carbon footprint on Wren: ​https://www.wren.co/start/veritasium. For the first 100 people who sign up, I will personally pay for the first month of your subscription!\n\nMassive thanks to Prof. Francois Tissot for suggesting we make a video on the topic of isotope geochemistry. Huge thanks to Prof. Bruce Lanphear for consulting with us on lead and cardiovascular diseases. Thanks to the Caltech Archives for the audio of Patterson’s interview. Thanks to Vincent Mai for lending us your Snatoms kit. Thanks to Rayner Moss for the help with the fire-piston.\n\nPatterson’s 1995 interview audio courtesy of the Archives, California Institute of Technology.\n\n▀▀▀\nOther great resources you should check out:\nBill Bryson has a chapter in his fantastic “A Short History of Nearly Everything”\nRadiolab have a wonderful podcast: https://www.wnycstudios.org/podcasts/...\nCosmos: A Spacetime Odyssey has a wonderful episode – S1E7 which does a great job of telling the story of Clair Patterson\nA fantastic Mental floss article – https://www.mentalfloss.com/article/9...\n\n▀▀▀\nReferences:\n\nMuch of the lead-crime hypothesis data is from Rick Nevin’s work – https://ricknevin.com/\n\nWHO factsheet on lead poisoning – https://www.who.int/news-room/fact-sh...\n\nWHO press release about the end of leaded gasoline https://news.un.org/en/story/2021/08/...\n\nUNICEF report – https://ve42.co/UNICEF\n\nNeedleman, H. (2004). Lead poisoning. Annu. Rev. Med., 55, 209-222. https://ve42.co/Needleman1\n\nNeedleman, H. L. (1991). Human lead exposure. CRC Press. https://ve42.co/Needleman2\n\nNeedleman, H. L. et al. (1979). Deficits in psychologic and classroom performance of children with elevated dentine lead levels. New England journal of medicine, 300(13), 689-695. – https://ve42.co/Needleman3\n\nNeedleman, H. L. et al. (1996). Bone lead levels and delinquent behavior. Jama, 275(5), 363-369. https://ve42.co/Needleman4\n\nKovarik, W. J. (1993). The ethyl controversy: the news media and the public health debate over leaded gasoline, 1924-1926 https://ve42.co/Kovarik2\n\nEdelmann, F. T. (2016). The life and legacy of Thomas Midgley Jr. In Papers and Proceedings of the Royal Society of Tasmania https://ve42.co/Edelmann\n\nMore, A. F. et al. (2017). Next‐generation ice core technology reveals true minimum natural levels of lead (Pb) in the atmosphere: Insights from the Black Death. GeoHealth, 1(4), 211-219. https://ve42.co/More1\n\nMcFarland, M. J., et al. (2022). PNAS 119(11), e2118631119. https://ve42.co/McFarland\n\nKovarik, W. (2005). Ethyl-leaded gasoline. International Journal of Occupational and Environmental Health, 11(4), 384-397. https://ve42.co/Kovarik3\n\nNevin, R. (2007). Understanding international crime trends: the legacy of preschool lead exposure. Environmental research, 104(3), 315-336. – https://ve42.co/Nevin2007\n\nEricson, J. E., et al. (1979). Skeletal concentrations of lead in ancient Peruvians. New England Journal of Medicine, 300(17), 946-951. – https://ve42.co/Ericson1\n\nPatterson, Claire. The Isotopic Composition of Trace Quantities of Lead and Calcium https://ve42.co/Patterson1\n\nBoutron, C. F., & Patterson, C. C. (1986). Lead concentration changes in Antarctic ice during the Wisconsin/Holocene transition. Nature, 323(6085), 222-225. – https://ve42.co/Boulton1\n\nPatterson, C. (1956). Age of meteorites and the earth. Geochimica et Cosmochimica Acta, 10(4), 230-237. – https://ve42.co/Patterson2\n\nLanphear, B. P. et al (2018). Low-level lead exposure and mortality in US adults: a population-based cohort study. The Lancet Public Health, 3(4), e177-e184. – https://ve42.co/Lanphear1\n\nSchaule, B. K., & Patterson, C. C. (1981). Lead concentrations in the northeast Pacific: evidence for global anthropogenic perturbations. Earth and Planetary Science Letters, 54(1), 97-116. – https://ve42.co/Schaule1\n\n▀▀▀\nSpecial thanks to Patreon supporters: Inconcision, Kelly Snook, TTST, Ross McCawley, Balkrishna Heroor, Chris LaClair, Avi Yashchin, John H. Austin, Jr., OnlineBookClub.org, Dmitry Kuzmichev, Matthew Gonzalez, Eric Sexton, john kiehl, Anton Ragin, Diffbot, Micah Mangione, MJP, Gnare, Dave Kircher, Burt Humburg, Blake Byers, Dumky, Evgeny Skvortsov, Meekay, Bill Linder, Paul Peijzel, Josh Hibschman, Mac Malkawi, Michael Schneider, jim buckmaster, Juan Benet, Ruslan Khroma, Robert Blum, Richard Sundvall, Lee Redden, Vincent, Stephen Wilcox, Marinus Kuivenhoven, Clayton Greenwell, Michael Krugman, Cy 'kkm' K'Nelson, Sam Lutfi, Ron Neal\n\n▀▀▀\nWritten by Derek Muller, Petr Lebedev, Chris Stewart, and Katie Barnshaw\nEdited by Trenton Oliver\nFilmed by Petr Lebedev\nAnimation by Fabio Albertelli, Jakub Misiek, Ivy Tello, Mike Radjabov, and Caleb Worcester\nSFX by Shaun Clifford\nAdditional video/photos supplied by Getty Images\nMusic from Epidemic Sound\nProduced by Derek Muller, Petr Lebedev, and Emily Zhang", "link": "https://www.youtube.com/watch?v=IV3dnLzthDA", "date_published": "2022-04-22 15:37:40+00:00", "persistent": false, "user": null, "language": null}]