[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "GNOME 42 review: IS THEMING DEAD?", "description": "Download Safing's Portmaster, or subscribe to the SPN, and take control of your network traffic: https://safing.io/portmaster\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n**IF YOU NOTICE DELAYS IN THE VIDEO, THEY'RE LINKED TO PIPEWIRE AND OBS. GNOME 42 PERFORMED SUPER SMOOTHLY, BUT SOMETHING IN THE WAYLAND + PIPEWIRE + OBS STACK MADE THE RECORDINGS STUTTER A LITTLE. SORRY I COULDN'T FIX IT IN TIME** \n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\nYou can also protect your privacy by using this extension from Startpage, each install helps the channel with a small commission: https://add.startpage.com/en/protection/?campaign=4&source=aff \n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:28 Sponsor: Stay in control of your internet connection\n01:11 GNOME Shell's New Theme\n03:59 Libadwaita and the new GTK theme\n08:58 Applications\n12:39 Final Thoughts\n14:20 Sponsor: Get your Linux laptop or desktop!\n15:29 Support the channel\n\n\nGNOME 42 brings a revamped Shell theme. The small arrows that linked each shell popup to their parent element are now gone.  Elements in each menu are now highlighted with a rounded shape, more in line with the rest of the desktop, and submenus are now more closely linked to their parent option, with a nice rounded card over the whole menu.\n\nThe on screen display elements, or OSD, are also a lot smaller, taking that pill shape that other elements have.\n\nDark mode support is also now present, without the need for GNOME tweaks. Switching from light to dark mode has a nice smooth transition effect added to it, and if you use a stock GNOME wallpaper, or one that has a dark variant, it will also be switched accordingly.\n\nThen there's Libadwaita. What it brings is a new GTK theme for default GNOME. Big buttons and tabs are now inline with the headerbar, and don't have a big shape around them. On hover, there's a soft button shape visible around each element, and selected ones area clearly visible. Menus also have a whiter background by default, on the light theme.\n\nIn the various menus, the highlights when hovering over an item are way more noticeable. Search fields feel less heavy, with a less delineated box around them.\n\nIn the various pages of the applications, each element is now on a rounded card, with a soft shadow underneath it. Some items have gained small arrows to indicate there's something you can further configure when clicking on it. In list views, the blue highlights for selected items have been replaced by rounded grey ones, which are definitely more elegant, but also a little less legible. Radio buttons and sliders are also slightly larger, without the thin black stroke that was around them before.\n\nALSO, THANKFULLY, the beige folder icons are GONE. They're now blue, and they look SO much better.\n\nFinal detail, libadwaita makes everything a little bit more zippy and smooth. Things slide and move in a way better fashion, thanks to GPU acceleration in GTK4.\n\nThe first updated app is Files, the file manager. Its new path bar shows more of the path in the same space. It's also clearer that there are more parent folders when the path is long and the window isn't large enough to display it all.\n\nThere's also a new path bar menu, that gives you the same options as a right click inside the folder itself.\n\nNot exactly an app itself, but the screenshot tool has also been completely revamped. It's no longer an application with its own window, it appears as an on screen display element. \n\nThere are also 2 new apps that come as default. The first one is Console, which is replacing the default Terminal app. There's also a new Text Editor, that replaces Gedit, and has the same exact goals: be simpler, with the more powerful alternative available.", "link": "https://www.youtube.com/watch?v=XQrIf3Rkjjs", "date_published": "2022-03-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]