[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "UK, pandemic record infections", "description": "UK infections highest ever in the pandemic so far.\n\nNew Zealand\n\nStop vaccine passes and vaccine mandates for some of the workforce, early April\n\nStopping gathering limits in outdoor settings\n\nRequirements to use the Covid-19 tracer app when entering businesses.\n\nMichael Plank, Te Pūnaha Matatini and University of Canterbury\n\nVaccines are still hugely effective at preventing severe illness, \n\nbut less effective at stopping people catching and spreading the virus\n\nAt the same time, we now have increasing levels of infection-acquired immunity in the population. \n\nThis means that allowing unvaccinated people into places like cafes and bars doesn’t substantially alter the risk of catching Covid there\n\nAt least as many people will be infected on the way down the mountain as on the way up, \n\nand pressure on our healthcare system is likely to remain high. \n\nKeeping mask rules is crucial to limit transmission\n\nChina\n\nCases, + 4,770\n\nHTTPS://WWW.THEGUARDIAN.COM/WORLD/2022/MAR/22/CHINA-LOCKS-DOWN-CITY-OF-9-MILLION-AND-REPORTS-4000-CASES-AS-OMICRON-TESTS-ZERO-COVID-STRATEGY\n\nCity of Shenyang, (9 million people)\n\nCases, + 47\n\nAll housing compounds under ‘closed management’\n\nLocal lockdowns, mass testing and citywide closures\n\nDozens of officials have been punished or sacked for virus control failures\n\nOnly around half of Chinese aged over 80 have been double-vaccinated\n\nZoe data\n\nhttps://covid.joinzoe.com/data\n\n\nUK official data\n\nhttps://coronavirus.data.gov.uk\n\n\nONS\n\nHTTPS://WWW.ONS.GOV.UK/PEOPLEPOPULATIONANDCOMMUNITY/HEALTHANDSOCIALCARE/CONDITIONSANDDISEASES/ARTICLES/CORONAVIRUSCOVID19/LATESTINSIGHTS\n\nPrevalence\n\n4.87% in England (1 in 20 people) \n\n4.13% in Wales (1 in 25 people) \n\n7.12% in Northern Ireland (1 in 14 people) \n\n7.15% in Scotland (1 in 14 people)", "link": "https://www.youtube.com/watch?v=G8NdUWMeHME", "date_published": "2022-03-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Fourth vaccine dose", "description": "For young healthy adults, MODERNA SUBMITS AMENDMENT TO THE EMERGENCY USE AUTHORIZATION FOR AN ADDITIONAL BOOSTER DOSE OF ITS COVID-19 VACCINE IN THE U.S.\n\n(Pfizer, 65 and older for 4th shot)\n\nhttps://twitter.com/moderna_tx/status/1504628697894113285\n\nhttps://investors.modernatx.com/news/news-details/2022/Moderna-Submits-Amendment-to-the-Emergency-Use-Authorization-for-an-Additional-Booster-Dose-of-its-COVID-19-Vaccine-in-the-U.S/default.aspx\n\nrequest to the U.S. Food and Drug Administration,\n\nfor an amendment to the emergency use authorization,\n\nto allow for a fourth dose of its COVID-19 vaccine (mRNA-1273),\n\nin adults 18 years of age and older who,\n\nhave received an initial booster of any of the authorized or approved COVID-19 vaccines. \n\n(A booster dose of the Modern, 50 µg authorized for emergency use in the U.S. under EUA for adults 18 years and older)\n\nClinical trials are ongoing for Moderna's Omicron-specific booster (mRNA-1273.529),\n\nand a bivalent Omicron-specific booster (mRNA-1273.214).\n\nQuestions\n\nWill the 4th shot increase antibodies?\n\nIs it an emergency for a healthy 18 year old to get a 4th dose of vaccine today?\n\nCan beneficial endpoints be demonstrated for the individual?\n\nWhat n would be needed to demonstrate these beneficial outcomes?\n\nWill the 4th shot reduce T cell immunity for internal viral proteins?\n\nIf someone has had omicron infection, will a 4th dose increase beneficial outcomes further?\n\nIs it time to end emergency shortcuts and get back to RCTS?\n\nWill there be guarantees a 4th dose will not be mandated once emergency use authorization is granted?\n\nFull FDA Approval of a COVID-19 Vaccine: What You Should Know\n\nhttps://www.hopkinsmedicine.org/health/conditions-and-diseases/coronavirus/full-fda-approval-of-a-covid-19-vaccine-what-you-should-know\n\nThe approval system for vaccines uses scientific data and exacting standards,\nto ensure safe and effective vaccines\nReview processes include\n\nClinical trials\nThe FDA requires rigorous testing of vaccines through a series of clinical trials,\n\nto make sure they work and are safe before authorizing or approving them for the public. \n\nThe laboratories that conduct the trials are independent from the vaccine companies and the government, \n\nprocess is not biased.\n\nRisks and benefits\n\nmust demonstrate that the benefits of a vaccine are greater than its risks for those who will be vaccinated\n\nContinual monitoring\n\nthe FDA may pause the administration of vaccine to do more studies,\n\nand ensure that the problem does not outweigh the vaccine’s benefit.\n\nManufacturing guidelines\n\ntest the vaccine doses in batches (lots),\n\nto ensure the quality and effectiveness of the vaccines remain consistent and reliable.\n\nUK 4th Jab\n\nhttps://www.telegraph.co.uk/news/2022/03/20/fourth-covid-jabs-rolled-five-million-vulnerable-people-starting/?li_source=LI&li_medium=liftigniter-onward-journey\n\nFourth Covid jabs to be rolled out to about five million vulnerable people starting from next week\n\nThe Joint Committee on Vaccinations and Immunisations (JCVI)\n\nhttps://www.gov.uk/government/news/jcvi-advises-a-spring-covid-19-vaccine-dose-for-the-most-vulnerable\n\nAnother dose of Pfizer or Moderna, (six months after third dose)\n\ncare home residents\n\nover-75s\n\nimmunosuppressed people over 12 years", "link": "https://www.youtube.com/watch?v=YqTGD9LHe9g", "date_published": "2022-03-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]