[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Meets SXSW: Pom Pom Squad", "description": "Every year, NPR Music participates in the SXSW music festival, whether it's curating a stage or simply attending hundreds of shows at the annual event in Austin, Texas. In 2020, the festival was canceled due to the pandemic, but it returned last March as an online festival. We programmed a virtual \"stage\" of Tiny Desk (home) concerts in 2021 in a series called Tiny Desk Meets SXSW. This year we return again, virtually, with another round of Tiny Desk Meets SXSW: four videos filmed in various locations, all of them full of surprises.\n\nReanna Cruz | March 23, 2022\nPom Pom Squad's Tiny Desk (home) concert starts with a well-placed sense of irony. The opening chords of \"Drunk Voicemail\" – brash and heavy – tease the band's lead-in, letting imagination conjure up images of dirty basements and scruffy dishevelment before revealing the truth: five people in cheesy, matching red outfits, led by Mia Berrin in puffy plaid. It's a presentation that reflects the ethos of Pom Pom Squad: to give the often self-serious genres of grunge and punk a much-needed dose of silly camp.\n\nDeath of a Cheerleader was one of the most exciting albums of 2021, a modern take on the Sleater-Kinney ethos supercharged with a Ronnie Spector-esque retro sensibility. In its work, the group aims to deconstruct the idea of the \"cheerleader,\" allowing that central trope to make way for subversive choices both in image and in songwriting. Berrin writes romantically, but in a bitter, dissecting way, and her performance sometimes finds her at odds with the instrumentals; as the band tackles the standout track \"Crying,\" Berrin's voice beautifully cracks and strains, adding a dose of reality to the dream-like instrumental behind her – including touring band members Lauren Marquez on bass and Camellia Hartman on violin.\n\nAfter \"Drunk Voicemail,\" Berrin makes it a point to say that she and her band \"grew up on\" watching Tiny Desks over the years, learning about what makes a great live performance from watching. Life imitates art, it seems, because the whole band is performing with a sense of seasoned comfort as it breezes through these five songs, inspiring even the most dour viewer to raise their own pom-poms and cheer it on.\n\nSET LIST\n\"Drunk Voicemail\"\n\"Head Cheerleader\"\n\"Cherry Blossom\"\n\"Crying\"\n\"Be Good\"\n\nMUSICIANS\nMia Berrin: vocals, guitar\nAlex Mercuri: guitar\nShelby Keller: drums\nLauren Marquez: bass\nCamellia Hartman: violin\n\nCREDITS\nDirector: Aysia Marotta & Mia Berrin\nDP/Editor: Aysia Marotta\nCamera Operator: Sara Falco\nSet design: Sinjun Strom\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Joshua Bryant\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Kara Frame, Maia Stern, Ashley Pointer\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #pompomsquad", "link": "https://www.youtube.com/watch?v=ZJe0JcKLWaE", "date_published": "2022-03-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Meets SXSW: KAINA", "description": "Every year, NPR Music participates in the SXSW music festival, whether it's curating a stage or simply attending hundreds of shows at the annual event in Austin, Texas. In 2020, the festival was canceled due to the pandemic, but it returned last March as an online festival. We programmed a virtual \"stage\" of Tiny Desk (home) concerts in 2021 in a series called Tiny Desk Meets SXSW. This year we return again, virtually, with another round of Tiny Desk Meets SXSW: four videos filmed in various locations, all of them full of surprises.\n\nAnamaria Sayre | March 22, 2022\nSetting the scene with a winding tour of the jam-packed gathering of musicians in a mystical recreation of her childhood casita, Chicago-based singer KAINA offers her Tiny Desk (home) concert viewer a temporally unhinged invitation to come over to her house after school.\n\nIt doesn't take much to imagine what it was like in the vocalist's childhood home: salsa bouncing off the walls, arepas flowing from the kitchen, no one allowed to go home unfed (thanks in part to her Venezuelan and Guatemalan parents). KAINA is channeling that same casita-born energy into her performance here. She opens the performance with the title track to her new album, \"It Was a Home,\" a twinkly piece complete with nostalgic riffs and soft percussion. She mentions that she was featured in Saba's 2018 Tiny Desk, but this is her first time owning the performance herself — and she hardly takes a beat after the song is over to bask in the glory of her center-stage experience before she takes her time naming every person on stage – and off – who built the 15-minute performance. Moving on to her upbeat, zanier number, \"Apple,\" she brings more \"friends\" (instrumentalists, vocalists and puppets included) on screen for the performance. Closing with a full-bodied, chorally-backed performance of \"Casita,\" she once again takes the time to give the voices around her equal space alongside her own.\n\nBut her community – these featured musicians, the city of Chicago, Latinas across the country – aren't the only people she's elevating here. She's using this space, her casita and this moment in her career to speak to her inner child, as she describes in \"It Was a Home.\" She's assuring her that when she's all grown up she'll use her voice to shine a light on her casita, beseeching the entire world to marvel at its beauty.\n\nSET LIST\n\"It Was a Home\"\n\"Apple\"\n\"Casita\"\n\nMUSICIANS\nKAINA: vocals\nMichael Hilger: keyboards  \nSen Morimoto: keyboard, vocals \nRyan Person: drums \nBrian Sanborn: guitar \nQuinn Cochran: guitar, vocals \nMichael Cantella: bass \nBackground Vocalists: NNAMDÏ, Paige Pohlad, Kara Jackson\n\nCREDITS\nDirected & Produced by: Bitchcraft Collective \nCinematographer: Matt Hatleberg\nEdited by: Jack Cronin\nAudio: Brok Mende\nPuppeteers: Frances Farlee, Ashley De La Torre, Quinn Regan, Izzi Vasquez\nProducer: Kaleb Eisenmann \nExecutive Producers: Saró & Matt Hatleberg \nCo-Directors: Kaden Maloney & Rachel Cole \nUPM: Alexis Vergara\n1st Assistant Director: Erica Martens\nSet Designers: Kaden Maloney, Rachel Cole & Alexis Vergara \nSteadicam Operator: Brian Delisi\nB Cam Operator: Luciana Salinas\n1st Assistant Camera: Doug Birch\nGaffer: Ted Holmwood\nKey Grip: Chris \"Skoach\" Owsiany\nColorist/DIT: Spencer Hagerman\nFriends of Friends Recording\n\nSpecial Thanks:\nBryan Casallo\nPogi Studios \nCamera Ambassador \nAtlas Lighting \nMagnanimous Media \nJosh Jones\n\nTINY DESK TEAM\nProducer: Bob Boilen \nVideo Producer: Joshua Bryant\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Kara Frame, Maia Stern, Ashley Pointer\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #kaina", "link": "https://www.youtube.com/watch?v=jSK5fJpqs5I", "date_published": "2022-03-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]