[{"source": "https://lukesmith.xyz/rss.xml", "title": "Why I Won't Go to Restaurants in 2023", "description": "<figure class=\"titleimg\"><a href=\"https://upload.wikimedia.org/wikipedia/commons/a/a8/Nighthawks_by_Edward_Hopper_1942.jpg\"><img src=\"https://lukesmith.xyz/pix/nighthawks.webp\" /></a></figure>\n\n<p>I&rsquo;ve decided after some consideration <strong>to not go to restaurants at all in 2023</strong>.\nYou can call this a New Year&rsquo;s Resolution.\nIt&rsquo;ll require at least some sacrifice, pain, annoyance to myself and perhaps others, but I&rsquo;m going to stick by it and I think it will have a good effect.</p>\n<p>Restaurants are a drastically over-used creature comfort of the consumerist economy&hellip; even worse, nowadays they&rsquo;re not even comfortable&hellip;</p>\n<p>Especially now that portions are smaller more expensive than ever, it&rsquo;s hard to go to a restaurant without feeling cheated.</p>\n<p>All of this is fortunate, though, since relying on the ease of restaurants is a vice.\nIt is now easier than ever to quit it without missing anything but disappointment.</p>\n<h2 id=\"here-are-the-rules\">Here Are the Rules.</h2>\n<ol>\n<li>When I travel alone, I will flatly never eat at a restaurant, no matter what. I will pack food, or prepare food bought at a grocery store.</li>\n<li>At time when I might usually offer to go to restaurants out with people, I will serve them at home.</li>\n<li>I&rsquo;ll get in the habit of preparing and carrying food&mdash;not snacks&mdash;but food when I will need it. This will include trips.</li>\n<li>If I have not prepared food while out, I will go hungry. Oh well!</li>\n</ol>\n<p>I have even already forewarned people in my life about my adherence to this.</p>\n<p>I&rsquo;m not saying I&rsquo;m going to throw a Richard Stallman-style sperg-out when asked to go to a restaurant, but I will find a novel alternative.\nIf I do go physically to a restaurant with people, obviously I will order nothing and eat nothing, not even free tortilla chips (because it&rsquo;s not just about the money, either).</p>\n<h3 id=\"things-even-worse-that-restaurants\">Things <em>even worse</em> that restaurants</h3>\n\n<figure class=\"titleimg\"><a href=\"https://lukesmith.xyz/pix/grubhub.png\"><img src=\"https://lukesmith.xyz/pix/grubhub.png\" /></a><figcaption>Obviously take-out counts as a restaurant, in fact, is even worse.</figcaption></figure>\n\n<p>There are some things <em>even worse</em> than restaurants that I don&rsquo;t use now and won&rsquo;t start.\n(I say this because some might be tempted to comply with the letter, but not the spirit of the law.)</p>\n<ul>\n<li>I will get no take-out.</li>\n<li>I will buy no food from gas stations, convenience stores or delis.</li>\n<li>I will have no junk food.</li>\n<li>I will also count coffee shops and other such things as restaurants and thus subject to exclusion.</li>\n</ul>\n<h2 id=\"what-not-going-to-restaurants-will-get-me\">What not Going to Restaurants Will Get Me.</h2>\n<p>The first an obvious advantage is that I will be saving money.</p>\n<p>The wider goal is to make sure that I am more comfortable with preparing food for people on short notice, having spontaneous picnics, planning in advance for things and thereby acting less impulsive in food consumption.</p>\n<p>It might be weird to unironically suggest in the 21st century that &ldquo;picnics&rdquo; can be an alternative to restaurants, but however corny they may sound to our ears, they are infinitely more social, customizable and economical.\nDoing all of this make a new habit to permanently displace compulsive restauranting.</p>\n<p>My goal is <strong>not</strong> to minimize alimentary social outings&mdash;but to improve them by minimizing cost and maximizing the possibilities of what I can end up doing.</p>\n<h2 id=\"how-rigorous-will-i-be\">How Rigorous Will I be?</h2>\n<p>People in real life have questioned how rigorous I will be in this resolution.\nI&rsquo;ve said I will reserve the right to go to a restaurant on a highly exceptional occassion which is certainly not a part of everyday habit.</p>\n<p>For example, earlier this year, I went out to a nice restaurant with some friends and subscribers during Linuxfest&mdash;this is the kind of outing/event I might exempt.\nEven in those circumstances, I want to consider social alternatives to restaurant-going though.</p>\n<p>I&rsquo;ve talked to other people and restaurants have become a continuing disappointment to many in the days of shrinkflation.\nSince I can barely go to one and be filled for less than $35, I don&rsquo;t think I&rsquo;m going to look back from this.</p>", "link": "https://lukesmith.xyz/articles/no-restaurants-in-2023/", "date_published": "2022-12-23 23:18:40+00:00", "persistent": false, "user": null, "language": "en-US"}]