[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCaifrB5IrvGNPJmPeVOcqBA", "title": "Nökortorad: Hunt for the Glacier's Eye, 1", "description": "*An edited, illustrated and narrated playthrough of the game Dwarf Fortress*\n\n I hear tell of a place far to the evil north. Crusted with ice and infested with the dead, the dwarves there have perished and rumor has it that the brute that killed them still roams those rime crusted wastes. A mighty feat it'd be for someone to capture that monster. Though, surely none would dare such an insane feat..\n\n--------------------\n\nYou can send fan art to Kruggsmash@gmail.com if you want it featured at the end of the episode OR if you just want me to see it. Please remember to let me know what you'd like to be called when the art is shown and if you have a title for the piece! Also remember that your art is totally valid and if anybody gives you guff about it, i'll kick them right in the ass.\n\n--------------------\n\nThanks to everyone who helped out with this episode!\n\n -Mrs K for her unending support and expert waxwork (she colors all the drawings. With crayons.)\n -Proteenvoice as the voice of Stakud: https://www.fiverr.com/proteenvoice?source=gig_page\n -Ivan Duch for making the theme for Nökortorad: https://ivanduch.com/\n -Rudo for making the title cards: https://ko-fi.com/rudo \n -Heathen for animating lil' Stakud: https://www.deviantart.com/heathendoodles\n -All of my patient, patient patreon patrons who I couldn't do any of this without: https://www.patreon.com/Kruggsmash\n -Anyone who bought any of my overpriced Teespring junk: https://kruggsmashs-bazaar-2.creator-spring.com/?\n -Bay12games and Kitfox for making this amazing game: http://bay12games.com/\n -And of course, you, for watching. Thank you for watching, my bearded bastard.\n\nRunning Waters by Audionautix is licensed under a Creative Commons Attribution 4.0 license. https://creativecommons.org/licenses/by/4.0/\n\nArtist: http://audionautix.com/\n\nSerenity by Audionautix is licensed under a Creative Commons Attribution 4.0 license. https://creativecommons.org/licenses/by/4.0/\n\nArtist: http://audionautix.com/", "link": "https://www.youtube.com/watch?v=Ei0FiG_bPHg", "date_published": "2022-12-23 02:51:13+00:00", "persistent": false, "user": null, "language": "en-US"}]