[{"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Wielka Brytania. Babcia miała dość gotowania za darmo. Pobrała od rodziny opłatę za święta", "description": "63-letnia Brytyjka z Cardiff postanowiła pokryć koszty organizacji świątecznej kolacji z kieszeni zaproszonych na tę okazję bliskich. Stawka pobierana od rodziny nie jest jednak dla wszystkich taka sama - im młodsze pokolenie, tym płaci mniej. Seniorka w wywiadzie dla BBC przyznała, że nie liczy na zysk, a sam sposób pobierania opłaty jest bardzo sprawiedliwy.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-23/wielka-brytania-babcia-miala-dosc-gotowania-za-darmo-pobrala-od-rodziny-oplate-za-swieta/", "date_published": "2022-12-23 21:51:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "USA: Nie żyje czterodniowe dziecko zaatakowane przed psa rodziny", "description": "Nowo narodzona dziewczynka w Arkansas (USA) została zaatakowana przez psa swojej rodziny. Rany okazało się tak poważne, że dziecka nie udało się uratować. Pies został uśpiony.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-23/usa-nie-zyje-czterodniowe-dziecko-zaatakowane-przed-psa-rodziny/", "date_published": "2022-12-23 20:45:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Nowa propagandowa reklama z Rosji. W roli głównej zupa z chomika", "description": "Rosyjska telewizja Russia Today opublikowała nowe wideo, na którym ostrzega Europejczyków przed tegoroczną zimą. Według propagandowego klipu mieszkańcy Starego Kontynentu będą musieli podejmować dramatyczne decyzje, aby przeżyć najbliższe święta.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-23/nowa-propagandowa-reklama-z-rosji-w-roli-glownej-zupa-z-chomika/", "date_published": "2022-12-23 19:45:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Wszedł na Śnieżkę w samych szortach. \"Niektórzy turyści się nie nauczą\"", "description": "Czescy ratownicy górscy opisali niebezpieczną sytuację z udziałem trzech skrajnie nieodpowiedzialnych turystów, z których jeden postanowił zdobyć Śnieżkę w krótkich spodenkach. Mężczyzna przecenił swoje umiejętności - stan jego zdrowia po dojściu na szczyt wymagał interwencji specjalistów.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-23/wszedl-na-sniezke-w-samych-szortach-niektorzy-turysci-sie-nie-naucza/", "date_published": "2022-12-23 17:39:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Wielka Brytania: Urodziła syna w helikopterze. \"Byłam w najlepszym możliwym miejscu\"", "description": "Kobieta z Wielkiej Brytanii urodziła w helikopterze lecącym z Wysp Scilly na kontynent. Na transport lotniczy zdecydowano się w obawie przed komplikacjami w czasie porodu.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-23/wielka-brytania-urodzila-syna-w-helikopterze-bylam-w-najlepszym-mozliwym-miejscu/", "date_published": "2022-12-23 17:24:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "USA: Wygrał na loterii sześć razy. Wszystko zawdzięcza intuicji", "description": "Weteran wojny wietnamskiej gra na loterii od ponad 20 lat. Pewnego grudniowego dnia udał się do sklepu monopolowego w Massachusetts, by oddać los. Intuicja podpowiedziała mu, by nie kupować jednego kuponu, a sześć. Mężczyzna wygrał sześciokrotnie.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-23/usa-wygral-na-loterii-szesc-razy-wszystko-zawdziecza-intuicji/", "date_published": "2022-12-23 16:09:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "RPA. Znalazł śmiertelnie groźny \"prezent\" pod choinką. Czarna mamba pojawiła się tuż przed Wigilią", "description": "Mieszkańcy domu jednorodzinnego w RPA natknęli się na nietypowy prezent pod swoim bożonarodzeniowym drzewkiem - u stóp choinki leżał jadowity wąż - śmiertelnie groźna czarna mamba. Mikołaj zostawił mi wcześniejszy prezent - napisał pod zdjęciem prezentującym schwytanego gada Nick Evans, łowca węży.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-23/rpa-znalazl-smiertelnie-grozny-prezent-pod-choinka-czarna-mamba-pojawila-sie-tuz-przed-wigilia/", "date_published": "2022-12-23 15:48:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Wojna w Ukrainie. Kreml uważa, że Ukraina została \"istotnie zdemilitaryzowana\"", "description": "Rosyjska władza uważa, że udało jej się osiągnąć istotny postęp w jednym z wyznaczonych celów wojny przeciw Ukrainie - przekazał portal Ukraińska Prawda, powołując się na wypowiedź rzecznika Kremla Dmitrija Pieskowa.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-23/kreml-uwaza-ze-ukraina-zostala-istotnie-zdemilitaryzowana/", "date_published": "2022-12-23 13:55:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Francja: Strzelanina w Paryżu, są ofiary śmiertelne", "description": "Co najmniej dwie osoby zginęły, a cztery zostały ranne w strzelaninie w centrum Paryża. Według mediów sprawca został zatrzymany przez policję.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-23/francja-strzelanina-w-paryzu-sa-ofiary-smiertelne/", "date_published": "2022-12-23 12:08:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Wielka Brytania: Modliła się przed kliniką aborcyjną. Została aresztowana", "description": "Isabel Vaughan-Spruce szefowa organizacji pro-life March for Life została aresztowana podczas modlitwy przed kliniką aborcyjną w Birmingham w Wielkiej Brytanii. To jest przerażające. Czym my się staliśmy? - skomentował całą sprawę brytyjski duchowny, Calvin John Robinson.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-23/wielka-brytania-modlila-sie-przed-klinika-aborcyjna-zostala-aresztowana/", "date_published": "2022-12-23 11:50:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Ukraina. Polscy medycy na linii frontu. \"Tutaj o geopolityce się nie rozmawia\"", "description": "Tutaj istotne jest czy następnego dnia będę miał co jeść, czy będę miał możliwość się wyspać, by skutecznie walczyć. Tutaj istotne są nazwiska, które przechodzą do wykazu poległych. Tutaj o geopolityce się nie rozmawia - powiedział w Polsat News Damian Duda, szef ochotniczego zespołu medyków pola walki na ukraińskim froncie.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-23/ukraina-polscy-medycy-na-linii-frontu-tutaj-o-geopolityce-sie-nie-rozmawia/", "date_published": "2022-12-23 10:57:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "USA. Atak zimy. Wydano ostrzeżenia dla 135 milionów Amerykanów", "description": "Arktyczna zima zaatakowała Stany Zjednoczone. Obszar, na którym wydano ostrzeżenia pogodowe, rozciąga się od wybrzeża do wybrzeża. - Chaos potęguje to, że w święta podróżuje prawie 100 mln Amerykanów - powiedział w Polsat News dziennikarz Daniel Bociąga. Dodał, że z powodu śnieżyc lotniska odwołały setki lotów.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-23/usa-atak-zimy-wydano-ostrzezenia-dla-135-milionow-amerykanow/", "date_published": "2022-12-23 08:30:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "USA. Media: Szkolenia Ukraińców w zakresie systemów Patriot odbędą się w Ameryce", "description": "Pentagon rozważa szkolenie ukraińskich sił zbrojnych w zakresie obsługi systemu obrony przeciwrakietowej Patriot w bazie wojskowej w Stanach Zjednoczonych - przekazały media. Taką informację otrzymano od urzędników z Departamentu Obrony USA. Według Pentagonu szkolenie wymaga 90 co najmniej żołnierzy i zajmie kilka miesięcy.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-23/usa-media-szkolenia-ukraincow-w-zakresie-systemow-patriot-odbeda-sie-w-ameryce/", "date_published": "2022-12-23 05:09:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}]