{"entries": [{"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/federal-judge-says-school-hiding-kids-gender-transitions-doesnt-shock-the-conscience-throws-out-parent-lawsuit", "title": "Federal Judge Says School Hiding Kids’ Gender Transitions Doesn’t ‘Shock The Conscience,’ Throws Out Parent Lawsuit", "date_published": "2022-12-23 17:48:15+00:00", "description": "A federal judge has thrown out a lawsuit from Massachusetts parents who accused public school officials of hiding their children&#8217;s gender transitions from them. U.S. District Court Judge Mark Mastroianni, an Obama appointee, criticized Ludlow Public Schools officials for allegedly hiding the pair of siblings&#8217; gender transitions from their parents, but he said the officials&#8217; ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/english-bishop-fires-back-at-church-choir-for-making-famous-christmas-carol-woke", "title": "English Bishop Fires Back At Church Choir For Making Famous Christmas Carol ‘Woke’", "date_published": "2022-12-23 17:40:15+00:00", "description": "A Catholic bishop slammed a church choir for altering a popular Christmas carol to include woke ideology and terminology in the song. Cardinal Vincent Nichols, the Catholic Archbishop of Westminster, took issue with the song performed by All Saints with Holy Trinity choir in Loughborough, England. &#8220;God rest you queer and questioning, your anxious hearts ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/praying-woman-arrested-for-breaking-public-space-order-outside-u-k-abortion-clinic", "title": "Praying Woman Arrested For Breaking Public Space Order Outside U.K. Abortion Clinic", "date_published": "2022-12-23 17:33:31+00:00", "description": "United Kingdom authorities arrested a pro-life woman praying outside an abortion clinic for allegedly breaking a temporary Public Space Protection Order on four separate occasions earlier this month. Isabel Vaughan-Spruce, a 45-year-old charity volunteer, was arrested and charged on four counts after she told police she &#8220;might&#8221; be silently praying near the U.K.’s leading provider ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/south-park-creators-announce-reopening-date-for-iconic-casa-bonita-restaurant", "title": "‘South Park’ Creators Announce Reopening Date For Iconic ‘Casa Bonita’ Restaurant", "date_published": "2022-12-23 17:04:26+00:00", "description": "The creators of the hit comedy show &#8220;South Park&#8221; announced this week that the iconic Colorado restaurant &#8220;Casa Bonita,&#8221; which the two men purchased in September of last year, will be reopening this spring. Trey Parker and Matt Stone purchased the restaurant, which is featured in one of South Park&#8217;s most popular episodes after the ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/aoc-breaks-ranks-in-1-7-trillion-omnibus-vote", "title": "AOC Breaks Ranks In $1.7 Trillion Omnibus Vote", "date_published": "2022-12-23 16:53:12+00:00", "description": "A handful of Democrats and Republicans bucked their respective parties in the House vote Friday to pass the $1.7 trillion “omnibus” bill stuffed with all sorts of pork according to critics. These defectors collectively did little to change the results. By a 225-201 vote, the massive spending legislation cleared the lower chamber and now heads to ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/hamster-fight-club-thanos-gauntlet-cocaine-beagles-the-most-insanely-wasteful-government-spending-items-in-rand-pauls-festivus-report", "title": "Hamster Fight Club, Thanos Gauntlet, Cocaine Beagles: The Most Insanely Wasteful Government Spending Items In Rand Paul’s Festivus Report", "date_published": "2022-12-23 16:48:53+00:00", "description": "Senator Rand Paul (R-KY) released his annual Festivus Report on Friday, detailing how Uncle Sam burned taxpayer dollars on initiatives such as hamster fight clubs and an experiment to see whether Thanos could snap his fingers in real life. The conservative lawmaker identified more than $482 billion of wasteful spending in this year’s Festivus Report, ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/former-star-linebacker-willie-mcginest-releases-statement-after-felony-arrest-for-assault-with-deadly-weapon-report", "title": "Former Star Linebacker Willie McGinest Releases Statement After Felony Arrest For Assault With Deadly Weapon: Report", "date_published": "2022-12-23 16:43:37+00:00", "description": "Former New England Patriots star linebacker Willie McGinest released a statement Friday after being arrested on felony charges for allegedly assaulting someone with a deadly weapon. The arrest stemmed from an incident that happened earlier this month at a nightclub in West Hollywood, according to a video that was released by TMZ. The video shows ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/up-and-coming-rapper-big-scarr-dead-at-22", "title": "Up-And-Coming Rapper Big Scarr Dead At 22", "date_published": "2022-12-23 16:24:18+00:00", "description": "Rapper Big Scarr, an up-and-coming artist who had signed with a major record label, has reportedly passed away. He was 22. Big Scarr, whose real name was Alexander Woods, was pronounced dead on Thursday, according to TMZ. No cause of death was given. Police told the publication that there was an investigation into his death, ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/train-caught-at-border-transporting-over-700000-fentanyl-pills", "title": "Train Caught At Border Transporting Over 700,000 Fentanyl Pills", "date_published": "2022-12-23 15:59:02+00:00", "description": "According to U.S. Customs and Border Protection officials, a train heading into Arizona from Mexico this week was caught transporting hundreds of thousands of fentanyl pills and 196 pounds of methamphetamines. The train entered the United States at the Nogales, Arizona, Port of Entry with 736,200 fentanyl pills. A two-milligram dose of fentanyl can be ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/over-200-house-members-voted-on-massive-omnibus-bill-while-away-from-d-c", "title": "Over 200 House Members Voted On Massive Omnibus Bill While Away From D.C.", "date_published": "2022-12-23 15:47:51+00:00", "description": "As members of the House of Representatives passed a $1.7 trillion omnibus bill one day before Christmas Eve, many appear to have done so from the comfort of their homes. The 4,155-page piece of legislation would codify $858 billion in defense spending and nearly $773 billion for discretionary programs. There are 227 active proxy letters ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/facebooks-parent-company-settles-cambridge-analytica-lawsuit-for-725-million", "title": "Facebook’s Parent Company Settles Cambridge Analytica Lawsuit For $725 Million", "date_published": "2022-12-23 15:27:50+00:00", "description": "Meta, the parent company of Facebook, agreed to pay $725 million Thursday to settle a class-action lawsuit that accused the social media platform of allowing third parties like British consulting firm Cambridge Analytica to access user data without consent. The social media giant resolved the four-year lawsuit after it was discovered that Cambridge Analytica had ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/biden-signs-847-billion-defense-bill-scrapping-military-covid-vaccine-mandate", "title": "Biden Signs $847 Billion Defense Bill Scrapping Military COVID Vaccine Mandate", "date_published": "2022-12-23 15:11:07+00:00", "description": "President Joe Biden signed an $847 billion defense policy bill on Friday that includes a provision repealing the COVID vaccine mandate for the military. The National Defense Authorization Act (NDAA) sets funding priorities and policy for the U.S. military over the next year. Republicans negotiated a clause repealing the Department of Defense’s COVID vaccine mandate ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/a-christmas-miracle-irs-delays-600-reporting-rule-for-paypal-and-venmo", "title": "A Christmas Miracle: IRS Delays $600 Reporting Rule For PayPal And Venmo", "date_published": "2022-12-23 15:00:46+00:00", "description": "The Internal Revenue Service (IRS) delayed a rule that would require Americans to report transactions above $600 made through third-party payment settlement organizations. A webpage updated by the IRS earlier this month had informed taxpayers who use platforms such as PayPal and Venmo that they could expect to receive a copy of Form 1099-K for “gross ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/are-republicans-planning-an-end-run-around-mccarthys-bid-for-speaker", "title": "Are Republicans Planning An End Run Around McCarthy’s Bid For Speaker?", "date_published": "2022-12-23 14:52:49+00:00", "description": "Rep. Kevin McCarthy (R-CA) wants to be speaker of the House, not an unusual desire as it&#8217;s just a tiny step up from his current position of minority leader. But unfortunately for him, he might have just enough enemies to keep him from wielding the gavel. A candidate must win a simple majority (218 if ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/over-one-million-homes-and-businesses-without-power-as-winter-storm-sweeps-country", "title": "Over One Million Homes And Businesses Without Power As Winter Storm Sweeps Country", "date_published": "2022-12-23 14:23:07+00:00", "description": "More than one million homes and businesses have lost power as a severe winter storm sweeps the United States. The nation is contending with an arctic front causing snowfall and frigid temperatures until Saturday, which marks Christmas Eve, according to a forecast from the National Weather Service (NWS). Beyond placing travel plans in jeopardy as ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/house-sends-monster-1-7-trillion-spending-bill-to-joe-bidens-desk-with-backing-from-9-republicans", "title": "House Sends Monster $1.7 Trillion Spending Bill To Joe Biden’s Desk With Backing From 9 Republicans", "date_published": "2022-12-23 14:20:59+00:00", "description": "The House of Representatives, led by Speaker Nancy Pelosi (D-CA), passed a $1.7 trillion spending package on Friday with nine Republicans joining Democrats to send the massive omnibus to the White House in a 225-201 vote. New York Rep. Alexandria Ocasio-Cortez was the only Democrat to vote against the bill. Rep. Rashida Tlaib (D-MI) voted ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/census-florida-was-fastest-growing-state-this-year-with-historic-population-gains", "title": "Census: Florida Was Fastest-Growing State This Year With Historic Population Gains", "date_published": "2022-12-23 14:14:40+00:00", "description": "Florida was the fastest-growing state in the country over the last year—the first time that has happened since 1957, the Census Bureau said Friday. “Florida&#8217;s population increased by 1.9% to 22,244,823 between 2021 and 2022, surpassing Idaho, the previous year’s fastest-growing state,” the Bureau said. “For the third most-populous state to also be the fastest growing is notable because it requires significant population gains.”", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/police-officer-fatally-shoots-woman-holding-walmart-employee-hostage", "title": "Police Officer Fatally Shoots Woman Holding Walmart Employee Hostage", "date_published": "2022-12-23 13:48:46+00:00", "description": "A Mississippi police officer shot and killed a woman who had taken an employee hostage inside a Walmart Wednesday. Video taken by a bystander inside the store showed Corlunda McGinister, a 21-year-old Arkansas woman, holding a gun in her right hand as her left hand was on the back of a stunned Walmart employee. McGinister ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/christmas-bells-1864-poem-offers-hope-amid-fears-of-another-civil-war", "title": "‘Christmas Bells’: 1864 Poem Offers Hope Amid Fears Of Another Civil War", "date_published": "2022-12-23 13:45:43+00:00", "description": "Heated political rhetoric — and growing concerns about political violence — have fueled warning after warning that the United States might be headed for another Civil War. An August 2022 poll from The Economist/YouGov revealed that everyday Americans worry that the country is too divided to course-correct. According to that poll, 42% (half of Republicans ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/young-scientists-claimed-nasa-telescope-namesake-james-webb-led-a-crusade-against-gay-people-theyre-wrong-but-wont-give-up", "title": "Young Scientists Claimed NASA Telescope Namesake James Webb Led A Crusade Against Gay People. They’re Wrong, But Won’t Give Up.", "date_published": "2022-12-23 13:42:41+00:00", "description": "In 2002, NASA announced that it was naming its upcoming deep-space telescope after James Webb, the former leader of the agency from 1961 to 1968 who set in motion the 1969 moon landing. At the time, no one complained, as the telescope hadn’t been built, but more than a decade later, in 2015, when the ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/peterson-exodus-midwives-civil-disobedience-and-pharaohs-attempt-to-feminize-the-hebrews", "title": "PETERSON: Exodus — Midwives, Civil Disobedience, And Pharaoh’s Attempt To Feminize The Hebrews", "date_published": "2022-12-23 13:01:53+00:00", "description": "The following is an excerpt from the recent roundtable discussion on Exodus. You can watch the special on DailyWire+. Episode time: 32:24 Discussion on Exodus 1:15-16 Jonathan Pageau: I want to propose that there might be a very important narrative reason why the midwives are Hebrew in this case. And I think it is a ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/drug-overdose-deaths-soared-above-106000-in-2021-cdc-report-says", "title": "Drug Overdose Deaths Soared Above 106,000 In 2021, CDC Report Says", "date_published": "2022-12-23 12:35:06+00:00", "description": "Drug overdose deaths soared above 106,000 in 2021, topping the spike that occurred during the first wave of the pandemic in 2020. The Centers for Disease Control and Prevention (CDC) released its final report revealing the dismal numbers on Friday, just before Christmas. The U.S. saw a total of 106,699 drug overdose deaths in 2021, ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/biden-increasingly-annoyed-by-kamala-harris-book-reveals", "title": "Biden Increasingly ‘Annoyed’ By Kamala Harris, Book Reveals", "date_published": "2022-12-23 12:02:21+00:00", "description": "During the race to be the Democrats&#8217; nominee in 2020, Kamala Harris and Joe Biden engaged in several acrimonious exchanges before Harris&#8217; campaign went down in flames. But she is a black woman of Asian descent, and Biden — being the craven politician he is — picked her as his running mate. Still, he has ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/amazon-fedex-post-office-warn-of-delivery-delays-as-winter-weather-persists", "title": "Amazon, FedEx, Post Office Warn Of Delivery Delays As Winter Weather Persists", "date_published": "2022-12-23 12:00:10+00:00", "description": "Last-minute Christmas shoppers may be left in the cold as major delivery services announce delays as a result of severe winter weather. Residents of the Midwest and the Great Lakes region will contend with an Arctic front causing snowfall and frigid temperatures until Christmas Eve, according to a forecast from the National Weather Service, posing ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/taco-place-floods-with-orders-after-owners-daughter-says-her-mom-needs-customers-for-christmas-in-viral-tiktok", "title": "Taco Place Floods With Orders After Owner’s Daughter Says Her Mom Needs ‘Customers For Christmas’ In Viral TikTok", "date_published": "2022-12-23 11:35:12+00:00", "description": "An Illinois-based taco eatery was flooded with customers after the owner’s daughter made an emotional plea on TikTok, telling followers she wanted her mom to have a Christmas miracle. Isabel Milan uploaded the first video on December 8, which included the caption, &#8220;I wish I could give her customers for Christmas.&#8221; The clip showed Milan’s ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/bomb-cyclone-winter-storm-wreaks-havoc-across-country-thousands-of-flights-canceled-days-before-christmas", "title": "‘Bomb Cyclone’ Winter Storm Wreaks Havoc Across Country, Thousands Of Flights Canceled Days Before Christmas", "date_published": "2022-12-23 11:21:18+00:00", "description": "A brutal winter storm making its way across the U.S. threw a wrench into Christmas travel plans days before the holiday.  An arctic blast, labeled a “bomb cyclone,” is sweeping across the country, causing temperatures to plunge to sub-zero across the Great Plains and much of the Midwest and below-freezing in parts of the South ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/we-will-self-destruct-as-a-party-mike-lee-warns-senate-gop-after-they-vote-for-massive-omnibus-bill", "title": "‘We Will Self-Destruct As A Party’: Mike Lee Warns Senate GOP After They Vote For Massive Omnibus Bill", "date_published": "2022-12-23 11:14:26+00:00", "description": "Slamming his fellow GOP senators for voting for the massive omnibus bill pushed by the Democratic Party, Utah GOP Senator Mike Lee, who had authored an amendment that would enable Title 42 to be extended in order to curb illegal immigration, warned of the demise of the Republican Party. The bill passed in the Senate, ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/the-4-million-california-home-where-sam-bankman-fried-is-spending-his-house-arrest", "title": "The $4 Million California Home Where Sam Bankman-Fried Is Spending His House Arrest", "date_published": "2022-12-23 11:00:26+00:00", "description": "Prosecutors are allowing former FTX CEO Sam Bankman-Fried to stay at his parents’ home in Palo Alto, California. The disgraced entrepreneur was released Thursday on a $250 million bail; he will be required to wear an electronic monitoring bracelet, participate in mental health counseling, and remain within the Northern District of California before his next ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/get-your-a-out-of-the-white-house-and-go-to-the-border-graham-blisters-biden-on-immigration", "title": "‘Get Your A** Out Of The White House And Go To The Border’: Graham Blisters Biden On Immigration", "date_published": "2022-12-23 10:55:17+00:00", "description": "South Carolina GOP Senator Lindsey Graham lashed out at President Joe Biden for his cavalier attitude toward the problem of illegal immigration, ripping him for eschewing a trip to the southern border so he could see first-hand how serious the problem is. Graham referred to Title 42, the program that had been implemented during the ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/i-could-lose-it-too-cardi-b-says-her-massive-net-worth-isnt-recession-proof-fans-react", "title": "‘I Could Lose It Too’: Cardi B Says Her Massive Net Worth Isn’t Recession-Proof, Fans React", "date_published": "2022-12-23 10:15:57+00:00", "description": "Rapper Cardi B shared a message with fans who were mocking her for worrying about the recession.  It all started earlier this week when the “Bodak Yellow” star tweeted, “We going through a recession…..Merry Christmas.” The comments were flooded with fans sharing their opinions on the sentiment, with some urging her to vote differently and ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/states-have-pulled-nearly-12-billion-from-blackrock-this-year", "title": "States Have Pulled Nearly $12 Billion From BlackRock This Year", "date_published": "2022-12-23 10:09:14+00:00", "description": "Republican state officials have pulled approximately $11.7 billion from BlackRock since the beginning of 2022 in reaction to the asset management company’s commitment to the ESG movement, according to a Daily Wire analysis. The divestments, constituting a drop in the bucket in comparison to the nearly $8 trillion managed by BlackRock, occur as market forces ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/engines-on-fire-musk-uses-terrifying-metaphor-to-describe-twitters-finances", "title": "‘Engines On Fire’: Musk Uses Terrifying Metaphor To Describe Twitter’s Finances", "date_published": "2022-12-23 10:04:03+00:00", "description": "Elon Musk painted a dire picture of Twitter’s balance sheet in a recent chat, likening the platform&#8217;s finances to a plane that is about to crash. Musk, who bought the social media company for $44 billion in October, told a Twitter Spaces group it was on a pace to lose $3 billion per year when ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/hgtv-star-says-she-has-mercury-lead-poisoning-from-renovating-gross-houses", "title": "HGTV Star Says She Has Mercury, Lead Poisoning From Renovating ‘Gross’ Houses", "date_published": "2022-12-23 09:49:26+00:00", "description": "HGTV host Christina Haack revealed that she’s suffering from some medical issues that she says likely stem from renovating older “gross” houses in her past.  The “Christina on the Coast” star shared this week that her medical test results provided answers after having “some unexplained health stuff for years,” per Page Six. “My scan said ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/tesla-causes-8-car-pileup-on-san-francisco-bridge-driver-tells-police-self-driving-mode-malfunctioned", "title": "Tesla Causes 8-Car Pileup On San Francisco Bridge. Driver Tells Police Self-Driving Mode Malfunctioned.", "date_published": "2022-12-23 09:20:09+00:00", "description": "The driver of a 2021 Tesla told police that his vehicle’s self-driving software malfunctioned, causing an eight-car pileup on San Francisco’s Bay Bridge last month. The crash that occurred on Thanksgiving Day resulted in two juveniles being transported to the hospital for minor injuries. According to a police report obtained by Reuters and made public ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/biden-delivers-christmas-address-without-mentioning-jesus-by-name-a-child-christians-believe-to-be-the-son-of-god", "title": "Biden Delivers Christmas Address Without Mentioning Jesus By Name: ‘A Child Christians Believe To Be The Son Of God’", "date_published": "2022-12-23 08:54:03+00:00", "description": "President Joe Biden delivered the White House&#8217;s Christmas address Thursday evening and failed to mention Jesus by name or say Christ while doing so. “How silently, how silently, the wondrous Gift is given,” Biden began. &#8220;There is a certain stillness at the center of the Christmas story. A silent night when all the world goes ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/variety-picks-100-greatest-movies-ever-made-a-horror-movie-stands-at-the-top", "title": "Variety Picks 100 Greatest Movies Ever Made. A Horror Movie Stands At The Top.", "date_published": "2022-12-23 08:40:51+00:00", "description": "Variety issued a list of the 100 greatest movies ever made, and an Alfred Hitchcock film made the top of the list. Variety’s staff introduced their list by noting they wanted to reflect the fact that &#8220;the very spirit of cinema is that it has long been a landscape of spine-tingling eclecticism.” Then they picked ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/former-trump-white-house-attorney-hammers-january-6-witness-cassidy-hutchinson", "title": "Former Trump White House Attorney Hammers January 6 Witness Cassidy Hutchinson", "date_published": "2022-12-23 08:08:56+00:00", "description": "Former Trump White House lawyer Eric Herschmann slammed a key witness for the Democrat-led January 6 House committee, saying that some of her key claims were completely false. Witness Cassidy Hutchinson claimed that the first lawyer that represented her during the hearings — Stefan Passantino, a former Trump White House lawyer — was working to ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/pitbulls-attack-students-and-teachers-at-middle-school-leave-21-injured", "title": "Pitbulls Attack Students And Teachers At Middle School, Leave 21 Injured", "date_published": "2022-12-23 07:51:41+00:00", "description": "Two pit bulls attacked a playground in Missouri this week, leaving nearly two dozen people injured. The attack happened Tuesday at Willard Intermediate South school in Springfield, Missouri, which serves students that are in grades 5 and 6. In total, 18 students and three teachers were injured, including six that required emergency medical services due ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/new-book-reveals-political-issue-that-caused-biden-to-explode-in-fits-of-rage-report", "title": "New Book Reveals Political Issue That Caused Biden To Explode In Fits Of Rage: Report", "date_published": "2022-12-23 07:31:49+00:00", "description": "A book that is expected to hit bookshelves next month will detail one of the issues that reportedly caused President Joe Biden to explode into fits of rage during his first years as president. Author Chris Whipple, in his forthcoming book, &#8220;The Fight of His Life: Inside Joe Biden&#8217;s White House,&#8221; describes how the scenes ...", "persistent": false, "language": "en-US"}], "source": {"url": "https://www.dailywire.com/feeds/rss.xml", "title": "Daily Wire"}}