{"entries": [{"source": "https://www.gamespot.com/feeds/mashup", "link": "https://www.gamespot.com/articles/where-is-xur-today-december-23-27-destiny-2-exotic-items-and-xur-location-guide/1100-6510228/?ftag=CAD-01-10abi2f", "title": "Where Is Xur Today? (December 23-27) - Destiny 2 Exotic Items And Xur Location Guide", "date_published": "2022-12-23 19:04:00+00:00", "description": "<p>It's the night--or two--before Christmas, and Xur has once again popped into the Destiny 2 Solar system with a gift bag that's loaded with presents. For all the Guardians on Xur's nice list this year, you can expect the usual assortment of Exotic arms and armor, as well as a few legendary-class goodies as well. Here's where you can find Xur and what Exotics he's selling this week.</p><p>This week you can find Xur on <strong>Nessus</strong>, in the <strong>Watcher's Grave area</strong>. For his weapon, Xur is offering <strong>Hard Light</strong>. Hunters can pick up the <strong>Graviton Forfeit</strong> helmet, Titans can grab the <strong>An Insurmountable Skullfort</strong> helmet, and for Warlocks, Xur has the <strong>Apotheosis Veil</strong> helmet.</p><h3>Xur Location</h3><figure style=\"width: 1920px;\"><a href=\"https://www.gamespot.com/a/uploads/original/1601/16018044/4080042-xurnessus.jpg\"><img alt=\"Xur's location on Nessus.\" src=\"https://www.gamespot.com/a/uploads/scale_super/1601/16018044/4080042-xurnessus.jpg\" /></a><figcaption>Xur's location on Nessus.</figcaption></figure><p>Head to Nessus and use the Watcher's Grave transmat zone to find Xur this week. When you arrive, hop on your sparrow and head north toward the exit of the area. Look for a big tree with pink moss on the right side of the area. Climb up onto its big, flat branch, where you can reach Xur.</p><a href=\"https://www.gamespot.com/articles/where-is-xur-today-december-23-27-destiny-2-exotic-items-and-xur-location-guide/1100-6510228/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "link": "https://www.gamespot.com/gallery/apex-legends-bayonetta-3-and-8-other-essential-lgbtqia-games-of-2022/2900-4548/", "title": "Apex Legends, Bayonetta 3, And 8 Other Essential LGBTQIA+ Games Of 2022", "date_published": "2022-12-23 17:00:00+00:00", "description": "<p><img src=\"https://www.gamespot.com/a/uploads/scale_large/1727/17277841/4078194-signalis.jpeg\" /><br /><h3><p dir=\"ltr\">It feels like there are almost too many games released each and every year. Many of us talk about our backlogs and how we secretly hope that that new, upcoming game will get delayed, if only so we can catch up on the handful of games we already have lined up. And yet, I think we could always use more games with LGBTQIA+ themes and representation.</p><p dir=\"ltr\">Sure, we get games that are unofficially queer, like Sonic Frontiers and PowerWash Simulator (no, I will not elaborate further), but we need to keep demanding better direct representation. Thankfully, 2022 contained a slew of must-play releases with queer and trans themes. Here are 10 essential games from 2022 with LGBTQIA+ themes and representation.</p></h3></p><br />     <p><h2>1. Bossgame: The Final Boss Is My Heart</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1727/17277841/4078195-bossgame-gameplay.jpg\" /><br /><h3><p dir=\"ltr\">Bossgame: The Final Boss is My Heart stars two lesbians, a witch and a master of blades, who do battle against evil devils, which immediately makes it cooler than most games. Video games need more witches and queer people. Bossgame has both.</p><p dir=\"ltr\">But the gameplay, story, music, and everything in between help make Bossgame one of the most special games you can play this year, queer or not. Bossgame takes you on a colorful, pixel-powered journey alongside Anna and Sophie, the game's two lesbian protagonists, as they battle devils and try to make their rent payments. An absolutely infectious soundtrack, filled with mesmerizing riffs and beats, will keep you going when the game's onslaught of rhythm-fueled boss battles feel like they're too much. And if the game ever feels like it is too much, you can turn on the Invincibility mode in the options and keep the devil thrashing jams going.</p><p>Bossgame: The Final Boss is My Heart is available on <a href=\"https://lilyv.itch.io/bossgame\">PC</a>, <a href=\"https://play.google.com/store/apps/details?id=com.LilycoreGames.Bossgame&amp;hl=en&amp;gl=US&amp;pli=1\">Android</a>, and <a href=\"https://apps.apple.com/us/app/bossgame-the-boss-is-my-heart/id1644439303\">iOS</a>.</p></h3></p><br />     <p><h2>2. Signalis</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1727/17277841/4078196-signalis-gameplay.jpg\" /><br /><h3><p dir=\"ltr\">Signalis is one of the most special games to release this year, and not just because it's a sapphic love story. It's also one of the most \"Silent Hill 2 games\" you can play that isn't called Silent Hill 2.</p><p dir=\"ltr\">It's just so rare for games to feel as special, real, and meaningful as Signalis, though a lot of that comes from player agency and the game's hazy, dreamy sense of discovery. On the surface though, without lighting the path for you: Signalis subverts sci-fi expectations, choosing to veer toward horror at nearly every turn, but the scope and possibilities are still wrapped tightly around the world and warped society of Signalis. There's both a cyberpunk and Lovecraftian squeeze on both sides, but the heart of the game is a love story between two women. And I think because of the way Signalis does its world-building, we can call them trans women.</p><p dir=\"ltr\">And what I love most about Signalis is something you might not get from it, so it can't be a spoiler. The survival horrors of Signalis are mostly built upon the same manufactured and casual misogyny that disregards women for ideas, instead choosing to sacrifice us for what we can give.</p><p dir=\"ltr\">And yet, these two women, no matter which ending is reached, still manage to find love in all the wrong places. Signalis may be part Resident Evil and Silent Hill, but it's also a game about women loving women, regardless of the horrors around them.</p><p dir=\"ltr\">Signalis is available on PC, Nintendo Switch, PlayStation 4, and Xbox One.</p></h3></p><br />     <p><h2>3. The Sims 4</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1727/17277841/4078197-sims4-queer.jpg\" /><br /><h3><p dir=\"ltr\">2022 was a big year for The Sims 4, one that brought many changes to the game and series to help make it the most inclusive it's ever been. While EA and Maxis have strived to make sure that everyone can create themselves in The Sims 4, it's never been easier than it is now.</p><p dir=\"ltr\">Gender had always been binary in The Sims until this year's updates added a slew of customization options, including a non-binary gender option, gendered clothing preferences, and even pronoun preferences.</p><p dir=\"ltr\">Trans women and trans men both have better representation, too. Players can choose whether characters sit or stand to use the bathroom, whether characters can become pregnant, and the pitch of character voices.</p><p dir=\"ltr\">Sims were also all basically bisexual in previous games, thought it wasn't explicitly listed or defined. Essentially, all characters defaulted to being attracted to male and female characters, with players unable to clearly define their Sims' sexualities.</p><p dir=\"ltr\">But now, everyone has a voice. Thanks to this year's updates, players are able to select the sexual orientation of their Sims, right down to preferences--or simply exclusivity. Put differently, EA and Maxis gave players the ability to make straight Sims, which also wasn't possible before.</p><p dir=\"ltr\">The Sims 4 is free to play with paid expansions on Xbox One, Xbox Series X|S, PlayStation 4, PlayStation 5, and PC.</p></h3></p><br />     <p><h2>4. Bayonetta 3</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1727/17277841/4078198-bayo-bayo-bayoooo.png\" /><br /><h3><p dir=\"ltr\">Bayonetta 3 is a spectacular and thrilling action-adventure game that also ends the trilogy starring the undeniably hot and powerful Bayonetta, a devil-defying witch on Nintendo Switch.</p><p dir=\"ltr\">And, the titular character is also a queer woman, making this the second game on our list with cool, queer witches.</p><p dir=\"ltr\">In GameSpot's <a href=\"https://www.gamespot.com/reviews/bayonetta-3-review-real-hot-girls-hit/1900-6417989/\">Bayonetta 3 review</a>, Jessica Howard called Bayonetta 3 \"a fast-paced and joyous adventure that achieves its goals with an abundance of charisma and style.\"</p><p dir=\"ltr\">Bayonetta 3 is available exclusively on Nintendo Switch.</p></h3></p><br />     <p><h2>5. AI: The Somnium Files – Nirvana Initiative</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1727/17277841/4078199-ai-nirvana.jpeg\" /><br /><h3><p dir=\"ltr\">AI: The Somnium Files -Nirvana Initiative is the sequel to 2019's AI: The Somnium Files, with the story continuing six months after the events of the first game.</p><p dir=\"ltr\">The game follows detectives investigating murders in a cool and unique way. Players will retrieve information from the memories and dreams of victims in order to solve crime in what may be one of the most stylish titles of the year.</p><p dir=\"ltr\">AI: The Somnium Files - Nirvana Initiative is on the list because <a href=\"https://www.fanbyte.com/games/news/mizuki-once-again-says-gay-rights-in-ai-the-somnium-files-nirvana-initiative/\">the game yells in support of queer people and other marginalized groups</a>. In 2022, that spends very well and the LGBTQIA+ community says, \"Thank you, cool, pretty detective game.\"</p><p dir=\"ltr\">AI: The Somnium Files - Nirvana Initiative is available on Nintendo Switch, PC, PlayStation 4, and Xbox One.</p></h3></p><br />     <p><h2>6. Apex Legends</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1727/17277841/4078200-apex-catalyst.jpg\" /><br /><h3><p dir=\"ltr\">Apex Legends said \"trans rights are human rights\" loud enough for all the world to hear when Catalyst, my new favorite video game character and girlfriend, was announced for the game's 15th season, Eclipse.</p><p dir=\"ltr\">Apex Legends has featured characters with queer and trans representation in the past, but Catalyst is the game's first trans woman. Respawn even got a key character detail right by having her talk about being on hormone replacement therapy (HRT) in her announcement video when speaking with another character, which is something we all love to do. It was at that moment I knew she was like me.</p><p dir=\"ltr\">Apex Legends is available on Nintendo Switch, PlayStation 4, PlayStation 5, Xbox One, Xbox Series, and PC.</p></h3></p><br />     <p><h2>7. Kirby and the Forgotten Land</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1727/17277841/4078201-kirby.jpg\" /><br /><h3><p dir=\"ltr\">Kirby and the Forgotten is one of the most colorful and wonderful titles you can play this year. It's also warm and feels kind of like a hug when you play it, which is something every queer and trans person could probably use right now.</p><p dir=\"ltr\">Kirby isn't just warm, though. Kirby is also a non-binary character. You'd be forgiven for not knowing that though. Kirby's non-binary, they/them identity isn't something Nintendo really talks about. In Japanese media, Kirby uses gender-neutral pronouns, <a href=\"https://lgbtqia-characters.fandom.com/wiki/Kirby\">whereas in America Kirby uses masculine pronouns</a>, though Kirby's gender is still presented as pretty neutral. Nintendo isn't very loud about it, but Kirby is still a non-binary champion for all that wave the yellow, white, purple, and black flag.</p><p dir=\"ltr\">Kirby and the Forgotten Land is available exclusively on Nintendo Switch.</p></h3></p><br />     <p><h2>8. Butterfly Soup 2</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1727/17277841/4078202-butterfly-soup-2.png\" /><br /><h3><p dir=\"ltr\">Butterfly Soup 2 is a visual novel starring queer Asian-American teens as they navigate the perils and problems of high school, which includes everything from relationships all the way to homophobia and racism.</p><p dir=\"ltr\">The game is filled with queer conversations and the girls' love of baseball, and every moment is just so visceral and meaningful. And the art style helps add to the warmth, too, with colorful, sweeping visuals.</p><p dir=\"ltr\">Butterfly Soup 2 takes place in 2009, across four different characters' lives: Diya, Min-seo, Noelle, Akarsha. And together you'll go on a journey with friends through love and baseball. Who doesn't love stories with queer girls and baseball?</p><p dir=\"ltr\"><a href=\"https://brianna-lei.itch.io/butterfly-soup\">Butterfly Soup</a> and its sequel, <a href=\"https://brianna-lei.itch.io/butterfly-soup-2\">Butterfly Soup 2</a>, are both free on itch.io, but you can support the developer by spending a little cash on each game's bonus extras.</p></h3></p><br />     <p><h2>9. We Are OFK</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1727/17277841/4078206-weareofk.jpg\" /><br /><h3><p dir=\"ltr\">We Are OFK is a journey through life, love, pain, loss, and all those gross, mushy, in-between feelings that anyone who creates for a living experiences on a near daily basis. And it's beautiful.</p><p dir=\"ltr\">We Are OFK is a visual treat, but we have to talk about the music. It is about a band, after all: A band called OFK. The indie pop music and sweeping colors from the game's distinct art style all tell the story of a band and the people in it. And they're a real band with problems, dreams, and insecurities.</p><p dir=\"ltr\">We Are OFK features queer characters exploring who they are, and it's something we need more of in video games.</p><p dir=\"ltr\">We Are OFK is available on Nintendo Switch, PlayStation 5, and PC.</p></h3></p><br />     <p><h2>10. Wylde Flowers</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1727/17277841/4078203-wyldeflowers.png\" /><br /><h3><p dir=\"ltr\">Wylde Flowers is a cute and cozy farming sim where you also get to learn magic as you become a witch. The game stars Tara, and during the day, players will enjoy fun and refreshing farming tasks on the family farm. But at night, Tara will brew potions and hone her magic powers.</p><p dir=\"ltr\">The game features fishing, potion brewing, and all sorts of exciting tasks, but perhaps most importantly, players are able to choose between male, female, and non-binary romance options.</p><p dir=\"ltr\">Wylde Flowers is probably the best game of its kind since Stardew Valley, and it shouldn't be missed by any fans of the genre.</p><p dir=\"ltr\">Wylde Flowers is available on Apple Arcade, Nintendo Switch, and PC.</p></h3></p><br />", "persistent": false, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "link": "https://www.gamespot.com/articles/trials-of-osiris-rewards-this-week-in-destiny-2-december-23-27/1100-6510229/?ftag=CAD-01-10abi2f", "title": "Trials Of Osiris Rewards This Week In Destiny 2 (December 23-27)", "date_published": "2022-12-23 17:00:00+00:00", "description": "<p>Nothing gets you into the festive mood quicker than some intense PvP action, and if you happen to hovering around the Destiny 2 Solar system this weekend, that's exactly what's on the menu as Trials of Osiris returns. This is a great time to test out the new <a href=\"https://www.gamespot.com/articles/destiny-2-how-to-get-the-revision-zero-exotic-pulse-rifle/1100-6510185/\">Revision Zero Exotic pulse rifle</a> in that arena and you can also check out where Xur is in case you want some new gear before you attempt a flawless run. Here's where you'll play Trials of Osiris this weekend and what weapons you can earn.</p><p>Map: To be confirmed</p><ul><li>Reputation Rank 4: Upgrade Module x 2</li><li>Reputation Rank 7: Enhancement Prism x 3</li><li>Reputation Rank 10: Trials Weapon (Changes for each rank reset)</li><li>Reputation Rank 13: Upgrade Module x 2</li><li>Reputation Rank 16: Trials Weapon (Changes for each rank reset)</li><li>Flawless Reward:   <p>To be confirmed</p></li></ul><p>Trials weapons now carry the Alacrity Origin Trait. It gives you increased aim assist, reload speed, stability, and range on your Trials guns when you're the last living member of a fireteam or running solo. You can also choose to swap to the Crucible Origin trait, One Quiet Moment, which greatly enhances your gun's reload speed when you reload while out of combat.</p><a href=\"https://www.gamespot.com/articles/trials-of-osiris-rewards-this-week-in-destiny-2-december-23-27/1100-6510229/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "link": "https://www.gamespot.com/videos/gamespots-top-10-games-of-2022/2300-6460287/", "title": "GameSpot's Top 10 Games of 2022", "date_published": "2022-12-23 15:00:00+00:00", "description": "<img height=\"480\" src=\"https://www.gamespot.com/a/uploads/square_medium/1574/15746725/4079468-gs-boty-2022-top10-games.jpg\" width=\"480\" /> 2022 has come to an end and its time for the GameSpot staff to celebrate our top 10 games of the year.", "persistent": false, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "link": "https://www.gamespot.com/articles/cyberpunk-2077s-redemption-arc-is-a-breathtaking-return-to-form-for-cd-projekt-red/1100-6510079/?ftag=CAD-01-10abi2f", "title": "Best Of 2022: Cyberpunk 2077's Redemption Arc Is A Breathtaking Return To Form For CD Projekt Red", "date_published": "2022-12-23 14:00:00+00:00", "description": "<p dir=\"ltr\">It's December 2020, and Cyberpunk 2077 is about to make headlines for all the wrong reasons. Arriving on store shelves eight years after it was first announced, Cyberpunk 2077 had all the momentum in the world to help it close out the year in blockbuster style. With developer CD Projekt Red having earned plenty of goodwill from its work on The Witcher trilogy, the idea of the studio working on a cult-classic IP combined with a Keanu Reeves show-stealing E3 moment made for one of the most highly anticipated game debuts of all time.</p><p dir=\"ltr\">Come launch day, it was a different story. While PC reviews mostly praised the game, they came with a gigantic asterisk attached that could be seen from orbit as Cyberpunk 2077 was crawling with bugs, destructive glitches, and a world that felt half-baked at best. Fascinating game features that had previously been shown off in trailers, like using wall-running to get an acrobatic drop on enemies, were missing from the final release.</p><p dir=\"ltr\">Console gamers bore the brunt of Cyberpunk 2077's shortcomings, as the game was barely playable on last-gen PS4s and Xbox Ones, while the newly launched PS5 and Xbox Series X|S hardware also had to deal with plenty of problems.</p><a href=\"https://www.gamespot.com/articles/cyberpunk-2077s-redemption-arc-is-a-breathtaking-return-to-form-for-cd-projekt-red/1100-6510079/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "persistent": false, "language": "en-US"}], "source": {"url": "https://www.gamespot.com/feeds/mashup", "title": "GameSpot"}}