[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sword Master Reacts to Chivalry 2’s Combat And Weapons", "description": "David Rawlings, a Sword Master and founder of the London Longsword Academy, breaks down some of the combat and the weapons from Chivalry 2, including the Falchion, the Longsword, and a Greatsword.\n\nExpert Reacts Playlist: https://youtube.com/playlist?list=PLp...\n\nIf you are interested in training with David and team and learn how to swordfight, check out www.londonlongsword.com or send an email to enquiry@londonlongsword.com\n \nIf you would like to see more videos of David Rawlings and the London Longsword Academy (LLA) check out their YouTube channel: https://www.youtube.com/user/LondonLo...\n \nIf you like swords and martial arts content, follow the LLA on Instagram  Master_at_Arms and Swordfightress or Facebook London Longsword Academy.\n\nWeapons Featured:\n\n00:00 - Intro\n00:45 - Warhammer\n02:06 - Falchion\n03:29 - Longsword Defense\n04:34 - Fighting with a chair\n05:09 - Dane Axe\n06:18 - Greatsword\n09:22 - Longsword\n11:53 - Spear", "link": "https://www.youtube.com/watch?v=Kpw41wvo7Dw", "date_published": "2022-08-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Escape From Tarkov’s Guns PART 5", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down more of the weaponry of Escape From Tarkov, including the Chiappa Rhino, the ADAR 2-15 and a hideously cursed Glock 18C.\n\n00:00 - Opening\n00:38 - ADAR 2-15\n02:25 - MTs 255 Revolving shotgun\n03:57 - Chiappa Rhino\n05:28 - H&K G28 \n08:17 - Glock 18C\n09:24 - Rifle Dynamics RD-704 AK\n12:30 - FN SCAR-L\n15:20 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down more of the guns of Escape From Tarkov and compares them to their potential real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=offyCsakbRc", "date_published": "2022-08-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Madden NFL 23 - Everything To Know", "description": "EA's latest entry in the Madden series brings players back onto the gridiron for another year of football. In this video we break down everything players need to know including some new gameplay mechanics like Fieldsense, as well as changes to the classic Franchise mode.\n\nThe year is 2022, which means we are yet again receiving another Madden game to start the football season. For those of you thinking this might just be yet another Madden…well, you're probably right, but hey, you know, and I know the real reason we keep coming back for more: Roster Updates. All jokes aside stick around as I break down everything to know about Madden 23, so you can see if this might be the Madden for you.\n\nMadden 23's biggest change to the core gameplay is what EA is calling Fieldsense, an overhaul to several of the game's on-field mechanics. New tackle animations and game logic have redressed the play-by-play nature of the sport. punchout fumbles and more team gang tackles intend to bring an extra level of oomph and aggression to the game – something EA refers to as the Hit Everything feature.\n\nWe're gonna have lots of Madden coverage coming this month. I'm working on getting a Livestream set up for you guys the week the game comes out. Be sure to keep an eye out for Mark Delaney's official Madden review after the game launches as well. If you're interested in Franchise mode or want to play Ultimate Team but don't want to spend a dime, let me know! Based on your comments, I'll get more vids cooking for y'all catered to what you guys want to see. Thanks for watching.", "link": "https://www.youtube.com/watch?v=-O3YqlFgzRI", "date_published": "2022-08-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Marvel's Spider-Man Is Fantastic On Steam Deck | Settings Recommendations", "description": "The PC release on Spider-Man not only brings better graphics, but the option to play on the go thanks to the Steam Deck.\n#gaming #marvelsspiderman #steamdeck \n\nEverything we talk about in this video is based on our time with a pre-release version of the game. Sony told us up front that they are still working on optimization and warned us about certain issues they plan to fix. In fact we got a big fat update just a few days before this video launched, offering some major improvements So it's possible some of the issues we talk about will be improved down the line in future patches.\n\nMarvel’s Spider-Man Remastered is out now on PC. The port includes ultrawide support, an unlocked frame rate, improved shadows, ray-traced reflections at varying quality levels, Nvidia Deep Learning Super Sampling (DLSS), Nvidia Deep Learning Anti-Aliasing (DLAA) and more. The game also supports the DualSense controllers as well as mouse and keyboard setups. Cloud saves and achievements are supported on both the Epic Games Store and Steam.\n\nMarvel’s Spider-Man: Miles Morales will also come to PC sometime in Fall 2022. \n\nMarvel's Spider-Man originally launched on PlayStation 4 in September 2018. The remastered version came packaged with the ultimate edition of Marvel's Spider-Man: Miles Morales, which launched with the PlayStation 5 on November 12, 2020. Marvel's Spider-Man 2 was announced during the PlayStation showcase in September 2021, featuring Peter Parker and Miles Morales teaming up to fight crime. A PC version of the sequel as yet to be confirmed.", "link": "https://www.youtube.com/watch?v=cf0fMQ_ckHQ", "date_published": "2022-08-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]