[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Pigeon Pit: Tiny Desk Concert", "description": "Lars Gotrich | July 28, 2022\nA song by Pigeon Pit has gotten me through this year. Chugging a punk twang with the sun at its back, \"milk crates\" recognizes the relentless churn of life, but still seeks freedom from tyranny, exhaustion and the everyday nonsense that drags us down. The first time I heard the song performed live was at the band’s Tiny Desk sound check, and I gave into the cathartic release with a few tears, mouthing along to the throng of gang vocals: \n\nNo job, no place to get away from\nI've been to a world worth living in\nNo rent, no lies to memorize\nNo f***** up world to drown out\n\nLomes Oleander's voice is shaky, but damn sure of what she's singing. She began Pigeon Pit as a solo project in Olympia, Wash., frenetically bashing on an acoustic guitar with stories fit for summer nights lit by fireflies and cigarette glow. Older songs paint portraits of someone figuring out her mess in a messy world, and trying her damndest to be kind to herself while doing so. At the Tiny Desk, Oleander explained one such song, “wichitalk,” as \"a song for the girl I never let myself be when I was a kid.\" \n\nPigeon Pit's been touring basements and baseball fields around the country with a full band, filling out the ramshackle edges of its sound with fiddle, banjo, pedal steel, bass and drums. Fans show up with homemade patches that bear Oleander's shout-alongable punk poetry, which describes everything from shared quiet moments (\"empties\") and swimming with friends (\"river song\") to sassin' cops (\"soup for my family\"). At the Tiny Desk, the folk-punk unit plays these songs from feather river canyon blues, an album released on the first day of 2022, offering some sweetness in a world that doesn't always share the same in return. \n\nSET LIST\n\"soup for my family\"\n\"empties\" \n\"river song\" \n\"wichitalk\" \n\"milk crates\" \n\nMUSICIANS\nLomes Oleander: vocals, guitar\nBo Lark: voice, fiddle\nMads Bun: banjo\nJosh Hoey: bass\nOlive Hannah: drums\nJim Rhian: pedal steel\n\nTINY DESK TEAM\nProducer: Lars Gotrich\nAudio Engineer: Josh Rogosin\nDirector: Kara Frame\nEditor: Joshua Bryant\nCreative Director: Bob Boilen\nVideographers: Kara Frame, Joshua Bryant, Michael Zamora \nProduction Assistants: Jill Britton, Joby Tanseco\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #pigeonpit", "link": "https://www.youtube.com/watch?v=3Wp99TlXu8U", "date_published": "2022-07-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]