[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "How to play your Epic Games on Steam Deck (and Linux)", "description": "Install the Startpage Privacy protection extension for free: https://add.startpage.com/en/protection/?campaign=4&source=aff \n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\nYou can also protect your privacy by using this extension from Startpage, each install helps the channel with a small commission: https://add.startpage.com/en/protection/?campaign=4&source=aff \n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:37 Sponsor: Protect your privacy online with Startpage's extension\n01:44 Installing the Epic Games launcher\n03:17 Using Heroic Games launcher\n05:25 How to run it from the SteamOS Interface\n06:38 Game Examples\n08:34 Sponsor: Get a Linux laptop or desktop from Slimbook\n08:57 Support the channel\n\nTo install Heroic, we'll need to go into the desktop mode, so go to the Steam Menu, then to \"Power\", and hit \"Switch to desktop\". Now you're in. Just remember to use a mouse and keyboard, either through bluetooth or plugged in via a USB C hub, because navigating that desktop with the right touch surface can be fiddly, and \n\nThe desktop mode has an \"app store\", called Discover, it's the blue shopping bag, in the main bottom bar, right after the Steam Deck logo that's also your menu.\n\nOnce Heroic is open, just login to your Epic Games account using the login buttons that appear by default. After a short loading time, your games will appear in the library. \n\nYou can now search, download them, update them, download any DLC, and start them. You als have a filter to only display installed games.\n\nYou can also access the store with the \"Store\" tab on the left, and even grab these free games if you want. You'll notice you also got access to the GoG store, so you can login there, and download and install your GoG games as well.\n\nThe settings have a few interesting things you can change. By default, your games will install in a Games folder, in your main user directory. You can change that here, and even select the SD card as the default location, if you want. \n\nTo do that, hit the little folder icon, then, in the file manager that opens, go to \"Other locations\" in the sidebar, then Computer, run, media, then the Sd card name, mine was named mmcb something once I formatted it using the steam deck. Click \"choose\", and you now have changed the default install path.\n\nIn the \"Other\" settings, you can also toggle an FPS counter, choose to run your games offline, or create shortcuts automatically after installing a game.\n\nOf course, these games will run through the same technology Valve uses on Steam: proton. This means that not all games will work, to check which games have compatibility, you can click the game, then the \"Tools\" tab, and click \"check compatibility\". It will take you to ProtonDB, the ultimate resource to see what runs and what doesn't.\n\nBy default, Heroic will use the latest official version of Proton, but if the compatibility reports tell you a game runs better with another version, you can also install that. Just use the \"Wine manager\" in the bottom left of Heroic, and install the version you need for a specific game.\n\nOnce that's done, head over to the library, hover over the game, and click the little cog icon. There, you can change the Wine version to the one you need to use. That's also where you can choose so sync saved games, or turn on auto sync to automatically keep your progress in sync with your other computers. You can also add launch arguments to the game, for example to skip cinematics in certain titles.", "link": "https://www.youtube.com/watch?v=F97b4Iv82vY", "date_published": "2022-03-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "The Steam Deck transformed how I play games", "description": "The Steam Deck completely transformed how I play games and how I connect with them at an emotional level, and I'm not alone in this...\n\nWatch the full talk on Linux 4 Everyone: https://www.youtube.com/watch?v=lzjmPmfLB-o\n\nGamingOnLinux: https://www.gamingonlinux.com/\n\nGardiner's Youtube channel: https://www.youtube.com/c/GardinerBryant\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\nYou can also protect your privacy by using this extension from Startpage, each install helps the channel with a small commission: https://add.startpage.com/en/protection/?campaign=4&source=aff \n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*", "link": "https://www.youtube.com/watch?v=zW8XeqCLf4o", "date_published": "2022-03-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]