[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "J'Nai Bridges: Tiny Desk (Home) Concert", "description": "This year, NPR Music is celebrating Black Music Month with an array of brand new Tiny Desk concerts — both from home and from behind our beloved Desk. Together, these artists represent the past, present and future of Black music. This month of carefully curated shows is a celebration of Black artists expressing themselves in ways we've never seen before, and of the Tiny Desk's unique way of showcasing that talent.\n\nSuraya Mohamed | June 27, 2022\nMezzo-soprano J'Nai Bridges is a rising star who recently won a Grammy Award and other accolades too long to list here. We're glad she accepted our invitation to record this Tiny Desk (home) concert, which features Damien Sneed on piano, Nolan Nwachukwu on bass and Christian Xavier McClendon McGhee on drums. She opens with \"Habanera\" from Carmen by Georges Bizet, a character she calls \"one of the strongest women in all of opera.\" She also performs \"Prayer\" by Carlos Simon, a close collaborator, and \"Heaven\" by Duke Ellington, before closing out her set with the hymn \"His Eye Is on the Sparrow.\"\n\nIn a message to the Tiny Desk team, she wrote: \"I remember NPR's Tiny Desk series premiering and thinking how refreshingly authentic and intimate these performances were. I often had dreams of performing here, but admittedly, I didn't think it was possible for opera singers to effectively express themselves in this way. I was wrong.\"\n\nBridges loves to sing opera but has also discovered that she holds many different voices within herself, which comes across in her wide-ranging set. \"When I meet people and tell them I'm an opera singer, it's almost always met with surprise, enthusiasm, and curiosity about what led me to this career,\" she writes. \"My upbringing — singing in the church — helped me discover other aspects of my voice, and then when I was exposed to opera it immediately opened a world of possibility. The voice is not limited to skin color, but it took me seeing someone who looked like me to realize that I too can sing opera.\"\n\nSET LIST\n\"Habanera\" (Georges Bizet from Carmen)  \n\"Prayer\" (Carlos Simon) / \"Heaven\" (Duke Ellington) \n\"His Eye Is On The Sparrow\" (Civilla Martin/Charles Gabriel)\n\nMUSICIANS\nJ'Nai Bridges: vocals\nDamien Sneed: piano \nNolan Nwachukwu: bass\nChristian Xavier McClendon McGhee: drums\n\nCREDITS\nProduced and Directed by: Carlos Ibarra and Andrew McLain\nCameras and Audio by: Derek Hallquist\nProduction Company: FutureSelf Media\nFilmed in the Clearlight Performance Space at The Blue Building\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Editor: Joshua Bryant\nAudio Mastering: Andie Huether\nAnimator: Kaz Fantone\nTiny Production Team: Bob Boilen, Josh Rogosin, Kara Frame, Michael Zamora, Maia Stern, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #JnaiBridges #BMM", "link": "https://www.youtube.com/watch?v=de3nUQIQIYY", "date_published": "2022-06-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]