[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Fetal development", "description": "Life begins with a new conception, 23 + 23 = 46 chromosomes\n\nCleavage, mitosis cell division\n\nImplantation of the early embryo or blastocyst occurs at about 7 days, a few hundred cells\n\nDevelopment at 4 Weeks\n\nhttps://www.webmd.com/baby/ss/slideshow-fetal-development\n\nAll tissues are present, connective, epithelial, neural tube which will become CNS\n\nDeveloping the structures that will form face and neck. \n\nThe heart and blood vessels continue to develop. \n\nLungs, stomach, and liver start to develop. \n\nA home pregnancy test would show positive.\n\nSlide 4, 5th week post ovulation\n\nAn opened oviduct with an ectopic pregnancy\n\nAnatomic features, including tail, limb buds, heart (which actually protrudes from the chest), eye cups, cornea/lens, brain, \n\nBlood cells now being produced\n\nCardiac contractions began at 3 weeks\n\nNeural tube is closed\n\n8 weeks\n\nFinal week of the embryonic period\n\nOrganogenesis in now complete\n\nFetal period begins start of week 9\n\nEyelids and ears are forming, and you can see the tip of the nose. The arms and legs are well formed. \n\nThe fingers and toes grow longer and more distinct.\n\nExternal genitals differentiate\n\nHeart has 4 contracting chambers\n\nUmbilical cord has one vein and two arteries\n\nDevelopment at 12 Weeks \n\nStarts to make its own spontaneous movements. Top of the uterus can be felt above pubic bone. \n\nElbows and knees have been bending since week 10\n\nHeart beat may be heard on examination\n\nThe sex organs of should start to become clear\n\nDevelopment at 16 Weeks \n\nMum can feel the top of the uterus about 3 inches below your belly button. \n\nThe baby's eyes can blink and the heart and blood vessels are fully formed. \n\nThe baby's fingers and toes have fingerprints.\n\nDevelopment at 20 Weeks\n\nBetween 17 and 20 weeks gestation, thalamo-cortical relays penetrate the cortex.\n\n20 weeks gestation, pain receptors are present and linked.\n\nBy 20 weeks gestation, the baby will respond to sound and move, wince, and recoil from sharp objects and incisions.\n\nBig stress hormone response since 18 weeks\n\nUterus the level of the belly button. \n\nThe baby can suck a thumb, yawn, stretch, and make faces. \n\n\"quickening.\"\n\nSlide 14, 24 weeks\n\nBaby now and responds to sounds by moving or increasing their pulse. \n\nMum may notice jerking motions if they hiccup. \n\nWith the inner ear fully developed, the baby may be able to sense being upside down in the womb.\n\nSlide 15, Development at 28 Weeks\n\nSleeps most of the time, clear sleep wake cycle by about 30 weeks\n\nActivity rapid eye movement sleep\n\nand the quiet resting state of non-REM sleep.\n\nBaby's First Dreams: Sleep Cycles Of The Fetus\n\nhttps://www.sciencedaily.com/releases/2009/04/090413185734.htm\n\nEvidence for early dreaming\n\nSlide 16, Development at 36 Weeks \n\nThe brain has been developing rapidly. \n\nLungs are nearly fully developed. \n\nThe head is usually positioned down into the pelvis by now. \n\n\n\nEarly term baby if born between 37-39 weeks\n\nTerm, born at 39-40 weeks\n\nLate term 41-42 weeks", "link": "https://www.youtube.com/watch?v=N2e02QdzJgg", "date_published": "2022-06-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]