[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "The Mavericks: Tiny Desk Concert", "description": "Felix Contreras | December 12, 2022\nWhen The Mavericks brought their long-running tour to the Tiny Desk, we could hear a well-oiled musical machine that has charmed audiences long enough to earn the band a lifetime achievement award from the Americana Music Association.\n\nFrom the opening strains of \"Back In Your Arms Again,\" we are treated to one of the best voices in the U.S. — that of Raul Malo. Backed by a smooth shuffle, Malo's voice is propelled by the subtle horn blasts that suggest a Tex-Mex border feel, driven home by the accordion.\n\n\"Mujer\" is a track from the band's 2020 album, its first album of all-Spanish material, which features the band's personality shifting from Americana shuffles to Mexican wedding boleros.\n\n\"Come Unto Me\" is a Mavericks chestnut and gives a glimpse into why the band is such a crowd favorite. The song filters that bolero feel of the previous song into a slow burner with a shouted chorus at the end that usually has the crowd on its feet and singing along.\n\nThe Mavericks are one of the best live shows out on the road these days and masters at bringing new fans into their fold. This performance gives us all a good idea of how the band weaves that magic.\n\nSET LIST\n\"Back In Your Arms Again\"\n\"Mujer\"\n\"Come Unto Me\"\n\nMUSICIANS\nRaul Malo: vocals, acoustic guitar\nEddie Perez: acoustic guitar, vocals\nJerry Dale McFadden: piano, vocals\nPaul Deakin: drums\nEd Friedland: bass\nPercy Cardona: accordion, vocals\nMax Abrams: saxophone\nJulio Díaz: trumpet, hand percussion \nLorenzo Molina: trumpet, hand percussion, vocals\n\nTINY DESK TEAM\nProducer: Felix Contreras \nDirector/Editor: Kara Frame\nAudio Engineer: Josh Rogosin\nCreative Director: Bob Boilen\nSeries Producer: Bobby Carter\nVideographers: Kara Frame, Maia Stern, Joshua Bryant, Sofia Seidel\nProduction Assistant: Jill Britton\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #themavericks", "link": "https://www.youtube.com/watch?v=M6Rh-CzEo24", "date_published": "2022-12-12 10:00:08+00:00", "persistent": false, "user": null, "language": "en-US"}]