[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mad Maggie And Titanfall-like LTM Coming To Apex Legends | GameSpot News", "description": "In This episode of GameSpot News, Persia talks about the new legend and game mode coming to Apex Legends season 12, Elden Ring goes gold while Dark Souls servers are shut down due to hackers, and more.\n\nVideo Notes: In the most recent “Stories From The Outlands”, it is confirmed that Mad Maggie will be the next playable legend in Apex Legends season 12. There will also be a new 9v9 game mode with infinite respawns where you control points to win similar to Titanfall’s Hardpoint. More is said to come in the next season titled Defiance.\n\nFrom Software has completed development on the long-awaited Elden Ring but the work isn't completely done as the developers are now working on a day one patch that will include updates and optimizations. This news arrives along with an exploit that caused the company to temporarily take down all Dark Souls PvP servers on PC while under investigation.\n\nLastly, Persia talks about the newest crossover between Dead By Daylight and the horror movie series, Saw. \n\nFor more information on all of our topics, please visit gamespot.com.\n\nTimestamps:\nIntro - 00:00\nApex Legends - 00:08\nElden Ring - 01:34\nDead By Daylight - 03:05\nOutro - 03:43\n\n#ApexLegends", "link": "https://www.youtube.com/watch?v=_IQY33YSK5c", "date_published": "2022-01-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Legends: Arceus - Everything To Know", "description": "With Pokémon Legends: Arceus right around the corner on January 28th, here's everything you need to know about the brand new adventure in the Hisui Region.\n\nPokemon has had plenty of fun stories and interesting tidbits throughout its lifetime. The historic franchise has been going strong for over 25 years. With that longevity comes iconic glitches, bugs, and playground stories of secret Pokemon embedded in-game codes. We break down a small handful of things that you may not know about Pokemon in this video.\n\nThe stories range wildly, from the fact that Nintendo had no idea Mew even existed to late president Satoru Iwata being an absolute legend with his assistance on compressing data in Gold and Silver. There are dozens of Easter eggs and fun trivia-style facts about Pokemon.\n\nPokemon Legends: Arceus will be the latest entry in the Pokemon franchise and arguably one of the most anticipated games in 2022. Be sure to check out our coverage and upcoming guides, breakdowns, and previews by subscribing to our GameSpot YouTube channel!\n\n#pokemon", "link": "https://www.youtube.com/watch?v=BLIelECjWS0", "date_published": "2022-01-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xbox Game Pass Games Not To Miss", "description": "The Game Pass catalogue continues to grow new games like Rainbow Six Extraction, and some recent classics like the HITMAN Trilogy. \n\nThere's a lot of games to play on Xbox Game Pass, and with its catalog ever-growing, it can be a lot to keep track of. In this video, we go over some of the recent games to make their way to the service, like Nobody Saves The World, or Rainbow Six Extraction, as well as some hidden gems like Gorogoa, and The Procession To Calvary.\n\nIf there weren't already enough games to choose from, Microsoft is bound to acquire Activision Blizzard in 2023, meaning Game Pass is about to get a lot bigger. Once the deal closes, Microsoft will be the home of some of gamings largest franchises like Call of Duty, Overwatch, and Candy Crush. \n\nEvery Major Franchise Xbox Now Owns: https://youtu.be/UkYe4pRaSQI\n\nIn an interesting twist, this means Microsoft will be the adoptive parent of Crash Bandicoot and Spyro — two franchises born on PlayStation. It's safe to assume we'll be seeing a lot of Activision Blizzard games showing up on Game Pass in the near future. \n\n00:00 - Intro\n00:34 - Rainbow Six Extraction\n01:26 - Nobody Saves The World\n02:05 - Death's Door\n03:00 - Mass Effect Legendary Edition\n03:40 - HITMAN Trilogy\n04:22 - Danganronpa: Trigger Happy Havoc\n04:52 - AI: The Somnium Files\n05:23 - Firewatch\n06:15 - Gorogoa\n06:44 - The Procession To Calvary\n07:22 - Outro\n\n#xbox #gamepass", "link": "https://www.youtube.com/watch?v=NaORqwchY7E", "date_published": "2022-01-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends Judgment Trailer - Stories from the Outlands", "description": "It’s time for Mad Maggie to face justice for her crimes. But when you can’t be innocent and you won’t be guilty, what fate lies in store?\n\nApex Legends™ is a free-to-play hero shooter game where legendary characters battle for glory, fame, and fortune on the fringes of the Frontier. Play for free now on PlayStation 4, PlayStation 5, Xbox One, Xbox Series X|S, Nintendo Switch, and PC via Origin and Steam.\n\n#ApexLegendsDefiance  #ApexDefiance #ApexLegends", "link": "https://www.youtube.com/watch?v=QP_N4dRt3EM", "date_published": "2022-01-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "ELDEN RING – Taipei Game Show 2022 Full Presentation (Japanese)", "description": "Check out the full presentation from the Taipei Game Show 2022 on Elden Ring! This Elden Ring presentation is in Japanese and has some Q&A + breakdowns covering George RR Martin, level design, and PS5 specific features.", "link": "https://www.youtube.com/watch?v=1zRWNVmdBi0", "date_published": "2022-01-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Legends: Arceus - Official Gameplay Overview Trailer", "description": "Explore the Sinnoh region of old in Pokémon Legends: Arceus! As a member of the Galaxy Expedition Team, you can study Pokémon to complete the Hisui region’s first Pokédex. Find newly discovered Pokémon, embark on survey missions, explore natural expanses, and uncover the mystery surrounding the Mythical Pokémon, Arceus.\n\n#PokemonLegendsArceus #NintendoSwitch", "link": "https://www.youtube.com/watch?v=r4yMIFAAo7g", "date_published": "2022-01-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]