[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Roger Eno: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nTom Huizenga | April 27, 2022\nRoger Eno’s home is part of what once formed an 11th-century abbey called St. Wilmott’s, situated on the border of Norfolk and Suffolk near England’s southeastern coast. The bucolic setting mirrors Eno’s quiet, slowly evolving music which, for this Tiny Desk (home) concert, features five pieces from his new album The Turning Year.\n \nEno refers to his process as “decomposing,” taking the time to strip away all nonessentials to finally arrive at something more pure and perhaps more powerful. He opts for quality over quantity. Every note, carefully chosen, seems to have its own preeminence. At an old upright piano — with the sustain pedal firmly engaged — Eno taps out his slender but potent melodies, gently conducting his string players as they float above and between the notes, providing color and warmth.\n \nWhile there’s an Erik Satie-inspired Zen quality to “A Place We Once Walked,” with its seesawing rhythm, the feather-light notes of “Something Made Out of Nothing” recall the deep ambient spaces that Eno created with his older brother Brian on their 1983 album Apollo: Atmospheres & Soundtracks. In his writing about The Turning Year, Roger Eno says he thinks of these pieces as “a series of short stories or photographs of individual scenes, each containing their own character.”\n \nTo close the performance, Eno introduces his two daughters Cecily and Lotti who sing an arrangement of “Bells.” On the album, it’s a typically wistful Eno piece for solo piano, but the harmonizing voices here give the music a lullaby quality — and offer up a taste of what it must be like to make music with the Eno family.\n\nSET LIST\n“Clearly\" \n“The Turning Year\" \n“A Place We Once Walked”\n“Something Made Out of Nothing”\n“Bells” (feat. Cecily Eno & Lotti Eno) \n\nMUSICIANS\nRoger Eno: piano, composer\nZara Benyounes: violin I\nVenetia Jollands: violin II\nStephen Upshaw: viola\nReinoud Ford: cello\nCecily Eno: vocalist, vocal arrangement on “Bells”\nLotti Eno: vocalist\n\nCREDITS\nDave Meyer: Camera operator, editor\nNeil Foster: Camera operator\nDylan Barber: Sound engineer\nRecorded at St. Wilmott’s Abbey (Roger Eno’s/Bee Eno’s Home), Suffolk\n\n\nTINY DESK TEAM\nProducer: Tom Huizenga\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Joshua Bryant, Michael Zamora, Maia Stern, Ashley Pointer\nVP, NPR Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n\n#NPRMusic #TinyDesk #RogerEno", "link": "https://www.youtube.com/watch?v=gnKRe1-zF28", "date_published": "2022-04-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "A Strange Loop: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nJosh Rogosin | April 26, 2022\nRather than use the stage at Feinstein's/54 Below, the cast of A Strange Loop cram into a booth for their Tiny Desk (home) concert. The protagonist of the musical is an usher, so performing in the crowd makes sense. 54 Below played a pivotal role in the musical's rise when, in 2016, composer Michael R. Jackson performed a concert version for New Musicals at 54. Little did anyone know that the show would go on to win the Pulitzer Prize for Drama in 2020. The cast reunited at \"Broadway's Supper Club\" to sing a five-song medley led by the show's author to celebrate their opening at the Lyceum Theater on Broadway.\n\nJackson explains A Strange Loop is \"a musical about a young Black gay man named Usher who works as an usher at a Broadway show who is writing a musical about a young Black gay man named Usher who works as an usher at a Broadway show... who is caught in a self-referential loop of his own self hatred.\" The ensemble of characters joining him are a collection of \"fierce but completely obnoxious\" \"Thoughts\" — literally billed in the show's Playbill as \"Thoughts 1-6.\"\n\nThe show at the Lyceum clocks in at 100 minutes with no intermission. Even in this small, Tiny Desk (home) version it's easy to get caught up in Usher's whirlwind of emotions as he's tormented by his thoughts. One can only imagine sitting in a dark theater with a bunch of strangers, laughing and crying, spiraling out together on Usher's strange loop.\n\nSET LIST\n\"Intermission Song\"\n\"We Wanna Know\"\n\"Inner White Girl\"\n\"Periodically\"\n\"Memory Song\"\n\nMUSIC AND LYRICS\nMichael R. Jackson\n\nCAST\nAntwayn Hopper\nJames Jackson, Jr.\nL Morgan Lee\nJohn-Michael Lyles\nJohn-Andrew Morrison\nJaquel Spivey\nJason Veasey\n\nBAND\nRona Siddiqui: music direction, keys\nBeth Callen: guitar\nIan Jesse: bass\nMarques Walls: drums\n\nCREDITS\nVideo by Magicshak Media\nCamera Operators: Nick Shakra, Anton Ponomarev, Maksim Kataev\nAudio: Amanda Raymond\nAudio Mix: Josh Rogosin\nDirected by Stephen Brackett\nProduced by Lilly Claar\nHair & Makeup by Kirk Cambridge Del-Pesche, Dotty Petersen, Elias Prince\nSpecial Thanks: Raja Feather Kelly, Cherie B. Tay, Barbara Whitman, Jimmy Wilson, Arnulfo Maldonado, Corey Umlauf, 321 Theatrical Management, Feinstein's/54 Below\n\nTINY DESK TEAM\nProducer: Josh Rogosin\nVideo Producer: Michael Zamora\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Joshua Bryant, Maia Stern, Ashley Pointer\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#NPRMusic #TinyDesk #StrangeLoopBway", "link": "https://www.youtube.com/watch?v=ObD7Qjai55Y", "date_published": "2022-04-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]