[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Big Thief: Tiny Desk (Home) Concert", "description": "Bob Boilen | July 20, 2022\nI love seeing friends playing comfortably at home, especially when those friends are members of my favorite band. What we see in this Tiny Desk (home) concert is playfulness substituting for the intensity that I normally find in Big Thief on a big stage. This band has made many of my best-loved albums in the past few years, beginning with its 2016 debut Masterpiece and including its 2022 double-album Dragon New Warm Mountain I Believe in You. The first three songs in this set all come from that album and were written by singer Adrianne Lenker, with \"Certainty\" co-written with guitarist Buck Meek.\n\nBig Thief songs are often filled with tender tales and poetic and playful words. I can say the same for Adrianne Lenker's many solo albums and for Buck Meek's 2021 solo album, Two Saviors. Drummer James Krivchenia produced Big Thief's recent album and also a 2020 ambient album of his own, A New Found Relaxation. Max Oleartchik plays upright bass for this intimate acoustic set on the top floor of a house in \"windy Connecticut.\"\n\nThere's a bit of a \"hold on to your hat\" feel here, with players watching each other for a possible surprise. Maybe it's James Krivchenia's banjo percussion, the galloping rhythm on \"Certainty\" or how the four musicians sing aloud on a chorus; it is so much fun to see it all unfold. The final song was the biggest surprise; it's an unreleased song Big Thief has been performing, appropriately called \"Happiness.\"\n\nSET LIST\n\"Change\"\n\"Dried Roses\"\n\"Certainty\"\n\"Happiness\"\n\nMUSICIANS\nAdrianne Lenker: vocals, guitar\nBuck Meek: guitar, vocals\nMax Oleartchik: bass, vocals\nJames Krivchenia: percussion, vocals\n\nCREDITS\nVideo by Adam Gundersheimer & Vanessa Haddad\nAudio by Alice Wilder \n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Editor: Michael Zamora\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Kara Frame, Joshua Bryant, Maia Stern, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=TCsFgJsJ5Uc", "date_published": "2022-07-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]