[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "ELECTRON: why people HATE it, why devs USE it", "description": "Download the open source best practices report here: https://meet.tuxcare.com/idc-peerscape-study\nGrab a brand new laptop or desktop running Linux:https://www.tuxedocomputers.com/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to a weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYouTube: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n📹 MORE VIDEOS FROM ME\nLinux news in Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\nGaming on Linux: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nI'm also on ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n🏆 FOLLOW ME ELSEWHERE:\nTwitter : http://twitter.com/thelinuxEXP\nMastodon: https://mastodon.social/web/@thelinuxEXP\nPixelfed: https://pixelfed.social/TLENick\nDiscord: https://discord.gg/xK7ukavWmQ\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\nThis video is distributed under the Creative Commons Share Alike license.\n\n#linux #electron #webdevelopment \n\n\n00:00 Intro\n00:33 Get a free study on open source best practices\n01:38 How electron works\n02:47 Why developers like electron\n06:37 System integration isn't good\n10:15 Disk usage and performance\n13:03 Linux needs electron\n14:54 Get a laptop or desktop that runs Linux out of the box\n16:00 Support the channel\n\n\nDiscord issues with electron: https://theevilskeleton.gitlab.io/2022/05/29/a-letter-to-discord-for-not-supporting-the-linux-desktop.html\n\nOMGUbuntu list of electron apps: https://www.omgubuntu.co.uk/2019/02/best-electron-apps\n\n\n\nSo, what IS electron, exactly?\n\nelectron is a framework that lets developers create applications using web technologies, like javascript, HTML or CSS. It's open source, and it's cross platform, meaning that apps built with electron run on Windows, Mac and Linux.\nectly inside of the app, instead of being accessed on the internet.\n\nSo why do developers go the electron route?\n\nDeveloping apps using native technologies on all platforms takes a long time, a different set of skills and knowledge for each platform, and so you need more developers, more time, and more money.\n\nElectron lets you develop ONCE.\n\nSecond reason: debugging code for web technologies like javascript is pretty easy compared to lower level languages like C, C++, or objective C. Javascript is interpreted line by line, so noticing where the error is is way easier.\n\n\nAnother reason is that electron apps can auto update very easily: all you have to do is make sure that your electron app can detect when the code for your website has changed, and download the new files on your computer, a quick reload of the page, and you're up to date. \n\nBut, electron has a bunch of issues as well. \n\nFirst, electron doesn't integrate really well with the operating system: it's just a web browser displaying a website that is stored on your computer instead of being stored on a server. This means that if electron doesn't support a specific feature of your operating system, the apps using it also won't.\n\nA bigger problem, though, is the fact that developers often don't update the electron base, or not often enough. Electron, using CHromium, needs to be as up to date as any web browser you'd use everyday, to ensure that security flaws are patched.\n\nThat's often not the case. And it gets worse when you take into consideration operating system integration. An example is Discord on Linux. It uses an older version of electron, that doesn't support Wayland very well. electron does have wayland support, and good support at that, but Discord, by not updating the electron version they use, deprive users of that support.\n\nAnd then there's the performance and resource usage. Since electron apps ship basically the whole of chromium's codebase, they aren't small. Discord, for example, once installed, weighs more than 700 MB. Almost a gigabyte. Even the most basic of Hello World applications would take about 100MB, just to display a line of text.\n\nAnd there's the performance impact: chromium isn't a lighweight browser at all. Discord, again, on my system, with all its processes, uses about 480 MB. And that RAM usage is the same whether the app is minimized to the tray or fully open. GIMP, when opening a new blank document, uses 500MB.\n\nAnd still, specifically for us Linux users, electron means we get applications on Linux that we wouldn't have had otherwise.", "link": "https://www.youtube.com/watch?v=G1K0Mb-rLBU", "date_published": "2022-07-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]