[{"source": "https://www.dailywire.com/feeds/rss.xml", "title": "BREAKING: Republicans Fail To Take Back The Senate From Democrats: Projection", "description": "Republicans will fail to gain enough seats to take back the Senate majority, according to a projection by DecisionDeskHQ. The Senate will remain under Democrat control, since ties are broken by the vice president. The projection came after DecisionDeskHQ called the Nevada race for the Democrats. The partisan makeup of the Senate will be decided ...", "link": "https://www.dailywire.com/news/breaking-republicans-fail-to-take-back-the-senate-from-democrats-projection", "date_published": "2022-11-12 21:39:21+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "BREAKING: Dem Incumbent Catherine Cortez Masto Wins Nevada Senate Race: Projection", "description": "Democratic incumbent Senator Catherine Cortez Masto has narrowly defeated Republican challenger Adam Laxalt in the race for Nevada Senate, according to Decision Desk. With 98% of the vote counted, Cortez Masto holds 48.7% of the vote to Laxalt’s 48.2%. Cortez Masto’s Saturday evening victory comes after a lengthy ballot count process in the state. Laxalt, ...", "link": "https://www.dailywire.com/news/breaking-dem-incumbent-catherine-cortez-masto-wins-nevada-senate-race-projection", "date_published": "2022-11-12 21:30:23+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Personal Fowl’: TSA Absolutely Roasts Traveler For Hiding A Handgun In Raw Chicken", "description": "The Transportation Security Administration (TSA) absolutely roasted a traveler who apparently tried to sneak a handgun through security by hiding it inside a raw chicken. The TSA shared a pun-riddled post on Instagram on Monday — including several photos of both the contraband and the uncooked bird — warning travelers that agents would always be ...", "link": "https://www.dailywire.com/news/personal-fowl-tsa-absolutely-roasts-traveler-for-hiding-a-handgun-in-raw-chicken", "date_published": "2022-11-12 21:08:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "BREAKING: GOP Loses Key House Seat After Trump Pushed To Remove The Incumbent Republican", "description": "The Republican Party lost a key U.S. House seat Saturday evening in their quest to retake control of the House of Representatives as Joe Kent (R) lost to Marie Gluesenkamp (D) in Washington&#8217;s 3rd Congressional District. The upset loss by Kent comes after former President Donald Trump pushed for Rep. Jaime Herrera Beutler (R-WA) to be replaced ...", "link": "https://www.dailywire.com/news/breaking-gop-loses-key-house-seat-after-trump-pushed-to-remove-the-incumbent-republican", "date_published": "2022-11-12 20:23:09+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Is It True That McConnell Tanked Senate Races By Not Funding Candidates Like Masters?", "description": "Supporters of Donald Trump claim that Senate Minority Leader Mitch McConnell is responsible for Senate losses because he failed to direct sufficient funding to candidates who ran with the help of backing from the former president. An analysis of campaign finance records by The Daily Wire explored whether that is true.", "link": "https://www.dailywire.com/news/is-it-true-that-mcconnell-tanked-senate-races-by-not-funding-candidates-like-masters", "date_published": "2022-11-12 19:53:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Dr. Jordan B. Peterson Analyzes Trump, Answers Whether He Should Run In 2024", "description": "Dr. Jordan B. Peterson analyzed former President Trump&#8217;s personality, and gave his opinion on whether he should run in 2024. Appearing on &#8220;Piers Morgan Uncensored&#8221; Friday, Morgan asked Peterson if Trump was a narcissist, a psychopath, or a sociopath. Peterson said Trump&#8217;s business success, personal loyalty, and accomplishments as president meant that he was not ...", "link": "https://www.dailywire.com/news/dr-jordan-b-peterson-analyzes-trump-answers-whether-he-should-run-in-2024", "date_published": "2022-11-12 19:39:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Frontier Flight Forced Into Emergency Landing After Armed Passenger Threatens To Hurt Others, Report Says", "description": "A passenger was taken into custody late Friday night after reportedly threatening to harm other passengers onboard a Frontier flight from Cincinnati/Northern Kentucky International Airport headed to Tampa. The flight was diverted to Atlanta after passengers notified the crew of the situation when the man went to the bathroom. The suspect&#8217;s identity has not been ...", "link": "https://www.dailywire.com/news/frontier-flight-forced-into-emergency-landing-after-armed-passenger-threatens-to-hurt-others-report-says", "date_published": "2022-11-12 19:17:05+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Dr. Jordan B. Peterson: Social Media Is Part Of ‘Pollution Of The Domain Of Public Discourse’", "description": "Dr. Jordan B. Peterson said that social media platforms are contributing to a &#8220;pollution&#8221; of public discourse. Appearing on &#8220;Piers Morgan Uncensored&#8221; Friday, Peterson refuted the idea that social media contributes to tribalism and polarization in politics. Instead, Peterson said that social media incentivizes anti-social and self-promoting behavior among users. Peterson cited a paper in ...", "link": "https://www.dailywire.com/news/dr-jordan-b-peterson-social-media-is-part-of-pollution-of-the-domain-of-public-discourse", "date_published": "2022-11-12 18:09:52+00:00", "persistent": true, "user": null, "language": "en-US", "tags": ["social media", "jordan peterson"]}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Two World War II Planes Collide In Midair Incident Over Texas", "description": "Two World War II-era planes collided in midair Saturday at an air show in Dallas as videos posted online showed the planes bursting into flames after slamming into ground. The incident took place at the Wings Over Dallas World War II Airshow early Saturday afternoon. “A Boeing B-17 Flying Fortress and a Bell P-63 Kingcobra ...", "link": "https://www.dailywire.com/news/two-world-war-ii-planes-collide-in-midair-incident-over-texas", "date_published": "2022-11-12 17:30:53+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Republicans, Republican-Leaning Independents Shift In Who They Want To Be GOP’s Nominee In 2024: Poll", "description": "Republican and Republican-leaning Independents have shifted their views of who they believe is the best choice to be the Republican Party&#8217;s presidential nominee in 2024. A new survey conducted by YouGov after Tuesday&#8217;s midterm elections found that conservatives now want Florida Governor Ron DeSantis (R) to be the party&#8217;s nominee. &#8220;More Republicans and Republican-leaning Independents ...", "link": "https://www.dailywire.com/news/republicans-republican-leaning-independents-shift-in-who-they-want-to-be-gops-nominee-in-2024-poll", "date_published": "2022-11-12 16:23:14+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Billionaire FTX Founder Who Lost Entire Fortune Gave Massive Sum To Democrats Before Empire Collapsed", "description": "Sam Bankman-Fried, the now-bankrupt founder of the cryptocurrency exchange FTX, gave a staggering sum of money to Democrats and far-left causes this midterm election cycle before his multi-billion dollar empire imploded this week. FTX, which is headquartered in the Bahamas, was launched in 2019 and had accrued more than one million users by 2022. Users ...", "link": "https://www.dailywire.com/news/billionaire-ftx-founder-who-lost-entire-fortune-gave-massive-sum-to-democrats-before-empire-collapsed", "date_published": "2022-11-12 15:39:23+00:00", "persistent": false, "user": null, "language": "en-US"}]