[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Is Linux being DUMBED DOWN?", "description": "Get 100$ credit for your own Linux and gaming server: https://www.linode.com/linuxexperiment \n\nGrad a brand new laptop or desktop running Linux out of the box: https://www.tuxedocomputers.com/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMastodon: https://mastodon.social/web/@thelinuxEXP\n\nPixelfed: https://pixelfed.social/TLENick\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n01:06 Sponsor: 100$ off your Linux or Gaming server with Linode\n01:57 More user friendly = more accessible\n06:01 You still have all the power\n07:20 Counter Examples\n11:47 Shifting the complexity to power users\n14:04 Sponsor: Grab a computer with Linux out of the box with Tuxedo\n15:16 Or give ME your money!\n\nWhat I'm trying to convey here is that our desktops are user friendly, whether it's KDE, or GNOME, or Cinnamon, but it doesn't mean that they're dumbed down. Bing user friendly doesn't mean that we need less options, less preferences, or to get rid of the command line entirely, or only have projects with 3 buttons that even a baby could use.\n\nAll these changes don't remove anything and don't prevent power users to still use Linux how they want to, or how they're used to.\n\nThe command line is still there, all desktops have a terminal emulator, and access to multiple TTYs. Options are still there, in KDE, in GNOME, in Cinnamon. You have TONS of preferences, panels, extensions, configuration options, and various apps you can use to replace the components you don't like or you'd prefer not to use.\n\nThere are compromises to the \"'new Linux desktop vision\".\n\nWayland does remove a few features from X.org. X could let you display a device's stuff on another device through the network, for example. Wayland doesn't allow that. But Wayland also offers a bunch of new stuff that simply couldn't be done in X.org, like different refresh rates or scaling on different monitors, treating each monitor as a separate surface.\n\nThere's also the GNOME 2 to GNOME 3 transition.\n\nGNOME 3 removed a LOT of the customization, and power people were used to. Over the course of its life, GNOME has added back all the features GNOME 2 had, and can now be even MORE customizable and powerful than GNOME 2 ever could be, with extensions.\n\nThen there's flatpaks and portals. These can introduce limitations: the permission system isn't perfect, and permissions can be incorrectly set, so your app doesn't have access to the filesystem when it needs it for example.\n\nSo, sure, making our Linux desktops easier to use, more secure, advancing them technologically to really take advantage of new hardware does come with some compromises.\n\nAs more and more people are able to just pick up a distro, install it, and run it, we remove barriers to entry, but we also remove a technical requirement on our users, which means that in our current imperfect state, where issues still appear, these non technical users don't really know how to act.\n\nSo, to conclude: NO, we're not \"dumbing down Linux\" to cater to smartphone users. We're making Linux more accessible to the general public, and while there are a few compromises, power users will be able to deal with them far more easily than beginners were ever able to deal with the roadblocks these compromises lifted. It's a transfer of the complexity: less complexity for beginners, more complexity for power users, which are way better equipped to deal with it**", "link": "https://www.youtube.com/watch?v=cGgaXY0DW18", "date_published": "2022-05-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]