[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "‘Wherever I Am Is Her Home’: A Mom & Her Daughter Navigate Eviction | Facing Eviction | FRONTLINE", "description": "Amid the COVID pandemic, Alexys Hatcher lost her job as a manager at a shoestore, and then her home — despite a federal moratorium on evictions. Meet Hatcher and her young daughter in an excerpt from FRONTLINE and Retro Report’s documentary, “Facing Eviction.”\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate. \n\n“Facing Eviction,” produced with support from The WNET Group’s Chasing the Dream initiative, follows people and families across the country who struggled to remain housed as COVID upended the economy. The documentary examines how federal pandemic housing protections—including a temporary ban on evictions and a massive rent relief program—played out in the experiences of people living through this precarious time, and how parents like Hatcher (who eventually received federal rent relief that helped her secure housing) tried to maintain stability for their children in the meantime.\n\n“She knew something wasn't right. She was expecting something was going to happen,” Hatcher said of her daughter. “But one thing she knows is, Mommy is always there; Mommy is still here. So it must be OK. You know, even though she knows her stuff is not at home. Even though she knows we're not going back there, she doesn't know we don't have a home because to her— Sorry.”\n\nHatcher teared up. \n\n“To her, wherever I am is her home.”\n\n“Facing Eviction” will premiere in full on Tuesday, July 26, 2022, at 10/9c on PBS stations (check local listings). The documentary will also be available to stream at pbs.org/frontline, in the PBS Video App and here on FRONTLINE’s YouTube channel.\n\n\n\n#Eviction #Texas #DocumentaryExcerpt\n\n\nFind FRONTLINE on the PBS Video App, where more than 300 of our documentaries are available to watch any time: https://to.pbs.org/FLVideoApp \n\nSubscribe on YouTube: http://bit.ly/1BycsJW \n\nInstagram: https://www.instagram.com/frontlinepbs \n\nTwitter: https://twitter.com/frontlinepbs \nFacebook: https://www.facebook.com/frontline \n\n\n\nFRONTLINE is produced at GBH in Boston and is broadcast nationwide on PBS. Funding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Additional support for FRONTLINE is provided by the Abrams Foundation, the John D. and Catherine T. MacArthur Foundation, Park Foundation, the Heising-Simons Foundation; and the FRONTLINE Journalism Fund, with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen. Funding for Facing Eviction is provided by The WNET Group’s Chasing the Dream, a public media initiative reporting on poverty, justice, and economic opportunity in America, with major funding by The JPB Foundation and additional funding from The Peter G. Peterson and Joan Ganz Cooney Fund, and Sue and Edgar Wachenheim, III.", "link": "https://www.youtube.com/watch?v=H7FPthNALC0", "date_published": "2022-07-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]