[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Lab leak latest report", "description": "NIH cancels Wuhan funding\n\nhttps://www.ncbi.nlm.nih.gov/search/research-news/9563/\n\nSAGO, came together last year after widespread criticism of a joint WHO-China investigation\n\nLab-leak theory as ‘extremely unlikely’\n\nChina via frozen fish\n\nWHO covid origins report\n\nhttps://www.washingtonpost.com/world/2022/06/09/who-sago-covid-origins/?utm_campaign=wp_to_your_health&utm_medium=email&utm_source=newsletter&wpisrc=nl_tyh&wpmk=1&pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJjb29raWVuYW1lIjoid3BfY3J0aWQiLCJpc3MiOiJDYXJ0YSIsImNvb2tpZXZhbHVlIjoiNWZjM2FmNGNhZTdlOGE0OGZkZGQ0OWEyIiwidGFnIjoiNjJhM2EyNzg5NTYxMjE3NTVhYWY5N2Y2IiwidXJsIjoiaHR0cHM6Ly93d3cud2FzaGluZ3RvbnBvc3QuY29tL3dvcmxkLzIwMjIvMDYvMDkvd2hvLXNhZ28tY292aWQtb3JpZ2lucy8_dXRtX2NhbXBhaWduPXdwX3RvX3lvdXJfaGVhbHRoJnV0bV9tZWRpdW09ZW1haWwmdXRtX3NvdXJjZT1uZXdzbGV0dGVyJndwaXNyYz1ubF90eWgmd3Btaz0xIn0.w66_MlVhC871nwsuz46ierPOCarculZxc5AOIXLU5Z8\n\nhttps://cdn.who.int/media/docs/default-source/scientific-advisory-group-on-the-origins-of-novel-pathogens/sago-report-09062022.pdf?sfvrsn=42b55bbc_1&download=true\n\nMembers of the group from Brazil, China and Russia\n\nobjected to the calls for further investigation into the “lab leak” theory\n\nWHO Director-General, Dr Tedros Adhanom Ghebreyesus\n\nsent two letters,….. and further information into the laboratory hypotheses\n\nSAGO was not provided any information related to studies conducted evaluating the laboratory hypotheses as a possible introduction into the human population.\n\nThe possibility of a breach in biosafety or biosecurity measures \n\npossibility of novel pathogens escaping into the human population due to a breach … in a laboratory\n \nthis has unfortunately happened with other pathogens\n\nare still lacking in most low- and middle- income countries.\n \nNeed for identification\n\ngain of function\n\ndual use research of concern\n\nAt the present time\n\navailable epidemiological and sequencing data,\n\nsuggest ancestral strains to SARS-CoV-2 have a zoonotic origin,\n\nclosest genetically related viruses, beta coronaviruses, identified in Rhinolophus bats\n\nChina in 2013, (96.1%) \n\nLaos in 2020 (96.8%)\n\n“At this point, the strongest evidence is still around zoonotic transmission,” \n\nMarietjie Venter, chair of the WHO team, virologist University of Pretoria\n\nHowever, the precursor viruses that have been identified in bats are definitely not close enough to be the virus that spilled over into humans\n\nHumans and chimps, 98.9%\n\nhttps://sciencing.com/animals-share-human-dna-sequences-8628167.html\n\nBonobos 98.7%\n\nHuman to human 99.9%\n\nhuman DNA in a banana, about 60%\n\nHowever\n\nso far neither the virus progenitors,\n\nnor the natural/intermediate hosts,\n\nor spill-over event to humans,\n\nhave been identified\n\nHuanan seafood market in Wuhan played an important role early in the amplification\n\nScientific advisory group for the origins of novel pathogens (SAGO)\n\nfirst preliminary report from the\n\nto WHO\n\nrepresents work that is ongoing and not yet complete. \n\nThe work of the SAGO should be read as a work in progress. \n\nglobal framework to study emerging and re-emerging pathogens of pandemic potential\n\noffers preliminary recommendations to advance our understanding of the emergence of SARS-CoV-2 into the human population\n\nnotes that there are key pieces of data that are not yet available\n\nFurther studies, follow up on several gaps in our knowledge\n\nyet to be determined where the initial spill over event(s) occurred\n\nNeed to examine environmental samples collected from specific stalls and drains at the market in January 2020\n\nStudies to identify possible animal sources from which the environmental contamination could have originated from have not been completed. \n\nClinical history and seroprevalence in humans and animals from the source farms of animals sold at Wuhan markets. \n\nVerification analyses of human samples collected through national surveillance programs, \nduring the months prior to December 2019\n\nGenetic studies of coronaviruses in wildlife species,\n\nThe SAGO notes\n\nNo new lab leak information\n\nrecommends further investigations into this and all other possible pathways. \n\nThe SAGO will remain open to any and all scientific evidence that becomes available,\n\nto allow for comprehensive testing of all reasonable hypotheses.", "link": "https://www.youtube.com/watch?v=1xy9BAbH2BA", "date_published": "2022-06-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]