[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "HP DEV ONE: is this Linux laptop a THINKPAD KILLER?", "description": "Download the State of Enterprise Linux Security Management Report here: https://tuxcare.org/ponemon_report\n\nGrab a brand new laptop or desktop running Linux:https://www.tuxedocomputers.com/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMastodon: https://mastodon.social/web/@thelinuxEXP\n\nPixelfed: https://pixelfed.social/TLENick\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\nThis video is distributed under the Creative Commons Share Alike license.\n\n\n00:00 Intro\n01:11 Sponsor: Get a free study on the state of Linux security\n02:14 Build Quality\n04:17 Display, Keyboard, Nub, Trackpad\n08:46 Performance and battery life\n11:28 Software Integration\n14:13 Accessories\n15:45 Buy or not?\n16:50 Support the channel\n\n\nThe Dev One is a device that targets developers. It's made out of aluminium, and the chassis is very rigid, with almost no deck flex at all.\n\nThe device itself has a wedge shape, and it's pretty thin, at less than 2cm at its thickest point. It weighs less than 1.5 kilograms, although it does feel relatively heavy and solid.\n\nThe screen is covered in glass, and so it's pretty reflective and susceptible to fingerprints. It's 14 inch, at 1920 by 1080, and it can go up to 1000 nits of brightness.\n\nThe bezels are relatively large for today's standards, but they're nothing to complain about, and the top one hosts a 720p webcam, with a privacy shutter included, which is cool, no need for duct tape or post it notes.\n\nThe webcam is your usual potato quality, it's not full HD, it's a bit grainy, and it doesn't handle lighting very well. The microphone isn't bad at all though.\n\nLet's move on to the I/O. On the left side, you have your kensington lock, and 2 USB A ports that go up to 5 Gigabits per second, as well as the holy headphone jack.\n\nOn the right side, you have the port for the barrel charger included in the box, an HDMI 2.0 port, and 2 USB C 10 Gigabit per second that also support display port and charging.\n\nThe speakers are really good, and don't distort at all, even on max volume.\n\nThe keys feel solid, very stable, and actuate well, even the spacebar when you press it on the very side. They included a little nub as well. The touchpad appropriately has 2 buttons on top, so you can click while using the nub, but that unfortunately reduces the surface for touchpad users like me, an there is no clickable middle button. Still, that touchpad is really, really good.\n\nIn terms of internals, the Dev One only comes in one configuration: a Ryzen 7 PRO 5850U, 16GB of RAM, and 1TB of storage.\n\nThe CPU is 8 core, 16 threads, and has a base clock of 1.9Ghz, up to 4.4Ghz when boosting. It's a very, very powerful beast indeed, with a geekbench score of 1550 in singlecore and 7707 in multi core.\n\nAs per battery life, I left the laptop on a youtube loop with firefox, over wifi, at mid brightness, and it lasted for 8h30 hours before shutting down. On a more typical workload, I used it to write scripts, using firefox and nextcloud notes, listening to music, with wifi on, a bluetooth mouse, and mid brightness, and it lasted for 7 hours.\n\nOk, let's move on to the software. The dev One runs popOS 22.04, and there's been a lot of work done by both teams on that front.\n\nThe integration goes up to the support as well: just like a System76 laptop, you can create a support ticket right from the settings, and HP has a dedicated support team for that device to ensure things run smoothly, with a process to pass on tickets to system76 if they're software related.\n\nThere are some kinks to the software, though: first you have to agree to a license agreement to use the device. Then, there's the analytics. It's completely opt-in and not enabled by default.\n\nThe Dev One can be purchased with 2 accessories. The Hp Wireless Creator Mouse, and the launch keyboard from System76.", "link": "https://www.youtube.com/watch?v=2gQbOsTXRLY", "date_published": "2022-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]