[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tokischa: Tiny Desk Concert", "description": "From Sept. 15 through Oct. 15, Tiny Desk is celebrating Latinx Heritage Month with an El Tiny takeover, featuring Jessie Reyez, Susana Baca and more musicians from all corners of Latinidad.\n\nStefanie Fernández | October 12, 2022 \nTokischa came to NPR with a set of arrangements which, a conversation after the performance, she called \"a little more Tiny,\" reworking her dembow tracks in a melange of other Caribbean and Latin American genres. True to her identity as an artist whose performance is aimed squarely at disarming respectability politics, she doesn't sanitize the originals. Instead, her performance subverts expectations by foregrounding her celebration of female sexual autonomy, queerness and desire against a backdrop of popular folk genres. The juxtaposition succeeds uncannily, the kind of artistic strength that lands on the ears of people in power like a threat.\n\nThe dembow avant-gardist has incensed conservative pundits in the Dominican Republic and abroad. Her unfiltered expression has sparked moral panic and, elsewhere, drawn justifiable criticism. She opens with \"Perra\" — a collaboration she originally recorded with J Balvin and the video for which was criticized for racist imagery against Black women and was eventually deleted from YouTube. It's a surprising choice for an opener, even more so as a demure bossa nova. Tokischa lilts the song's chorus and playfully points to the audience.\n\nHer distinctive voice and flow pair deftly with the switch-ups across Caribbean genres, from a bachata version of \"Hola\" to reggae on \"Somos Iguales\" and a mambo \"Delincuente,\" the latter complete with a call-and-response that features an NPR audience for the first time probably ever responding \"bellaca\" (\"horny\").\n\n\"ESTILAZO\" is completely transformed, the crisp house original slowed to a languid son backed by a tumbao piano riff in the neighborhood of \"Chan Chan.\" The lyrics — among them \"Lesbianismo entre mujeres, larga vida homosexual,\" (\"Lesbianism between women, long homosexual life\") and \"Música con letras sucias, una suciedad divina\" (\"Music with dirty lyrics, a divine filthiness\") — build like a manifesto, recasting what oppressors have deemed perverse as divine instead.\n\nEach song is a surprise, and most of all the closer, \"Kilos De Amor,\" a currently unreleased corrido. The genre experiments aren't just an El Tiny detour, but a signifier of an artist who both deeply knows where she comes from and who isn't afraid to see how far she can go.\n\nSET LIST\n\"Perra\"\n\"Hola\"\n\"Somos Iguales\"\n\"Delincuente\"\n\"ESTILAZO\"\n\"Kilos De Amor\"\n\nMUSICIANS\nTokischa: vocals\nAbdiel Serrano: guitar \nGaldy Santiago: percussion\nJesús Laboy: percussion\nOrlando Brinn: keyboard\nJosé Lopez: bass \n\nTINY DESK TEAM\nProducers: Anamaria Sayre, Felix Contreras\nAudio Engineer: Josh Rogosin\nDirector/Editor: Maia Stern\nCreative Director: Bob Boilen\nSeries Producer: Bobby Carter\nVideographers: Maia Stern, Joshua Bryant, Michael Zamora, Alanté Serene\nAudio Assistant: Neil Tevault\nProduction Assistant: Jill Britton\nTiny Desk Team: Suraya Mohamed, Kara Frame, Marissa Lorusso, Hazel Cills, Ashley Pointer, Fi O'Reilly\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tokischa #tinydesk #eltiny #nprmusic", "link": "https://www.youtube.com/watch?v=abb3ObvdBus", "date_published": "2022-10-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]