[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "The illusion of evidence based medicine", "description": "The illusion of evidence based medicine\n\nhttps://www.bmj.com/content/376/bmj.o702\n\nhttps://www.bmj.com/company/the-story-of-bmj-2/\n\nhttps://journals.bmj.com/home\n\nEvidence based medicine has been corrupted by\ncorporate interests, \n\nfailed regulation, \n\nand commercialisation of academia, \n\nargue these authors\n\nJon Jureidini, research leader\n\nhttps://www.adelaide.edu.au/directory/jon.jureidini\n\nResearch Leader, child psychiatrist Adelaide\n\nLeemon B. McHenry, professor emeritus\n\nEmeritus Professor, Cal State University\n\nNot commissioned, externally peer reviewed\n\nSolid scientific foundation for medicine\n\nValidity of this new paradigm\n\nReliable data from clinical trials,\n\nMostly conducted by the pharmaceutical industry\n\nTHE JAPANESE JOURNAL OF ANTIBIOTICS\n74―1 61( 61 )\n\nhttp://jja-contents.wdc-jp.com/pdf/JJA74/74-1-open/74-1_44-95.pdf\n\nGlobal trends in clinical studies of ivermectin in COVID-19 \n\nMorimasa Yagisawa, Patrick J. Foster, Hideaki Hanaki, Satoshi Ōmura\n\nKitasato University asked Merck & Co., Inc. to conduct clinical trials of ivermectin for COVID-19 in Japan. \n\nThis company has priority to submit an application for an expansion of ivermectin’s indications, since the original approval for the manufacture and sale of ivermectin was conferred to it. \n\nHowever, the company said that it had no intention of conducting clinical trials. \n\nThe release into the public domain of previously confidential pharmaceutical industry documents,\n\nvaluable insight into the degree to which industry sponsored clinical trials are misrepresented\n\nUntil this problem is corrected, evidence based medicine will remain an illusion\n\nKarl Popper\n\nCritical rationalism,\n\nadvocated for the integrity of science and its role in an open, democratic society\n\nA science of real integrity\n\npractitioners are careful not to cling to cherished hypotheses,\n\nand take seriously the outcome of the most stringent experiments\n\nThis ideal is, however, threatened by corporations, \n\nfinancial interests trump the common good\n\nMedicine is largely dominated by a small number of very large pharmaceutical companies,\n\nthat compete for market share, \n\nbut are effectively united in their efforts to expanding that market. \n\nScientific progress is thwarted by the ownership of data and knowledge because industry suppresses negative trial results, \n\nfails to report adverse events, \n\nand does not share raw data with the academic research community. \n\nPatients die because of the adverse impact of commercial interests on the research agenda, universities, and regulators.\n\nHierarchical power structures, product loyalty, \n\nand public relations propaganda over scientific integrity. \n\nUniversities, have adopted a neo-liberal market approach, \n\nactively seeking pharmaceutical funding on commercial terms. \n\nAs a result, university departments become instruments of industry: \n\nthrough company control of the research agenda,\n\nand ghostwriting of medical journal articles and continuing medical education, \n\nacademics become agents for the promotion of commercial products.\n\nThe corporate university also compromises the concept of academic leadership. \n\nDeans, (proper academics) have in places been replaced with fundraisers and academic managers, \n\nwho are forced to demonstrate their profitability or show how they can attract corporate sponsors. \n\nIn medicine, those who succeed in academia are likely to be key opinion leaders \n\n(KOLs in marketing parlance), \n\nwhose careers can be advanced through the opportunities provided by industry,\n\nphysicians are selected based on their influence on prescribing habits of other physicians\n\nKOLs are sought out by industry for this influence and for the prestige that their university affiliation brings to the branding of the company’s products. \n\nKOLs present results of industry trials at medical conferences and in continuing medical education.\n\nInstead of acting as independent, disinterested scientists and critically evaluating a drug’s performance, they become what marketing executives refer to as “product champions.”\n\nWhile universities fail to correct misrepresentations of the science from such collaborations, \n\ncritics of industry face rejections from journals, \n\nlegal threats, and the potential destruction of their careers.\n\nThis uneven playing field is exactly what concerned Popper when he wrote about \n\nSuppression and control of the means of science communication (Popper)\n\nRegulators receive funding from industry,\n\nand use industry funded and performed trials to approve drugs, \n\nwithout in most cases seeing the raw data. \n\nDrug companies, “mark their own homework”\n\nOur proposals for reforms\n\nliberation of regulators from drug company funding\n\ntaxation imposed on pharmaceutical companies to allow public funding of independent trials\n\nanonymised individual patient level trial data posted, \n\nalong with study protocols,", "link": "https://www.youtube.com/watch?v=vZlZIXHT0yA", "date_published": "2022-03-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]