[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Anthony Roth Costanzo and Justin Vivian Bond: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nTom Huizenga | February 15, 2022\nThe opera star Anthony Roth Costanzo and the cabaret diva Justin Vivian Bond hail from opposite sides of the tracks, vocally speaking. But when the two unite in their stage show, \"Only an Octave Apart,\" something fabulous emerges.\n\nThis performance from, as Bond puts it, Costanzo's \"tiny apartment,\" with his \"tiny furniture\" and his \"tiny friends,\" gives us a glimpse of the show that opened at St. Ann's Warehouse in Brooklyn last fall and landed at the New York Philharmonic earlier this year.\n\nThe show is meant to be comedic, as it riffs off a decades-old routine of the same name by Beverly Sills and Carol Burnett, but through the camp and the preposterous musical mashups, the simple idea of coming together provokes profound emotions at a time when many are forced apart by either the pandemic or politics.\n\nBond, in regal daffiness, bounces zingers off Costanzo's \"straight man\" with traces of Eve Arden's whiplash timing (a la Our Miss Brooks) and Catherine O'Hara's twisted bravado (from Schitt's Creek). The cabaret singer, in a husky baritone, leads the way in an improbable conjoining of The Bangles' \"Walk Like an Egyptian\" and Philip Glass' opera Akhnaten. Next up, Costanzo's pure-toned countertenor pilots an unexpected 2-hankie admixture of Christoph Willibald Gluck's opera Orfeo ed Euridice with the Peter Gabriel and Kate Bush duet \"Don't Give Up.\" When you're down and out, the song suggests, there'll be someone at your side.\n\nAnd isn't that what we all need these days, a little more togetherness?\n\nSET LIST\n\"Egyptian Sun (Walk Like an Egyptian/Hymn to the Sun Medley)\"\n\"Deh Placatevi/Don't Give Up Medley\"\n\nMUSICIANS\nAnthony Roth Costanzo: vocals\nJustin Vivian Bond: vocals\nDaniel Schlosberg: piano\nClaudia Chopek: violin\nSpencer Murphy: bass\n\nCREDITS\nVideo: Kayhl Cooper, Harry McFann\nAudio: David Schnirman\nAdditional Mixing: Patrick Dillett\nPiano Technician: Christopher P. Kennedy\nCreative Partner: Zach Winokur\n\nTINY DESK TEAM\nProducer: Tom Huizenga\nVideo Producer: Joshua Bryant\nAudio Mastering: Josh Rogosin\n\nTiny Production Team: Bob Boilen, Bobby Carter, Maia Stern, Kara Frame, Ashley Pointer, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#anthonyrothcostanzo #justinvivianbond #nprmusic #tinydesk", "link": "https://www.youtube.com/watch?v=qX9WE9-Pt2U", "date_published": "2022-02-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]