[{"source": "https://www.jefftk.com/news.rss", "title": "Mastodon Replies as Comments", "description": "<p><span>\n\nThe comment section on most blogs is pretty minimal, with the real\ndiscussion happening elsewhere, but people who come to the post later\nwon't see that discussion.  One of the more unusual choices I've made\nwith this blog is that instead of hosting comments here, I pull in and\ndisplay comments people make on social media. While this started out\nas laziness (who wants to handle accounts for users?) over the years\nI've come around to thinking that this is how blog comments should\nnormally work.\n\n</span>\n\n<p>\n\nThe biggest problem with this approach, though, is that it's in\ntension with the goals of the social media companies.  Facebook,\nTwitter, etc want to keep you on their platform, and aren't especially\ninterested in serving as the comment section of external blogs.  On the\nother hand, this is potentially a really good fit for federated social\nmedia, and I've now made it so that ActivityPub replies to my blog\nposts will show up as comments here:\n\n</p>\n\n<p>\n\n<a href=\"https://www.jefftk.com/mastodon-reply-comments-big.png\"><img border=\"1\" class=\"mobile-fullwidth\" height=\"897\" src=\"https://www.jefftk.com/mastodon-reply-comments.png\" width=\"550\" /><div class=\"image-vertical-spacer\"></div></a>\n\n</p>\n\n<p>\n\nFor a live example, here's <a href=\"https://www.jefftk.com/p/mastodon-linking-norms\">a post\nfrom last week</a> or you can look at the bottom of this post.\n\n</p>\n\n<p>\n\nIntegration was fast: if I fetch\n<code>https://[server]/api/v1/statuses/[id]/context\"</code> I get all\nthe publicly visible replies to that status that this server knows\nabout.  Then it's just a matter of extracting the relevant\ninformation, threading the responses, and fitting that into my\nexisting comment display infrastructure (<a href=\"https://github.com/jeffkaufman/webscripts/blob/master/comment_requester_wsgi.py\">code</a>).\n\n</p>\n\n<p>\n\nThis is a bit of a hack on top of Mastodon, but for blogs to\nparticipate directly in ActivityPub, where you could subscribe and\ncomment over the protocol, you wouldn't have to implement most of what\nMastodon does.  That would make it much smaller, more efficient, and\nmore maintainable. It looks like maybe someone has made a <a href=\"https://wordpress.org/plugins/activitypub/\">WordPress plugin</a>\nfor this?  Has anyone tried it?\n\n  </p>\n\n<p><i>Comment via: <a href=\"https://www.facebook.com/jefftk/posts/pfbid0t2D1wC9pLmQkTMMJ9Mn1fHxYGkTwYq44WwrhgRnxerHy2PzH3dQDAdC5BFnHcxyFl\">facebook</a>, <a href=\"https://lesswrong.com/posts/sE5wHZCDyzCSuwBxd\">lesswrong</a>, <a href=\"https://mastodon.mit.edu/@jefftk/109360949195245646\">mastodon</a></i></p>", "link": "https://www.jefftk.com/p/mastodon-replies-as-comments", "date_published": "2022-11-17 08:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]