[{"source": "https://www.theguardian.com/rss", "title": "‘Your destiny is in your hands’: the joy of being your own boss", "description": "<p>While it takes grit and determination to start your own business, it can be helpful for entrepreneurs to keep sight of the upsides</p><p>Five years ago, Simon Madgwick swapped a career in finance for self-employment and opened his business, <a href=\"https://www.simonsbakery.co.uk\" rel=\"nofollow\">Simon’s Bakery</a>, creating bespoke celebration and wedding cakes. Based in Tooting, south-west London, his passion for producing stunning cakes is matched by his enjoyment of being an entrepreneur. “Having worked in a corporate office environment for 20 years, nothing compares with being your own boss, being in control and accountable for everything, and knowing that your destiny is in your own hands,” he says.</p><p>It can be easy to lose sight of upsides such as these, given the economic challenges of recent years. Small business owners have had to perform miraculous feats to deal with unexpected upheavals, and some of the more intangible benefits of running your own business can get lost amid the day-to-day pressures.</p> <a href=\"https://www.theguardian.com/choose-your-own-route/2022/nov/17/your-destiny-is-in-your-hands-the-joy-of-being-your-own-boss\">Continue reading...</a>", "link": "https://www.theguardian.com/choose-your-own-route/2022/nov/17/your-destiny-is-in-your-hands-the-joy-of-being-your-own-boss", "date_published": "2022-11-17 09:44:49+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Your route to startup success: seven tips from business owners", "description": "<p>From focusing on the stuff you’re good at to creating an informal advisory board, here’s how to succeed in business and enjoy the journey at the same time</p><p>Business ownership brings a huge sense of freedom and autonomy, however, this can often be accompanied by feelings of trepidation, especially in the early days. Starting your own business is exciting, but you know that challenges lie ahead. Here, some seasoned entrepreneurs share their tips for strengthening the agency and self-determination needed for mapping out your business route, and most importantly, enjoying it.</p><p><strong>Trust your instincts<br /></strong>Business owners are constantly making decisions, often at short notice and with little time to prepare. While much of the decision-making in business is informed by data, it’s also important to trust your instincts. A gut feeling can be key to the success you’ve achieved so far, and as your business grows, trusting your judgement becomes even more important. As Helen Marsden, co-founder of fashion retailer <a href=\"https://www.kitandkaboodal.com\" rel=\"nofollow\">Kit and Kaboodal</a>, explains: “As our business grew, we brought in new people who came with new opinions and new ideas. You need to keep your ideas and objectives firmly in mind to avoid being swayed into going in a new direction.”</p> <a href=\"https://www.theguardian.com/choose-your-own-route/2022/nov/17/your-route-to-startup-success-seven-tips-from-business-owners\">Continue reading...</a>", "link": "https://www.theguardian.com/choose-your-own-route/2022/nov/17/your-route-to-startup-success-seven-tips-from-business-owners", "date_published": "2022-11-17 09:43:53+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "From co-working spaces to hybrid working: where next for business flex?", "description": "<p>As the cost-of-living crisis follows the pandemic, businesses are having to perform shapeshifting levels of agility and flexibility</p><p>In March 2020, Abigail McLachlan had just invested £180,000 in <a href=\"https://eastofeden.uk\" rel=\"nofollow\">East of Eden</a>, the yoga and pilates business she runs in Walthamstow, east London. She was expanding with two shiny new studios, therapy rooms, showers and a cafe.</p><p>Then came the first national lockdown in the wake of the Covid pandemic. “When nobody came, nine days after opening, I pivoted my business overnight to a virtual one. I had my full timetable of 80 classes a week from 42 teachers online, teachers teaching from their homes via Zoom,” she says.</p> <a href=\"https://www.theguardian.com/choose-your-own-route/2022/nov/17/from-co-working-spaces-to-hybrid-working-where-next-for-business-flex\">Continue reading...</a>", "link": "https://www.theguardian.com/choose-your-own-route/2022/nov/17/from-co-working-spaces-to-hybrid-working-where-next-for-business-flex", "date_published": "2022-11-17 09:42:34+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Hire power: three entrepreneurs on the business benefits of car sharing", "description": "<p>Starting out in business has been made simpler by using Zipcar, for a cider-maker, fitness consultant and craft beer specialist</p><p>Life as an entrepreneur isn’t without its challenges. The past two years in particular have demanded that founders show great resilience, determination and innovation, often in the face of uncertainty.</p><p>But there are many upsides to running your own business – and <a href=\"https://www.djsresearch.co.uk/BusinessSupportMarketResearchInsightsAndFindings/article/Over-four-in-10-UK-workers-would-like-to-start-their-own-business-survey-reveals-05048\" rel=\"nofollow\">four in 10 UK workers</a> say they’d like to start their own venture one day, according to a survey by market research company DJS Research. <a href=\"https://www.iwoca.co.uk/news/top-ten-reasons-start-up/\" rel=\"nofollow\">Another poll</a> found the most popular reasons for doing so among would-be entrepreneurs were because they wanted to work for themselves, to focus on a passion, and because they don’t like being told what to do. Others see self-employment as a way to spend more time with family.</p> <a href=\"https://www.theguardian.com/choose-your-own-route/2022/nov/17/hire-power-three-entrepreneurs-on-the-business-benefits-of-car-sharing\">Continue reading...</a>", "link": "https://www.theguardian.com/choose-your-own-route/2022/nov/17/hire-power-three-entrepreneurs-on-the-business-benefits-of-car-sharing", "date_published": "2022-11-17 09:41:28+00:00", "persistent": false, "user": null, "language": "en-UK"}]