[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Marvel's Spider-Man: Miles Morales - PC Ultrawide Max Settings Gameplay", "description": "Check out the first 20 minutes of Spider-Man: Miles Morales running on max settings with ray tracing on ultrawide.\n\n#spidermanmilesmorales #pcgaming #gamespot", "link": "https://www.youtube.com/watch?v=C7wq74Y2KUc", "date_published": "2022-11-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Scarlet & Pokémon Violet – Official HD Launch Trailer", "description": "The long wait for the next chapter in Pokémon is over! Embark on a new, open-world Pokémon adventure through the rich and expansive Paldea region! Choose your path to earning Champion Rank as a Pokémon Trainer, meet new Pokémon, and explore an open world for the first time in the Pokémon series in Pokémon Scarlet and Pokémon Violet,  available now on Nintendo Switch!\n\n#PokemonScarletViolet #Pokemon #NintendoSwitch", "link": "https://www.youtube.com/watch?v=rSMqv0EKZPw", "date_published": "2022-11-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Violet: The First 24 Minutes", "description": "Jump into the Paldea region with the first 24 minutes of Pokémon Violet.\n\nThe newest Pokémon adventure awaits! Jake takes you through the first 20 minutes of Pokémon Violet. Although the Paldea region is brimming with Pokémon to catch, the most important decision is choosing a starter. Who will he choose? Sprigatito, Fuecoco, or Quaxly? Meet new friends and rivals including Nemona and Mr. Clavell, and check out the battle system as Jake takes on Nemona in his first Pokémon battle! Now, it's your turn to go out and catch em' all when Pokémon Scarlet and Violet launch on November 18th.", "link": "https://www.youtube.com/watch?v=vNKZekBhdGs", "date_published": "2022-11-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Scarlet and Violet Lowest Rated Pokémon Gen On Metacritic | GameSpot News", "description": "Pokemon Scarlet and Violet have some problems, you can get a free flying Pikachu in the games, and Modern Warfare 2/Warzone 2's battle pass is free for certain players.\n#Gaming #PokemonScarletViolet #Warzone2 \n\nPokemon Scarlet and Violet are out now, and the reception to both highly anticipated titles has been mixed to say the least. Multiple reviews, including our own at GameSpot, mention that while the open world is an excellent step forward for the franchise, the games are held back by technical issues such as pop in, frame rate drops, and muddy textures.\n\nAs such, the current score at GameSpot sister site Metacritic sits at a 77, which is the lowest score for a new mainline Pokemon game ever. Before these entries, no new generation of Pokemon has scored below an 80 before. \n\nI should note, that neither Pokemon Red/Blue or Gold/Silver have ratings on the site, but their remakes Fire Red/Leaf Green and Heart Gold/SoulSilver are also rated highly. Which of course they are, cus those are some of the greatest games of all time.\n\nDespite the mixed reception to the new games, it seems to not have had any affect on sales, as Scarlet and Violet are the most preordered Pokemon games in the series’ history.\n\nThe Pokemon Company’s chief operating officer Takato Utsunomiya announced the news at a launch event for the pair of Pokemon games, though didn't specify how many preorders the games had received. He did note that 440 million units of Pokemon-related games have been sold since the launch of the very first titles in Japan, Pokemon Red and Green.\n\nThe chief operating officer also revealed that because of the new elements Scarlet and Violet has introduced, for first-time players, playtimes could go all the way up to 60 hours, which is quite a bit longer than the typical Pokemon adventure.\n\nIf you are picking up either of the new games, make sure to grab your free, rare Pikachu. Once you unlock the Poke Portal in the game, which requires you to to start the Treasure Hunt activity early on in the game, you’ll be able to access Mystery Gifts like in previous entries in the series. Select “Get Via Internet” and the Pikachu will be awarded to you.\n\nWhat makes this Pikachu worth obtaining? Besides the adorability factor, this particular electric rat knows the move Fly, which Pikachu are usually incapable of learning. Usually reserved for Flying-type Pokemon, Fly is a useful two-turn attack that can demolish Fighting and Grass-type Pokemon on the field, adding some extra utility to this particular Pikachu. This Pikachu will also change its typing from Electric to Flying when it is terastalized, the new power up mechanic in the game.\n\nMake sure to head to GameSpot dot come for a ton, and I do mean a ton, more content around Pokemon Scarlet and Violet.\n\nIf you’re still in too deep with Call of Duty Modern Warfare 2 and Warzone 2 to care about pocket monsters, and you also have Xfinity internet, I hope you haven’t paid for your battle pass yet, as you can pick it up for free.", "link": "https://www.youtube.com/watch?v=7oToIni2cUo", "date_published": "2022-11-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "First Look At Splinter Cell Remake | GameSpot News", "description": "Ubisoft shows off concept art for the remake of the original Splinter Cell, Xbox and Ubisoft Black Friday sales are live, and Xbox integration with Discord gets even better in its latest update.\n#Gaming #SplinterCell #Xbox \n\nFans that have been patiently waiting for updates on the next Splinter Cell got their first taste of what Sam Fisher’s next mission is going to look like.\n\nUbisoft, taking the original game and rebuilding it from the ground up in its own Snowdrop engine, unveiled concept art of the remake in celebration of the franchise’s 20th anniversary.\n\nDuring a conversation as a part of that celebration with the development team at Ubisoft Toronto, associate level design director Zavian Porter explained the goal of the project is to create a \"top tier-remake to push quality as much as possible that should help us set a good foundation for the franchise going forward\". So it sounds like the remake itself won’t be a simple one off.\n\nIt also sounds like the remake will incorporate mechanics and elements from other games in the franchise that followed. the original’s release, with senior game designer Andy Schmoll stating that the team is, \"exploring new and innovative tech and ideas, as well as features and elements from the other Splinter Cell titles\".\n\nUnfortunately, this will be the last update for the much anticipated remake for a while, as the team will be, “going dark for a little while so it can focus on making the absolute best game possible.\"\n\nIn the meantime, fans both new and old can experience the original game, which initially was an exclusive for the very first Xbox, for the great deal of free. The deal can be obtained via Ubisoft itself for the PC.\n\nSpeaking of Xbox, Ubisoft, and deals, Black Friday discounts for the two gaming giants are already out in the wild.\n\nXbox is discounting its Series S console to $250. Highlights of its game sales include Madden NFL 23 for $35, Tiny Tina’s Wonderlands: Next Level Edition also for $35, and the Witcher 3 Wild Hunt: Game of the Year Edition for $10, which will be getting a free next gen upgrade in December.\n\nFrom Ubisoft, 2020’s Assassin’s Creed Valhalla, last year’s Far Cry 6, and this year’s Rainbow Six Extraction can all be nabbed for under $20. For both Xbox and Ubisoft’s full list of deals, as well as our complete collection of Black Friday discounts, head to GameSpot dot com.\n\nIf you do pick up a shiny new Xbox Series S on sale, you’re going to want to apply the latest software update, which brings some much welcome additions and tweaks to the platform, the biggest of which being tighter integration with Discord.\n\nDiscord integration launched for Xbox Insiders back in July and for all console users in September, but previously you had to transfer the call from Discord to your console via the Xbox mobile app. Now, you can activate chatting directly from the console itself.\n\nTIMECODES:\n\n00:00 - Splinter Cell remake first look\n01:32 - Black Friday deals\n02:18 - Xbox November update", "link": "https://www.youtube.com/watch?v=FsaiRZNpAro", "date_published": "2022-11-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Marvel's Midnight Suns The Final Preview", "description": "The early hours of Marvel's Midnight Suns have sold us on the combat, but not quite on the story, despite some standout characters.\n#gaming #Marvle #MidnightSuns \n\nSo far, I really enjoy Marvel's Midnight Suns, having now played about 15 hours of the tactical RPG, which pulls inspiration from the XCOM games. Removing XCOM's frustrating percentage system--which could cause even the most well-planned strategies to have a chance of just not working--makes the turn-based tactical combat in Midnight Suns a lot more fun. And thanks to the deckbuilding card system, randomness still factors into the equation, creating a healthy bit of challenge.\n\nYou can expect more words from me regarding the actual gameplay of Midnight Suns when the full review embargo is up. For now, I want to briefly touch on an aspect of Midnight Suns we haven't really had a chance to see a whole lot of yet: the writing and story. \n\nTo recap, in Midnight Suns you play as the Hunter, prophesied to defeat your mother, Lilith, and seal away her dark magic forever. You're assigned leadership of the latest iteration of the Midnight Suns, a team composed of superheroes with powers that dabble in the mystic and supernatural, going out to face Lilith's demonic forces and the members of HYDRA she's enthralled. Lilith's war on humanity attracts the attention of less magically-inclined heroes as well, and so your efforts are also bolstered by members of the Avengers and X-Men. Each character features their own unique abilities, portrayed as cards within a deck, allowing you to switch up your strategies depending on who you bring on a mission.\n\nI wasn't expecting a story quite so action hero-focused given the namesake Midnight Suns is pulling from. It's a bit by-the-numbers, even by the standards of superhero fiction, so major plot points can be seen coming from a mile away and moments of grief or tragedy aren't given adequate room to fester, as the more wise-cracking heroes are quick to fill the silence with jokes to liven up the situation. So far, that's keeping the game's story from being great, but it's certainly not bad by any stretch. If you've watched any of the team-oriented MCU movies, you already kind of know what you're getting with Midnight Suns--this game feels more like the MCU's lighthearted take on Age of Ultron and less like the darker Midnight Suns comic book series. \n\nBetween the major plot points, Midnight Suns allows you to explore optional, more personal side stories. And it's in those smaller interactions between the Hunter and the individual members of their team that the game manages to squeeze out some incredible moments. Building up your friendship with certain heroes unlocks additional cutscenes and conversations with them, many of which culminate in heartwarming reveals or devastating discoveries. Magik, in particular, is one of the best-written characters in Midnight Suns, and her friendship arc with the Hunter--which sees the two bond over their respective struggles with their innate darkness--has been my favorite part of the game thus far.", "link": "https://www.youtube.com/watch?v=fy0laO7oAbg", "date_published": "2022-11-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokemon Scarlet & Violet Review", "description": "Pokemon Scarlet & Violet's open-world approach reinvigorates the long-running series.\n\n#pokemon #pokemonscarletandviolet #gaming", "link": "https://www.youtube.com/watch?v=tDMdYRUJ8hE", "date_published": "2022-11-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Callisto Protocol - Official Launch Trailer", "description": "Watch The Callisto Protocol Official Launch Trailer featuring the song 'Lost Again' by Kings Elliot. Set on Jupiter’s dead moon Callisto in the year 2320, The Callisto Protocol casts players as Jacob Lee - an inmate in Black Iron Prison. When a mysterious outbreak throws the moon into chaos, Jacob must face his darkest fears to defeat the bloodthirsty creatures that stalk him as he unravels the dark mysteries at the heart of the powerful United Jupiter Company. The Callisto Protocol is available on December 2, 2022 on PlayStation, Xbox, and PC platforms.\n\n#callistoprotocol #gaming", "link": "https://www.youtube.com/watch?v=U9rSAmdywD4", "date_published": "2022-11-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Devil In Me Director Breaks Down Dark Pictures Horror | MindGames", "description": "Horror games love forcing you to make decisions under pressure, and their developers love to exploit every psychological trick in the book to make those decisions as difficult as possible.\n\nAhead of the release of The Devil In Me, Supermassive’s latest entry to its Dark Pictures Anthology Series, we sat down with the game’s director Tom Heaton, to break down how Supermassive approaches crafting a horror experience where every choice you make can have dire consequences.\n\n#darkpictures #thedevilinme #supermassivegames #mindgames #psychology #gaming", "link": "https://www.youtube.com/watch?v=ni3pr41LCjM", "date_published": "2022-11-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Warzone 2.0 Patch Notes, What You Need To Know | GameSpot News", "description": "The first season for Call of Duty: Modern Warfare II and Warzone 2.0 is also out now, ushering in a new battle pass, more maps, additional weapons, and bug fixes.\n#GamingNews #ModernWarfare2 #Warzone2.0\n\nWarzone 2.0 launches today and Activision is marking the end of the original Warzone with a Twitter post asking fans to press F to pay respects. This of course being a call back to the popular meme. Warzone Caldera, as it will be called, will be offline for 12 days, returning November 28, if all goes to plan. Activision will continue to support the game, but the extent to which it will do so is unknown.\nThe Season 1 patch notes include a range of weapon balancing changes, including the M4 seeing hip spread reduction, the Kastov 545 having its ADS speed increased, and a general nerf for a variety of guns like the Lockwood 300, which sees its damage range reduced.\nIn terms of new content, Modern Warfare II multiplayer adds a small new map, Shoot House, and a new Operator, Zeus (he can be unlocked instantly by purchasing the battle pass). The new hardcore mode, which is now called Tier 1, is also now live in Modern Warfare II, but the CDL Moshpit playlist has been delayed.\nAlso new in Warzone 2.0 today is DMZ, in which players work together to complete objectives. There are locked areas on the map that players can open with specific keys once they find them. Players will fight against other human and AI characters with the aim of getting to the chopper at the end for exfil.\nFull List of patch notes:\nhttps://www.gamespot.com/articles/call-of-duty-mw2-and-warzone-2-season-1-patch-notes-revealed/1100-6509212/", "link": "https://www.youtube.com/watch?v=z8NT-2osMG8", "date_published": "2022-11-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]