[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "CHROME OS Flex is a BAD operating system", "description": "Get 100$ credit for your own Linux and gaming server: https://www.linode.com/linuxexperiment \nGrab a brand new laptop or desktop running Linux:https://www.tuxedocomputers.com/en#\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to a weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYouTube: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nTwitter : http://twitter.com/thelinuxEXP\nInstagram: https://www.instagram.com/nick_thelinuxexp/\nMastodon: https://mastodon.social/web/@thelinuxEXP\nPixelfed: https://pixelfed.social/TLENick\nI'm also on ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\nAnd on PEERTUBE: https://tilvids.com/c/thelinuxexperiment_channel/videos\n\nThis video is distributed under the Creative Commons Share Alike license.\n\n#chromeosflex #chromeos #google \n\n00:00 Intro\n00:42 Sponsor: 100$ free credit for your Linux or Gaming server\n01:42 Install process: unnecessarily complex\n03:09 Desktop: simple and good, on the surface\n06:17 Issues: it's not ChromeOS\n07:55 App switching is completely broken\n09:45 Interacting with windows is sub-par\n10:44 Big UX errors in the Settings app\n12:11 The Overview isn't useful\n13:39 Who is this thing for?\n16:14 Sponsor: Get a device that runs Linux perfectly\n17:14 Support the channel\n\nThe interface is extremely simple. You have a basic bottom bar with a main menu and search field at the far left, app icons that also serve as a task bar in the middle, and a calendar and system menu on the right. If you have something playing in an app, you also get a media indicator next to the calendar to let you control playback.\n\nYou can't change anything apart from the wallpaper and the position of that task bar: bottom, left or right, no top option. You also have a dark mode.\n\nYou have touchpad gestures, with a 3 finger swipe up to display an overview of all your windows and virtual desktops, and 4 finger swipes left or right to switch between desktops.\n\nWindows use the windows button layout, on the right hand side, wit minimize, maximize and close, plus a menu to interact with the window.\n\nYou can run any webapp from the CHrome Web store, which has a lot of stuff, you can add any website as a shortcut that will appear in the main menu and be usable as an app, or you can enable the Linux development environment from the settings.\n\nIt gives you a Debian container, with access to basic repos, but you can install faltpak, add flathub, and run anything you'd like, although since it's a container, some stuff won't work, like OBS for example\n\nThe problems:\n\nFirst, the killer feature for ChromeOS is that it has its own Android container that runs any Android app really well. CHrome OS Flex can't do that. It doesn't have access to Android apps, which is a big bummer.\n\nThen, we have more factual, UX based problems, like the window inconsistencies. Chrome OS uses web apps and passes them for desktop applications. The problem is, not all apps are treated in the same way. Opening youtube, or the file manager brings a window that looks like an application: short title bar, and standard controls. But if I open Google drive, then I get a browser window with a URL bar, tabs and a different title bar. Then, if I open Google sheets, I don't get a separate application window, it opens in a tab inside of the Google drive window, so I don't get an app icon in the task bar. \n\nIt's completely illegible: you never know what to expect when opening an application, where it's going to open, where your tab or window is, and if it's been minimized by another application.\n\nThen you have that horrible visual aid when resizing a window: as your mouse pointer gets towards a window's side, you get this black bar that appears around that side.\n\nMoving windows around sucks. See, the theme is either completely white, or dark. The title bar merges with the header or toolbar. Except you can only drag a window from its titlebar, and you don't know exactly where it starts or ends, because the title bar doesn't show a window title, just buttons. And you can't press Super or Alt while dragging anywhere on the window to move it either.\n\nThe settings are all displayed in a single page, with a sidebar. CLicking the sidebar moves you to the relevant section of that single settings page. Moves you, not scrolls you, so you don't immediately realize it's a single page. If you scroll yourself, the sidebar selected item doesn't change. So the sidebar is now telling me I'm in the Accessibility settings, when I'm looking at the network settings. Pretty bad design. \n\nAnd then the overview. It lists all your open windows, pretty useful. But ChromeOS doesn't know what is a window or not, so no, I don't see all my windows, I see all individual apps, and then a Chrome window with multiple tabs that should be separate apps.", "link": "https://www.youtube.com/watch?v=XYBMdKlYygg", "date_published": "2022-11-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]