[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Vitamin D, Safe and effective", "description": "Association between vitamin D supplementation and COVID-19 infection and mortality\n\nhttps://www.nature.com/articles/s41598-022-24053-4\n\n(12th November 2022)\n\nJohns Hopkins\nUniversity of Michigan\nNational Bureau of Economic Research\nDepartment of Medicine, University of Chicago\nDepartment of Veterans Health Affairs\nDepartment of Medicine, University of Chicago, Chicago\n\nVitamin D deficiency, associated with reduced immune function,\n\ncan lead to viral infection\n\nVitamin D deficiency, associated, increases the risk of COVID-19\n\nBut is it a treatment / prognosis improver?\n\nPopulation of US veterans, we show that Vitamin D2 and D3 fills\n\nAssociated with reductions in COVID-19 infection\n\nAfter applying all restrictions\n\n220,265 supplemented with vitamin D3\n\n34,710 supplemented with vitamin D2\n\n407,860 untreated patients.\n\nStudy design\n\nRetrospective cohort\n\nSupplemented (before and during the pandemic),\n\nversus untreated controls\n\nOne to one matches\n\nD2, D3, or calcifediol\n\nVeterans Administration Corporate Data Warehouse (CDW) electronic health records. \n\nVitamin D levels typically respond to treatment following two months of exposure\n\nD3 cohort\n\nCOVID-19 rates for the treated = 2.66%\n\nCOVID-19 rates for the untreated = 3.30%\n\nD3 20%, reduction\n\nD2 28% reduction\n\nMortality within 30-days of COVID-19 infection\n\nInfection ending in mortality within 30 days\n\nD3 group\n\nTreated group death rate after infection = 0.23%\n\nUntreated group death rate after infection = 0.35%\n\nVitamin D3 33% mortality lower (HR, 67%)\n\nP  less than  0.001\n\nVitamin D2  25% lower (HR, 75%) (but not significant)\n\nVeterans receiving higher dosages of Vitamin D obtained greater benefits from supplementation than veterans receiving lower dosages. \n\nVitamin D blood levels between 0 and 19 ng/ml,\n\nexhibited the largest decrease in COVID-19 infection and mortality following supplementation\n\n(0–19 ng/ml, 20–39 ng/ml, and 40 + ng/ml)\n\nDosage options, 20 IU, 40 IU, 100 IU, 125 IU, 200 IU, 250 IU, 400 IU, 500 IU, 800 IU, 1000 IU, 2000 IU, 5000 IU, 8000 IU, and 50,000 IU\n\nBlack veterans received greater associated COVID-19 risk reductions, with supplementation than White veterans\n\nAs a safe, widely available, and affordable treatment, Vitamin D may help to reduce the severity of the COVID-19 pandemic.\n\nMore background\n\nVitamin D insufficiency and deficiency affect approximately half of the US population, \n\nwith increased rates in people with darker skin, \n\nreduced sun exposure, \n\npeople living in higher latitudes in the winter, \n\nnursing home residents, \n\nand healthcare workers\n\nPopulations with low levels of Vitamin D have also experienced higher rates of COVID-19\n\nNew mechanism\n\nVitamin D is needed to allow T helper cells to control and reduce Interferon gamma (IFN-γ) production\n\nConclusions\n\nThese associated reductions in risk are substantial and justify more significant exploration and confirmation using RCTs. \n\nThis is particularly important given the high rates of vitamin D deficiency in the US population and COVID-19.\n\nExtrapolate, D3 supplementation to the entire US population in 2020\n\n4 million fewer COVID-19 cases (19,860,000 actual cases)\n\n116,000 deaths avoided (351,999 actual deaths)\n\nGiven our findings, \n\nthe absence of severe side effects, \n\nthe widespread availability of vitamin D3 at low cost, \n \nvitamin D3 presents a unique opportunity to reduce the spread and severity of the COVID-19 pandemic.\n\nK2, MK-7\n\nSupplement, probably 100 micrograms per day\n\nNato, 1,000 micrograms per 100 g\n\nCheese, typically 50 micrograms per 100 g\n\nSafe and effective\n\nUK, GP incentives to vaccinate\n\nHome, £30\n\nStandard reimbursement to Primary Care Networks (which then gets passed to GPs) £15 \n\nNew contract, £12.58 each\n\nLawrence\n\nI have heard that Dr. John Campbell is in the pocket of Big Overhead Projector Lobby.\n\nRumour is that he has accepted tens of dollars of under the table expenses. \n\nAnyone else notice that he always seems to have an endless supply of A4 paper and fountain pens?", "link": "https://www.youtube.com/watch?v=MbUm5FyrHRk", "date_published": "2022-11-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]