[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCW0gH2G-cMKAEjEkI4YhnPA", "title": "The Silmarillion illustrated by JRR Tolkien - Regular & Deluxe Edition Hands-on Review", "description": "Regular Edition US: https://amzn.to/3UKfw3m\nRegular Edition UK: https://amzn.to/3UNwopU\nDeluxe Edition: https://tinyurl.com/32vxm475\n\nProduct Description:\nFor the first time ever, a very special edition of the forerunner to The Lord of the Rings, illustrated throughout in color by J.R.R. Tolkien himself and with the complete text printed in two colors. The Silmarillion fills in the background which lies behind the more popular work, and gives the earlier history of Middle-earth, introducing some of the key characters.\n\nThe Silmarilli were three perfect jewels, fashioned by Fëanor, most gifted of the Elves, and within them was imprisoned the last Light of the Two Trees of Valinor. But the first Dark Lord, Morgoth, stole the jewels and set them within his iron crown, guarded in the impenetrable fortress of Angband in the north of Middle-earth.\n\nThe Silmarillion is the history of the rebellion of Fëanor and his kindred against the gods, their exile from Valinor and return to Middle-earth, and their war, hopeless despite all the heroism, against the great Enemy. It is the ancient drama to which the characters in The Lord of the Rings look back, and in whose events some of them such as Elrond and Galadriel took part.\n\nThe book also includes several shorter works: the Ainulindalë, a myth of the Creation, and the Valaquenta, in which the nature and powers of each of the gods is described. The Akallabêth recounts the downfall of the great island kingdom of Númenor at the end of the Second Age, and Of the Rings of Power tells of the great events at the end of the Third Age, as narrated in The Lord of the Rings.\n\nTolkien could not publish The Silmarillion in his lifetime, as it grew with him, so he would leave it to his son, Christopher Tolkien, to edit the work from many manuscripts and bring his father’s great vision to publishable form, so completing the literary achievement of a lifetime. This special edition presents anew this seminal first step towards mapping out the posthumous publishing of Middle-earth, and the beginning of an illustrious forty years and more than twenty books celebrating his father’s legacy.\n\nThis definitive new edition includes, by way of an introduction, a letter written by Tolkien in 1951 which provides a brilliant exposition of the earlier Ages, and for the first time in its history is presented with Tolkien’s own paintings and drawings, which reveal the breathtaking grandeur and beauty of his vision of the First Age of Middle-earth.\n\n#silmarillion #tolkien #unboxing", "link": "https://www.youtube.com/watch?v=UGho2H9QcLw", "date_published": "2022-11-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]