[{"source": "https://www.gamespot.com/feeds/mashup", "title": "14 Best Steam Deck Games To Play Right Now", "description": "<img height=\"480\" src=\"https://www.gamespot.com/a/uploads/square_medium/1574/15746725/4079461-deckdecember_v0.jpg\" width=\"480\" /> Steam Decks are now readily available and like it or not, they’re slowly transforming us all into PC gamers. So whether you’ve had one for a while, just got yours during the holidays or won it during the Game Awards giveaway, here are 14 games that are a real treat to play on it.", "link": "https://www.gamespot.com/videos/14-best-steam-deck-games-to-play-right-now/2300-6460286/", "date_published": "2022-12-28 15:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Best Of 2022: Betrayal At Club Low Opened My Eyes To The Possibilities Of Dialogue", "description": "<p dir=\"ltr\"> Charisma is one of my favorite skills to level up in RPGs and RPG-adjacent games. Maybe it's because of my own social ineptitude, but I feel empowered by the fantasy of being able to smooth talk, flirt, or simply make eye contact with a vendor. For decades now, games like Fallout and Mass Effect have sated me with the ability to bend people to my will using a mere stat point and live vicariously through whatever sweet-talking sycophant I wound up creating. However, it turns out that those games and many others are actually pretty bad at exploring conversation in compelling or meaningful ways. Betrayal at Club Low has opened my eyes to the possibilities of dialogue.</p><p dir=\"ltr\">Betrayal at Club Low is part of Cosmo D's Off-Peak series of games, which can only be described as a series of interactive modern art exhibits that snowballed into something bigger. Additional gameplay features have been getting built in to make the various Off-Peak titles more than just walking simulators. However, even with the clear signs of progression throughout all these games, Betrayal at Club Low is a unique experience. The real star of previous titles in the series has been the bizarre world, but here, it's the dialogue.</p><figure style=\"width: 3840px;\"><a href=\"https://www.gamespot.com/a/uploads/original/1750/17503512/4077828-screen_bacl07.jpg\"><img alt=\"My Physique will defeat your High Standards In Dancing.\" src=\"https://www.gamespot.com/a/uploads/scale_super/1750/17503512/4077828-screen_bacl07.jpg\" /></a><figcaption>My Physique will defeat your High Standards In Dancing.</figcaption></figure><p dir=\"ltr\">The setup for Betrayal at Club Low is clear: You're dropped off at the titular club with the objective of extracting an undercover agent from beneath the nose of the local crime lord. To infiltrate, you use the guise of a pizza delivery guy. It should be easy for an established pizzaiolo like yourself. Unfortunately, all your conversational skills start off in the gutter, and you need to spend money to get them anywhere useful.</p><a href=\"https://www.gamespot.com/articles/betrayal-at-club-low-opened-my-eyes-to-the-possibilities-of-dialogue/1100-6510109/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/betrayal-at-club-low-opened-my-eyes-to-the-possibilities-of-dialogue/1100-6510109/?ftag=CAD-01-10abi2f", "date_published": "2022-12-28 14:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Fast X: Everything We Know About The Tenth Fast & Furious Movie", "description": "<p><img src=\"https://www.gamespot.com/a/uploads/scale_large/1757/17577455/4074783-fastxlogo.jpg\" /><br /><h3><p>After more than two decades' worth of increasingly fast and more furious movies, the Fast and the Furious main series is finally drawing to a close. Fast X, which hits theaters early next year, is the first of a Harry Potter-style two-part finale that will presumably wrap up the story of Dominic Toretto and his #family. And with an unbelievably stacked cast, the tenth main entry in this series is looking like it'll be one of the most expensive movies ever made.</p><p dir=\"ltr\">The story of how this franchise became the sort of thing that could warrant a budget like that is about as ludicrous as the car stunts the series is famous for. Beginning with a first film that felt rooted firmly in the mid-90s when it came out in 2001, and then bringing out a sequel without Vin Diesel, and then dropping a box office bomb of a third film that had no connection at all to the other to beyond a final scene that plays like a Marvel post-credits scene today.</p><p dir=\"ltr\">Somehow, despite even Vin Diesel not really being that interested in keeping it going, director Justin Lin somehow managed to reunite Dom and Brian and usher in the era of The Fast and the Furious.</p><p dir=\"ltr\">But all things eventually come to an end, and after two decades none of the old hats is young and spry anymore. And so it's time for a two-part finale that begins with Fast X.</p></h3></p><br />     <p><h2>When is Fast X coming out?</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1757/17577455/4075216-fastxreleasedate.jpg\" /><br /><h3><p>Fast X is scheduled to hit movie theaters just a few short months from now, on May 19, 2023, with the eleventh and final film planned for February of 2024.</p></h3></p><br />     <p><h2>Who's directing?</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1757/17577455/4075200-fastandfuriousfamily.jpg\" /><br /><h3><p>Vin Diesel will once again lead this gargantuan ensemble cast, with most everybody who survived F9 returning. Aside from Diesel, you can expect old timers Michelle Rodriguez as Letty, Tyrese Gibson as Roman, Ludacris as Tej, Jordana Brewster as Mia, and Sung Kang as Han to all show up. More recent additions to the #family, like Nathalie Emmanuel's Ramsey, John Cena's Dom's brother Jakob, Jason Statham as Deckard Shaw, Helen Mirren as Mama Shaw, Michael Rooker as Buddy, and Scott Eastwoord as Little Nobody, will also appear.</p><p dir=\"ltr\">And apparently Cardi B will reprise her cameo role from F9, if that was a thing you were worried about or remembered happening.</p><p dir=\"ltr\">Kurt Russell's Mr. Nobody and Luke Evans's Owen Shaw aren't expected to pop up, but you never know with these things.</p><p dir=\"ltr\">On the villainous side, Charlize Theron's Cipher will return. Again.</p></h3></p><br />     <p><h2>Is Dwayne 'The Rock' Johnson going to be in it?</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1757/17577455/4074786-dwayne.jpg\" /><br /><h3><p dir=\"ltr\">No</p></h3></p><br />     <p><h2>Who's joining the family?</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1757/17577455/4075203-brielarsonfastfamily.jpg\" /><br /><em>Vin Diesel's Instagram</em><br /><h3><p>There are two big names joining the main cast of Fast X: Brie Larson and Jason Momoa. Momoa will play a new villain named Dante who works with Cipher. Larson's character is named Tess, but we don't know anything beyond that.</p><p dir=\"ltr\">Rita Morena, one of only a few actors who have ever pulled off the EGOT (winning Emmy, Grammy, Oscar AND Tony awards), will also be joining the cast as the Toretto matriarch. And, in case you weren't hyped up enough about this cast, we've also got Daniela Melchior (Ratcatcher 2 from The Suicide Squad) and Alan Ritchson (Jack Reacher in the excellent recent Amazon series) joining up in unspecified roles.</p><p dir=\"ltr\">It's probably safe to bet that, if Fast X is a disappointment, it's not gonna be because of this cast.</p></h3></p><br />     <p><h2>Who's directing?</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1757/17577455/4075209-fastandfuriousdirector.jpg\" /><br /><h3><p>Franchise stalwart Justin Lin deserves as much credit as anyone for the Fast franchise's success after he directed three films (Fast &amp; Furious, Fast Five and Fast &amp; Furious 6) that turned the series into a big deal. But after he returned to the series for F9, he and Diesel reportedly <a href=\"https://www.gamespot.com/articles/vin-diesel-blamed-for-justin-lin-leaving-fast-x-report/1100-6503002/\">clashed so hard</a> on Fast X that Lin quit the job just a week into filming. \"This movie is not worth my mental health,\" he is reported to have shouted after one fight with Diesel.</p><p dir=\"ltr\">Lin was replaced by action director Louis Leterrier, known for directing Transporter 2, The Incredible Hulk, and all ten episodes of The Dark Crystal: Age of Resistance. As a last second quick fix replacement, you could do a lot worse than Leterrier, who has plenty of action movie cred.</p></h3></p><br />     <p><h2>What kind of cool and exciting locations will Fast X go to?</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1757/17577455/4074785-f9spacecar.jpg\" /><br /><h3><p>Surprising probably no one, at least part of the film will take place in Los Angeles, the city the Toretto family calls home. So we should once again get some time with the Toretto house in Angelino Heights that was rebuilt after it got blown up in Furious 7.</p><p dir=\"ltr\">Beyond that, we can expect the usual globe-trotting action, this time centered on Europe. Fast X filmed in and around two different cities in Italy--Rome and Turin--and the production also spent time in Lisbon and London. Though London might not be a major location in the film, since they were shooting on Warner Bros' studio lot in Leavesden--meaning they were probably shooting on sound stages and backlots that will represent other places.</p><p dir=\"ltr\">Will they return to outer space, though? That's</p></h3></p><br />     <p><h2>What's gonna happen in Fast X?</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1757/17577455/4075210-fastxwht%27sgonnahappene.jpg\" /><br /><h3><p>We don't have any kind of plot summary yet, nor have we seen a trailer. So we don't know a whole lot. At the end of F9, we had Charlize Theron's Cipher on the loose once more and John Cena's Jakob abandoning his bad guy ways to join his secret brother Dom in the #family. And Dom has unfinished business with Cipher, who killed Elena in The Fate of the Furious.</p><p dir=\"ltr\">With Fast X (supposedly) representing the beginning of the end for the main series, it's very likely that Cipher will once more take center stage as a Big Bad, teaming up this time with Jason Momoa's Dante, a new character. And with Rita Moreno popping in as Grandma Toretto, it's safe to say we're going to once again delve deeply into the Toretto family backstory. Hope you're excited for more flashbacks!</p></h3></p><br />", "link": "https://www.gamespot.com/gallery/fast-x-everything-we-know-about-the-tenth-fast-furious-movie/2900-4520/", "date_published": "2022-12-28 14:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]