{"entries": [{"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/live/2022/dec/29/australia-v-south-africa-second-test-day-four-live", "title": "Australia v South Africa: second Test, day four – live", "date_published": "2022-12-28 23:01:03+00:00", "description": "<ul><li>Updates as the three-Test series continues at the MCG</li><li>Start time in Melbourne is 10am AEST/11pm GMT</li><li>Any thoughts? <a href=\"mailto:geoff.lemon@theguardian.com\">Email Geoff</a> or tweet <a href=\"https://twitter.com/GeoffLemonSport\">@GeoffLemonSport</a></li></ul><p>Players and umpires heading onto the ground now. What’s the feeling out there? It seems to me that if a wicket goes early, we could be out of here around lunchtime. It would be good to see South Africa make Australia work though.</p><p>The southerly, I can attest, is very brisk, having just made my way to the ground from the north. It was up in my face like a nightclub bouncer.</p> <a href=\"https://www.theguardian.com/sport/live/2022/dec/29/australia-v-south-africa-second-test-day-four-live\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/society/2022/dec/28/police-cannabis-citation-dying-cancer-patient-kansas", "title": "Outrage after police cite dying cancer patient using cannabis to manage pain", "date_published": "2022-12-28 22:47:52+00:00", "description": "<p>‘You’d think they would have shown compassion’: patient’s son decries Kansas police who issued citation to father in hospital bed</p><p>Hospital staff in Kansas called the police on a man dying of cancer who was using cannabis products to cope with his symptoms, in an incident that has since sparked outrage and renewed calls to rethink the state’s strict cannabis laws.</p><p>The encounter took place in mid-December, when police in the city of Hays say two officers showed up at the cancer patient’s hospital room to issue him a citation for a drug violation. Police also took away a vaping device and cannabis product that hospital staff had already confiscated.</p> <a href=\"https://www.theguardian.com/society/2022/dec/28/police-cannabis-citation-dying-cancer-patient-kansas\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/28/leeds-united-manchester-city-premier-league-match-report", "title": "Haaland marks Leeds return with goal to seal victory for Manchester City", "date_published": "2022-12-28 22:07:31+00:00", "description": "<p>It took Alfie Haaland 181 games spread over a decade to score 18 Premier League goals – his son Erling has bested him after 14 appearances for Manchester City, not that his former Leeds defender father will mind too much.</p><p>Leeds had made City work hard for their chances but were rarely able to cope with the champions’ slick passing and movement. For their second goal, a tired pass from the captain Liam Cooper to the oblivious Robin Koch was intercepted by boo-boy Jack Grealish, giving him the freedom of the half, he drew out the goalkeeper and slipped the ball to Haaland to knock into an empty net for his 19th of the campaign. Grealish enjoyed the goal more than Haaland after receiving plenty of Elland Road rancour throughout.</p> <a href=\"https://www.theguardian.com/football/2022/dec/28/leeds-united-manchester-city-premier-league-match-report\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/28/suspected-california-serial-killer-charged-four-additional-deaths", "title": "Suspected Stockton serial killer charged with four additional deaths", "date_published": "2022-12-28 21:57:28+00:00", "description": "<p>Wesley Brownlee, arrested in October while allegedly ‘out hunting’ for another victim, now faces seven charges for slayings</p><p>A man suspected in northern California serial killings has been charged in four additional slayings this week, bringing the total to seven deaths since April 2021, authorities said.</p><p>The shootings terrorized the Central Valley city of Stockton earlier this year as police searched for a man clad in black who appeared to be “on a mission” as he hunted victims for ambush-style shootings. He was also tied to violence in Alameda county.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/28/suspected-california-serial-killer-charged-four-additional-deaths\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/28/liverpool-complete-35m-signing-of-world-cup-star-cody-gakpo", "title": "Liverpool complete £35m signing of World Cup star Cody Gakpo", "date_published": "2022-12-28 21:15:48+00:00", "description": "<p>• Winger was linked with Manchester United before Anfield move</p><p>• Attacker will bolster Jürgen Klopp’s attacking options</p><p>Liverpool have completed the signing of Cody Gakpo from PSV Eindhoven after bringing forward their transfer plans to beat off rival interest from the likes of Manchester United for the Netherlands international.</p><p>Gakpo, who shone for Louis van Gaal’s team at the World Cup, has signed a five-and-a-half year contract with Liverpool and will cost an initial €40m (£35m). The total fee for the 23-year-old could rise to €50m (£44m).</p> <a href=\"https://www.theguardian.com/football/2022/dec/28/liverpool-complete-35m-signing-of-world-cup-star-cody-gakpo\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/uk-news/2022/dec/28/us-bomb-cyclone-to-cause-wet-and-windy-weather-in-uk-says-met-office", "title": "US ‘bomb cyclone’ to cause wet and windy weather in UK, says Met Office", "date_published": "2022-12-28 21:03:13+00:00", "description": "<p>Storm that sent US temperatures plunging triggers yellow weather warning for heavy rain over Scotland on Friday</p><p>The deadly bomb cyclone that has sent temperatures plunging in the US is also causing the UK to experience wet and windy weather, the Met Office has said.</p><p>On Wednesday, the forecaster issued a yellow weather warning for heavy rain from 3am on Friday for 15 hours for much of Scotland, including Edinburgh, Glasgow and Stirling. The Met Office said heavy rain could bring some flooding and travel disruption.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/28/us-bomb-cyclone-to-cause-wet-and-windy-weather-in-uk-says-met-office\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/28/tulsi-gabbard-george-santos-fox-news-interview", "title": "‘Do you have no shame?’: Tulsi Gabbard grills congressman-elect George Santos", "date_published": "2022-12-28 20:41:05+00:00", "description": "<p>The former presidential candidate called resume-inflating Santos’s claims ‘blatant lies’ in Fox News interview</p><p>In a Fox News interview with former presidential candidate Tulsi Gabbard on Tuesday, Republican congressman-elect George Santos claimed he is not a “fraud” when questioned about the recent revelations – and his eventual admission – that his claims about his career and identity are riddled with lies and fabricated records.</p><p>The Fox interview came the same day as fresh <a href=\"https://www.reuters.com/world/us/embattled-republican-santos-faces-new-heat-over-jew-ish-heritage-claim-2022-12-27/\">allegations</a><strong> </strong>that he falsely claimed a Jewish identity.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/28/tulsi-gabbard-george-santos-fox-news-interview\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/28/buffalo-storm-national-guard-new-york", "title": "National guard check door-to-door in Buffalo after storm that killed 34", "date_published": "2022-12-28 18:57:46+00:00", "description": "<p>Officials fear more fatalities may be found after high winds and record snowfalls ravage western New York</p><p>Members of the US national guard went door-to-door in some neighborhoods of Buffalo, <a href=\"https://www.theguardian.com/us-news/new-york\">New York</a>, on Wednesday to check on residents who lost power during a <a href=\"https://www.theguardian.com/us-news/2022/dec/27/us-braces-for-more-deaths-as-blizzard-of-the-century-grips-nation\">winter storm</a> earlier this week that killed nearly three dozen residents of the region.</p><p>As the national guard made their way from house to house, members were confronted with the bleak possibility of encountering still more <a href=\"https://www.theguardian.com/us-news/2022/dec/27/new-york-snowstorm-death-toll-us-winter-storm-buffalo\">victims</a> in frigid homes and piles of melting snow, <a href=\"https://apnews.com/article/winter-storm-buffalo-updates-8f0f23a471f5db4c6425905f48ecf670\">according to the Associated Press</a>.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/28/buffalo-storm-national-guard-new-york\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/live/2022/dec/28/leeds-v-manchester-city-premier-league-live", "title": "Leeds v Manchester City: Premier League – live", "date_published": "2022-12-28 18:54:46+00:00", "description": "<ul><li>Match at Elland Road kicks off at 8pm (GMT)</li><li><a href=\"https://www.theguardian.com/football/2022/dec/25/kevin-de-bruyne-claims-goal-obsession-can-drive-erling-haaland-to-800-club\">De Bruyne claims goal obsession can drive Haaland to 800 club</a></li><li>Share your thoughts with Barry <a href=\"mailto:barry.glendenning@theguardian.com\">via email</a> or <a href=\"https://twitter.com/bglendenning\">on Twitter</a></li></ul><p>Leeds United are without Tyler Adams, the USA captain suspended tonight on the back of his late dismissal against Tottenham Hotspur last time out. Long term absentees Stuart Dallas (broken leg) and Archie Gray (ankle) are also sidelined. Goalkeeper Ilan Meslier is also a doubt with illness, while striker Patrick Bamford, wingers Crysencio Summerville and Jack Harrison, centre-back Liam Cooper and midfiedler Mateusz Klich are also major doubts. Klich is expected to lerave the club in January, with MLS club DC United havingtabled a generous offer.</p> <a href=\"https://www.theguardian.com/football/live/2022/dec/28/leeds-v-manchester-city-premier-league-live\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/science/2022/dec/28/all-planets-in-the-solar-system-visible-in-night-sky-at-same-time-on-wednesday", "title": "All planets in the solar system visible in night sky at same time on Wednesday", "date_published": "2022-12-28 18:40:05+00:00", "description": "<p>In the northern hemisphere five planets can be seen by the naked eye, and Uranus and Neptune with a telescope or binoculars</p><p>Every planet in the solar system was visible in the night sky simultaneously on Wednesday, which is regarded by experts as a rare astronomical event.</p><p>Venus, Mercury, Saturn, Jupiter and Mars could all be seen in that order in the northern hemisphere with the naked eye, starting from the south-western horizon and moving east.</p> <a href=\"https://www.theguardian.com/science/2022/dec/28/all-planets-in-the-solar-system-visible-in-night-sky-at-same-time-on-wednesday\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/28/italy-decrees-travellers-from-china-must-take-covid-tests", "title": "Italy decrees travellers from China must take Covid tests", "date_published": "2022-12-28 18:03:28+00:00", "description": "<p>Beijing reopening its borders has caused concern over the potential for new variants of the virus to emerge</p><p>Italy has become the first country in Europe to make it obligatory for people arriving from China to be tested for Covid-19 following Beijing moving to reopen its borders after lifting some of its toughest anti-Covid restrictions.</p><p>The move, which sees Italy join a number of countries closer to China in changing its travel policy, comes amid concerns over the potential for new variants to emerge during fresh outbreaks of the virus in China and quickly spread overseas. Japan, Malaysia, South Korea and India are among the Asian states that have introduced measures to prevent an influx of cases, including mandatory PCR tests and genetic sequencing of positive cases.</p> <a href=\"https://www.theguardian.com/world/2022/dec/28/italy-decrees-travellers-from-china-must-take-covid-tests\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/28/fa-moves-to-tighten-security-at-wembley-after-disorder-at-euros-final", "title": "FA moves to tighten security at Wembley after disorder at Euros final", "date_published": "2022-12-28 18:03:22+00:00", "description": "<ul><li>Proposal for new perimeter fencing put to Brent Council</li><li>Two thousand ticketless people gained access to Euros final</li></ul><p>The Football Association has acted to increase security outside Wembley stadium after the disorder that tainted the men’s European Championship final last year. English football’s governing body has asked for permission to install new perimeter fencing at the national stadium, following up on one of the key recommendations made in a report into the <a href=\"https://www.theguardian.com/football/2021/dec/03/england-fan-disorder-at-euro-2020-final-almost-led-to-deaths-review-finds\">events of 11 July 2021</a>.</p><p>If Brent council agrees to the request – which was made last week by Wembley National Stadium Ltd, a wholly owned subsidiary of the FA – new fencing will be erected at a number of approaches and key entrances to the ground.</p> <a href=\"https://www.theguardian.com/football/2022/dec/28/fa-moves-to-tighten-security-at-wembley-after-disorder-at-euros-final\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/28/dog-doge-meme-kabosu-leukemia-liver-disease", "title": "Dog that inspired ‘Doge’ meme has leukemia and liver disease, owner says", "date_published": "2022-12-28 18:01:09+00:00", "description": "<p>Kabosu, a 17-year-old shiba inu, became an internet sensation based on a 2010 photo, even inspiring cryptocurrency Dogecoin</p><p>The dog behind the famous “Doge” meme has been diagnosed with leukemia and liver disease, its owner announced.</p><p>In an Instagram <a href=\"https://www.instagram.com/reel/CmrZUSYocJz/?igshid=YmMyMTA2M2Y=\">post</a> on Tuesday, Atsuko Sato, the Japan-based owner of Kabosu, revealed that the 17-year-old shiba inu has chronic lymphocytic leukemia, a type of blood and bone marrow cancer, and cholangiohepatitis, an inflammation of the bile ducts, gallbladder and liver tissue.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/28/dog-doge-meme-kabosu-leukemia-liver-disease\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/business/2022/dec/28/exxonmobil-launches-legal-challenge-to-eus-windfall-tax-on-energy-firms", "title": "ExxonMobil launches legal challenge to EU’s windfall tax on energy firms", "date_published": "2022-12-28 17:57:27+00:00", "description": "<p>US oil producer contests legal authority for ‘solidarity contribution’ aimed at raising funds to offset soaring energy prices</p><p>The US oil giant <a href=\"https://www.theguardian.com/business/exxonmobil\">ExxonMobil</a> has launched a legal challenge against the EU in an attempt to derail the bloc’s windfall tax on the profits of energy producers.</p><p>In a high-stakes political battle as countries across Europe and the wider western world struggle with soaring energy costs and sky-high inflation, the American oil firm said it believed the EU had overreached its powers with the windfall tax.</p> <a href=\"https://www.theguardian.com/business/2022/dec/28/exxonmobil-launches-legal-challenge-to-eus-windfall-tax-on-energy-firms\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/28/chelsea-agree-deal-to-sign-striker-david-datro-fofana-to-boost-attacking-options", "title": "Chelsea agree deal to sign striker David Datro Fofana to boost attacking options", "date_published": "2022-12-28 17:51:46+00:00", "description": "<ul><li>Ivory Coast international will join from Norwegian club Molde</li><li>Reece James out for up to a month as knee injury returns</li></ul><p>Chelsea have agreed a deal to sign the striker David Datro Fofana from the Norwegian side Molde. The Ivory Coast international, who turned 20 last week, will head to Stamford Bridge in the new year.</p><p>Fofana will offer Chelsea a fresh attacking option following the news that Armando Broja <a href=\"https://www.theguardian.com/football/2022/dec/14/chelsea-armando-broja-likely-miss-rest-of-season-knee-injury\">will miss the rest of the season</a> with an anterior cruciate ligament injury.</p> <a href=\"https://www.theguardian.com/football/2022/dec/28/chelsea-agree-deal-to-sign-striker-david-datro-fofana-to-boost-attacking-options\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/28/ukrainian-who-walked-140-miles-to-safety-to-feature-in-london-exhibition", "title": "Ukrainian who walked 140 miles to safety to feature in London exhibition", "date_published": "2022-12-28 17:34:56+00:00", "description": "<p>Story of Igor Pedin’s escape from Mariupol is one of about a dozen in an exhibition entitled What Would You Take?</p><p>The secret to Igor Pedin’s survival had been his invisibility, the 61-year-old had said.</p><p>With his dog, Zhu-Zhu, the former ship’s cook banked on being ignored by the trigger-happy Russian soldiers and their killing machines when he took the <a href=\"https://www.theguardian.com/world/2022/may/13/the-invisible-ukrainian-who-walked-225km-to-safety-from-mariupol\">first step of a 140-mile journey from his home in the besieged Ukrainian port city of Mariupol on 23 April</a>, before stealing out into the badlands of Russian-occupied territories towards the relative safety in the city of Zaporizhzhia.</p> <a href=\"https://www.theguardian.com/world/2022/dec/28/ukrainian-who-walked-140-miles-to-safety-to-feature-in-london-exhibition\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/28/michigan-governor-gretchen-whitmer-kidnap-man-sentenced", "title": "Michigan governor kidnap plot: man sentenced to over 19 years in prison", "date_published": "2022-12-28 17:29:47+00:00", "description": "<p>Barry Croft Jr, the co-leader of the stunning plot to abduct the governor from her vacation home, is the final defendant in the case</p><p>A Delaware trucker described as a co-leader of the conspiracy to kidnap Michigan’s governor has been sentenced to more than 19 years in prison.</p><p>Barry Croft Jr was the fourth and final federal defendant to learn his fate, a day after ally Adam Fox was sentenced to 16 years in prison. The two men were convicted in August of conspiracy charges at a second trial in Grand Rapids.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/28/michigan-governor-gretchen-whitmer-kidnap-man-sentenced\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/politics/2022/dec/28/rishi-sunak-and-his-wife-paid-for-makeover-of-no-10-flat-tatler-profile-reveals", "title": "Velvet sofas and opulent curtains: the Sunaks’ makeover of No 10 flat revealed", "date_published": "2022-12-28 17:07:32+00:00", "description": "<p>PM and Akshata Murty got rid of ‘very tired’ decor largely installed for former chancellor George Osborne</p><p>Rishi Sunak and his wife, Akshata Murty, undertook a makeover of the No 10 flat with opulent curtains and velvet sofas in jewel colours at their own expense, according to a new profile of the couple in the society magazine <a href=\"https://www.tatler.com/article/akshata-murty-rishi-sunak-wife-february-issue\">Tatler</a>.</p><p>John Challis, the upholsterer behind the transformation, told the magazine that the redesign got rid of the “very tired” decor largely installed for the family of former chancellor George Osborne.</p> <a href=\"https://www.theguardian.com/politics/2022/dec/28/rishi-sunak-and-his-wife-paid-for-makeover-of-no-10-flat-tatler-profile-reveals\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/politics/2022/dec/28/no-10-concerned-mps-engaged-in-sex-and-heavy-drinking-on-trips-abroad", "title": "No 10 ‘concerned’ MPs engaged in ‘sex and heavy drinking’ on trips abroad", "date_published": "2022-12-28 17:01:05+00:00", "description": "<p>Downing Street says reports of raucous behaviour of all-party trips are a matter for parliament</p><p>No 10 has said it is “very concerning” that MPs were reportedly met by sex workers in their hotel rooms and engaged in raucous drinking while on parliamentary trips abroad.</p><p>The prime minister’s deputy official spokesperson said the oversight of trips taken by all-party parliamentary groups (APPGs) was a matter for parliament but expressed concern about some of the behaviour reported by Politico and the Times.</p> <a href=\"https://www.theguardian.com/politics/2022/dec/28/no-10-concerned-mps-engaged-in-sex-and-heavy-drinking-on-trips-abroad\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/28/flooding-oregon-washington-california-pacific-northwest-storm-rain", "title": "Western US battles rain and flooding as ‘atmospheric river’ storm hits", "date_published": "2022-12-28 17:00:38+00:00", "description": "<p>Portions of northern California, Oregon and Washington could see an inch of rain an hour, spurring mudslides and debris flows</p><p>Several western US states are battling heavy rain, wind and flooding as a powerful storm system sweeps across the region.</p><p>This system, called an “<a href=\"https://www.theguardian.com/us-news/2022/dec/27/atmospheric-river-california-rains\">atmospheric river</a>”, bore down on portions of northern California, Oregon and Washington on Tuesday. The deluge could also spur mudslides and debris flows, <a href=\"https://www.nytimes.com/2022/12/27/us/atmospheric-river-california-storm-rain.html?partner=slack&amp;smid=sl-share\">according to the New York Times</a>.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/28/flooding-oregon-washington-california-pacific-northwest-storm-rain\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/business/2022/dec/28/insurers-end-war-risk-cover-for-shipping-in-ukraine-invasion-territories", "title": "Insurers end war-risk cover for shipping in Ukraine invasion zone", "date_published": "2022-12-28 16:58:35+00:00", "description": "<p>Expiry of current 12-month contracts allows some firms to cancel 2023 cover citing  reinsurers’ losses</p><p>Ship insurers are cancelling war-risk coverage across Russia, Ukraine and Belarus from January, leaving cargo and freight companies liable for major losses linked to <a href=\"https://www.theguardian.com/world/2022/dec/28/russia-ukraine-war-at-a-glance-what-we-know-on-day-308-of-the-invasion\">the ongoing conflict</a>.</p><p>At least 12 of the 13 Protection and Indemnity (P&amp;I) clubs - which cover 90% of the world’s ocean-going ships, including those from the UK and the US - said they would no longer be able to provide coverage to clients due to reinsurers exiting the regions amid financial losses.</p> <a href=\"https://www.theguardian.com/business/2022/dec/28/insurers-end-war-risk-cover-for-shipping-in-ukraine-invasion-territories\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/28/james-maddison-ruled-out-of-liverpool-match-after-visiting-specialist", "title": "James Maddison ruled out of Liverpool match after visiting specialist", "date_published": "2022-12-28 16:57:17+00:00", "description": "<ul><li>Leicester midfielder struggling with fresh knee injury </li><li>Maddison missed Newcastle defeat and return date unknown</li></ul><p>James Maddison visited a specialist on Wednesday as Leicester attempt to get to the bottom of a mystery knee injury, after the midfielder returned from the World Cup with a fresh problem. Maddison has not been able to train with his Leicester teammates since returning from Qatar and will miss Friday’s trip to Liverpool.</p><p>Maddison travelled to London with Mark Waller, the Leicester club doctor, on Wednesday to further understand the extent of his issue. Maddison had injured the back of his knee in November before the World Cup, for which he <a href=\"https://www.theguardian.com/football/2022/nov/18/injury-expected-to-rule-james-maddison-out-of-englands-opening-game-in-qatar\">received treatment while away with England</a>. The midfielder is now ruled out with an issue at the front of his knee. It is unclear how long Maddison is set to be sidelined.</p> <a href=\"https://www.theguardian.com/football/2022/dec/28/james-maddison-ruled-out-of-liverpool-match-after-visiting-specialist\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/28/brighton-bring-in-jens-scheuer-as-womens-head-coach", "title": "Brighton bring in Jens Scheuer as women’s head coach", "date_published": "2022-12-28 16:48:33+00:00", "description": "<ul><li>Former Bayern manager replaces Hope Powell</li><li>Team one place above relegation zone in WSL</li></ul><p>Brighton have appointed former Bayern Munich manager Jens Scheuer as their new women’s head coach on a three-and-a-half-year deal.</p><p>The Seagulls have been without a manager since October after Hope Powell stepped down following a difficult start to the Women’s Super League season.</p> <a href=\"https://www.theguardian.com/football/2022/dec/28/brighton-bring-in-jens-scheuer-as-womens-head-coach\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/technology/2022/dec/28/mastodon-founder-elon-musk-twitter-takeover", "title": "Mastodon founder says investors lining up since Elon Musk’s Twitter takeover", "date_published": "2022-12-28 16:47:56+00:00", "description": "<p>Eugen Rochko says he received offers of hundreds of thousands of dollars for rival network from Silicon Valley private equity firms</p><p>The founder of Mastodon has said he has rejected approaches from more than five US-based investors, as the Twitter rival grows in popularity after Elon Musk’s <a href=\"https://www.theguardian.com/technology/2022/nov/17/elon-musk-twitter-closes-offices-loyalty-oath-resignations\">chaotic debut</a> as a social media owner.</p><p>Eugen Rochko, who launched the open-source social network in 2016, told the Financial Times he had received the offers from Silicon Valley private equity firms to put “hundreds of thousands of dollars” into the product.</p> <a href=\"https://www.theguardian.com/technology/2022/dec/28/mastodon-founder-elon-musk-twitter-takeover\">Continue reading...</a>", "persistent": true, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/uk-news/2022/dec/28/government-refuses-to-disclose-whether-prevent-strategy-will-be-redacted", "title": "Government refuses to disclose whether Prevent strategy will be redacted", "date_published": "2022-12-28 16:31:06+00:00", "description": "<p>Whitehall sources claim the Home Office is fighting with Michael Gove over whether Islamist extremists’ details should be removed</p><p>No 10 has refused to say if its review of the Prevent counter-terrorism strategy will be redacted, amid reports it has been delayed by a row between Michael Gove and the Home Office over whether to reveal the names of suspected Islamist extremists.</p><p>The Prevent review was handed over to the Home Office by William Shawcross, a former head of the Charity Commission, in the summer.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/28/government-refuses-to-disclose-whether-prevent-strategy-will-be-redacted\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/society/2022/dec/28/dementia-patients-in-england-facing-national-crisis-in-care-safety", "title": "Dementia patients in England facing ‘national crisis’ in care safety", "date_published": "2022-12-28 16:29:10+00:00", "description": "<p>Exclusive: Nearly one in 10 care homes that offer dementia support reported on by inspectors in 2022 were given worst rating</p><ul><li><a href=\"https://www.theguardian.com/society/2022/dec/28/very-grim-daughter-criticises-surrey-care-home-over-fathers-death\">‘Very grim’: daughter criticises Surrey care home over father’s death</a></li></ul><p>Families of people with dementia have said there is a national crisis in care safety as it emerged that more than half of residential homes reported on by inspectors this year were rated “inadequate” or requiring improvement – up from less than a third pre-pandemic.</p><p>Serious and often shocking failings uncovered in previously “good” homes in recent months include people left in bed “for months”, pain medicine not being administered, violence between residents and malnutrition – including one person who didn’t eat for a month.</p> <a href=\"https://www.theguardian.com/society/2022/dec/28/dementia-patients-in-england-facing-national-crisis-in-care-safety\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/28/france-ban-on-single-use-restaurant-tableware-hailed-as-fast-food-revolution", "title": "Ban on single-use restaurant tableware hailed as fast-food ‘revolution’ in France", "date_published": "2022-12-28 16:25:15+00:00", "description": "<p>McDonald’s and other chains race to replace throwaway plastic with reusable cutlery and plates before dining deadline</p><p>Fast-food chains in France are preparing for one of the biggest changes to their restaurants in decades as the government bans disposable plates, cups and tableware for anyone eating or drinking on-site.</p><p>Chains such as McDonald’s, Burger King, Starbucks and Subway are facing what environmentalists have called a “revolution” on 1 January as pioneering new measures come into force in France to combat waste.</p> <a href=\"https://www.theguardian.com/world/2022/dec/28/france-ban-on-single-use-restaurant-tableware-hailed-as-fast-food-revolution\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/uk-news/2022/dec/28/pan-european-sleeper-train-to-sweep-britons-to-berlin-from-may-2023", "title": "Pan-European sleeper train to sweep Britons to Berlin from May 2023", "date_published": "2022-12-28 16:00:03+00:00", "description": "<p>Other similar routes have sprung up as the travel industry responds to rising fuel costs and climate damage</p><p>It hasn’t been an easy time to be a rail enthusiast, but the resurgence of the sleeper train on the continent is offering British travellers a tantalising prospect for 2023.</p><p>A new pan-European service starting in May is opening up the possibility of jumping on a Eurostar at Kings Cross St Pancras on a Friday afternoon and waking up in Berlin the following morning, breakfast included.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/28/pan-european-sleeper-train-to-sweep-britons-to-berlin-from-may-2023\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/28/stop-worrying-about-everything-thing-ill-do-differently", "title": "‘I will try to stop worrying about everything’: the thing I’ll do differently in 2023", "date_published": "2022-12-28 16:00:03+00:00", "description": "<p>Anxiety dominates my thinking about work, social engagements, the stupid day-to-day admin of being a human – and it doesn’t achieve anything</p><p>Over the years, I have learned a few strategies for making new year resolutions: keep them simple, tell as few people about them as possible and do not under any circumstances write them down.</p><p>I’ve learned this the hard way. One year I announced – under pressure at a New Year’s Eve party – that I was going to write a play. I never even opened a new document to that effect, but I spent a lot of time worrying about this latest item on the long list of things I will almost certainly never manage.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/28/stop-worrying-about-everything-thing-ill-do-differently\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/28/united-cup-offers-mens-and-womens-tennis-chance-to-present-united-front", "title": "United Cup offers men’s and women’s tennis chance to present united front", "date_published": "2022-12-28 16:00:02+00:00", "description": "<p>New joint ATP and WTA tournament is the sport’s first attempt to harness the combined forces of the male and female games</p><p>During the first week of Wimbledon in 2019, even with two grand slam singles titles up for contention, most of the attention early on came from an unexpected direction. Serena Williams and Andy Murray had announced at the last minute that they would compete together in mixed doubles and, as they marched through the early rounds, for once doubles commanded the spotlight. <a href=\"https://www.youtube.com/watch?v=VHqn2fdJ2DE\">Williams spectacularly deflected 138mph first serves for clean winners</a> while Murray coolly navigated the net, and this unexpected meeting of two greats provoked a jubilant atmosphere that seemed even more joyful than many other famous moments before them.</p><p>Months earlier, Williams and Roger Federer had started the season by facing each other for the first time in mixed doubles during the Hopman Cup, an instance that landed them on the front pages of newspapers around the world even though it was only an exhibition.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/28/united-cup-offers-mens-and-womens-tennis-chance-to-present-united-front\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/28/benjamin-netanyahu-government-makes-west-bank-settlement-expansion-its-priority", "title": "Netanyahu government makes West Bank settlement expansion its priority", "date_published": "2022-12-28 15:57:45+00:00", "description": "<p>Hard-line coalition vows to legalise dozens of illegally built outposts and annex the occupied territory</p><p>Benjamin Netanyahu’s incoming hard-line government put West Bank settlement expansion at the top of its list of priorities on Wednesday, vowing to legalise dozens of illegally built outposts and annex the occupied territory as part of its coalition deal with its ultranational allies.</p><p>The coalition agreements, released a day before the government is to be sworn into office, also included language endorsing discrimination against LGBTQ+ people on religious grounds, as well as generous stipends for ultra-Orthodox men who prefer to study instead of work.</p> <a href=\"https://www.theguardian.com/world/2022/dec/28/benjamin-netanyahu-government-makes-west-bank-settlement-expansion-its-priority\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/28/afghanistan-faint-hopes-that-taliban-will-relax-ban-on-ngo-women-after-un-condemnation", "title": "Faint hopes that Taliban will relax ban on NGO women after UN condemnation", "date_published": "2022-12-28 15:50:20+00:00", "description": "<p>Security council’s rare display of unity adds pressure after most aid groups in Afghanistan suspend services</p><p>Faint hopes exist that the Taliban may relax its <a href=\"https://www.theguardian.com/world/2022/dec/24/taliban-stop-women-from-working-for-aid-organisations\">ban on all women</a> working for the non-governmental aid agencies in Afghanistan after the UN security council <a href=\"https://www.theguardian.com/world/2022/dec/28/security-council-tells-taliban-to-reverse-restrictions-on-women-in-afghanistan\">condemned the ban</a> in a rare show of unanimity.</p><p>Almost all the large NGO aid agencies operating in Afghanistan have suspended almost all their work while talks continue to persuade the Taliban to rescind or clarify their decision. Tens of thousands of aid workers – many of them the chief breadwinners for the household – have been told to stay at home during the suspension, as the UN seeks to persuade the Taliban of the consequences for ordinary people in Afghanistan.</p> <a href=\"https://www.theguardian.com/world/2022/dec/28/afghanistan-faint-hopes-that-taliban-will-relax-ban-on-ngo-women-after-un-condemnation\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/28/conflated-takes-savills-chase-but-a-plus-tard-injury-sparks-cheltenham-concern", "title": "Conflated takes Savills Chase but A Plus Tard injury sparks Cheltenham concern", "date_published": "2022-12-28 15:39:03+00:00", "description": "<ul><li>Irish Gold Cup winner wins by five lengths in Leopardstown</li><li>Cheltenham Gold Cup winner suffers injury hours before race</li></ul><p>Conflated, last season’s Irish Gold Cup winner at Leopardstown, further improved his record at the track with a straightforward five-length success in the Grade One Savills Chase on Wednesday, though the contest lost much of its significance as a Festival trial when A Plus Tard, the reigning Cheltenham Gold Cup winner, was scratched a few hours before the race after knocking a joint on the way to the course.</p><p>A Plus Tard was a hugely impressive winner of Cheltenham’s showpiece event in March but he was pulled up on his only subsequent start, in the Betfair Chase at Haydock Park in November, and his preparation to defend his crown has now been thrown into further confusion.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/28/conflated-takes-savills-chase-but-a-plus-tard-injury-sparks-cheltenham-concern\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/28/usa-public-libraries", "title": "This year I’m thankful for US public libraries – beautiful icons of a better civic era | Moira Donegan", "date_published": "2022-12-28 15:13:41+00:00", "description": "<p>The US can often be cruel to its citizens, but the public library is a sanctuary and a vision of what our country might one day be</p><p>If you proposed it now, at any town council or city hall meeting, you would be laughed from the room. The concept is almost unthinkably indulgent, in our austere times: an institution, open for free to anyone, that sells no products, makes no money, is funded from public coffers, and is dedicated solely to the public interest, broadly defined. And it’s for <em>books</em>.</p><p>If the public library did not already exist as a pillar of local civic engagement in American towns and cities, there’s no way we would be able to create it. It seems like a relic of a bygone era of public optimism, a time when governments worked to value and edify their people, rather than punish and extract from them. In America, a country that can often be cruel to its citizens, the public library is a surprising kindness. It is institution that offers grace and sanctuary, and a vision of what our country might one day be.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/28/usa-public-libraries\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/28/kari-lake-lawsuit-judge-decline-election-challenge-sanction", "title": "Arizona judge declines to sanction Kari Lake for lawsuit challenging election", "date_published": "2022-12-28 15:07:38+00:00", "description": "<p>Case contesting race for governor was rejected and Republican candidate ordered to pay $33,000 to cover legal costs</p><p>An Arizona judge declined <a href=\"https://www.theguardian.com/us-news/2022/dec/27/kari-lake-lawsuit-court-sanction-katie-hobbs-arizona\">a request</a> on Tuesday to sanction Kari Lake for filing a lawsuit trying to overturn the result of the state’s gubernatorial race.</p><p>Peter Thompson, a superior court judge in Maricopa county, <a href=\"https://www.theguardian.com/us-news/2022/dec/24/kari-lake-arizona-judge-throws-out-challenge-defeat-governor-race-katie-hobbs\">rejected the case</a> on Saturday, saying Lake, a Republican, had failed to prove there was intentional misconduct that cost her the race.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/28/kari-lake-lawsuit-judge-decline-election-challenge-sanction\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/28/how-new-heading-rules-affect-scottish-football", "title": "‘We respect the scientists’ – how new heading rules affect Scottish football", "date_published": "2022-12-28 15:00:40+00:00", "description": "<p>Clubs accept new guidelines either side of games, with Celtic’s Ange Postecoglou saying repetitive heading in training is ‘silly’</p><p>Early this month and within days of the Scottish Football Association introducing groundbreaking guidelines on the <a href=\"https://www.theguardian.com/uk-news/2022/nov/28/scottish-footballers-to-be-banned-from-heading-ball-before-and-after-matches\">heading of balls at training</a>, the Partick Thistle goalkeeper Jamie Sneddon nodded home a stoppage-time equaliser at Cove Rangers. Was the association’s bid to protect players, after links were established between head injuries and neurodegenerative disease, destined to be in vain?</p><p>Sneddon’s intervention was nothing more than coincidence. Thistle are hardly flinging in set pieces for their goalkeeper to attack during pre-match preparations. Under the SFA’s new rules for all adults – they delivered a children’s programme in 2020 – any training exercise that could involve repeated heading is limited to once a week. These drills are banned on the days immediately before or after games.</p> <a href=\"https://www.theguardian.com/football/2022/dec/28/how-new-heading-rules-affect-scottish-football\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/28/vermeer-2023-exhibition-amsterdam-masterpieces", "title": "For Vermeer fanatics like me, 2023 will be a year when dreams come true | Simon Jenkins", "date_published": "2022-12-28 15:00:01+00:00", "description": "<p>An exhibition in Amsterdam will gather most of his masterpieces in one place – with a notable English exception</p><p>One night, a girl was stolen from her home on Hampstead Heath. A ransom was demanded but no reward offered. Three months later she was found in St Bartholomew’s churchyard in Smithfield. She was returned home to an attic at Kenwood House, where I was then allowed to visit her. She was Vermeer’s painting <a href=\"https://en.wikipedia.org/wiki/The_Guitar_Player_%28Vermeer%29\">The Guitar Player</a><em>,</em> and she had long fascinated me.</p><p>For Vermeer obsessives, next year is to be an annus mirabilis. Amsterdam’s <a href=\"https://www.rijksmuseum.nl/en/whats-on/exhibitions/vermeer\">Rijksmuseum</a> set itself the challenge of gathering together every one of the artist’s known paintings from around the world (estimates of the total settle at about 35 – with question marks over the attribution of a handful).<strong> </strong>Some <a href=\"https://www.theartnewspaper.com/2022/11/01/vermeer-roll-call-final-loans-for-rijksmuseum-blockbuster-include-masterworks-from-the-louvre-and-met\">28 works</a> will be on display, with only nine of the requested paintings omitted, several on grounds of their fragility. The exhibition is to open in February. I have booked my place in the queue.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/28/vermeer-2023-exhibition-amsterdam-masterpieces\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/28/pot-rescue-the-spaniards-who-rush-to-aid-of-abandoned-houseplants", "title": "Pot rescue: the Spaniards who rush to save abandoned houseplants", "date_published": "2022-12-28 14:53:23+00:00", "description": "<p>Pepe Ortiz and his growing team of colleagues aim to find new homes for plants that would otherwise go to landfill</p><p>Whether running errands on the outskirts of Seville or winding through the southern Spanish city’s narrow maze of streets, their eyes dart over rubbish bins, dumpsters and sidestreets. At the first sight of a clutch of abandoned green shoots or forsaken flowers, they spring into action, snapping photos and uploading them to social media.</p><p>“One could say that we’re a team of rescuers,” said Pepe Ortiz. “The goal is to save plants.”</p> <a href=\"https://www.theguardian.com/environment/2022/dec/28/pot-rescue-the-spaniards-who-rush-to-aid-of-abandoned-houseplants\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/28/shiffrin-within-three-of-vonn-mark-after-edging-gut-behrami-for-79th-career-win", "title": "Shiffrin within three of Vonn mark after edging Gut-Behrami for 79th career win", "date_published": "2022-12-28 14:39:29+00:00", "description": "<ul><li>Shiffrin edges Gut-Behrami in giant slalom for career win 79</li><li>American moves within three wins of Vonn’s all-time record</li><li>Gut-Behrami (second) and Marta Bassino (third) fill podium</li></ul><p>Mikaela Shiffrin won a gripping duel with Swiss skier Lara Gut-Behrami in a women’s World Cup giant slalom Wednesday to earn her second win in two days, and career victory No 79.</p><p>Shiffrin trailed leader Gut-Behrami by 0.22 seconds after the opening leg but the pair swapped places after a thrilling final run in which both made mistakes, with the American racer ultimately beating her rival by 0.10.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/28/shiffrin-within-three-of-vonn-mark-after-edging-gut-behrami-for-79th-career-win\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/uk-news/2022/dec/28/2022-will-be-warmest-year-on-record-in-uk-says-met-office", "title": "2022 will be warmest year on record in UK, says Met Office", "date_published": "2022-12-28 14:16:11+00:00", "description": "<p>Provisional figures show annual average temperature will exceed previous record set in 2014</p><p>2022 will be the warmest year on record for the UK, according to provisional figures from the Met Office.</p><p>The Met Office said the annual average temperature across the UK this year will exceed the previous record set in 2014, when the average was 9.88C.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/28/2022-will-be-warmest-year-on-record-in-uk-says-met-office\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/28/sports-most-memorable-moments-of-2022-no-3-golf", "title": "Sport’s most memorable moments of 2022 – No 3: Golf", "date_published": "2022-12-28 14:15:00+00:00", "description": "<p>From US Open glory for Matt Fitzpatrick to Tiger’s emotional farewell to St Andrews via a Ko masterclass and LIV fireworks</p><p>Matt Fitzpatrick, holding a one-stroke lead, tugs his tee shot into a bunker on the final hole at Brookline’s Country Club. Heads are in hands. Will Zalatoris lurks with intent. What followed, under intense pressure, was one of the finest recoveries in major championship history. From sand and 160 yards, Fitzpatrick’s iron shot finished within 20ft of the cup. “It was a hit-and-hope,” a beaming Fitzpatrick said later of that epic moment of sporting theatre.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/28/sports-most-memorable-moments-of-2022-no-3-golf\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/business/2022/dec/28/auction-houses-celebrate-bumper-year-of-blockbuster-art-sales", "title": "Auction houses celebrate bumper year of blockbuster art sales", "date_published": "2022-12-28 14:06:17+00:00", "description": "<p>Deaths and divorces of major collectors fuel record £14.3bn in sales at Christie’s, Sotheby’s and Phillips</p><p>The world’s biggest auction houses are celebrating record-breaking revenues this year after the deaths or divorces of art-collecting billionaires led to a series of blockbuster sales.</p><p>In total, the three big auction houses – Christie’s, Sotheby’s and Phillips – sold £14.3bn worth of art and other collectibles in 2022.</p> <a href=\"https://www.theguardian.com/business/2022/dec/28/auction-houses-celebrate-bumper-year-of-blockbuster-art-sales\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/28/russia-continues-bombardment-of-kherson-with-maternity-hospital-hit", "title": "Kherson maternity hospital hit as Russia continues bombardment", "date_published": "2022-12-28 14:01:20+00:00", "description": "<p>Recaptured city comes under renewed shelling as Russia also reinforces eastern town targeted by Ukraine forces</p><ul><li><a href=\"https://www.theguardian.com/world/live/2022/dec/27/russia-ukraine-war-fighting-in-donbas-difficult-and-painful-zelenskiy-says-9-million-ukrainians-without-power-live\">Russia-Ukraine war: latest news updates</a></li></ul><p>Russian forces are continuing their bombardment of the recently liberated city of Kherson, launching numerous strikes against the city on Tuesday and Wednesday that hit targets including the maternity ward of a hospital.</p><p>Thirty-three strikes were launched on Kherson in the 24 hours until Wednesday morning, according to the Ukrainian military’s daily report.</p> <a href=\"https://www.theguardian.com/world/2022/dec/28/russia-continues-bombardment-of-kherson-with-maternity-hospital-hit\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/28/tariq-corn-kid-global-fame-broccoli-viral", "title": "‘He’s having the time of his life!’ How Tariq the Corn Kid embraced global fame – and broccoli", "date_published": "2022-12-28 14:00:53+00:00", "description": "<p>The seven-year-old’s deep love of sweetcorn made him a viral sensation. But how do you top meeting Michelle Obama and starring on The Drew Barrymore Show?</p><p>It was the height of summer when seven-year-old Tariq declared: “For me … I really like corn” – and promptly became an internet sensation. His <a href=\"https://www.youtube.com/watch?v=1VbZE6YhjKk\">video interview with Julian Shapiro-Barnum, host of web series Recess Therapy</a>, went viral, as his description of corn as “a big lump with knobs” and general enthusiasm for the vegetable racked up views around the world.</p><p>“What do you like about corn?” asks Shapiro-Barnum in the video, which was shot at Smorgasburg, a weekly food festival in Prospect Park, New York. “Ever since I was told that corn was real, it tasted good,” says a gap-toothed Tariq, seemingly bemused by the sheer existence of corn. “But when I tried it with butter, everything changed! … I can’t imagine a more beautiful thing! It’s corn!”</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/28/tariq-corn-kid-global-fame-broccoli-viral\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/film/2022/dec/28/a-man-called-otto-review-tom-hanks-goes-grumpy-in-remake-of-quirky-heartwarmer", "title": "A Man Called Otto review – Tom Hanks goes grumpy in remake of quirky heartwarmer", "date_published": "2022-12-28 14:00:52+00:00", "description": "<p>Neither the comedy nor the inherently lovable Hanks are dark enough to bring this remake of an odd Swedish redemption story to life</p><p>Seven years ago, a frankly peculiar, quirky dramedy-heartwarmer from Sweden appeared: <a href=\"https://www.theguardian.com/film/2017/jun/29/a-man-called-ove-review-rolf-lassgard\">A Man Called Ove</a>, based on the bestselling novel by Fredrik Backman. It was about a grumpy old widower who snaps at everyone on his street – officiously enforcing the Neighbourhood-Watch-type rules about parking and recycling – and keeps on trying to take his own life. These attempts are continually thwarted when he spots some local outside his house breaking some bylaw and Ove can’t resist rushing out to remonstrate. But a nerdy, sweet-natured young couple move in next door and insist on befriending Ove, and their artless friendship relieves Ove’s repressed sadness and affords him redemption. Ove was played in the original by Rolf Lassgård (Wallander on Swedish TV) and now by Tom Hanks – renamed Otto – in this Hollywood remake from screenwriter David Magee and director Marc Forster. The goofy-friendly new neighbours are played by Mariana Treviño and Manuel Garcia-Rulfo.</p><p>Hanks’s performance amplifies and colourises the original curmudgeon, and his star-quality soups up the drama and makes a clearer sense of the backstory, yet the very fact of it being Hanks means that we never for a moment believe that he really is going to be that nasty (or that unhappy) for long. Soon, the lovable Hanks will surely reappear, and it duly does as the sad story of his late wife emerges in sucrose flashback – although she is always a bland cipher, not a convincing person. Finally, of course, Otto is going to be absolutely adorable. With his fierce short haircut and blank, open face he looks very familiar. Not grump, but Gump.</p> <a href=\"https://www.theguardian.com/film/2022/dec/28/a-man-called-otto-review-tom-hanks-goes-grumpy-in-remake-of-quirky-heartwarmer\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/29/i-would-love-to-teach-my-kids-to-appreciate-being-bored-because-these-days-i-never-am", "title": "I would love to teach my kids to appreciate being bored – because these days I never am | Adam Liaw", "date_published": "2022-12-28 14:00:52+00:00", "description": "<p>Call it a renouncement of hustle culture – I’m over being too busy to take care of the things I value</p><p>Nobody move. Don’t touch a thing. At this exact moment everything’s perfect.</p><p>The world is of course still going to hell in a handbasket but we’re smack in the middle of the best few days of the whole year.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/29/i-would-love-to-teach-my-kids-to-appreciate-being-bored-because-these-days-i-never-am\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/blog/2022/dec/28/novak-djokovic-makes-low-key-return-to-australia-but-fan-reaction-will-be-divided", "title": "Novak Djokovic makes low-key return to Australia but fan reaction will be divided | Courtney Walsh", "date_published": "2022-12-28 13:29:27+00:00", "description": "<p>The nine-time Australian Open winner is keen to put debacle of deportation behind him but his public reputation is tarnished</p><p>Novak Djokovic’s quiet return to Australia this week could not be starker in contrast to the absurdity surrounding his arrival in Melbourne and subsequent deportation last January.</p><p>There has been no social media post nor any official words from the nine-time Australian Open champion as yet, though he did practise on Wednesday at Memorial Drive in Adelaide.</p> <a href=\"https://www.theguardian.com/sport/blog/2022/dec/28/novak-djokovic-makes-low-key-return-to-australia-but-fan-reaction-will-be-divided\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/politics/2022/dec/28/boris-johnson-urged-hard-egg-approach-to-ni-peace-process-papers-reveal", "title": "Boris Johnson urged ‘hard egg’ approach to NI peace process, papers reveal", "date_published": "2022-12-28 13:27:37+00:00", "description": "<p>Declassified documents suggest Johnson believed in 1996 that Britain could crush the IRA</p><p><a href=\"https://www.theguardian.com/politics/boris-johnson\">Boris Johnson</a> urged a “hard egg” approach to the <a href=\"https://www.theguardian.com/uk/northernireland\">Northern Ireland</a> peace process in 1996 in the belief Britain could crush the IRA, according to declassified documents.</p><p>The then deputy editor of the Daily Telegraph favoured a security-led policy over political talks that led two years later to the Good Friday agreement.</p> <a href=\"https://www.theguardian.com/politics/2022/dec/28/boris-johnson-urged-hard-egg-approach-to-ni-peace-process-papers-reveal\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/news/gallery/2022/dec/28/indian-bikers-snowy-owl-wednesdays-best-photos", "title": "Indian bikers and a snowy owl: Wednesday’s best photos", "date_published": "2022-12-28 13:11:49+00:00", "description": "<p>The Guardian’s picture editors select photo highlights from around the world</p> <a href=\"https://www.theguardian.com/news/gallery/2022/dec/28/indian-bikers-snowy-owl-wednesdays-best-photos\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/uk-news/2022/dec/28/john-bird-actor-and-comedian-dies-aged-86", "title": "John Bird: actor and comedian dies aged 86", "date_published": "2022-12-28 13:02:56+00:00", "description": "<p>Collaborator Rory Bremner pays tribute to Bird, calling him ‘one of our greatest satirists’</p><p>The actor and comedian John Bird has died aged 86, his representatives have said.</p><p>Bird became known for sketches performed alongside John Fortune and Rory Bremner in Channel 4’s satirical show Bremner, Bird and Fortune. The show ran for 16 series, as well as one-off specials, between 1999 and 2008.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/28/john-bird-actor-and-comedian-dies-aged-86\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/uk-news/2022/dec/28/pubs-struggle-to-retain-staff-after-brexit-and-covid-double-whammy", "title": "Pubs struggle to retain staff after Brexit and Covid ‘double whammy’", "date_published": "2022-12-28 13:00:51+00:00", "description": "<p>Brexit brought the biggest shift in UK’s immigration regime in a generation, as free movement of people from the EU ended</p><p><em>In the second of our <a href=\"https://www.theguardian.com/uk-news/series/brexit-undone-\">Brexit Undone? series</a>, Heather Stewart reports on why so many businesses are still struggling to adjust to the new reality</em><em>.</em></p><p>At the Rowan Tree hotel, just outside Aviemore, amid the spectacular snow-clad scenery of the Cairngorms, co-owner Tamasina Cassidy is blunt about what she and her husband, Jonny, have had to do to cope with post-Brexit staff shortages: “Work harder.”</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/28/pubs-struggle-to-retain-staff-after-brexit-and-covid-double-whammy\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/uk-news/gallery/2022/dec/28/red-arrows-kitten-ministry-of-defence-best-photographs-2022", "title": "Red Arrows and a kitten: Ministry of Defence’s best photographs 2022", "date_published": "2022-12-28 12:37:41+00:00", "description": "<p>From the dust and dirt of a war zone to the gleaming uniforms of a parade, military photographers – soldiers, sailors and aviators who also deploy with their camera – capture the reality of life for UK servicemen and women</p> <a href=\"https://www.theguardian.com/uk-news/gallery/2022/dec/28/red-arrows-kitten-ministry-of-defence-best-photographs-2022\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/28/pope-emeritus-benedict-xvi-very-sick-says-pope-francis", "title": "Pope Emeritus Benedict XVI ‘very sick’, says Pope Francis", "date_published": "2022-12-28 12:03:05+00:00", "description": "<p>Liberal incumbent pope asks God to comfort and support retired conservative pope until ‘the end’</p><p>Pope Francis has said his retired predecessor, Pope Emeritus Benedict XVI, is “very sick” and asked for God to comfort him until “the end”.</p><p>The pontiff did not reveal the nature of the illness affecting Benedict, but towards the end of his audience on Wednesday said: “I would like to ask for a special prayer for Pope Emeritus Benedict, who in silence is supporting the church. I remind you that he is very sick. Let’s ask the Lord to comfort him and support him in this testimony of love for the church until the end.”</p> <a href=\"https://www.theguardian.com/world/2022/dec/28/pope-emeritus-benedict-xvi-very-sick-says-pope-francis\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/28/lionesses-euro-2022-win-was-logical-step-after-fighting-odds-for-so-long", "title": "Lionesses’ Euro 2022 win was logical step after fighting odds for so long", "date_published": "2022-12-28 12:01:50+00:00", "description": "<p>Women’s football has faced all manner of obstacles in England but the powers that be pulled together to get them over the line</p><p><em><strong>Welcome to Moving the Goalposts, the Guardian’s free women’s football newsletter. Here’s an extract from this week’s edition. To receive the full version once a week, just pop your email in below:</strong></em></p><p>The <a href=\"https://www.theguardian.com/football/2022/jul/31/england-germany-womens-euro-2022-final-match-report\">European Championship win</a> in July ended England’s 56-year wait for a major tournament victory and likely changed the face of women’s football in this country for ever. But how do you reflect on a gamechanging year when you are so close to it? Can you really determine whether it will have a seismic impact?</p> <a href=\"https://www.theguardian.com/football/2022/dec/28/lionesses-euro-2022-win-was-logical-step-after-fighting-odds-for-so-long\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/28/i-got-a-two-tone-purple-bike-pale-violet-and-aubergine-god-i-felt-cool-the-christmas-present-ill-never-forget", "title": "I got a two-tone purple bike, pale violet and aubergine. God, I felt cool – the Christmas present I’ll never forget", "date_published": "2022-12-28 12:00:50+00:00", "description": "<p>I was 11 or 12 and absolutely delighted, riding it around town in my faux fur white coat and a pair of purple DMs</p><p>I have a relative who is famous – OK, infamous – for their terrible gift-giving. Now, I don’t think that being poor at presents discounts you from being considered a generous, kind, altruistic person. There are many people in this world, I’m sure, who make good meals, listen sympathetically and remember important dates, but when confronted with a range of gifts will<em> </em>scream, fill their knickers and dive headfirst into a skip, only to emerge two hours later with the collected chunks of your present that year. I’m almost certainly one of them. That doesn’t make us bad people. It just makes us a somewhat spicy addition to any big day.</p><p>One rather memorable Christmas, when I was a large and rather lumpy 10-year-old, this relative gave me a pair of white woollen tights in a size XS. They barely reached my knees. So what, I hear you say. And exactly. So what? Kids grow so fast these days. White is a very flattering and easy-to-wear colour. It’s actually quite nice to look as if you’ve wrapped both legs in a set of poorly fitting bandages and just needed somewhere in the middle to store your bricks. A low-hanging, white woollen gusset that almost cuts off the blood supply to your thighs is a nice present and a nice thought.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/28/i-got-a-two-tone-purple-bike-pale-violet-and-aubergine-god-i-felt-cool-the-christmas-present-ill-never-forget\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/games/2022/dec/28/pushing-buttons-2022-games-wordle-gta-6", "title": "From Wordle to Elden Ring and GTA 6 leaks, 2022 was an exciting rebound from 2021", "date_published": "2022-12-28 11:45:49+00:00", "description": "<p>A hit puzzle, a surprise bestseller and a disastrous (and fascinating) Grand Theft Auto 6 leak have characterised a quietly eventful year</p><p>If 2021 was a bit of a nothing year for video games – the tentative first year of a new console generation, the second year of pandemic disruption, a year of delays and false starts enlivened briefly by the amateur traders giving Wall Street a shoeing via the medium of GameStop “meme stocks” – then 2022 has seen the games industry gradually get moving again. Our picks for <a href=\"https://www.theguardian.com/culture/2022/dec/21/the-20-best-video-games-of-2022\">best games of the year</a> was published this week, and there are some proper greats among them. It’s also been an interesting year for games news. The stories below are my highlights – the memorable moments from another year on this niche, unpredictable beat.</p><p><strong>The grand theft of Grand Theft Auto 6</strong></p> <a href=\"https://www.theguardian.com/games/2022/dec/28/pushing-buttons-2022-games-wordle-gta-6\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/28/leah-williamson-reveals-endometriosis-led-to-fears-of-missing-games-at-euros", "title": "Leah Williamson reveals endometriosis led to fears of missing games at Euros", "date_published": "2022-12-28 11:41:44+00:00", "description": "<ul><li>Arsenal defender opens up on living with condition</li><li>25-year-old describes lying on bathroom floor in agony</li></ul><p>The England women’s football captain, Leah Williamson, has revealed that she suffers from endometriosis and feared <a href=\"https://www.nhs.uk/conditions/endometriosis/\">the condition</a> that, among other things, causes agonising period pain, would jeopardise her participation in last summer’s European Championship.</p><p>Although Williamson ended up leading the Lionesses to glory against Germany in the Wembley final, anxiety that her endometriosis would flare up and leave her lying in agony on a bathroom floor proved a near constant companion during the tournament.</p> <a href=\"https://www.theguardian.com/football/2022/dec/28/leah-williamson-reveals-endometriosis-led-to-fears-of-missing-games-at-euros\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/news/2022/dec/28/nazanin-zaghari-ratcliffe-tells-andy-murray-she-watched-him-play-from-prison", "title": "Nazanin Zaghari-Ratcliffe tells Andy Murray she watched him play from prison", "date_published": "2022-12-28 11:37:45+00:00", "description": "<p>Wimbledon champion says Zaghari-Ratcliffe’s story is ‘incredible’ during her guest edit of BBC Radio 4’s Today programme</p><p>Nazanin Zaghari-Ratcliffe has said watching Andy Murray’s Wimbledon match from solitary confinement in Iran’s Evin prison in 2016 gave her a “connection” and “escape” that brought her closer to home through sport.</p><p>Imprisoned in Evin without books or newspapers, she said she was able to watch two TV channels in her cell: one of Iranian soap operas and another of sports. The first day, she watched the latter to find Murray playing in the Wimbledon tournament he would later win.</p> <a href=\"https://www.theguardian.com/news/2022/dec/28/nazanin-zaghari-ratcliffe-tells-andy-murray-she-watched-him-play-from-prison\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/28/the-battle-for-kyiv-revisited-the-litany-of-mistakes-that-cost-russia-a-quick-win", "title": "The battle for Kyiv revisited: the litany of mistakes that cost Russia a quick win", "date_published": "2022-12-28 11:30:07+00:00", "description": "<p>Moscow completely misjudged Ukraine, issuing some invading soldiers with parade dress to march down Kyiv’s main street</p><p>Six days before Vladimir Putin ordered the invasion of Ukraine, a small group of western intelligence officers were briefing on the Russian military plan. On a quiet table, in an unfashionable chain restaurant in London, an astonishing strategy was recounted: a <em>blitzkrieg</em> to surround Kyiv and Ukraine’s other big cities, followed by a “kill list” operation run by Russian FSB intelligence to eliminate Ukraine’s national and local leaders.</p><p>Western intelligence was certain of the Kremlin’s intentions. But many of the Russian soldiers about to start the biggest war in Europe since the second world war had no clear idea what was to come. Bored troops, nominally on exercises in Khoyniki, Belarus, 30 miles north of Ukraine, were selling their diesel fuel in the week before the invasion and passing the time <a href=\"https://www.theguardian.com/world/2022/feb/23/harsh-conditions-mean-russian-troops-near-ukraine-will-need-to-be-moved-soon\">by drinking</a>.</p> <a href=\"https://www.theguardian.com/world/2022/dec/28/the-battle-for-kyiv-revisited-the-litany-of-mistakes-that-cost-russia-a-quick-win\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/technology/2022/dec/28/tiktok-banned-on-devices-issued-by-us-house-of-representatives", "title": "TikTok banned on devices issued by US House of Representatives", "date_published": "2022-12-28 11:26:35+00:00", "description": "<p>Politicians ordered to delete Chinese-owned social video app that House has said represents ‘high risk to users’</p><p>TikTok has been banned from any devices issued by the US House of Representatives, as political pressure continues to build on the Chinese-owned social video app.</p><p>The order to delete the app was issued by Catherine Szpindor, the chief administrative officer (CAO) of the House, whose office had warned in August that the app represented a “high risk to users”.</p> <a href=\"https://www.theguardian.com/technology/2022/dec/28/tiktok-banned-on-devices-issued-by-us-house-of-representatives\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/books/2022/dec/28/the-artists-studio-by-james-hall-review-lust-and-creativity", "title": "The Artist’s Studio by James Hall review – lust, crime and creativity", "date_published": "2022-12-28 11:00:49+00:00", "description": "<p>From Bernini to Bacon, the artist’s studio has long been a place of passion and tragedy, offering a unique glimpse into the creative mind</p><p>Like the boot room at Anfield, or the unremarkable Detroit house that became Motown Records’ hit factory, the artist’s studio is where the magic happens. But the strange alchemy that turns mark-making into a spellbinding work of art is only the half of it. Sometimes, there is sex in the studio, too. The Dutch golden age painter Gerard de Lairesse hired two sisters as models in his home town of Liège, but did a runner in 1664 after locals discovered that he’d been having an affair with not one but both of them. And when there wasn’t sex, the studio might witness the crazed infatuation of an artist like the Austrian expressionist Oskar Kokoschka. He commissioned a lifesize doll modelled on his ex, Anna Mahler, and made more than 80 paintings, drawings and photographs of it in his workroom.</p><p>There could also be violence and death in the studio. The sculptor Bernini swung a crowbar at his brother Luigi in their workplace at St Peter’s, Rome, cracking several ribs, after discovering that Luigi was sleeping with his mistress. The early art historian Vasari wrote of Michelangelo, “He was constantly flaying dead bodies, in order to study the secrets of anatomy.” He got through at least 30 cadavers.</p> <a href=\"https://www.theguardian.com/books/2022/dec/28/the-artists-studio-by-james-hall-review-lust-and-creativity\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/tv-and-radio/2022/dec/28/theres-a-reason-for-everything-even-the-goats-adam-scott-on-the-eerie-genius-of-severance", "title": "‘There’s a reason for everything – even the goats’: Adam Scott on the eerie genius of Severance", "date_published": "2022-12-28 11:00:49+00:00", "description": "<p>With Mark, the micro-chipped office drone, the star has said put ‘befuddled beta males’ behind him. He reveals why shooting during Covid fed the show’s strangeness – but still can’t explain the goats</p><p>If you’re looking for an everyman, Adam Scott’s the brand leader – although you may have to look hard. He tends to blend with the scenery. At the age of 49, he’s been an actor for decades, serving as a wired, anxious mainstay on shows such as Parks and Recreation and Big Little Lies. But he likes to recall how he made his first screen appearance as an extra in the video for the REM song Drive, then spent the next 25 years <a href=\"https://twitter.com/mradamscott/status/992454434507579392?lang=en\" title=\"\">trying to locate his face in the crowd</a>. The man’s a hidden treasure; sometimes even hidden from himself.</p><p>“I started out doing background work in the early 90s,” he says, as if this explains everything. “After that, I got little two-line jobs on ER, Boy Meets World, stuff like that. But I still have the brain of the person I was. I’m still carrying the same self-doubt, the same sense of rabid insecurity.”</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/28/theres-a-reason-for-everything-even-the-goats-adam-scott-on-the-eerie-genius-of-severance\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/28/200-vehicles-collide-in-fog-china-bridge-zhengzhou", "title": "One person killed as 200 vehicles collide in fog on Chinese bridge", "date_published": "2022-12-28 10:59:49+00:00", "description": "<p>Many people trapped in vehicles after pile-up on Zhengxin Huanghe Bridge in Zhengzhou</p><p>One person was killed on Wednesday when more than 200 vehicles were involved in a pile-up on a bridge in the Chinese city of Zhengzhou in heavy fog, rescuers and the CCTV state broadcaster reported.</p><p>Cars and trucks could been seen crumpled and piled on top of each other on the Zhengxin Huanghe Bridge in pictures and videos posted on social media. One car was jack-knifed in the middle of a pile in a picture taken from CCTV footage.</p> <a href=\"https://www.theguardian.com/world/2022/dec/28/200-vehicles-collide-in-fog-china-bridge-zhengzhou\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/28/top-conservation-issues-watch-out-for-2023-wetland-fertiliser-amphibians", "title": "Top conservation issues to watch out for in 2023", "date_published": "2022-12-28 10:52:17+00:00", "description": "<p>Wetland protection, fertiliser and ailing amphibians among issues likely to have global impact</p><p>What should people who care about conservation be paying attention to? Each year since 2009 scientists and conservationists from around the world have come together under the direction of researchers from the University of Cambridge to answer that question. Their goal is to “provide novel information that society and decision-makers may wish to consider in legislation, planning and actions that contribute to environmental sustainability and mitigating threats.”</p><p>This year’s group came up with 15 top issues that fall into four main categories: resource use, disturbance of organisms and habitats, technological innovations, and policy and law. Nearly half of the topics that bubbled to the top have a connection to the climate crisis.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/28/top-conservation-issues-watch-out-for-2023-wetland-fertiliser-amphibians\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/society/2022/dec/28/four-in-10-junior-doctors-plan-quit-nhs-survey", "title": "Four in 10 junior doctors plan to quit NHS as soon as they can, survey finds", "date_published": "2022-12-28 10:13:03+00:00", "description": "<p>Poor pay and working conditions are main reasons for wanting to find other work, says BMA</p><p>Four in 10 junior doctors are actively planning to quit the NHS as soon as they can find another job, according to a survey by the British Medical Association.</p><p>The survey, released as part of the BMA chair of council Prof Philip Banfield’s new year message, found poor pay and working conditions were among the main reasons for junior doctors wanting to leave.</p> <a href=\"https://www.theguardian.com/society/2022/dec/28/four-in-10-junior-doctors-plan-quit-nhs-survey\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/28/the-mens-test-cricket-xi-of-the-year-from-labuschagne-to-pant", "title": "The Spin | The men’s Test cricket team of the year: from Labuschagne to Pant", "date_published": "2022-12-28 10:05:14+00:00", "description": "<p>Our special board of selectors announces the picks for the best men’s Test XI of the past 12 months</p><p><em>It’s time for </em><em>the Guardian’s ninth annual men’s Test team of the year. The </em><em>11 selectors were: Ali Martin, Vic Marks, Tim de Lisle, Rob Smyth, Tanya Aldred, Jonathan Liew, Barney Ronay, Taha Hashim, Geoff Lemon, Adam Collins</em><em> and Andy Bull. Everyone submitted their own XIs and the votes were tallied afterwards, so the blame for leaving out your favourite player can be spread around. Intriguingly, only one of them made <a href=\"https://www.theguardian.com/sport/2021/dec/29/the-men-test-cricket-team-of-the-year-from-williamson-to-sharma-spin.\">last year’s side</a></em></p> <a href=\"https://www.theguardian.com/sport/2022/dec/28/the-mens-test-cricket-xi-of-the-year-from-labuschagne-to-pant\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/28/jaguar-return-us-america-new-mexico-arizona-rewilding", "title": "The mission to return jaguars to the US: ‘We aren’t right without them’", "date_published": "2022-12-28 10:00:48+00:00", "description": "<p>The big cats once roamed North America but have been pushed near to extinction. Could they make a comeback?</p><p>Somewhere among the rocky pinnacles of southern Arizona’s Chiricahua mountains roams the last known jaguar in the US.</p><p>The dark-spotted big cat, a male known as “Sombra” to wildlife researchers, wanders between three mountain ranges, hunting for deer and piglike javelinas and, perhaps, searching for a mate.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/28/jaguar-return-us-america-new-mexico-arizona-rewilding\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/28/nfl-kickers-justin-tucker-interviews", "title": "‘The ball kicks itself’: inside the minds of NFL place-kickers", "date_published": "2022-12-28 10:00:48+00:00", "description": "<p>Does the ball really “kick itself”? Guardian US speaks to three veterans of football’s most uniquely pressured position to climb inside the mind of an NFL kicker</p><p>After kicking a game-winning field goal to help the Baltimore Ravens overcome the Cincinnati Bengals in Week 5 of the 2022 NFL season, Justin Tucker was asked whether he enjoys being called upon to make such high-stakes kicks.</p><p>“My feelings don’t matter,” Tucker said. “What matters is seeing the ball snapped with 12 o’clock laces from Nick Moore, seeing the ball spotted cleanly from Jordan Stout, his first first career game-winning hold, and then from there I’m just a system kicker. The ball kicks itself at that point.”</p> <a href=\"https://www.theguardian.com/sport/2022/dec/28/nfl-kickers-justin-tucker-interviews\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/28/women-toxic-online-dates-apps-facebook-groups-dating-platforms", "title": "Finally, women are calling out toxic online dates. Now to target the apps themselves | Nancy Jo Sales", "date_published": "2022-12-28 10:00:47+00:00", "description": "<p>Facebook groups are outing male misconduct. But shouldn’t dating platforms be doing much more to help protect users?</p><p>It had to happen. And now it has. Women are finally rising up against the pitfalls of dating app culture, and fighting back. Since March 2022, Are We Dating the Same Guy? Facebook groups have sprung up in almost every major American city, from New York to Little Rock, as a way for women to call out bad digital dating experiences.</p><p>What started as small-scale communities are now spreading internationally and have grown to include hundreds of thousands of members. “Boys, frickin’ buckle up,” one TikTok user said in July. “If you mistreat a girl, or are doing some sketchy stuff, the time is over, ‘cause you’re getting caught.”</p><p>Nancy Jo Sales is a writer at Vanity Fair and the author of American Girls: Social Media and the Secret Lives of Teenagers<br /></p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/28/women-toxic-online-dates-apps-facebook-groups-dating-platforms\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/28/benjamin-zephaniah-tell-people-i-dont-eat-animals-thing-ill-do-differently", "title": "‘I’ll stop saying I don’t eat meat – and tell people I don’t eat animals’: the thing I’ll do differently in 2023", "date_published": "2022-12-28 10:00:47+00:00", "description": "<p>I’ve been a vegan since I was a teenager – not for health or environmental reasons, but because animals are sentient beings. And I want to be honest about that</p><p>I don’t think I’ve ever made a new year resolution. But this year I’m going to stop telling people that I don’t eat meat. It’s not that I do eat meat – I don’t. The thing is, when I tell people that I don’t eat meat, I’m saying it to be polite. I use that form of words because I don’t want to offend people. So, from now on I’m going to be more honest. I’m just going to tell people that I don’t eat animals.</p><p>I was nine when I decided to stop eating animals. My twin sister and I were the only black children in school. I experienced racism in and out of the classroom, so in the playground I would often find myself sitting in a corner talking to the local cats. When the cats were away, I’d talk to the birds and the bees. Amazingly, I never met a racist animal. Some were nervous when they first approached me, some would make a few visits before they got close, but it never took long for us to make a connection. Then we would just hang out together.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/28/benjamin-zephaniah-tell-people-i-dont-eat-animals-thing-ill-do-differently\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/business/live/2022/dec/28/uk-rail-strike-tssa-train-border-force-driving-instructors-business-live", "title": "Rail disruption continues as commuters return from Christmas break to fresh strikes – business live", "date_published": "2022-12-28 09:53:05+00:00", "description": "<p>TSSA staff at Great Western Railway and West Midlands Trains, Border Force workers and driving examiners strike</p><ul><li><a href=\"https://www.theguardian.com/uk-news/2022/dec/27/uk-rail-passengers-warned-of-severe-disruption-into-new-year\">UK rail passengers left stuck at stations in post-Christmas chaos</a></li></ul><p><strong>Passengers are steeling themselves for further travel disruption across the UK as rail and Border Force staff launch a fresh wave of strikes affecting thousands heading home after Christmas.</strong></p><p>Border Force staff at Britain’s largest airports, including those in passport control, resumed action over pay, jobs and working conditions on Wednesday. The 1,000 members of the Public and Commercial Services Union (PCS) are striking for four days until New Year’s Eve.</p><p>“easyJet strongly refutes these claims, adheres to relevant laws and regulations and will fully cooperate with the authorities to demonstrate it has always acted lawfully and competitively in the best interests of consumers.”</p> <a href=\"https://www.theguardian.com/business/live/2022/dec/28/uk-rail-strike-tssa-train-border-force-driving-instructors-business-live\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/books/2022/dec/28/a-writers-diary-by-toby-litt-review-birth-death-and-pencil-sharpenings", "title": "A Writer’s Diary by Toby Litt review – birth, death and pencil sharpenings", "date_published": "2022-12-28 09:00:47+00:00", "description": "<p>This stimulating genre-blurring account of a year in the life of a writer asks how we weigh and value our days</p><p>Toby Litt’s latest novel, originally <a href=\"https://substack.com/profile/49767854-toby-litt\" title=\"\">published online via Substack</a>, is a hugely readable achievement. Across nearly 400 pages, A Writer’s Diary charts the life of a man over the course of a year. Animated by the steady approach of two classic intersecting narrative themes, birth and death, the novel’s architecture is relatively conventional, as its protagonist, a writer named Toby Litt, navigates the emotional impact of these two life events.</p><p>Litt comes across as a writer who shies away from demonstrativeness; his approach to letting deep feeling land is defined by a Chekhovian taciturnity that doesn’t always emotionally engage the reader. However, his novel is not about these bedrock life events, not really, and the restraint with which he articulates them leaves space for a different exploration. At the level of narrative, the book documents a couple’s journey towards parenthood, a vulnerable process after three previous miscarriages, contrasted with the narrator’s slow loss of his mother to cancer. These simple, tectonic movements play out with a kind of tidal inevitability, but the surface of the book is preoccupied with something entirely different. Toby (the protagonist, rather than the author of the book) is given a diary by his partner for Christmas, and writes in it daily. Thus the novel chronicles the way huge life events are parsed out into days; their impact on a consciousness that remains quotidian, tied to routine, preoccupied with anxiety and pencil sharpening and work, even as it is swelled and rocked by life and death.</p> <a href=\"https://www.theguardian.com/books/2022/dec/28/a-writers-diary-by-toby-litt-review-birth-death-and-pencil-sharpenings\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/28/meme-negronis-olivia-cooke-emma-darcy", "title": "This year, of all years, we needed a delightfully pointless meme about negronis | Hannah Jane Parkinson", "date_published": "2022-12-28 09:00:46+00:00", "description": "<p>Who knew that a chat about drinks between actors Olivia Cooke and Emma D’Arcy could be so sexy and comforting?</p><ul><li>What was the image on your phone that defined 2022?<br /><a href=\"https://www.theguardian.com/commentisfree/series/snapshot-of-2022\">Writers give their perspectives</a></li></ul><p>“Negroni. Sbagliato … with prosecco in it.” Before October, it was an occasional order for the more discerning drinker. After October, it became one of the most Googled phrases in the world, the words stitched into caps and sweatshirts, the centrepiece of millions of social media views, calling card of LGBT people worldwide.</p><p>One of the greatest things about the internet is its ability to transform seemingly innocuous or quotidian happenings into sources of deep intrigue, scandal or hilarity. It is, along with the acquisition of legitimate knowledge, what the internet is good for. It’s what makes it worthwhile, just when you think the rightwing trolls and people who copy tweets word-for-word are winning.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/28/meme-negronis-olivia-cooke-emma-darcy\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/28/liliana-segre-senator-auschwitz-survivor-italy-far-right", "title": "‘It is a war’: senator and Auschwitz survivor Liliana Segre on fighting Italy’s far right", "date_published": "2022-12-28 08:37:17+00:00", "description": "<p>Liliana Segre, 92, has been subjected to racist attacks, and fears the Holocaust will become a footnote in the history books</p><p>An Italian senator who survived the Auschwitz concentration camp and this year found herself witnessing a far-right government take power again in Rome has said her “personal nightmare” is that the Holocaust will all but vanish from history books.</p><p>Liliana Segre, 92, was the only one of her relatives to survive the Holocaust, which killed six million Jews as part of Nazi Germany’s second world war campaign to obliterate the Jewish population in Europe.</p> <a href=\"https://www.theguardian.com/world/2022/dec/28/liliana-segre-senator-auschwitz-survivor-italy-far-right\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/28/war-ukraine-deadliest-conflict-tigray-ethiopia", "title": "Think the war in Ukraine is the world’s deadliest conflict? Think again | Magdalene Abraha", "date_published": "2022-12-28 08:00:46+00:00", "description": "<p>A brutal war in East Africa has claimed up to 600,000 lives. This Christmas, families like mine don’t even know if our loved ones are alive</p><p>A war is raging that has cost up to <a href=\"https://www.theguardian.com/commentisfree/2022/oct/23/the-guardian-view-on-the-worlds-forgotten-conflict-ethiopias-devastating-war\">600,000 lives</a>. Its victims have borne witness to shocking human rights abuses and, tragically, civilians have been deliberately targeted. Tens of thousands of women have been raped. It has lasted two years and is happening today, yet the chances are you don’t even know where it is. Though it is far deadlier than the war in Ukraine, the western media have mostly ignored it.</p><p>On 4 November 2020, when Ethiopia’s prime minister, Abiy Ahmed, a Nobel Peace prize winner, announced a <a href=\"https://www.theguardian.com/world/2020/nov/04/ethiopia-on-brink-as-pm-orders-military-response-to-attack\">military offensive</a> in the disputed territory of Tigray, it was difficult to imagine how catastrophic it would become. A population of more than 6 million people, under a government blockade, has been pushed towards mass starvation – with young children dying of acute malnutrition. Tigray has become a centre of weaponised rape and an internet blackout that has added to the psychological torture faced by victims, and by families such as mine desperate to hear from our loved ones.</p><p>Magdalene Abraha is a writer and publisher at Jacaranda Books</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/28/war-ukraine-deadliest-conflict-tigray-ethiopia\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/28/insects-20-quadrillion-ants-ecosystem-planet-aoe", "title": "Insects and us: a mind-blowing 20 quadrillion ants and what they mean for the planet", "date_published": "2022-12-28 08:00:45+00:00", "description": "<p>There are 2.5m of these tiny creatures for each human and they play a big role as ecosystem engineers, as well as providing insights on everything from the climate to ageing</p><ul><li><a href=\"https://www.theguardian.com/environment/2022/sep/20/researchers-estimate-there-are-20-quadrillion-ants-across-the-planet\">Ants can be better than pesticides for growing healthy crops, study finds</a></li><li><a href=\"https://www.theguardian.com/environment/series/biodiversity--what-happened-next-\">Read more in our series Biodiversity: what happened next?</a></li></ul><p>To most of us, they are small, uninteresting and sometimes annoying, but 2022 revealed just how ubiquitous ants are and how indispensable they are to the planet. Scientists revealed in September that <a href=\"https://www.theguardian.com/environment/2022/sep/20/researchers-estimate-there-are-20-quadrillion-ants-across-the-planet\">there are an estimated 20 quadrillion (or 20 million billion)</a> ants globally – that’s 2.5 million for every person on the planet.</p><p>More than <a href=\"https://www.theguardian.com/environment/2022/jul/31/kingdom-of-the-ant-northern-australia-boasts-more-than-5000-species\">12,000 known species of ant</a> live in all sorts of habitats, from the Arctic to the tropics and they represent one of the most diverse, abundant and specialist groups of animals on the planet. Leafcutter ants are fungus farmers, slave-making ants capture broods to increase their work force, while <a href=\"https://www.theguardian.com/environment/2020/jan/24/ants-run-secret-farms-on-english-oak-trees-photographer-discovers#:~:text=In%20return%20for%20plentiful%20supplies,and%20the%20exoskeletons%20of%20beetles.\">wood ants herd aphids</a> to the juiciest parts of a plant to harvest their honeydew sap.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/28/insects-20-quadrillion-ants-ecosystem-planet-aoe\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/28/jesse-marsch-erling-haaland-leeds-manchester-city", "title": "Marsch fears Haaland’s return to birthplace may spell trouble for Leeds | Louise Taylor", "date_published": "2022-12-28 08:00:45+00:00", "description": "<p>Manchester City visit on Wednesday armed with a fearsome forward developed by the Leeds manager while at RB Salzburg</p><p>When Jesse Marsch moved into the manager’s office at Elland Road last March, two Norwegians were at the front of the queue to congratulate him.</p><p>Marsch has been close to Erling Haaland and his father, the former Leeds midfielder Alf-Inge, since he coached the former at RB Salzburg but, for once, the American is not exactly looking forward to their latest reunion on Wednesday night.</p> <a href=\"https://www.theguardian.com/football/2022/dec/28/jesse-marsch-erling-haaland-leeds-manchester-city\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/music/2022/dec/28/the-music-quiz-of-the-year-who-accused-beyonce-of-theft-and-which-90s-band-announced-plans-to-reform", "title": "The music quiz of the year! Who accused Beyoncé of ‘theft’ and which 90s band announced plans to reform?", "date_published": "2022-12-28 08:00:45+00:00", "description": "<p>From groundbreaking duets to the charts and Bob Dylan’s artwork. How closely were you listening in 2022? </p><p><br /></p> <a href=\"https://www.theguardian.com/music/2022/dec/28/the-music-quiz-of-the-year-who-accused-beyonce-of-theft-and-which-90s-band-announced-plans-to-reform\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/books/2022/dec/28/english-food-by-diane-purkiss-review-a-mouthwatering-history", "title": "English Food by Diane Purkiss review – a mouthwatering history", "date_published": "2022-12-28 07:30:44+00:00", "description": "<p>A sumptuous survey of English cuisine leaves no morsel untasted</p><p>As late as the <a href=\"https://www.theguardian.com/books/2022/jul/02/why-are-jane-austen-regency-dramas-still-popular-persuasion-netflix-bridgerton\">Regency period</a>, Diane Purkiss informs us, middle-class dining custom dictated that soup and salad, sweet and savoury, were all placed on the table at once. A typical course might consist of “curry of rabbit soup, open tart, syllabub, macaroni, pastry baskets, salmon trout, sole, vegetable pudding, muffin pudding, larded sweetbreads, raised giblet pie, a preserve of olives and a haunch of venison, and buttered lobster” all arranged around a centrepiece, such as the wonderfully named “bombarded veal”. Once everyone had taken what they wanted, these dishes would be removed and replaced by a different selection and then, in turn, by several desserts.</p><p>Readers of Purkiss’s new survey of English food, a weighty 560 pages packed with morsels of culinary history, may feel similarly bombarded with riches. Her day job is as a professor of English literature, and it shows – the book kicks off with a line from Virginia Woolf on the gender divide in Cambridge college catering and is liberally seasoned throughout with literary references, from Anglo-Saxon poetry to Michael Ondaatje.</p> <a href=\"https://www.theguardian.com/books/2022/dec/28/english-food-by-diane-purkiss-review-a-mouthwatering-history\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/global-development/2022/dec/28/why-diabetes-scourge-families-tanzania-acc", "title": "In the blood: why diabetes is the scourge of entire families in Tanzania", "date_published": "2022-12-28 07:30:44+00:00", "description": "<p>Elisaria has had diabetes for decades. Her husband  died of it and five relatives live with it. Yet millions in this fast-growing country cannot afford to get the treatment they need</p><p>Measuring her blood sugar level every morning is an ingrained, if not always welcome, part of Elisaria Matau’s daily routine.</p><p>The 70-year-old retired Tanzanian businesswoman from Dar es Salaam has been living with <a href=\"https://www.theguardian.com/society/2022/mar/29/type-2-diabetes-results-higher-risk-57-other-conditions-study\">type 2 diabetes</a> for decades. Her late husband, a soldier, died of complications from diabetes, and she is one of six in her extended family with the chronic illness.</p> <a href=\"https://www.theguardian.com/global-development/2022/dec/28/why-diabetes-scourge-families-tanzania-acc\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/politics/gallery/2022/dec/28/westminster-politics-2022-in-pictures", "title": "Westminster politics in 2022 – in pictures", "date_published": "2022-12-28 07:10:48+00:00", "description": "<p>Stefan Rousseau, PA Media’s chief political photographer, picks favourite moments from his coverage of a tumultuous year in politics</p><p></p><p></p> <a href=\"https://www.theguardian.com/politics/gallery/2022/dec/28/westminster-politics-2022-in-pictures\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/28/cricket-australia-defy-injuries-to-close-in-on-test-series-win-against-south-africa", "title": "Australia defy injuries at MCG to close in on Test series win against South Africa", "date_published": "2022-12-28 07:09:09+00:00", "description": "<ul><li>Alex Carey hits maiden Test century on day three</li><li>Rain ends play early with South Africa 15-1, trailing by 371</li></ul><p>Early on the third day of the Melbourne Test, despite their scorecard advantage, you wondered whether an Australian team that more resembled a medical ward could adequately function in the match. Instead, when they finally declared two sessions later, two batters with busted hands were the ones in the middle landing the punches. Moving to 575 for eight, Cameron Green ignored his fractured finger to face 171 balls for an unbeaten 51, while the blow Mitchell Starc’s finger took while fielding didn’t stop him carting a six in his 10 not out. Alex Carey had notched his first Test century to help build the lead to 386 runs, and South African captain Dean Elgar was caught behind for a duck before rain ended play at 15 for one.</p><p>The day had started in a rush for the visitors, already 197 runs behind but soon with hopes of limiting the damage after Anrich Nortje’s opening burst. First he smashed through Travis Head on 51, jagging the ball off the seam to hit Head’s back pad and deflect onto his stumps. David Warner returned, restored by a night’s rest after retiring with severe cramps on reaching 200 the evening before. He departed just as quickly, a Nortje yorker swinging into his ankle and again onto the stumps.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/28/cricket-australia-defy-injuries-to-close-in-on-test-series-win-against-south-africa\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/28/ocean-middle-light-mesophotic-zone-rebreathers-scientists-explore", "title": "‘The closest humans come to being a fish’: how scuba is pushing new limits", "date_published": "2022-12-28 07:00:45+00:00", "description": "<p>Scientists have begun to explore the ocean’s ‘middle light’ – the mesophotic zone, a lesser-known part of our seas – with new rebreathers</p><p>In between the sunlit shallows and the dark, deep ocean lies an inky realm where few people have ever been. Stretching from about 30 to 150 metres, the mesophotic zone (meaning “middle light”) is an awkward depth. It lies just beyond the reach of regular scuba divers and it’s usually what aquanauts inside multimillion-dollar submersibles merely glimpse as they plunge deeper.</p><p>However, a new generation of scientists is pushing the limits of diving to discover the secrets of this ecological zone. “There’s so much to see, and everything seems new,” says Erika Gress from James Cook University in Queensland, Australia. “It’s like a different world.”</p> <a href=\"https://www.theguardian.com/environment/2022/dec/28/ocean-middle-light-mesophotic-zone-rebreathers-scientists-explore\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/28/are-you-bored-yet-five-art-shows-to-be-dazzled-by-over-the-christmas-season", "title": "Are you bored yet? Five art shows to be dazzled by over the Christmas season", "date_published": "2022-12-28 07:00:44+00:00", "description": "<p>From Lucian Freud to Turner and the mysteries of ancient Egypt, here are some of the best exhibitions across the country right now</p><p>Midwinter is one of the best times to see good, rewarding art. Here are five shows worth getting off the sofa and putting on your woollies for.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/28/are-you-bored-yet-five-art-shows-to-be-dazzled-by-over-the-christmas-season\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/travel/2022/dec/28/spain-tops-worlds-best-tourist-villages-ranking-with-three-awards", "title": "Spain tops world’s best tourist villages ranking with three awards", "date_published": "2022-12-28 07:00:44+00:00", "description": "<p>UN World Tourism Organization’s list of 32 best places worldwide for small community tourism also includes villages in China, Morocco and Ecuador</p><p>Three remote Spanish communities have been named as among the best villages in the world for tourists – the most entries for a single country.</p><p>The United Nations World Tourism Organization (UNWTO) recently revealed its annual list of the best tourism villages across the globe, with those included in the list scoring highly on social and environmental sustainability as well as their tourism work.</p><p>Zell am See, Austria</p><p>Wagrain, Austria</p><p>Puqueldón, Chile</p><p>Dazhai, China</p><p>Jingzhu, China</p><p>Choachí, Colombia</p><p>Aguarico, Ecuador</p><p>Angochagua, Ecuador</p><p>Mulu Ecovillage, Ethiopia</p><p>Mestia, Georgia</p><p>Kfar Kama, Israel</p><p>Sauris-Zahre, Italy</p><p>Isola del Giglio, Italy</p><p>Umm Qais, Jordan</p><p>Creel, Mexico</p><p>El Fuerte, Mexico</p><p>Ksar Elkhorbat, Morocco</p><p>Moulay Bouzerktoune, Morocco</p><p>Lamas, Peru</p><p>Raqchi, Peru</p><p>Castelo Novo, Portugal</p><p>Pyeongsa-ri, South Korea</p><p>Rasinari, Romania</p><p>Al’Ula Old Town, Saudi Arabia</p><p>Bohinj, Slovenia</p><p>Rupit, Spain</p><p>Alquézar, Spain</p><p>Guadalupe, Spain</p><p>Murten, Switzerland</p><p>Andermatt, Switzerland</p><p>Birgi, Türkiye</p><p>Thái Hải, Vietnam</p> <a href=\"https://www.theguardian.com/travel/2022/dec/28/spain-tops-worlds-best-tourist-villages-ranking-with-three-awards\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/28/rishi-sunak-boris-johnson-liz-truss-britain-labour", "title": "Sunak isn’t Johnson or Truss, but does anyone know who he is – or what he wants for Britain? | Henry Hill", "date_published": "2022-12-28 07:00:44+00:00", "description": "<p>After a manic year, the PM has given his party stability. But he’ll need to do more to resist Labour and reassure his panicky MPs</p><p>On Christmas Day, Rishi Sunak marked his 62nd day as prime minister, far surpassing Liz Truss’s time in office. A trifling achievement, by any measure. But after the <em>annus horribilis</em> that was 2022, the Conservatives are not really in a position to turn their noses up at small victories.</p><p>And the prime minister will, broadly, have achieved what he set out to do when Tory MPs finally crowned him in October: <a href=\"https://www.theguardian.com/politics/2022/dec/02/were-really-boring-right-now-tories-fret-over-flipside-of-sunak-stability\">steadied the ship</a>. Westminster politics seems stable, even boring; the markets are no longer running riot; even the polls are <a href=\"https://www.theguardian.com/politics/2022/oct/30/sunak-tories-labour-repair-economy-voters-new-poll\">starting to narrow</a>, if you squint at them.</p><p>Henry Hill is deputy editor of ConservativeHome</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/28/rishi-sunak-boris-johnson-liz-truss-britain-labour\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/28/lethal-injection-surviving-execution-attempt-alabama", "title": "What is it like to survive an execution by lethal injection?", "date_published": "2022-12-28 07:00:44+00:00", "description": "<p>Alabama’s corrections department has bungled the procedure on three reent occasions, with IV teams failing on hours at end, adding immense distress to a difficult situation</p><ul><li>This article contains descriptions of physical harm</li></ul><p>On three occasions in the past four months, Alabama’s department of corrections has bungled its lethal injections procedure.</p><p>At 7.57pm on 17 November, prison guards entered the “death cell” at Holman correctional facility in Atmore, south Alabama, where Kenneth Smith was awaiting execution by lethal injection for the 1988 murder-for-hire of a preacher’s wife.</p> <a href=\"https://www.theguardian.com/world/2022/dec/28/lethal-injection-surviving-execution-attempt-alabama\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/film/2022/dec/28/the-best-movies-of-2022-you-may-not-have-seen", "title": "The best movies of 2022 … you may not have seen", "date_published": "2022-12-28 06:34:43+00:00", "description": "<p>From a sharp comedy reboot to an erotic political thriller, Guardian writers pick the hidden films of the year that people should know more about</p><p><a href=\"https://www.theguardian.com/film/2022/jul/20/you-are-not-being-heard-the-devastating-black-maternal-mortality-crisis-in-the-us\">Aftershock</a> takes a sprawling, urgent, widely publicized yet still under-addressed national crisis – the shameful maternal mortality rate among Black women in the US – and grounds it in its more personal and galling form. The film, directed by Tonya Lewis Lee and Paula Eiselt, examines the roots and manifestations of dire statistics through the advocacy journeys of two grieving families. Two Black mothers whose concerns were downplayed or dismissed, who died in New York hospitals months apart, who would be caring for their children if not for an extremely preventable combination of medical racism, financial pressure to perform C-sections and inadequate senses of urgency. I was crying within three minutes. The film, available to stream on Hulu, should be essential viewing as a window into the many factors underlying such devastating disparities, but also as a path forward. It shows what woman-centered, choice-driven maternal healthcare could look like in the US, and the families fighting for it after the unimaginable. <em>Adrian Horton</em></p> <a href=\"https://www.theguardian.com/film/2022/dec/28/the-best-movies-of-2022-you-may-not-have-seen\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/28/chinas-move-to-open-up-travel-sparks-concern-over-spread-of-new-covid-variants", "title": "China’s move to open up travel sparks concern over spread of new Covid variants", "date_published": "2022-12-28 06:15:48+00:00", "description": "<p>Experts say a lack of data makes it difficult to assess the risk of potential new Covid strains with travel to the long sealed-off country set to resume</p><p>As China abruptly dropped some of its toughest Covid-19 restrictions – including scrapping quarantine rules for travellers – virologists are watching nervously to see how this may impact Covid-19 variants and their global spread, with some countries already ramping up precautionary measures.</p><p>The decision on Monday to <a href=\"https://www.theguardian.com/world/2022/dec/26/china-starts-to-drop-quarantine-requirement-for-overseas-passengers\">drop quarantine for overseas visitors from 8 January</a> has prompted concerns about the potential for new variants beyond China’s borders. Japan and India are among the countries that have introduced measures to prevent an influx of cases.</p> <a href=\"https://www.theguardian.com/world/2022/dec/28/chinas-move-to-open-up-travel-sparks-concern-over-spread-of-new-covid-variants\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/science/2022/dec/28/terrawatch-the-rise-and-bigger-rise-of-mediterranean-sea-levels", "title": "Terrawatch: the rise and bigger rise of Mediterranean sea levels", "date_published": "2022-12-28 06:00:45+00:00", "description": "<p>Study shows sea level rise on Amalfi coast over last 20 years is twice that on Costa del Sol</p><p>Over the last 20 years, there has been twice as much sea level rise on Italy’s Amalfi coast as on Spain’s Costa del Sol, a study shows.</p><p>Researchers combined data from tide gauges and satellites with ice melt measurements to model sea level change across the Mediterranean basin since 1960. To their surprise, they found that sea level fell by about 9mm between 1960 and 1989, owing to increased atmospheric pressure over the basin. </p> <a href=\"https://www.theguardian.com/science/2022/dec/28/terrawatch-the-rise-and-bigger-rise-of-mediterranean-sea-levels\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/tv-and-radio/2022/dec/28/the-35-must-see-tv-shows-to-look-forward-to-in-2023", "title": "The 35 must-see TV shows to look forward to in 2023", "date_published": "2022-12-28 06:00:44+00:00", "description": "<p>A hardy period drama from Shane Meadows, a Frasier reboot and the fourth series of Succession – here’s a rundown of all the new year’s unmissable telly</p><ul><li><a href=\"https://viewer.gutools.co.uk/culture/series/2023-culture-preview\">More from the 2023 culture preview</a></li><li><a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/02/the-50-best-tv-shows-of-2022\">The best TV of 2022</a></li></ul><p>Donald Glover’s thrillingly experimental and always groundbreaking show bows out on a high with perhaps the most trippy adventures for Earn and the gang. As usual, there are standalone episodes – a standout being a mockumentary about an animator who accidentally takes over Disney and wants to make “the Blackest movie of all time”. But Earn, Van, Al and Darius are back in Atlanta for this final season, being stalked and shot at when they’re just trying to eat some Popeyes chicken, or go for a session in a sensory deprivation tank. Will it all end up being a dream?<br />• Disney+, out now</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/28/the-35-must-see-tv-shows-to-look-forward-to-in-2023\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/28/uk-wildlife-devastated-by-litany-of-weather-extremes-in-2022", "title": "UK wildlife ‘devastated by litany of weather extremes’ in 2022", "date_published": "2022-12-28 06:00:44+00:00", "description": "<p>National Trust’s annual audit reveals a dire year for animals from toads and bats to birds and butterflies</p><p>This year’s tumultuous weather – including fierce storms, searing heat, deep cold snaps – has devastated some of the UK’s most precious flora and fauna, a leading conservation charity has said.</p><p>The extreme conditions have made survival very difficult for animals from toads and bats to birds and butterflies, and from great trees to meadowland flowers.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/28/uk-wildlife-devastated-by-litany-of-weather-extremes-in-2022\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/28/how-amanda-abbington-met-jonathan-goodwin-i-was-on-him-like-a-rat-up-a-drainpipe", "title": "How Amanda Abbington met Jonathan Goodwin: ‘I was on him like a rat up a drainpipe’", "date_published": "2022-12-28 06:00:43+00:00", "description": "<p>Actor Abbington, 48, and stunt performer Goodwin, 42, met through social media and became engaged on their first date in Vienna. They live together in Hertfordshire</p><p>Actor Amanda Abbington and stunt performer Jonathan Goodwin first connected on Twitter in 2012. “We were both in relationships at the time, but we admired each other’s work and occasionally liked each other’s tweets,” says Amanda. Years later, when they were both single, their messages to each other became gradually more flirty. But it wasn’t until August 2021 that they discovered a deeper bond between them.</p><p>“I was living in Las Vegas at the time and we started talking about past relationships,” says Jonathan. They instantly felt connected by the challenges they had experienced in their personal lives and decided to swap numbers. “I was on him like a rat up a drainpipe. I had fancied him for a few years,” laughs Amanda.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/28/how-amanda-abbington-met-jonathan-goodwin-i-was-on-him-like-a-rat-up-a-drainpipe\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/28/uk-government-imprisoned-abroad-brothers-overseas", "title": "Our loved ones are imprisoned abroad. Why won’t the UK government help? | Gurpreet Singh Johal and Sanaa Seif", "date_published": "2022-12-28 06:00:43+00:00", "description": "<p>Our brothers have spent another Christmas unjustly detained overseas – abandoned by those who should protect them</p><p>In March, after six years in captivity in Iran, the British-Iranian dual national Nazanin Zaghari-Ratcliffe flew home to be reunited with her family. The photographs of her hugging her husband, Richard, and their daughter, Gabriella, moved me to tears. I have long shared their anger at the UK government’s failure to protect its citizens imprisoned overseas. But, in that moment, I was able to share their joy, too.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/28/uk-government-imprisoned-abroad-brothers-overseas\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/28/the-best-photographs-of-2022-and-the-stories-behind-them", "title": "The best photographs of 2022 – and the stories behind them", "date_published": "2022-12-28 06:00:43+00:00", "description": "<p>In a year dominated by the war in Ukraine, the plight of migrants and the climate crisis, photographers recall how they captured 20 outstanding images</p><p>Lynsey Addario</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/28/the-best-photographs-of-2022-and-the-stories-behind-them\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/business/2022/dec/28/we-cant-wait-for-hydrogen-rolls-royce-warren-east-on-the-engine-makers-future", "title": "‘We can’t wait for hydrogen’: Rolls-Royce’s Warren East on the engine maker’s future", "date_published": "2022-12-28 06:00:42+00:00", "description": "<p>Outgoing CEO looks back on his seven years at helm and how sustainable aviation fuel can power the journey to net zero</p><p>Warren East says it has been a “privilege” to lead Rolls-Royce for seven years, as he prepares to retire on New Year’s Eve. But it has also involved considerable pain.</p><p>East’s battles have ranged from a <a href=\"https://www.theguardian.com/business/2017/jan/16/rolls-royce-to-pay-671m-over-bribery-claims\">£671m settlement for a giant bribery and corruption scandal</a> from before his time, to the discovery of <a href=\"https://www.theguardian.com/business/2018/aug/02/rolls-royce-jet-engine-problems-prompt-13bn-loss\">costly cracks in its jet engines</a>. Then Covid-19 struck, grounding the aeroplanes whose engines Rolls-Royce builds and services.</p> <a href=\"https://www.theguardian.com/business/2022/dec/28/we-cant-wait-for-hydrogen-rolls-royce-warren-east-on-the-engine-makers-future\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/live/2022/dec/28/russia-ukraine-war-live-number-of-civilians-killed-considerably-higher-than-6884-known-says-un", "title": "Russia-Ukraine war live: number of civilians killed ‘considerably higher’ than 6,884 known, says UN", "date_published": "2022-12-28 05:51:17+00:00", "description": "<p>Casualties include 429 children, says UN High Commissioner for Human Rights; Russia responds to oil price cap</p><ul><li><a href=\"https://www.theguardian.com/world/series/russia-ukraine-war-at-a-glance\">Russia-Ukraine war at a glance</a></li></ul><p>More on Russia’s response to the oil price cap, via Reuters:</p><p>Under the cap, oil traders who want to retain access to Western financing for such crucial aspects of global shipping as insurance must promise not to pay above $60 per barrel for Russian seaborne oil.</p> <a href=\"https://www.theguardian.com/world/live/2022/dec/28/russia-ukraine-war-live-number-of-civilians-killed-considerably-higher-than-6884-known-says-un\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/28/luka-doncic-triple-double-mavericks-knicks", "title": "Mavericks’ Luka Doncic makes history with 60-21-10 triple-double in OT win", "date_published": "2022-12-28 05:22:17+00:00", "description": "<ul><li>Doncic has 60-21-10 triple-double to rally Mavs to OT win</li><li>Dallas star records first 60-point game in franchise history</li></ul><p>Luka Doncic had a franchise-record 60 points, 21 rebounds and 10 assists in a historic triple-double, including the <a href=\"https://twitter.com/NBA/status/1607950883312001027?s=20&amp;t=dQDB5jAu1UNu9ps8OmTnLQ\">tying basket off his intentionally missed free throw</a> to force overtime as the Dallas Mavericks rallied for a wild 126-121 victory over the New York Knicks on Tuesday night.</p><p>Dallas was down nine with 33 seconds left in regulation before getting even in a back-and-forth sequence capped by Doncic missing a free throw on purpose, ending up with the loose ball on the rebound and hitting a jumper for a 115-115 tie with 1.0 seconds remaining.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/28/luka-doncic-triple-double-mavericks-knicks\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/28/china-hospitals-extremely-busy-amid-surging-wave-of-covid-infections", "title": "China hospitals ‘extremely busy’ amid surging wave of Covid infections", "date_published": "2022-12-28 04:08:14+00:00", "description": "<p>Health workers report huge jump in mostly elderly Covid patients as China adjusts to living largely without virus restrictions</p><p>Chinese hospitals were under intense pressure as a surging wave of Covid-19 infections strained resources in the last major country to move towards treating the virus as endemic.</p><p>In an abrupt change of policy, China <a href=\"https://www.theguardian.com/world/2022/dec/04/fears-of-deadly-infection-surge-as-china-abandons-zero-covid-policy\">earlier this month began dismantling</a> the world’s strictest Covid regime of lockdowns and extensive testing, putting its battered economy on course for a complete re-opening next year.</p> <a href=\"https://www.theguardian.com/world/2022/dec/28/china-hospitals-extremely-busy-amid-surging-wave-of-covid-infections\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/28/australia-urged-to-fight-any-russian-bid-to-join-asian-football-confederation", "title": "Australia urged to fight any Russian bid to join Asian Football Confederation", "date_published": "2022-12-28 03:50:13+00:00", "description": "<ul><li>Russia has been banned by Uefa and Fifa since Ukraine invasion</li><li>Move to Asia could allow it to rejoin international competition</li></ul><p>Human rights campaigners have urged Australia to help block any Russian bid to return to international football by joining the Asian Football Confederation (AFC).</p><p>Russia was<a href=\"https://www.theguardian.com/football/2022/feb/28/fifa-and-uefa-suspend-russian-clubs-and-teams-from-world-cup-and-all-competitions\"> banned by the European governing body, Uefa, and Fifa earlier this year </a>after the invasion of Ukraine and as a result disqualified from the play-off stage to make the Qatar World Cup.</p> <a href=\"https://www.theguardian.com/football/2022/dec/28/australia-urged-to-fight-any-russian-bid-to-join-asian-football-confederation\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/28/nick-kyrgios-stuns-united-cup-teammates-by-withdrawing-at-11th-hour", "title": "Nick Kyrgios stuns United Cup teammates by withdrawing at 11th hour", "date_published": "2022-12-28 03:33:37+00:00", "description": "<ul><li>Wimbledon finalist pulls out one day before opening match</li><li>Australian team hear news 10 minutes before press conference</li></ul><p>Nick Kyrgios has pulled out of the inaugural United Cup teams event a day before his scheduled opening match, seeking to overcome injury ahead of the Australian Open.</p><p>World No 22 Kyrgios was expected to spearhead the Australian team, facing Great Britain’s Cameron Norrie in Sydney on Thursday night, but withdrew from the mixed-gender tournament just before Wednesday’s scheduled press conference.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/28/nick-kyrgios-stuns-united-cup-teammates-by-withdrawing-at-11th-hour\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/28/philippines-searches-for-survivors-after-dozens-killed-in-floods-and-landslides", "title": "Philippines searches for survivors after dozens killed in floods and landslides", "date_published": "2022-12-28 03:18:32+00:00", "description": "<p>Rain-induced floods and landslides unlike previous disasters in the country, which are typically triggered by severe typhoons</p><p>Rescue teams across nine provinces in the Philippines raced to try to locate 26 people missing after weekend rains, floods and landslides that have killed at least 25 people, in one of its deadliest weather events this year.</p><p>The national disaster agency on Wednesday said casualties reported so far had increased to 25 from 17 the previous day, with most deaths caused by drowning from flash floods.</p> <a href=\"https://www.theguardian.com/world/2022/dec/28/philippines-searches-for-survivors-after-dozens-killed-in-floods-and-landslides\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/news/audio/2022/dec/28/can-i-tell-you-a-secret-episode-three-the-man-upstairs-podcast", "title": "Can I tell you a secret? Episode three: the man upstairs – podcast", "date_published": "2022-12-28 03:00:39+00:00", "description": "<p>Revisited: who is Matthew Hardy? Journalist Sirin Kale looks for clues about what motivates this cyberstalker to create chaos and fear in so many people’s lives</p><p><em>This week we are revisiting the Can I tell you a secret? series. This episode was first broadcast on 23 September 2022.</em></p><p>In this seven-episode podcast, Guardian journalist <strong>Sirin Kale</strong> investigates the story of Matthew Hardy, a cyberstalker who terrified people in his home town and beyond for more than a decade.</p> <a href=\"https://www.theguardian.com/news/audio/2022/dec/28/can-i-tell-you-a-secret-episode-three-the-man-upstairs-podcast\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/28/novak-djokovic-lands-in-australia-quietly-12-months-after-deportation", "title": "Novak Djokovic lands in Australia quietly 12 months after deportation", "date_published": "2022-12-28 02:15:20+00:00", "description": "<ul><li>Former world No 1 slips under radar on arrival to Adelaide</li><li>Due to play Adelaide International beginning on Sunday</li></ul><p>Novak Djokovic has arrived in Australia, nearly a year after he was deported from the country, ahead of his bid for a 10th men’s singles title at next month’s Australian Open.</p><p>The 35-year-old was deported on the eve of this year’s tournament in Melbourne after he arrived in the country without being vaccinated against Covid-19.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/28/novak-djokovic-lands-in-australia-quietly-12-months-after-deportation\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/28/security-council-tells-taliban-to-reverse-restrictions-on-women-in-afghanistan", "title": "Security council tells Taliban to reverse restrictions on women in Afghanistan", "date_published": "2022-12-28 02:01:16+00:00", "description": "<p>UN body ‘deeply alarmed’ by women and girls being kicked out of high schools, universities, NGO jobs and government positions</p><p>The UN security council has called on the Taliban to reverse policies targeting women and girls in Afghanistan, expressing alarm at the “increasing erosion” of human rights.</p><p>The hardline Islamist rulers <a href=\"https://www.theguardian.com/world/2022/dec/24/taliban-stop-women-from-working-for-aid-organisations\">banned women from working in non-governmental organisations</a> on Saturday, in the latest blow to women’s rights in Afghanistan since the Taliban returned to power in 2021.</p> <a href=\"https://www.theguardian.com/world/2022/dec/28/security-council-tells-taliban-to-reverse-restrictions-on-women-in-afghanistan\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/28/dozens-of-iran-protesters-facing-charges-punishable-by-death-rights-group", "title": "Dozens of Iran protesters facing charges punishable by death – rights group", "date_published": "2022-12-28 00:52:00+00:00", "description": "<p>At least 100 detainees identified by Oslo-based Iran Human Rights face capital punishment, including at least 11 already sentenced to death</p><p>At least 100 Iranians arrested over more than 100 days of nationwide protests face charges punishable by death, Oslo-based group Iran Human Rights (IHR) has said.</p><p>Protests have gripped Iran since September after an Iranian-Kurdish woman, Mahsa Amini, died in custody following her arrest in Tehran for an alleged breach of the country’s strict dress code for women.</p> <a href=\"https://www.theguardian.com/world/2022/dec/28/dozens-of-iran-protesters-facing-charges-punishable-by-death-rights-group\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/28/russia-ukraine-war-at-a-glance-what-we-know-on-day-308-of-the-invasion", "title": "Russia-Ukraine war at a glance: what we know on day 308 of the invasion", "date_published": "2022-12-28 00:03:25+00:00", "description": "<p>Putin bans supply of oil to countries participating in price cap; heavy fighting continues in southern and eastern Ukraine</p><ul><li><strong><a href=\"https://www.theguardian.com/world/ukraine\">See all our Ukraine war coverage</a></strong></li></ul> <a href=\"https://www.theguardian.com/world/2022/dec/28/russia-ukraine-war-at-a-glance-what-we-know-on-day-308-of-the-invasion\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/society/2022/dec/28/scientists-develop-blood-test-for-alzheimers-disease", "title": "Scientists develop blood test for Alzheimer’s disease", "date_published": "2022-12-28 00:01:35+00:00", "description": "<p>Scientists say test could replace a costly brain scan or painful lumbar puncture and enable earlier detection of disease</p><p>Scientists have developed a blood test to diagnose Alzheimer’s disease without the need for expensive brain imaging or a painful <a href=\"https://www.alzheimers.org.uk/research/take-part-research/lumbar-puncture#:~:text=Alzheimer%27s%20disease%20is%20characterised%20by,is%20affected%20by%20Alzheimer%27s%20disease.\">lumbar puncture</a>, where a sample of cerebrospinal fluid (CSF) is drawn from the lower back. If validated, the test could enable faster diagnosis of the disease, meaning therapies could be initiated earlier.</p><p>Alzheimer’s is the most common form of dementia, but diagnosis remains challenging – particularly during the earlier stages of the disease.</p> <a href=\"https://www.theguardian.com/society/2022/dec/28/scientists-develop-blood-test-for-alzheimers-disease\">Continue reading...</a>", "persistent": false, "language": "en-US"}], "source": {"url": "https://www.theguardian.com/international/rss", "title": "The Guardian - International"}}