[{"source": "https://www.computerworld.com/index.rss", "title": "The top Chromebook tips of 2022", "description": "<article>\n\t<section class=\"page\">\n<p>More than any other platform, Google's <a href=\"https://www.computerworld.com/article/2893364/is-chrome-os-right-for-you.html\">ChromeOS</a> is in a constant state of evolution — and if you blink for a minute, you're bound to miss some promising new possibility or progression.</p><p>For those of us who rely on Chromebooks for work, that's fantastic. It means there's always something new to learn, uncover, and consider and always some intriguing new way to get stuff accomplished.</p><p>So behold: the most useful ChromeOS-related tips and tidbits from these Googley-scented quarters in recent months. Catch up while you can and make sure you're making the most of your work and/or personal technology for the coming year — and if you're still hungry for even more one-of-a-kind knowledge, <a href=\"https://www.androidintel.net\" rel=\"noopener nofollow\" target=\"_blank\"><strong>come check out my Android Intelligence newsletter</strong></a> next to get three bonus tips this second and gooey Googley goodness in your inbox all year round.</p><p class=\"jumpTag\"><a href=\"https://www.computerworld.com/article/3328830/chromebook-tips-2022.html#jump\">To read this article in full, please click here</a></p></section></article>", "link": "https://www.computerworld.com/article/3328830/chromebook-tips-2022.html#tk.rss_all", "date_published": "2022-12-28 11:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.computerworld.com/index.rss", "title": "US-China chip war puts global enterprises in the crosshairs", "description": "<article>\n\t<section class=\"page\">\n<p>As the US-China trade war escalates, with President Joe Biden's administration issuing sweeping restrictions on exports of chip technology, enterprises in different economic sectors worldwide are bound to get caught in the crossfire between the world’s two largest economies.</p><p>The new trade rules come at a time when the US is getting increasingly worried about China's growing geopolitical power, and will affect not only computer equipment, but many consumer products built on the restricted semiconductor technology. They also signal the end of the era of ever-expanding globalization.</p><p>Enterprises of all stripes will have to analyze their supply chains to determine how they may be affected, experts say.</p><p class=\"jumpTag\"><a href=\"https://www.computerworld.com/article/3683790/us-china-chip-war-puts-global-enterprises-in-the-crosshairs.html#jump\">To read this article in full, please click here</a></p></section></article>", "link": "https://www.computerworld.com/article/3683790/us-china-chip-war-puts-global-enterprises-in-the-crosshairs.html#tk.rss_all", "date_published": "2022-12-28 11:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]