{"entries": [{"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-28/holandia-czesc-turbiny-spadla-na-autostrade-droga-byla-zablokowana-na-wiele-godzin/", "title": "Holandia. Część turbiny spadła na autostradę. Droga była zablokowana na wiele godzin", "date_published": "2022-12-28 20:53:00+00:00", "description": "Fragment turbiny wiatrowej spadł na autostradzie A1 we wschodniej części Holandii. Na miejsce wypadku sprowadzono specjalistyczny sprzęt - podały lokalne media. Z powodu zdarzenia trasa została na wiele godzin zablokowana.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-28/rosja-general-anatolij-elizarow-trafil-do-szpitala-spadla-na-niego-bryla-lodu/", "title": "Rosja: Generał Anatolij Elizarow trafił do szpitała. Spadła na niego bryła lodu", "date_published": "2022-12-28 20:47:00+00:00", "description": "Rosyjski generał Anatolij Elizarow trafił do szpitala z poważnym urazem głowy. Gdy przechodził obok jednego z moskiewskich budynków, spadła na niego bryła lodu- informują rosyjskie media.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-28/atak-zimy-w-usa-zmarla-73-letnia-polka-ktora-byla-uwieziona-w-samochodzie/", "title": "Atak zimy w USA. Zmarła 73-letnia Polka, która była uwięziona w samochodzie", "date_published": "2022-12-28 20:06:00+00:00", "description": "73-letnia Polka została uwięziona w samochodzie przez śnieżycę, gdy pojechała do supermarketu po zakupy. Przez kilka godzin rodzina utrzymywała z nią kontakt telefoniczny - przekazały media. Mimo wielokrotnych prób odnalezienia kobiety, 73-latka zamarzła na śmierć.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-28/ukraina-oredzie-wolodymyra-zelenskiego-to-ukraina-zjednoczyla-unie-europejska/", "title": "Ukraina. Orędzie Wołodymyra Zełenskiego: To Ukraina zjednoczyła Unię Europejską", "date_published": "2022-12-28 17:41:00+00:00", "description": "Podczas ostatniego posiedzenia w tym roku ukraińskiego parlamentu prezydent Wołodymyr Zełenski wygłosił orędzie na temat stanu państwa. - Wielkość to siła ducha tych, którzy bronią swojego domu - przekazał. Dodał, że dzięki Ukraińcom świat przypomina sobie, co to znaczy być zwycięzcą. Przemówienie trwało 52 minuty, było 41 razy przerywane oklaskami.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-28/rosja-zolnierze-beda-mogli-zamrazac-nasienie-za-darmo/", "title": "Rosja: Żołnierze będą mogli zamrażać nasienie za darmo", "date_published": "2022-12-28 17:28:00+00:00", "description": "Według szefa Rosyjskiego Związku Prawników Igora Trunowa rosyjscy żołnierze powołani do walki w Ukrainie będą mieli możliwość bezpłatnego przechowywania zamrożonej spermy. W ciągu kilku dni od ogłoszenia częściowej mobilizacji w Sankt Petersburgu wzrosła liczba mężczyzn chcących zamrozić swoje nasienie.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-28/12-letni-zawodnik-futbolu-amerykanskiego-internauci-podejrzewaja-oszustwo/", "title": "12-letni zawodnik futbolu amerykańskiego. Internauci podejrzewają oszustwo", "date_published": "2022-12-28 12:12:00+00:00", "description": "W amerykańskich mediach trwa dyskusja na temat młodego zawodnika futbolu amerykańskiego. Według oficjalnych danych chłopak ma 12 lat. Nie wszyscy jednak dają temu wiarę. Uważają bowiem, że nastolatek wygląda jak dorosły mężczyzna.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-28/sauny-na-kolach-dla-zolnierzy-estonia-wspiera-ukraine/", "title": "Sauny na kołach dla żołnierzy. Estonia wspiera Ukrainę", "date_published": "2022-12-28 10:38:00+00:00", "description": "Chociaż w Estonii mieszka dwa razy mniej ludzi niż w Berlinie, to kraj ten wiedzie prym w Europie w kwestii wspierania Ukrainy. Tallin udziela Kijowowi pomocy militarnej, humanitarnej i dyplomatycznej. Teraz nadszedł czas na... sauny na kołach dla ukraińskich żołnierzy, które już dotarły na front.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-28/watykan-papiez-franciszek-prosi-o-modlitwe-za-benedykta-bardzo-chory/", "title": "Watykan. Papież Franciszek prosi o modlitwę za Benedykta. \"Bardzo chory\"", "date_published": "2022-12-28 09:31:00+00:00", "description": "Ojciec święty Franciszek powiedział do wiernych na zakończenie cotygodniowej audiencji generalnej w środę, że były papież Benedykt XVI jest bardzo chory i prosi o modlitwę za niego. Nie podał jednak żadnych innych szczegółów.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-28/usa-dzieci-przerazone-wizyta-grincha-zabawne-filmy-nagrywaja-rodzice/", "title": "USA: Dzieci przerażone wizytą Grincha. „Zabawne” filmy nagrywają rodzice", "date_published": "2022-12-28 06:49:00+00:00", "description": "Do mieszkania wpada zielony potwór i niszczy choinkę, zabiera prezenty, straszy małe dzieci. A wszystko to pod okiem rozbawionych sytuacją rodziców filmujących całe zdarzenie. Grinch opanował tiktokowe trendy, a zadowoleni dorośli umieszczają filmy z napadów w mediach społecznościowych i fundują swoim pociechom tygodnie koszmarnych snów.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-28/wojna-w-ukrainie-wiceminister-35-tys-obiektow-zniszczonych-od-poczatku-inwazji-702-krytyczne/", "title": "Wojna w Ukrainie. Wiceminister: 35 tys. obiektów zniszczonych od początku inwazji. 702 krytyczne", "date_published": "2022-12-28 05:26:00+00:00", "description": "Według brytyjskiego wywiadu ​​ataki na ukraińską infrastrukturę krytyczną, to najprawdopodobniej wynik realizacji przez Rosję koncepcji strategicznej operacji niszczenia celów strategicznych - podała Ukraińska Prawda. Wiceminister spraw wewnętrznych Ukrainy Jewhen Jenin podał, że od początku wojny ostrzały zniszczyły ponad 35 tys. obiektów, z czego 702 to infrastruktura krytyczna.", "persistent": false, "language": "pl-PL"}], "source": {"url": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Polsat News"}}