[{"source": "https://businessinsider.com.pl/.feed", "title": "Rezygnacja z polisy na życie — jak wypowiedzieć umowę ubezpieczenia?", "description": "Rezygnacja z polisy na życie ma miejsce zwykle wtedy, gdy dochodzi do pogorszenia sytuacji materialnej i płatnik składek poszukuje dodatkowych oszczędności. Chęć wypowiedzenia umowy ubezpieczenia może być umotywowana również znalezieniem produktu o lepszych warunkach, np. niższej składce i szerszym zakresie ochrony. Kiedy można zrezygnować z wykupionej polisy? Jak to zrobić? Jakie są konsekwencje zerwania porozumienia?", "link": "https://businessinsider.com.pl/poradnik-finansowy/ubezpieczenia/rezygnacja-z-polisy-na-zycie-wzor-terminy-konsekwencje-jak-wypowiedziec-polise/vz30myl", "date_published": "2022-12-28 22:14:48+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Co to jest Pflegegeld w Niemczech? Kto może z niego skorzystać?", "description": "Pflegegeld w Niemczech to pewnego rodzaju zasiłek pielęgnacyjny. Jego wysokość uzależniona jest od zakwalifikowania chorego do grupy pielęgnacyjnej. W 2022 r. wysokość Pflegegeld wynosiła od 316 do 901 euro. W Polsce nie ma odpowiednika tego typu formy pomocy. Na czym zatem polega niemiecki zasiłek?", "link": "https://businessinsider.com.pl/poradnik-finansowy/zasilki-w-niemczech-pflegegeld-w-niemczech-ile-wynosi-i-komu-przysluguje/ypctfxq", "date_published": "2022-12-28 21:25:46+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "PGE negocjuje dostawy węgla dla elektrowni. \"Nie mamy w swoich analizach wzrostu cen\"", "description": "Polska Grupa Energetyczna zamierza w przyszłym tygodniu zawrzeć porozumienie ustalające ceny węgla dla elektrowni kontrolowanych przez koncern. Poinformował o tym prezes spółki Wojciech Dąbrowski. Jak dodał, liczy na utrzymanie spadkowego trendu ceny.", "link": "https://businessinsider.com.pl/biznes/pge-negocjuje-dostawy-wegla-dla-elektrowni-nie-mamy-w-swoich-analizach-wzrostu-cen/zqrpx0h", "date_published": "2022-12-28 20:50:51+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Wraca wyższy VAT na paliwa. Co to oznacza dla cen? Prezes Orlenu odpowiada", "description": "Prezes Orlenu Daniel Obajtek przekonuje, że powrót do 23 proc. VAT na paliwa od 1 stycznia 2023 r. nie wpłynie znacząco na wzrost cen. — Będą kształtować się na poziomie podobnym do obecnego — mówi.", "link": "https://businessinsider.com.pl/twoje-pieniadze/wraca-wyzszy-vat-na-paliwa-co-to-oznacza-dla-cen-prezes-orlenu-odpowiada/9w7sdf8", "date_published": "2022-12-28 20:33:04+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kolejny kraj niezależny od rosyjskiego gazu. Wcześniej 100 proc. zapotrzebowania pochodziło ze wschodu", "description": "Do portu w Inkoo nad Zatoką Fińską dotarł w środę pływający gazoport. Import z morza ma zastąpić zakupy błękitnego paliwa od Rosji. Co więcej, fiński terminal umożliwia przesyłanie gazu m.in. do Polski.", "link": "https://businessinsider.com.pl/gospodarka/kolejny-kraj-niezalezny-od-rosyjskiego-gazu-wczesniej-100-proc-importu-pochodzilo-ze/fvcc2t6", "date_published": "2022-12-28 19:33:06+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Sankcje sięgają chmur. Rosyjskie linie lotnicze straciły miliony pasażerów", "description": "Rosyjskie linie lotnicze mogą pomarzyć o 100 mln pasażerów. Przez sankcje ruch zmniejszył się o kilkanaście procent. Wiele państw zamknęło dla rosyjskich samolotów swoją przestrzeń powietrzną oraz lotniska.", "link": "https://businessinsider.com.pl/biznes/sankcje-siegaja-chmur-rosyjskie-linie-stracily-miliony-pasazerow/t6yhk1b", "date_published": "2022-12-28 18:35:19+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Najdroższy szlak handlowy stał się jednym z tańszych. Ceny frachtu spadają", "description": "Ceny kontenerowego transportu morskiego ustabilizowały się i wracają do poziomu sprzed pandemii koronawirusa, o czym donosi \"Financieele Dagblad\". To jednak nie jest do końca dobra wiadomość. Spadek wynika bowiem ze spadku popytu będącego efektem pogarszającej się koniunktury.", "link": "https://businessinsider.com.pl/gospodarka/najdrozszy-szlak-handlowy-stal-sie-jednym-z-tanszych-ceny-frachtu-spadaja/x8sqj4g", "date_published": "2022-12-28 18:30:36+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Eksport rosyjskiego gazu do Europy spadł do najniższego poziomu od rozpadu ZSRR", "description": "Coraz mniej gazu płynie z Rosji do Europy. Eksport surowca zmniejszył się w rok o prawie połowę. Jest na poziomach niewidzianych od rozpadu Związku Socjalistycznych Republik Radzieckich. Z tego powodu Władimir Putin szuka innych rynków zbytu.", "link": "https://businessinsider.com.pl/gospodarka/jest-jak-w-rozpadajacym-sie-zsrr-fatalne-wyniki-eksportu-rosyjskiego-gazu/1vk4zr7", "date_published": "2022-12-28 18:05:37+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Sygnał GPS w Norwegii jest coraz częściej zakłócany. Media: to działanie Rosjan", "description": "Od inwazji Rosji na Ukrainę, która rozpoczęła się 24 lutego, nastąpił istotny wzrost liczby przypadków zagłuszania sygnału GPS na północy Norwegii, co utrudnia pracę pilotów — poinformował norweski Urząd ds. łączności (Nkom). Według mediów za zanikiem sygnału stoi Rosja.", "link": "https://businessinsider.com.pl/technologie/sygnal-gps-w-norwegii-jest-coraz-czesciej-zaklocany-media-to-dzialanie-rosjan/fgrfd86", "date_published": "2022-12-28 17:46:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "KNF podkręca wymogi dla banków. To może ułatwić uzyskanie hipoteki o stałym oprocentowaniu", "description": "Komisja Nadzoru Finansowego w większości banków podniosła nowe wymogi w zakresie dodatkowych narzutów kapitałowych. To wprawdzie \"miękkie\" zalecenie, a nie \"twardy\" wymóg, ale i tak będzie wpływało na banki, bo może zadecydować o tym, jaką wypłacą dywidendę. Teoretycznie powinien też skłonić banki do udzielania większej liczby hipotek ze stałym oprocentowaniem. Aby to osiągnąć, być może zdecydują się na oferowanie klientom atrakcyjniejszych warunków niż dotychczas.", "link": "https://businessinsider.com.pl/finanse/knf-podkreca-wymogi-dla-bankow-to-moze-ulatwic-uzyskanie-hipoteki-o-stalym/pld20t2", "date_published": "2022-12-28 17:32:36+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Uważaj na produkty z tego kraju. Jest liderem UE pod względem fałszowania żywności", "description": "Fałszowanie żywności czy ubrań jest dużym problemem w Unii Europejskiej. Niechlubne pierwsze miejsce w rankingu przypada Hiszpanii. Warto uważać na tamtejszy nabiał, oliwę i alkohol. Proceder może dotyczyć handlu wartego miliardów euro.", "link": "https://businessinsider.com.pl/wiadomosci/lubisz-hiszpanska-kuchnie-uwazaj-na-towary-z-tego-kraju/k2egdqz", "date_published": "2022-12-28 17:13:17+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Wysoka inflacja i niska dynamika PKB. Przyszły rok nie zapowiada się dobrze", "description": "Inflacja na pewno nie spadnie poniżej 13 proc., ale bezrobocie nie przekroczy 6 proc. Dynamika PKB bez uwolnienia środków z KPO sięgnie 1 proc. — to prognoza ekspertów Konfederacji Lewiatan na 2023 r.", "link": "https://businessinsider.com.pl/gospodarka/wysoka-inflacja-i-niska-dynamika-pkb-przyszly-rok-nie-zapowiada-sie-dobrze/d85dbrg", "date_published": "2022-12-28 16:53:18+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Stołeczny ratusz przyznaje, że tnie wydatki. Ogłosił decyzję w sprawie imprezy sylwestrowej", "description": "W tym roku władze Warszawy nic nie zaproponują mieszkańcom na sylwestra. To już staje się tradycją. Stołeczny ratusz przyznaje, że nie ma pieniędzy. Oprócz względów finansowych wspomina o wojnie w Ukrainie.", "link": "https://businessinsider.com.pl/wiadomosci/sylwester-w-warszawie-wladze-stolicy-zabraly-glos-w-sprawie-imprezy/g0rb6qg", "date_published": "2022-12-28 16:25:54+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Rządowy spór o KPO nabiera rumieńców. Ministrowie oskarżają się o kłamstwa", "description": "Publiczna dyskusja pomiędzy członkami rządu przybiera na sile. Ministrowie związani z PiS zarzucają swoim kolegom z Solidarnej Polski rozpowszechnianie nieprawdziwych informacji.", "link": "https://businessinsider.com.pl/gospodarka/rzadowy-spor-o-kpo-nabiera-rumiencow-ministrowie-oskarzaja-sie-o-klamstwa/7920em5", "date_published": "2022-12-28 15:58:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Przepytali agentów nieruchomości. Wyniki ankiety pokazują duży problem", "description": "Sytuacja na rynku nieruchomości w 2022 r. była trudna, a w kolejnych 12 miesiącach nie będzie łatwiejsza. Świadczy o tym ankieta przeprowadzona wśród agentów nieruchomości, którzy w kwestii cen czy popytu na mieszkania nie są jednomyślni.", "link": "https://businessinsider.com.pl/twoje-pieniadze/co-z-mieszkaniami-w-2023-roku-odpowiadaja-agenci-nieruchomosci/k8tfmfk", "date_published": "2022-12-28 15:51:22+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Zarobki a ceny mieszkań w Polsce na tle UE. \"Relatywnie komfortowa sytuacja dla młodych\"", "description": "Obniżki stóp procentowych oraz nowy rządowy program to czynniki, które będą wspierać dostępność mieszkań w 2023 r. — oceniają ekonomiści PKO BP. W najnowszym raporcie pokazują też, jak Polska wypada na tle UE pod względem dostępności mieszkań, mierzonej stosunkiem zarobków do cen nieruchomości.", "link": "https://businessinsider.com.pl/gospodarka/zarobki-a-ceny-mieszkan-polska-na-tle-ue-relatywnie-komfortowa-sytuacja-dla-mlodych/lhhg0e5", "date_published": "2022-12-28 15:26:41+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Ceny gazu spadły poniżej tych sprzed wojny. Z czego prąd jest teraz najtańszy?", "description": "W środę po raz pierwszy od 22 lutego br. cena megawatogodziny gazu dostarczanego do Europy spadła poniżej 80 euro za megawatogodzinę i co więcej, idzie dalej w dół. Wojenne ekstra zyski Putina na cenach węglowodorów pryskają jak bańka mydlana, bo i za ropę z Rosji płaci się niewiele ponad 50 dol. za baryłkę. Tanieje też węgiel. Policzyliśmy, co w tej sytuacji jest spalać najtaniej.", "link": "https://businessinsider.com.pl/gospodarka/wiesz-z-czego-najtaniej-produkuje-sie-prad-sprawdzilismy-to/qdbgwrk", "date_published": "2022-12-28 15:16:44+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Ośmiu najbogatszych Amerykanów straciło w tym roku prawie 400 mld dol. majątku", "description": "Fortuny Elona Muska, Jeffa Bezosa i sześciu innych najbogatszych Amerykanów skurczyły się w tym roku o prawie 400 mld dol., ponieważ rekordowa inflacja, rosnące stopy procentowe i narastające obawy przed recesją nadal wpływają na wartość ich akcji.", "link": "https://businessinsider.com.pl/gielda/wiadomosci/ciezki-los-miliarderow-stracili-w-tym-roku-gigantyczny-majatek/2vnv8x8", "date_published": "2022-12-28 14:32:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "VeloBank nie zapłaci podatku bankowego. Wiadomo, ile straci na tym budżet państwa", "description": "Resort finansów chce, by banki tworzone przez BFG w formie instytucji pomostowej, służącej do przeprowadzenia restrukturyzacji banku komercyjnego, były zwolnione z podatku bankowego. To przepis skrojony pod VeloBank, który powstał w miejsce Getin Noble Banku. Oszczędzi on rocznie około 120 mln zł.", "link": "https://businessinsider.com.pl/twoje-pieniadze/prawo-i-podatki/oni-nie-zaplaca-podatku-bankowego-budzet-straci-120-mln-zl/9sz8ccj", "date_published": "2022-12-28 14:10:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Chcesz zrobić przelew przed końcem roku? O tym warto pamiętać", "description": "Piątek 30 grudnia jest ostatnim dniem w tym roku na zrobienie standardowego przelewu — przypomina Krajowa Izba Rozliczeniowa. Do której godziny trzeba zrobić przelew, aby dotarł na konto odbiorcy jeszcze w tym roku?", "link": "https://businessinsider.com.pl/twoje-pieniadze/przelew-przed-koncem-roku-o-tym-warto-pamietac/k5hb390", "date_published": "2022-12-28 13:54:05+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Szykują się zmiany w prawie budowlanym. Duże domy bez pozwolenia w pierwszym kwartale 2023", "description": "Zmiany w Prawie budowlanym, które pozwolą na stawianie bez pozwolenia domów o powierzchni większej niż 70 m kw. zaczną obowiązywać w pierwszym kwartale przyszłego roku — wynika z informacji przekazanych przez ministra rozwoju i technologii Waldemara Budę.", "link": "https://businessinsider.com.pl/twoje-pieniadze/szykuja-sie-zmiany-w-prawie-budowlanym-duze-domy-bez-pozwolenia/98xr15d", "date_published": "2022-12-28 13:43:46+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Niemiecki dziennik pisze o polskiej potędze militarnej i berlińskich geriatrycznych ślimakach", "description": "Niemiecki \"Welt\" wskazuje, że wojna w Ukrainie obnażyła prawdę w kwestii niektórych założeń geopolitycznych. Bije w rolę Niemiec i sugeruje, że układ sił w Europie wyraźnie przesunął się na Wschód. Dziennik pisze o Polsce, która staje się nową potęgą militarną w Europie. \"Zareagowała na nową sytuację zagrożenia z szybkością, która sprawia, że biurokraci w berlińskim Ministerstwie Obrony wyglądają jak geriatryczne ślimaki\".", "link": "https://businessinsider.com.pl/wiadomosci/niemcy-pisza-o-polskiej-potedze-i-berlinskich-geriatrycznych-slimakach/xmsf4gn", "date_published": "2022-12-28 13:25:07+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Prezes PGE: przejmujemy spółkę nowoczesną, ze stabilnym rynkiem", "description": "Dzisiaj, warunkowo jeszcze, PKP Energetyka trafiła w polskie ręce. Przejmujemy spółkę nowoczesną, z profesjonalną kadrą, stabilnym rynkiem, uzupełniającą nasze portfolio — powiedział prezes PGE Wojciech Dąbrowski.", "link": "https://businessinsider.com.pl/biznes/pge-przejmuje-pkp-energetyke-prezes-pge-przejmujemy-spolke-nowoczesna-ze-stabilnym/b30fwk7", "date_published": "2022-12-28 13:19:43+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Tak drożeją mieszkania. NBP pokazał najnowsze dane", "description": "W trzecim kwartale 2022 r. obserwowano dalsze wzrosty nominalnych cen mieszkań, zarówno na rynku pierwotnym, jak i wtórnym — wynika z opublikowanego w środę raportu NBP. Rosły też stawki najmu. W których miastach ceny najmocniej poszły w górę?", "link": "https://businessinsider.com.pl/gospodarka/ceny-mieszkan-i-najmu-tak-rosna-stawki-nbp-pokazal-najnowsze-dane/6b6jddh", "date_published": "2022-12-28 12:52:53+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Francuzi chcą przejąć polską spółkę energetyczną. Sprawą już zajmuje się UOKiK", "description": "15 elektrociepłowni na biogaz i dwie farmy fotowoltaiczne należące do Polskiej Grupy Biogazowej znalazły się na celowniku francuskiej grupy TotalEnergies. Wniosek w sprawie przejęcia polskiego biznesu jest aktualnie analizowany przez UOKiK.", "link": "https://businessinsider.com.pl/biznes/francuzi-chca-przejac-polska-spolke-energetyczna-sprawa-juz-zajmuje-sie-uokik/1nyrn0l", "date_published": "2022-12-28 12:35:39+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Ksiądz przepisał na syna miliony dolarów. \"Nie złożyłem ślubów ubóstwa\"", "description": "Luigiano Gigante odziedziczył po ojcu 7 mln dol., a w testamencie widnieje jako jedyny spadkobierca. Nie byłoby w tym nic dziwnego, gdyby nie fakt, że majątek należał do Louisa Gigante, nowojorskiego księdza i działacza społecznego. Kontrowersje związane z życiem kapłana nie kończą się na złamanym celibacie.", "link": "https://businessinsider.com.pl/wiadomosci/ksiadz-przepisal-na-syna-miliony-dolarow-nie-zlozylem-slubow-ubostwa/7xxp32x", "date_published": "2022-12-28 12:33:22+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Upadki z okien, postrzelenia, trucizny. Tak kończą wrogowie Putina", "description": "Paweł Antonow wypadł z okna hotelu w Indiach. Przed nim w podobnych okolicznościach zginął Rawił Maganow. Lista tajemniczych śmierci krytyków Władimira Putina jest dłuższa.  Dochodziło do nich na długo przed wojną w Ukrainie.", "link": "https://businessinsider.com.pl/wiadomosci/upadki-z-okien-postrzelenia-trucizny-tak-koncza-wrogowie-putina/ttxse86", "date_published": "2022-12-28 12:08:06+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Iskrzy na linii USA-Chiny. Wojsko amerykańskie chce zwiększać obecność w Azji", "description": "Według wysokiego urzędnika ds. obronności 2023 r. będzie przełomowy dla wojska USA w Azji. Ma to być kontynuacja działań administracji Bidena przeciwko destabilizującemu wpływowi Chin na bezpieczeństwo regionu.", "link": "https://businessinsider.com.pl/wiadomosci/iskrzy-na-linii-usa-chiny-wojsko-amerykanskie-chce-zwiekszac-obecnosc-w-azji/htt7hty", "date_published": "2022-12-28 12:06:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "PGE przejmuje PKP Energetykę. Decyzja zapadła", "description": "Rada nadzorcza Polskiej Grupy Energetycznej zgodziła się na przejęcie od funduszu CVC Capital Partners spółki PKP Energetyka, która zapewnia dostawy energii dla polskiej kolei. Potwierdziły się tym samym informacje Business Insidera.", "link": "https://businessinsider.com.pl/biznes/pge-przejmuje-pkp-energetyke-decyzja-zapadla/kdybc04", "date_published": "2022-12-28 11:43:32+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Rządowy minister nazywa KPO lichwiarskim kredytem. \"Zapłacimy 3-5 razy więcej\"", "description": "Unijne pieniądze z KPO dzielą członków rządu. Minister w KPRM i wiceprzewodniczący Solidarnej Polski Michał Wójcik wskazuje, że ustawa zaproponowana przez jego kolegów z koalicji jest niekonstytucyjna. Pieniądze, o które mocno zabiega premier, określił lichwiarskim kredytem.", "link": "https://businessinsider.com.pl/wiadomosci/kpo-lichwiarskim-kredytem-pieniadze-z-ue-dziela-rzad/r732e39", "date_published": "2022-12-28 11:38:35+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "LOT szuka stewardes i stewardów. Ile można zarobić?", "description": "LOT Cabin Crew rekrutuje młodszy personel pokładowy dla Polskich Linii Lotniczych LOT. Dni rekrutacyjne zaplanowano na styczeń. Szczególnie poszukiwane są osoby ze znajomością egzotycznych z naszego punktu widzenia języków.", "link": "https://businessinsider.com.pl/twoje-pieniadze/praca/lot-szuka-stewardes-i-stewardow-ile-mozna-zarobic/yg7pnfq", "date_published": "2022-12-28 11:37:32+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Ubezpieczyciele nie chcą już ubezpieczać statków od ryzyka w związku z wojną w Ukrainie", "description": "Ubezpieczyciele statków powiedzieli, że odwołują ubezpieczenia od ryzyka wojennego w Rosji, na Ukrainie i Białorusi, po tym, jak reasekuratorzy wycofali się z tego regionu w obliczu gwałtownych strat.", "link": "https://businessinsider.com.pl/biznes/ubezpieczyciele-nie-chca-juz-ubezpieczac-statkow-od-ryzyka-w-zwiazku-z-wojna-w/6v9lx10", "date_published": "2022-12-28 11:35:42+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Pełne szpitale i zakłady pogrzebowe. Pandemia ponownie uderza w Chiny", "description": "Chińskie szpitale i zakłady pogrzebowe mierzą się z dużym obłożeniem. W kraju rozprzestrzenia się kolejna fala pandemii COVID-19, podczas gdy władze państwa luzują restrykcyjną politykę zero covid.", "link": "https://businessinsider.com.pl/wiadomosci/pandemia-ponownie-uderza-w-chiny-pelne-szpitale-i-zaklady-pogrzebowe/4ps99np", "date_published": "2022-12-28 11:01:32+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Rząd bierze się za patodeweloperkę. Minister mówi co z mikrokawalerkami i katastrem", "description": "W styczniu rząd ma przedstawić projekt ustawy, który ma ukrócić problemy na rynku nieruchomości w Polsce. — Chciałbym, aby w Polsce budowano mieszkania nie mniejsze niż 25 m kw. — stwierdził minister rozwoju Waldemar Buda.", "link": "https://businessinsider.com.pl/twoje-pieniadze/nieruchomosci/rzad-bierze-sie-za-patodeweloperke-minister-mowi-co-z-mikrokawalerkami-i-katastrem/9skdh5d", "date_published": "2022-12-28 10:41:32+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Dostawy węgla, Polski Ład i nie tylko. NIK bierze pod lupę działania rządu", "description": "NIK skontroluje w 2023 r. zabezpieczenie dostaw węgla do Polski oraz wprowadzenie zmian w podatkach w ramach Polskiego Ładu — podano w planie pracy NIK na przyszły rok. To jednak nie wszystko. Izba zapowiada też m.in. kontrole dotyczące Ukraińców.", "link": "https://businessinsider.com.pl/gospodarka/dostawy-wegla-polski-lad-i-nie-tylko-nik-bierze-pod-lupe-dzialania-rzadu/tcpqy1h", "date_published": "2022-12-28 10:18:35+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Dwujęzyczne napisy w sklepach Kaufland. Kyjzy, ŏplerki i taszyntuchy do dzieciŏntek", "description": "W sklepach sieci Kaufland na Śląsku, a konkretnie w Katowicach i Knurowie, pojawiły się opisy produktów w dwóch językach — polskim i śląskim. Efektami kampanii pochwalił się w sieci jej twórca, Adrian Goretzki, który prowadzi śląskie biuro językowe PoNaszymu.pl.", "link": "https://businessinsider.com.pl/biznes/dwujezyczne-napisy-w-sklepach-kaufland-kyjzy-plerki-i-taszyntuchy-do-dziecintek/ed1sdcy", "date_published": "2022-12-28 10:12:11+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Balkony i dachy bloków zaroją się od solarów? Rząd otwiera furtkę dla prosumentów lokatorskich", "description": "Przywykliśmy już w Polsce do paneli fotowoltaicznych na dachach domów. Wkrótce na szeroką skalę mogą zacząć się też pojawiać na blokach. Rząd stawia na prosumentów lokatorskich. Skorzystać mają spółdzielnie i wspólnoty mieszkaniowe.", "link": "https://businessinsider.com.pl/twoje-pieniadze/balkony-i-dachy-blokow-zaroja-sie-od-solarow-rzad-otwiera-furtke-dla-chetnych/m378vwk", "date_published": "2022-12-28 09:43:43+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "To był rok rekordowych obniżek OC, ale dobre czasy już się kończą", "description": "Rok 2022 kończy się największą od pięciu lat obniżką średniej składki OC. Właściciele pojazdów płacili za obowiązkowe ubezpieczenie średnio o 16 proc. mniej niż przed rokiem. Nadchodzący rok nie będzie już dla kierowców tak łaskawy. Biorąc pod uwagę sytuację na rynku ubezpieczeń, na podwyżki w 2023 r. powinni być przygotowani wszyscy kierowcy.", "link": "https://businessinsider.com.pl/twoje-pieniadze/ceny-oc-to-byl-rok-rekordowych-obnizek-ale-dobre-czasy-juz-sie-koncza/6gx80z9", "date_published": "2022-12-28 09:38:15+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Zysk NBP miał iść na wzmocnienie armii. Ale jest problem", "description": "Podwyżki stóp procentowych uderzają nie tylko w kredytobiorców. Skutkują także drastycznym wzrostem kosztów dla NBP. Bankowi centralnemu będzie trudno o zysk, który miał być przekazany na wzmocnienie armii — pisze \"Dziennik Gazeta Prawna\".", "link": "https://businessinsider.com.pl/gospodarka/zysk-nbp-mial-isc-na-armie-ale-jest-problem/fpc3yzy", "date_published": "2022-12-28 09:15:14+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Ile dać księdzu do koperty? Polacy odpowiedzieli na to pytanie", "description": "Ile to jest \"co łaska?\" To pytanie zadaje sobie wiele osób, szykujących się na przyjęcie księdza w ramach wizyty duszpasterskiej. Okazuje się, że królują raczej skromne kwoty. A wiele osób uważa, że nie trzeba dawać nic.", "link": "https://businessinsider.com.pl/twoje-pieniadze/ile-dac-ksiedzu-do-koperty-polacy-odpowiedzieli-na-to-pytanie/nedpwyk", "date_published": "2022-12-28 09:12:47+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Właścicielami huty są Rosjanie i Ukraińcy. Nie mogą się dogadać, zakład upada", "description": "Liberty Steel, właściciel m.in. Huty Częstochowa, ma negocjować zakup postawionej w stan likwidacji węgierskiej huty Dunaferr. Ta należy do spółki, w której udziałowcami są firmy z Ukrainy i Rosji. Akcjonariusze nie mogą się porozumieć — pisze serwis WNP.", "link": "https://businessinsider.com.pl/biznes/wlascicielami-huty-sa-rosjanie-i-ukraincy-nie-moga-sie-dogadac-zaklad-upada/kz3dqey", "date_published": "2022-12-28 08:34:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Podatnicy winni fiskusowi ogromną kwotę. Najgorzej jest w woj. mazowieckim i śląskim", "description": "116 mld 835 mln zł wyniosły należności za trzy kwartały 2022 r. pozostałe do zapłaty z tytułu podatków. Zdecydowana większość należności dotyczy VAT-u. Na kolejnych miejscach w zestawieniu widać akcyzę, PIT i CIT.", "link": "https://businessinsider.com.pl/finanse/podatnicy-winni-fiskusowi-ogromna-kwote-najgorzej-jest-w-woj-mazowieckim-i-slaskim/zyf1h8s", "date_published": "2022-12-28 08:33:05+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kurs franka 28 grudnia powyżej 4,7", "description": "Frank szwajcarski powyżej 4,7 zł. W środę rano 28 grudnia 2022 r. kurs tej waluty wobec polskiego złotego wynosi 4,7441.", "link": "https://businessinsider.com.pl/gielda/kursy-walut/kurs-franka-frank-szwajcarski-chfpln-28-grudnia-2022/rsq627f", "date_published": "2022-12-28 08:08:31+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kurs dolara 28 grudnia w okolicach 4,4", "description": "Kurs dolara w okolicach 4,4. W środę rano 28 grudnia 2022 r. kurs USD/PLN wynosi 4,4090.", "link": "https://businessinsider.com.pl/gielda/kursy-walut/kurs-dolara-usdpln-notowania-walut-28-grudnia-2022/pd8848r", "date_published": "2022-12-28 08:05:13+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kurs euro 28 grudnia poniżej 4,7", "description": "Kurs euro poniżej 4,7. W środę rano 28 grudnia 2022 r. kurs EUR/PLN wynosił 4,6940 zł.", "link": "https://businessinsider.com.pl/gielda/kursy-walut/kurs-euro-eurpln-notowania-walut-28-grudnia-2022/r2kw26e", "date_published": "2022-12-28 08:02:40+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "\"Bardzo nietypowe interwencje polityczne\". Niemiecki właściciel mBanku o polskim rządzie", "description": "Niemiecki Commerzbank jest zadowolony z rozwoju mBanku w Polsce, ale jednocześnie zaniepokojony ruchami polskiego rządu. \"Musimy poczekać i zobaczyć, jak będzie wyglądał ogólny klimat polityczny po wyborach w Polsce w przyszłym roku\" — mówi szef Commerzbanku Manfred Knof, pytany o sprzedaż polskiej części biznesu.", "link": "https://businessinsider.com.pl/firmy/bardzo-nietypowe-interwencje-polityczne-niemiecki-wlasciciel-mbanku-o-polskim-rzadzie/b1bzjyq", "date_published": "2022-12-28 07:42:40+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Problem z gruntami pod CPK. \"Inwestycja nie jest zagrożona\"", "description": "Centralny Port Komunikacyjny ma być gotowy w 2027 r., a pierwsi pasażerowie mają z niego odlecieć już rok później. Tymczasem spółka CPK kupiła do tej pory jedną dziesiątą gruntów, na których ma zostać wybudowane największe lotnisko w Polsce.", "link": "https://businessinsider.com.pl/gospodarka/problem-z-gruntami-pod-cpk-inwestycja-nie-jest-zagrozona/f1c74r9", "date_published": "2022-12-28 07:29:52+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Prąd \"z Bałtyku\" coraz bliżej. Nadchodzi wysyp inwestycji", "description": "Na przełomie 2025 i 2026 r. pierwsze farmy wiatrowe na Bałtyku mogą zacząć zasilać polską sieć energetyczną. W kolejnych latach inwestycji przybędzie. \"Polska może być energetycznym spichlerzem Europy\" — przekonuje w rozmowie z wnp.pl Ireneusz Zyska, pełnomocniki rządu ds. OZE.", "link": "https://businessinsider.com.pl/gospodarka/prad-z-baltyku-coraz-blizej-nadchodzi-wysyp-inwestycji/gysxj8y", "date_published": "2022-12-28 07:04:56+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Sąd Najwyższy zajmie się tematem obniżenia prowizji kredytu", "description": "Kwestią, czy prowizja za udzielenie kredytu mieszkaniowego ulega proporcjonalnemu obniżeniu w sytuacji wcześniejszej spłaty tego kredytu, czy też jest to koszt niedotyczący okresu obowiązywania umowy, zajmie się wkrótce Sąd Najwyższy. Pytanie do SN skierował szczeciński sąd.", "link": "https://businessinsider.com.pl/prawo/sad-najwyzszy-zajmie-sie-tematem-obnizenia-prowizji-kredytu/r288k9t", "date_published": "2022-12-28 06:50:41+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Co z odbieraniem prawa jazdy za prędkość? Jest komentarz z rządu", "description": "Nie będzie zmiany przepisów w związku głośnym wyrokiem Trybunału Konstytucyjnego ws. zatrzymywania prawa jazdy za przekroczenie prędkości — poinformował wiceminister sprawiedliwości Marcin Warchoł. Jego zdaniem to starostowie muszą dostosować się do zaleceń Trybunału przy wydawaniu decyzji.", "link": "https://businessinsider.com.pl/wiadomosci/co-z-odbieraniem-prawa-jazdy-za-predkosc-jest-komentarz-z-rzadu/6rfd3p7", "date_published": "2022-12-28 06:34:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Epidemia grypy odbija się na firmach. Rekordowa liczba zwolnień lekarskich", "description": "Polacy masowo biorą zwolnienia z pracy, zarówno na siebie, jak i na dzieci. Przyczyną są choroby wywołane wirusami grypy, RSV i COVID-19 – pisze w środę \"Dziennik Gazeta Prawna\".", "link": "https://businessinsider.com.pl/wiadomosci/epidemia-grypy-odbija-sie-na-firmach-rekordowa-liczba-zwolnien/2v5vnck", "date_published": "2022-12-28 06:30:27+00:00", "persistent": false, "user": "rumpel", "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Waloryzacja emerytur jak płaca minimalna? Presja na drugą podwyżkę", "description": "76 proc. Polaków chce, by rząd wprowadził dla emerytów dwukrotną waloryzację świadczeń w 2023 r. – wynika sondażu Instytutu Badań Pollster dla \"Super Expressu\".", "link": "https://businessinsider.com.pl/twoje-pieniadze/emerytury/waloryzacja-emerytur-jak-placa-minimalna-presja-na-druga-podwyzke/2qy39xq", "date_published": "2022-12-28 06:19:24+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kryzys dopadł kurierów. Tegoroczne święta rozczarowały", "description": "Popyt na usługi logistyczne w Polsce hamuje, a branża z obawą patrzy na rok 2023 – pisze w środę \"Rzeczpospolita\". Świadczy o tym okres świąteczny, tradycyjnie najbardziej pracowity w branży. Tegoroczny wzrost zainteresowania usługami kurierów mocno rozczarował.", "link": "https://businessinsider.com.pl/biznes/kryzys-dopadl-kurierow-tegoroczne-swieta-rozczarowaly/hl3vtvl", "date_published": "2022-12-28 06:09:57+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Giełdowa katastrofa Tesli robi się coraz bardziej spektakularna", "description": "Katastrofa na akcjach Tesli wygląda coraz bardziej spektakularnie, tylko wczoraj jej akcje spadły o ponad 11 proc. Tracą na wartości też inne duże i znane spółki technologiczne, w tym Apple. Spokojniej jest na rynku ropy i to pomimo najnowszego dekretu Putina, który dotyczy tego rynku i na pierwszy rzut oka brzmi groźnie. Mamy też dość duże i zaskakujące ruchy, jeśli chodzi o notowania europejskich i amerykańskich obligacji. Jeśli natomiast chodzi o polskie obligacje, to finansowanie wydatków zbrojeniowych nie będzie wymagać ich dodatkowej emisji – twierdzi minister finansów Magdalena Rzeczkowska. Oto pięć najciekawszych wydarzeń w gospodarce teraz.", "link": "https://businessinsider.com.pl/gospodarka/piec-najciekawszych-wydarzen-w-gospodarce-teraz-28122022/hytjx7q", "date_published": "2022-12-28 06:03:42+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Prezes Alior Banku: wyrok TSUE uderzy w gospodarkę", "description": "Korzystny dla frankowiczów wyrok TSUE odbije się na kapitałach banków, na zdolności do generowania przez banki akcji kredytowej i ich zdolności finansowania gospodarki — przekonuje prezes Aliora. W rozmowie z PAP mówi także o problemach z pozyskaniem kapitału i prognozach banku na 2023 r.", "link": "https://businessinsider.com.pl/gospodarka/prezes-alior-banku-wyrok-tsue-uderzy-w-gospodarke/ex3z1sg", "date_published": "2022-12-28 05:55:44+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Pięć wielkich zmian, które czekają nas w 2023 r. Szef BMW w Polsce prognozuje najbliższą przyszłość", "description": "Przemodelowanie globalizacji, transformacja energetyczna, zwiększenie znaczenia zrównoważonego rozwoju, dynamiczny rozwój technologii oraz rzeczywistości wirtualnej — takie najważniejsze zmiany czekają nas w 2023 r. uważa Christian Haririan, dyrektor Generalny BMW Group Polska, o czym pisze dla Business Insider Polska.", "link": "https://businessinsider.com.pl/motoryzacja/piec-wielkich-zmian-ktore-czekaja-nas-w-2023-r-szef-bmw-w-polsce-prognozuje/jhnz0el", "date_published": "2022-12-28 05:40:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Oto priorytety Kim Dzong Una na 2023 r.", "description": "Nadchodzący rok w Korei Północnej ma przynieść kolejne testy północnokoreańskiej broni, wzmacniania siły obronnej i \"walki z wrogiem\". Cele na 2023 przedstawił przywódca państwa Kim Dzong Un drugiego dnia posiedzenia plenarnego Komitetu Centralnego Partii Pracy.", "link": "https://businessinsider.com.pl/wiadomosci/korea-polnocna-oto-priorytety-kim-dzong-una-na-2023-r/kz3z7t6", "date_published": "2022-12-28 05:31:20+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Składka zdrowotna za 2022 r. Musisz to wiedzieć, jeśli prowadzisz działalność", "description": "Przedsiębiorcy będą musieli rozliczyć składkę zdrowotną za 2022 r. Osoby na skali PIT i liniowcy płacą ją od dochodu, a ryczałtowcy – ryczałtowo. Składkę rozlicza się jednak inaczej niż podatek. Ponadto przedsiębiorcy na ryczałcie lub liniowym PIT będą mogli po zakończeniu 2022 r. zmienić formę opodatkowania na skalę PIT. Kto się na to zdecyduje, będzie musiał również przeliczyć składkę zdrowotną, a ewentualną różnicę dopłacić.", "link": "https://businessinsider.com.pl/prawo/podatki/skladka-zdrowotna-za-2022-r-jak-ja-rozliczyc/bw0p0y0", "date_published": "2022-12-28 05:30:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Od 1 stycznia obowiązek oszczędzania prądu w sektorze finansów publicznych", "description": "Od 1 stycznia 2023 r. w życie wchodzi dalszy obowiązek oszczędzania prądu w jednostkach sektora finansów publicznych. Przepisy zobowiązują do 10 proc. oszczędności energii elektrycznej w skali całego 2023 r.", "link": "https://businessinsider.com.pl/prawo/od-1-stycznia-obowiazek-oszczedzania-pradu-w-sektorze-finansow-publicznych/e2eej1d", "date_published": "2022-12-28 05:15:57+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Co nas czeka z cenami gazu? Prezes URE o 2023 r. oraz nieuniknionych podwyżkach w kolejnym", "description": "Każda zaoszczędzona jednostka energii to zysk dla naszego portfela i środowiska. Uważam, że najbliższy rok będzie dla nas czasem przyswajania nowych nawyków ekologicznych polegających na racjonalnym użytkowaniu zasobów (energia, paliwa, woda) i ich oszczędzaniu. Będzie to też rok weryfikacji skuteczności wdrożonych narzędzi osłonowych, zarówno na poziomie krajowym, jak i europejskim — pisze w felietonie dla Business Insider Polska Rafał Gawin, prezes Urzędu Regulacji Energetyki.", "link": "https://businessinsider.com.pl/gospodarka/co-nas-czeka-z-cenami-gazu-prezes-ure-o-2023-r-oraz-nieuniknionych-podwyzkach-w/fxpdnx9", "date_published": "2022-12-28 05:15:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Trzy miliony osób dostaną podwyżki od stycznia. Wzrost jest rekordowy", "description": "Od 1 stycznia minimalne wynagrodzenie za pracę wzrośnie z 3010 zł do 3490 zł. Kolejna podwyżka — tym razem do 3600 zł — zacznie obowiązywać od lipca 2023 r. Rząd szacuje, że dzięki temu wyższe pensje w przyszłym roku otrzyma ok. 3,05 mln osób. Inni pracownicy też skorzystają, bo wzrosną świadczenia powiązane z płacą minimalną, w tym np. maksymalne odprawy i dodatki za pracę w nocy.", "link": "https://businessinsider.com.pl/prawo/praca/trzy-miliony-osob-dostana-podwyzki-od-stycznia-wzrost-jest-rekordowy/8kkdwk3", "date_published": "2022-12-28 05:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]