[{"source": "https://www.engadget.com/rss.xml", "title": "Researchers develop blood test that can reliably detect Alzheimer’s disease", "description": "<p>When doctors need to confirm an Alzheimer's diagnosis, they often turn to a combination of brain imaging and cell analysis. Both have their downsides. The latter involves a lumbar puncture, an invasive and painful procedure that’s more commonly known as a spinal tap. A doctor will insert a needle into the lower back to extract a sample of the patient’s cerebrospinal fluid. A lab technician then tests the sample for signs of progressive nerve cell loss and excessive amyloid and tau protein accumulation. MRI scans are less invasive but they’re often expensive and accessibility is an issue; not every community has access to the technology.</p><p>The next best tool for diagnosing Alzheimer’s disease is a blood test. While some can detect abnormal tau protein counts, they’re less effective at spotting the telltale signs of neurodegeneration. But that could soon change. This week, in the journal <a href=\"https://academic.oup.com/brain/advance-article/doi/10.1093/brain/awac407/6960988?login=false\"><em><ins>Brain</ins></em></a>, a multinational team made up of researchers from Sweden, Italy, the UK and US detailed a new antibody-based blood test they recently developed. The new test can detect brain-derived tau proteins, which are specific to Alzheimer’s disease. Following a study of 600 patients, the team found their test could reliably distinguish the illness from other neurodegenerative diseases.</p><span id=\"end-legacy-contents\"></span><p>Dr. Thomas Karikari, a professor of psychiatry at the University of Pittsburgh and one of the co-authors of the study, <a href=\"https://www.theguardian.com/society/2022/dec/28/scientists-develop-blood-test-for-alzheimers-disease\"><ins>told </ins><em><ins>The Guardian</ins></em></a> he hopes the breakthrough could help other researchers design better clinical trials for Alzheimer’s treatments. “A blood test is cheaper, safer and easier to administer, and it can improve clinical confidence in diagnosing Alzheimer’s and selecting participants for clinical trial and disease monitoring,” he said. There’s more work to be done before the test makes its way to your local hospital. To start, the team needs to validate that it works for a wide variety of patients, including those who come from different ethnic backgrounds.</p>", "link": "https://www.engadget.com/researchers-develop-blood-test-detects-alzheimers-disease-224320271.html?src=rss", "date_published": "2022-12-28 22:43:20+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "A Stan Lee documentary will hit Disney+ next year", "description": "<p>Today is Stan Lee's 100th birthday and <a href=\"https://www.engadget.com/tag/marvel/\">Marvel</a> marked the occasion by <a href=\"https://www.marvel.com/articles/tv-shows/stan-lee-documentary-coming-to-disney-in-2023\">revealing</a> that a documentary about his life will hit <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=85d85ef3-fac9-418f-9573-418cf162cd0c&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Disney%2B&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI4NWQ4NWVmMy1mYWM5LTQxOGYtOTU3My00MThjZjE2MmNkMGMiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuZGlzbmV5cGx1cy5jb20vIiwiY29udGVudFV1aWQiOiI2MTZkYTllNy0xNDdmLTQ3ZjktOGFmNy0xN2MwNjQ4MTk0NDIifQ&amp;signature=AQAAAfusaWSPpasBSz1mFkcqAgTY8qe0s-1cl-G0YUM-x52h&amp;gcReferrer=https%3A%2F%2Fwww.disneyplus.com%2F\">Disney+</a> next year. Lee, <a href=\"https://www.engadget.com/2018-11-12-marvel-stan-lee-dies-at-95.html\">who died in 2018,</a> is a critical part of Marvel’s legacy. The many, many characters he’s credited with co-creating include Spider-Man, Iron Man, Black Panther, Ant-Man, X-Men, The Fantastic Four and The Incredible Hulk.</p><p>Marvel didn’t reveal many details about the project, though it did release a teaser containing some of Lee’s cameos in Marvel Cinematic Universe movies. It’s unclear whether the documentary will take a warts-and-all look at <a href=\"https://www.esquire.com/entertainment/movies/a25096722/stan-lee-death-legacy-controversy-lawsuits-sexual-harassment/\"><ins>Lee’s complex life</ins></a> or who will be involved in telling his story.&nbsp;</p><span id=\"end-legacy-contents\"></span><div id=\"3ad5c71f18bd493da2a7250f744dcda2\"><div style=\"width: 100%; height: 0; padding-bottom: 56.25%;\"></div></div><p>Disney has mined its history for several documentary projects for its streaming service. When <a href=\"https://www.engadget.com/tag/disney%20plus/\">Disney+</a> debuted three years ago, it <a href=\"https://www.engadget.com/2019-11-06-disney-plus-launch-musicals-documentaries-jeff-goldblum.html\"><ins>featured a docuseries on the Imagineers</ins></a>, the creative minds behind its theme parks. It later added one about <a href=\"https://www.engadget.com/disney-plus-behind-the-attraction-review-130039942.html\"><ins>the stories behind its rides</ins></a>. The platform is also home to documentaries on <a href=\"https://www.engadget.com/2019-10-19-disney-plus-non-fiction-lineup.html\"><ins>Mickey Mouse</ins></a>, <a href=\"https://www.engadget.com/marvel-studios-assembled-wandavision-disney-march-12-214007529.html\"><ins>MCU shows and movies</ins></a> and the cultural impact of <a href=\"https://www.engadget.com/2019-04-10-disney-plus-supper-club.html\"><ins>Marvel</ins></a>.</p>", "link": "https://www.engadget.com/disney-plus-marvel-stan-lee-documentary-streaming-194232052.html?src=rss", "date_published": "2022-12-28 19:42:32+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "The worst of tech in 2022", "description": "<p>Though it can be depressing to consider the worst in tech each year, sometimes naming some of the losers can actually bring some schadenfreude. In 2022, watching the long-overinflated crypto bubble burst was like staring at a pimple being popped in slow motion: oddly and grossly satisfying. And though some of us were sad to see <a href=\"https://www.engadget.com/google-shutting-down-stadia-162704135.html\">Stadia go</a>, no one in the tech and gaming industries was surprised when Google sent it to the graveyard. More frustrating, though, were the debacles that unfolded this year with very real and sometimes dangerous repercussions for the most vulnerable communities. As we recap the worst things that happened in tech in 2022, let’s hope that the year ahead brings more positive developments for us all.</p><h2>Twitter</h2><p>Even before Elon got his hands on Twitter, the service was being mis-handled by its leaders. As soon as Musk floated the idea of a $44 billion takeover earlier this year, Twitter CEO Parag Agrawal and the company’s board seemingly jumped at the potential payday. Who cares if it’s a singular social network, one of the few platforms for under-served communities to get their voices heard? Agrawal alone <a href=\"https://www.washingtonpost.com/business/2022/10/29/twitter-executives-payouts-musk/\">reportedly received $57.4 million</a> from the sale. (Founder <a href=\"https://www.cnn.com/2022/11/01/tech/twitter-jack-dorsey-elon-musk/index.html\">Jack Dorsey ended up rolling over his investment in the site</a>, rather than nabbing a near $1 billion payout.)</p><span id=\"end-legacy-contents\"></span><p>And now we have Musk’s Twitter, an increasingly toxic pit of the internet’s worst, driven entirely by the richest man in the world’s id. Advertisers are leaving in droves, and Twitter obsessives are making their way to whatever alternative they can find. Meanwhile, Musk is learning just how difficult running a social network is (what’s that, you actually <em>need</em> content moderation?!). At this point, we can only hope Twitter will go the way of Tumblr: Mismanaged until it’s sold at a fire sale price to someone who actually cares about the internet. —<em> Devindra Hardawar, Senior editor.</em></p><div id=\"091c8a918d4f43e384d967a6b5e6f84f\"></div><h2>Crypto, FTX and everything related</h2><p>2022 saw the value of major cryptocurrencies fall by a significant margin, with billions of dollars being wiped off the industry in minutes. Major crypto companies saw that a winter was coming, and started running layoffs in the hope of staunching the flow. But that winter got turned into a blizzard when FTX collapsed, pulling the already downward trends even further south. The year also saw plenty of other crypto exchanges get hacked, or burn up quite spectacularly when things got hairy. It was only then that the air started pouring out of Sam Bankman-Fried’s bubble, and we’re living through the consequences of that right now.</p><p>An Aside: I studied company law and finance for two years, and while I’d never pretend to be a high-minded finance type, even a cursory look at FTX should have aroused suspicion. The business was structured so opaquely that it seemed like an obvious ploy to mask something, be it amateurishness, or criminality. No company that drew in just $388 million in profit needed to be structured into 100 wholly-owned sub-businesses – only a megacorporation like Disney could possibly justify such a sprawling structure.</p><p>The other thing that FTX’s collapse should remind us all is that, while the current banking system is hardly a paragon, it does it least<em> function</em>. The fact that FTX was allowed to hold so much money in a system run by a bunch of comparatively unqualified figures is ludicrous. Maybe there’s a reason we don’t let a bunch of relatively young kids with little real-world experience in the banking world run major financial institutions.</p><figure><img alt=\"Sam Bankman-Fried, founder and former CEO of crypto currency exchange FTX, sits after his extradition from The Bahamas with his attorneys Mark Cohen and Christian Everdell at his arraignment hearing in Manhattan federal court in New York City, U.S., December 22, 2022 in this courtroom sketch. REUTERS/Jane Rosenberg\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/61a40780-82d8-11ed-b7f9-89eb736cd088\" /><figcaption></figcaption><div class=\"photo-credit\">JANE ROSENBERG / reuters</div></figure><p>If you want to know how bad FTX was, just look at what John Ray III, who famously nursed <em>Enron through its bankruptcy,</em> wrote in the <a href=\"https://pacer-documents.s3.amazonaws.com/33/188450/042020648197.pdf\">Chapter 11</a> filing. “Never in my career have I seen such a complete failure of corporate controls,” he said, adding that the founders were “inexperienced, unsophisticated and potentially compromised.” It gets worse when you reach the bit where it turns out the company had no idea how much cash it had at any one time. Which is surely table stakes for most financial institutions?</p><p>Then there’s the, <em>ahem</em>, alleged prevalence of wash trading in the NFT sphere, as holders swap assets amongst their wallets to give the appearance of a healthy market. Or the fact that a number of major crypto billionaires recently <a href=\"https://bitcoinist.com/death-in-crypto-3-leaders-die-weeks-apart/\">passed away</a> in mysterious circumstances. But there’s no proof, friends, that this is tied to crypto’s usefulness in laundering cash for major criminal networks. None at all.</p><p>I do think, however, that what will really hammer the nail into crypto’s coffin in 2023 is the recession, as people need to cut down on their luxuries to pay for the essentials. Sure, you could justify buying a Bored Ape as an “investment” when there were stimulus checks rolling around the economy. But when you’re deciding between getting $100 bucks to cover your fuel bill this month or a JPEG of Jimmy Fallon as a monkey, a lot of people are going to make the sensible choice.  —<em> Daniel Cooper, Senior editor.</em></p><section><img alt=\"Google CEO Sundar Pichai speaks during a Google keynote address announcing a new video gaming streaming service named Stadia that attempts to capitalize on the company's cloud technology and global network of data centers, at the Gaming Developers Conference in San Francisco, California, U.S., March 19, 2019. REUTERS/Stephen Lam\" class=\"e2ehero-url\" src=\"https://s.yimg.com/os/creatr-images/2019-06/a356fc80-8ee6-11e9-bfde-72049893537e\" /></section><h2>Google Stadia</h2><p>Stadia didn’t last long. But at times during its short life, it was <em>amazing</em>. During <em>Cyberpunk 2077’s</em> unmitigated disaster of a launch, Google’s cloud gaming platform was one of the best places to run the sprawling game with minimal problems. When many couldn’t get the latest PlayStation or Xbox, Stadia was a way to play games with visual fidelity beyond the PS4 and Xbox One – as long as your internet connection could handle it.</p><p>The problem (and there are a few reasons why it struggled) was Stadia didn’t have enough games to stay relevant. Exclusives were rare and there simply weren’t as many games as the competition. Many of Stadia’s titles were also far more expensive to buy compared to other online game stores – even when on sale. When the company closed its internal development studios last year, it was not a good sign.</p><p>Then, <a href=\"https://www.engadget.com/google-denies-stadia-shutdown-rumor-171548840.html\">a rumor gathered pace</a> in late July 2022 that Stadia was going to be shuttered by the end of the summer. It was never substantiated, but it was enough to send devoted Stadia gamers (and their communities in places like Reddit) into freefall. Perhaps this was because Google has a reputation for killing its darlings. (RIP Google Hangouts, Play Music, Cardboard, Reader and the rest). Or perhaps because it was completely plausible?</p><p>Google denied it. Well, for two months. Then, the company <a href=\"https://www.engadget.com/google-shutting-down-stadia-162704135.html\">announced it was shuttering the service</a>, saying Stadia \"hasn't gained the traction with users that we expected.” Which was… true. But it worked incredibly well. That’s probably why this isn’t where Google’s game-streaming tech ends. Earlier this year, AT&amp;T offered a handful of games, including <em>Control</em>, to its customers through Google's Immersive Stream for Games – aka Stadia but not. Capcom used Stadia’s technology to offer a <a href=\"https://www.engadget.com/resident-evil-village-demo-web-streaming-capcom-google-stadia-030057053.html\">web-based <em>Resident Evil: Village </em>demo</a> back in June, while Bungie reportedly used it to test out <em>Destiny 2</em> changes and improvements with staff before rolling it out to gamers.</p><p>Google is, mostly, doing the right thing and <a href=\"https://www.engadget.com/stadia-hardware-refunds-google-store-223002849.html\">reimbursing game and hardware purchases</a>. But that didn’t include Stadia Pro subs – arguably what its most passionate supporters were using. Users will be able to play their game library until January 18, 2023. Then the Stadia servers get turned off, forever. —<em> Mat Smith, UK Bureau Chief.</em></p><figure><img alt=\"WASHINGTON, DC - JULY 28: U.S. Speaker of the House Nancy Pelosi (D-CA) speaks as House Democratic lawmakers hold a press conference to oppose restrictive abortion laws and support women's health care at the U.S. Capitol on July 28, 2022 in Washington, DC. The Supreme Court’s recent decision in the Dobbs v Jackson Women’s Health case overturned the 50-year-old Roe v Wade case and erased federal protection for abortion. (Photo by Tasos Katopodis/Getty Images)\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/c5a14220-82d8-11ed-9f5f-d41924698103\" /><figcaption></figcaption><div class=\"photo-credit\">Tasos Katopodis via Getty Images</div></figure><h2>Period tracking apps and digital privacy</h2><p>After the Supreme Court’s draft decision to overturn Roe v. Wade leaked, there was widespread panic. Amid disbelief, incredulity and outrage, people began to question if the tools they were using to track or avoid pregnancy would be used against them. Chief among the concerns was the reliability of period and cycle tracking apps. Were they collecting data that could be used to identify people who had terminated pregnancies? Would they hand that information over to anyone looking for it?</p><p>The Dobbs decision had a ripple effect when we went from scrutinizing the privacy policies of all cycle-tracking apps, to realizing that the overall digital privacy of every user was on a tenuous foundation. Lia Holland, campaigns and communications director for Fight for the Future, told Engadget in June that period-tracking apps were the “canary in the coal mine in terms of our data privacy.”</p><p>We learned too, that tracking tools used by platforms like Facebook to serve personalized ads could also be used for insidious reasons. Anti-abortion groups, for example, kept tabs on people seeking abortion services using Facebook’s advertising tools, despite Meta’s rules against doing so. Those groups could also share the data with third-party anti-abortion marketing companies to target “abortion-minded” people with ads. Though Google announced its intention to phase out third-party cookies in Chrome by 2023, this year the company had to <a href=\"https://www.engadget.com/google-delays-phaseout-of-third-party-cookies-from-chrome-192422591.html\">delay that to 2024</a> as it continues to test a feasible replacement that would protect consumer privacy while allowing marketers to serve targeted ads.</p><p>At the start of 2022, Google announced that it was trying out a <a href=\"https://www.engadget.com/google-topics-api-privacy-sandbox-third-party-cookie-replacement-130049935.html\">different tracking approach called Topics API</a>, instead of the FLoC method it had initially prioritized. In February, after years of testing, Google’s proposal was <a href=\"https://www.engadget.com/googles-latest-privacy-sandbox-cookie-replacement-approved-by-uk-regulator-112527258.html\">accepted by the UK’s Competition and Markets Authority</a>. Still, despite rolling out previews of its privacy sandbox on Chrome in March and Android in April, Google still needed to push back the disabling of third-party cookies in its browser another year.</p><p>The outlook on our digital privacy in general may be bleak, but there may be hope for improvement. With all the scrutiny this year, many popular period-tracking apps took clear stands and <a href=\"https://www.engadget.com/flo-period-tracker-app-anonymous-mode-212157123.html\">launched privacy-focused modes</a> or made it clear that they would not collect user data. The <a href=\"https://www.engadget.com/ftc-responds-abortion-data-privacy-legal-authorities-030247915.html\">FTC has also warned</a> companies and data brokers against the misuse of health and location data, and said it was “committed to using the full scope of its legal authorities” to safeguard consumer privacy.  —<em> Cherlynn Low, Deputy editor</em></p><figure><img alt=\"Lifestyle image of the Peloton Row\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-09/54cbd9d0-38c2-11ed-bba5-f111fba92384\" /><figcaption></figcaption><div class=\"photo-credit\">Peloton</div></figure><h2>Peloton and home fitness tech (everyone went back to the gym)</h2><p>We’ve all been cooped up at home long enough and in 2022, we all let the dogs (and ourselves) out. And as we all ventured outside, we stopped using the at-home gear we bought to tide ourselves over during the dark days of lockdown. Every time we came home to the sight of the expensive console or the exorbitant stationary bike we no longer used, we were reminded of sadder times or unfulfilled goals.</p><p>So while companies like Peloton and Bowflex saw a huge boost in sales during the lockdown, they quickly saw numbers stagnate or plummet in 2022. After an ambitious effort to manufacture its own equipment, this year the company <a href=\"https://www.engadget.com/peloton-will-no-longer-make-its-own-connected-fitness-products-141307048.html\">gave up making its own products</a> and struck a deal to start selling its machines on Amazon. That marked the first time Peloton had sold its products on a platform other than its own, signaling that the company needed help to move units.</p><p>Since then, it’s also launched a <a href=\"https://www.engadget.com/peloton-bike-tread-guide-dicks-sporting-goods-142604284.html\">partnership with sporting goods retailer Dicks</a> to sell the Bike, Tread and Guide at 100 brick-and-mortar stores in the US. It also launched a <a href=\"https://www.engadget.com/peloton-bike-rentals-co-founders-leaving-154513024.html\">rental program</a> to let people get the Bike for a monthly fee and <a href=\"https://www.engadget.com/peloton-software-strategy-shift-report-193224496.html\">CEO Barry McCarthy said</a> it was contemplating opening its workout content to competing bikes and treadmills.</p><p>These efforts to reach a wider audience makes sense. Peloton <a href=\"https://www.engadget.com/peloton-earnings-loss-sales-subscriptions-144715841.html\">posted a net loss of $757.1 million</a> for the first three months of the year on a revenue of $964 million. The company tried drastic cost-cutting measures, including laying off about 2,800 corporate employees, which is equivalent to 20 percent of its total workforce. It laid off an additional <a href=\"https://www.engadget.com/peloton-bike-tread-price-increase-layoffs-stores-outsourcing-173804988.html\">570</a>, <a href=\"https://www.engadget.com/peloton-bike-tread-price-increase-layoffs-stores-outsourcing-173804988.html\">784</a> and <a href=\"https://www.engadget.com/peloton-layoffs-fourth-round-173007412.html\">500</a> workers in July, August and October, effectively halving its workforce in a year. It also <a href=\"https://www.engadget.com/peloton-price-changes-subscription-bike-plus-tread-161051108.html\">cut the prices of existing models</a> in an effort to lower the barrier to entry and draw in more new customers.</p><p>It’s not all doom and gloom for Peloton, though. The company did launch <a href=\"https://www.engadget.com/peloton-row-ergometer-rowing-machine-connected-110014923.html\">a new rowing machine</a> and <a href=\"https://www.engadget.com/peloton-guide-camera-hands-on-153057753.html\">connected camera</a> this year, and appears to be setting its sights on more markets around the world. <em>&nbsp;</em>—<em> C.L.</em></p><figure><img alt=\"2023 Toyota bZ4X all-electric SUV is displayed during the 2021 LA Auto Show in Los Angeles, California, U.S. November, 17, 2021. REUTERS/Mike Blake\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-06/bf042d50-f3cd-11ec-b67f-4b719169bcd8\" /><figcaption></figcaption><div class=\"photo-credit\">Mike Blake / reuters</div></figure><h2>Toyota’s EV failure</h2><p>Everything about Toyota’s bZ4X is disappointing. It came far too late, long after the company established itself as a hybrid leader and Tesla paved the way for true electric vehicles. It’s a bit ugly and surprisingly boring compared to other EVs, judging from <a href=\"https://www.autoblog.com/article/2023-toyota-bz4x-review/\">practically every review</a>. Oh, and it had to be completely recalled because the <a href=\"https://www.engadget.com/toyota-recalls-nearly-3000-bz4x-ev-over-potentially-deadly-wheel-defect-192025370.html\">freaking wheels could fly off</a>. Instead of being a market leader in safety and reliability, the bZ4X made it seem like Toyota had never built a car before. Even its name didn’t make sense!</p><p>While Toyota has <a href=\"https://www.engadget.com/toyota-restarts-bz4x-ev-production-165203347.html\">resumed production of the bZ4X</a>, it’s clear the company missed out on a huge opportunity with its first mass market EV. (There was a RAV4 EV, once upon a time.) And it’s doubly disappointing after we’ve learned that the company has been <a href=\"https://arstechnica.com/cars/2021/07/toyota-bet-wrong-on-evs-so-now-its-lobbying-to-slow-the-transition/\">lobbying to slow down the EV transition</a>. It’s classic innovator’s dilemma stuff – after pioneering with hybrids, why rock the boat any further? Toyota is reportedly <a href=\"https://www.reuters.com/business/autos-transportation/exclusive-toyota-scrambles-ev-reboot-with-eye-tesla-2022-10-24/\">pushing to reboot its sluggish EV plans</a>, and given its sheer size it’ll likely catch up to other EV companies within the next decade.</p><p>But the company’s image is tarnished. It used to be the car maker that put its customers first, one that actually cared about the environment. But it turns out even the good guys can become complacent. <em>&nbsp;</em>—<em> D.H.</em></p>", "link": "https://www.engadget.com/losers-in-tech-2022-180011821.html?src=rss", "date_published": "2022-12-28 18:00:11+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "The best Xbox Series X and Series S accessories in 2023", "description": "<p>It’s been two years since the Xbox Series X and S launched, and accessory-makers haven’t wasted any time in delivering a plethora of useful gear. Want some extra SSD storage? Seagate’s expansion cards are cheaper than ever and easy to install. Need a few extra controllers? You’ve got your pick of choices from Microsoft and third-parties (maybe just throw caution to the wind and splurge for an Elite controller). And it’s always worth getting a headset, both for immersive gaming and chatting with teammates. Here are a few accessories we’d recommend for every Xbox gamer.</p><h2>Controllers: Go stylish, go Pro</h2><p></p><p>It's always smart to have a second controller on hand. Even if you don't play multiplayer games much, you'll regret not being prepared for the occasional friend or family member who's down for a <em>Mortal Kombat</em> match. And at the very least, it's wise to have a replacement in case something goes wrong with your main controller. (We've all smashed our gamepads against the wall for one reason, or another – no judgment.)</p><span id=\"end-legacy-contents\"></span><p>While you could just get<a href=\"https://shopping.yahoo.com/rdlw?merchantId=67071605-d4df-494e-8d9c-c9c236b8bb38&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Microsoft&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NzA3MTYwNS1kNGRmLTQ5NGUtOGQ5Yy1jOWMyMzZiOGJiMzgiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cubWljcm9zb2Z0LmNvbS9lbi11cy9kL3hib3gtd2lyZWxlc3MtY29udHJvbGxlci84eG41OWNyYnNxZ3o_IiwiY29udGVudFV1aWQiOiI4YTYxNzVmOS1iYjljLTQwNDgtOTExOS1kNGM2ZWI1NGFhMTQifQ&amp;signature=AQAAATv3a0fi7iIV0hRiifqCtqOhmzgucbhAP7SiIJMahMAK&amp;gcReferrer=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fd%2Fxbox-wireless-controller%2F8xn59crbsqgz%3F\"> another stock Microsoft controller</a>, there are plenty of options worth considering. The<a href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9YYm94LVdpcmVsZXNzLUNvbnRyb2xsZXItQW5uaXZlcnNhcnktU3BlY2lhbC14L2RwL0IwOUdIUVZYM04_dGFnPWdkZ3QwYy1wLW8tZHktMjAiLCJjb250ZW50VXVpZCI6IjhhNjE3NWY5LWJiOWMtNDA0OC05MTE5LWQ0YzZlYjU0YWExNCJ9&amp;signature=AQAAAbJtaDjx9U2WxcuveTnayzxpet0AmjbW0-i6Fulai1An&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FXbox-Wireless-Controller-Anniversary-Special-x%2Fdp%2FB09GHQVX3N\"> Anniversary Edition gamepad</a> is more expensive, but it has a spiffy translucent design that'll look great on your coffee table. If you find yourself burning through plenty of AA batteries, consider a rechargeable solution like <a href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9Qb3dlckEtRHVhbC1DaGFyZ2luZy1TdGF0aW9uLVhib3gteC9kcC9CMDhKODQ1OEdTP3RhZz1nZGd0MGMtcC1vLWR5LTIwIiwiY29udGVudFV1aWQiOiI4YTYxNzVmOS1iYjljLTQwNDgtOTExOS1kNGM2ZWI1NGFhMTQifQ&amp;signature=AQAAAebCy5DmRXvW1x0f8KdYUTIf9AvqsIUFmLVIAQeAuIW2&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FPowerA-Dual-Charging-Station-Xbox-x%2Fdp%2FB08J8458GS\">PowerA’s dual controller bay</a>. It comes with two batteries, and it lets you juice up your gamepads in style.</p><p>For dedicated Xbox gamers,<a href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9FbGl0ZS0yLUNvbnRyb2xsZXItQmxhY2stWGJveC1PbmUvZHAvQjA3U0ZLVExaTT90YWc9Z2RndDBjLXAtby1keS0yMCIsImNvbnRlbnRVdWlkIjoiOGE2MTc1ZjktYmI5Yy00MDQ4LTkxMTktZDRjNmViNTRhYTE0In0&amp;signature=AQAAAfH9RFAHDlup4HahzlvHnljKxq_TveN6s253x6X9jd8V&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FElite-2-Controller-Black-Xbox-One%2Fdp%2FB07SFKTLZM\"> Microsoft's second-generation Elite gamepad</a> may be worth the investment. It has replaceable thumbsticks, rear buttons and a comfortable grip. Not to mention, it’s one of the few Xbox gamepads that you can recharge over USB-C.</p><p>If you're more interested in playing older games, or are just looking for a different style of controller, we're also huge fans of<a href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9kcC9CMDhYWThIOUQ1P3RhZz1nZGd0MGMtcC1vLWR5LTIwIiwiY29udGVudFV1aWQiOiI4YTYxNzVmOS1iYjljLTQwNDgtOTExOS1kNGM2ZWI1NGFhMTQifQ&amp;signature=AQAAAQ_zTGagtXKT9a09Z0S7Kpg4xkGyaVbWU48P3TAn4ohK&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB08XY8H9D5\"> 8BitDo's Pro 2</a>. It's incredibly comfortable, and its directional pad is one of the best on the market. It also makes a great controller for PC gaming (though any recent Xbox controller will also work on computers over Bluetooth).</p><a class=\"athena-button rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=shopnow-button&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9FbGl0ZS0yLUNvbnRyb2xsZXItQmxhY2stWGJveC1PbmUvZHAvQjA3U0ZLVExaTT90YWc9Z2RndDBjLXAtby1kei0yMCIsImNvbnRlbnRVdWlkIjoiOGE2MTc1ZjktYmI5Yy00MDQ4LTkxMTktZDRjNmViNTRhYTE0In0&amp;signature=AQAAATyaZE6kpTG4yf_fMRbXPYxDL2G1C3rJ6j91aLZ5gLm3&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FElite-2-Controller-Black-Xbox-One%2Fdp%2FB07SFKTLZM\" id=\"78fca88108fb420d8722f299bab7ac9c\">Buy Elite gamepad at Amazon - $180</a><a class=\"athena-button rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=shopnow-button&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9kcC9CMDhYWThIOUQ1P3RhZz1nZGd0MGMtcC1vLWR6LTIwIiwiY29udGVudFV1aWQiOiI4YTYxNzVmOS1iYjljLTQwNDgtOTExOS1kNGM2ZWI1NGFhMTQifQ&amp;signature=AQAAAcal10ne1vxkvC9DfDrapnzSTDBgzVwgM_lICcmZwxZT&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB08XY8H9D5\" id=\"d0393efe1166441bb9fc82c133dfdeba\">Buy 8Bitdo Pro 2 at Amazon - $50</a><h2>Specialized controllers are cool again!</h2><p></p><p>If you play Microsoft Flight Simulator long enough, you'll realize you can only go so far with a standard gamepad. Time for a flight stick! After conferring with flying simulator fanatics, and perusing plenty of reviews, we'd recommend jumping on<a href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9UaHJ1c3RtYXN0ZXItVC1GbGlnaHQtSG90YXMtT25lLXhib3gvZHAvQjA3NjQzVFcyVj90YWc9Z2RndDBjLXAtby1keS0yMCIsImNvbnRlbnRVdWlkIjoiOGE2MTc1ZjktYmI5Yy00MDQ4LTkxMTktZDRjNmViNTRhYTE0In0&amp;signature=AQAAAVZq7udkvgOyemQpdGVPkQdzCUp4xVH8JywxvJtn1XIp&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FThrustmaster-T-Flight-Hotas-One-xbox%2Fdp%2FB07643TW2V\"> Thrustmaster's T-Flight Hotas One joystick</a>. It offers realistic five-axis control, 14 buttons and a detachable throttle. And unlike some clunky PC solutions, it's compact enough to fit on a coffee table or lap desk. (You can also use it with a computer, if you'd like.)</p><p>If you're more into cars, we were impressed by<a href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9Mb2dpdGVjaC1HOTIzLVJhY2luZy1XaGVlbC1QUzQvZHAvQjA3UEZCNzJOTD90YWc9Z2RndDBjLXAtby1keS0yMCIsImNvbnRlbnRVdWlkIjoiOGE2MTc1ZjktYmI5Yy00MDQ4LTkxMTktZDRjNmViNTRhYTE0In0&amp;signature=AQAAAROswsx-L4CbIRm6EzHNaQ_UVJy75PooUKZm0Kn9UFDU&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FLogitech-G923-Racing-Wheel-PS4%2Fdp%2FB07PFB72NL\"> Logitech's G923 racing wheel</a>. It feels like a <a href=\"https://www.engadget.com/logitech-g923-racing-wheel-hands-on-070115330.html\">genuine steering wheel</a>, with a comfortable grip, steel paddle shifters, and a trio of solid pedals. Once it's clamped to a table, it delivers a surprisingly realistic driving experience – all the better to tear through Mexico in Forza Horizon 5. It's definitely pricey at $400, but it's an investment that'll last for many racing games to come.</p><a class=\"athena-button rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=shopnow-button&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9Mb2dpdGVjaC1HOTIzLVJhY2luZy1XaGVlbC1QUzQvZHAvQjA3UEZCNzJOTD90YWc9Z2RndDBjLXAtby1kei0yMCIsImNvbnRlbnRVdWlkIjoiOGE2MTc1ZjktYmI5Yy00MDQ4LTkxMTktZDRjNmViNTRhYTE0In0&amp;signature=AQAAAbZ_A7wmC1z3mPLaW_UVGlwO5hmh8Ew_Zc5PzeQ7Wy9G&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FLogitech-G923-Racing-Wheel-PS4%2Fdp%2FB07PFB72NL\" id=\"93ed012348734086bcb27f245efe3550\">Buy Logitech racing wheel at Amazon - $400</a><h2>Bump up your storage</h2><p></p><p>If you were lucky enough to nab a new Xbox Series X or S at launch, chances are you're already familiar with their storage limitations. Luckily, you can easily give yourself a bit more breathing room with one of<a href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9TZWFnYXRlLVN0b3JhZ2UtRXhwYW5zaW9uLVNvbGlkLVN0YXRlL2RwL0IwOEszUzZXSk0_dGFnPWdkZ3QwYy1wLW8tZHktMjAiLCJjb250ZW50VXVpZCI6IjhhNjE3NWY5LWJiOWMtNDA0OC05MTE5LWQ0YzZlYjU0YWExNCJ9&amp;signature=AQAAAQxxbKcgDifcqPMO23L3T4veGdUViqi_H7NkGm56aYRM&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FSeagate-Storage-Expansion-Solid-State%2Fdp%2FB08K3S6WJM\"> Seagate's storage expansion cards</a>, which are just as fast as the speedy SSDs inside the consoles. In addition to the 1TB card that arrived at launch, Seagate also recently unveiled 512GB and 2TB options. We'd recommend going for 1TB at this point, but if you can afford it the 2TB SSD will certainly last longer.</p><p>You can also connect traditional hard drives, like<a href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9TZWFnYXRlLUdhbWUtRHJpdmUtR3JlZW4tU1RFQTIwMDA0MDMvZHAvQjAxMDY1Uzc5RT90YWc9Z2RndDBjLXAtby1keS0yMCIsImNvbnRlbnRVdWlkIjoiOGE2MTc1ZjktYmI5Yy00MDQ4LTkxMTktZDRjNmViNTRhYTE0In0&amp;signature=AQAAAdlmswe_1em-sQjCduul8uujJDz6kNGoEBqlh-j6_sFP&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FSeagate-Game-Drive-Green-STEA2000403%2Fdp%2FB01065S79E\"> Seagate's 2TB Game Drive</a>, to the Xbox Series X and S over USB. They're far too slow to run current-gen games at their full speed, but they give you a boatload of storage for a much cheaper price. They're useful to have around for playing games from the original Xbox, as well as the 360. And they can also be used as \"cold storage\" to free up space on your precious SSD. Newer games can easily move back and forth between those drives, which prevents you from having to download them again.</p><h2>Tune up your sound</h2><p></p><p>You deserve better than your crummy TV speakers. While you could just plug in whatever headphones you have laying around into your Xbox controller, we'd recommend investing in a solid pair of wireless headphones. They'll likely sound better, and they remove the whole cord problem entirely. The <a href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9TdGVlbFNlcmllcy1BcmN0aXMtV2lyZWxlc3MtR2FtaW5nLUhlYWRzZXQtSW50ZWdyYXRlZC9kcC9CMDdSSkhINlE4P3RhZz1nZGd0MGMtcC1vLWR5LTIwIiwiY29udGVudFV1aWQiOiI4YTYxNzVmOS1iYjljLTQwNDgtOTExOS1kNGM2ZWI1NGFhMTQifQ&amp;signature=AQAAAUReOyFD2kEaJr9t3EI7Ke_XuJK7EaPUD0p-3KQ18ipX&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FSteelSeries-Arctis-Wireless-Gaming-Headset-Integrated%2Fdp%2FB07RJHH6Q8\">SteelSeries Arctis 9X</a> is one of the best options around, with beefy drivers, a comfortable fit and sturdy build quality. We were<a href=\"https://www.engadget.com/2019-04-23-steelseries-arctix-9x-xbox-wireless-headphones.html\"> impressed during our hands-on testing,</a> as they sounded just as good as the company's excellent<a href=\"https://www.engadget.com/2018-03-13-steelseries-arctis-pro.html\"> Arctis Pro PC headphones</a>.</p><h2>Upgrade to a real media remote</h2><p></p><p>Tired of controlling Netflix playback with your controller? Then snag<a href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS84Qml0ZG8tTWVkaWEtUmVtb3RlLVNob3J0LUluZnJhcmVkLXgvZHAvQjA5QjJSMkdSTT90aD0xJnRhZz1nZGd0MGMtcC1vLWR5LTIwIiwiY29udGVudFV1aWQiOiI4YTYxNzVmOS1iYjljLTQwNDgtOTExOS1kNGM2ZWI1NGFhMTQifQ&amp;signature=AQAAAXMg65_XUr9fOYkL6adNo5Aa-h3L7qlVEgxnrA4SJh1P&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2F8Bitdo-Media-Remote-Short-Infrared-x%2Fdp%2FB09B2R2GRM%3Fth%3D1\"> 8BitDo's Media Remote</a>. Available in long and short designs (the latter removes numbers and other extraneous buttons), they're well-made remotes that fit the Xbox's clean aesthetic. I've been using the short model to control 4K Blu-rays and tons of streaming apps, and it's far easier to use than a controller when it comes to quickly fast-forwarding. Now, I don’t have to put my drink down to skip to another chapter.</p><p></p>", "link": "https://www.engadget.com/best-xbox-series-x-series-s-accessories-140035165.html?src=rss", "date_published": "2022-12-28 17:36:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "Amazon is reportedly working on a standalone sports app", "description": "<p>Amazon’s growing library of sports content could soon have a home of its own. <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy50aGVpbmZvcm1hdGlvbi5jb20vYXJ0aWNsZXMvYW1hem9uLXBsYW5zLWEtc3RhbmQtYWxvbmUtc3BvcnRzLWFwcC1hcy1hbmR5LWphc3N5LWRvdWJsZXMtZG93bi1vbi1wcmltZS12aWRlbz9yYz13aGYwZmQiLCJjb250ZW50VXVpZCI6Ijg0NzQ2ZDEyLWI3YTItNDVhNC1iODY2LTFlNGYzNmJmNTc1NiJ9&amp;signature=AQAAAY-4RW8QvmK_mhBQLcvlLITgGft8T_cLz48gYOXj_8eD&amp;gcReferrer=https%3A%2F%2Fwww.theinformation.com%2Farticles%2Famazon-plans-a-stand-alone-sports-app-as-andy-jassy-doubles-down-on-prime-video%3Frc%3Dwhf0fd\"><em><ins>The Information</ins></em></a> reports the retailer is working on a new standalone streaming app to declutter Prime Video and better highlight its deals with the <a href=\"https://www.engadget.com/amazon-thursday-night-football-2022-season-184224274.html\"><ins>NFL</ins></a>, <a href=\"https://www.engadget.com/2018-06-07-amazon-prime-premier-league-football-uk.html\"><ins>Premier League</ins></a> and <a href=\"https://www.engadget.com/prime-video-will-air-21-exclusive-yankees-games-in-four-states-205356250.html\"><ins>New York Yankees</ins></a>. The development comes following recent comments from Amazon CEO Andy Jassy, who highlighted live sports content as one of the areas where the company plans to continue spending money even as it cuts costs in other areas.</p><p><em>The Information </em>says it couldn’t learn when Amazon expects to release the app, nor if the company plans to charge separately for access to Prime Video’s sports content. The outlet also notes Amazon may decide to shelve the app. Amazon did not immediately respond to Engadget’s comment request.</p><span id=\"end-legacy-contents\"></span><p>Whether it makes sense for Amazon to launch a standalone sports app is not as straightforward as you might think. On the one hand, Prime Video could definitely use decluttering. Even after Amazon <a href=\"https://www.engadget.com/amazon-prime-video-redesign-announced-204019411.html\"><ins>recently redesigned</ins></a> the platform’s interface to make it “less busy and overwhelming,” it can be tricky to find content on the service since it incorporates both streaming and video-on-demand content.</p><p>On the other hand, a standalone app would create more pressure for Amazon to secure worthwhile content. What’s more, the cost of sports content has increased dramatically in recent years. Amazon reportedly pays about $1 billion annually for exclusive streaming rights to the NFL’s <a href=\"https://www.engadget.com/amazon-thursday-night-football-2022-season-184224274.html\"><ins>Thursday Night Football package</ins></a>. Earlier this month, Google reportedly agreed to pay between $2.1 billion and $2.2 billion for the league’s <a href=\"https://www.engadget.com/youtube-nfl-sunday-ticket-deal-155108503.html\"><ins>Sunday Ticket package</ins></a>. A standalone app with its own subscription tier would also complicate Prime Video’s role as a driver of Prime subscriptions. Amazon may decide whatever it gains by creating a separate app may not be worth the tradeoff.&nbsp;&nbsp;</p>", "link": "https://www.engadget.com/amazon-reportedly-creating-standalone-sports-app-173434609.html?src=rss", "date_published": "2022-12-28 17:34:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "Tech's biggest winners in 2022", "description": "<p>Every December at Engadget, between sips of spiked holiday beverages, we look back on the year and recall the best and worst developments in tech. Call us cynical, but in recent years, the list of losers gets longer, while we struggle to find true winners to write about. But in 2022, there were bright spots that brought light to a gloomy, chaotic 12 months. From beautifully simple word games to enchanting pictures from space, there were just enough distractions this year to balance out the neverending drama from Twitter, Meta, Amazon and the like. These are the Engadget team’s favorite things in 2022.</p><h2>NASA’s James Webb Space Telescope and DART projects</h2><p>In 2022, things on Earth were so bad that we all welcomed the opportunity to look at what’s beyond our galaxy. After its launch on Christmas last year, the James Webb Space Telescope (JWST) deployed its sunshield in January, finished calibration a few months later and started sending back images. On July 11th, President Biden revealed the space agency’s first picture to the public, saying it was the sharpest and <a href=\"https://www.engadget.com/james-webb-space-telescope-first-image-223020435.html\">deepest image of the distant universe</a> to date.</p><span id=\"end-legacy-contents\"></span><p>More photos were released <a href=\"https://www.engadget.com/nasa-james-webb-space-telescope-first-color-images-152109471.html\">on July 12th</a>, and throughout the rest of the year, we saw more and more of deep space through the JWST. The colorized pictures made for stunning wallpapers, but also brought us tantalizing information about distant planets. In August, it detected carbon dioxide in a faraway planet’s atmosphere. To date, we’ve also seen images of the Cartwheel Galaxy, Phantom Galaxy and the Pillars of Creation in unprecedented detail. The visual spectacle is a welcome distraction, but the data gained also helps scientists learn a ton more about what exists beyond the Milky Way.</p><div id=\"74a1b41a09f84b209801c09fb4fce497\"></div><p>NASA also scored a reassuring win with its Double Asteroid Redirection Test (DART) project this year, when it managed to crash its spacecraft into an asteroid, changing its course. This success has been <a href=\"https://twitter.com/SenBillNelson/status/1579899660684382208?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1579899660684382208%7Ctwgr%5E10ec715b5ae331451bc526b4fc51edff5b1ba555%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fwww.engadget.com%2Fnasa-dart-mission-smashing-success-184543626.html\">billed as a “watershed moment for planetary defense”</a> by NASA administrator Bill Nelson, adding that the agency “has proven we are serious as a defender of the planet.” The fact that DART was able to knock an asteroid off its course showed that it could work to save the Earth if a space rock were headed for our world and was small enough and detected in time. It’s nice to have some hope for humanity in that specific situation, as we continue to be dazzled by everything we learn about the vast expanse of space that we float in. —<em> Cherlynn Low, Deputy editor.</em></p><h2>Wordle, Josh Wardle and all the -dles</h2><p>Do you remember a time when you weren’t obsessively playing guessing games on your phone right after waking up? That was probably in 2021, before Wordle, the little browser game that could, swallowed most of the internet for the first half of 2022. Josh Wardle, a British software engineer, created a word game for his partner, letting them guess a five letter word through a process of trial and error. He didn’t publicize the title, but it didn’t take long after its October 2021 launch before everyone was playing the game.</p><p>Part of Wordle’s success was due to the simplicity of its mechanic, pulled from the ‘70s board game <em>MasterMind</em> or the ‘80s game show <em>Lingo</em>. Your guesses provoke a color-coded response: A blank box if you struck out, a yellow one if you had the right letter in the wrong place and green in a space that you got right. The other reason for its success was how simply it visualized your guesses, making it easy to share on social media without spoilers. Suddenly, everyone on Twitter was humblebragging about their lexicographical skill posting a short-ish grid of gray, yellow and green squares.</p><p>The fact that only one word came out each day also meant that you had to keep coming back to get your daily fix. It easily slid into your morning routine, as a way of waking your brain up before, during or after, your wake-up beverage of choice.</p><figure><img alt=\"Wordle app game is seen on a smartphone in front of The New York Times logo in this picture illustration, February 1, 2022. Picutre taken February 1, 2022 REUTERS/Dado Ruvic/Illustration\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-02/6b26bbf0-8765-11ec-bffe-9c53b58697a5\" /><figcaption></figcaption><div class=\"photo-credit\">Dado Ruvic / reuters</div></figure><p>It helped, too, that people rapidly took their playing style as an article of faith, developing their own “Starter Words.” And it prompted endless discussion about the best strategy, and how ashamed you should be if you ever failed a day’s game. Wordle also enabled a cottage industry of websites that can help you solve tricky words, and most SEO-chasing newspapers offer a written clue about what today’s Wordle actually is.</p><p>Wordle’s success was so grand that it wasn’t long before a deep-pocketed news organization looking to grow its traffic offered to buy the game wholesale. By January 31st 2022, <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=c813ae39-7d58-41cb-ac66-ad830606ceef&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=The+New+York+Times&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiJjODEzYWUzOS03ZDU4LTQxY2ItYWM2Ni1hZDgzMDYwNmNlZWYiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cubnl0aW1lcy5jb20vMjAyMi8wMS8zMS9idXNpbmVzcy9tZWRpYS9uZXcteW9yay10aW1lcy13b3JkbGUuaHRtbCIsImNvbnRlbnRVdWlkIjoiODQ1Njc0YzctN2E3MS00ZmRjLWI3ZWItYTlkM2EzMGQwOTNhIn0&amp;signature=AQAAAWLq3aR8czCG2H-TGzHR1B1ckeFKFdDaahvYupdzEnsL&amp;gcReferrer=https%3A%2F%2Fwww.nytimes.com%2F2022%2F01%2F31%2Fbusiness%2Fmedia%2Fnew-york-times-wordle.html\"><em>The New York Times</em></a> spent “low seven figures” to buy the title and integrate it into its games platform. The concept may have been knocking around for a while, but Wardle was able to see the fruits of his work pretty quickly. Since then, the NYT has launched Wordlebot, a microsite which’ll analyze your game and tell you the most efficient starter words (CRANE/SLOTH), and it even has its <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=c813ae39-7d58-41cb-ac66-ad830606ceef&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=The+New+York+Times&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiJjODEzYWUzOS03ZDU4LTQxY2ItYWM2Ni1hZDgzMDYwNmNlZWYiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cubnl0aW1lcy5jb20vMjAyMi8xMS8wNy9jcm9zc3dvcmRzL3dvcmRsZS1lZGl0b3IuaHRtbCIsImNvbnRlbnRVdWlkIjoiODQ1Njc0YzctN2E3MS00ZmRjLWI3ZWItYTlkM2EzMGQwOTNhIn0&amp;signature=AQAAATwRKYk7jGEPRJ0iw7EIftV77kEP5lOj4VK7VW6KPd5M&amp;gcReferrer=https%3A%2F%2Fwww.nytimes.com%2F2022%2F11%2F07%2Fcrosswords%2Fwordle-editor.html\">own named editor</a>, so you know who to blame if you have a bad day.</p><p>But it wasn’t just Wardle who benefited. Wordle inspired a fleet of copycats, all of which took the original idea and tweaked it slightly. My daily play routine includes <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=449e2503-c6b5-44c5-bdb8-b3045047b3e5&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Spotify&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI0NDllMjUwMy1jNmI1LTQ0YzUtYmRiOC1iMzA0NTA0N2IzZTUiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuc3BvdGlmeS5jb20vaGVhcmRsZS8jIiwiY29udGVudFV1aWQiOiI4NDU2NzRjNy03YTcxLTRmZGMtYjdlYi1hOWQzYTMwZDA5M2EifQ&amp;signature=AQAAAbtYBJMSaqr6glu3tmiL5Azlc81_Ref426hHN2w_NCY5&amp;gcReferrer=https%3A%2F%2Fwww.spotify.com%2Fheardle%2F%23\">Heardle</a>, which asks you to guess a song after hearing just its opening bars. That was acquired by Spotify in similarly rapid fashion, which makes perfect sense given the marketing opportunities therein. Then there’s <a href=\"https://framed.wtf/\">Framed</a> and Episode, which provide screenshots of movies and TV shows, for you to guess it. <a href=\"https://wafflegame.net/\">Waffle</a>, meanwhile, asks you to sort a grid of jumbled letters into interlocking words using the same Yellow / Green color coding. And then there’s my personal favorite, <a href=\"https://www.redactle.com/\">Redactle</a>, a game which takes a key Wikipedia page and blanks out most of the words for you to guess.</p><p>You want more? Because there is more – <a href=\"https://worldle.teuteuf.fr/\">Worldle</a> is a geography guessing game letting you work out a country. Heardle decades, with one for each decade between the <a href=\"https://www.60s.heardledecades.com/\">‘60s</a><a href=\"https://www.70s.heardledecades.com/\">and</a><a href=\"https://www.80s.heardledecades.com/\">the</a><a href=\"https://www.00s.heardledecades.com/\">‘00s</a>. <a href=\"https://www.lyricle.app/\">Lyricle</a>, lets you guess songs from lines of lyrics. <a href=\"https://www.quordle.com/#/\">Quordle</a>, which asks you to solve four Wordle-style questions simultaneously. <a href=\"https://www.mathler.com/\">Mathler</a>, which tasks you with finding an equation. And, of course, Jeffle, where you have to guess a movie starring one of your favorite Hollywood actors called Jeff – sorry, I made that up, but the fact that’s plausible speaks volumes about the way the world is right now. —<em> Daniel Cooper, Senior editor.</em></p><figure><img alt=\"A Pixel 6a lying face up on a wooden surface, and a white Pixel 6a laying next to it. \" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-07/e03ad250-0884-11ed-b5f7-85a0d794b38d\" /><figcaption></figcaption><div class=\"photo-credit\">Sam Rutherford / Engadget</div></figure><h2>Pixel 6a</h2><p>When friends and family ask which phone they should buy, I tell them to get the latest Pixel a. Last year it was the Pixel 5a (well, the Pixel 4a, because Google didn’t launch the 5a here in the UK), and now it’s supplanted by the even-more premium-looking Pixel 6a.</p><p>The new design is glossy, with the distinctive camera bar that arrived on the flagship Pixel 6 phones last year, ensuring it looks different to all other smartphones. This year, the Pixel 6a also has Google’s homemade Tensor chip, which was built to help with AI and image processing. I might not even need to say this, but the Pixel 6a, like its predecessors, has an incredibly capable camera for the price. It includes Google tricks like Face Unblur to salvage dodgy shots and Magic Eraser for scrubbing out any unwanted elements. The Pixel 6a also has a 6.1-inch display, down from the 6.34-inch screen of last year’s Pixel 5a. So if you’re looking for a more pocketable Android, this might be the best option.</p><p>The Pixel 6a launched at $449, sneaking in under $500. On some occasions (like Black Friday), it’s already been on sale at $300, which is an incredible bargain – especially if you’re still using a smartphone that lacks 5G. The only reason for not buying it in early 2023 is that we’re already hearing rumors of the Pixel 7a, which should be an even better phone. —<em> Mat Smith, UK Bureau Chief.</em></p><figure><img alt=\"Steam Deck review\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-02/6a74eb00-95b1-11ec-ab2f-df115a618661\" /><figcaption></figcaption><div class=\"photo-credit\">Engadget</div></figure><h2>Valve Steam Deck</h2><p>The <a href=\"https://www.engadget.com/steam-deck-review-small-hands-180026719.html\">Steam Deck</a> isn’t the first handheld computer and it certainly won’t be the last. However, by combining the convenience of the Nintendo Switch with the flexibility of a PC and a huge library of supported games (there are now almost 7,000 titles listed as verified or playable), Valve has almost single-handedly reinvigorated the market for portable PC gaming. And with a starting price of just $400, the Steam Deck also costs hundreds less compared to rivals from Ayaneo, GPD and more.</p><p>Granted, the Steam Deck isn’t perfect. It’s rather bulky as far as handhelds go and Valve’s Linux-based SteamOS often requires a bit of tinkering with to optimize a game’s performance. I wish its high-pitched fan was a bit less distracting, too. But thanks to its clever touchpads and general customizability, the Steam Deck makes it easier to play traditional keyboard and mouse games while on the go than pretty much anything else out there. For people who love Nintendo’s games, the Switch is great. But for everyone else, the Steam Deck might be the best multipurpose gaming handheld you can buy right now.  —<em> Sam Rutherford, Senior writer.</em></p><section><img alt=\"The Apple Watch Ultra with alpine loop strap on a person's wrist. The screen shows the Compass app's so-called technical view, with a white dot in the middle. \" class=\"e2ehero-url\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-10/32a78df0-441f-11ed-bfbf-4fb51a69e9be\" /></section><h2>Apple Watch Ultra</h2><p>I’ll admit it — this one’s personal. As a reporter covering smartwatches, I’ve been holding my breath for this year’s trio of highly anticipated wearables from Apple, Samsung and Google. The first two were expected to unveil souped up “Pro” models of their flagship models, while Google was set to launch its first “homemade” smartwatch, featuring Fitbit integrations. Between the blandness of <a href=\"https://www.engadget.com/samsung-galaxy-watch-5-pro-review-battery-life-specs-durability-180052187.html\">Samsung’s Galaxy Watch 5 Pro</a> and the <a href=\"https://www.engadget.com/google-pixel-watch-review-battery-life-fitbit-heart-rate-sensing-015412121.html\">overall letdown of the Pixel Watch</a>, there wasn’t a lot of competition for Apple’s Watch Ultra.</p><p>But the company didn’t just coast on the mediocrity of the Android smartwatch market. The Watch Ultra features a 49mm screen in a highly durable case that doesn’t feel excessively huge (unless you’re a fellow petite-wristed person). Apple made a selection of carefully crafted straps that are eye-catching, comfortable and easy to maneuver with gloves. The Watch Ultra also boasts a depth gauge for divers, dual-frequency GPS for more-accurate distance tracking, an emergency siren and impressive four-day battery life. All that is on top of other Apple Watch features like comprehensive health and fitness tracking, seamless messaging and excellent iPhone integration.</p><p>And for the cherry on top of it all — and this is my selfish reason for loving the Apple Watch Ultra — <a href=\"https://www.engadget.com/apple-watch-ultra-review-battery-life-compass-gps-hike-130055477.html\">reviewing this device allowed me to go on a hike</a> on the job, all in the name of real-world testing. Sure, I have since swapped out the Watch Ultra for a Series 8 as my daily driver, but Apple managed to pack enough features into its prosumer smartwatch to set it apart from its mainstream flagship. —<em> C.L.</em></p><figure><img alt=\"Discord and Twitter app icons are seen in this illustration taken November 7, 2022. REUTERS/Dado Ruvic/Illustration\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/397508a0-7a35-11ed-bffb-090220d94521\" /><figcaption></figcaption><div class=\"photo-credit\">Dado Ruvic / reuters</div></figure><h2>Mastodon</h2><p>Elon Musk’s takeover of Twitter has breathed new life into a number of upstart social platforms. But no other service has benefitted more than Mastodon, the once relatively-obscure site that’s long billed itself as a Twitter alternative.</p><p>Ironically, Mastodon first became prominent back in 2017 after a backlash against Twitter’s decision to remove user handles from character limits (it’s difficult to remember now, but there was a time when these kinds of changes would temporarily spark mass outrage among the Twitter faithful).</p><p>Since then, the decentralized platform has had a small contingent of dedicated users, but was nowhere close to the social media mainstream. That all changed as soon as Musk’s takeover began. Almost overnight, more than 30,000 new users <a href=\"https://www.engadget.com/twitter-alternative-mastodon-open-source-021001965.html\">flooded</a> the platform, and the growth has only intensified since Musk formally took control of Twitter in October. As of November, Mastodon had more than <a href=\"https://twitter.com/joinmastodon/status/1594121627083493378\">2 million</a> users seeking a new home outside of Twitter.</p><p>While that may still be tiny by social media standards, it’s notable that the nonprofit, open-source site is already the preferred alternative for a number of journalists, celebrities and other one-time Twitter power users. Yes, the platform is more complicated than Twitter, and not everyone is eager to <a href=\"https://www.engadget.com/twitter-alternatives-mastodon-223221883.html\">start over</a> on a new site. But it’s impossible to ignore just how good Mastodon’s timing has been. In the span of a few months, it’s gone from niche to mainstream, and for now seems best-poised to absorb the masses fleeing Twitter. —<em> Karissa Bell, Senior editor</em>.</p>", "link": "https://www.engadget.com/biggest-winners-in-tech-2022-170054480.html?src=rss", "date_published": "2022-12-28 17:00:54+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "How to take a screenshot on any device", "description": "<p>It’s a question we’ve all asked ourselves at some point in time: <em>How do I take a screenshot on this thing? </em>There’s a good reason for that, as knowing exactly how to capture that funny text, strange email or high score is eternally useful. And on some devices, it turns out there’s a bit more to taking a screenshot than simply hitting the right button combo.</p><p>Below we’ve put together a comprehensive guide to taking a screenshot on the most popular phone, tablet, PC and gaming platforms, from iOS and macOS to Windows and Android. If you or your less tech-literate loved ones find yourselves forgetting how to get the right shot, consider this an all-in-one resource.</p><span id=\"end-legacy-contents\"></span><h2>How to take a screenshot on an iPhone</h2><figure><img alt=\"A series of images describing how to take a screenshot on various types of iPhone models.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/e51b5c40-7b02-11ed-967f-412029bb4cb5\" /><figcaption></figcaption><div class=\"photo-credit\">Apple</div></figure><p>If you own a recent iPhone without a physical Home button, you can capture a screenshot by pressing volume up and the right side button at the same time. You’ll hear a shutter noise if your sound is on, and you’ll see a small preview of the screenshot in the lower-left corner of the screen. You can then tap on that preview and edit the screenshot as needed.</p><p>With iPhones that <em>do</em> include a Home button, such as the <a href=\"https://www.engadget.com/iphone-se-3-2022-review-battery-life-camera-sample-touch-id-home-button-130047678.html\">iPhone SE</a>, press the<strong>&nbsp;</strong>Home button and right side button at the same time. And for older iPhones whose sleep/wake button is located at the top of the device, press the top button and the Home button at the same time instead.</p><p>For an alternative method, you can also use <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3N1cHBvcnQuYXBwbGUuY29tL2VuLXVzL0hUMjExNzgxIiwiY29udGVudFV1aWQiOiJiN2RhOGQyYS04YmNmLTRlNzctYWI1Zi1hNTBhMDdlNGMyOTUifQ&amp;signature=AQAAAeZFCXdgMq2-ZJSsXl0pgknDa7X1UMANe__ZcX5NLqWU&amp;gcReferrer=https%3A%2F%2Fsupport.apple.com%2Fen-us%2FHT211781\">iOS’ Back Tap feature</a>, which allows you to take a screenshot just by double- or triple-tapping the back of your iPhone. To enable that, go to Settings &gt;<strong>&nbsp;</strong>Accessibility &gt;<strong>&nbsp;</strong>Touch, select Back Tap, and set the Double Tap or Triple Tap settings to Screenshot. You can use this feature to perform other functions as well, such as activating Siri or turning on your flashlight.</p><p>If pressing multiple buttons at once is physically difficult, another option is to use the <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3N1cHBvcnQuYXBwbGUuY29tL2VuLXVzL0hUMjAyNjU4IiwiY29udGVudFV1aWQiOiJiN2RhOGQyYS04YmNmLTRlNzctYWI1Zi1hNTBhMDdlNGMyOTUifQ&amp;signature=AQAAAeLlX-RDkGy1pG1mofs2fxmLfNETPDJvOPMSvJqlTli8&amp;gcReferrer=https%3A%2F%2Fsupport.apple.com%2Fen-us%2FHT202658\">AssistiveTouch feature</a>. This puts a small virtual button on-screen at all times, which you can tap to quickly access various device menus and settings. To activate this, go to Settings &gt; Accessibility &gt; Touch, then set AssistiveTouch to on. From there, you take a screenshot by tapping the AssistiveTouch button, then tapping Device &gt; More &gt; Screenshot.</p><figure><img alt=\"A selection of screenshots on iOS displaying the iPhone's Double Tap feature, Full Page screenshot tool, and AssistiveTouch feature.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/14cb6e50-7b06-11ed-bb9d-87576ed1345d\" /><figcaption></figcaption><div class=\"photo-credit\">Jeff Dunn / Engadget</div></figure><p>There are a couple ways to make this process quicker, though. First, you can go back to your Touch settings, look under Custom Actions, then set the Double-Tap or Long Press<strong>&nbsp;</strong>options to Screenshot. As you can guess, this will let you double-tap or long press the AssistiveTouch button to capture a screenshot. Alternatively, you can go to Customize Top Level Menu and either add or swap in Screenshot. This will make the screenshot function appear in the default menu that pops up whenever you press the AssistiveTouch button.</p><p>Beyond that, you can always ask Siri to capture a screenshot for you. Pulling up the voice assistant – either by saying “Hey Siri” or holding the side or Home button – and saying “take a screenshot” will do the job.</p><p>By default, your screenshot will only capture the visible portion of your display. If you’re reading a larger web page or document and want to capture the whole thing without taking multiple screenshots, though, you can. Just tap the screenshot preview when it pops up, then select Full Page at the top before saving your capture.</p><p>To find your screenshots on an iPhone (or iPad), open Apple's Photos app, go to the Albums tab, scroll down to Media Types, then select Screenshots.</p><h2>How to take a screenshot on an iPad</h2><figure><img alt=\"A series of photos displaying how to take a screenshot on various iPad models.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/c40d7570-7b06-11ed-af9e-61ac192c958a\" /><figcaption></figcaption><div class=\"photo-credit\">Apple</div></figure><p>Taking a screenshot on an iPad is largely similar to what you’d do with an iPhone. If your iPad does not have a Home button, press the top button and either volume button<strong>&nbsp;</strong>at the same time. If there is a Home button, simultaneously press the top button and Home button instead.</p><p>If you have an Apple Pencil, you can also take a screenshot by swiping the stylus up from either corner at the bottom of your display. It’s possible to use this shortcut without a Pencil, too: If you go to General &gt; Gestures, ensure Allow Finger to Swipe From Corner is on, then set either Left Corner Swipe or Right Corner Swipe to Screenshot, you can quickly capture the screen by swiping out from either corner with just your finger.</p><p>Siri and AssistiveTouch are still options, too, though Back Tap is not available on iPadOS.</p><h2>How to take a screenshot on a Mac</h2><figure><img alt=\"A screenshot of a MacBook Air's keyboard, with the keys for utilizing macOS' screenshot tools highlighted.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/29fcb6e0-7b19-11ed-bdda-225c913e5c4f\" /><figcaption></figcaption><div class=\"photo-credit\">Devindra Hardawar / Engadget</div></figure><p>There are multiple ways to take a screenshot on a Mac, most of which depend on how much of the screen you actually want to capture.</p><p>The simplest method is to press and hold Shift + Command + 3 on your keyboard. This will take a snapshot of your entire screen. Again, you’ll see a preview thumbnail in the bottom corner of your display, which you can click on to quickly edit.</p><p>If you only want to screenshot a specific portion of your display, hit Shift + Command + 4. Your mouse cursor will turn into a little crosshair, which you can drag to select the segment of the screen you want to capture. From here, you can do a few things:</p><ul><li><p>If you hold the Space bar while dragging the crosshair, you can reposition the selected capture area while keeping it locked in its current size and shape.</p></li><li><p>If you <em>tap</em> the Space bar, the crosshair will turn into a camera icon. If you move this over an open window or menu, then click, you’ll capture a screenshot of that window or menu alone. By default, these captures will have a border around the edges – if you don’t want that, you can exclude it by holding the Option (⌥) key while clicking.</p></li><li><p>If you hold the Shift key while dragging the crosshair, you’ll lock in the sides of the selected capture area except for one edge. This allows you to more finely adjust the size of your capture before taking the screenshot.</p></li><li><p>You can cancel the screenshot, meanwhile, by hitting the Esc key.</p></li></ul><p>Once you release your trackpad or mouse button, the screenshot will be captured.</p><figure><img alt=\"A screenshot of macOS' Screenshot app, with the option to capture one window highlighted.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/7b663c90-7b19-11ed-9dfd-fb5a8efb7582\" /><figcaption></figcaption><div class=\"photo-credit\">Jeff Dunn / Engadget</div></figure><p>MacOS also includes a dedicated <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3N1cHBvcnQuYXBwbGUuY29tL2d1aWRlL21hYy1oZWxwL3Rha2UtYS1zY3JlZW5zaG90LW1oMjY3ODIvbWFjIiwiY29udGVudFV1aWQiOiJiN2RhOGQyYS04YmNmLTRlNzctYWI1Zi1hNTBhMDdlNGMyOTUifQ&amp;signature=AQAAAdFqhY7zciAP4m5s9-1Kpo4CJg6kzoy91KTRF5bTHyn7&amp;gcReferrer=https%3A%2F%2Fsupport.apple.com%2Fguide%2Fmac-help%2Ftake-a-screenshot-mh26782%2Fmac\">Screenshot app</a>, which you can quickly pull up by pressing Shift + Command + 5. You’ll see a small toolbar with all of the screenshot functions noted above, including icons for capturing the whole screen, one portion or a specific window. There are icons for taking a video that records all or part of the screen, too, plus options for choosing where your screenshots save, turning off the preview thumbnail and so on.</p><p>By default, your captures will save directly to your desktop. If you want to paste a screenshot into another app – say, an iMessage thread – you can copy it to your Clipboard by holding the Control key while capturing. Hitting Shift + Command + Control + 3, for instance, will capture and immediately copy a screenshot of your entire screen, which you can quickly paste elsewhere. Just note that this won’t save the screenshot to your location of choice.</p><p>Finally, if your MacBook has a Touch Bar, you can capture that as well by pressing Shift + Command + 6.</p><h2>How to take a screenshot on an Apple Watch</h2><figure><img alt=\"A series of images displaying how to enable and capture screenshots on an Apple Watch.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/7d9e0950-7b07-11ed-b79f-f4baa8a13739\" /><figcaption></figcaption><div class=\"photo-credit\">Apple</div></figure><p>To take a screenshot on an Apple Watch, you first need to enable the feature, either through the Settings app on the wearable itself or the Watch app on your iPhone. On an Apple Watch, go to Settings &gt; General &gt; Screenshots, then turn on Enable Screenshots. On a paired iPhone, open the Watch app, go to My Watch &gt; General, then scroll down and activate Enable Screenshots.</p><p>Once that’s all set, you can press your watch’s Digital Crown and side button simultaneously to take a screenshot. Your captures will be stored in the Photos app on your iPhone, in the Screenshots folder within the Albums tab.</p><h2>How to take a screenshot on Android</h2><figure><img alt=\"The Pixel 7 is available in three colors: snow, obsidian and lemongrass. The Pixel 7 Pro is available in snow, obsidian and hazel. \" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-10/bc4b3fb2-49c0-11ed-be3f-dd9c7d0326ab\" /><figcaption></figcaption><div class=\"photo-credit\">Sam Rutherford/Engadget</div></figure><p>Not all Android phones and tablets behave the same way, so the exact command for taking a screenshot may differ depending on which device you own. Most of the time, though, you can do the job by briefly pressing the power and volume down buttons at the same time.</p><p>Similarly to iOS, you’ll usually hear a shutter sound from your Android device that confirms the capture, then you’ll see a preview thumbnail that you can edit, share or delete. If you save the screenshot, it will typically reside in your device’s photos app.</p><p>You can also go hands-free by asking the Google Assistant – or an alternative like Bixby on Samsung phones – to “take a screenshot.”</p><p>Many recent Android phones can take scrolling screenshots, letting you capture a full message thread or web page in a manner somewhat similar to the Full Page option on iOS. The feature goes by different names on different devices and can be somewhat finicky, but it often involves taking a screenshot, then tapping an icon with two arrows when the screenshot preview pops up. This icon is labeled “Capture more” on many Android devices, while certain Samsung phones, for instance, call it “<a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=f85e63cd-e13c-4f9d-991c-9fbaadede3ac&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Samsung+Electronics&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiJmODVlNjNjZC1lMTNjLTRmOWQtOTkxYy05ZmJhYWRlZGUzYWMiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuc2Ftc3VuZy5jb20vYXUvZ2V0c3RhcnRlZC9iYXNpYy9zY3JvbGwtY2FwdHVyZS1hLXNjcmVlbnNob3QvIiwiY29udGVudFV1aWQiOiJiN2RhOGQyYS04YmNmLTRlNzctYWI1Zi1hNTBhMDdlNGMyOTUifQ&amp;signature=AQAAAR6aP23TT8lc72L_fYq2hDCyXouxTZxMkR_drMar82pf&amp;gcReferrer=https%3A%2F%2Fwww.samsung.com%2Fau%2Fgetstarted%2Fbasic%2Fscroll-capture-a-screenshot%2F\">Scroll Capture</a>.”</p><figure><img alt=\"A pair of images displaying the \" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/9ac0c7b0-7b0d-11ed-bfec-9cc07be4d800\" /><figcaption></figcaption><div class=\"photo-credit\">Jeff Dunn / Engadget</div></figure><p>There are likely additional ways to take a screenshot on your Android device of choice, but exactly how those work differ by manufacturer. To give some examples:</p><ul><li><p>On recent <a href=\"https://support.google.com/pixelphone/answer/2811098?hl=en\">Google Pixel</a> phones, you can swipe up from the bottom of the screen and hold for a moment to open up the app drawer (or tap the square Overview button, if you’re using <a href=\"https://support.google.com/pixelphone/answer/6073614?hl=en\">Google’s 3-button navigation</a> mode), pick the open app you want to capture, then tap the Screenshot button that appears underneath.</p></li><li><p>On some <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=f85e63cd-e13c-4f9d-991c-9fbaadede3ac&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Samsung+Electronics&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiJmODVlNjNjZC1lMTNjLTRmOWQtOTkxYy05ZmJhYWRlZGUzYWMiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuc2Ftc3VuZy5jb20vdXMvc3VwcG9ydC9hbnN3ZXIvQU5TMDAwMzg3MjEvIiwiY29udGVudFV1aWQiOiJiN2RhOGQyYS04YmNmLTRlNzctYWI1Zi1hNTBhMDdlNGMyOTUifQ&amp;signature=AQAAARuZh--z-Yw21_tarBuVG41ZyqeiuZ6vFBOfVjSqDPn1&amp;gcReferrer=https%3A%2F%2Fwww.samsung.com%2Fus%2Fsupport%2Fanswer%2FANS00038721%2F\">Samsung Galaxy</a> devices, you can take a screenshot just by swiping the edge of your hand across the display. Just go to Settings &gt; Advanced features<strong>&nbsp;</strong>&gt; Motions and gestures, and ensure Palm swipe to capture is turned on first.</p></li><li><p>On select Motorola, OnePlus and Xiaomi phones, there are options for taking a screenshot by swiping down on the screen with three fingers.</p></li></ul><p>If you find your phone is making things difficult, remember that there are <a href=\"https://play.google.com/store/apps/details?id=com.icecoldapps.screenshoteasy&amp;hl=en\">many</a> third-party <a href=\"https://play.google.com/store/apps/details?id=pro.capture.screenshot\">apps</a> that can replicate screenshot features that are native on other devices.</p><h2>How to take a screenshot on Windows</h2><figure><img alt=\"A photo of the Print Screen button on a keyboard.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/096eb3a0-7b0b-11ed-b3d5-71920f92c695\" /><figcaption></figcaption><div class=\"photo-credit\">Jeff Dunn / Engadget</div></figure><p>The most straightforward way to take a screenshot on a Windows PC is to press the Print Screen (PrtScn) button. This will copy a full-screen capture to your clipboard, which you can then paste in any program that accepts images (Microsoft Paint, a Twitter DM, et al.). To do the same thing, but only for one active window, press Alt + Print Screen<strong>&nbsp;</strong>instead.</p><p>Pressing the Windows key and Print Screen, meanwhile, will take a full-screen screenshot that saves directly to your PC, instead of only being available via the clipboard. You’ll know this worked if your screen goes dim for a moment. You can then find the image by going to File Explorer (Windows key + E) &gt; Pictures (under “This PC”) &gt; Screenshots.</p><p>Note that you can also make screenshots automatically save to Microsoft OneDrive. To do this, click the OneDrive cloud icon in your taskbar, go to Settings (the gear icon) &gt; Backup, then check Automatically save screenshots I capture to OneDrive. If you don’t like having to manually paste PrtScn screenshots from your clipboard, this is an alternative way to avoid it, provided you don’t mind using cloud storage.</p><figure><img alt=\"A screenshot of the Snipping Tool feature on Windows 11.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/36a50bc0-7b11-11ed-b9f6-5b4659d5d4a7\" /><figcaption></figcaption><div class=\"photo-credit\">Jeff Dunn / Engadget</div></figure><p>For partial screenshots, press the Windows key + Shift + S to bring up the <a href=\"https://support.microsoft.com/en-us/windows/open-snipping-tool-and-take-a-screenshot-a35ac9ff-4a58-24c9-3253-f12bac9f9d44\">Snipping Tool</a> (or, in Windows 10, the Snip &amp; Sketch app). This dims the screen and presents a small menu with options for a rectangular, freely drawn, single window or full-screen snip. The first two of those let you click and drag a cursor around the specific portion of the screen you want to capture. (The rectangular option is generally tidier than the freeform one.) Once you release your mouse button or trackpad, you’ll take the screenshot.</p><p>When you take a screenshot with the Snipping Tool, you’ll see a preview thumbnail in the bottom corner of the display. Clicking that will let you edit the image in myriad ways, save it to a specific folder and so on. By default, though, any screenshots taken through the Snipping Tool will automatically save to both the clipboard and your Screenshots folder.</p><p>If you find yourself using the Snipping Tool often, note that you can set the Print Screen button to open the app. Just go to Settings &gt; Accessibility &gt; Keyboard, then turn on Use the Print screen button to open screen snipping.</p><p>If your keyboard doesn’t have a Print Screen button, you can press Fn + the Windows key + Space<strong>&nbsp;</strong>to take a screenshot. On recent Microsoft Surface devices, meanwhile, you can also hit volume up + the power button at the same time. Both of these methods will save your captures to the Screenshots folder noted above.</p><figure><img alt=\"A screenshot of the Xbox Game Bar feature in Windows 11.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/97f3ef40-7b11-11ed-bd8e-58d717df7070\" /><figcaption></figcaption><div class=\"photo-credit\">Jeff Dunn / Engadget</div></figure><p>Finally, you can take a screenshot via the <a href=\"https://support.xbox.com/en-US/help/games-apps/game-setup-and-play/get-to-know-game-bar-on-windows-10\">Xbox Game Bar</a>, an overlay with quick links to various functions and settings, many of which are aimed at gaming. You can pull this up by pressing the Windows key + G. From there, select Capture (the icon in the middle that looks like a webcam) and hit the Take screenshot button (the camera icon) to take a full-screen capture. You can also hit Windows key + Alt + Print Screen<strong>&nbsp;</strong>to capture a screenshot through the Game Bar without having to open up the overlay.</p><p>Any Game Bar screenshots are saved to File Explorer<strong>&nbsp;</strong>&gt; Videos &gt; Captures on your PC, though you can also find them by going back and clicking Capture in the Game Bar itself, then clicking See my captures in the resulting menu. Note that you can create screen recordings through this Capture menu as well.</p><p>As of this writing, using the Capture menu in the Game Bar is also the simplest native method of taking a screen recording in Windows. However, Microsoft <a href=\"https://www.theverge.com/2022/12/8/23500753/microsoft-windows-11-screen-recorder-snipping-tool\">recently confirmed</a> plans to add a video recording option to the Snipping Tool in the near future. The company says you’ll be able to record your entire screen or just a cropped section when the feature fully rolls out.</p><h2>How to take a screenshot on a Chromebook</h2><figure><img alt=\"A photo of a Samsung Chromebook's keyboard, with the keys used to bring up the ChromeOS Screen Capture highlighted.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/72a9ac60-7b17-11ed-b6ff-47d7e1a611cb\" /><figcaption></figcaption><div class=\"photo-credit\">Nathan Ingraham / Engadget</div></figure><p>In most cases, the fastest way to take a screenshot on a Chromebook is to press the Control (Ctrl) and Show Windows keys at the same time. This grabs a shot of your entire screen. As a reminder, the Show Windows key looks like a rectangle with two lines next to it. It’s often located where the F5 key would be on a Windows PC.</p><p>Hitting Shift + Control + Show Windows, meanwhile, opens up ChromeOS’ Screen Capture toolbar. This presents a menu with options to capture all of your screen, a specific portion or a single open window. It also gives you the ability to take a recording of part or all of your screen. You can get to these tools through your Chromebook’s Quick Settings menu as well. To access that, click the time in the lower right corner of the screen, then click the Screen Capture icon that appears in the resulting menu.</p><figure><img alt=\"A screenshot of the Screen Capture feature on ChromeOS.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/47b93ab0-7b13-11ed-9e26-1af4484d3ae9\" /><figcaption></figcaption><div class=\"photo-credit\">Google</div></figure><p>Note that some Chromebooks have a dedicated Screenshot key, which looks like a rectangle with a circle in the middle. If your device has it, you can just press that button instead of the three-button shortcut above. If you have a ChromeOS tablet, you can take a screenshot by hitting the power and volume down buttons simultaneously. And if you’re using an external keyboard, you can press Ctrl + F5 to take a full-screen capture, or Ctrl + Shift + F5<strong>&nbsp;</strong>to pull up the Screen Capture menu and/or grab a partial screenshot.</p><p>Once you take a screenshot, ChromeOS will automatically copy it to your clipboard, and you’ll see it appear in a small window in the bottom corner of the display, from which you can edit or delete the capture. Recent screenshots will appear in a holding area on your taskbar – or “shelf,” in Chromebook parlance – called <a href=\"https://blog.google/products/chromebooks/chromebook-keeps-important-files-at-your-fingertips/\">the Tote</a>, while all of your captures will go to your Downloads folder by default.</p><h2>How to take a screenshot on a Nintendo Switch</h2><figure><img alt=\"A Nintendo Switch OLED console, with the Capture button highlighted.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/080560d0-7b25-11ed-97bb-b6b1fa13430b\" /><figcaption></figcaption><div class=\"photo-credit\">Kris Naudus / Engadget</div></figure><p>Taking a screenshot on a Nintendo Switch is easy: Just press the square Capture button. This is located underneath the directional buttons/D-pad on the left-side controller of a Switch, Switch OLED or Switch Lite. You can also take a video of your last 30 seconds of gameplay by holding the Capture button down for a moment. As with most game consoles, note that you won’t be able to take a screenshot in certain apps and, occasionally, at specific moments in some games.</p><p>You can find your captures by going to the Switch’s home menu and selecting the Album icon at the bottom of the display. It’s the one that looks like a blue photo.</p><p>You can <a href=\"https://en-americas-support.nintendo.com/app/answers/detail/a_id/53664/~/how-to-transfer-screenshots-and-video-captures-to-a-computer-via-a-usb-cable\">transfer a screenshot</a> from your Switch to a computer with a USB cable. Go to the home menu, select the System Settings icon, then go to Data Management &gt; Manage Screenshots and Videos &gt; Copy to a Computer via USB Connection. Then, connect the Switch to your computer through an appropriate cable and copy it from there for sharing and the like.</p><figure><img alt=\"A capture of the Manage Screenshots and Videos menu on the Nintendo Switch.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/0a5af520-7b1b-11ed-adf5-70fa94e47cee\" /><figcaption></figcaption><div class=\"photo-credit\">Jeff Dunn / Engadget</div></figure><p>You can also transfer screenshots with a microSD card. If you have one installed in your Switch, go back to Manage Screenshots and Videos. From here, select Save Location to ensure your captures are saved to the microSD card, which you can remove and insert in other devices to access your captures. (Per usual, you may need an adapter to use the card on devices without a proper microSD slot.) Use the path “\\Nintendo\\Album” to find the captures on the card. To copy screenshots from the Switch’s internal storage to a microSD card, go back to Manage Screenshots and Videos, then select System Memory &gt; Copy All Screenshots and Videos to microSD card. This might take a few moments to complete.</p><p>To transfer a specific screenshot, go to Album from the home screen, go to the capture you want to share, then hit A to bring up the Sharing and Editing menu. From here, you can select Copy to copy the screenshot to a microSD card (if it’s not there already), Send to Smartphone to wireless send one or a small batch of captures to your phone via QR codes, or Post to directly (and slowly) post a capture to a connected Facebook or Twitter account.</p><h2>How to take a screenshot on a PlayStation 5</h2><figure><img alt=\"A photo of the PlayStation 5 DualSense controller, with the Create button highlighted.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/2ab4c5d0-7b25-11ed-97cc-f980923a120a\" /><figcaption></figcaption><div class=\"photo-credit\">Aaron Souppouris / Engadget</div></figure><p>By default, you can take a screenshot on a PS5 by pressing and holding the Create button on your DualSense controller. This is the thin button located just above the D-pad. (On the PS4, it was labeled Share.) When you release the Create button, you’ll see a confirmation icon if the screenshot was taken successfully.</p><p>As an alternative, you can briefly press the Create button once, then select Take Screenshot in the small menu that pops up at the bottom of the screen.</p><p>Among <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy5wbGF5c3RhdGlvbi5jb20vZW4tdXMvc3VwcG9ydC9nYW1lcy9jYXB0dXJlLXBzNS1nYW1lcGxheS1zY3JlZW5zaG90cy8jY3JlYXRlIiwiY29udGVudFV1aWQiOiJiN2RhOGQyYS04YmNmLTRlNzctYWI1Zi1hNTBhMDdlNGMyOTUifQ&amp;signature=AQAAATkOquW-A9qmc55jgT9L-aQYaqGtnHJR9h_NcsZmY6gX&amp;gcReferrer=https%3A%2F%2Fwww.playstation.com%2Fen-us%2Fsupport%2Fgames%2Fcapture-ps5-gameplay-screenshots%2F%23create\">other things</a>, this menu also lets you take a video recording of your recent gameplay. If you want to capture something that just happened, select Save Recent Gameplay and choose the appropriate video length. You can also do this by double-tapping the Create button. If you want to start recording future gameplay, select Start New Recording, then go back to the menu and select Stop Recording to do just that.</p><figure><img alt=\"A screenshot of the Shortcuts for Create Button menu on the PlayStation 5.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/8f078990-7b1c-11ed-8f6f-8f92d2041a20\" /><figcaption></figcaption><div class=\"photo-credit\">Jeff Dunn / Engadget</div></figure><p>If you find these default methods to be too slow to reliably capture fast-paced gameplay, you can reconfigure how the Capture button works. To do this, go to the PS5’s Settings menu – which is easily accessible by selecting the gear icon in the upper-right corner of the home screen – then go to Captures and Broadcasts &gt; Captures &gt; Shortcuts For Create Button &gt; Button mapping and select the option you want. My preference is the “Easy Screenshots” configuration, which makes it so <em>tapping</em> the Create button once takes a screenshot, holding it brings up the create menu, and tapping it twice saves a video of recent gameplay. (The default length of video clips is configurable in the Shortcuts for Create Button menu as well.)</p><p>All of your PS5 screenshots and videos automatically save to a somewhat tricky-to-find app called Media Gallery. One way to get there is by scrolling to the far end of the PS5’s home screen and selecting Game Library, then opening it up within that. Another is to go back to Settings, then select Storage &gt; Console Storage &gt; Media Gallery. If you click the PS logo button on your controller shortly after taking a screenshot, you can reach the Media Gallery through the New screenshot card that’ll pop up in the <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy5wbGF5c3RhdGlvbi5jb20vZW4tdXMvc3VwcG9ydC9nYW1lcy9jdXN0b21pemUtcHM1LWNvbnRyb2wtY2VudGVyLyIsImNvbnRlbnRVdWlkIjoiYjdkYThkMmEtOGJjZi00ZTc3LWFiNWYtYTUwYTA3ZTRjMjk1In0&amp;signature=AQAAAQebMeTlYKvSCj-aSFUT3CZpDWExXVd8-ANa7FfiZgqs&amp;gcReferrer=https%3A%2F%2Fwww.playstation.com%2Fen-us%2Fsupport%2Fgames%2Fcustomize-ps5-control-center%2F\">control center</a> menu, too.</p><figure><img alt=\"A sample screenshot of a game in the Media Gallery app on PlayStation 5, with the Share option highlighted.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/ac3ccd40-7b1c-11ed-bffd-94e9fb1c1a2d\" /><figcaption></figcaption><div class=\"photo-credit\">Jeff Dunn / Engadget</div></figure><p>However you get to it, you can share your screenshots from the Media Gallery by hovering over a specific capture, hitting the Options button (the thin button opposite the Create button), and selecting Share. You can then send a screenshot to Twitter, a video to Twitter or YouTube, or either to folks on your PlayStation friends list as a PS5 message. This Share option is available through the New screenshot control center card as well. (It’s the arrow icon.) You can copy captures to a connected USB drive from the Media Gallery as well, which may be the most convenient option if you’re looking to send a batch of screenshots and videos to a computer.</p><p>It’s also possible to make the PS5 automatically send screenshots to your phone. First, you have to download the PlayStation app on iOS or Android and link it to your PS5 console. In the app, go to the Game Library tab, hit the Captures toggle at the top, then tap Enable. Then, on the PS5, go to Settings &gt; Captures and Broadcasts &gt; Captures and ensure Auto-Upload is activated. Any captures you manually take on your PS5 will now go straight to the app – but photos will only stay there for 14 days, and video clips must be less than three minutes long.</p><h2>How to take a screenshot on an Xbox Series X/S</h2><figure><img alt=\"A photo of the Xbox Series X/S controller, with the Share button highlighted.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/58346ab0-7b25-11ed-9ebf-f87888411bdf\" /><figcaption></figcaption><div class=\"photo-credit\">Aaron Souppouris / Engadget</div></figure><p>To take a screenshot on an Xbox Series X/S, simply tap the Share button on your controller while playing a game. To take a video recording, press and hold the Share button. (It will capture the last 30 seconds of gameplay by default.) If you double-tap the Share button, meanwhile, you’ll bring up a list of your recent screenshots and video clips.</p><p>If you’re using an older Xbox One gamepad without a dedicated Share button, press the Xbox logo button on your controller while playing a game to bring up the <a href=\"https://support.xbox.com/en-US/help/hardware-network/getting-started-set-up/using-the-guide\">Xbox guide</a> menu, then press Y to capture a screenshot or X to record your last 30 seconds of gameplay. If you want to record a longer stretch of gameplay, hit the View button (the one with two rectangles) and select the duration you want. You can still use the guide to capture screenshots and videos with a Series X/S controller, though naturally it’ll be slower than just hitting a button.</p><figure><img alt=\"A capture of the various screenshot shortcuts available on an Xbox Series X/S.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/067a2260-7b24-11ed-86ff-94e09dd19118\" /><figcaption></figcaption><div class=\"photo-credit\">Jeff Dunn / Engadget</div></figure><p>This guide menu allows you to record upcoming gameplay as well. For that, press the Xbox logo button on your controller, go to the Capture &amp; share tab on the right side of the guide, then select Start recording. (If you want, you can also take a screenshot or record recent gameplay from here, too.) To end the recording, open the guide back up with the Xbox logo button, then press the X button. Note that your recordings and screenshots will start and stop from the moment you press the Xbox logo button, not when you press Y or X afterwards.</p><p>In any event, you’ll see a notification appear once you’ve taken your screenshot or video clip. If you hold the Xbox logo button on your controller while this banner is on-screen, you’ll open up the Share menu. This lets you quickly share the capture to your Xbox activity feed or an <a href=\"https://support.xbox.com/en-US/help/friends-social-activity/share-socialize/join-club\">Xbox club</a>, attach it to a message, post it directly to Twitter, or send it to your OneDrive account. You can trim video clips, set a capture as a background or delete it from here as well.</p><figure><img alt=\"A screenshot of the Share menu for screenshots on an Xbox Series X/S.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/f0581690-7b23-11ed-9bd7-ebff121087c2\" /><figcaption></figcaption><div class=\"photo-credit\">Jeff Dunn / Engadget</div></figure><p>If you download the Xbox mobile app and link it to your account, you can also use the Share menu to send screenshots and video clips straight to your phone. Just select Mobile. Once the capture hits your phone, you’ll see quick links for easily sharing or downloading it right from the Xbox app. To see all of your Xbox screenshots and video recordings in the app, go to the My Library tab – the one with the icon that looks like three books – then select Captures.</p><p>If you just want to keep playing, know that you can access these screenshot management options at any time. Just hit the Xbox logo button, move to the Capture &amp; share tab, then select Share last capture or Recent captures, selecting a screenshot or video to share and/or edit from there. As noted above, you can also double-tap the Share button on an Series X/S controller to open the Recent captures menu.</p><figure><img alt=\"A screenshot of the Capture &amp; share menu on an Xbox Series X/S.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/996d6ab0-7b23-11ed-baf7-b75b6ab7216b\" /><figcaption></figcaption><div class=\"photo-credit\">Microsoft</div></figure><p>It’s possible to change the default length of video recordings in your Xbox’s settings. You can get there by selecting the gear icon at the top right of the home screen. Alternatively, you can hit the Xbox logo button, move to the Profile &amp; system tab – it’s on the right in the guide menu – then select Settings in the middle of the menu. Then, go to Preferences &gt; Capture &amp; share &gt; Record what happened, then select whatever duration you prefer.</p><p>The Capture &amp; share menu is also where you can, among other options, turn off automatic uploading of screenshots to the Xbox network. Be aware that Xbox screenshots must be uploaded to the network in order to be shared in the first place, so if you deactivate this setting, you’ll have to manually upload any individual screenshot or video you want to share going forward. Still, this can save you from seeing a bunch of pop-up notifications while playing.</p><figure><img alt=\"A screenshot of the Button mapping menu on an Xbox Series X/S.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/c4127850-7b23-11ed-bffe-bc431725d158\" /><figcaption></figcaption><div class=\"photo-credit\">Microsoft</div></figure><p>To see all of the screenshots and video clips on your Xbox console, go to the Captures app. To get there, double-tap the Share button to get to the Recent captures menu, then select Show all at the bottom. Or, press the Xbox logo button, then select My games &amp; apps &gt; See all &gt; Apps &gt; Captures. (It’ll look like a gamepad in front of a film strip.) Either way, once you’re there, hover over a capture and hit the Menu button on your controller (the one with three horizontal lines) to access options for sharing, deleting, copying to external storage, uploading to OneDrive, etc. You can also select Manage at the top to more easily delete or upload captures in bulk.</p><p>To customize how the Share button behaves, use the Xbox Accessories app. You can get to this by selecting Button mapping in the Capture &amp; share menu, or by going back to the Apps menu and selecting the app icon with a joystick on it. If you do the latter, select your controller, then select the pen icon to edit your profile. Now you can make it so double-tapping the Share button starts and stops a recording, to give one example.</p><h2>Using third-party tools to capture and share screenshots</h2><figure><img alt=\"A screenshot of the ShareX app on Windows 11.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/0aa1b130-7b12-11ed-9f9e-270711a5154b\" /><figcaption></figcaption><div class=\"photo-credit\">ShareX</div></figure><p>For the most part, it’s straightforward enough to share your screenshots directly from the built-in tools on most platforms. That said, it’s worth remembering that there are third-party alternatives on some OSes that can make the process a bit easier.</p><p><a href=\"https://getsharex.com/\">ShareX</a>, for example, is worth a shout. It’s a free and open-source program with all the screen capture options as Windows’ Snipping Tool, plus a range of after-capture editing tools. Notably, it also allows you to directly upload (and delete) captures to image hosting services like Imgur (with easily shareable URLs), apps like Twitter and Google Photos, cloud storage lockers like Dropbox and more. You can make it so captures automatically go to these destinations, too.</p><p><a href=\"https://www.dropbox.com/capture\">Dropbox Capture</a>, meanwhile, puts quick options for taking screenshots, video recordings and audio recordings in your taskbar, then lets you copy (either as an image or URL) and/or download your captures for easy sharing right from there. There are plenty more options beyond that, so if you find yourself needing a little extra power, you aren’t necessarily limited – though, as always, you should exercise caution with lesser-known services that may carry <a href=\"https://www.wired.co.uk/article/lightshot-chrome-screenshot-app\">privacy risks</a>.</p>", "link": "https://www.engadget.com/how-to-take-a-screenshot-on-any-device-163053556.html?src=rss", "date_published": "2022-12-28 16:30:53+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "The best apps on Android and iOS to download on your new smartphone", "description": "<p>Whether you just got your hands on a new phone or want to give your current device a makeover, the easiest way to make the most of your smartphone is to try out new apps. The tricky part is not going overboard and installing too many. Below you'll find a dozen of the best smartphones apps we think you should try.</p><h2>Bitwarden</h2><figure><img alt=\"Bitwarden\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/ef0219c0-7af2-11ed-b9fd-e7ffad70a604\" /><figcaption></figcaption><div class=\"photo-credit\">Bitwarden</div></figure><p>If you only take one piece of advice away from this article, it's that you should download a <a href=\"https://www.engadget.com/2019-08-26-the-best-password-managers-compared.html\">password manager</a>. If you’ve never used one before, it’s hard to go wrong with <a href=\"https://bitwarden.com/\">Bitwarden</a>. It won’t wow you with beautifully designed apps, but you’ll appreciate its fair business model. The best part of the Bitwarden experience is that all of its core features are free to use. Without paying a cent, you can use Bitwarden on as many devices as you want. By comparison, LastPass charges <a href=\"https://www.engadget.com/lastpass-free-one-device-type-limitation-161122381.html\">$3 per month</a> for that same functionality. If you want to support Bitwarden, the $10 per year Premium plan is well worth the money as you get access to features like advanced two-factor authentication.</p><span id=\"end-legacy-contents\"></span><h2>FireFox</h2><figure><img alt=\"Firefox\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2021-12/70bf40d0-5e8b-11ec-b7f2-8f47f6b4d1e4\" /><figcaption></figcaption><div class=\"photo-credit\">Firefox</div></figure><p>If it's been a few years since you last used Firefox, now is a great time to revisit it. Partway through last year, Mozilla <a href=\"https://www.engadget.com/firefox-for-android-update-080007893.html\">overhauled the Android version</a> of its browser to bring over many of its best desktop features to mobile. That release saw Mozilla add more robust support for third-party add-ons. It also brought over its Enhanced Tracking Protection feature, which stops trackers from misusing your browsing data. Separately, with Apple allowing you to change your default browser since the <a href=\"https://www.engadget.com/mozilla-firefox-ios-14-130014162.html\">release of iOS 14</a>, there's never been a better time for iPhone users to liberate themselves from Safari.</p><h2>Headspace</h2><figure><img alt=\"Headspace\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2021-11/d4f45440-46e5-11ec-bfbf-ee0b432e89b8\" /><figcaption></figcaption><div class=\"photo-credit\">Headspace</div></figure><p>I subscribed to <a href=\"https://shopping.yahoo.com/rdlw?merchantId=e3494264-16cf-476b-92a8-2dfe2c12bfa0&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Headspace&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiJlMzQ5NDI2NC0xNmNmLTQ3NmItOTJhOC0yZGZlMmMxMmJmYTAiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuaGVhZHNwYWNlLmNvbS8iLCJjb250ZW50VXVpZCI6IjFlOTliZmFkLTI1MjgtNDkxNC05MmNhLTM0YWU5NmUzZjcwMiJ9&amp;signature=AQAAAUB81IwF-h2-nemQklBZwb3WiMnD0dEgO8Y_2tblCigl&amp;gcReferrer=https%3A%2F%2Fwww.headspace.com%2F\">Headspace</a> at the start of the pandemic. Since then, it's become one of the few apps I use every day. Yes, Headspace is a meditation and mindfulness app, but it's also so much more than that. You'll find it also has a mix of music designed to help you focus and workouts for unwinding at the end of a long day. Across the board, everything it offers is excellent, and you'll find yourself turning to it for more than just peace of mind.</p><h2>Notion</h2><figure><img alt=\"Notion\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/286199c0-7af3-11ed-87ee-365c783084fc\" /><figcaption></figcaption><div class=\"photo-credit\">Notion</div></figure><p><a href=\"https://www.notion.so/\">Notion</a> is one of the most powerful productivity tools you can download right now, and if your goal for 2023 is to organize your personal and professional lives, I can’t recommend it enough. What makes Notion so powerful is an interface that looks simple but offers a lot of flexibility. I’ve used Notion to create to-do lists, write notes and features and manage personal projects. It can be a bit overwhelming at first. My suggestion is to head over to <a href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy55b3V0dWJlLmNvbS93YXRjaD92PUlySUFtcTgwVkVFJmFiX2NoYW5uZWw9UHJvZHVjdGl2ZUR1ZGUiLCJjb250ZW50VXVpZCI6IjFlOTliZmFkLTI1MjgtNDkxNC05MmNhLTM0YWU5NmUzZjcwMiJ9&amp;signature=AQAAAVjvVix8fOfVFTAOoTf9kbG6JU4b_Z_QhFktGf3m4dGI&amp;gcReferrer=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DIrIAmq80VEE%26ab_channel%3DProductiveDude\">YouTube</a> to see how other people have used Notion’s features to organize their lives.</p><h2>Libby</h2><figure><img alt=\"Libby\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2021-05/c0443760-abf7-11eb-97bf-2c309f64c2f9\" /><figcaption></figcaption><div class=\"photo-credit\">Libby</div></figure><p>If you want to do more reading in 2022, forget about buying books through Amazon and <a href=\"https://www.engadget.com/libby-app-irl-123053789.html\">download Libby</a> instead. If you're not familiar with the <a href=\"https://fave.co/334ap89\">app</a>, it allows you to borrow ebooks, digital magazines and graphic novels from your local library. All you need is a library card, which most systems across the US offer for free. Sometimes you have to wait to borrow the books you want to read most, but you'll find Libby will dramatically expand your reading list.</p><h2>Transit</h2><figure><img alt=\"Transit app\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2021-12/cb70ae20-5e8a-11ec-9e7f-3374adcb4d05\" /><figcaption></figcaption><div class=\"photo-credit\">Transit</div></figure><p>There's nothing worse than waiting for a bus on a cold winter’s day or watching three go by one after another. Avoid both situations with one of the best public transit planning apps on Android and iOS. <a href=\"https://transitapp.com/\">Transit</a> excels where other apps in the category fail thanks to its clean, easy-to-use interface that highlights all the options near you. It also has one of the better algorithms for predicting departure times, so you'll know exactly when you need to run out of your house or apartment to catch the next bus, train or streetcar.</p><h2>Paprika</h2><figure><img alt=\"Paprika recipe app\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2021-12/7d220790-5e8b-11ec-9beb-3edf6f0f6641\" /><figcaption></figcaption><div class=\"photo-credit\">Paprika</div></figure><p><a href=\"https://www.paprikaapp.com/\">Paprika</a> is the best $5 you can spend to make feeding yourself even easier. At its core, it allows you to download recipes from your favorite websites and make them accessible on all your devices. You can also use it to scale the size of the meal you're about to cook and convert between metric and imperial measurements. Add to that a meal planner, shopping lists and a tool for tracking the ingredients in your pantry, and you have an indispensable app for home cooks.</p><h2>Pocket Casts</h2><figure><img alt=\"Pocket Casts app\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2021-12/d991c6b0-5e8a-11ec-b69f-401c90e23326\" /><figcaption></figcaption><div class=\"photo-credit\">Pocket Casts</div></figure><p>With podcasts becoming ever more popular with each passing year, there's a good chance you already have a handful of favorite shows you listen to every week. As much as Spotify would like to convince you it has the best podcast app, that distinction goes to <a href=\"https://pocketcasts.com/\">Pocket Casts</a>. We like it because it offers a consistently great experience across every system it supports. And if you use a mix of platforms from Apple, Google and Microsoft, you don't have to worry about syncing, either. It’s also nice to use software that doesn’t feel caught between two worlds in the way that Spotify does. Pocket Casts isn’t trying to be anything more than an app for listening to podcasts. That’s not something you can say of Spotify, and it’s often a source of frustration for those who turn to it for music.</p><h2>Pocket</h2><figure><img alt=\"Pocket app\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2021-12/e72ebb20-5e8a-11ec-bbbd-79f45195740b\" /><figcaption></figcaption><div class=\"photo-credit\">Pocket</div></figure><p>Another way to read more in 2022 is to download <a href=\"https://getpocket.com/en/\">Pocket</a>. It's among the most popular read-it-later apps out there, allowing you to save articles you find online. Much like Pocket Casts, what makes this app compelling is that it offers a consistently excellent device-agnostic experience, making it a great option for those who haven't gone all-in on one ecosystem. Whether you use Chrome, Safari or Edge, you can install a browser extension to save articles you stumble upon. You can then read them later without distractions on your phone or tablet. Just don't forget to make a dent in your Pocket reading list occasionally.</p><h2>Signal</h2><figure><img alt=\"Signal\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/a831c8f0-7af3-11ed-beef-921dc52ddb63\" /><figcaption></figcaption><div class=\"photo-credit\">Signal</div></figure><p>We understand, asking your friends and family to install another messaging app on their phone can sometimes feel like a Sisyphean task, but the effort has also never been more worth it. In <a href=\"https://signal.org/en/\">Signal</a>, you'll find one of the most secure chat apps on the market. It has all the features you would expect from a messaging program, including support for stickers and <a href=\"https://www.engadget.com/signal-stories-release-095559625.html\">Snapchat-like Stories</a>, but more important are the ways Signal is different from rivals like WhatsApp and Telegram. Signal is a nonprofit and is one of the few apps committed to privacy rather than revenue via data collection. That means you won’t see any ads in the app, nor will the company sell your data to third-party marketers.</p><h2>Tunnelbear</h2><figure><img alt=\"Tunnelbear for Android\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2020-07/fbcd8330-c5df-11ea-9f7b-2d20663edfe1\" /><figcaption></figcaption><div class=\"photo-credit\">Tunnelbear</div></figure><p>After a Password manager, one of the best tools you can use to safeguard your online privacy is a VPN. Again, there are many options out there, but we like <a href=\"https://shopping.yahoo.com/rdlw?merchantId=1c695770-3d23-4adf-9f4f-c595e9124f3b&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=TunnelBear&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiIxYzY5NTc3MC0zZDIzLTRhZGYtOWY0Zi1jNTk1ZTkxMjRmM2IiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cudHVubmVsYmVhci5jb20vPyIsImNvbnRlbnRVdWlkIjoiMWU5OWJmYWQtMjUyOC00OTE0LTkyY2EtMzRhZTk2ZTNmNzAyIn0&amp;signature=AQAAAT46eqIsRD06scQMBOxjm3a4IpRgz22lKWAzYc_xceAM&amp;gcReferrer=https%3A%2F%2Fwww.tunnelbear.com%2F%3F\">TunnelBear</a> for its simplicity and whimsical ursine theme. A VPN isn't as essential as a password manager, but you'll want to get one if you frequently find yourself traveling or using the public WiFi at places like cafes and libraries. Using a VPN in those contexts will ensure your connection is protected with encryption so that any information you send over remains safe and private.</p><h2>Snapseed</h2><figure><img alt=\"Snapseed\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2021-12/465381b0-5f46-11ec-b3ff-47f3a4374f8c\" /><figcaption></figcaption><div class=\"photo-credit\">Snapseed</div></figure><p>Most recent phones come with great cameras. Still, even with the latest iPhone, Samsung Galaxy or Google Pixel, almost every photo can benefit from an edit before you share it. The options you have for photo editing apps are nearly endless, but if you want something that works well, look no further than <a href=\"https://apps.apple.com/us/app/snapseed/id439438619\">Snapseed</a>. It's an old favorite that offers a comprehensive suite of editing options but never gets bogged down in too many sliders and dials. Best of all, it makes it easy to save edits to your camera roll and upload them to apps like Instagram.</p>", "link": "https://www.engadget.com/best-apps-to-download-on-your-new-smartphone-ios-android-180049321.html?src=rss", "date_published": "2022-12-28 15:21:05+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "Movano takes on Oura with the Evie smart ring designed 'for women'", "description": "<p>Health company Movano has <a href=\"https://www.prnewswire.com/news-releases/movano-health-unveils-evie-first-medical-grade-smart-ring-designed-uniquely-for-women-301710396.html\">teased</a> its first smart ring, the Evie, designed for health, fitness and cycle tracking. It looks like a rival to <a href=\"https://www.engadget.com/oura-ring-version-3-150032257.html\">Oura's latest smart ring</a> and other health-tracking wearables, though the company says it's &quot;designed uniquely for women.&quot; Movano plans to provide a closer look next week at CES 2023.</p><p>The ring made its <a href=\"https://www.digitaltrends.com/mobile/movano-stacy-salvi-interview-smart-ring-wearables/\">debut</a> at CES 2022 with no name and a similar design, but Movano has since changed course on price and other factors. It will sell the ring sometime in 2023 at a one-time price below $300 (there's no exact date or price yet), rather than using a subscription model as it said last year.&nbsp;</p><span id=\"end-legacy-contents\"></span><p>It offers many of the health metrics seen on Oura's ring and wearables from Apple and others. It can measure heart rate, blood-oxygen, skin temperature variability, steps, calories, sleep, period and ovulation tracking, and more. Wearers will can get advice from health experts inside the app and it will meet medical device manufacturing standards, the company promised.</p><p>&quot;As a medical device, Evie will go beyond the status quo of other wearables on the market,&quot; said Movano CEO John Mastrototaro. &quot;We are bringing together medical grade biometric data and insights in a comfortable and contemporary wearable.&quot;</p><p>With the ability to measure steps, calories burned and specific activities, Evie can also be used as a fitness tracker. However, it's primary purpose is to give a picture of overall health, &quot;turning biometric data into actionable insights,&quot; Movano wrote in the press release.</p><p>The company also promises security and privacy when transferring data to the cloud or health providers. It's currently seeking all-important FDA clearance, which will dictate the release date. If that takes too long, though, it may come to market as a wellness device at first. The Evie smart ring will only be released in the US to start with, but may come to other markets later — we should learn more about it next week at CES 2023.&nbsp;</p>", "link": "https://www.engadget.com/movanos-evie-is-a-medical-grade-smart-ring-143638956.html?src=rss", "date_published": "2022-12-28 14:36:38+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "The Morning After: Biometric devices with military data were being sold on eBay", "description": "<p>German researchers who purchased <a href=\"https://www.engadget.com/report-iris-scanners-sold-on-e-bay-contained-sensitive-biometric-data-102418292.html\">biometric capture devices on eBay</a> found sensitive US military data stored on the machine’s memory cards. According to <em>The New York Times</em>, that included fingerprints, iris scans, even photographs, names and descriptions of the individuals, mostly from Iraq and Afghanistan. Many individuals worked with the US army and could be targeted if the devices fell into the wrong hands, according to the report. One device was purchased at a military auction, and the seller said they were unaware that it contained sensitive data. There was an easy solution too: The US military could have eliminated the risk by simply removing or destroying the memory cards before selling them.</p><p>– Mat Smith</p><h3>The biggest stories you might have missed</h3><ul><li><p><a href=\"https://www.engadget.com/1010-music-razzmatazz-review-tiny-delightful-pink-drum-machine-140013901.html\"><ins>Razzmatazz review: A delightful (and delightfully pink) drum machine</ins></a></p></li><li><p><a href=\"https://www.engadget.com/best-nintendo-switch-oled-accessories-150048703.html\"><ins>The best accessories for Nintendo’s Switch OLED</ins></a></p></li><li><p><a href=\"https://www.engadget.com/lg-sc9-se6-soundbar-dolby-atmos-ces-2023-010041269.html\"><ins>LG's 2023 soundbars offer Dolby Atmos and wireless TV connections </ins></a></p></li><li><p><a href=\"https://www.engadget.com/uplift-standing-desk-irl-163028001.html\"><ins>What we bought: The standing desk I chose after a lot of research</ins></a></p></li></ul><h3></h3><h2><a href=\"https://www.engadget.com/activision-blizzard-proletariat-union-campaign-174226986.html\">A third Blizzard studio pushes to unionize</a></h2><h3>The campaign involves all non-management workers.</h3><h3></h3><p>Workers at Proletariat, a Boston-based studio Blizzard bought earlier this year, announced they recently filed for a union election with the National Labor Relations Board (NLRB). Proletariat is the third Activision Blizzard studio to announce a union drive in 2022. However, past campaigns at Raven Software and Blizzard Albany involved the quality assurance workers at those studios – the effort at Proletariat includes all non-management workers. The employees at Proletariat say they aim to preserve the studio’s “progressive, human-first” benefits, including its flexible paid time off policy and robust healthcare options. Additionally, they want to protect the studio from crunch – compulsory overtime during game development.</p><p><a href=\"https://www.engadget.com/activision-blizzard-proletariat-union-campaign-174226986.html\"><strong>Continue reading.</strong></a></p><p></p><h2><a href=\"https://www.engadget.com/lg-minimalistic-appliances-ces-2023-123506739.html https://www.engadget.com/...\">LG's new minimalistic appliances have upgradeable features and fewer controls</a></h2><h3>Upgradeable, to an extent.</h3><a href=\"https://www.engadget.com/lg-minimalistic-appliances-ces-2023-123506739.html\"><figure><img alt=\"LG\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/f539c020-86a2-11ed-b9bc-b7e9221c0b75\" style=\"height: 379; width: 675;\" /><figcaption></figcaption><div class=\"photo-credit\">LG</div></figure></a><p>LG is taking a more minimalist approach to its kitchen appliances in 2023, with less showy profiles, colors and, seemingly, controls. While we’re not getting a close-up look at all the dials and buttons yet, the appliances look restrained compared to previous years’ models. In the past, we’ve seen a washing machine whose flagship feature was an entire extra washing machine. There was also a dryer that had two doors. Just <em>because</em>. LG says it’s used recycled materials across multiple machine parts, adding that its latest appliances also require fewer total parts and less energy than typical kitchen appliances. This would dovetail with the company’s announcements at the start of the year, where LG said it would offer upgradability for its home appliances. So far, that’s included new filters for certain use cases and software upgrades with new washing programs for laundry machines.</p><p><a href=\"https://www.engadget.com/lg-minimalistic-appliances-ces-2023-123506739.html https://www.engadget.com/...\"><strong>Continue reading.</strong></a></p><p></p><h2><a href=\"https://www.engadget.com/us-house-of-representatives-bans-tik-tok-070722060.html\">US House of Representatives bans TikTok on its devices</a></h2><h3>Lawmakers and staff members who have TikTok on their phones would have to delete it.</h3><h3></h3><p>TikTok is now banned on any device owned and managed by the US House of Representatives, according to <em>Reuters</em>. The House's Chief Administrative Officer (CAO) reportedly told all lawmakers and their staff in an email that they must delete the app from their devices, because it's considered &quot;high risk due to a number of security issues.&quot; Further still, everyone detected to have the social networking application on their phones would be contacted to make sure it's deleted.</p><p><a href=\"https://www.engadget.com/us-house-of-representatives-bans-tik-tok-070722060.html\"><strong>Continue reading.</strong></a></p><p></p><p></p><span id=\"end-legacy-contents\"></span><h2><a href=\"https://www.engadget.com/lg-teases-true-optical-telephoto-zoom-phone-camera-module-with-no-bump-133518178.html\">LG teases a smaller smartphone camera module with true optical telephoto zoom</a></h2><h3>It could lead to smaller smartphone camera bumps.</h3><h3></h3><p>LG may not make smartphones anymore, but it's still building components for them. The company's LG Innotek arm just unveiled a periscope-style true optical zoom camera module with a 4-9 times telephoto range. Most smartphone cameras use hybrid zoom setups that combine certain zoom ranges (typically 2x, 3x, 10x, etc.) with a digital zoom to fill in between those (2.5x, 4.5x, etc.), leading to reduced detail. LG's &quot;Optical Zoom Camera,&quot; however, contains a zoom actuator with movable components, like a mirrorless or DSLR camera. That would help retain full image quality through the entire zoom range, while potentially reducing the size and number of modules required. Could this mean the death of the camera bump?</p><p><a href=\"https://www.engadget.com/lg-teases-true-optical-telephoto-zoom-phone-camera-module-with-no-bump-133518178.html\"><strong>Continue reading.</strong></a></p><p><strong>&nbsp;</strong></p>", "link": "https://www.engadget.com/the-morning-after-biometric-devices-with-military-data-were-being-sold-on-e-bay-121545608.html?src=rss", "date_published": "2022-12-28 12:15:45+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "Sony's WH-1000XM5 ANC headphones fall to a new all-time low of $279", "description": "<p>Sony's WH-1000XM5 is a highly desirable set of wireless headphones, thanks to improved sound quality, a comfortable fit and incredible active noise cancellation (ANC). If you've been eyeballing a pair, now is absolutely the time to act. They're currently on sale in white at Amazon <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9kcC9CMDlYU0RNVDRGP3RoPTEmdGFnPWdkZ3QwYy1wLW8tZTYtMjAiLCJjb250ZW50VXVpZCI6IjY4NDJjODJmLWZmODgtNDNkOC04NDA3LTJiM2M4M2QyNGRlYyJ9&amp;signature=AQAAATp2cNkflTSOLgFHS94PdDm6dInlAAp1aXqX5JKE8Ca2&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB09XSDMT4F%3Fth%3D1\">for $279</a> (30 percent off), the lowest price we've seen to date, by far.&nbsp;</p><p></p><p>The WH-1000XM5 scored an excellent 95 in our <a href=\"https://www.engadget.com/sony-wh-1000xm5-review-160045478.html\">Engadget review</a>, thanks to improvements in nearly every way over our previous favorite headphones, the <a href=\"https://www.engadget.com/sony-wh-1000xm4-headphones-review-150050779.html\">WH-1000XM4</a>. Perhaps the biggest improvement was in fit and comfort thanks to the more optimal weight distribution, synthetic leather ear cups and slightly reduced weight.&nbsp;</p><span id=\"end-legacy-contents\"></span><p>Sound quality also went up, due to the new 30mm carbon fiber drivers that deliver punchier bass. We also saw more clarity that helps you hear fine detail, along with improved depth that makes music more immersive. And Sony's DSEE Extreme sound processing recovers detail lost to compression, without any noticeable impact on sound quality.</p><p>The ANC is equally impressive. With double the number of noise cancellation microphones found in the M4, along with a new dedicated V1 chip, the M5 does a better job at minimizing background noise. And in terms of the microphone, we found that the M5 offers superior call quality over its predecessor. Moreover, you get 30 hours of listening time with ANC enabled, enough for the longest of flights.&nbsp;</p><p>The main drawback of the WH-1000XM5 headphones is the $400 price tag, <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9kcC9CMDlYU0RNVDRGP3RoPTEmdGFnPWdkZ3QwYy1wLW8tZTYtMjAiLCJjb250ZW50VXVpZCI6IjY4NDJjODJmLWZmODgtNDNkOC04NDA3LTJiM2M4M2QyNGRlYyJ9&amp;signature=AQAAATp2cNkflTSOLgFHS94PdDm6dInlAAp1aXqX5JKE8Ca2&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB09XSDMT4F%3Fth%3D1\">but at $279</a>, they're a stellar deal — as long as you're good with the white color. Just act fast before the sale ends.&nbsp;&nbsp;</p><p><em>Follow </em><a href=\"https://twitter.com/EngadgetDeals\"><em>@EngadgetDeals</em></a><em> on Twitter and </em><a href=\"https://subscription.yahoo.net/Newsletter/Preference/sub?b=engadgetdeals&amp;src\"><em>subscribe to the Engadget Deals newsletter</em></a><em> for the latest tech deals and buying advice.</em></p>", "link": "https://www.engadget.com/sonys-wh-1000-xm5-anc-headphones-fall-to-a-new-all-time-low-of-279-093756682.html?src=rss", "date_published": "2022-12-28 09:37:56+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "US House of Representatives bans TikTok on its devices", "description": "<p>TikTok is now banned on any device owned and managed by the US House of Representatives, according to <a href=\"https://www.reuters.com/technology/us-house-administration-arm-bans-tiktok-official-devices-2022-12-27/\"><em>Reuters</em></a>. The House's Chief Administrative Officer (CAO) reportedly told all lawmakers and their staff in an email that they must delete the app from their devices, because it's considered \"high risk due to a number of security issues.\" Everyone detected to have the social networking application on their phones would be contacted to make sure it's deleted, and any future downloads are prohibited.&nbsp;</p><p>This is but the latest the development in a series of moves the US government has made to block the app from devices it owns. Last week, lawmakers <a href=\"https://www.engadget.com/congress-attempts-ban-tiktok-on-government-devices-through-17-trillion-spending-bill-204028363.html\">approved</a> a $1.7 trillion omnibus spending bill that included provisions that would prohibit the use of TikTok on executive branch devices. A spokesperson for the Chief Administrative Officer told <em>Reuters</em> that after its passage, the CAO worked with the Committee on House Administration to implement a similar policy for the House.&nbsp;</p><span id=\"end-legacy-contents\"></span><p>That came after the Senate unanimously <a href=\"https://www.engadget.com/us-senate-approves-bill-ban-tiktok-government-devices-075852696.html\">voted to approve</a> the No TikTok on Government Devices Act that was introduced by Senator Josh Hawley (R-Missouri). As <em>Reuters</em> notes, 19 states had also banned or at least partially prohibited the app's installation and use on staff devices they own or manage. When the omnibus passed, TikTok spokesperson Brooke Oberwetter told Engadget that the company is \"disappointed that Congress has moved to ban TikTok on government devices,\" calling it \"a political gesture that will do nothing to advance national security interests.\"</p><p>TikTok's critics in the US government have been raising concerns that it could be used as a tool to spy on the US by Chinese officials. FBI Director Chris Wray called it a \"Trojan Horse for the Chinese Communist Party\" and said that it has no place on government devices until it completely cuts ties with China. TikTok, which is owned by Chinese company ByteDance, tried to address those concerns by routing all domestic traffic through Oracle servers in the US and pledging to delete all US user data from its servers.&nbsp;</p><p>However, the recent revelation that ByteDance <a href=\"https://www.engadget.com/bytedance-tiktok-employees-us-user-data-journalists-210339650.html\">fired</a> four employees for inappropriately obtaining the data of TikTok users in the US, including that of two reporters, probably doesn't help the company's cause. According to a <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=c813ae39-7d58-41cb-ac66-ad830606ceef&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=The+New+York+Times&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiJjODEzYWUzOS03ZDU4LTQxY2ItYWM2Ni1hZDgzMDYwNmNlZWYiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cubnl0aW1lcy5jb20vMjAyMi8xMi8yMi90ZWNobm9sb2d5L2J5dGUtZGFuY2UtdGlrLXRvay1pbnRlcm5hbC1pbnZlc3RpZ2F0aW9uLmh0bWw_c21pZD10dy1zaGFyZSIsImNvbnRlbnRVdWlkIjoiMTU2NmMzZGMtZDgzZC00YzcyLThjNTItMTRhNGI4YTBjMDllIn0&amp;signature=AQAAAa7PsI7XUuVUSBOgIwtO7cDSp7YD6MjTsUsSaW_jRJFQ&amp;gcReferrer=https%3A%2F%2Fwww.nytimes.com%2F2022%2F12%2F22%2Ftechnology%2Fbyte-dance-tik-tok-internal-investigation.html%3Fsmid%3Dtw-share\"><em>New York Times</em></a> report, the employees gained access to the IP addresses and other data linked to two reporters in their quest to find out who was leaking internal information to the press.</p>", "link": "https://www.engadget.com/us-house-of-representatives-bans-tik-tok-070722060.html?src=rss", "date_published": "2022-12-28 07:07:22+00:00", "persistent": false, "user": null, "language": "en-US"}]