[{"source": "https://www.jefftk.com/news.rss", "title": "Privacy Tradeoffs", "description": "<p><span>\n\nThere's a lot of privacy-related writing that looks like:\n\n</span>\n\n<p>\n\n</p>\n\n<ol>\n<li>Introduce a risk due to insufficient privacy.\n</li>\n<li>Describe things you can do to increase your privacy.\n</li>\n</ol>\n\n\n\n<p>\n\nFor example, I recently came across \"<a href=\"https://malmesbury.substack.com/p/its-time-to-worry-about-internet\">It's\ntime to worry about Internet privacy again</a>\" (via <a href=\"https://www.lesswrong.com/posts/PEmAi3PFjXezJz3js/it-s-time-to-worry-about-online-privacy-again\">LW</a>),\nwhich talks about the risk of AI-accelerated scamming.  The idea is\nthat the more information about you there is in a place accessible to\nscammers, the easier it is to send messages that will fool you into\ndoing the wrong thing.  Then it recommends things like avoiding\nstreaming video and using Linux and Signal.\n\n</p>\n\n<p>\n\nI have two big issues with this kind of writing, which are that it\nrarely:\n\n\n\n</p>\n\n<p>\n\n</p>\n\n<ul>\n\n<li><p>Connects the privacy recommendations to the risks, and instead\ntreats \"privacy\" as a scale where your only options are to move\ntowards \"more privacy\" or \"less privacy\". Choices have different\nimpacts against different possible threats: if Netflix knows that I\nlike Deep Space Nine, how does that information even get into a\nscammer's AI tooling?\n\n</p></li>\n<li><p>Engages with the reasons someone wouldn't already be doing\ntheir recommended things, and consider whether the privacy gains are\nworth the downsides.  If I switched from a Mac laptop to Linux I\nexpect I'd have a worse experience (battery life, trackpad, suspend,\netc) and the privacy gains from avoiding Apple telemetry seem unlikely\nto outweigh that.  Similarly, being able to look back at old instant\nmessage conversations has been very useful many times, and while I'm\nwilling to use Signal with friends that want it I'd much rather use\nmessaging apps that care about maintaining these logs.\n\n</p></li>\n</ul>\n\n\n\n<p>\n\nOne thing that makes this kind of reasoning especially tricky is that\nthe benefits are far from linear.  For most threats you might be\nworried about (<a href=\"https://www.privacyguides.org/basics/common-threats/\">examples</a>)\ngoing entirely dark gets you much more than twice the value of going\nhalfway there.  So a privacy mitigation might be worth the hassle for\none person because it prevents a large portion of their potential\nexposure, but not worth it for someone else who has a lot of different\nexposures and realistically isn't going to do much to reduce most of\nthem.\n\n</p>\n\n<p>\n\nAnother issue that I rarely see enough concern over is that you can't\ntrust the future to keep things private.  The post recommended, in\naddition to avoiding streaming and using Linux and Signal, posting\nunder a pseudonym. While this may be enough to keep people from\nconnecting your writing back to you right now, even a relatively\nsimple stylometric tool was able to identify many people's <a href=\"https://news.ycombinator.com/item?id=33755016\">HN \"alt\"\naccounts</a>, and this kind of highly scalable automated analysis will\nlikely improve a lot over time.\n\n</p>\n\n<p>\n\nPersonally, I've gone a pretty different way: I've generally <a href=\"https://www.jefftk.com/p/giving-up-on-privacy\">given up on privacy</a>.  After\nconsidering the ongoing effort necessary to get actually\nuseful reductions in the level of risk from realistic threats, I think\nmost \"private option\" recommendations are very far from worth it for\nme.  Instead, I default to public: I'll include even <a href=\"https://www.jefftk.com/p/spending-update-2022\">somewhat</a> <a href=\"https://www.jefftk.com/p/january-2022-time-tracking\">personal</a> <a href=\"https://www.jefftk.com/p/experience-on-methotrexate\">details</a> in blogging if they\nseem like they'd be helpful to others, draft company-internal emails\nas if they may someday be leaked, and try hard to make choices such\nthat if they became public I'd be comfortable standing behind my\nactions.  This approach isn't for everyone, and I'm glad there are\npeople working on various privacy technologies, but I think it would\nbe a better fit for a lot more people than currently practice it.\n\n  </p>\n\n<p><i>Comment via: <a href=\"https://www.facebook.com/jefftk/posts/pfbid02r1V5BFd7eyqZWGew7npEhKYDnvQG7qpuwFc8Pq4hmzeJAfbgdQXXgT6VceJgUF9xl\">facebook</a>, <a href=\"https://mastodon.mit.edu/@jefftk/109594873861735809\">mastodon</a></i></p>", "link": "https://www.jefftk.com/p/privacy-tradeoffs", "date_published": "2022-12-28 08:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]