[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCHnyfMqiRRG1u-2MsSQLbXA", "title": "The 4 things it takes to be an expert", "description": "Which experts have real expertise? This video is sponsored by Brilliant. The first 200 people to sign up via https://brilliant.org/veritasium get 20% off a yearly subscription.\n\nThanks to https://www.chess24.com/ and Chessable for the clip of Magnus.\n\n▀▀▀\nChase, W. G., & Simon, H. A. (1973). Perception in chess. Cognitive psychology, 4(1), 55-81. – https://ve42.co/chess1\n\nCalderwood, R., Klein, G. A., & Crandall, B. W. (1988). Time pressure, skill, and move quality in chess. The American Journal of Psychology, 481-493. – https://ve42.co/chess2\n\nHogarth, R. M., Lejarraga, T., & Soyer, E. (2015). The two settings of kind and wicked learning environments. Current Directions in Psychological Science, 24(5), 379-385. – https://ve42.co/Hogarth\n\nÆgisdóttir, S., White, M. J., Spengler, P. M., Maugherman, A. S., Anderson, L. A., Cook, R. S., ... & Rush, J. D. (2006). The meta-analysis of clinical judgment project: Fifty-six years of accumulated research on clinical versus statistical prediction. The Counseling Psychologist, 34(3), 341-382. – https://ve42.co/anderson1\n\nEricsson, K. A. (2015). Acquisition and maintenance of medical expertise: a perspective from the expert-performance approach with deliberate practice. Academic Medicine, 90(11), 1471-1486.  – https://ve42.co/anderson2\n\nGoldberg, S. B., Rousmaniere, T., Miller, S. D., Whipple, J., Nielsen, S. L., Hoyt, W. T., & Wampold, B. E. (2016). Do psychotherapists improve with time and experience? A longitudinal analysis of outcomes in a clinical setting. Journal of Counseling Psychology, 63(1), 1. – https://ve42.co/goldberg1\n\nEricsson, K. A., Krampe, R. T., & Tesch-Römer, C. (1993). The role of deliberate practice in the acquisition of expert performance. Psychological Review, 100(3), 363. – https://ve42.co/anderson3\n\nEgan, D. E., & Schwartz, B. J. (1979). Chunking in recall of symbolic drawings. Memory & Cognition, 7(2), 149-158. – https://ve42.co/chunking1\n\nTetlock, P. E. (2017). Expert political judgment. In Expert Political Judgment. Princeton University Press. – https://ve42.co/Tetlock\n\nMelton, R. S. (1952). A comparison of clinical and actuarial methods of prediction with an assessment of the relative accuracy of different clinicians. Unpublished Ph.D. thesis, University of Minnesota. \n\nMeehl, E. P. (1954). Clinical versus Statistical Prediction: A Theoretical Analysis and a Review of the Evidence. University of Minnesota Press. – https://ve42.co/Meehl1954\n\nKahneman, D. (2011). Thinking, fast and slow. Farrar, Straus and Giroux. – https://ve42.co/Kahneman\n\n▀▀▀\nSpecial thanks to Patreon supporters: RayJ Johnson, Brian Busbee, Jerome Barakos M.D., Amadeo Bee, Julian Lee, Inconcision, TTST, Balkrishna Heroor, Chris LaClair, Avi Yashchin, John H. Austin, Jr., OnlineBookClub.org, Matthew Gonzalez, Eric Sexton, john kiehl, Diffbot, Gnare, Dave Kircher, Burt Humburg, Blake Byers, Dumky, Evgeny Skvortsov, Meekay, Bill Linder, Paul Peijzel, Josh Hibschman, Timothy O’Brien, Mac Malkawi, Michael Schneider, jim buckmaster, Juan Benet, Ruslan Khroma, Robert Blum, Richard Sundvall, Lee Redden, Vincent, Stephen Wilcox, Marinus Kuivenhoven, Michael Krugman, Cy 'kkm' K'Nelson, Sam Lutfi, Ron Neal \n\n▀▀▀\nWritten by Derek Muller and Petr Lebedev\nAnimation by Ivy Tello and Fabio Albertelli  \nFilmed by Derek Muller and Raquel Nuno\nAdditional video/photos supplied by Getty Images\nMusic from Epidemic Sound (https://ve42.co/music)\nProduced by Derek Muller, Petr Lebedev, and Emily Zhang", "link": "https://www.youtube.com/watch?v=5eW6Eagr9XA", "date_published": "2022-08-02 16:51:13+00:00", "persistent": false, "user": null, "language": null}]