[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Leaked Modern Warfare 2 Photos Confirm New Multiplayer Mode ‘DMZ’ | GameSpot News", "description": "Images of Modern Warfare 2’s multiplayer and rumored unannounced mode DMZ have surfaced online and Pokemon Scarlet and Violet get a new trailer and more details.\n#GamingNews #ModernWarfare2 #Pokemon\n\nA kicker for the LA Rams, shared an image of the Modern Warfare 2 menu on Instagram Stories and captioned the image, \"Having fun on the new Call of Duty.\" Another player posted a slightly blurry photo, saying they were previewing the unreleased game, but the image still clearly says \"DMZ\" in the top right-hand corner of the screen.The images have since been deleted, but sites like CharlieIntel and ModernWarzone were quick to capture and tweet out their existence. Call of Duty insiders have long suggested the existence of DMZ, which is said to be Modern Warfare 2's extraction-based mode inspired by Escape from Tarkov. The leaks describe DMZ as an open-world mode with a mix of battle royale and survival game elements, and the mode has reportedly been in development for four years.\n\nToday the Pokemon Company revealed more details about its November games, Pokemon Scarlet and Violet. The game takes place in the Paldea region, which players will travel across using the two legendary Pokemon Koraidon and Miraidon. The new trailer also shows off how versatile the new legendaries are; both can be used for travel by air, land and sea. The story centers on a Pokemon academy, where the main character is a student who sets out to explore the world.\n\nBut that's not all, because we also learned about Scarlet and Violet’s new gameplay mechanic, Terastallize, which transforms a pocket monster into a crystal version of itself with boosted stats. Each Pokemon in the Paldea region gets a unique gem-like look when subjected to Terastallizing, and some Pokemon will change type as well. According to the Pokemon Company, there are 18 types that form a wide number of combinations of Pokemon and Tera Types, and players can Terastallize a Pokemon once per battle.\n\nSTAMPS\n00:00 - Intro\n00:07 - Modern Warfare 2\n01:53 - Pokemon Scarlet & Violet", "link": "https://www.youtube.com/watch?v=WXyK6enUA5g", "date_published": "2022-08-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Presents Full Presentation (08.03.2022)", "description": "Checkout the full Pokémon Presents for August 3rd, 2022 with updates on Pokémon apps and video games, including Pokémon Scarlet and Pokémon Violet!\n\n#Pokémon #pokemonscarlet #pokemonviolet\n\nTimestamps:\n00:00 - Intro\n00:21 - Pokémon World Championships 2022\n03:00 - Pokémon GO FEST 2022\n04:42 - Pokémon Unite\n06:22 - Pokémon Masters EX\n07:12 - Pokémon Café Remix\n09:13 - Pokémon Scarlet and Violet", "link": "https://www.youtube.com/watch?v=Cm0MCwBgtBg", "date_published": "2022-08-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Scarlet & Pokémon Violet - World Overview Gameplay Presentation", "description": "#Pokémon #pokemonscarlet #pokemonviolet\n\nNintendo revealed more info about Pokemon Scarlet and Violet, featuring a new region called Paldea and a spooky occurrence named Terastallization. Pokemon Scarlet and Violet will be available November 18th.", "link": "https://www.youtube.com/watch?v=Qnq6Wizm538", "date_published": "2022-08-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Scarlet & Pokémon Violet Paldea Region Official Trailer", "description": "The new Pokémon Scarlet & Pokémon Violet just dropped! Learn about the brand new Paldea region, where your next Pokémon adventure will take place.\n\n #Pokémon #pokemonscarlet #pokemonviolet", "link": "https://www.youtube.com/watch?v=VoSVc1TWXjg", "date_published": "2022-08-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xenoblade Chronicles 3 Ultimate Combat Guide", "description": "Xenoblade Chronicles 3 can be overwhelming. Fortunately, Jake has you covered with this in-depth combat guide covering everything from Fusion Arts to Chain Attacks.\n#nintendo #xenobladechronicles3 #guide \n\nIn this guide Jake will go over basic mechanics like Arts and auto-attacks, and dig into more complex moves like Fusion Arts and Ouroboros Orders. Here are all the concepts Jake covers:\n\n00:00 - Intro\n00:29 - Classes\n01:10 - Auto-attacks\n01:30 - Arts\n02:18 - Positioning\n03:02 - Combos\n05:10 - Talent Arts\n05:41 - Recap\n05:56 - Master Arts\n06:33 - Fusion Arts\n07:29 - Interlinks\n09:01 - Chain Attacks\n11:03 - Ouroboros Orders\n12:05 - Outro\n\nIf you have questions drop them in the comments or reach out to Jake on Twitter (@jacobdekk).", "link": "https://www.youtube.com/watch?v=oVkICGL2IWQ", "date_published": "2022-08-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call Of Duty’s 2023 Plans Teased | GameSpot News", "description": "Activision has provided an update on what to expect from Call of Duty in 2023, one of Battlefield 2042’s maps has a new look and feel, plus PS Plus games for August are now available.\n#GamingNews #CallofDuty #modernwarfare2 \n\nIn a statement during its Q2 2022 earnings report, Activision said, \"Across the Call of Duty ecosystem, the teams are well positioned to support these launches with substantial live operations, while also continuing development of new premium content planned for 2023 and beyond.” \n\nOver on Twitter Bloomberg’s Jason Schreier said, “For 2023 I'd expect new paid (\"premium\") content for Modern Warfare 2, not a brand new Call of Duty. Treyarch is leading the next mainline game, which was delayed to 2024, as Bloomberg reported earlier this year.\n\nCall of Duty: Modern Warfare II is scheduled to launch on October 28 and will likely increase engagement in the series. If everything goes to plan, the proposed acquisition of Activision Blizzard by Microsoft is also expected to be finalized next year after it's approved by various government regulatory bodies across the world.\n\nIn other FPS news, an update for Battlefield 2042. Version 1.2 of the game includes bug fixes, balance changes and quality of life improvements. Possibly the biggest part of this update is the first of DICE’s planned reworks for 2042’s launch maps Kaleidoscope. According to the patch notes, this map now features improved gameplay flow with new cover assets, flag positions, terrain elevations and visual changes. \n\nUpdate 1.2 also introduces the game’s new revised art direction for its Specialists in order to help them feel more a part of the gritty 2042 game world. Other changes include: a player profile and statistics page are now available, aim assist on controllers feels smoother and more consistent and a couple weapons have been tweaked.\n\nSTAMPS\n00:00 - Intro\n00:10 - Call of Duty\n01:51 - PlayStation Plus \n02:41 - Battlefield 2042", "link": "https://www.youtube.com/watch?v=Omz1ucw3ah4", "date_published": "2022-08-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "This Overpowered Weapons Glitch Changes BOTW", "description": "Weapon Modifier Corruption has changed the landscape of Breath of the Wild, and has given players (With the patience to do it) a way to forge their own powerful and broken weapons however they want. This is not mod, this can be done on any Nintendo Switch. This is both a tutorial on the simplest way to pull this off yourself and an explanation on why this works, because the technical magic behind this is absurd.\n\nWeapon Modifier Corruption was first discovered by Kinak on July 9th 2022, using offset slots to push CookData properties onto weapons. Players then found that combinations of meals and ingredients unlocks custom modifiers with the use of binary numbers. Once this complex work is done, this makes your weapon unbelievably overpowered, and opens new doors for taking on Breath of the Wild’s toughest enemies.\n\nWMC Master Document with recipes\nhttps://docs.google.com/spreadsheets/d/1efenvai4JJM9iPGziHvvef6jSWvNeUGrx-WV9eWlR3g/edit#gid=0\n\nDecimal to Hex Converter\nhttps://www.rapidtables.com/convert/number/decimal-to-hex.html\n\n\n0:00 Intro\n0:41 Initial Setup\n4:09 Arrowless Offset\n6:41 Weapon Modifier Corruption\n7:52 Transfer The Weapon Elsewhere\n9:01 Weapon Modifier Corruption Explained!\n11:27 Weapon Modifier Type Explained\n13:11 Weapon Modifier Values Explained\n14:36 Outro", "link": "https://www.youtube.com/watch?v=KqImUP0DSvY", "date_published": "2022-08-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]