[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Linux Mint 21 keeps the crown, but for how long? Cinnamon, MATE and XFCE review", "description": "Make sure your PHP applications stay relevant for longer: https://tuxcare.com/extended-lifecycle-support/php-prelaunch/\nGrab a brand new laptop or desktop running Linux:https://www.tuxedocomputers.com/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to a weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYouTube: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n📹 MORE VIDEOS FROM ME\nLinux news in Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\nGaming on Linux: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nI'm also on ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n🏆 FOLLOW ME ELSEWHERE:\nTwitter : http://twitter.com/thelinuxEXP\nMastodon: https://mastodon.social/web/@thelinuxEXP\nPixelfed: https://pixelfed.social/TLENick\nDiscord: https://discord.gg/xK7ukavWmQ\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\nThis video is distributed under the Creative Commons Share Alike license.\n\n#linux #linuxmint #opensource\n\n00:00 Intro\n00:46 Sponsor: Extend the life of your PHP applications with TuxCare\n01:35 Under the hood\n02:34 What's new in Cinnamon?\n06:30 New Apps and features\n09:00 What's new in MINT MATE 21?\n10:22 What's new in MINT XFCE 21?\n11:05 Still the king? Yeah, but for how long?\n13:56 Sponsor: Get a new device that runs Linux out of the box with Tuxedo\n15:12 Support the channel\n\n\nAll Mint editions use the Linux kernel 5.15, which is an LTS release, just like Mint 21 itself, so you can expect your distro to be supported until 2027. \n\nThey're also all based on Ubuntu 22.04, so they have the same base repos and packages as that LTS distro, and this base will stay with Mint until 2024, at which point they'll start using Ubuntu 24.04 LTS, I'd presume.\n\nSo, the big update here is the window manager. Muffin is now based on Mutter 3.36, and that brought it much closer to the upstream than previously.\n\nThis means that a few things have changed in Mint 21 Cinnamon, notably the display settings, which are now backported from GNOME to Cinnamon, and all the display configuration code is now part of Muffin instead of being handled by xrandr.\n\nThe main change this brings is that you now get a more consistent looking set of apps between applications that use titlebars, and applications that use headerbars. All windows on Cinnamon will now use the GTK theme and shadows to decorate their headerbars or titlebars, which means that the window manager themes are dropped and aren't used anymore. \n\nAnother change this brings is that GTK antialiasing is now used for all windows, and since it's much crisper than the metacity one, rounded corners should look better on all windows.\n\nWindow animations are also much improved, and look cleaner and perform better, but here again, you lose some customization, as you can't tune them as much, and you can't create your own, but you still can change the global animation speed.\n\nIn terms of apps, there's a new thumbnailer app that integrates that lets you preview a lot more file types, like AppImages, ePubs, MP3s, RAW photos, and WebP.\n\nThe Sticky Notes app gained the ability to duplicate notes.\n\nCinnamon also gets a new process monitor, in the notification tray, that will inform you when automated updates are being applied, and when a timeshift snapshot is currently running.\n\nSpeaking of timeshift, it's now a default MINT app, and it's maintained by the MINT team.\n\nXviewer, the file viewer, has improved directory browsing, and will now display a smooth slideshow if you keep pressing the right or left arrow, leaving you enough time to preview each image.\n\nThe Webapp manager also now supports more browsers and more parameters, so you can create your webapps more easily, and how you like them.\n\nAnd finally, the bluetooth utility has been replaced by Blueman.\n\nMint 21 MATE benefits from the same improvements as its cinnamon counterpart: all the apps are also up to date, including timeshift, the sticky notes, the new bluetooth utility, the new system applets, the main menu right click options, basically everything we just discussed.\n\nIt uses MATE 1.26, which is the latest release, but dates from a year ago, from August 2021.\n\nAs per MINT 21 XFCE, it's the same story. It uses XFCE 4.16, which dates from December 2020. So, if you were using MATE 20 XFCE, you already know everything there is to know about this desktop.", "link": "https://www.youtube.com/watch?v=rnEo_rkamqQ", "date_published": "2022-08-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]