[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCG_nvdTLdijiAAuPKxtvBjA", "title": "Why The Gray Man “Worked” where The 355 Failed | One v One", "description": "Get Surfshark VPN at https://surfshark.deals/FILM and enter promo code FILM for 83% discount and 3 extra months for free!\n\nThe Gray Man is Netflix's new Bournelike action movie from the directors of Captain America and Avengers, starring Captain America Chris Evans and robot Ryan Gosling. Whether the movie overall is good or not is up for debate but as an action movie it is definitely an improvement over The 355, which tried and failed hard at the same earlier in 2022 as discussed in the video \"The 355 - Why Hollywood's Female Action Films Flop\". So today, let's compare the Gray Man to the action weaknesses of The 355 and see how it improves upon them.\n\nFilmento en Español:\nhttps://youtu.be/Hd718nQbjt4\n\nSupport:     https://patreon.com/filmento\nFollow:        https://twitter.com/filmento\n\n#thegrayman  #onevone  #the355  \n\nMusic and inspiration:\nwww.youtube.com/c/WhiteBatAudio\n\n\n\n-\nThe Gray Man (2022)\nRyan Gosling is THE GRAY MAN and Chris Evans is his psychopathic adversary in the Netflix/AGBO spy thriller directed by Anthony and Joe Russo - available globally July 22 on Netflix. Also starring Ana de Armas, with Regé-Jean Page, Billy Bob Thornton, Jessica Henwick, Dhanush, Wagner Moura and Alfre Woodard. Based on the novel The Gray Man by Mark Greaney, the screenplay is by Joe Russo, Christopher Markus and Stephen McFeely. THE GRAY MAN is CIA operative Court Gentry (Ryan Gosling), aka, Sierra Six. Plucked from a federal penitentiary and recruited by his handler, Donald Fitzroy (Billy Bob Thornton), Gentry was once a highly-skilled, Agency-sanctioned merchant of death. But The Gray Man watch full movie online free now bloopers ryan gosling v chris evans gray man prague fight scene shootout scene action scene only action gray man 2 gray man bad movie good movie fight scene gray man avengers everything wrong with the gray man now the tables have turned and Six is the target, hunted across the globe by Lloyd Hansen (Chris Evans), a former cohort at the CIA, who will stop at nothing to take him out. Agent Dani Miranda (Ana de Armas) has his back. He’ll need it.\n-\nThe 355 (2022)\nDirected by Simon Kinberg, this spy thriller features Mace (Jessica Chastain), a wildcard type of CIA agent who decides to join forces with other spies to retrieve a top-secret weapon stolen by mercenaries planning to unleash global trouble. Since the weapon involves cyberspace knowhow, Mace convinces former MI6 British agent Khadijah (Lupita Nyong’o) to help since she’s a computer specialist. She also recruits Colombian psychologist Graciela (Penélope Cruz) and even a rival agent from Germany named Marie (Diane Kruger) to join the espionage team.", "link": "https://www.youtube.com/watch?v=tZtbvJ97N48", "date_published": "2022-08-02 17:00:36+00:00", "persistent": false, "user": null, "language": "en-US"}]