[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Symba: Tiny Desk Concert", "description": "Sheldon Pearce | October 28, 2022\nThe Bay Area rapper Symba is a capable storyteller, but he is best known for his bars. \"Can I rap for y'all?\" he asks after performing \"Can't Win For Nothing.\" \"'Cause that wasn't really me rapping; that was me guiding y'all through a bad day. Let me spit some lyrics.\" Fair enough. He did tear through a L.A. Leakers freestyle, during a visit to Power 106 in 2020, turning many heads and even earning Dr. Dre's hard-won approval. But in his Tiny Desk concert, he demonstrates a keen ability to supplement his charged, freestyler's energy, balancing high-octane wordplay with crisp scene-setting. Donning a Reese Cooper varsity jacket, a white tee, ripped jeans and assorted jewelry, and backed by a band sporting black, Symba brought an even greater intimacy to his songs of determination.\n\nThe concert opens with a few standout singles: He sets the tone by swaggering through \"Don't Condone,\" gleefully brandishing his King James cosign, before diving into the solemn misadventures of \"Can't Win For Nothing.\" His small, six-person ensemble brings warmth and color out of his beats, particularly on the Dre-produced \"Never End Up Broke,\" which breaks down into a lush alternate arrangement fit for the Blue Note jazz club.\n\nAfter warming up, Symba works through several gripping cuts from his recent project with DJ Drama, Results Take Time. As he closes out his set with stirring renditions of the legacy-pondering \"GOAT\" and the status-affirming \"Never Change,\" we bear witness to the truth of the album's title. When he raps, \"I took the long route, not the wrong route,\" it feels like a prophecy fulfilled, proof that talent is always reinforced by work ethic.\n\nSET LIST\n\"Don't Condone\"\n\"Can't Win For Nothing\"\n\"Never End Up Broke\"\n\"Sacrifices\"\n\"GOAT\"\n\"Never Change\"\n\nMUSICIANS\nSymba: vocals\nSimon Martinez: guitar\nIrvin Washington: keys, band leader\nRaymond Nesmith: bass\nJulian Coleman: vocals\nEbony Joi: vocals\n\nTINY DESK TEAM\nProducer: Abby O'Neill\nDirector: Kara Frame\nAudio Engineer: Andie Huether\nAudio Mix: Josh Rogosin\nCreative Director: Bob Boilen\nEditor: Maia Stern\nVideographers: Joshua Bryant, Kara Frame, Michael Zamora\nAudio Assistant: Hannah Copeland\nProduction Assistant: Jill Britton \nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #symba", "link": "https://www.youtube.com/watch?v=RKblHbJE1jI", "date_published": "2022-10-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]