[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Modern Warfare II Official PC Trailer", "description": "It's time to deploy into action in COD: Modern Warfare 2. Check out the latest PC trailer that showcases the various features coming including: 4K graphics, ultrawide support, Ricochet Anti-Cheat, 500 PC customization options and more.\n\n#cod #mw2 #gaming", "link": "https://www.youtube.com/watch?v=eR15IpafwvQ", "date_published": "2022-10-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Get a Steam Deck, No Reservation | GameSpot News", "description": "Getting a Steam Deck just got a lot easier, Hideo Kojima is teasing his next project again, and Forza Horizon 5 is getting its biggest update yet.\n#SteamDeck #HideoKojima #ForzaHorizon5 \n\nNothing feels quite like good news on a Friday! For those of you still looking to order a Steam Deck, you’re in luck because you no longer have to make a reservation or wait in a virtual line to buy one. Instead, you can buy it on demand--you know, the way you purchase everything else in your life… Well, except a PS5. Valve has also unveiled the device's promised docking station, which costs $89 and ships in 1-2 weeks. This premium accessory includes not only HDMI, Displayport, and 3 USB 3.1 connectors, but also an Ethernet port.\n\nIn a tweet announcing the Deck’s new availability, Valve also noted a few nice features that were added in a recent update. These include expanded docking station options, simplified Chinese, Japanese, and Korean keyboards, better trackpad typing, and improved stability in offline mode. It also includes several advanced control commands, including remapping certain commands when holding a button, as well as nested menus for more complicated PC games.\n\nBut even though the wait for more Steam Deck is over, the wait for Hideo Kojima’s next game is still going. However it seems you won’t have to wait much longer, as his studio Kojima Productions begins to pull the curtain back on its next project, revealing that the actress Elle Fanning will appear in it. Kojima revealed this as part of PAX Australia, which is going on now in Melbourne.\n\nThe first teaser for the mysterious game was revealed during the Tokyo Game Show last month. Additional teasers are coming, and if they follow tradition, a major game event might again be the host. If that's the case, the next big gaming event this year is Gamescom Asia at the end of October. After that, Kojima's pal Geoff Keighley is hosting The Game Awards in December.\n\nSTAMPS\n00:00 - Intro\n00:08 - Steam Deck\n01:10 - Hideo Kojima\n02:20 - Forza Horizon 5 Update", "link": "https://www.youtube.com/watch?v=SU_VmmeJRF4", "date_published": "2022-10-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mapping Out Cyberpunk Edgerunners.| Cyberpunk 2077", "description": "Cyberpunk: Edgerunners, the new hit Netflix anime based on CD Projekt Red's Cyberpunk 2077, isn't just set in Night City, but it just about every scene is actually a location from the game. So, here is Mapping Out Cyberpunk: Edgerunners.\n#cyberpunkedgerunners #edgerunners #cyberpunk2077 \n\nIn this Cyberpunk: Edgerunners location guide, we take you from Arasaka Tower and the Corpo Plaza, with its holo koi fish, to the Megabuildings of Santa Domingo and Japantown, where characters like David Martinez and Lucy reside.\n\nFrom stunning views to trying to Parkour our way up a Megabuiding, this is a full stop guide of Cyberpunk: Edgerunners episodes 1, 2, 3, 4, and 5.\n\nWhen I first started Cyberpunk Edgerunners, I thought: Oh, cool! They included locations from Cyberpunk 2077 like the Memorial Park near Arasaka Tower with the holo Koi Fish. Or - of course, important locations like the Afterlife bar. And… in doing research and some exploration, that was when I discovered that the number of locations shown in Edgerunners that you can find in Cyberpunk 2077 is staggering.\n\nIf you enjoy this video, make sure to check out more from GameSpot on Cyberpunk 2077 and Cyberpunk: Edgerunners.", "link": "https://www.youtube.com/watch?v=MiUVGLc9KCU", "date_published": "2022-10-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mortal Kombat 30th Anniversary Official Trailer", "description": "Celebrate 30 years of Mortal Kombat with this latest anniversary trailer featuring video games, to movies, to animation. \n\nAs part of the anniversary, Klassic Movie Raiden will arrive in Mortal Kombat Mobile beginning Oct. 7 through Oct. 11, featuring actor Christopher Lambert’s character likeness and voice from the 1995 film. \n\n#mortalkombat #gaming", "link": "https://www.youtube.com/watch?v=Ym2_AaBCjqg", "date_published": "2022-10-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 Kiriko Official Cinematic Trailer", "description": "The protector of Kanezaka strikes again. Discover the two sides of Kiriko, the loving daughter and the deadly protector in this latest animated short.\n\nPlay Overwatch 2 for free today on Windows PC and Xbox Series X|S, Xbox One, PlayStation 5, PlayStation 4, and Nintendo Switch consoles. \n\n#overwatch #overwatch2 #gaming", "link": "https://www.youtube.com/watch?v=KTfI4JgzdLE", "date_published": "2022-10-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Blizzard Provides Update After Messy Overwatch 2 Launch | GameSpot News", "description": "Activision Blizzard address as wide range of issues with Overwatch 2, new Pokémon Scarlet and Violet details, plus the first look at Need for Speed Undound.\n#Gaming #Overwatch2 #PokemonScarletViolet \n\nBlizzard gives a big, crucial update on the messy Overwatch 2 launch, a bevvy of new Pokemon Scarlet and Violet details, and the new Need for Speed looks… good??? All this on today’s GameSpot News.\n\nBlizzard's long-awaited Overwatch 2 arrived this week, but the launch didn't exactly go to plan. Blizzard has apologized for the launch issues, saying it failed to meet the expectations of players and Blizzard itself. The studio also announced it is removing the phone registration requirement for many and provided an update on what's being done to mitigate server issues to help players get into matches.\n\nThe list of known issues for Overwatch 2 currently stands at nearly 15,000, but there are a few key issues that Blizzard wanted to address right now, the first of which is the phone number requirement. Blizzard initially said the phone number requirement was part of an effort to combat cheating, but many people complained about it for a variety of reasons, and some prepaid phone plans did not work.\n\nWhile most users will no longer require a phone number, accounts not connected to Battle.net and new accounts must still provide one.\n\nRegarding stability, Blizzard just recently released a patch for the login experience that has already been shown to increase the \"reliability\" of logging in. Blizzard is now working on another server update to help reduce how often players become disconnected when they can manage to connect to a game.\n\nPlayers have also reported that they are logging in to Overwatch 2 only to see that some or all of their items and data are missing. The good news is that no items or progress has been lost.\n\nBlizzard said this issue comes from players not completing their account merge process. Another factor is that items are taking time to populate from the original Overwatch to Overwatch 2. \"In all cases, no player data has been wiped or lost. We have a client-side fix for this that cannot be deployed until next week, so we are exploring server-side fixes and will provide updates as more information becomes available,\" Blizzard said.\n\nBlizzard went on to say that anyone who has unlocked a hero but that hero is still showing as locked should log back into the game, and this will resolve the issue \"in most cases.\" Players can open a support ticket if they are still experiencing problems.\n\nFinally, Blizzard said all of Overwatch 2's launch issues were exacerbated by the DDoS attacks against the game. \"They did not directly cause any of these issues, they made the environment in which we work on these issues more challenging. We have not suffered any further attacks,\" Blizzard said.\n\nBlizzard is not just the name of a massive video game developer, but also the name of a move in Pokémon, which just revealed in a new trailer for the upcoming Scarlet and Violet titles that players that players will be able to craft their own TMs using resources dropped from Pokemon that have been caught or defeated in battle. \n\nThe Pokemon Company didn't go too deep into how many \"TMs\" can be crafted or how to unlock recipes, but from the video shown off, it looks like you can create TMs based on classic Pokemon abilities using League Points, berries, and other materials. The rest of the video showed off more of the customization that you'll be able to experiment with, Girafarig's new evolution that transforms it into Farigiraf, and a sandwich-making activity.\n\nCheck out the full 15 minute trailer here on GameSpot’s YouTube.\n\nTIMECODES:\n00:16 - Blizzard Overwatch 2 Update\n02:47 - New Pokémon Scarlet and Violet details\n03:44 - Need for Speed Unbound reveal", "link": "https://www.youtube.com/watch?v=nHztrCPt4Ds", "date_published": "2022-10-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Modern Warfare II | Official 4K Campaign Trailer", "description": "You are the company you keep strong and fight together in COD: Modern Warfare 2. Check out the campaign trailer.\n \nTeam up with TF141 a week early with Campaign Early Access. Available with #MWII digital pre-order here: bit.ly/MWIIPREORDER\n\n#ModernWarfare2 #CallOfDuty", "link": "https://www.youtube.com/watch?v=U0utVQIMZHI", "date_published": "2022-10-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Need for Speed Unbound - Official HD Reveal Trailer (ft. A$AP Rocky)", "description": "Start at the bottom and race to the top in Need for Speed Unbound, coming to PlayStation 5, Xbox Series X|S and PC on December 2, 2022.\n\nRace against time, outsmart the cops, and take on weekly qualifiers to reach The Grand, Lakeshore's ultimate street racing challenge. Pack your garage with precision-tuned, custom rides and light up the streets with your style, exclusive fits, and a vibrant global soundtrack that bumps in every corner of the world.\n\n#NeedForSpeed #ChangeYourLane", "link": "https://www.youtube.com/watch?v=1Co9OWXR89c", "date_published": "2022-10-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Scarlet and Pokémon Violet | Paldean Journey Official HD Trailer", "description": "Every big journey begins with a single step! Take a peek at some of the adventure you'll find through the open world of Paldea!\n\nWhere will you go? What will you discover? Find your treasure in your own journey in Pokémon Scarlet & Pokémon Violet, available 11/18!\n\n#Pokemon #ScarletAndViolet #Nintendo", "link": "https://www.youtube.com/watch?v=Iew1FwU4YCo", "date_published": "2022-10-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Super Mario Bros. Movie Official Teaser Trailer", "description": "Get your first glimpse of the Super Mario Bros. animated movie. We get to see and hear from Bowser, Mario, and Toad!\n\n#supermario", "link": "https://www.youtube.com/watch?v=9X2251IuWp0", "date_published": "2022-10-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]