[{"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Matt Walsh Calmly Dismantles Radical Gender Theory While Protestors Gather To Complain About His Presence", "description": "As a handful of protesters shouted outside an Illinois auditorium Thursday night, Daily Wire host Matt Walsh calmly refuted radical gender theory in a speech to students at the University of Illinois Urbana-Champaign. Outside the event, transgender rights activists gathered in the hallway to voice their disapproval and fear of Walsh showing his face on ...", "link": "https://www.dailywire.com/news/matt-walsh-calmly-dismantles-radical-gender-theory-while-protestors-gather-to-complain-about-his-presence", "date_published": "2022-10-06 23:27:22+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Shows You What His Priorities Are’: Blake Masters Hits Mark Kelly For Backing Biden’s IRS Buildup", "description": "Republican Blake Masters challenged Sen. Mark Kelly (D-AZ) on Thursday over the Democrat’s support for legislation beefing up the IRS with 87,000 more agents while voting against an amendment that would have funded 18,000 more Border Patrol agents. Kelly and Masters faced off in a debate, the first and likely only one in the race ...", "link": "https://www.dailywire.com/news/shows-you-what-his-priorities-are-blake-masters-hits-mark-kelly-for-backing-bidens-irs-buildup", "date_published": "2022-10-06 23:12:22+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Whistleblower Claims Hundreds Of FBI Employees Resigned Agency Amid Sexual Misconduct Allegations", "description": "Amid ongoing accusations of the FBI becoming a weaponized agency against the American people after storming former President Trump&#8217;s Mar-a-Lago home and targeting pro-life activists standing up for unborn children, a whistleblower has revealed more damning evidence in the agency surrounding sexual misconduct allegations. According to a top U.S. senator, the anonymous informant said hundreds ...", "link": "https://www.dailywire.com/news/whistleblower-claims-hundreds-of-fbi-employees-resigned-agency-amid-sexual-misconduct-allegations", "date_published": "2022-10-06 22:22:57+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Kanye Praises Candace Owens, Flames Legacy Media In Wide-Ranging Interview With Tucker Carlson", "description": "Rapper Kanye West took a flamethrower to the legacy media Thursday and gave props to Daily Wire host Candace Owens while defending his right to voice an opinion that often bucks leftism. The billionaire joined Fox News host Tucker Carlson in a wide-ranging interview and discussed how he is constantly targeted by the legacy media, ...", "link": "https://www.dailywire.com/news/kanye-praises-candace-owens-flames-legacy-media-in-wide-ranging-interview-with-tucker-carlson", "date_published": "2022-10-06 21:45:48+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Plot Twist!’: Elon Musk Indicates Twitter Appears To Have Changed Course Amid Feud Over Buying Company", "description": "Entrepreneur Elon Musk and his legal team indicated Thursday that Twitter is now rejecting his renewed $44 billion offer to buy the company, which comes as the two sides are tangled up in a court battle after Musk tried to back out of the purchase and Twitter decided to try to force him to acquire ...", "link": "https://www.dailywire.com/news/plot-twist-elon-musk-indicates-twitter-appears-to-have-changed-course-amid-feud-over-buying-company", "date_published": "2022-10-06 21:29:10+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Former Porn Star Lana Rhoades Blasts The X-Rated Industry: ‘They Should Make It Illegal’", "description": "A former porn star slammed the adult entertainment industry in remarks she made while speaking recently on a podcast, saying that the X-rated industry should be banned. The former porn star, Lana Rhoades, whose real name in Amara Maple, made a staggering 250 adult films over the course of her eight-month stint in the industry ...", "link": "https://www.dailywire.com/news/former-porn-star-lana-rhoades-blasts-the-x-rated-industry-they-should-make-it-illegal", "date_published": "2022-10-06 20:45:41+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Tower Drop Ride Where 14-Year-Old Tragically Died To Be Taken Down", "description": "The amusement ride where a 14-year-old boy tragically fell to his death will be taken down, the manufacturer said Thursday. In a statement Thursday, Orlando Slingshot, the company who built the now-infamous &#8220;Orlando Free Fall&#8221; tower drop ride at ICON Park in Orlando, announced that it would take down the ride. The company also announced ...", "link": "https://www.dailywire.com/news/tower-drop-ride-where-14-year-old-tragically-died-to-be-taken-down", "date_published": "2022-10-06 20:42:22+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Biden Admin Issues Over 300,000 Smartphones With Tracking Devices To Illegal Immigrants", "description": "More than 300,000 smartphones used to monitor illegal immigrants were given to noncitizens by the Biden administration last month, according to data collected by Syracuse University&#8217;s Transactional Records Access Clearinghouse. Issuing such cellular devices to illegal immigrants is part of an Immigration and Customs Enforcement program called the Alternatives to Detention, which essentially gives the individuals ...", "link": "https://www.dailywire.com/news/biden-admin-issues-over-300000-smartphones-with-tracking-devices-to-illegal-immigrants", "date_published": "2022-10-06 20:26:50+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘WWE Tough Enough’ Winner Dead At 30", "description": "&#8220;WWE: Tough Enough&#8221; winner Sara Lee passed away on Thursday at the age of 30, her family confirmed in a heartbreaking post on social media. Terri Lee, the wrestler&#8217;s mother, shared a post announcing that her daughter had passed away and asked for privacy as well as prayers for the husband and children she left ...", "link": "https://www.dailywire.com/news/wwe-tough-enough-winner-dead-at-30", "date_published": "2022-10-06 20:25:38+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Puberty Blocking Drug Companies Refuse To Conduct Safety Trials", "description": "Manufacturers that dominate the U.S. market for puberty blockers refuse to conduct safety trials on their frequently prescribed off-label use to treat gender dysphoria in adolescents. Endo International plc and AbbVie Inc have repeatedly declined to conduct safety tests on the puberty blocking drug Lupron, according to a new report by Reuters. Left-wing news outlet ...", "link": "https://www.dailywire.com/news/puberty-blocking-drug-companies-refuse-to-conduct-safety-trials", "date_published": "2022-10-06 19:48:57+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Republican Lawmakers Warn Medical Facilities Performing Child Sex Changes Face ‘Repercussions’", "description": "Republican lawmakers across seven states signaled in a Wednesday letter reviewed by the Daily Caller News Foundation that they would inflict repercussions on medical facilities that perform so-called &#8216;gender-affirming care&#8217; on children. Lawmakers from the State Freedom Caucus Network, a group composed of conservative members aiming to decentralize government power in federal agencies, penned the ...", "link": "https://www.dailywire.com/news/republican-lawmakers-warn-medical-facilities-performing-child-sex-changes-face-repercussions", "date_published": "2022-10-06 19:27:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Federal Judge Blocks New York’s New Concealed Carry Restrictions", "description": "A federal judge in New York blocked much of the state&#8217;s restrictive concealed carry law passed earlier this year. In a lawsuit brought by a group of New York state gun owners, Northern District of New York Judge Glenn T. Suddaby ruled Thursday that much of the state&#8217;s &#8220;Concealed Carry Improvement Act&#8221; violates the Supreme ...", "link": "https://www.dailywire.com/news/federal-judge-blocks-new-yorks-new-concealed-carry-restrictions", "date_published": "2022-10-06 19:15:57+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "MIDTERM EXAM: Tidbits And More From The Campaign Trail (Part One)", "description": "Welcome to this week’s Midterm Exam (part one) — complete with tidbits and stories from races around the country. Extensive midterm coverage, and more detailed reports, can be found here. Now, we’ll go over some governor and Senate races from Arizona and Wisconsin &#8230; why? Why not! Peter Thiel, Doug Ducey Fundraise For Blake Masters in Arizona ...", "link": "https://www.dailywire.com/news/midterm-exam-tidbits-and-more-from-the-campaign-trail-part-one", "date_published": "2022-10-06 19:00:43+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Two Dead, Multiple Injured After Las Vegas Stabbing Attack", "description": "Two people died and at least eight others suffered injuries in a knife attack outside a Las Vegas casino on Thursday. Police responded to reports of a stabbing outside the Wynn casino off of Las Vegas Boulevard just before noon, according to Metropolitan Police Department Captain Dori Koren. One person was taken into custody while ...", "link": "https://www.dailywire.com/news/two-dead-multiple-injured-after-las-vegas-stabbing-attack", "date_published": "2022-10-06 18:43:12+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "To The Leftist Vultures At Media Matters: Kiss My Ass", "description": "Well, now it’s my turn. I expected something like this might happen. It had to. I have been successful in fighting against the left’s agenda, especially the trans agenda. Those who support the sexual mutilation of children know full well that I am a threat to them. We’re winning and they’re losing. And they know ...", "link": "https://www.dailywire.com/news/to-the-leftist-vultures-at-media-matters-kiss-my-ass", "date_published": "2022-10-06 18:38:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "More Than 150 GOP House Members Ask Biden To Refuse California’s Waiver Request For Electric Vehicle Rules", "description": "More than 150 Republican legislators are asking President Joe Biden to not accept California’s recent green energy car rules by refusing the state&#8217;s request for a waiver. According to the Environmental Protection Agency (EPA), the Clean Air Act lets California attempt to receive a waiver that would allow the state to set its own emission regulations for new cars. The ...", "link": "https://www.dailywire.com/news/more-than-150-gop-house-members-ask-biden-to-refuse-californias-waiver-request-for-electric-vehicle-rules", "date_published": "2022-10-06 18:35:39+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Tom Brady Needs To Be The Leader Of His Family", "description": "Today’s topic is a little different, but I want to talk about Tom Brady and Gisele Bundchen’s rumored divorce. Specifically, I want to talk about why Tom needs to be the leader of his family and go get the girl. The media is saying that both Gisele and Tom have hired divorce lawyers. We can’t ...", "link": "https://www.dailywire.com/news/tom-brady-needs-to-be-the-leader-of-his-family", "date_published": "2022-10-06 18:34:19+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Crime Is Surging, So Chicago’s Lori Lightfoot Just Announced A City-Wide Karaoke Contest", "description": "In a boost for morale, Chicago Mayor Lori Lightfoot (D) is shelling out $5,000 for the winner of a city-wide karaoke contest. The prize comes as crime is surging in the Windy City. If you have ever wanted to see Lightfoot shake her tailfeather, now is your chance because the leftist mayor announced the monthlong ...", "link": "https://www.dailywire.com/news/crime-is-surging-so-chicagos-lori-lightfoot-just-announced-a-city-wide-karaoke-contest", "date_published": "2022-10-06 18:21:41+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Tom Brady Responds To Subtle Statement From His Wife With His Own Subtle Statement Amid Marital Woes", "description": "Legendary NFL quarterback Tom Brady responded to wife Gisele Bündchen&#8217;s subtle statement this week of not wearing her wedding ring with his own subtle statement — also not wearing his wedding ring. Bündchen, 42, was spotted by the New York Post’s Page Six in Miami Wednesday with her son Benjamin, 12, and daughter Vivian, 9, ...", "link": "https://www.dailywire.com/news/tom-brady-responds-to-subtle-statement-from-his-wife-with-his-own-subtle-statement-amid-marital-woes", "date_published": "2022-10-06 18:12:07+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "WATCH: Tucker Carlson Visits A Defiant Kanye West At His Yeezy Office, West Posts To Instagram", "description": "Billionaire Kanye West on Thursday posted video of Fox News host Tucker Carlson visiting his Yeezy office on Thursday. In video taken by West, Carlson is offered tastes of two new drinks created by the entrepreneur and shown a pair of 3D-printed boots West said will &#8220;change the game.&#8221; &#8220;Tucker Carlson stopped by the new ...", "link": "https://www.dailywire.com/news/watch-tucker-carlson-visits-a-defiant-kanye-west-at-his-yeezy-office-west-posts-to-instagram", "date_published": "2022-10-06 18:08:49+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Adidas Indicates It Might Drop Kanye After ‘White Lives Matter’ Shirt. Kanye Fires: Adidas ‘Raped And Stole My Designs.’", "description": "Billionaire Kanye West slammed sportswear brand Adidas after the corporation indicated it might drop the fashion designer days after he donned &#8220;White Lives Matter&#8221; apparel alongside Daily Wire host Candace Owens at Paris Fashion Week. Adidas said on Thursday that its relationship with West is currently &#8220;under review&#8221; after failed efforts to &#8220;privately resolve the situation.&#8221; ...", "link": "https://www.dailywire.com/news/adidas-indicates-it-might-drop-kanye-after-white-lives-matter-shirt-kanye-fires-adidas-raped-and-stole-my-designs", "date_published": "2022-10-06 17:40:17+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "New Insurance Data Reveals Shocking Number Of Minors Obtained Transgender Surgeries", "description": "A new investigation into insurance claims reveals shocking new insights into how many children in the United States have sought and received transgender-related medical treatments. Left-wing news outlet Reuters published a report on Thursday using data analyzed by health technology company Komodo Health Inc that identified the number of children who received a diagnosis of ...", "link": "https://www.dailywire.com/news/new-insurance-data-reveals-shocking-number-of-minors-obtained-transgender-surgeries", "date_published": "2022-10-06 17:38:53+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "BREAKING: GOP Senator Ben Sasse To Be Next President Of The University Of Florida", "description": "U.S. Sen. Ben Sasse (R-NE) will become the next president at the University of Florida, the senator and the university announced in separate statements Thursday afternoon. The news came just minutes after a NewsRadio 1110 KFAB’s Ian Swanson, a former staffer for Sasse, broke the news that Sasse was going to retire from the U.S. ...", "link": "https://www.dailywire.com/news/breaking-gop-senator-ben-sasse-to-be-next-president-of-the-university-of-florida", "date_published": "2022-10-06 17:29:29+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘I Sank Into A Deep Depression’: Detransitioner Loses Natural Singing Voice After ‘Gender Affirming’ Care", "description": "Cat Cattinson began questioning her “gender identity” from the time she was five years old. But when she asked her parents if she could be a boy instead of a girl, they told her it wasn’t possible. So Cat let go of the idea until she turned 13, and came across female-to-male “transitioners” while searching ...", "link": "https://www.dailywire.com/news/i-sank-into-a-deep-depression-detransitioner-loses-natural-singing-voice-after-gender-affirming-care", "date_published": "2022-10-06 17:21:39+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "California Water Districts Offer Water Cuts From Colorado River As River Suffers", "description": "California water agencies are offering to cut water supplies to towns and farms in order to save the Colorado River which is facing a devastating drought, but the cuts could further harm an already dry region of farmland. “California water agencies that utilize Colorado River water supplies propose to conserve up to an additional 400,000 ...", "link": "https://www.dailywire.com/news/california-water-districts-offer-water-cuts-from-colorado-river-as-river-suffers", "date_published": "2022-10-06 17:20:43+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘I Don’t Know If She Has Anything Left’: Hoops Star’s Wife Says Russian Prison Is Killing Her", "description": "WNBA star Brittney Griner is quickly losing hope in her Russian prison cell, her wife told &#8220;CBS Mornings&#8221; host Gayle King on Thursday. Cherelle Griner made an appearance on the show on behalf of her wife, who was arrested in Russia back in February of this year. The WNBA all-star and Olympic gold medalist was ...", "link": "https://www.dailywire.com/news/i-dont-know-if-she-has-anything-left-hoops-stars-wife-says-russian-prison-is-killing-her", "date_published": "2022-10-06 17:03:15+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Trump’s First Big Ad Buys In Midterm Elections Revealed", "description": "A PAC supported by former President Donald J. Trump has officially entered the 2022 midterm election ad market in support of Republican Senate candidates in both Ohio and Pennsylvania, according to Politico. Per the D.C.-area paper, MAGA Inc., has purchased more than a quarter of a million dollars in ads in Columbus and Cleveland. AdImpact, ...", "link": "https://www.dailywire.com/news/trumps-first-big-ad-buys-in-midterm-elections-revealed", "date_published": "2022-10-06 16:31:13+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "School Counselor Admits To Sex With Trans Student In Virginia District Rocked By Bathroom Rape", "description": "The student reported the crime in May 2021, the same month that a notorious bathroom rape of a girl by a boy wearing a skirt occurred. But the counselor was not arrested, and the investigation was not made public, until November 3, 2021 – the day after Election Day. Republican Gov. Glenn Youngkin narrowly won that election in a race that revolved heavily around school safety.", "link": "https://www.dailywire.com/news/school-counselor-admits-to-sex-with-trans-student-in-virginia-district-rocked-by-bathroom-rape", "date_published": "2022-10-06 16:03:17+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "BREAKING: Republican Senator Ben Sasse To Resign, Report Says", "description": "U.S. Sen. Ben Sasse (R-NE) is reportedly going to resign from his position to pursue a new opportunity outside of elected office. NewsRadio 1110 KFAB’s Ian Swanson, a former staffer for Sasse, broke the news, saying that Sasse was going to pursue an opportunity in higher education, adding that the resignation was not expected to ...", "link": "https://www.dailywire.com/news/breaking-republican-senator-ben-sasse-to-resign-report-says", "date_published": "2022-10-06 15:58:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "BREAKING: Biden Pardons Thousands With Federal Convictions For Drug Crimes, Orders States To Do The Same", "description": "President Joe Biden announced Thursday afternoon that he was pardoning thousands of people who had prior federal convictions for possessing marijuana, and he urged governors to do the same at the state level. Biden said that people being held accountable for choosing to violate marijuana laws &#8220;has upended too many lives and incarcerated people for ...", "link": "https://www.dailywire.com/news/breaking-biden-pardons-thousands-with-federal-convictions-for-drug-crimes-orders-states-to-do-the-same", "date_published": "2022-10-06 15:30:56+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "BREAKING: Federal Prosecutors Have Enough Evidence To Charge Biden’s Son With Multiple Crimes, Report Says", "description": "Federal prosecutors have reportedly gathered enough information to charge President Joe Biden&#8217;s son, Hunter Biden, with multiple crimes related to taxes and lying to investigators about a firearm purchase. The Washington Post reported that federal agents &#8220;determined months ago&#8221; that they had a viable criminal case against the president&#8217;s son, but the agents do not ...", "link": "https://www.dailywire.com/news/breaking-federal-prosecutors-have-enough-evidence-to-charge-bidens-son-with-multiple-crimes-report-says", "date_published": "2022-10-06 15:09:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘The Greatest Lie Ever Sold’: Candace Owens’ Highly Anticipated BLM Documentary Is Here", "description": "Days after Candace Owens set the internet ablaze with matching &#8220;White Lives Matter&#8221; shirts alongside billionaire rapper Kanye West, the popular author and podcast host has announced the release of her hotly anticipated Black Lives Matter documentary, &#8220;The Greatest Lie Ever Sold.&#8221; The BLM exposé, available exclusively for DailyWire+ members on October 12, takes a deep-dive into the ...", "link": "https://www.dailywire.com/news/the-greatest-lie-ever-sold-candace-owens-highly-anticipated-blm-documentary-is-here", "date_published": "2022-10-06 14:55:35+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Dereliction Of Duty’: Senators Cruz, Graham Warn Mayorkas Of Impeachment Over Border Crisis", "description": "Two GOP senators accused Department of Homeland Security Secretary Alejandro Mayorkas of &#8220;dereliction of duty,&#8221; claiming his inaction on border enforcement could serve as grounds for impeachment. Sens. Ted Cruz (R-TX) and Lindsey Graham (R-SC) sent a letter to Mayorkas on Wednesday as the nation&#8217;s southern border continues to experience a soaring number of migrant ...", "link": "https://www.dailywire.com/news/dereliction-of-duty-senators-cruz-graham-warn-mayorkas-of-impeachment-over-border-crisis", "date_published": "2022-10-06 14:45:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘I Can’t Think Of A Worse Job For A White Supremacist’: Career NYPD Cop Breaks Down BLM Claims", "description": "Black Lives Matter is a very effective slogan that elicits sympathy and empathy. It suggests many people outside the black community don’t believe black lives matter. While I agree with that assumption, I have a very different opinion about who the uncaring culprits might be. BLM’s vision statement says:  &#8220;Black Lives Matter Global Network Foundation imagines ...", "link": "https://www.dailywire.com/news/i-cant-think-of-a-worse-job-for-a-white-supremacist-career-nypd-cop-breaks-down-blm-claims", "date_published": "2022-10-06 14:25:11+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Kourtney Kardashian Celebrates Her ‘Thicker Body’ At 115 Lbs Post-IVF", "description": "Kourtney Kardashian is proud of her recent weight gain and even got specific about the new numbers reflected on the scale. The 43-year-old mom of three said her extra pounds resulted from undergoing in-vitro fertilization procedures (IVF) with rocker husband, Travis Barker. In a recent episode of “The Kardashians” on Hulu, the 43-year-old opened up ...", "link": "https://www.dailywire.com/news/kourtney-kardashian-celebrates-her-thicker-body-at-115-lbs-post-ivf", "date_published": "2022-10-06 14:21:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Hunter Makes History By Bagging Deer Legally … In Chicago", "description": "A fatal shooting happened in Chicago and it was all perfectly legal. Jose Guzman became the first hunter in more than 150 years to shoot a deer inside Windy City limits earlier this week, when he bagged a doe with a crossbow. Guzman brought down the animal from a tree stand in William Powers State ...", "link": "https://www.dailywire.com/news/hunter-makes-history-by-bagging-deer-legally-in-chicago", "date_published": "2022-10-06 14:01:01+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "WashPost: VP Harris In ‘Car Accident.’ Reality: Driver Hit A Curb.", "description": "The Washington Post really seems to have an axe to grind with the U.S. Secret Service. The liberal paper has hammered the USSS for years, exposing some newsworthy incidents but also blowing others out of proportion. Take the one that occurred Monday. &#8220;VP was in car accident; Secret Service first called it ‘mechanical failure,&#8217;&#8221; the ...", "link": "https://www.dailywire.com/news/washpost-vp-harris-in-car-accident-reality-driver-hit-a-curb", "date_published": "2022-10-06 13:55:54+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘The View’ Host Admits DeSantis Is ‘Brilliant’ — Then Insists That Only Proves He’s Mean", "description": "Sunny Hostin admitted on Thursday that Florida Republican Governor Ron DeSantis was &#8220;brilliant&#8221; — but immediately afterward, she insisted that his intelligence was just more proof that &#8220;cruelty is the point&#8221; of his governing style. Hostin joined her co-hosts on ABC&#8217;s midday talk show &#8220;The View,&#8221; where they began by discussing the aftermath of Hurricane ...", "link": "https://www.dailywire.com/news/the-view-host-admits-desantis-is-brilliant-then-insists-that-only-proves-hes-mean", "date_published": "2022-10-06 13:50:59+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "JoJo Siwa Posts ‘Gay Awakening’ Recap Featuring Demi Lovato, Jenna Dewan", "description": "Former “Dance Moms” star JoJo Siwa recently headed to TikTok to share what she dubbed her “gay awakening.” The 19-year-old singer came out as gay in January 2021. Now she’s explaining how she came to that conclusion about her sexuality, citing fellow pop star Demi Lovato and actress Jenna Dewan as being influential at that ...", "link": "https://www.dailywire.com/news/jojo-siwa-posts-gay-awakening-recap-featuring-demi-lovato-jenna-dewan", "date_published": "2022-10-06 13:48:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "We Cannot Ignore The Slippery Slope Of ‘Minor Attracted’ Behavior", "description": "When I saw the footage, I didn’t know how to react. Scream at the top of my lungs? Break down and weep? Or call the police? I’m talking about a short video clip featuring drag queens engaging in despicable behavior with little children. (Let the viewer be forewarned.) The clip begins with a little girl ...", "link": "https://www.dailywire.com/news/we-cannot-ignore-the-slippery-slope-of-minor-attracted-behavior", "date_published": "2022-10-06 13:13:23+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘I Had One Hand On The Door’: Young Couple Praises DOJ-Targeted Mark Houck For Helping Them Choose Life", "description": "A young couple from Philadelphia says Mark Houck, a DOJ-targeted pro-life activist facing 11 years behind bars, helped them choose life for their baby girl, Nevaeh. Houck was arrested by some 20 FBI agents at his rural Pennsylvania home and hit with charges under the federal Freedom of Access to Clinic Entrances (FACE) Act last ...", "link": "https://www.dailywire.com/news/i-had-one-hand-on-the-door-young-couple-praises-doj-targeted-mark-houck-for-helping-them-choose-life", "date_published": "2022-10-06 13:12:08+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Biden’s ‘Fist-Bump Diplomacy’ With Saudi Prince Becomes Slap In The Face", "description": "When Joe Biden faced off with other Democrats at a presidential nomination debate in November 2019, he carried a big stick — and spoke loudly. The subject at hand was Saudi Arabia and the killing of Washington Post contributor Jamal Khashoggi by Saudi agents. “I would make it very clear we were not going to ...", "link": "https://www.dailywire.com/news/bidens-fist-bump-diplomacy-with-saudi-prince-becomes-slap-in-the-face", "date_published": "2022-10-06 13:09:42+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Democrat Uses Video Of Her Own Child’s Birth To Push Abortion Access", "description": "Louisiana congressional candidate Katie Darling (D) used a video of her own son&#8217;s birth in a campaign ad promoting access to abortion. Darling&#8217;s campaign released the ad on Monday — a 75-second video that showed a very pregnant Darling talking about life on her family&#8217;s farm, where they grew their own food and raised chickens, ...", "link": "https://www.dailywire.com/news/democrat-uses-video-of-her-own-childs-birth-to-push-abortion-access", "date_published": "2022-10-06 13:01:46+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Texas Gov. Sends Another Bus Of Migrants Near Home Of Kamala Harris", "description": "A bus of migrants from Texas arrived near the Naval Observatory in Washington, D.C., on Thursday, where Vice President Kamala Harris and second gentleman Douglas Emhoff live. The latest busing effort by Texas Republican Governor Greg Abbott followed seven buses of migrants arriving in New York City on Wednesday and two more on Thursday, Fox ...", "link": "https://www.dailywire.com/news/texas-gov-sends-another-bus-of-migrants-near-home-of-kamala-harris", "date_published": "2022-10-06 12:52:53+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Appeals Court Rules Obama-Era DACA Program Unlawful", "description": "A federal appeals court ruled Wednesday that the Obama administration’s Deferred Action for Childhood Arrivals program, or DACA, is unlawful. The Fifth Circuit Court of Appeals stopped short of ordering the program dismantled, though it did affirm a lower court’s ruling that stopped the program from growing. Current members of DACA can stay within the ...", "link": "https://www.dailywire.com/news/appeals-court-rules-obama-era-daca-program-unlawful", "date_published": "2022-10-06 12:36:31+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Bazooka Joe: Biden’s Endless Military Supply For Ukraine Is A Sight To Behold", "description": "President Joe Biden has promised to support Ukraine &#8220;as long as it takes&#8221; to defeat Russian President Vladimir Putin. What that exactly looks like is a sight to behold. So far, Biden has delivered billions of dollars in military supplies ranging from weapons and vehicles to financial support. There is, of course, little to no ...", "link": "https://www.dailywire.com/news/bazooka-joe-bidens-endless-military-supply-for-ukraine-is-a-sight-to-behold", "date_published": "2022-10-06 12:24:17+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Maddow Warns SCOTUS: Rule Our Way Or Americans Won’t Respect Rule Of Law", "description": "MSNBC host Rachel Maddow warned Wednesday that Americans will lose respect for the rule of law if the Supreme Court&#8216;s “new conservative supermajority” goes against leftist positions on election results, affirmative action, LGBTQ issues, and voting rights. It was a pending Alabama redistricting case which set the cable news host off. Supreme Court observers believe justices ...", "link": "https://www.dailywire.com/news/maddow-warns-scotus-rule-our-way-or-americans-wont-respect-rule-of-law", "date_published": "2022-10-06 12:23:13+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Virginia NAACP Leader Killed In Gang Shootout During Caribbean Vacation", "description": "A Virginia NAACP leader and Army veteran was shot dead while shielding his girlfriend earlier this week when they were caught in the crossfire of an apparent gang-related shootout during a Caribbean vacation. Kent Carter, who was first vice president of the civil rights organization’s Arlington, VA, chapter, was killed in Turks and Caicos Islands ...", "link": "https://www.dailywire.com/news/virginia-naacp-leader-killed-in-gang-shootout-during-caribbean-vacation", "date_published": "2022-10-06 12:04:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Rioter Who Killed Retired Police Captain Gets Life In Prison", "description": "Stephan Cannon, 26, was sentenced on Wednesday to life in prison for the murder of retired St. Louis police captain David Dorn — and an additional 30 years for other crimes. A Missouri jury convicted Cannon of first-degree murder — which took place during the riots that occurred in downtown St. Louis on June 2, ...", "link": "https://www.dailywire.com/news/rioter-who-killed-retired-police-captain-gets-life-in-prison", "date_published": "2022-10-06 12:03:03+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Energy Dependent: Biden’s ‘BABA’ Is A Cheap ‘MAGA’ Knock-Off", "description": "Former President Donald J. Trump had his motto “Make America Great Again (MAGA).” President Joe Biden has the knock-off “Building a Better America (BABA).” BABA sounds similar to MAGA, but like most phony imitations, Biden’s plan for America relies on foreign goods and services. Similar to the effect that off-shoring American manufacturing to places such ...", "link": "https://www.dailywire.com/news/energy-dependent-bidens-baba-is-a-cheap-maga-knock-off", "date_published": "2022-10-06 11:47:48+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Thank You, Leo’: Christian Bale Claims He’s Only Gotten Leonardo DiCaprio’s Rejects In Hollywood", "description": "Christian Bale claims that many of his successful acting roles in Hollywood are the result of Leonardo DiCaprio passing on them. The 48-year-old British actor made the comments during a recent interview with GQ. During the conversation, he quipped that, in a sense, he owes DiCaprio his career. &#8220;Look, to this day, any role that ...", "link": "https://www.dailywire.com/news/thank-you-leo-christian-bale-claims-hes-only-gotten-leonardo-dicaprios-rejects-in-hollywood", "date_published": "2022-10-06 11:33:54+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Gen Z Students Invoke Victimhood And NYU Chemistry Professor Gets The Ax", "description": "At the highest levels of education, we are allowing our children to exalt victimhood and denigrate excellence. The price will be more than lax standards and subpar achievement. It will result in a generation incapable of confronting the difficulties — and glories — of life itself. One of the most under-rated films of the past ...", "link": "https://www.dailywire.com/news/gen-z-students-invoke-victimhood-and-nyu-chemistry-professor-gets-the-ax", "date_published": "2022-10-06 11:25:08+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "66 Abortion Clinics Have Stopped Performing Abortions Since Overturn Of Roe: Report", "description": "Sixty-six abortion clinics in 15 states have stopped performing abortions since the Supreme Court overturned Roe v. Wade in June and returned laws related to abortion to individual states. The research was released on Thursday by the Guttmacher Institute, an abortion-rights organization. &#8220;Prior to June 24, these 15 states had a total of 79 clinics that ...", "link": "https://www.dailywire.com/news/66-abortion-clinics-have-stopped-performing-abortions-since-overturn-of-roe-report", "date_published": "2022-10-06 11:18:18+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘They Do’: Kanye West Doubles Down On ‘White Lives Matter’ Messaging", "description": "Kanye West doesn’t usually apologize for offending the mainstream media, and this latest “White Lives Matter” incident is no exception.  The 45-year-old rapper shared a message on Instagram defending his latest controversy. Putting it simply, Ye wrote in the caption, “Here’s my latest response when people ask me why I made a tee that says ...", "link": "https://www.dailywire.com/news/they-do-kanye-west-doubles-down-on-white-lives-matter-messaging", "date_published": "2022-10-06 09:53:20+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "New Information Raises More Questions About Federal Arrest Of Pro-Life Father Mark Houck", "description": "Republican lawmakers and the pro-life community have already called into question the unprecedented federal targeting of pro-life father Mark Houck &#8212; and new information from a private criminal complaint only makes the arrest all the more suspect. Houck, who leads a nonprofit group that provides sidewalk counseling at abortion clinics in Philadelphia, was arrested by ...", "link": "https://www.dailywire.com/news/new-information-raises-more-questions-about-federal-arrest-of-pro-life-father-mark-houck", "date_published": "2022-10-06 09:44:35+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Questions Swirl After Kamala Harris Motorcade Accident In D.C. Tunnel", "description": "Questions are swirling in the wake of an accident involving Vice President Kamala Harris’s motorcade this week after the Secret Service delayed disclosing the incident amid mixed signals about the cause. The single-car accident occurred in a tunnel in the D.C. neighborhood of Foggy Bottom as Harris made her way to the White House Monday ...", "link": "https://www.dailywire.com/news/questions-swirl-after-kamala-harris-motorcade-accident-in-d-c-tunnel", "date_published": "2022-10-06 09:34:48+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Graham Goes After Musk Over Remarks About Russia’s War In Ukraine, Hints Threat; Musk Fires Back", "description": "Sen. Lindsey Graham (R-SC) called out entrepreneur Elon Musk on social media Wednesday afternoon over his remarks on Russia&#8217;s invasion of Ukraine, and he quickly received a response from the multi-company executive. Graham also took an apparent shot at Tesla over Musk&#8217;s remarks, suggesting that lawmakers should revisit tax credits for electric vehicles. Graham&#8217;s remarks ...", "link": "https://www.dailywire.com/news/graham-goes-after-musk-over-remarks-about-russias-war-in-ukraine-hints-threat-musk-fires-back", "date_published": "2022-10-06 08:33:13+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Easier To Buy A Gun Then A Fresh Apple’: Leftist Minneapolis Mayor Channels Obama", "description": "Leftist Minneapolis Mayor Jacob Frey made a bold claim on Wednesday about guns that even had hard-Left Minnesota Attorney General Keith Ellison raising his eyebrows. Frey, who has been burnishing his leftist credentials for years, perhaps was channeling his inner Barack Obama. In 2016 Obama made the startling claim at a memorial service for Dallas police ...", "link": "https://www.dailywire.com/news/easier-to-buy-a-gun-then-a-fresh-apple-leftist-minneapolis-mayor-channels-obama", "date_published": "2022-10-06 08:20:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Activist Leveled By Rams Player After Storming Field Files Police Report, Pursues Legal Action: Report", "description": "A fan who stormed onto the field at Levi&#8217;s Stadium in Santa Clara, California, Monday night has filed a police report for assault after he was leveled by a Los Angeles Rams player who assisted security officials in apprehending the individual. The Associated Press reported that the fan went to the Santa Clara Police Department after ...", "link": "https://www.dailywire.com/news/activist-leveled-by-rams-player-after-storming-field-files-police-report-pursues-legal-action-report", "date_published": "2022-10-06 08:04:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Legendary NFL Player Blasts Ex-Tom Brady Teammate For ‘Shot At’ Brady’s Wife, Sexual Incident At Hotel", "description": "Shannon Sharpe, one of the top NFL tight ends in history, teed off on former Tampa Bay Buccaneers wide receiver Antonio Brown for taking &#8220;a shot&#8221; at Tom Brady&#8217;s wife amid the couple&#8217;s marital woes and for a recent controversy that erupted surrounding his conduct at a Middle East hotel earlier this year. Sharpe made ...", "link": "https://www.dailywire.com/news/legendary-nfl-player-blasts-ex-tom-brady-teammate-for-shot-at-bradys-wife-sexual-incident-at-hotel", "date_published": "2022-10-06 07:43:41+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘This Is A Huge Gap’: CNN Admits Crime Tops Voters’ Concerns Far Beyond Abortion, Projects Likely GOP Triumph In 2022", "description": "Signs point to the GOP having a “very good night” on Election Night, CNN reported, citing the fact that voters are far more concerned about crime, a traditional GOP strong point, rather than abortion, an issue Democrats use to sway the public toward them. Statistician Harry Enten appeared on CNN’s “New Day” with John Berman ...", "link": "https://www.dailywire.com/news/this-is-a-huge-gap-cnn-admits-crime-tops-voters-concerns-far-beyond-abortion-projects-likely-gop-triumph-in-2022", "date_published": "2022-10-06 07:35:11+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Trans Broadcaster Urges Lawsuit Against J.K. Rowling. Rowling: Bring It.", "description": "An English broadcaster known as Great Britain’s first transgender national television newsreader urged followers to sue famed “Harry Potter” author J.K. Rowling for ripping a transgender children&#8217;s charity. Rowling issued a warning shot of her own, daring anyone to take such action. Rowling had prompted the threat from India Willoughby by commenting on a board ...", "link": "https://www.dailywire.com/news/trans-broadcaster-urges-lawsuit-against-j-k-rowling-rowling-bring-it", "date_published": "2022-10-06 07:19:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Fired Cop Slaughters 35, Including 24 Kids, in Thailand Daycare Attack", "description": "A fired police officer slaughtered at least 35 people, including at least 24 children, in a shocking rampage Thursday at a Thailand daycare center before escaping, then killing himself amid a frantic manhunt, officials said. Thai media outlet Khaosod Online reported that the gunman stormed the facility in the Na Klang district of Nong Bua Lamphu province ...", "link": "https://www.dailywire.com/news/fired-cop-slaughters-34-including-23-kids-in-thailand-daycare-attack", "date_published": "2022-10-06 06:56:32+00:00", "persistent": false, "user": null, "language": "en-US"}]