[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Carla Morrison: Tiny Desk Concert", "description": "From Sept. 15 through Oct. 15, Tiny Desk is celebrating Latinx Heritage Month with an El Tiny takeover, featuring Jessie Reyez, Susana Baca and more musicians from all corners of Latinidad.\n\nFelix Contreras | October 7, 2022\nThe magic of Carla Morrison’s music is in the intimacy of her lyrics and her voice. I’ve seen the Mexican singer-songwriter woo small audiences and large crowds with an elegance that’s only grown since her first releases.That power to mesmerize is on full display during her time behind the desk with four songs that draw on the things that have earned Morrison stans all over Latin America.\n\nAfter the opening piano strains of “Contigo,” we’re treated to a display of how Morrison’s lyrics can sometimes move the singer herself as she confesses to shedding a few tears during the chorus.\n\nThere is an underlying sense of purpose and release in this music as she explains why she took a break from her music career and how that influences the passion behind her latest album, El Renacimiento. \n\nIn fact, even as she introduces “Encontrarme” as an ode to self discovery and recovery, Morrison displays where the emotion in her lyrics come from as she tears up explaining the origin of the song.\n\n“I’m so emotional,” she says through tears, “because it’s been a long time since I’ve been touring and I took a really long time to come back to myself and to be able to sing again. Just to be here means a lot to me because I do watch NPR Tiny Desk at home!”\n \nAs if it couldn't get any more emotional, Morrison introduces “Te Regalo” by introducing the object of her melodic affections, her husband and co-producer, Alejandro Jiménez. \n \nI’m not saying you should have a box of tissues nearby while you watch Carla Morrison’s performance, but it came in handy for me.\n\nSET LIST\n“Contigo”\n“Encontrarme”\n“Te Regalo”\n“Disfruto”\n\nMUSICIANS\nCarla Morrison: vocals\nAlejandro Jiménez: guitar\nDaniel Fraire: keys\nSamuel Felix: drums\nEdgar Hernandez: bass\nDamaris Fraire: vocals\nSarai Pajon: vocals\n\nTINY DESK TEAM\nProducer: Felix Contreras\nAudio Engineer: Josh Rogosin\nDirector/Editor: Kara Frame \nCreative Director: Bob Boilen\nSeries Producer: Bobby Carter\nVideographers: Kara Frame, Joshua Bryant, Maia Stern\nAudio Assistant: Hannah Copeland\nAnimation: Alanté Serene\nProduction Assistant: Jill Britton\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer, Anamaria Sayre, Fi O'Reilly\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#eltiny #tinydesk #carlamorrison", "link": "https://www.youtube.com/watch?v=aKWV7b3j5P0", "date_published": "2022-10-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]