[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "The Crossing: Tiny Desk Concert", "description": "Tom Huizenga | October 24, 2022\nWhen the vocal ensemble named The Crossing — also known as “America’s most astonishing choir” — warmed up behind the Tiny Desk, it reminded me once again how joyful and powerful it can feel to sing together with a group of people. Singing in a choir is a music-making activity shared by more than 54 million Americans, according to recent research by Chorus America.\nWhile the Philadelphia-based choir and its forward-thinking director Donald Nally enjoy the accolades, including a pair of Grammy awards, the most important thing for them is the clear, precise singing of brand new music. They have commissioned and debuted nearly 110 new works by composers including Caroline Shaw, DavidSo  Lang, John Luther Adams, Gavin Bryars and Shara Nova, whose brand new work, Titration, was the focus of this performance. The Crossing performed the work’s world premiere in Montana just four days before visiting NPR. \nNova’s music, which “looks at how we deal with difficult emotions,” she says, requires a wide range of tone and color from the choir. Voices softly enter in translucent layers, a reminder of Renaissance traditions, or bark in a way that conjures up the early American shape-note singing style.\nDuring sound check, Nally stopped the singers to coax a slightly different pronunciation or tweak a volume. And through it all, they sang with power and precision — and with smiles on their faces.\n\nSET LIST\nFrom Titration by Shara Nova\nTurn Ya Head\nSafety In Peril or Calm\nI’m So Mad I Could Spit Nails\nPulses\n\nMUSICIANS\nDonald Nally: conductor\nKevin Vondrak: assistant conductor \nChoir\nKaty Avery\nKaren Blanchard\nMicah Dingler\nJoanna Gates\nDimitri German\nSteven Hyder\nA.J. Keller\nLauren Kelly\nAnika Kildegaard\nMaren Montalbano\nDaniel O’Dea\nKyle Sackett\nRebecca Siler\nTiana Sorenson\nDaniel Spratlan\nDaniel Taylor        \nShari Wilson\n\nTINY DESK TEAM\nProducer: Tom Huizenga\nAudio Engineer: Josh Rogosin \nDirector/Editor: Kara Frame\nSeries Creator: Bob Boilen\nSeries Producer: Bobby Carter\nVideographers: Kara Frame, Joshua Bryant, Michael Zamora, Pierre Kattar\nAudio Assistant: Neil Tevault\nProduction Assistants: Jill Britton\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #thecrossing", "link": "https://www.youtube.com/watch?v=-vwiDF8pD1c", "date_published": "2022-10-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]