[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Original Bayonetta Voice Actor Reacts To Backlash | GameSpot News", "description": "Original Bayonetta voice actor responds to backlash, confirms she was offered $15k for Bayonetta 3.\n#GamingNews #Bayonetta3 #Reaction\n\nVoice actor Hellena Taylor originally said she was offered $4,000 to appear as the voice of Bayonetta in Bayonetta 3, a figure she said was \"insulting.\" Hellena was later replaced by veteran voice actor Jennifer Hale and Platinum Games put out a statement in support of Hale, who received a wave of criticism and backlash. \nAfter Taylor's claims went viral, Bloomberg published a report that said she was offered around $15,000, a figure Taylor has since confirmed to be accurate. In her new Twitter thread, Taylor said she was initially offered $10,000 total to play Bayonetta in the third game, but she deemed it to be too low and wrote a letter to Bayonetta 3 director Hideki Kamiya asking him to pay her what she was worth.\nTaylor said, \"I thought that as a creative, he would understand. He replied saying how much he valued my contribution to the game and how much the fans wanted me to voice the game.” She added that Platinum Games offered her an additional $5,000 for a total of $15,000, but she declined the offer. Taylor then explained, “I heard nothing from them for 11 months. They then offered me a flat fee to voice some lines for 4,000 dollars.”\nAnother major release coming out soon is God of War Ragnarok. Unfortunately for fans who wanted to go into the experience with fresh eyes, the game is leaking ahead of time. A Twitter account is posting screenshots of the game that contain spoilers, according to VGC, which has seen the account.", "link": "https://www.youtube.com/watch?v=cXmWrCRR0IM", "date_published": "2022-10-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Complete BATMAN ARKHAM Timeline Explained!", "description": "The Batman Arkham franchise has grown to become an extensive series with a timeline that glides its way through 5 mainline games, a handful of spin-offs, a plethora of tie-in comic books, a novel, a VR experience, and a movie. But how does everything tie together?\n#Batman #ArkhamCity #ArkhamAsylum #SuicideSquad \n\nThis video breaks down the franchise chronologically, charting the story of Bruce Wayne’s alter ego of Batman from his origins, through to his supposed demise, and the rise of the Suicide Squad.\n\nWith Suicide Squad: Kill The Justice League set to expand the Batman Arkham franchise, what better time to dive back into the gaming saga of the Dark Knight.\n\n00:00 - Opening \n01:17 - Batman Arkham Origins\n03:42 - Batman Arkham Origins Blackgate\n04:37 - Batgirl: A Matter of Family\n05:37 - Batman: Assault on Arkham\n07:18 - Batman Arkham Asylum\n09:29 - Between Asylum and City\n10:51 - Batman Arkham City\n13:53 - Between City and Knight\n15:38 - Batman Arkham Knight\n19:43 - Suicide Squad: Kill the Justice League\n20:38 - Ending", "link": "https://www.youtube.com/watch?v=c1dv6aHLz5o", "date_published": "2022-10-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Horror of Dead Space", "description": "No game does the jump scare better than the original Dead Space. But why are they so effective?\n#deadspace #gaming #gamespot #horror \n\nHey, Stu here. In this video, I'm going to unravel what makes the original Dead Space such a classic in the horror genre. I'm going to layout the art of Dead Space's jump scares, and why it's a master class in its use of not just horror, but terror as well. So buckle up, and let's learn why necormorphs keep us up at night. And with the Dead Space Remake just a few months away, what better time than now to look back on this pinnacle space horror.\n\nTIMESTAMPS:\n00:00 Intro\n00:30 Terror Vs. Horror Breakdown\n02:17 Jump Scare Thoughts\n02:51 Communication\n04:16 Subversion\n05:42 Terrifying By Design\n06:06 Horror Is Fleeting\n06:36 Terrifying Environments\n08:06 Outro", "link": "https://www.youtube.com/watch?v=r6WVpJjQVVs", "date_published": "2022-10-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War Ragnarok: The Mythology Behind Thor", "description": "God of War Ragnarök will soon give us the showdown to end all showdowns: the Norse Gods will finally face their final battle, with Kratos and Atreus in the mix for good measure. \n\nThe god of thunder himself, Thor, is one of the major players in Norse mythology, and will butt heads with Kratos in Sony Santa Monica’s latest. So, let’s become the Gods of Lore as we take a look at how Thor initially appeared in Norse Mythology, discuss how that compares to what we already know about the thunder god in the game, and what that might mean for his ultimate fate as the end times, Ragnarok itself, thunders closer.", "link": "https://www.youtube.com/watch?v=oLnrTfNaiWU", "date_published": "2022-10-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "SAS Soldier Breaks Down CoD Modern Warfare SAS Missions | Expert Reacts", "description": "Mark \"Billy\" Billingham served in the British SAS for over 17 years. He was responsible for planning and executing strategic operations across the world, and has led countless hostage rescues.\n\nSince leaving the military he has worked as both a celebrity bodyguard, appears on Channel 4's \"SAS: Who Dares Wins\", \"SAS Australia\", and has just released his latest book \"Survive To Fight\".\n\nToday he's joining us once again to break down and react to some of the most iconic missions from the Call of Duty franchise, including CoD 4, Modern Warfare 2, and Modern Warfare 2019\n\nYou can find more of Billy Billingham as well as his book here: \nFacebook: www.facebook.com/MarkBillinghamSAS \nTwitter: https://twitter.com/billingham229b\nInstagram: https://www.instagram.com/billingham22b \nTikTok: https://www.tiktok.com/@billy_billingham \nWebsite: https://www.markbillybillingham.com/ \n\nBilly's new book (UK): https://cnet.co/3ANEl6O \nBilly's new book (US): https://cnet.co/3R8rdOT", "link": "https://www.youtube.com/watch?v=4n1p_CGH6ng", "date_published": "2022-10-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Silent Hill 2 Remake - What Can We Expect From Bloober Team? | MindGames", "description": "Ever since the release of Layers of Fear, Bloober's games have been obsessed with getting you inside the damaged minds of their characters–sometimes literally. However, their games have also attracted criticism for their sometimes troubling messaging around trauma and mental health.\n\nWe spoke to Mateusz Lenart, Lead Director of the upcoming Silent Hill 2 Remake, about the origins of Layers of Fear, Bloober's horror philosophy, and how they hope to make psychological horror games that get inside the player's head too.\n\n#mindgames #silenthill2 #blooberteam #gamespot", "link": "https://www.youtube.com/watch?v=SXz4MwOMmB0", "date_published": "2022-10-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]