[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "ONS sample group discussion", "description": "With, Professor Norman Fenton\n\nLinks for Professor Fenton, \n\nwww.normanfenton.com\nwww.youtube.com/@normanfenton81\nhttps://twitter.com/profnfenton\n\nProfessor Fenton is a mathematician, experienced in electrical engineering and computer science. Highly published and cited academic. Professor of Risk Information Management, Queen Mary London University\n\nSpecialist in risk management for critical systems. Expert in quantitative risk assessment and predicting the probabilities of unknown events\n\nImplications of the Office for National Statistics estimates of Covid-19 vaccine take up in England on the representativeness of its sample population\n\nhttps://www.researchgate.net/publication/364310694_Implications_of_the_Office_for_National_Statistics_estimates_of_Covid-19_vaccine_take_up_in_England_on_the_representativeness_of_its_sample_population?channel=doi&linkId=63459d419cb4fe44f31d90fd&showFulltext=true\n\nIs it important to collect quantitively data to learn about a population group?\n\nWhy do we need a representative sample of a population to collect valid data for the population as a whole?\n\nCan you give an example of how a representative sample of a population should be selected?\n\nWhich sample is used by the ONS to generate their estimates of covid vaccine take up?\n\nIs this then a skewed sample?\n\nGiven that to be included an individual had to have been in the 2011 census and must currently be registered with a GP, how many people are missed out?\n\nOf these 8 million people that are missed out from the ONS data, what proportion of these are unvaccinated?\n\nAre there any other estimates of the proportion of the population vaccinated for comparative purposes?\n\nDoes this mean that the sample is not as representative as would be ideal?\n\nIf the sample is not representative, how does this effect the validity of their data and hence their conclusions?", "link": "https://www.youtube.com/watch?v=_sg6TJNK2iQ", "date_published": "2022-10-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]