[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Annapurna Interactive Showcase 2022 Livestream", "description": "Tune in for reveals, announcements, and much more. July 28, 2022 // 12pm PT // 3pm ET // 8pm BST.", "link": "https://www.youtube.com/watch?v=_-lGLzdfbAI", "date_published": "2022-07-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends: Hunted - Official Cinematic Trailer", "description": "Check out the launch trailer for Apex Legends Season of the Hunted. We get a look into the new character Vantage. \n\nVantage’s mother may have raised her to survive the wilds of Págos, but she never crossed paths with a Legend. With her squadmates' help, she’ll need to discover the will to survive.\n\n#apexlegends #vantage #gaming", "link": "https://www.youtube.com/watch?v=ld5EnQiFpfc", "date_published": "2022-07-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PS5 Update Brings Highly Requested Features | GameSpot", "description": "PS5 will be getting it's potentially best update so far, Backbone is making another controller, Mario Kart 8 Deluxe is getting more courses, and Xbox Games with Gold for August have been announced.\n#Gaming #PlayStation5 #PS5 \n\nAsk and you shall receive! Folders are coming to the PlayStation 5. Plus, Sony is partnering with Backbone for a new mobile controller, and more, on today’s GameSpot News.\n\nAfter GameSpot dot com’s op-ed on the PlayStation 5 needing folders, especially now thanks to the new PlayStation Plus Extra and Premium services, mere days later, Sony announced the next beta update for the system will implement just that. Coincidence? I think not!\n\nWhile it’s awesome that this feature is coming to the PS5, there is a catch! Rather than existing in the home screen’s row of games, what Sony is dubbing as “game lists” will reside within the system’s Game Library found at the end of the row, although as this is currently in beta, there’s a chance this could change for the system update’s wide release.\n\nEach game list can contain up to 100 titles, and up to 15 game lists can be created. Game lists can contain disk, digital, or cloud based titles, and a game can be included in more than one game list.\n\nAdditional beta features that begin rolling out today to select users are 1440p support, in case you’re playing on a computer monitor of that resolution, you will no longer be locked to the lower res 1080p experience, as well as the ability to compare the system’s 3D audio to a regular stereo setup. Head to the GameSpot link in the description for the full details, and keep an eye out for an email from Sony in case you are selected for this beta test.\n\nSticking with PlayStation news, the popular mobile Backbone controller is getting a PS5 makeover. While the device isn’t getting DualSense features such as haptic feedback and adaptive triggers, it is getting a matching white overhaul, as well as translucent buttons and d-pad, meaning if you’re using the device for PlayStation Remote Play, you’ll actually have face buttons that match the on-screen input prompts.\n\nThe device is available starting today, for the same price as the normal Backbone, however, it does not include 3 months of Game Pass Ultimate for new subscribers that the regular controller does. According to Backbone’s website, the PlayStation Edition will still include 3 months of Discord Nitro, a month of Apple Arcade, and 2 months of Stadia Pro, all for new subscribers.\n\nTIMECODES: \n00:12 - PS5 Update https://www.gamespot.com/articles/ps5-beta-update-adds-1440p-support-game-lists-and-more-social-features/1100-6505950/\n01:20 - Backbone's new controller\n02:10 - Mario Kart 8 Deluxe DLC\n02:58 - Xbox Games with Gold https://www.gamespot.com/articles/xbox-games-with-gold-free-games-for-august-2022-revealed/1100-6505964/", "link": "https://www.youtube.com/watch?v=v2nhOxo7Ygg", "date_published": "2022-07-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "FIFA 23 | Official Gameplay Deep Dive Trailer", "description": "Check out this deep dive into the new and revamped features coming in FIFA 23! Learn about the various gameplay elements in the timestamps below.\n\nTimestamps:\n00:00 - Intro\n00:47 - HyperMotion2\n01:56 - Women’s Club Football\n02:40 - Technical Dribbling\n03:31 - ML-Jockey\n03:58 - AcceleRATE\n05:04 - Signature Run Styles\n05:54 - Attacking\n06:06 - Power Shots\n06:34 - Composed Ball Striking\n07:01 - Set Pieces\n08:02 - Defending\n08:58 - Goalkeeping\n09:45 - Physics\n10:07 - Skill Moves\n\n\nFIFA 23 releases September 30, 2022 with HyperMotion2 Technology, women’s club football, both men’s and women’s FIFA World Cup™ tournaments, cross-play features, and more.\n\nPre-order FIFA 23 Ultimate Edition by August 21 to get a FIFA World Cup™ FUT Hero item, as well as up to three days early access.\n\n#FIFA23 #TheWorldsGame #HyperMotion2", "link": "https://www.youtube.com/watch?v=e2YV51CaC9Y", "date_published": "2022-07-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "GTA 6 Characters, Setting, And Other Details Leak | GameSpot News", "description": "Bloomberg gets a big scoop on important Grand Theft Auto VI details, PlayStation Plus' August games are revealed, and Knight of the Old Republic Remake indefinitely delayed.\n#Gaming #GrandTheftAuto6 #GTA6 \n\nA report from Bloomberg’s Jason Schreier gives us the biggest info dump for Grand Theft Auto VI that we’ve ever gotten, both for details on what to expect in the game, as well as behind-the-scenes at Rockster on its development. Firstly, let’s talk about the contents of the game itself.\n\nBloomberg reports that the game will feature a Latina character, making this the first playable woman in a GTA campaign. This character will be a part of a pair of leads that are meant to be influenced by Bonnie and Clyde, the real life couple that went on a bank robbing spree with their gang during the Great Depression. No word on whether players will get to play as the other character in pairing.\n\nThe game has an internal codename, Project Americas, as it was initially meant to feature large swaths of the American continent. However, the scale of the game has been reduced over time, and will be set in the universe’s fictional depiction of Miami; Vice City. The report includes the details that the game will still be quite large, with more interior locations than previous GTA games, and that the developer will be adding additional cities and content over time.\n\nBut when can you play it? Some developers on the team told Bloomberg that it will be released sometime in publisher Take-Two’s fiscal 2024, which runs from April 2023 to March 2024. Although some interviewed believed that the game would not hit that window, and would release no sooner than 2024.\n\nThe game has been in development since 2014, which if it were to come out in 2024, would mean that development will take ten years, a time period in which Rockstar has gone through some dramatic changes. In 2018, hundreds of Rockstar employees spoke about about issues with crunch and toxicity at the developer, which has reportedly led to some massive cultural shifts at the company.\n\nEmployees informed Schreier that morale at Rockstar is at an all time high, thanks to changes in scheduling, converting contractors to full-time employees and the severance of several managers that workers underneath them deemed to be abusive and difficult to work with. This change in culture has guided the content of the game itself, aiming to not “punch down” on marginalized groups, and while previous entries have largely been a satirical look at the United States, several employees pointed out in the report that satirizing today’s United States is more difficult thanks to the US already being a parody of itself.\n\nSo if you’re disappointed in having to wait for GTA VI, don’t worry — we’re already living it.", "link": "https://www.youtube.com/watch?v=Ql5TXCRjes4", "date_published": "2022-07-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]