[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "James Francies: Tiny Desk (Home) Concert", "description": "This year, NPR Music is celebrating Black Music Month with an array of brand new Tiny Desk concerts — both from home and from behind our beloved Desk. Together, these artists represent the past, present and future of Black music. This month of carefully curated shows is a celebration of Black artists expressing themselves in ways we've never seen before, and of the Tiny Desk’s unique way of showcasing that talent. \n\nNikki Birch | June 3, 2022\nA smile, laughter and a candle burning beside a delicate flower arrangement welcome us into the warm studio that is the set of James Francies’ Tiny Desk (home) concert. The young Houstonian and Blue Note recording artist begins with the hypnotic grooves of “713” — one of our picks for the best songs of 2021. This tune allows Francies’ virtuosic playing to shine, as he masterfully scales the keys during his solo. After a quick greeting, we’re whisked away by the luscious string ensemble that introduces “Rose Water.” Performed by vocalist Elliott Skinner, we’re lifted by Skinner’s voice as he sings beautifully of hope, support and growth: “I wish that you could see the light / That radiates in everyday…All the trials inside my mind / Shape me.” \n\nFrancies ends his set with “Sway/Freedmen’s Town.” The jazz trio plays while a recording of the voice of Francies’ father, James Francies Sr., tells the story of Freedmen’s Town, a historic district of Houston now known as Fourth Ward. It’s a fitting end to a Tiny Desk (home) concert that celebrates Black Music Month, a poignant and powerful reminder of how far we have come and what we still struggle against. \n\nSET LIST\n“713”\n“Rose Water”\n“Sway/Freedmen’s Town”\n\nMUSICIANS\nJames Francies: piano\nJeremy Dutton: drums\nOr Bareket: bass\nElliott Skinner: vocals \nFrancesca Dardani: violin\nAdriana Molello: violin\nTia Allen: viola\nMarta Bagratuni: cello\n\nCREDITS\nVideo by: Andy Schwartz, Andy Poland, Tripp Kramer  \nAudio By: Gosha Usov, Jason Rostkowski   \n\nTINY DESK TEAM\nProducer: Abby O’Neill\nVideo Producer: Joshua Bryant\nAudio Mastering: Josh Rogosin\nAnimator: Kaz Fantone\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Michael Zamora, Maia Stern, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #tinydeskconcert #jamesfrancies", "link": "https://www.youtube.com/watch?v=sVskXNb2PIM", "date_published": "2022-06-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]