[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Jessie Reyez: Tiny Desk Concert", "description": "From Sept. 15 through Oct. 15, Tiny Desk is celebrating Latinx Heritage Month with an \"El Tiny\" takeover, featuring Jessie Reyez, Susana Baca and more musicians from all corners of Latinidad.\n\nAnamaria Sayre | September 30, 2022\nBeer cans and hair brushes may not be typical percussive tools, but typical is as irrelevant as tradition is amorphous when you're an immigrant-raised, Colombian-Canadian kid whose music is as much about navigating life on your terms as it is about holding your head up in the rip current of love.\n\nJessie Reyez's legendary layers — vocal dynamism, cross-genre playfulness, unapologetic realness — were on full display at her El Tiny concert. Complete with strings, horns and musical direction from Tiny Desk alum Matthew Burnett (whose credits also include Daniel Caesar's Tiny Desk), Reyez deftly danced between tracks with the assuredness of a true reina harnessing her vulnerability on stage.\n\nReyez opens the performance with \"MOOD,\" the starting track of her newly released second album, Yessie. Here, she uses her room-altering belting prowess to rearrange the chorus, relegating the recorded melody to the background vocals and positioning her sample of the timeless track \"Los Caminos de la Vida\" at center stage. Transitioning to a mash-up of \"MUTUAL FRIEND\" and \"FIGURES,\" she delivers a heart-shifting, string-driven performance of the two. Then, she seamlessly navigates a musician and formation change-up as she glides through the playful \"ONLY ONE\" and heartfelt mash-up of \"FOREVER\" and \"IMPORTED.\" Circling back to the second half of \"MOOD,\" she easily slides into a more upbeat, cumbia-infused rendition of the soulful track. Picking up her makeshift güiro — a PBR can — she melds joy in dance and pain in song with the kind of effortless and expert execution of a woman who intimately knows in-betweenness and, better yet, understands how to bask in the beauty of its nuance.\n\nSET LIST\n\"MOOD\" (Pt. 1) \n\"MUTUAL FRIEND\" / \"FIGURES\"\n\"ONLY ONE\"\n\"FOREVER\" / \"IMPORTED\"\n\"MOOD\" (Pt. 2)\n\nMUSICIANS\nJessie Reyez:  vocal\nHeather Crawford: guitar\nSantino DeVilla: drums\nMark James: keyboards\nSimon Siala: bass\nOlivia Ivory Jean Walker: vocals\nDanielle Deimler: vocals\nRefilwe Tshepiso Morake: vocals\nSherri Zhang: violin\nAshley Parham: violin\nJerome Gordon: viola\nJoelle Arnhold: viola\nJohnny Walker: cello\nOmar Martinez-Sandoval: bass\nAndrew Velez: trumpet\nDylan Vessel: trumpet\n\nTINY DESK TEAM\nProducer: Anamaria Sayre\nAudio Engineer: Josh Rogosin \nDirector: Kara Frame\nEditor: Joshua Bryant \nSeries Creator: Bob Boilen \nSeries Producer: Bobby Carter \nVideographers: Kara Frame, Michael Zamora, Joshua Bryant, Maia Stern, Alanté Serene\nAudio Assistant: Neil Tevault\nProduction Assistant: Jill Britton\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#TinyDesk  #ElTiny #JessieReyez", "link": "https://www.youtube.com/watch?v=wSl5_RDCfrQ", "date_published": "2022-09-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]