[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "18 Things You Didn't Know About Modern Warfare 2 Multiplayer", "description": "Call of Duty: Modern Warfare 2’s sandbox is shaping up in both familiar and unexpected ways, and there’s a lot you can do that you might not know.\n\nIntro - 00:00\nYou played Warzone Already! How Was It? - 00:20\nAttention To Detail Baby - 01:02\nStabby - 01:32\nSo Much Around Vehicles - 01:51\nHang On - 02:30\nHop On - 02:48\nShell Game - 03:00\nGadgets Have Other Modes Uses - 03:28\nDrone Bomber - 04:23\nFrisbee Golf - 04:39\nLearn The Routes - 04:48\nMaster Your Inner Dolphin - 05:05\nSide Chute - 05:19\nFirst Downgrades? - It’s A Beta - 05:34\nWorking As Intended? Maybeeee? - 06:28\nDrill Baby Drill - 07:08\nKillstreaks Kill Killstreaks - 07:42\nThe Eye Of Sauron - 08:16", "link": "https://www.youtube.com/watch?v=4PqFnZWCfQY", "date_published": "2022-09-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 Players Want Stadia Cloud Saves | GameSpot News", "description": "Cyberpunk 2077 fans are asking for cloud saves on Stadia and other developers are reacting to the news of the service coming to an end.\n#GamingNews #Cyberpunk2077 #Stadia\n\nIf you missed it, Google announced that its cloud streaming service Stadia will officially be shut down on January 18, 2023. All Stadia hardware purchases made through the Google Store will be refunded, including games and add-on content purchased from that specific storefront. \n\nCyberpunk 2077 is one of the games that has been available to Stadia gamers since launch, but with the service’s looming doom, that means lots of fans may have to start their journey in Night City all over again. Over on the Stadia subreddit, one user asked CD Projekt Red to add cloud saves to the Stadia version of Cyberpunk and added “I care more about my save game than a game refund.” \n\nOther members of the community came to the rescue, suggesting the use of Google Takeout, a service that allows users to grab data from Google services, to download the save files for import into Steam or GOG. There are a number of replies in the thread confirming that this method works, but there are also a good handful of users having trouble with the work around as Stadia was failing to show up in their Takeout menu.  \n\nAt the time of this recording there is no word from CDPR about the possibility of cloud saves for Stadia’s version of Cyberpunk, but January is still a couple months away so anything can happen. For now, if you happen to be dealing with this issue, keep giving Google Takeout a try with your fingers crossed.", "link": "https://www.youtube.com/watch?v=GbOUrv50GxE", "date_published": "2022-09-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 - Everything To Know", "description": "Huge changes, never-before-seen characters, mythic skins, hero missions, and a new free-to-play model? Here's everything you need to know about Overwatch 2.\n#gaming #blizzard #overwatch2 \n\nOverwatch 2 will introduce new playable heroes every other season--or approximately every 18 weeks. These will include both characters that are brand new and “characters you’ve been waiting for.” It will also carry over every hero from the first Overwatch. \nConfirmed heroes new to Overwatch 2 include:\n\nSojourn\nJunker Queen\nKiriko\n\nDescribed as a mid-range specialist with incredible mobility and artillery skills, Sojourn's primary weapon is a railgun that generates energy on each successful hit and can then consume that power for a high-impact shot. This makes Sojourn well-suited for players with marksman skills, as they can use that accuracy to deal devastating blows with the railgun's secondary fire mode.\n\nIn addition, Sojourn also has an area-of-effect ability that will snare enemies and eat away at their health, a rocket-powered slide, and an ultimate ability called Overclock. During Overclock, Sojourn can fire shots that pierce through enemies. Secondary fire on the railgun enables her to quickly eliminate enemies with high-powered shots, which Blizzard likened to a \"hitscan version\" of a Genji's Dragon Blade attack.\n\nTeased for years by Blizzard, Junker Queen is the not-so-benevolent ruler of Junkertown. Equipped with a mohawk, six-pack abs, a shotgun, and a battle ax, Junker Queen is the game's newest tank, and seems more than capable of leading her team to victory.\n\nDescribed as a fierce and resourceful survivalist, Junker Queen's play kit perfectly showcases her will to not only survive but thrive in the harsh, Australian outback. Her passive ability allows her to heal her wounds over time by dealing damage to other players, encouraging those playing Junker Queen to adopt a more aggressive playstyle.\n\nIn addition, many of Junker Queen's moves are most impactful at close-range, including Scattergun and Carnage. Scattergun refers to Junker Queen's powerful shotgun blast, while Carnage is the name given to her big, sweeping ax swing.\n\nCommanding Shout sees Junker Queen increase the health and movement speed of herself and the teammates around her, similarly to Lucio. Junker Queen's ultimate ability, Rampage, allows the tank to lunge toward her opponents using her magnetic gauntlet. Once there, she also prevents her enemies from healing, making Rampage the first ability since Ana's biotic grenade to apply an anti-heal.\n\nKiriko is the final hero coming to the game at launch, and is a healer with a DPS edge. Called the \"Protector of Kanezaka,\" Kiriko is a Japanese ninja who trained alongside Hanzo and Genji under the tutelage of her mother--though she is much younger (and feistier) than the pair. Much of Kiriko's abilities come from her use of spiritual objects associated with Shintoism, such as ofuda and suzu, and her character as a whole represents the merging of the spiritual world with \"youthful intelligence.\"\n\nAs for her moveset, Kiriko's primary ability is to heal. She does this by sending homing ofuda--paper talismans offering the wielder protection--to her teammates.Her secondary ability sees her precisely aim and throw her kunai, giving her an edge of lethality that rivals actual DPS characters. She also has the Protection Suzu ability, which sees her ring a Suzu--or Shinto bell--and \"cleanse\" an area of debuffs and potentially devastating attacks. These attacks include Sombra's hack, Reinhardt's Shatter, Ashe's Burn, Ana's Sleep Dart, and Junkrat's RIP-Tire.\n\nSwift Step allows Kiriko to see her allies through barriers in order to teleport beside them, making her the first character in Overwatch who can phase through walls. Her ultimate, Kitsune Rush, summons a spirit fox to guide her teammates and provide them with accelerated movement speed, attack speed, and cool-down rates. \n\nTimestamps: \n00:12 - Free-to-Play\n00:56 - Battle Pass\n02:06 - Challenges\n02:35 - Maps and Modes\n03:24 - Ping System\n03:48 - PvE\n04:40 - Item System\n05:13 - Talent System\n05:44 - New Heroes\n09:49 - Skins and Progress\n10:18 - Mythic Skins\n10:38 - Hero Redesigns\n12:15 - Release Date", "link": "https://www.youtube.com/watch?v=pPEDqr0LLVc", "date_published": "2022-09-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 IS BACK, BABYYYY", "description": "Cyberpunk 2077 was met with overwhelming disappointment when it first released thanks to a mix of it being overhyped and over-buggy. But, it's back and more popular than it's been in over a year. Is it Patch 1.6? Is it Edgerunners?\n#Edgerunners #Cyberpunk2077 #Cyberpunk \n\nCyberpunk 2077 was met with overwhelming disappointment when it first released thanks to a mix of it being overhyped and over-buggy. But, it's back and more popular than it's been in over a year. Is it Patch 1.6? Is it Edgerunners?\n\nCD Projekt Red has spent over a year patching Cyberpunk 2077, and recently, patch 1.6 released. Many game breaking bugs have been patched at this point, and especially for PC, Xbox Series X/S, and PS5. However, what seems to have relit the fire under Cyberpunk 2077 is Netlfix and Studio Trigger's recent anime: Cyberpunk: Edgerunners.\n\nEdgerunners was animated by Studio Trigger, the team famous for anime such as Kill La Kill, Little Witch Academia, and Promare. It was founded by the team who created Gurren Lagann. And, their animation is spectacular, once again showcased with Edgerunners.\n\nEdgerunners has plenty of Easter eggs from Cyberpunk 2077, and draws deeply from its lore and world to create a story focused around Cyber Psychos. And - it's popularity and success has lead to a reawakening in the Cyberpunk 2077 community, with many players coming back to a game that is finally near the state it should have been at release.\n\nSo here's a rundown on the new-found popularity of Cyberpunk 2077, and how Edgerunners was able to breath life into the franchise.", "link": "https://www.youtube.com/watch?v=SUP2CrqCKto", "date_published": "2022-09-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "ESO - Legacy of the Bretons Autumn Event Livestream", "description": "The Legacy of the Bretons Autumn Event livestream will be live on Thursday, September 29 at 3PM EDT. During this special event, members of the ESO community and development teams will give an exclusive look into the upcoming Firesong DLC including its story, setting, characters, and challenges. In addition to the DLC deep dive, there will also be announcements revealing 2022’s upcoming events for the ESO community\r\n\r\n#elderscrollsonline #gaming", "link": "https://www.youtube.com/watch?v=_HTo05WC_a8", "date_published": "2022-09-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 - Fantastic Update But Stumbles As A Sequel", "description": "Overwatch 2 improves upon the core gameplay and characters fans love, but loses some of its predecessor's spirit in the process. \n\nThere are few moments of calm in Overwatch 2. The action is closer, louder, and faster, and the voice lines are quippier and happen more often. However, in that brief period between selecting your hero and the barriers opening, unleashing you and your teammates out onto the battlefield, there is a brief window of peace--a split-second for meditation.\n\nIt was during these moments, as I watched my beloved Hana Song (aka D.Va) shift her weight from one side of her mecha to the other before offering a sweet \"annyeong\" to a teammate, I forgot I was playing Overwatch 2--I forgot it was no longer 2016. In both my life and Overwatch, a lot has changed, but in these little moments it all felt as if nothing had, and it all felt a bit surreal.\n\n#overwatch2 #gaming #gamespot", "link": "https://www.youtube.com/watch?v=hazMPGA_fN8", "date_published": "2022-09-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 Early Access Kiriko Full Match Gameplay", "description": "Check out a full match with Kiriko the new support character coming to Overwatch 2. We play through a full skirmish match on Ilios. The match goes the full distance so watch to see who comes out on top! Overwatch 2 Early Access comes out on October 4th, 2022 on PC, PS4, PS5, Xbox One, and Xbox Series X.\n\nTimestamps:\n0:00 Intro\n0:10 Round 1\n3:36 Round 2\n8:09 Round 3\n\n#overwatch2 #gaming", "link": "https://www.youtube.com/watch?v=dY8nC5oA12A", "date_published": "2022-09-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Scarlet & Pokémon Violet | Introducing Wiglett Official HD Trailer", "description": "Meet the Garden Eel Pokémon, Wiglett! \n\nIt may look like Diglett, but it’s a completely different species of Pokémon. Wiglett pokes a part of its body out of the sand to feed in the ocean.\n\n#Pokemon #Wiglett #ScarletAndViolet", "link": "https://www.youtube.com/watch?v=2Rvty1WXjy0", "date_published": "2022-09-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Stadia Refunds Explained | GameSpot News", "description": "On today’s GameSpot News ,Google Stadia is being shut down, players are being given refunds for purchases and PlayStation Stars reportedly includes customer service rewards. \n#GamingNews #Stadia #PS5 \n\nStadia was first revealed in early 2019 at that year's GDC event, and officially launched in November that year. The streaming service had an impressive number of third-party games available, with big names such as Assassin's Creed Odyssey, Cyberpunk 2077, and Doom Eternal in its library. Google also had big plans for exclusive titles on Stadia and began investing in its own game studios, but by February 2021, it had shut down that division and announced that it would no longer develop its own games.\n\nFollowing the news of Stadia coming to an end, many users in possession of the service’s controller, took to places like reddit to ask Google for unlocked Bluetooth capabilities. This is something the community has been requesting for years, but now that the service is ending, it would go a long way to making sure the hardware does not become trash for many gamers. The good news is that the Stadia controller works for other platforms like Steam when used wired, so that will always be an option if Google doesn’t unlock wireless capabilities.\n\nMeanwhile over on PlayStation, Sony is preparing to launch PlayStation Stars, a new loyalty program that anybody with a PlayStation account can join. It does not require a PlayStation Plus membership and will first debut in Asia today, September 29, North and South America on October 5, and Europe and Australia on October 13. PlayStation Stars works by rewarding players who complete campaigns and activities like a Monthly Check-in campaign--essentially just playing any game--or earning specific Trophies. \n\nSTAMPS\n00:00 - Intro\n00:09 - Google Stadia\n02:13 - PlayStation Stars", "link": "https://www.youtube.com/watch?v=jQvlETeZrCQ", "date_published": "2022-09-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Callisto Protocol | The Truth of Black Iron Official 4K Trailer", "description": "The Truth of Black Iron - Discover what terrifying secrets lie beneath Black Iron Prison in The Callisto Protocol, an all-new sci-fi survival horror game coming to PC and Consoles on December 2, 2022. \n\nPre-order now! callistoprotocol.com", "link": "https://www.youtube.com/watch?v=bFjSkHwWB5A", "date_published": "2022-09-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]