[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Blight: Survival – Official Gameplay Reveal", "description": "Check out 5 minutes of pre-alpha gameplay footage for Blight: Survival a third person action adventure survival game.\n\n#blightsurival #gaming", "link": "https://www.youtube.com/watch?v=XLkFmbMusQI", "date_published": "2022-11-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Scarlet and Pokémon Violet Gimmighoul Official Story Trailer", "description": "Learn more about Gimmighoul who has not only made its way into Pokemon Go but also making its way into Pokemon Scarlet and Violet. Learn more about the Pokemon's backstory in this latest trailer.\n\nMr. Jacq and Professor Willow discuss what they know about the newly discovered Pokémon, Gimmighoul. \n\n#pokemonscarletandviolet #pokemon #gaming", "link": "https://www.youtube.com/watch?v=KaAn7OGvzII", "date_published": "2022-11-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Viking And Norse Mythology Experts React To God of War | Expert Reacts", "description": "Jacob Bernander and Askur Ingvaldsson from The Viking Museum in Stockholm are joining us to break down some of the Viking and Norse mythology inspirations and history from God of War, from the Leviathan Axe, Draugr, Valkyries, Norse Gods, Ragnarok and more. \n\nIf you want to see more Expert Reacts videos, as well as everything you might want or need to know about God of War: Ragnarok, make sure to subscribe.\n\nThe Viking Museum:\nWebsite: https://thevikingmuseum.com/en/\nYouTube: https://www.youtube.com/channel/UC_BxoD7yn4s738RybKZPphg\nInstagram: instagram.com/thevikingmuseum/\nFacebook: https://www.facebook.com/thevikingmuseum/", "link": "https://www.youtube.com/watch?v=C2UH-zUOiSI", "date_published": "2022-11-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "17 Things COD: Modern Warfare 2 Players Discovered So Far", "description": "From cheesing XP to level quickly, to the new slide cancel, and finding strange places to hang off of, the Modern Warfare 2 community has been hard at work testing multiplayer while waiting for Warzone 2.0. Here’s what you’ve found so far.", "link": "https://www.youtube.com/watch?v=8wIdtC2Dqcc", "date_published": "2022-11-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Call of Duty: Modern Warfare 2 (2022)’s Multiplayer Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down more of the weaponry of Call of Duty: Modern Warfare 2 (2022), including the AKS-74U, a suppressed M4 shotgun, and Jonathan’s favourite, the MP5.\n\n00:00 - Opening\n00:38 - AKS-74U\n02:14 - SA-B 50\n03:27 - AR-57\n05:06 - 556 Icarus\n06:25 - Marlin Model 336\n08:15 - Benelli M4 Super 90\n09:45 - M16A3\n10:29 - HK94A3\n12:46 - Smith and Wesson Model 500 (with snake shot)\n13:42 - Gepard GM6 Lynx\n16:26 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down more of the guns of Call of Duty: Modern Warfare 2 (2022) and compares them to their real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=7MIMXFeKMVU", "date_published": "2022-11-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 Ramattra Official Reveal Trailer", "description": "Ramattra’s story is complex and multifaceted, and his ultimate goal is to protect his people, but the cost of that goal is still to be determined.\n\nOriginally a war machine, Ramattra shed his munitions for a shield to protect his people by promoting peace and tranquility. His ideals weren’t far removed from his fellow Shambli monk, Zenyatta. However, Ramattra’s story is one of hardships, trauma, and a magnified view of humanity’s harsh realities.\n\nHarmony was replaced by dissonance, and Ramattra began to approach his convictions from a more pragmatic angle—justifying any means necessary to defend his fellow omnics. As the leader of Null Sector, Ramattra boasts incredible support from his people, and he is primed to impose his philosophies on our world.\n\nRamattra will join the tank lineup at the beginning of Season Two, starting December 6. \n\n#overwatch2 #overwatch #gaming", "link": "https://www.youtube.com/watch?v=f9JIpDJ8avg", "date_published": "2022-11-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]