[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "From 'Milkshake' to Veggies, Kelis and Ron Finley Share Their Farm Journeys", "description": "Grammy-nominated recording artist Kelis has long had a creative connection to food. It's right there in her music, with tracks like \"Milkshake,\" \"Midnight Snacks,\" and \"Jerk Ribs\" — she even has an entire album titled Food. But Kelis' passion for gastronomy extends beyond her music: She graduated from Le Cordon Bleu, released her own cookbook, and most recently, bought a farm in Temecula, Calif., where she lives with her family. \n\nJust a few hours away in South Central Los Angeles, Ron Finley, the \"Gangsta Gardener,\" is spreading his own message of urban gardening. You might recognize him from his Masterclass — it's one of the platform's most popular courses — or his TED talk on guerrilla gardening, which has amassed over a million views. \n\nIn 2010, Finley planted fruits and vegetables on the parkway in front of his house, which violated a Los Angeles city code that he eventually got changed. Since then, he's worked to build gardens throughout his city, with the goal of turning food deserts into food sanctuaries.\n\nWe arranged for the two of them to chat — Kelis from her farm, Ron in his garden — about the joys of growing your own food, the relationship between Black people and the land, and how to handle a mean rooster.", "link": "https://www.youtube.com/watch?v=fv3kgm18Q7I", "date_published": "2022-02-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Patti LaBelle: Tiny Desk (Home) Concert", "description": "NPR Music's Tiny Desk series will celebrate Black History Month with Tiny Desk (home) concerts featuring legends in the world of R&B, jazz, gospel, and hip-hop. Each artist in this legacy lineup has helped to define Black music as we know it and will be performing a Tiny Desk concert for the first time.\n\nBobby Carter | February 23, 2022\nThe first song in Patti LaBelle's Tiny Desk (home) concert sets the tone and quickly sums up the entire 15-minute performance. \"Something Special (Is Gonna Happen Tonight)\" from her 1986 album Winner In You is a highlight from one of many chapters in her fabulous career. A backstage corner of a concert hall in Austin, Texas, is transformed into Patti's world, furnished with a throne, flowers and trunks full of shoes. Options are a must, given a knack for kicking off her shoes during shows. The entire band managed to fit onto the set: thirteen people, including fierce background vocals, keys, horns and more, to recreate some of the best from the Godmother of Soul.\n\nLaBelle and company go straight into hits mode after the first number. \"Love, Need and Want You\" is delivered with the same vibrancy as the 1983 original, with a wink to another hit, \"Dilemma,\" by Nelly, who sampled it 19 years later. The ballads continue with \"If Only You Knew.\" She closes with the anthem \"Lady Marmalade,\" which was also revived in the early 2000s by Christina Aguilera, Mya, Pink and Lil' Kim.\n\nMs. Patti had already made Black History with Cindy Birdsong, Sara Dash and Nona Hendryx as the powerhouse group Patti LaBelle and the Bluebelles (later Labelle). After the group disbanded, she forged through on her own as a pioneer in music, style and entrepreneurship. Sixty years and counting. Whether big stage or Tiny Desk, the standard-bearing icon continues to exude elegance and grace as a performer.\n\nSET LIST\n\"Something Special (Is Gonna Happen Tonight)\"\n\"Love, Need and Want You\"\n\"If Only You Knew\"\n\"Lady Marmalade\"\n\nMUSICIANS\nPatti LaBelle: vocals\nStan Lewis: keys/music director\nDanny Nixon: keys\nDaryl Robertson: keys\nEric Seats: drums\nAlex Evans: bass\nEric Dubose: guitar\nJeff Bradshaw: trombone\nMelvin Jones: trumpet\nMichael Burton: saxophone\nDebra Henry Ramsey: vocals\nBrenda Roy: Background vocals\nAnthony Williams Jr: vocals\nAja Marie Grant: vocals\n\nCREDITS\nVideo Director: Whitney Thomas\nAudio Engineer: Dwayne Jones\nRecording Engineer: Brandon Snell\nManagement: Zuri Edwards\nProduction Manager: Joe Falcon\nRoad Manager: Pamela Hobson\nGuitar Tech: Alfonso Perez\nBackline Tech: Gabriel Santana Falcon, GearHeadz Inc.\nTechnical Director: Blake Addyson\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Joshua Bryant\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Kara Frame, Maia Stern, Ashley Pointer, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=iX_ubL2-sfs", "date_published": "2022-02-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]