[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCmFeOdJI3IXgTBDzqBLD8qg", "title": "TikTok: The Most Evil Business In The World", "description": "Sign up to Morning Brew for free today https://morningbrewdaily.com/moon\nSponsored by Morning Brew\n\nTiktok is cringe and is causing a mental health epidemic. You'll never watch tiktok after this.\n\nSupport the channel here (all money goes straight back into the channel):\n►  Become a Patron:  https://www.patreon.com/MoonReal\n► Follow my Twitter: https://twitter.com/MoonRealYT\n\n00:00  Pipeline Stage 1\n02:13 Morning Brew\n03:05 Pipeline Stage 2\n05:45 Ticsandroses\n08:18 Pipeline Stage 3\n11:05 Pipeline Stage 4\n13:29 The Darkest Stage\n\n\nTiktok culture is breeding a new age of Tiktok cringe. However Tiktok isn't just cringe, Tiktok is ruining society. Tiktoker's such as Charli D'Amelio and Bella Poarch are promoted because the Titok algorithm rewards hedonism. However, Tikok's design is also ruining generation z's attention span and destroying their short-term memory. But as Tiktok culture distracts you with Tiktok' cringe videos, you'll be to consumed to read Tiktok's privacy page which admits to sending all your data back to China's government, too notice. This is why Tiktok is cancer. Tiktok is a psychological weapon and we have to stop watching Tiktok videos/memes.Because Tiktok is destroying education. This video details how tiktok makes money.  Tiktok is a psychological weapon and is one of the evilest businesses in modern history. TikTok is trash because Tiktok makes money from your misery. Tiktok is garbage because it is funding China's 2049 plan. CCP's Bytedance is making billions of dollars from AI technology that is ruining society. Tiktok makes money by destroying society and culture. Tiktokers are making millions of dollars and making lots of money from selling out to the business of China's Bytedance which is why Tiktok is bad and Tiktok is trash.", "link": "https://www.youtube.com/watch?v=9j68gYP57EE", "date_published": "2022-06-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]