[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Unity Desktop: Still good in 2022?", "description": "Use code LINUXEXPERIMENT to get 25% off your 2TB cloud storage plan on Internxt: https://internxt.com/pricing\nGrab a brand new laptop or desktop running Linux: https://www.tuxedocomputers.com/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMastodon: https://mastodon.social/web/@thelinuxEXP\n\nPixelfed: https://pixelfed.social/TLENick\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\nThis video is distributed under the Creative Commons Share Alike license.\n\n\n00:00 Intro\n00:59 Sponsor: Store your files securely and privately with Internxt\n02:07 Dock and global menu: does it still work?\n07:45 The Dash and the HUD: a bit outdated\n11:34 Window management and performance\n14:04 Does Unity still hold up in 2022?\n16:13 Sponsor: Get a laptop or desktop running Linux with Tuxedo\n17:32 If you won the lottery...\n\n#Unity #Linux #DesktopEnvironment\n\nSo, first, Unity is a shell, not really a desktop environment: it doesn't provide its own set of apps.\n\nThe Dock, or launcher, as they call it, holds the Dash button, with the Ubuntu logo, as well as app shortcuts and opened applications, and everything else you might have plugged in, like hard drives. There's also the trash can at the bottom.\n\nRight clicking an app brings a jump list with a few contextual options depending on the application.\n\nThe dock displays all opened windows on all workspaces, and clicking the app's icon will take you to that workspace with a nice little animation.\n\nLong pressing the super key brings numbers for each app shortcut. Pressing that number will launch the app, and you also get a nice recap of all keyboard shortcuts, of which there are many.\n\nTo round up the base behavior of the dock, you can tune a few things, like autohiding it, or displaying the workspace switcher  as well as a show desktop icon, and you can change the icon size.\n\nNow, let's talk about the top panel. It holds the current focused app's name, the global menu bar, and the system indicators.  That global menu isn't always displayed by default, it's hidden, and you have to hover over it to reveal it.\n\nAnother nice thing that Unity does with its top bar is using it as the titlebar: when you maximize a window, its titlebar disappears, and is merged with the top bar, which means you're saving precious vertical space.\n\nThe Dash opens when you click the Unity button, with the ubuntu logo, or when you hit the Super key. It's kind of the precursor to the GNOME app grid, but with a bit more power to it. It has global search, to let you find anything you want: apps, files, videos, music, pictures, or folders. \n\n**You also don't get Amazon search results anymore, which is unfortunate, I liked these. Ok, no, I'm lying, that was horrible and privacy invasive**\n\nThe lenses at the bottom don't feel super practical anymore. For example, you can't move apps around or create folders, which makes it a bit less useful than the GNOME apps grid. For documents, and pictures, it's ok, as it's an easy way to find the recent documents you interacted with.\n\nPressing ALT summons the HUD. It allows you to find an action, or menu item related to the current open window, and just type to find it.\n\nYou also get window tiling. Just drag an app to a screen edge, and it's tiled there, or drag it to the top, and it's maximized. You can drag the whole top bar down to unmaximize, which is handy.\n\nThen you have the workspace switcher. Clicking it zooms out on a grid of all your virtual desktops, there are 4 by default, and you can move apps directly from one to another by just dragging them.\nIf you have multiple windows opened at the same time, clicking on the dock's icon brings an overview of all of them, which is extremely nice.\n\nOn the performance side of things, Unity used up 1.5GB of RAM out of 16, which is on par with modern GNOME or KDE when you have that amount of available RAM, maybe a little bit higher.", "link": "https://www.youtube.com/watch?v=CRTPfLOnoRU", "date_published": "2022-06-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]