[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "8 Biggest Unanswered Questions From The Jan 6th Hearings", "description": "The January 6th hearings ended in an epic fashion. Still, we came away from season one with several unanswered questions. Here they are, burning in our minds.\n\nBecome a premium subscriber:  https://babylonbee.com/plans\n\nThe Official The Babylon Bee Store:  https://shop.babylonbee.com/\n\nFollow The Babylon Bee:\nWebsite: https://babylonbee.com/\nTwitter: https://twitter.com/thebabylonbee\nFacebook: https://www.facebook.com/TheBabylonBee\nInstagram: http://instagram.com/thebabylonbee", "link": "https://www.youtube.com/watch?v=bVr9Jjmyg3E", "date_published": "2022-08-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "LIVE: The Journey of Adaptation", "description": "On the Edge of the Dark Sea of Darkness a small family farm resides, the Igby Farm. That is where our story begins! Chris and Andrew will be on LIVE to discuss the adaptation process in the upcoming Season 1 of The Wingfeather Saga! We will be revealing updates and perhaps some exclusive stuff so you won’t want to miss it. And Wingfeather fan, Kyle Mann from Babylon Bee will drop by to share his perspective on the series and his love of fantasy stories.\n\nPack your gear and get ready because….adventure awaits!\n\nSubscribe to Wingfeather now for more content: https://bit.ly/3PVCxNJ \n\nLearn more about this epic adventure at angel.com/wingfeather\n\nDisclosure: The Wingfeather Saga is “testing the waters” to gauge investor interest in an offering under Regulation Crowdfunding. No money or other consideration is being solicited, and, if sent, will not be accepted. No offer to buy the securities can be accepted and no part of the purchase price can be received until the offering statement is filed and only through an intermediary’s platform. A prospective purchaser’s indication of interest is non-binding.\n\nThe Wingfeather Saga has entered into a Campaign Booster and Loan Agreement with Angel Studios, Inc. and granted Angel Studios an option to distribute its series as consideration for Angel Studios providing a monetary loan as well as assistance and expertise in the television/film production and advertising space while The Wingfeather Saga is trying to raise money to fund the production of the series. If Angel Studios exercises the option to distribute The Wingfeather Saga, Angel Studios will share in the revenues generated by the series. The Wingfeather Saga may also use a portion of the proceeds to repay the loan from Angel Studios.", "link": "https://www.youtube.com/watch?v=mTfr5oCm3yQ", "date_published": "2022-08-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]