[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Alex G: Tiny Desk Concert", "description": "Marissa Lorusso | December 7, 2022\n\"I don't have a lot to say,\" Alex Giannascoli, who performs as Alex G, says with a laugh after his first song behind the Tiny Desk. Judging from his discography alone, that's not something you might ordinarily accuse the Philly singer-songwriter of: nine full-length albums in the last dozen years, in addition to a couple EPs and a film soundtrack. His prodigious output of melodic, peculiar indie rock has earned him a cult-beloved status. True, he got to play guitar on a couple Frank Ocean tracks — but for a more accurate indication of the fervor of his fanbase, turn your attention to the internet: the hours-long playlists of unreleased Alex G demos painstakingly assembled by fans on YouTube, for example, or the raucous chatter among his fans on message boards.\n\nAt the Tiny Desk, Alex G and his band dialed down the volume for a handful of songs from across his vast discography. They started with a couple songs from his stellar new album, God Save The Animals, and also played some deeper cuts: \"Gretel,\" a wonderfully creepy track from 2019's House of Sugar, and \"Snot,\" the closer from 2015's Beach Music. Under the layers of electronics, experimentation and vocal effects on Alex G's studio records, you might lose sight of Giannascoli's primary strength as a songwriter and the emotional core of his music. But at the Tiny Desk, the stripped-down sound only underscored the sturdiness of his craft — no explanation required.\n\nSET LIST\n\"Runner\"\n\"Miracles\"\n\"Gretel\"\n\"Snot\"\n\nMUSICIANS\nAlex Giannascoli: vocals, guitar\nSamuel Acchione: guitar, vocals\nJohn Heywood: bass, vocals\nThomas Kelly: drums\nMolly Germer: violin, piano\n\nTINY DESK TEAM\nProducer: Marissa Lorusso\nDirector/Editor: Joshua Bryant\nAudio Engineer: Josh Rogosin\nCreative Director: Bob Boilen \nSeries Producer: Bobby Carter\nVideographers: Joshua Bryant, Pierre Kattar, Sofia Seidel, Alanté Serene\nAudio Assistant: Natasha Branch\nProduction Assistant: Jill Britton\nTiny Desk Team: Suraya Mohamed, Hazel Cills, Kara Frame, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #alexg", "link": "https://www.youtube.com/watch?v=qyPquozbCOQ", "date_published": "2022-12-07 10:00:32+00:00", "persistent": false, "user": null, "language": "en-US"}]