[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Leif Ove Andsnes: Tiny Desk (home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\n\n\nTom Huizenga | April 8, 2022\n\nThe Norwegian pianist Leif Ove Andsnes is binging Mozart. He's just released his second double album in a row of the composer's piano music, and for this very special Tiny Desk performance, he takes us inside Mozart's own home in Vienna, just steps away from the medieval St. Stephen's Cathedral and a couple blocks from a McDonald's.\n\nMozart might have appreciated the convenience of the fast food chain, as the years he spent in this two-floor, four-bedroom apartment (from 1784 to 1787) were a non-stop frenzy of activities. Andsnes says the composer threw gambling parties, taught students and, above all, composed some of his most groundbreaking music in this house, including the two works heard in this recital.\n\nAndsnes begins with four minutes of radiant joy and virtuosity. The D major Rondo showcases not only Mozart's own skills as an unrivaled keyboardist, but also his genius as a composer with a bottomless bag of tricks to play with the music's principal theme.\n\nThe following Fantasia in C minor, composed one year earlier, in 1785, couldn't be more different. At three times the Rondo's length, it begins in a foreboding tone, with heavy, darkly colored chords, sounding perhaps like Beethoven in a bad mood. But the clouds soon open to rays of sunshine in melodies only Mozart could create, including a recurring passage of intense delicacy and yearning, which Andsnes delivers with the sensitivity of a lover's whisper. In its many fascinating mood swings, the piece feels like Mozart simply sat down in these rooms and improvised his mixed emotions. And thanks to Andsnes, we can catch a vibe of what that might have sounded like.\n\nSET LIST\nMozart: Rondo in D Major, K. 485\n\nMozart: Fantasia in C Minor, K. 475\n\n\nMUSICIANS\nLeif Ove Andsnes: piano\n\n\nCREDITS\nVideo and audio: Anthony Jacobson, Perdurabo Film\n\nRecorded at: Mozarthaus Vienna\n\n\nTINY DESK TEAM\nProducer: Tom Huizenga\nVideo Producer: Michael Zamora\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Joshua Bryant, Maia Stern, Ashley Pointer\nExecutive Producer: Keith Jenkins\n\nSenior VP, Programming: Anya Grundmann\n\n\n#nprmusic #tinydesk #LeifOveAndsnes", "link": "https://www.youtube.com/watch?v=6hpERoSmq74", "date_published": "2022-04-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]