[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Informed Consent for 4th dose", "description": "Protection by a Fourth Dose of BNT162b2 against Omicron in Israel\n\nhttps://www.nejm.org/doi/full/10.1056/NEJMoa2201570\n\nJanuary 2, 2022, Israel, fourth dose of BNT162b2 to over 60s\n\nEffect on infection and severe coronavirus disease\n\nMETHODS\n\nIsraeli Ministry of Health database\n\n1,252,331 over 60s eligible for the fourth dose\n\nOmicron predominant, (January 10 through March 2, 2022)\n\nConfirmed infection and severe Covid-19\n\nStarting at 8 days after receipt of a fourth dose, (four-dose group)\n\nCompared with (three-dose group)\n\nReceived a fourth dose 3 to 7 days earlier (internal control group)\n\nRESULTS\n\nNumber of cases of severe Covid-19 per 100,000 person-days\n\nFour dose group, 1.5\nThree dose group, 3.9\nInternal control group, 4.2\n\nAdjusted rate of severe Covid-19\n\nJanuary 10, 2022, to March 2, 2022\n\nIn the fourth week after receipt of the fourth dose\n\nFour dose group, lower than that in the three-dose group by a factor of 3.5\n\nFour dose group, lower than that in the internal control group by a factor of 2.3\n\nProtection against severe illness did not wane during the 6 weeks after receipt of the fourth dose. \n\nThe number of cases of confirmed infection per 100,000 person-days (unadjusted rate)\n\nFour dose group, 177\n\nThree dose group, 361\n\nInternal control group, 388\n\nConfirmed infection in the fourth week\n\nJanuary 10, 2022, to March 2, 2022\n\nFour dose group, lower than that in the three-dose group by a factor of 2.0\n\nFour dose group, lower than that in the internal control group by a factor of 1.8\n\nHowever, this protection waned in later weeks.\n\nCONCLUSIONS\n\nRates of confirmed SARS-CoV-2 infection and severe Covid-19 were lower after a fourth dose of BNT162b2 vaccine than after only three doses. \n\nProtection against confirmed infection appeared short-lived, whereas protection against severe illness did not wane during the study period.\n\nWe excluded the following persons from the analysis\n\nthose who had had a confirmed SARS-CoV-2 infection before the beginning of the study,\n\nSo this tells us nothing about the effect of natural immunity\n\nPlease can we have data on vaccine induced immunity\n\nversus natural infection induced immunity\n\nAND\n\nEfficacy of fourth dose versus two or three dose hybrid immunity", "link": "https://www.youtube.com/watch?v=omluuvCTRf4", "date_published": "2022-04-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]