[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends: Saviors Newcastle Stories from the Outlands \"Hero\" Trailer", "description": "Newcastle is the hero of Harris Valley. But who is the man beneath the shining armor?\n\nApex Legends is a free-to-play hero shooter game where legendary characters battle for glory, fame, and fortune on the fringes of the Frontier. Play for free now on PlayStation 4, PlayStation 5, Xbox One, Xbox Series X|S, Nintendo Switch, and PC via Origin and Steam.\n\n#ApexLegends #Saviors", "link": "https://www.youtube.com/watch?v=MaWozexbYmM", "date_published": "2022-04-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best Xbox Game Pass Games To Play Right Now", "description": "Big new releases seem few and far between these days, but there’s still plenty to play, especially if you’ve got Xbox Game Pass. Here are 8 games to check out if you’re subscribed to Microsoft's service.\n\nXbox Game Pass, Microsoft's gaming subscription service,  is often referred to as the best deal in gaming, and for good reason. Each month, multiple games are added to its rotating catalogue of titles, a mix of first-party Xbox games, indies, and other huge games.  If you have Game Pass Ultimate, you get EA Play thrown in as well, meaning you can replay the Mass Effect franchise to your heart's content. \n\nIf you're looking for something new to play, or just feel overwhelmed by the sheer amount of games available, then have no fear, in this video, we're going to tell you the best games to play on Xbox Game Pass. There's something for everyone, from wholesome games like Life is Strange: True Colors and Bugsnax, to more intense titles like 7 Days To Die.\n\nEach month, GameSpot highlights the best games on Xbox Game Pass, so make sure you subscribe to get the best recommendations.", "link": "https://www.youtube.com/watch?v=JvCz8zR9R0o", "date_published": "2022-04-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xbox & Bethesda Showcase Date Announced Following E3 Cancelation | GameSpot News", "description": "The Xbox and Bethesda Showcase Announced For June 12, Activision Blizzard Shareholders Approve Sale To Microsoft and Modern Warfare 2's logo is revealed.\n#GamingNews #Xbox #ModernWarfare2\n\nThe Xbox & Bethesda Games Showcase will take place on Sunday, June 12 at 10 AM PT / 1 PM ET. Microsoft did not provide any specifics regarding games on display at the event, but Bethesda's Starfield is a safe bet. Microsoft also has new Fable and Forza Motorsport games in the works that could be shown off.\n\nActivision Blizzard shareholders today voted on whether or not to approve the proposed acquisition of the company by Microsoft, and they overwhelmingly approved the deal. The publisher has announced that over 98% of shares voted in favor of the deal\n\nThe official logo for Call of Duty: Modern Warfare 2 has been revealed. Ananimation appears to include some indistinct chatter, along with lines on what looks like a topographical map. Perhaps the audio and other assets contain clues about the game.\n\nSTAMPS\n00:00 - Intro\n00:08 - Xbox Showcase\n01:20 - Activision Blizzard & Xbox\n02:35 - Modern Warfare 2", "link": "https://www.youtube.com/watch?v=V7W5O7VpB1U", "date_published": "2022-04-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring’s Malenia Gets Easier… We'll Explain | GameSpot News", "description": "Elden Ring patch fixes boss bug that made Malenia even harder, PS5 VRR Support Is Already Out Without An Update. \n#GamingNews  #EldenRing #GTAV\n\nAccording to the 1.04 patch notes, this new update \"fixed a bug with Malenia in which her HP was not healed correctly in the online multiplayer environment.\" Other changes include a vague fix for a bug that \"caused some bosses to die at unintended times,\" meaning our days of cheesing could be coming to an end. Fingers crossed those days aren’t completely over though.\n\nPS5s now have variable refresh rate support. A simple reboot of your PS5 should let you access VRR via the PS5 Display settings menu, allowing you to enable it if you have the console connected to a supported display.\n\nGrand Theft Auto V on PlayStation 5 and Xbox Series X|S has added some welcome updates. The biggest change is a new motion blur slider, allowing players to tone down or completely turn off motion blur. The update also fixed a bug on Xbox where in-game music would be muted when players were in an Xbox Live Party, as well as a handful of other issues affecting audio on the Xbox.\n\nSTAMPS\n00:00 - Intro\n00:06 - Elden Ring\n00:58 - PS5 VRR\n02:01 - PS+ Games\n02:16 - GTA V", "link": "https://www.youtube.com/watch?v=9yY9vZ3WDtY", "date_published": "2022-04-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Nintendo Switch Sports Review", "description": "Nintendo Switch Sports doesn't feel like it's trying to revitalize a trend. Instead, it recaptures the simplicity of Wii Sports and, in doing so, rekindles the same magic.", "link": "https://www.youtube.com/watch?v=E9nxw255xc8", "date_published": "2022-04-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sniper Elite 5 Preview - Killer Sandbox", "description": "Sniper Elite 5 expands gun customization, adds puzzles, and new non-lethal ways to stop Nazis. We spent two hours on the expansive Occupied Residence map and here’s what you should know. \n\nSniper Elite 5 gets the series back to killing Nazis after recent games focused on the undead with Zombie Army 4: Dead War and a VR title. We spent two hours on the Occupied Residence map, and here’s what you should know. Sniper Elite 5 has a wide range of classic World War 2 weapons like the M1903 Springfield and Karabiner 98 as well as experimental prototypes, including the SREM-1Enfield bullpup sniper rifle, BSA Welgun submachine gun. The game has lots of customization, and you can go find a workbench located around each level and swap out ammo types, magazines, stocks, grips, barrels, and scopes. A lot of the customization is tasteful to the period, with a few exceptions, including some front grips and non-lethal ammo. \n\nThe level that we played felt very Hitman-inspired, with tons of ways to take down enemies, including environmental hazards, booby traps, mines, exploding objects, non-lethal takedowns, and of course, long-range shooting. Developers at Rebellion want to accommodate a wide variety of playstyles which they broke into stealth, control, power, and speed. Around that idea, the map has tons of different terrain and routes, from open farm fields to underground bunkers. There is a lot of vertical space with vines to climb and ziplines. The map also has a number of secrets and unlockable starting points to make it more replayable. Some of these include finding intelligence on targets, finding objects on one side of the map to unlock items on the other, and the ability to blow open doors or go find the right enemy with the key to do it silently. \n\nSniper Elite 5 releases on May 26th on all major platforms, including PlayStation 4, PS5, Xbox Series X|S, and PC.", "link": "https://www.youtube.com/watch?v=ftzf04CmLgA", "date_published": "2022-04-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Stanley Parable: Ultra Deluxe Review", "description": "It's incredibly bold to hide away a sequel to a game in an expanded re-release of the original experience. But when it comes to something as enjoyably strange and hilariously obtuse as The Stanley Parable, it makes sense--in fact, the idea that The Stanley Parable: Ultra Deluxe would be anything else seems foolish in hindsight.", "link": "https://www.youtube.com/watch?v=GiCVCZyV7c4", "date_published": "2022-04-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]