[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Contest Top Shelf: Bob Boilen and Bobby Carter", "description": "NPR Music received thousands of submissions to this year's Tiny Desk Contest, our annual search for the next great undiscovered artist to play a Tiny Desk concert. Before we reveal this year's winner, our Contest judges are sharing their favorite entries as part of our annual Tiny Desk Contest Top Shelf livestream series.\n\nFeatured entries in this episode:\n- Selina Moon, “Let It Go” https://youtu.be/eb3mdX9NSbQ \n- A Very Special Episode, “Cowboy” https://youtu.be/ZCP9L17cVwA\n- Kevonna Rose, “Thirty3” https://youtu.be/Z08Daadur14\n- dolltr!ck, “In The Blue” https://youtu.be/X38VQMyRxAk \n- Lauren Frihauf, “Fragments of a Stranger” https://youtu.be/HzngMnHs4ws \n- Blvck Spvde and the Cosmos, “\"parallel I live again\" https://youtu.be/pTPL2zRP9Qw \n- Sophia Subbayya Vastek, “The Seas That Made Us” https://youtu.be/RjC-b6ZYp2s \n- Rebirth Canal, “AI\" https://youtu.be/OxKcCyGJ91A\n\nLearn more about the Contest: https://npr.org/tinydeskcontest", "link": "https://www.youtube.com/watch?v=9E4knj71GRE", "date_published": "2022-04-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Roger Eno: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nTom Huizenga | April 27, 2022\nRoger Eno’s home is part of what once formed an 11th-century abbey called St. Wilmott’s, situated on the border of Norfolk and Suffolk near England’s southeastern coast. The bucolic setting mirrors Eno’s quiet, slowly evolving music which, for this Tiny Desk (home) concert, features five pieces from his new album The Turning Year.\n \nEno refers to his process as “decomposing,” taking the time to strip away all nonessentials to finally arrive at something more pure and perhaps more powerful. He opts for quality over quantity. Every note, carefully chosen, seems to have its own preeminence. At an old upright piano — with the sustain pedal firmly engaged — Eno taps out his slender but potent melodies, gently conducting his string players as they float above and between the notes, providing color and warmth.\n \nWhile there’s an Erik Satie-inspired Zen quality to “A Place We Once Walked,” with its seesawing rhythm, the feather-light notes of “Something Made Out of Nothing” recall the deep ambient spaces that Eno created with his older brother Brian on their 1983 album Apollo: Atmospheres & Soundtracks. In his writing about The Turning Year, Roger Eno says he thinks of these pieces as “a series of short stories or photographs of individual scenes, each containing their own character.”\n \nTo close the performance, Eno introduces his two daughters Cecily and Lotti who sing an arrangement of “Bells.” On the album, it’s a typically wistful Eno piece for solo piano, but the harmonizing voices here give the music a lullaby quality — and offer up a taste of what it must be like to make music with the Eno family.\n\nSET LIST\n“Clearly\" \n“The Turning Year\" \n“A Place We Once Walked”\n“Something Made Out of Nothing”\n“Bells” (feat. Cecily Eno & Lotti Eno) \n\nMUSICIANS\nRoger Eno: piano, composer\nZara Benyounes: violin I\nVenetia Jollands: violin II\nStephen Upshaw: viola\nReinoud Ford: cello\nCecily Eno: vocalist, vocal arrangement on “Bells”\nLotti Eno: vocalist\n\nCREDITS\nDave Meyer: Camera operator, editor\nNeil Foster: Camera operator\nDylan Barber: Sound engineer\nRecorded at St. Wilmott’s Abbey (Roger Eno’s/Bee Eno’s Home), Suffolk\n\n\nTINY DESK TEAM\nProducer: Tom Huizenga\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Joshua Bryant, Michael Zamora, Maia Stern, Ashley Pointer\nVP, NPR Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n\n#NPRMusic #TinyDesk #RogerEno", "link": "https://www.youtube.com/watch?v=gnKRe1-zF28", "date_published": "2022-04-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]