[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "There will NEVER be a year of the Linux desktop, but...", "description": "Get 100$ credit for your own Linux and gaming server: https://www.linode.com/linuxexperiment \n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\nYou can also protect your privacy by using this extension from Startpage, each install helps the channel with a small commission: https://add.startpage.com/en/protection/?campaign=4&source=aff \n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:33 Sponsor: 100$ off your Linux or Gaming Server\n01:25 What is The year of The Linux Desktop?\n03:22 The Linux Desktop is Good Enough\n05:35 Unfair Comparisons\n07:39 Quality isn't The Main Factor\n10:18 We Don't Need to Beat Windows\n12:38 There Won't Be a Year, But...\n14:13 Sponsor: Get a Linux Laptop or Desktop with Slimbook\n14:57 Support the Channel\n\nBasically, it's the year that Linux is finally \"good enough\" that anyone could use it, with the added expectation that Linux would then overtake windows or mac os, or both in terms of market share, and become progressively the dominant OS on desktops and laptops.\n\nLinux IS already good enough. It's a matter of habit, not a matter of quality. Not anymore. So is THIS the year of the Linux desktop? No. Because quality itself has NEVER been the factor that would make Linux finally take off. In terms of Quality, Linux is already there.\n\nThe Linux desktop has progressed in leaps and bounds over the past 10 to 15 years. Ubuntu made it more popular and well known, and together with other user-facing distros, and GNOME, and KDE, and the rest of the community they made our desktops 100% usable by anyone.\nSo why do people think Linux desktops aren't READY to begin the \"year of the Linux desktop\" ?\n\nThe issue here is that Linux doesn't compete with Windows on an equal footing. People compare the experience of running Linux on hardware that's never been tested for it, using apps they're not familiar with, running programs that were never coded for Linux.\n\nBut if Linux IS good enough for most people, doesn't that mean that the Year of the Linux desktop already happened?\n\nWell, no, not really. Because we're still not at a point where most people would even consider using Linux as their daily driver. There are still way too much \"bad first impressions\" floating around, too many preconceived notions about Linux.\n\nThis quality doesn't matter if people don't even give Linux a try. And regular people will NOT install any OS from the internet and replace the default.\n\nAnd once again, we end up at that same point I've been trying to hammer over and over again: Linux needs hardware to be used more, to be known more.\n\nThere's also a notion floating around that Linux needs to \"beat\" windows or mac OS to win. That it needs to overtake these systems in terms of market share to be relevant. Fortunately, that's not the case.\n\nSome will say that people wouldn't buy anything with Linux preinstalled on it, because it doesn't run the same apps they're used to, and I disagree. People move from Windows to mac OS, and vice versa. Mac OS doesn't run windows apps. Like, at all. Sure, it has versions of some popular apps, but not all of them. But most of the apps on these systems aren't the same. The system itself works very differently, from app launching, to app installs, to restoring the system, minimizing, even maximizing windows, menubars, and more. And yet, people do use macs, even if they used windows before.", "link": "https://www.youtube.com/watch?v=2JVeepNxeFo", "date_published": "2022-04-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]