[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCFQMnBA3CS502aghlcr0_aw", "title": "The FULL Ice Poseidon Interrogation", "description": "This is the full call between myself and Ice Poseidon when I caught Ice Poseidon taking over $500,000 from the crypto project CXCOIN... so I confronted him about it. \n\nPaul Denino, or Ice Poseidon launched CXCOIN in July and told his skeptics that there was nothing to worry about... the money was \"locked away\"... this was a \"long-term project\". \n\nIt turns out this was all a lie. Paul Denino, Ice Poseidon admits now on audio for the first time that he was not telling the truth about this being a long-term project... instead he worked on it for about \"2 weeks\". \n\nHe took $200K from the presale wallet, there's now $250K from the marketing wallet that is missing and he admits to taking out over $290K from the liquidity pool of CXCOIN. \n\nWhen asked if he's going to return the money, Paul Denino said he's going to \"look out for myself\". Today we're exposing Ice Poseidon's TRUE intentions behind CXCOIN and why the project has now crashed.\n\nIF YOU'VE BEEN SCAMMED BY CXCOIN, PLEASE REPORT YOUR LOSSES AND STORY TO https://www.ic3.gov\n \nFollow Coffeezilla: \n► Twitter: https://twitter.com/coffeebreak_YT\n► Instagram: https://www.instagram.com/coffeebreak_yt/\n🎶 Music: https://www.youtube.com/watch?v=nMSQ1yoPT2c&list=PL4qw3AkxFDSNhEgawXD1j6r0iN1072XIB&index=1\nCredits: \n3D Artist: Ed Leszczynski https://www.instagram.com/ed_leszczynski/\nVideo Editor: Harry Bagg  https://twitter.com/HarryBagg96\n\nThis video is an opinion and in no way should be construed as statements of fact. Scams, bad business opportunities, and fake gurus are subjective terms that mean different things to different people. I think someone who promises $100K/month for an upfront fee of $2K is a scam. Others would call it a Napoleon Hill pitch.", "link": "https://www.youtube.com/watch?v=ILSvHj2Br2c", "date_published": "2022-02-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]