[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Ghostwire: Tokyo Deep Dive Gameplay Showcase", "description": "Get a look at over 9 minutes of brand new gameplay for Ghost Wire Tokyo, as well as insights from the development team including Shinji Mikami, Kenji Kimura, Masatoshi Yanagi, Reiko Hirashima, Junya Fujii, Suguru Murakoshi, and Tsuyoshi Okugawa\n\nIn an instant, nearly all of Tokyo’s population vanishes and paranormal Visitors from another world take their place in the streets. As Akito, one of the city’s last living humans, you must join forces with a spirit named KK to put an end to the supernatural threat encroaching on Tokyo. \n\nReady to team up with an unlikely ally to take back the city? Pre-order Ghostwire: Tokyo today to receive the Biker and Hannya outfits and adventure in style! \n\n#GhostwireTokyo", "link": "https://www.youtube.com/watch?v=SaDLFMsqYDI", "date_published": "2022-02-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Ghostwire: Tokyo Official 4K Extended Gameplay", "description": "Ghostwire: Tokyo had a deep dive showcase today and with it was an 8 minute display of brand new 4K gameplay. Get a breakdown of your various abilities including different elements of wind, water, fire and more. You'll get to see various mechanics in the game, as well as your ability to traverse through the world with your Tengu ability. \n\nLearn more about the various mechanics coming to Ghostwire: Tokyo and more.\n\nIn an instant, nearly all of Tokyo’s population vanishes and paranormal Visitors from another world take their place in the streets. As Akito, one of the city’s last living humans, you must join forces with a spirit named KK to put an end to the supernatural threat encroaching on Tokyo. \n\nReady to team up with an unlikely ally to take back the city? Pre-order Ghostwire: Tokyo today to receive the Biker and Hannya outfits and adventure in style! \n\n#GhostwireTokyo", "link": "https://www.youtube.com/watch?v=cG86MAgwmAM", "date_published": "2022-02-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Next Switch - Might Be A While | GameSpot News", "description": "In today’s episode of GameSpot News, Persia talks about the Nintendo Switch having plenty of years left in it, Tiny Tina’s Wonderlands going gold, and more.\n\nDuring today's earnings call, Furukawa shared, “\"Switch is just in the middle of its lifecycle, and the momentum going into this year is good.” He also mentioned that the Switch is breaking a pattern of past consoles weakening in the sixth year. \n\nTiny Tina’s Wonderlands has gone gold meaning Gearbox Software has completed work on it. While the game is ready for publish, there'll still be some fine-tuning to do ahead of its March 25 release, which will likely include the usual updates and optimizations.\n\nLater in the video, Persia talks about a demake of Persona 4 created by SeanSS that has just released on itch.io. Sean built the demake on the free GameBoy Studio engine, and it is one of his \"very first projects using the engine.\" To play it, you can open it directly on your browser or you can download the file and use an emulator.\n\nFor more information on all of our topics, please visit gamespot.com.\n\nTimestamps:\nIntro - 00:00\nNintendo President Says Switch Is \"In The Middle Of Its Lifecycle\" - 00:08\nTiny Tina's Wonderlands Has Gone Gold - 01:15\nA Persona 4 Game Boy \"Demake\" Demo Is Now Available To Play - 02:38\nOutro - 04:09", "link": "https://www.youtube.com/watch?v=jhBIm1dP2O4", "date_published": "2022-02-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 New Live Service PlayStation Games … Do We Have The Time | GameSpot News", "description": "In today’s episode of GameSpot News, Persia talks about PlayStations plans to launch 10 live service games by 2026, Uncharted possibly coming to Fortnite, and more.\n\nAppearing on the official PlayStation podcast, Hulst said Bungie has succeeded and prospered in the live-service category, which is no easy task. Sony wants to do much more in the space and just announced plans to launch 10 live-service games by 2026.\n\nTwitter user Egyptian_Leaker seemingly discovered an unreleased Fortnite challenge within game files that read \"Collect Treasure using an Uncharted Treasure Map.\" This suggests that the live-action Uncharted movie starring Tom Holland and Mark Wahlberg as Nathan Drake and Victor \"Sully\" Sullivan could be coming to the battle royale.\n\nRocksteady's Suicide Squad: Kill the Justice League has reportedly been delayed until next year. No specific reason for the delay was given, and publisher Warner Bros. has yet to officially comment on the game's alleged delay.\n\nFor more information on all of our topics, please visit gamespot.com.\n\nTimestamps:\nIntro - 00:00\nPlayStation plans to launch 10 live service games - 00:10\nUncharted Might Be Coming To Fortnite According To Leaks - 01:28\nRocksteady's Suicide Squad Game Reportedly Delayed Into 2023 - 02:31\nOutro - 03:13", "link": "https://www.youtube.com/watch?v=Jg462ZkQbWI", "date_published": "2022-02-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dying Light 2 Stay Human Review In Progress", "description": "Techland's undead sequel Dying Light 2 improves upon the strongest element of its predecessor, but things like story and characters drag it down.\n\n#DyingLight2", "link": "https://www.youtube.com/watch?v=BWsuIhB0-Os", "date_published": "2022-02-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dying Light 2: Stay Human Ultimate Beginner’s Guide", "description": "Dying Light 2: Stay Human is packed with 500 hours worth of things to do, according to developer Techland. Here are a handful of tips for your first couple hours trying to survive in Villedor. \n\nDying Light 2: Stay Human is a first-person open-world action game set 20 years after the events of the first Dying Light. In the game you are no longer Kyle Crane, instead you play as Aiden Caldwell, a member of the Pilgrims; a group of freelance runners who travel around the world handling various odd jobs for people while risking their lives among the hordes of infected.\n\nIn this video, we’re talking all about Dying Light 2; where to go, what to do and how to make the most out of your playtime. This includes tips in areas such as: the skill tree, weapons, gear, and exploration. \n\nDying Light 2: Stay Human is set to release on February 4, 2022 for PC, PlayStation 5, PS4, Xbox Series X|S and Xbox One. The game will also be available for Nintendo Switch via cloud streaming, however it was delayed on January 19 and is now currently slated to arrive sometime within six months of February 4th.\n\nSTAMPS\n00:00 - Intro\n00:24 - Skill Tree\n01:38 - Parkour\n02:34 - Combat\n04:01 - Skill points & Experience\n06:37 - Weapons\n07:30 - Gear\n08:49 - Crafting\n09:36 - Bonus Tips\n\n#DyingLight2", "link": "https://www.youtube.com/watch?v=sCUKGtC7lSg", "date_published": "2022-02-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Gran Turismo 7 | State of Play February 2, 2022 Livestream", "description": "We’re all revved up for a new State of Play, featuring more than 30 minutes of new PS5 footage and gameplay details for Gran Turismo 7", "link": "https://www.youtube.com/watch?v=q4H8TdKT9IU", "date_published": "2022-02-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]