[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "The Battle for Ukraine (full documentary) | FRONTLINE", "description": "In 2014, as unrest in Ukraine provoked one of the biggest confrontations between Russia and the United States since the Cold War, FRONTLINE documented the crisis up-close. (Aired 2014)\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nWith Ukraine once again in the spotlight, revisit “The Battle for Ukraine,”  in which filmmaker James Jones documented both sides of the fight in 2014 between Ukraine’s ultra-nationalist group, Right Sector, and a militant, pro-Russia group called Stronghold. Drawing on personal and dramatic footage, Jones (“Secret State of North Korea”) documented deep-seated hatreds between right-wing Ukrainians with historic ties to the Nazis, and violent pro-Russian separatists vying for control of the country. \n\nLove FRONTLINE? Find us on the PBS Video App, where there are more than 300 FRONTLINE documentaries available to watch any time: https://to.pbs.org/FLVideoApp​ \n\n#Documentary #Ukraine\n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=urg1NTAo53k", "date_published": "2022-02-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]