[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "GTA 5 | PS3 vs PS5 4K Graphics Comparison", "description": "Grand Theft Auto 5 is out on next gen consoles taking advantage of some quality of life improvements like faster load times. Here's a video comparing the graphics from various cutscenes and gameplay sequences.\n\nGTA V is now available with a fresh coat of paint for next-gen console owners of the Xbox Series S|X or PS5. In this video we do a graphics comparison using original old-gen PS3 footage compared to next-gen gameplay captured on the PS5. It's worth mentioning that the PS5 was running fidelity mode which maxes out its graphics but caps the frame rate to 30 frames per second. The difference becomes less noticeable when compared to a PS4 Pro beyond certain lighting and shading textures, but when compared to the PS3, the differences are stark.\n\nBe sure to like and subscribe to this video and let us know in the comments how you feel about the next-gen release of GTA V, GTA Online, or what you would like to see from GTA VI in the future!\n\n#GTAV", "link": "https://www.youtube.com/watch?v=ZpGYIRF_V1A", "date_published": "2022-03-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "ID@Xbox Showcase Livestream March 16th", "description": "Tune in Wednesday, March 16 at 10:00 a.m. PDT for the ID@Xbox Spring showcase.\r\n\r\nXbox is teaming up with twitchgaming to bring you updates and announcements on the latest independent games coming to Xbox.\n\nGet a glimpse of Tunic, Princess Farmer, Onsen Master, There is no Light, Trek to Yomi, Shredders and more at the latest ID@Xbox showcase!", "link": "https://www.youtube.com/watch?v=EioyKE7KNFQ", "date_published": "2022-03-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Starfield Made for Wanderers Episode 2 - Behind the Scenes", "description": "Learn more about how Bethesda Game Studios is approaching their latest rich, immersive and compelling RPG experience. How are they bringing their core DNA to the next generation of consoles with Starfield? Get new insights and informaton from Game Director Todd Howard, Design Director Emil Pagliarulo, Lead Quest Designer Will Shen and Lead Artist Istvan Pely in ‘Into the Starfield: Made for Wanderers’ and keep an eye out for future episodes. \n\nStarfield arrives exclusively on Xbox Series X|S and PC on 11.11.22. Play it day one with Xbox Game Pass.\n\n#Starfield", "link": "https://www.youtube.com/watch?v=iXUIbipYCu4", "date_published": "2022-03-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Starfield NPCs Want To Seem Like Real Friends | GameSpot News", "description": "Bethesda Game Studios releases more information about Starfield and EA canceled EA Play Live 2022. \n\nAs Bethesda Game Studios prepares for the launch of its next big game, Starfield, it’s teasing new info in its \"Into the Starfield\" series. In the latest episode, titled \"Made For Wanderers,\" game director Todd Howard and crew talk about how Starfield will try to \"take on the next evolution of RPGs.\"\n\nStarfield is slated for release on November 11, 2022 for Xbox Series X|S and PC. It'll be available day one on Xbox Game Pass, just like all first-party Microsoft games.\n\nEA Play Live, the company’s annual showcase for revealing new games as well as updates for existing titles, isn't happening this year. In a statement to IGN, EA said in part “We look forward to spending time with you throughout the year!\"\n\nSTAMPS\n00:00 - Intro\n00:06 - Starfield\n02:55 - EA Play Live", "link": "https://www.youtube.com/watch?v=h-PuxqQcLxg", "date_published": "2022-03-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Tunic Review", "description": "Tunic harkens back to the 16-bit era with a challenging adventure full of discovery and wonder.", "link": "https://www.youtube.com/watch?v=iauTR7jAw94", "date_published": "2022-03-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Is Easier Now Because Of Mods | GameSpot News", "description": "Elden Ring gets a easy and hard mode mod on PC, Monster Hunter Rise: Sunbreak gets a release date and pricing details, Wave 1 of Mario Kart 8 Deluxe DLC tracks are available to preload on Switch and more Game Pass games are announced for March.\n\nElden Ring’s easy mode mod reduces enemy damage by 50%, adds a 25% damage buff to players and boosts rune gains by 10. The hard mode boosts the damage, defense and resistance of enemies while also improving their AI.\n\nMonster Hunter Rise: Sunbreak will release on June 30 and multiple versions are available to pre-order starting today. There is the  $40 standard digital version, the $50 deluxe digital and a $70 bundle that includes the base game as well. Avid fans can also get their hands on a $100 physical collector's edition. \n\nNintendo Switch Online + Expansion Pack members can get ready for the first wave of new Mario Kart 8 Deluxe tracks by preloading the content today. This wave includes tracks like Paris Promenade from Mario Kart Tour and Toad Circuit from Mario Kart 7.\n\nSTAMPS\n00:00 - Intro\n00:09 - Elden Ring\n00:58 - Monster Hunter Rise\n01:35 - Mario Kart\n02:08 - March Game Pass", "link": "https://www.youtube.com/watch?v=dDrtWHgYIcg", "date_published": "2022-03-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "How to get Every Ending in Elden Ring", "description": "Elden Ring has more potential endings than any previous FromSoftware game, with 6 potential endings. There's also 3 achievements related to different Elden Ring Endings. In this guide, Dave will take you through how to unlock each one, and how you could mess them up. He'll cover the various Elden Lord endings: Age of Fracture, Age of Duskborn, Blessing of Despair, and Age of Order. As well as Lord of the Frenzied Flame and Age of the Stars.\n\nAdditionally, Dave will help you unlock yourself out of the Lord of the Frenzied Flame ending, once you've gone down that path. So, here's a guide and walkthrough on the many endings of Elden Ring.\n\n0:00 - Intro\n0:40 - Elden Lord Age of Fracture\n1:10 - Elden Lord Age of Duskborn\n3:41 - Elden Lord Blessing of Despair\n5:42 - Elden Lord Age of Order\n8:13 - Age of the Stars\n10:46 - Lord of the Frenzied Flame\n12:28 - Undoing Lord of the Frenzied Flame\n17:21 - Conclusion\n\nThe various endings will require you to go through the quest lines of various NPCs - including the likes of the big 5 from the intro cutscene - Dung Eater, Goldmask, and Deathbed Companion Fia play pivotal roles in alternate endings, while Hoarah Loux and Sir Gideon Ofnir relate to the main story. Meanwhile, Ranni plays a major role in yet another potential ending, plus Shabriri and the Three Fingers. What will you choose?", "link": "https://www.youtube.com/watch?v=dGdnQ6XBz70", "date_published": "2022-03-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Stranger of Paradise: Final Fantasy Origin Review", "description": "There's a lot of meme potential in Stranger of Paradise thanks to its willingness to be aggressively confusing, but fun, varied combat carries its most WTF moments forward.\n\nSquare Enix and Team Ninja's Stranger of Paradise: Final Fantasy Origin will be available on PC, PlayStation 5, PlayStation 4, Xbox Series X/S, and Xbox One on March 18, 2022. You can read the full written Stranger of Paradise: Final Fantasy Origin review by Phil Hornshaw on GameSpot: https://www.gamespot.com/reviews/stranger-of-paradise-final-fantasy-origin-review-chaos-incarnate/1900-6417844/", "link": "https://www.youtube.com/watch?v=bRhpn8cf6jw", "date_published": "2022-03-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]