[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Putin's Road to War: Susan Glasser (interview) | FRONTLINE", "description": "In an interview for the FRONTLINE documentary “Putin’s Road to War,” Susan Glasser, columnist at The New Yorker and co-author of \"Kremlin Rising,\" discusses how military force has been key to Russian President Vladimir Putin’s rise to power.\n\n“One thing that you get from looking at the whole sweep of Putin’s two decades in power is to understand that, for him, the use of military force has accompanied every step along the way of his journey to become Russia’s longest-serving leader since Josef Stalin,” she tells FRONTLINE.\n\nGlasser is a columnist and staff writer at The New Yorker. She previously served as editor of Politico and editor-in-chief of Foreign Policy magazine. She spent four years as a Moscow bureau chief for The Washington Post and is the co-author, with Peter Baker, of \"Kremlin Rising: Vladimir Putin’s Russia and the End of Revolution.\"\n\nThe following interview was conducted by FRONTLINE's Mike Wiser on March 4, 2022. It has been edited for clarity and length.\n\n“Putin’s Road to War” premieres March 15, 2022. Watch the trailer now: https://youtu.be/EaUefbpmV08\n\nThis interview is being published as part of FRONTLINE’s Transparency Project, an effort to open up the source material behind our documentaries. Explore the transcript of this interview, and others, on the FRONTLINE website: https://www.pbs.org/wgbh/frontline/about-frontlines-transparency-project/\n\n#PutinsRoadToWar #SusanGlasser #FrontlineInterview\n\nLove FRONTLINE? Find us on the PBS Video App, where there are more than 300 FRONTLINE documentaries available to watch any time: https://to.pbs.org/FLVideoApp\n\nSubscribe on YouTube: http://bit.ly/1BycsJW\nInstagram: https://www.instagram.com/frontlinepbs\nTwitter: https://twitter.com/frontlinepbs\nFacebook: https://www.facebook.com/frontline\n\nFRONTLINE is produced at GBH in Boston and is broadcast nationwide on PBS.\n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Additional funding for FRONTLINE is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=MV5aFnB-1ec", "date_published": "2022-03-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "What an ‘Unhinged’ Meeting Reveals About ‘Vladimir Putin’s War’ | Putin's Road to War | FRONTLINE", "description": "Watch the opening scene of \"Putin’s Road to War,\" a new documentary on what led up to the Russian president’s invasion of Ukraine and how he wields power.\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate. \n\nThe full \"Putin’s Road to War” documentary premieres March 15, 2022, at 9/8c. Watch the trailer now: https://youtu.be/EaUefbpmV08\n\nLove FRONTLINE? Find us on the PBS Video App, where there are more than 300 FRONTLINE documentaries available to watch any time: https://to.pbs.org/FLVideoApp\n\n#Vladimir Putin #Russia #Ukraine\n\nSubscribe on YouTube: http://bit.ly/1BycsJW\n\nInstagram: https://www.instagram.com/frontlinepbs\nTwitter: https://twitter.com/frontlinepbs\nFacebook: https://www.facebook.com/frontline\n\nFRONTLINE is produced at GBH in Boston and is broadcast nationwide on PBS.\n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Additional funding for FRONTLINE is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=8B0mWzB4GOQ", "date_published": "2022-03-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]