[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "13 Things You Never Knew About God of War", "description": "2022 looks to hopefully be the year of Kratos. With 2018’s PlayStation classic God of War releasing on PC on January 14th, and its sequel God of War Ragnarok still scheduled for later this year, we’re all about to get a lot of the God of Big Dad Energy. We figured this was the best time to look back at 13 of the coolest secrets, easter eggs, and facts about the God of War franchise that you probably didn’t know. Even if you’re the Goddess of Wisdom Athena, there’s sure to be at least one fact on this list that you didn’t know. So, let’s jump into the Bifrost. \n\n0:00 - Intro\n0:42 - Divine Inspiration \n1:21 - Baby of War\n2:33 - Mythological Origins\n3:48 - Human Sacrifice\n5:12 - Speed-Dial Kratos\n6:19 - Forgotten Betrayal\n7:20 - God of Ripoffs\n8:21 - Novel Revelations\n9:41 -Chaurli the Tortoise\n10:18 - Voice Change\n11:06 - Injury Delay\n11:43 - Isolated Chaos\n12:15 - Who is Eric Williams?\n13:05 - Outro\n\n#GodOfWar", "link": "https://www.youtube.com/watch?v=MErjUsyi_Eg", "date_published": "2022-01-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War PC Ultrawide Mouse & Keyboard Gameplay", "description": "God of War 2018 is now available on PC. See Sony Santa Monica's excellent reboot in action with one of the PC port's best features: An ultrawide aspect ratio. We also try out the mouse and keyboard controls to see how it feels to throw and retrieve the Leviathan Axe. Check out this 9-minute clip of God of War on PC in ultrawide showcasing some of the game's early cutscenes, as well as a few battles with Kratos and Atreus. \n\nGod of War 2018 is coming to PC on January 14th, 2022 on Steam. You can view our graphics comparison between PC and PlayStation 5 here: https://youtu.be/8zZ0C91rsn4\n\n#GodofWar #PC", "link": "https://www.youtube.com/watch?v=5hkK2A8i6hM", "date_published": "2022-01-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War PS5 Vs PC Ultra Settings Graphics Comparison", "description": "God of War is the latest Sony title to get a PC port, so let's see how it compares to its console counterpart. \n\nFor the PlayStation version we are running it on a PS5 with the upgraded “enhanced performance” patch that runs the game at 60fps with a 4K checkerboard resolution. Meanwhile we have the PC version running on maxed out “ultra” settings at a native 4K resolution.\n\nThe PC version does offer a small but decent number of improvements such as increased texture quality and dynamic fog. However, these can be pretty subtle. You will notice a major difference in shadows, which can change some scenes quite dramatically. Also, you will notice a difference in color, however that has more to do with how these games were captured on different devices and is not indicative of any real difference between the two versions.\n\nCheck out some Ultrawide gameplay here: https://youtu.be/5hkK2A8i6hM\n\n#GodofWar", "link": "https://www.youtube.com/watch?v=8zZ0C91rsn4", "date_published": "2022-01-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite's Mangler Might Get Nerfed & Players Are Divided | GameSpot News", "description": "In this episode of GameSpot News, we talk about Halo Infinite’s Mangler possibly getting nerfed, Horizon Forbidden West leaking early and Among Us becoming the PlayStation Store’s most downloaded game in December 2021. \n\nIn this video, Persia explains why players are divided over Halo Infinite's weapon, the Mangler, possibly getting nerfed. As well as 343 looking for ways to combat cheaters in an upcoming February update. \n\nPersia also talks about Horizon Forbidden West leaking early and Sony shift response in an effort to keep images and videos from the leak offline.\n\nFor more information on all of our topics, please visit gamespot.com.\n\nTimestamps:\nIntro - 00:00\nHalo Infinite - 00:07\nHorizon Forbidden West - 02:19\nPlayStation - 03:20\nOutro - 04:00", "link": "https://www.youtube.com/watch?v=wa7htDUks5Y", "date_published": "2022-01-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "11 Stupidly Hard Bosses in Video Games", "description": "Who designed these, and why do I enjoy the suffering so much? From Mike Tyson of Punch-Out!! to Absolute Radiance of Hollow Knight, and delving into FromSoftware games like Sekiro and Bloodborne, here are some of the most challenging and difficult bosses... ever. Time to Git Gud!\n\nTime Stamps:\n0:52 - Mike Tyson's Punch-Out!!\n1:50 - Sekiro\n4:10 - Bloodborne\n5:42 - Ninja Gaiden\n7:40 - Undertale\n8:48 - Hollow Knight\n11:16 - Enter the Gungeon\n13:06 - Final Fantasy VII\n15:08 - Castlevania 3\n16:20 - Prinny: Can I Really Be the Hero?\n17:19 - Mushihimesama Futari", "link": "https://www.youtube.com/watch?v=0FOtmUyX7LA", "date_published": "2022-01-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dying Light 2 - 500 Hours To 100%? | GameSpot News", "description": "In today’s episode of GameSpot News, Persia talks about Dying Light 2 taking up to 500 hours for a 100% run, Take-Two acquiring Zynga for $12.7 billion, and more.\n\nPlayers will need to spend about 500 hours to \"fully complete\" Dying Light 2, developer Techland has confirmed, while also acknowledging that this is the projected run time for a 100% run. A \"focused\" playthrough of the game's main story can be finished in about 20 hours depending on your playstyle. That playtime gets bumped to about 80 hours including all side quests and then, 500 hours including “every collectible, listen to every dialogue, fetch every Easter egg, finish every possible ending, and visit every corner of the world,\"\n\nPersia also talks about Grand Theft Auto company Take-Two acquiring FarmVille company Zynga for $12.7 billion, which the company announced on Monday morning. In a slide deck, Take-Two said it sees a \"clear path\" for bringing Take-Two's console and PC games to mobile, thanks in part to the Zynga deal. It did not, however, name any specific titles.\n\nLastly, Persia talks about a video uploaded by ER-SA that shows off the incomplete character creation in Elden Ring. While Elden Ring's character creation menu is by no means in a finished state, it does provide a good look at the game's improved character models. A majority of the basic options look decently realistic, sporting impressively rendered hair.\n\nLink to full ER-SA video here: https://www.youtube.com/watch?v=vh_G4ARUSDw \n\nFor more information on all of our topics today, please visit gamespot.com.", "link": "https://www.youtube.com/watch?v=mng7FPteljE", "date_published": "2022-01-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]