[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Business of Disaster (full documentary) | FRONTLINE", "description": "Who profits when disaster strikes? FRONTLINE & NPR investigates how much insurance companies profit after a natural disaster. (Aired 2016)\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nWhen Superstorm Sandy made landfall in October of 2012, the historic natural disaster killed more than 100 people and caused catastrophic damage along the Eastern seaboard. “Business of Disaster” puts two key parts of the disaster recovery system under scrutiny: the special housing aid Congress gives to local governments after major disasters, and the National Flood Insurance Program that’s run by the Federal Emergency Management Administration. Major insurance companies declined to be interviewed, but FRONTLINE and NPR spent months working to track their profit numbers down. With storms expected to grow in frequency and intensity, this joint investigation raises troubling questions about disaster relief in America.\n\nLove FRONTLINE? Find us on the PBS Video App, where there are more than 300 FRONTLINE documentaries available to watch any time: https://to.pbs.org/FLVideoApp​ \n\n#Documentary #BusinessOfDiaster\n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=fZtXYXBEIn4", "date_published": "2022-01-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]