[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCn-K7GIs62ENvdQe6ZZk9-w", "title": "Cosmoluxe (Full Album)", "description": "THE BOSS 0:00\n\nThis might be my favourite track on the album.  It opens with a bass line that took me a long time to get right.  There's also quite a mixture of vinyl samples because I spent 3 weeks recording just over 700 sounds from old records.  Kick drums, snare drums, guitars, keys.  I really want to do more like this in future.  I love sounds that are real.  It was hard choosing a track #1, but I think this works.  It's a firm handshake at the door and it welcomes you in without telling you what to do.\n\nSTRANGEROUS 3:14\n\nThis one is all about the Netflix series Stranger Things.  True to the show, I wanted a retro vibe with tons of space, sparkle and punch.  I made everything in Ableton using a ton of digital and acoustic instruments.  I went through 23 versions of the mix before I was happy.  It's hard gluing together different voices recorded with different mics in different locations.  At one stage I was going to cut the outro because I could never really figure out what to do with it.  Strangerous was going to be track #3 with Supremo sitting at #2, but I think this works better.  It has similar elements to The Boss and gets to do its thing without giving up any thunder.\n\nTEARS IN HER EYES 6:27\n\nI made most of this track on my couch using an MPC Live II.  The chords took me half a day to iron out, and the vocals are from an interview with my mother.  You might recognize her voice from Gardyn.  I didn't want this on the first half of the album because I felt it brought the energy down.  Now I think it works well at #3 because it covers more of a spectrum and lets you down gently with some feels before Cabin Fever goes full sail.  I guess we can rationalize any track list at the end of the day, so I just had to listen through in different contexts and go with my gut.  It took me about a week to structure this album.\n\nCABIN FEVER 9:50\n\nMuppet Treasure Island as a Drum & Bass mix.  This one's a bit of a Frankenstein.  It's more of a collage than a single track, so placing it on the album wasn't easy.  I like the sections individually, and it's rewarding to make something that flows from A to Z.  But I'm not sure this does.  I think it works best when you've heard it already and know what to expect.  If I was to make a video for Cabin Fever, I'd probably transpose some sections to keep things in key, and work on some bridges for moving between sections more gradually.  Muppet Treasure Island is such an awesome adventure.  It was a staple of my childhood and one day I will do it justice!\n\nPOLKA DOT POSITIVE 13:26\n\nA House mix bubbling with sounds from my old radio tuner.  This track puts me on a small planet converted into a dance floor where I'm losing myself with aliens from all over the galaxy.  I love making stuff like this.  It's totally unpredictable but it's like magic when things fall into place.\n\nSUPREMO 17:30\n\nIn 2005 I made a track called Supreme Enjoyment.  I barely knew bass from treble and had no idea what I was doing.  The track has always found its way back to me, so I remade it from scratch and called it Supremo.  I think there are pros and cons to remaking your early stuff.  On one hand it's like restoring old family photos, or finding your old Nintendo and bleaching the plastics to restore what you remember.  On the other hand you'll never truly capture what you felt at the time, and you're bound to wipe away some of its character.  It's hard to justify, but I can to an extent.  The feelings I tried to capture in my early days are still important to me, and leaving them trapped inside a muddy mix or a tinny sound feels like a tragedy.  It's a risky operation, though.  I've often remade old tracks and I haven't always managed to keep the soul intact.\n\nDRAGONFLY 20:40\n\nA patchwork of voices from Spyro Reignited.  Spyro was and still is one of my favorite Playstation games of all time.  I recorded every line spoken by every dragon in the world, and I sat in my Bat Cave for weeks piecing together melodies that sort of make sense.  It wasn't anything special so I shelved it and moved on.  When I came back to it with fresh ears, I re-timed some of the vocals, remade the drums and reworked the whole mix.  I still think it's a mess, but I hope you enjoy it more than I do.\n\nPATACAKE 23:57\n\nA chill mix to close things out.  You might recognize The Simpsons singing a Christmas carol from an old 'Treehouse of Horror' episode.  I know it was supposed to be funny and weird, but I've always thought it was really beautiful.  While it's not my favorite track on the album, it has that rare thing of making me happy and sad at the same time, and I think it sets you down with a hug and a farewell.  Thanks for coming on the ride with me folks!  I hope it's done you some good.\n\nArtwork by Fluffchirp: https://instagram.com/fluffchirp", "link": "https://www.youtube.com/watch?v=EH9hRQd7Q7c", "date_published": "2022-01-11 08:11:35+00:00", "persistent": false, "user": null, "language": "en-US"}]