[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "15 million excess deaths", "description": "Official reported deaths\n\nhttps://covid19.who.int\n\nCases, 513,384,685\n\nDeaths, 6,246,828\n\nTechnical Advisory Group on COVID-19 Mortality Assessment\n\nhttps://www.who.int/data/technical-advisory-group/covid-19--mortality-assessment/membership\n\nFive working groups\n\ne.g. group one\n\nhttps://www.who.int/data/technical-advisory-group/covid-19--mortality-assessment/working-group-1\n\nConvened jointly by the WHO and the United Nations Department of Economic and Social Affairs (UN DESA)\n\nMethods used\n\nhttps://www.who.int/publications/m/item/methods-for-estimating-the-excess-mortality-associatedwith-the-covid-19-pandemic\n\nhttps://cdn.who.int/media/docs/default-source/world-health-data-platform/covid-19-excessmortality/who_methods_for_estimating_the_excess_mortality_associated_with_the_covid-19_pandemic.pdf?sfvrsn=5a05fa76_1&download=true\n\n14.9 million excess deaths associated with the COVID-19 pandemic in 2020 and 2021\n\nhttps://www.who.int/news/item/05-05-2022-14.9-million-excess-deaths-were-associated-with-the-covid-19-pandemic-in-2020-and-2021\n\nFull death toll associated directly or indirectly with the pandemic\n\nThat is, excess mortality\n\n1 January 2020 and 31 December 2021\n\nRange 13.3 million to 16.6 million \n\nDr Tedros Adhanom Ghebreyesus, WHO Director-General\n\nThese sobering data not only point to the impact of the pandemic \n\nbut also to the need for all countries to invest in more resilient health systems \n\nthat can sustain essential health services during crises, \n\nincluding stronger health information systems\n\nGenerate better data for better decisions and better outcomes\n\nExcess mortality\n\nNumber of deaths that have occurred and the number expected (in the absence of the pandemic)\n\nDirect and indirect deaths\n\n(due to the pandemic’s impact on health systems and society)\n\nHealth care systems overburdened\n\nDeaths averted during the pandemic\n\nMotor-vehicle accidents, occupational injuries\n\nMost of the excess deaths (84%)\n\nSouth-East Asia, Europe, the Americas\n\nHigh-income and low-income countries, 15% of total 14.9 m \n\nLow income countries, 4% of total 14.9 m\n\nSex\n\nMale, 57% of total 14.9 m\n\nFemale, 43% of total 14.9 m\n\nDr Samira Asma, Assistant Director-General for Data, Analytics and Delivery, WHO\n\nMeasurement of excess mortality is an essential component to understand the impact of the pandemic. \n\nShifts in mortality trends provide decision-makers information to guide policies\n\nto reduce mortality and effectively prevent future crises. \n\nBecause of limited investments in data systems in many countries, \n\nthe true extent of excess mortality often remains hidden\n\nThese new estimates use the best available data and have been produced using a robust methodology and a completely transparent approach\n\nDr Ibrahima Socé Fall, Assistant Director-General for Emergency Response\n\nData is the foundation of our work every day to promote health, keep the world safe, and serve the vulnerable. \n\nNeed to track outbreaks in real-time, everywhere\n\nWe know where the data gaps are\n\nMr Liu Zhenmin, United Nations Under-Secretary-General for Economic and Social Affairs\n\nThe United Nations system is working together to deliver an authoritative assessment of the global toll of lives lost from the pandemic. \n\nThis work is an important part of UN DESA’s ongoing collaboration with WHO and other partners to improve global mortality estimates\n\nMr Stefan Schweinfest, Director of the Statistics Division of UN DESA\n\nData deficiencies make it difficult to assess the true scope of a crisis, with serious consequences for people’s lives. \n\nThe pandemic has been a stark reminder of the need for better coordination of data systems within countries and for increased international support for building better systems, including for the registration of deaths and other vital events.", "link": "https://www.youtube.com/watch?v=RI57qwB2fQI", "date_published": "2022-05-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]