[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Little Shop of Horrors: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nJosh Rogosin | May 6, 2022\nComposer Alan Menken beams with pride as he introduces the Little Shop of Horrors Tiny Desk (home) concert. May 6, 2022 marks the 40th anniversary of the show's first production. Menken is joined by the stellar cast of the current off-Broadway revival, which swept the Drama Desk, Outer Critics and Drama League Awards for Best Musical Revival. They perform a joyful medley of five earworm-filled tunes from the cult classic. Over the course of the tiny concert, Menken shares anecdotes about collaborating with the show's late lyricist Howard Ashman. It's obvious how much they loved working together hearing him reminisce.\n\nIt may come as a surprise when the composer sits down at the piano to sing \"Somewhere That's Green,\" one of the most iconic songs usually performed by the show's female lead. It's a melody he admits you might recognize from The Little Mermaid. \"This is one of the first songs Howard and I wrote for Little Shop,'' Menken explains. \"It's kind of the classic 'I want' song, a phrase that Howard [Ashman] would use a lot, especially when we would talk endlessly about our Disney movies. ... When we wrote 'Part of Your World' we actually jokingly called it 'Somewhere That's Wet.'\" Good artists copy; great artists steal (from themselves, if they're smart).\n\nThe joy the cast shares while performing these wonderful songs with their composer is palpable. If you find yourself planning a trip to New York, do yourself a favor and book tickets to this heartfelt production, which should run at the Westside Theatre for a long time to come.\n\nSET LIST\n\"Skid Row (Downtown)\"\n\"Feed Me (Git It!)\"\n\"Somewhere That's Green\"\n\"Dentist!\"\n\"Suddenly Seymour\"\n\nMUSICIANS\nMUSIC BY: Alan Menken\nLYRICS BY: Howard Ashman\n\nCAST\nConrad Ricamora\nTammy Blanchard\nChristian Borle\nAaron Arnell Harrington\nStuart Zagnit\nTatiana Lofton\nCristina Raé\nKhadija Sankoh\n\nBAND\nAlan Menken: piano, vocals\nWill Van Dyke: piano\nDena Tauriello: drums\nNate Brown: guitar\nMark Verdino: bass\n\nCREDITS\nVideo: Philip Atlas, Harry McFann, Kayhl Cooper \nAudio: Frank Wolf, Ben Fusel, Spencer Dennis\nMusic Director: Will Van Dyke\nOrchestrations & Arrangements: Will Van Dyke\nStaging: Michael Mayer & Austin Regan\nProduction Services: Vivacity Media Group\nVideo Production: SpotCo\nSpecial Thanks: Rob Ahrens, Hunter Arnold, Tom Kirdhay,  Live Wire Theatrical, Michael Aarons, Leslie Papa, Whitney Holden Gore, Macy Sullivan, Maura Consedine, Tyler Talmage, Maddox Martin, Molly Seidel \n\nTINY DESK TEAM\nProducer: Josh Rogosin\nVideo Producer: Michael Zamora\nAudio Mastering: Josh Rogosin\nAnimation: Kaz Fantone\nArt Direction: Nicole Werbeck\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Joshua Bryant, Maia Stern, Ashley Pointer\nVP, NPR Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#NPRMusic # TinyDesk #LittleShopOfHorrors", "link": "https://www.youtube.com/watch?v=ymqKPz5kRXE", "date_published": "2022-05-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Contest Top Shelf: Bob Boilen, iLe and Michelle Zauner of Japanese Breakfast", "description": "NPR Music received thousands of submissions to this year's Tiny Desk Contest, our annual search for the next great undiscovered artist to play a Tiny Desk concert. Before we reveal this year's winner, our Contest judges are sharing their favorite entries as part of our annual Tiny Desk Contest Top Shelf livestream series.\n\nFeatured entries:\n- Pocket Queen & The Royal Flush, “WE CAME TO MOVE” https://www.youtube.com/watch?v=5UMaYqBYSj4 \n- Aubrey Hays, \"Love Didn't Hurt You\" https://www.youtube.com/watch?v=rIGm3syX424 \n- Micah Edwards Jean Leon https://www.youtube.com/watch?v=fP16uCTpfAI \n- Alisa Amador Milonga accidental https://www.youtube.com/watch?v=g6SFOXXeV4c \n- Raine Stern, “Lydia” https://www.youtube.com/watch?v=zu1GPL2Xc8I\n- Piquete, “Fluir” https://www.youtube.com/watch?v=GhfbKJUc0Q8 \n- Ollella, “Lava” https://www.youtube.com/watch?v=zkmZcHsI6jw \n- John Ferrara, “Perhaps Everything, Perhaps Nothing” https://www.youtube.com/watch?v=96fsJ4tMdSI \n\nLearn more about the Contest: https://npr.org/tinydeskcontest", "link": "https://www.youtube.com/watch?v=7Ur_455ttZY", "date_published": "2022-05-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]