[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UChnxLLvzviaR5NeKOevB8iQ", "title": "Fight or Flight (Modular, Korg Modwave, Vocals)", "description": "This was filmed and recorded in September 2021. I've been sitting on it for the right time. There is no right time.\n\nI took all the drums out of my big rack to make room for more \"fun stuff\", like effects and sequencers. I also took all the \"complicated\" oscillators out and replaced them with more simple analog oscillators.\n\nIn this performance I created a bed of shifting textures with oscillators and filters, added a rhythm with the klavis twin waves doing fm, Plaits doing a chill arp, and made a custom patch on the korg modwave to play along with it.\n\nThe main oscillators are Make Noise STO, Intellijel Dixie2, Acid Rain Chainsaw. Each one goes to a filter: STO to Polaris, Dixie 2 to Morgasmatron, and Chainsaw to Popple. \n\nBloom does sequencing for STO and Dixie2, and the Chainsaw is getting sequenced by the Triad by WMD. I have Noise Engineering Mimetic Digitalis set to shift the Triad and Inversion input on the Triad according to gates I choose via Metron. I have Plaits being sequenced by the Arpitecht, with voltages from Memetic changing the rhythm and note values.\n\nMetron is the heart of my system here and provides all timing and clock gates to virtually everything.\n\nI used XOAC Zadar and Acid Rain Maestro for modulation. Zadar is wonderful for off-kilter modulation, as you can set it to loop and have weird shapes, and then modulate aspects of those shapes. The goal was to have a non-synced shifting bed of tones from the modular system that could be pushed into urgency by increasing the filter modulation.\n\nThe Modwave patch is two layers: one is a simple analog oscillator shape with some filter envelope, the other is a more glassy string waveform. I use the mod wheel to increase the filter cutoff on both patches to increase urgency in the patch. I am really loving Modwave as an easy to program synthesizer for performative patches.\n\nEverything is run through an effect: Imitor Versio, Monsoon, and Erbe Verb.\n------------------------------------\nPatreon:  http://bit.ly/rmrpatreon\n\nMy Music: \nBandcamp: http://bit.ly/2Kq617o\nSoundcloud: http://bit.ly/2NOH9Is\nSpotify: https://spoti.fi/2N40SoX\nGoogle Play: http://bit.ly/33M9aG5\niTunes: https://apple.co/2pqh3SK\nAmazon Music: https://amzn.to/2O9q1fe\n\nMerch: http://bit.ly/rmrshirts\n\nConnect:\nTwitter: http://bit.ly/rmrtwitters\nWebsite: http://bit.ly/rmrmedia", "link": "https://www.youtube.com/watch?v=_Xb83pX7UY8", "date_published": "2022-08-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]