[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "UK Parliament vaccine debate", "description": "Official UK government report on the debate\nhttps://hansard.parliament.uk/commons/2022-10-24/debates/FF880636-BC3B-4BDB-A5E0-D6D4B82B2888/Covid-19VaccinesSafety\n\nOfficial UK Government YouTube channel, the debate in full for those interested\nhttps://www.youtube.com/watch?v=pfgGCgxGYkk\n\nA few of John’s notes on immunity, from my books, free download site, \nhttp://159.69.48.3/\n(You will need to cut and past this address into  search engine)\n\nAcquired or adaptive immunity only develops after there has been contact with a particular antigen. An individual is said to be immune to a particular pathogen when it may be introduced into the body, without causing illness. In contrast to innate immunity, the immune system is changed as a result of exposure to a particular antigen. \nAcquired immunity is specific to a particular antigen. For example, previous exposure to the measles virus will have allowed the immune system to adapt, generating immunity to any future measles infection. However, because the response is specific, the individual may still suffer from mumps, influenza, or indeed any other antigenic organism it has not previously been exposed to. \nAntigens (antibody generators) \nAn antigen is anything the immune system recognises as being foreign. When detected, antigens generate an immune response in the body. It is antigens which stimulate the production of antibodies, which are the immune proteins. Usually an antigen is a foreign protein that the body recognises as non-self. The outer coatings of bacteria and viruses contain such foreign proteins. Non-protein large molecules (with a molecular mass of over 1000) will also be antigenic if introduced into the body. So a wide variety of living and non living things can act as antigens; such things are said to possess antigenicity. The specific component of an antigen the immune system recognises as foreign is termed an epitope. \nCells involved in adaptive immunity \nThe important classification of white cells involved in adaptive immunity is the small lymphocytes. Small lymphocytes have a large nucleus with only a small area of cytoplasm. In addition to being found in the blood, there are many small lymphocytes in the structures of the lymphatic system, such as the spleen, tonsils and lymph nodes. \nSmall lymphocytes are able to recognise antigenic material, this is essential if they are to mount an immune response. It is estimated that small lymphocytes are capable of producing 100 million different shapes of surface receptors in order to recognise 100 million different forms of antigen. This diversity seems to allow the immune system to recognise all of the possible antigens on the surface of the planet.", "link": "https://www.youtube.com/watch?v=GYFYq0xEAjQ", "date_published": "2022-11-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]