[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Atomic Heart Official Boss Fight Gameplay", "description": "Check out 10 minutes of an intense boss fight you'll encounter in Atomic Heart. \n\nAtomic Heart releases on February 21, 2023 on PlayStation 4, PlayStation 5, Xbox One, Xbox Series X and S, and PC.", "link": "https://www.youtube.com/watch?v=9pGIEKqQmXs", "date_published": "2022-11-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PS Plus November Game Catalog Revealed | GameSpot News", "description": "Skyrim, Kingdom Hearts and more join PlayStation’s Game Catalog. Call of Duty Modern Warfare 2’s first season gets new details. \n#GamingNews #PS5 #ModernWarfare2\n\nThis month the PlayStation Plus Game Catalog is gaining some big additions. Members at the Extra and Premium tiers can look forward to playing The Elder Scrolls V: Skyrim Special Edition, Tom Clancy’s Rainbow Six Siege, Ghost Recon Breakpoint and The Division 2.\n\nBut that's not all because also soaring its way into the catalog is Sora and gang with Kingdom Hearts HD 1.5 + 2.5 Remix, 2.8 Final Chapter Prologue and KH 3 and Melody of Memory. \n\nAnd you might be as well because early this month, PlayStation added 3 free games to its essential PlayStation Plus tier. Those include:  \nNioh 2 is a yokai-slaying action game from Team Ninja that combines the pinpoint swordplay of Ninja Gaiden with the mechanics of Dark Souls. The Lego Harry Potter Collection, a game that combines Years 1-4 and Years 5-7 into one game. And the physics-based puzzle game Heavenly Bodies. \n\nA week from today on November 16, Modern Warfare II will get its first major update with the launch of Season 1 and Warzone 2.0 will be unleashed on the masses. In a blog post, Activision ran through the specifics of what's new in Season 1, and it's a lot of information. \n\nModern Warfare II is adding fan-favorite maps in Season 1, and those include Shoot House and Shipment. Both maps are \"reimagined\" for Modern Warfare II, Activision said. These are smaller maps with a lot of action, especially Shipment, which is one of Call of Duty's smallest maps.", "link": "https://www.youtube.com/watch?v=_GdfXyr-gtc", "date_published": "2022-11-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Why Now Is the Time to Jump into World of Warcraft and Play Dragonflight", "description": "(Presented by Blizzard Entertainment) World of Warcraft: Dragonflight is an exciting new chapter in the WoW saga that introduces a whole bunch of massive, and awesome, changes to the way the game plays and feels.  And with its focus on dragons and their story, Dragonflight is a return to WoW's high fantasy roots and also the game's best entry point in years--it's perfect for new and old players alike. \n\n#WoW #dragonflight #gaming", "link": "https://www.youtube.com/watch?v=0euo5i5R-Ts", "date_published": "2022-11-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 Just Got Better, Again! | GameSpot News", "description": "Cyberpunk 2077 has already received some substantial upgrades this year and now patch 1.61 has been announced for PC, console, and Stadia (rest in peace). Several fixes for multiple missions will be added, as a number of these \"Gigs\" had issues where elements weren't being properly triggered inside of the game. Visually, you'll see Night City residents carrying umbrellas, various floating items will rediscover the pull of gravity, and a bug related to missing collisions won't make you fall through the map. As for gameplay, it'll be possible to craft a legendary variant of the Amnesty Iconic revolver, clothing bonuses related to Quickhack cooldowns and crit damage will start working, and weapons will be able to deal more explosive damage. \n\nPatch Notes: https://www.gamespot.com/articles/new-cyberpunk-2077-patch-gives-everyone-in-night-city-an-umbrella/1100-6508989/\n\nGod of War Ragnarok  is almost here and it goes without saying that this is one patch that you'll definitely want to install before booting up the game, as it seems to fix a wide variety of bugs, crashes, and other technical issues that would otherwise mar your experience.\n\nPatch Notes: \nhttps://www.gamespot.com/articles/god-of-war-ragnarok-day-one-patch-notes-crucial-bug-fixes/1100-6508994/\n\nHalo Infinite Winter Update weapon changes: \nhttps://www.gamespot.com/articles/halo-infinites-winter-update-is-bringing-heaps-of-weapon-balance-changes/1100-6508857/\n\nSTAMPS\n00:00 - Cyberpunk 2077\n01:20 - God of War Ragnarok\n02:10 - Halo Infinite", "link": "https://www.youtube.com/watch?v=wYeasGyLUiU", "date_published": "2022-11-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War Ragnarok - 4K PS5 Gameplay", "description": "Ragnarok is here! Take a look at the first 30 minutes of God of War Ragnarok running on the PS5 in glorious 4K. This was captured with the \"Favor Resolution\" graphics setting which prioritizes visual fidelity over framerate.\n\n#godofwarragnarok #gaming #gamespot", "link": "https://www.youtube.com/watch?v=ebF_DC7PhPo", "date_published": "2022-11-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War Ragnarok Early Game Tips", "description": "We’ve put together our best spoiler-free tips for God of War Ragnarok in this beginner's guide.\n\nVideo Notes:\n00:00 - Intro\n00:17 - Keep an eye out for loot in the water\n00:49 - Listen for ravens\n01:30 - Train in Niflheim\n02:04 - Make use of Atreus’ arrows during combat\n02:51 - Check the lost items chest frequently\n03:14 - Don’t fret over skills too much\n03:57 - Don’t skimp on upgrades\n04:36 - Nornir chests are always worth the hassle\n05:09 - Sell your artifacts\n05:32 - Compete in Muspelheim challenges\n06:04 - Look over the accessibility features", "link": "https://www.youtube.com/watch?v=5dIppH68Syc", "date_published": "2022-11-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Need for Speed Unbound Takeover Event Gameplay Trailer (ft. A$AP Rocky)", "description": "Get a glimpse of the Takeover Event Gameplay in this latest Need for Speed Unbound trailer. Take over sections of the city by pulling huge drifts, smashing collectibles, and proving your skills to Lakeshore’s most stylish street racers. This is all about steez over speed, but don’t be afraid to go fast too. Now you got it, go make Rocky proud.\n\nStart at the bottom and race to the top in Need for Speed Unbound, coming to PlayStation 5, Xbox Series X|S and PC on December 2, 2022.\n\n#needforspeed #needforspeedunbound #gaming", "link": "https://www.youtube.com/watch?v=jvFIwzAAx_Q", "date_published": "2022-11-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Scarlet and Pokémon Violet | Ed Sheeran \"Celestial\" Official HD Pre-Order Trailer", "description": "Join forces with other Trainers from around the world to battle the mightiest Pokémon in Paldea!\n\nPreorder Pokémon Scarlet and Pokémon Violet today and get ready for an exciting adventure in Paldea! \n\nBackground Music: \"Celestial\" - Ed Sheeran", "link": "https://www.youtube.com/watch?v=7vzgCFtgV0o", "date_published": "2022-11-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]