[{"source": "https://www.dailywire.com/feeds/rss.xml", "title": "New York Governor Kathy Hochul Holds On Against Republican Lee Zeldin: Projection", "description": "Governor Kathy Hochul (D-NY) survived her first election as governor of the Empire State on Tuesday night, besting GOP Rep. Lee Zeldin (NY) in a race that continued to tighten against the Democrat&#8217;s favor, according to a projection from DecisionDeskHQ. Though it looked like 64-year-old Hochul would have an easy ride to victory as the ...", "link": "https://www.dailywire.com/news/new-york-governor-kathy-hochul-holds-on-against-republican-lee-zeldin-projection", "date_published": "2022-11-08 23:39:48+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "J.D. Vance Wins Ohio Senate Seat Over Democrat Tim Ryan: Projection", "description": "Republican Ohio Senate candidate J.D. Vance has won Ohio&#8217;s Senate election over Democratic opponent Tim Ryan, DecisionDeskHQ projects. Decision Desk made the projection at 11:03 p.m. EST. Polls leading up to the election showed Vance with a razor-thin edge over Ryan. Vance pulled ahead of his opponent after the candidates faced each other in a ...", "link": "https://www.dailywire.com/news/j-d-vance-wins-ohio-senate-seat-over-democrat-tim-ryan-projection", "date_published": "2022-11-08 23:04:54+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Incumbent Democrat Michael Bennet Projected To Win Colorado Senate Seat", "description": "Incumbent Colorado Democratic Senator Michael Bennet is projected to win his race against Republican opponent Joe O’Dea, a political first-time candidate and businessman. The race was projected by Decision Desk at 10:17 p.m. EST on Tuesday night. O’Dea portrayed himself as a moderate Republican, saying he was in favor of abortion during the early stages ...", "link": "https://www.dailywire.com/news/incumbent-democrat-michael-bennet-projected-to-win-colorado-senate-seat", "date_published": "2022-11-08 22:50:40+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Democrat Maggie Hassan Defeats Don Bolduc In New Hampshire Senate Race: Projection", "description": "Incumbent Democratic Sen. Maggie Hassan has won the New Hampshire Senate race, defeating Republican challenger Don Bolduc, according to a projection. The winner was projected by DecisionDeskHQ at 10:30 p.m. EST. The Granite State race was one of the most closely watched Senate races this election cycle along with Pennsylvania, Georgia, Arizona, and North Carolina ...", "link": "https://www.dailywire.com/news/democrat-maggie-hassan-defeats-don-bolduc-in-new-hampshire-senate-race", "date_published": "2022-11-08 22:36:38+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Greg Abbott Wins In Texas: Projection", "description": "Texas Republican Gov. Greg Abbott is projected to win re-election and a third term, marking a sound defeat of perennial Democratic candidate Beto O&#8217;Rourke. The race was projected for Abbott by DecisionDesk HQ at 10:23 p.m. on Tuesday evening. Decision Desk HQ projects Greg Abbott (R) re-elected governor in Texas.#DecisionMade: 10:23pm EST Follow more results ...", "link": "https://www.dailywire.com/news/greg-abbott-wins-in-texas-projection", "date_published": "2022-11-08 22:27:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Josh Shapiro Defeats Doug Mastriano In PA Governor Race: Projection", "description": "Democratic candidate Josh Shapiro will emerge victorious against Republican Doug Mastriano in the Pennsylvania gubernatorial race, according to a projection from Decision Desk.  The winner was projected by DecisionDeskHQ at 9:13 p.m. Tuesday night. The candidate will replace Democratic Governor Tom Wolf, who is completing his second term at the helm of the Keystone State. The ...", "link": "https://www.dailywire.com/news/josh-shapiro-defeats-doug-mastriano-in-pa-governor-race-projection", "date_published": "2022-11-08 22:17:07+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "DeSantis On His Historic Blowout Victory: ‘Florida Is Where Woke Goes To Die’", "description": "Florida Governor Ron DeSantis (R) responded powerfully to his blowout victory in Tuesday night&#8217;s midterm election, declaring that Florida is where wokeness goes to die. The remarks from DeSantis, who is widely considered a top 2024 presidential contender, comes after he easily won re-election with a 19-point victory over Democrat challenger Charlie Crist. DeSantis was ...", "link": "https://www.dailywire.com/news/desantis-on-his-historic-blowout-victory-florida-is-where-woke-goes-to-die", "date_published": "2022-11-08 22:07:47+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Brian Kemp Defeats Stacey Abrams", "description": "Republican Georgia Governor Brian Kemp will defeat Democratic challenger Stacey Abrams in a rematch of the 2018 gubernatorial election, according to a projection by Decision Desk.  Kemp, 59, dominated the polls all election cycle and even overcame opposition from former President Donald J. Trump, who endorsed former Senator David Perdue during the GOP primary.  In ...", "link": "https://www.dailywire.com/news/brian-kemp-defeats-stacey-abrams", "date_published": "2022-11-08 21:32:29+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Maricopa County Held Emergency Hearing To Extend Voting Hours; Judge Denies Request", "description": "A judge ruled against extending voting hours Tuesday in Maricopa County, Arizona, after officials held an emergency hearing following 60 different voting centers experiencing ballot printing issues, according to local media. If the officials were to pass the motion, polls in Arizona would be open until 10 p.m. while suspending any tabulated early ballot returns ...", "link": "https://www.dailywire.com/news/maricopa-county-held-emergency-hearing-to-extend-voting-hours-judge-denies-request", "date_published": "2022-11-08 21:27:19+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Sarah Huckabee Sanders Projected To Follow In Father’s Footsteps As Governor Of Arkansas", "description": "Republican candidate Sarah Huckabee Sanders has followed in her father’s footsteps by being elected governor of Arkansas, according to a projection by Decision Desk. Sanders, 40, who was former President Donald Trump’s press secretary from 2017 to 2019, defeated Democrat nominee Chris Jones to earn the role in which her father, Mike Huckabee, served from ...", "link": "https://www.dailywire.com/news/sarah-huckabee-sanders-projected-to-follow-in-fathers-footsteps-as-governor-of-arkansas", "date_published": "2022-11-08 20:57:42+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Police Arrest Man Accused Of Setting Election Day Fires At 7 Locations, Including 2 Churches", "description": "An alleged arsonist has been arrested after reportedly setting seven fires on Election Day, including at two churches, in Jackson, Mississippi. Devin McLaurin, 23, was arrested Tuesday evening in connection with the fires, according to the Jackson Police Department, along with the help of Hinds County Sheriff&#8217;s Department deputies. “I’ve been here for 30 years. ...", "link": "https://www.dailywire.com/news/police-arrest-man-accused-of-setting-election-day-fires-at-7-locations-including-2-churches", "date_published": "2022-11-08 20:38:05+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Dershowitz Accuser Admits She ‘May Have Made A Mistake’", "description": "One of Jeffrey Epstein’s victims has now said that she “may have made a mistake” in her accusation against lawyer Alan Dershowitz.  Virginia Giuffre has contended since 2014 that Alan Dershowitz had sex with her when she was a minor. Giuffre also accused Epstein of abuse, which has been verified. When Giuffre accused Dershowitz, he ...", "link": "https://www.dailywire.com/news/dershowitz-accuser-admits-she-may-have-made-a-mistake", "date_published": "2022-11-08 20:33:22+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Florida Gov. Ron DeSantis Wins Second Term Against Charlie Crist: Projection", "description": "Republican Ron DeSantis was projected to coast to a second term as governor of Florida Tuesday night, easily besting Democrat Charlie Crist in a rout that will likely amplify growing talk about a 2024 White House run. DeSantis, 44, a former congressman and U.S. Navy veteran of the war in Iraq, never trailed in polls, ...", "link": "https://www.dailywire.com/news/ron-desantis-wins-against-charlie-crist-projection", "date_published": "2022-11-08 20:10:15+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘It’s Not Even In Here’: CNN Anchor Admits ‘Democracy’ Isn’t Even A Top-Five Issue For Voters", "description": "Despite the White House&#8217;s repeated insistence that &#8220;democracy&#8221; itself was on the 2022 midterms ballot, CNN anchor Dana Bash noted at the beginning of her network&#8217;s Election Night coverage that it wasn&#8217;t even a top-five issue for voters. Bash was part of a Tuesday evening panel — which included fellow anchors Jake Tapper, Abby Phillip, ...", "link": "https://www.dailywire.com/news/its-not-even-in-here-cnn-anchor-admits-democracy-isnt-even-a-top-five-issue-for-voters", "date_published": "2022-11-08 20:01:45+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Like Living Through War For Three Years:’ Los Angeles Business Owners Warn City Faces Imminent Collapse Under Progressive Leaders", "description": "Los Angeles business owners sounded the alarm that the city faces an imminent collapse if residents elect more progressives into local government during a segment on Election Night 2022 with The Daily Wire. As homelessness and crime numbers skyrocket in Los Angeles, left-wing politicians continue implementing policies that completely devastated the city. Paul Scrivano, owner ...", "link": "https://www.dailywire.com/news/like-living-through-war-for-three-years-los-angeles-business-owners-warn-city-faces-imminent-collapse-under-progressive-leaders", "date_published": "2022-11-08 19:59:59+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "The New York Times Gets Brutally Mocked After Releasing Guide On How To ‘Cope’ With Election Results", "description": "The New York Times was mocked Tuesday evening after publishing advice on how people can &#8220;cope&#8221; with the results of the midterm elections, which included telling readers to &#8220;breathe like a baby.&#8221; The Times tweeted out a graphic instructing readers to try the following five tips &#8220;to soothe election stress&#8221;: Try five-finger breathing. Trace the ...", "link": "https://www.dailywire.com/news/the-new-york-times-gets-brutally-mocked-after-releasing-guide-on-how-to-cope-with-election-results", "date_published": "2022-11-08 19:40:13+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "MSNBC Guest Jumps The Gun, Starts Denying Election Results Before Polls Close", "description": "MSNBC contributor Jason Johnson jumped the gun on Tuesday afternoon, claiming that the election results in Georgia would not be fair before the polls had even closed in that state. Johnson claimed that voter suppression in Georgia was far worse than it had been in 2018, arguing that Governor Brian Kemp (R) and Secretary of ...", "link": "https://www.dailywire.com/news/msnbc-guest-jumps-the-gun-starts-denying-election-results-before-polls-close", "date_published": "2022-11-08 19:25:01+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Report: Election Results In L.A. Areas Might Take Weeks Due To Mail-In Voting", "description": "Final election results in Los Angeles regions may be slow to arrive, according to a report from The Los Angeles Times.  The Times pointed out that the general election results in the area will probably not be known in multiple elections on Tuesday night. Even in the late hours of the evening, the numbers might ...", "link": "https://www.dailywire.com/news/report-election-results-in-l-a-areas-might-take-weeks-due-to-mail-in-voting", "date_published": "2022-11-08 19:14:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Illinois County Computer Server Connectivity Disrupted With Alleged ‘Cyber-Attacks’", "description": "One Illinois county has faced connectivity issues with its computer servers due to an alleged cyber-attack. The Champaign County Clerk’s Office announced the issue in a statement on Tuesday following reports of voting issues at polling locations. “The Champaign County Clerk’s Office is aware of connectivity issues and computer server performance being impacted. The Clerk’s ...", "link": "https://www.dailywire.com/news/illinois-county-computer-server-connectivity-disrupted-with-alleged-cyber-attacks", "date_published": "2022-11-08 19:00:43+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "GOP Oregon Gubernatorial Candidate Christine Drazan Says Oregonians Are ‘Done’ Night Before Election Day", "description": "Republican Oregon gubernatorial candidate Christine Drazan continued to push for change in Oregon on Monday night before Election Day. In an appearance on Fox News’ “Ingraham Angle,” Drazan discussed the disastrous violence that is plaguing Oregon’s urban areas. Host Laura Ingraham pointed out that last year, Mexico City’s homicide rate per capita was lower than ...", "link": "https://www.dailywire.com/news/gop-oregon-gubernatorial-candidate-christine-drazan-says-oregonians-are-done-night-before-election-day", "date_published": "2022-11-08 18:52:07+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Trump Attacks DeSantis Again: I’ll Release ‘Things About Him That Won’t Be Very Flattering’ If He Runs In 2024", "description": "Former President Donald Trump (R) launched another attack against Florida Governor Ron DeSantis (R) before polls close on Tuesday evening, threatening to release what he claims is damaging information on DeSantis should the governor run for president in 2024. The Wall Street Journal and Fox News noted Trump&#8217;s remarks in reports published Tuesday afternoon. Trump ...", "link": "https://www.dailywire.com/news/trump-attacks-desantis-again-ill-release-things-about-him-that-wont-be-very-flattering-if-he-runs-in-2024", "date_published": "2022-11-08 18:38:32+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘People Are Very Unsettled’: Marsha Blackburn Explains Why A Republican Majority Would Preserve Values In The US", "description": "Tennessee Sen. Marsha Blackburn (R) told The Daily Wire during the Election Night 2022 Preshow on Tuesday that a Republican majority is imperative to preserve faith, family, and freedom in the United States. Blackburn, who assumed office in 2019, said a bucket of issues like inflation, border crime, and parental rights stemming from the Biden ...", "link": "https://www.dailywire.com/news/people-are-very-unsettled-marsha-blackburn-explains-why-a-republican-majority-would-preserve-value-in-the-us", "date_published": "2022-11-08 18:27:14+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Bomb Threat At Louisiana Polling Location; Site Moved, Secretary Of State Reports", "description": "A bomb threat reported at a Louisiana polling location has led to a change of venue and increased security, according to the secretary of state. Louisana Secretary of State Kyle Ardoin announced the change of the polling location from the Kenner Discovery Health Sciences Academy on Loyola Drive in Baton Rouge to Audubon Elementary School ...", "link": "https://www.dailywire.com/news/bomb-threat-at-louisiana-polling-location-site-moved-secretary-of-state-reports", "date_published": "2022-11-08 18:06:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "PA Judge Extends Voting Hours In Luzerne County Due To Paper Shortage", "description": "A Pennsylvania judge has extended voting hours in Luzerne County after the discovery of a paper shortage at polling sites. The deadline was extended from 8 p.m. to 10 p.m. Eastern Time under the emergency order from Judge Lesa Gelb of the Luzerne County Court of Common Pleas. &#8220;Voters in Luzerne County, through no fault ...", "link": "https://www.dailywire.com/news/pa-judge-extends-voting-hours-in-luzerne-county-due-to-paper-shortage", "date_published": "2022-11-08 17:58:29+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘CBS Mornings’ Went To Three Florida Cities – And Didn’t Find One Person Supporting Charlie Crist", "description": "Despite traveling up and down Florida&#8217;s east coast — and stopping in areas of the state that President Joe Biden won in the 2020 presidential election — &#8220;CBS Mornings&#8221; apparently struggled to find even one person who was supporting Democratic gubernatorial hopeful Charlie Crist. According to a report that aired on Tuesday, the network sent a ...", "link": "https://www.dailywire.com/news/cbs-mornings-went-to-three-florida-cities-and-didnt-find-one-person-supporting-charlie-crist", "date_published": "2022-11-08 17:52:47+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Protecting Children From Transgender Treatments Is On The Ballot For Midterm Elections", "description": "While economic issues have remained the focal point of Republican messaging for the 2022 midterm elections, many GOP candidates have vowed to safeguard children from radical gender theory and irreversible medical transition procedures. Despite the emerging data that Americans are reluctant to cosign onto medically transitioning minors, President Biden doubled down on allowing minors full access ...", "link": "https://www.dailywire.com/news/protecting-children-from-transgender-treatments-is-on-the-ballot-for-midterm-elections", "date_published": "2022-11-08 17:25:19+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Single Powerball Player In California Wins $2 Billion Jackpot", "description": "One lucky California resident is about to be a whole lot richer. According to the Powerball website, a single winner from California won the record-breaking $2 billion jackpot during Monday&#8217;s drawing. Lottery officials confirmed the lucky draw to the Los Angeles Times. The record-breaking figure was originally set at $1.9 billion dollars, but was readjusted ...", "link": "https://www.dailywire.com/news/single-powerball-player-in-california-wins-2-billion-jackpot", "date_published": "2022-11-08 17:14:46+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Candace Owens: Breaking My Silence On Ye And The Jewish Community", "description": "There’s something I’ve been thinking about for a long time and I think the best place to begin is with a thank you from my heart. Yesterday, I covered the Kyrie Irving situation. And I felt a little trepidation in giving my opinion about his situation, because there&#8217;s a lot of tension in the air ...", "link": "https://www.dailywire.com/news/candace-owens-breaking-my-silence-on-ye-and-the-jewish-community", "date_published": "2022-11-08 16:46:35+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Suspect Charged With Aggravated Assault After Throwing Alcoholic Beverages At Ted Cruz", "description": "The suspect accused of throwing two cans of alcoholic beverages at Sen. Ted Cruz (R-TX) during Monday&#8217;s victory parade celebrating the Houston Astros&#8217; World Series win was charged with aggravated assault. Joseph Halm Arcidiacono, 33, reportedly threw two cans of White Claw at Cruz while watching the senator move by during the parade, with one ...", "link": "https://www.dailywire.com/news/suspect-charged-with-aggravated-assault-after-throwing-alcoholic-beverages-at-ted-cruz", "date_published": "2022-11-08 16:40:13+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "BREAKING: Guam Elects First Republican Delegate To U.S. Congress Since 1993", "description": "The U.S. territory of Guam has elected its first Republican to represent the island as a non-voting delegate to U.S. Congress for the first time in nearly 30 years. Pacific Daily News reported that Republican Sen. James Moylan, a senator in the island&#8217;s legislature, beat former Speaker of the Guam Legislature Judith Won Pat. The ...", "link": "https://www.dailywire.com/news/breaking-guam-elects-first-republican-delegate-to-u-s-congress-since-1993", "date_published": "2022-11-08 16:36:47+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Businesses Offer Treats, Incentives On Election Day", "description": "Stores are offering incentives on Election Day, encouraging Americans to patronize their business during the 2022 midterm elections. People can get a free doughnut, find ways to pay less for a ride, and possibly get a pizza treat.  Lyft is providing rides at a discounted rate with the code “VOTE22.” Customers who enter the code ...", "link": "https://www.dailywire.com/news/businesses-offer-treats-incentives-on-election-day", "date_published": "2022-11-08 16:31:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Dwyane Wade, Trans Activist: Former NBA Star Fights Ex-Wife On Gender Changes For Their Child", "description": "Dwyane Wade is one celebrity of many who happens to have a trans-identifying child. While the former NBA star’s current wife, actress Gabrielle Union, is supportive of the child’s shifting names and pronouns, the Wade family is now meeting resistance from someone unexpected: the child’s mother. Following his retirement from professional sports, Wade has become ...", "link": "https://www.dailywire.com/news/dwyane-wade-trans-activist-former-nba-star-fights-ex-wife-on-gender-changes-for-their-child", "date_published": "2022-11-08 16:18:43+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Transgender Issues Are A Turning Point For Fed Up Democrats In 2022 Midterm Elections", "description": "While abortion and the economy are anticipated drivers in the 2022 midterm elections, children&#8217;s unmitigated access to irreversible medical transition has emerged as a critical issue leading voters to the ballot box. Democrats in office have made abortion a core part of their campaign message, in addition to fearmongering about Republicans being a &#8220;threat&#8221; to ...", "link": "https://www.dailywire.com/news/transgender-issues-are-a-turning-point-for-fed-up-democrats-in-2022-midterm-elections", "date_published": "2022-11-08 16:11:41+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Maricopa County, Arizona, Experiences Large Number Of Voting Machine ‘Malfunctions’ Early Tuesday", "description": "A number of voting machines were malfunctioning in Maricopa County, Arizona, as voters headed to the polls Tuesday for the 2022 midterm elections. Arizona Republican Party chairwoman Kelli Ward first reported that issues were occurring at several polling places in Maricopa County. Local media confirmed shortly afterward that at least one tabulation machine was having ...", "link": "https://www.dailywire.com/news/maricopa-county-arizona-experiences-large-number-of-voting-machine-malfunctions-early-tuesday", "date_published": "2022-11-08 16:09:19+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "LIVE MIDTERM UPDATES: Voters Turn Out To Decide Key Races, Balance Of Power", "description": "The midterm elections are here. Democrats have held the House and Senate since 2020, but with the economy, crime, and border security on voters&#8217; minds, Republicans have a chance to take power in Washington and stop the Biden agenda in its tracks. Voters will also be electing governors in 36 states, choosing legislators, and selecting ...", "link": "https://www.dailywire.com/news/live-midterm-updates-voters-turn-out-to-decide-key-races-balance-of-power", "date_published": "2022-11-08 16:03:35+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘I’m Going To Be Your Worst Fricking Nightmare’: Kari Lake Dumps Cold Water On Theory She’s Angling For VP Nod", "description": "Arizona gubernatorial candidate Kari Lake (R) said on Tuesday that she was focused on winning her election and serving not only the immediate term, but another following that. Lake responded to a question from a reporter who wondered whether, if former President Donald Trump were to ask her, she might consider leaving the Arizona governor&#8217;s ...", "link": "https://www.dailywire.com/news/im-going-to-be-your-worst-fricking-nightmare-kari-lake-dumps-cold-water-on-theory-shes-angling-for-vp-nod", "date_published": "2022-11-08 15:57:45+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Amazon’s Alexa Misinforms Tennesseans Of Polling Hours On Election Day", "description": "Alexa owners in Tennessee were given false information about what hours they are able to vote on Tuesday in the midterm elections. Numerous reports have emerged of Tennessee residents who have found that when they ask the Amazon-owned virtual assistant technology what hours they are able to vote in the midterm elections, Alexa responds, “There ...", "link": "https://www.dailywire.com/news/amazons-alexa-misinforms-tennesseans-of-polling-hours-on-election-day", "date_published": "2022-11-08 15:49:46+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "China Preparing For War, Xi Jinping Says", "description": "On Tuesday, Chinese Communist President Xi Jinping declared his country will focus on preparing for war. “China is preparing for war, its President Xi Jinping is reported as saying,” Express reported. “The communist leader cited security concerns, saying that it was ‘increasingly unstable and uncertain.’” “For years, Xi has been ratcheting up his rhetoric around the ...", "link": "https://www.dailywire.com/news/china-preparing-for-war-xi-jinping-says", "date_published": "2022-11-08 15:49:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Get Ready For A Plethora Of Election Deniers (And This Time, The Media Will Be Cohorts)", "description": "Democrats and their media minions have been busy planting the seed that the 2022 midterm elections could be rife with hacking and interference from extremists, which might make the outcomes &#8220;illegitimate.&#8221; Sound familiar? That&#8217;s what some Republicans said last go &#8217;round, when Donald Trump lost his re-election bid. As we know now, nothing was ever ...", "link": "https://www.dailywire.com/news/get-ready-for-a-plethora-of-election-deniers-and-this-time-the-media-will-be-cohorts", "date_published": "2022-11-08 15:37:22+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "How To Watch The Daily Wire For All The Latest Midterm Elections Developments", "description": "Follow all the dramatic developments in the midterm elections at The Daily Wire, where you will find rapid results, powerhouse guests, and sharp analysis from Ben Shapiro and a cast of stars and experts. Streaming coverage begins at 3 p.m. CT and will continue until 11 p.m. Prior to polls closing, Georgia Howe and Cabot ...", "link": "https://www.dailywire.com/news/how-to-watch-the-daily-wire-for-all-the-latest-midterm-elections-developments", "date_published": "2022-11-08 15:16:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘It Still Carries Tradition’: Jennifer Lopez Says She Was Shocked After NYT Op-Ed Upset She Took Ben Affleck’s Last Name", "description": "Jennifer Lopez said she was shocked after learning about The New York Times op-ed that expressed disappointment when the singer took Ben Affleck&#8217;s last name after the two tied the knot at a Las Vegas chapel in July. The 53-year-old singer admitted the idea of taking the name of the person you love &#8220;still carries ...", "link": "https://www.dailywire.com/news/it-still-carries-tradition-jennifer-lopez-says-she-was-shocked-after-nyt-op-ed-upset-she-took-ben-afflecks-last-name", "date_published": "2022-11-08 15:06:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Dog Seen Carrying Human Arm, Police Find More Body Parts", "description": "Police in Jackson, Mississippi, were called after people reported seeing a dog walking around carrying a severed human arm. Police later found the rest of the body – without the arm and without a head – near an abandoned home, WLBT reported. The dog was reported on Saturday, while the rest of the body was ...", "link": "https://www.dailywire.com/news/dog-seen-carrying-human-arm-police-find-more-body-parts", "date_published": "2022-11-08 14:50:11+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Oculus Founder, Defense Contractor Developing VR Headset That Kills User If Avatar Dies In Game", "description": "Modern virtual reality pioneer Palmer Luckey claims he created a VR headset that would instantly destroy the user&#8217;s brain with explosive charge modules if the player&#8217;s character dies in the game. &#8220;If you die in the game,&#8221; Luckey wrote in his Monday blog post. &#8220;You die in real life.&#8221; Luckey, the founder of Oculus VR ...", "link": "https://www.dailywire.com/news/oculus-founder-defense-contractor-developing-vr-headset-that-kills-user-if-avatar-dies-in-game", "date_published": "2022-11-08 14:49:13+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Biden Calls A Lid Before Noon As Early Voting Points To A Bad Night For POTUS’s Party", "description": "President Joe Biden called a lid for the day Tuesday morning. Reporters from the White House press pool broke the news on Twitter. The lid was called at 11:20 am EST, meaning Biden will not make any public appearances for the rest of Election Day, though he can still issue statements and be active on ...", "link": "https://www.dailywire.com/news/biden-calls-a-lid-before-noon-as-early-voting-points-to-a-bad-night-for-potuss-party", "date_published": "2022-11-08 14:46:39+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Ben Shapiro: Red Wave In Senate Could Set Table For Super Majority", "description": "If Republicans can capture control of the Senate Tuesday, the table could be set for achieving a filibuster-proof super majority in 2024, according to Ben Shapiro. Speaking on his popular podcast and radio show on Election Day, the Daily Wire co-founder said he believes the GOP is poised to take at least a 52-seat majority, ...", "link": "https://www.dailywire.com/news/ben-shapiro-red-wave-in-senate-could-set-table-for-super-majority", "date_published": "2022-11-08 14:39:20+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "James Cameron Ready To Abandon ‘Avatar’ Franchise: ‘How Many People Give A S*** Now?’", "description": "James Cameron hopes fans are still interested in the “Avatar” franchise more than a decade since the last installment, but he said he’s willing to accept if they aren’t. The highly anticipated sequel “Avatar: The Way of Water” premieres in theaters on December 16, a full 13 years after the original film’s release. Cameron is ...", "link": "https://www.dailywire.com/news/james-cameron-ready-to-abandon-avatar-franchise-how-many-people-give-a-s-now", "date_published": "2022-11-08 14:30:18+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘I’m American Now’: Ozzy Osbourne Says He’d Rather Stay In The U.S. After Deciding To Move Back To U.K.", "description": "Legendary rocker Ozzy Osbourne said he&#8217;s an &#8220;American now&#8221; and said he&#8217;d rather stay in the United States after previously announcing he&#8217;s moving back to the United Kingdom. The 73-year-old singer admitted he&#8217;s not moving across the pond out of choice, but has to amid a rise in crime in Los Angeles and taxes, Consequence ...", "link": "https://www.dailywire.com/news/im-american-now-ozzy-osbourne-says-hed-rather-stay-in-the-u-s-after-deciding-to-move-back-to-u-k", "date_published": "2022-11-08 14:29:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Harris Faulkner Torches Marie Harf After Repeating Abrams’ Claims Of Voter Suppression In GA", "description": "Fox News&#8217; Harris Faulkner torched former State Department spokesperson Marie Harf after she repeated Georgia Democratic gubernatorial candidate Stacey Abrams&#8217; claims of voter suppression in the Peach State. During the Faulkner report on Tuesday, she asked a panel of guests why Abrams, who is running against incumbent Republican Gov. Brian Kemp, continued to claim there ...", "link": "https://www.dailywire.com/news/harris-faulkner-torches-marie-harf-after-repeating-abrams-claims-of-voter-suppression-in-ga", "date_published": "2022-11-08 14:25:42+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Democrats Have A Turnout Problem Today’: Leading Elections Expert Live-Reports Dems In Trouble", "description": "Roughly halfway through Election Day on the East Coast, a leading political prognosticator, looking at early precinct voting patterns, concluded that the Democrats were in serious trouble. Dave Wasserman runs the non-partisan Cook Political Report, and he was watching the data from states on the East Coast and extrapolating from what he had seen by ...", "link": "https://www.dailywire.com/news/democrats-have-a-turnout-problem-today-leading-elections-expert-live-reports-dems-in-trouble", "date_published": "2022-11-08 14:17:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "20 Celebrity Endorsements For The 2022 Midterm Elections", "description": "Many celebrities are diehard leftists and were more than happy to share their opinions ahead of the 2022 midterm elections. These Hollywood stars are going on record with a final pitch for their preferred candidates, hoping their massive social media followings can help sway the outcome of some tight races. Selena Gomez Actress Selena Gomez ...", "link": "https://www.dailywire.com/news/20-celebrity-endorsements-for-the-2022-midterm-elections", "date_published": "2022-11-08 14:10:31+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "How Long Will Votes Take To Count In Key States?", "description": "Since each state controls its own election laws, some states will take longer — or much longer — than others to count the votes. Here is how long states have taken in the past, and how long they might take to count this year.  Pennsylvania Voting in the Keystone State is set to conclude at ...", "link": "https://www.dailywire.com/news/how-long-will-votes-take-to-count-in-key-states", "date_published": "2022-11-08 14:08:15+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Biden Sends Feds To Monitor Florida’s Election. DeSantis Shuts Them Down.", "description": "Florida Governor Ron DeSantis&#8217; (R) administration rebuffed this week any attempt by the Biden administration to monitor elections in the state from inside polling locations. The Department of Justice said in a statement this week that it was sending officials to 64 jurisdictions throughout the U.S., most of which were in red or purple states. ...", "link": "https://www.dailywire.com/news/biden-sends-feds-to-monitor-floridas-election-desantis-shuts-them-down", "date_published": "2022-11-08 13:17:10+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘I’ve Never Seen That Much Republican Signage In My Neighborhood’: ‘The View’ Host Frets Over New Yorkers Liking Lee Zeldin", "description": "Sunny Hostin made it clear on Tuesday that she was concerned about the sheer volume of signs in her area showing support for New York&#8217;s Republican gubernatorial challenger Lee Zeldin. Hostin made the comments on Tuesday&#8217;s broadcast of ABC&#8217;s &#8220;The View,&#8221; noting that she had voted earlier that morning in Westchester County — which she ...", "link": "https://www.dailywire.com/news/ive-never-seen-that-much-republican-signage-in-my-neighborhood-the-view-host-frets-over-new-yorkers-liking-lee-zeldin", "date_published": "2022-11-08 13:10:04+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Howard Stern Makes Unhinged Prediction If Herschel Walker Wins", "description": "This would be why they call him a &#8220;shock jock.&#8221; Howard Stern made the absurdly dire prediction Monday that a victory by former NFL legend Herschel Walker over incumbent Democrat Raphael Warnock in the Georgia Senate race would trigger  &#8220;another civil war.&#8221; Stern, who made his name with low-brow humor long before he ever ventured ...", "link": "https://www.dailywire.com/news/howard-stern-makes-unhinged-prediction-if-herschel-walker-wins", "date_published": "2022-11-08 13:08:25+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Sunny Hostin Denies She Compared White Women To ‘Roaches’ For Voting GOP", "description": "&#8220;The View&#8221; host Sunny Hostin disputed the claim on Tuesday that she had compared white Republican women to &#8220;roaches&#8221; if they voted for GOP candidates. Hostin and her cohosts on the ABC midday talk show spent much of Tuesday&#8217;s broadcast discussing the midterm elections — which were already underway all across the country — and ...", "link": "https://www.dailywire.com/news/sunny-hostin-denies-she-compared-white-women-to-roaches-for-voting-gop", "date_published": "2022-11-08 12:48:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "While Critics Focus On Fetterman’s Stroke, Doctor Warns Of Potentially More Serious Health Problem", "description": "On the eve of Election Day, a prominent internal medicine doctor pointed out that although the public has focused on Pennsylvania Democratic senatorial candidate John Fetterman’s possible brain impairment from the stroke he had last spring, no one was talking about the cardiac problems associated with it. Dr. Marc Siegel, from NYU Langone hospital, spoke ...", "link": "https://www.dailywire.com/news/while-critics-focus-on-fettermans-stroke-doctor-warns-of-potentially-more-serious-health-problem", "date_published": "2022-11-08 12:29:23+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Washington State Gears Up To Mandate ‘Ethnic Studies’ As Its Architect Rails Against ‘Jewish Complicity’", "description": "The Washington State Board of Education moved closer last week to requiring high schoolers to study “ethnic studies” in order to graduate&#8211;even as the activist who formally trained the board on the subject has been railing against Jews, downplaying the oppression they have faced and writing: “How do we hold white Jews who are complicit in Whiteness (racism) accountable when they use their Jewishness to try to cover their deeds?”", "link": "https://www.dailywire.com/news/washington-state-gears-up-to-mandate-ethnic-studies-as-its-architect-rails-against-jewish-complicity", "date_published": "2022-11-08 12:20:54+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Ron DeSantis: Florida’s Largest County, A Democrat Stronghold, Is Turning Red Because Of Conservatism", "description": "Florida Governor Ron DeSantis (R) said during an interview this week that Miami-Dade County, Florida&#8217;s largest county and a Democrat stronghold, is turning red because of conservatism. DeSantis made the remarks during an interview Monday night with Fox News host Tucker Carlson when asked what has led to the shift in the county. DeSantis responded ...", "link": "https://www.dailywire.com/news/ron-desantis-floridas-largest-county-a-democrat-stronghold-is-turning-red-because-of-conservatism", "date_published": "2022-11-08 11:49:50+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Pelosi Reveals Attack On Her Husband Will Impact Her Political Future", "description": "House Speaker Nancy Pelosi (D-CA) said during a new interview that aired this week that the recent attack on her husband, Paul Pelosi, would impact her decision about whether she will retire from Congress if Democrats lose control of the House of Representatives after Tuesday&#8217;s midterm elections. Pelosi made the remarks during a CNN interview ...", "link": "https://www.dailywire.com/news/pelosi-reveals-attack-on-her-husband-will-impact-her-political-future", "date_published": "2022-11-08 11:40:43+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Trucker Who Admitted To Killing NYC Model Gets Sentenced", "description": "The body of Rebecca Landrith, 47, was found in a snowbank along I-80 in Union County, Pennsylvania, on February 7, 2021. A year-and-a-half later, in September 2022, Texas truck driver Tracy Ray Rollins Jr., 30, pleaded guilty to killing Landrith and then shooting her body at least 20 times, PennLive reported. On Monday, Rollins was ...", "link": "https://www.dailywire.com/news/trucker-who-admitted-to-killing-nyc-model-gets-sentenced", "date_published": "2022-11-08 11:37:54+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Philadelphia Suburbs Front And Center As Pennsylvania Candidates Make Final Push", "description": "Statewide candidates in Pennsylvania are focusing on the suburbs of Philadelphia on Election Day. Republican Dr. Mehmet Oz and Democratic Lt. Governor John Fetterman are vying for the commonwealth’s open seat in the U.S. Senate, while Republican state Sen. Doug Mastriano and Democratic Attorney General Josh Shapiro are competing in the gubernatorial race. While the ...", "link": "https://www.dailywire.com/news/philadelphia-suburbs-front-and-center-as-pennsylvania-candidates-make-final-push", "date_published": "2022-11-08 11:24:08+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Red-Wave Momentum Buoys GOP Hopes For Congressional Control As Voters Head To Polls", "description": "Republicans are hoping for a red tsunami Tuesday, as 11th-hour polling showed momentum surging for the GOP ahead of the critical midterm elections. With midterms historically going against the party in the White House, and President Joe Biden mired in dismal approval numbers, a takeover of the House of Representatives has long been seen as ...", "link": "https://www.dailywire.com/news/red-wave-momentum-buoys-gop-hopes-for-congressional-control-as-voters-head-to-polls", "date_published": "2022-11-08 11:05:14+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Poll: Tudor Dixon Holds Razor-Thin Lead Over Gretchen Whitmer In Michigan", "description": "Michigan Republican gubernatorial candidate Tudor Dixon has a razor-thin lead over incumbent Democrat Governor Gretchen Whitmer, a new poll shows. The survey of 1,097 respondents, conducted by the Trafalgar Group from November 5-7, showed Dixon with a lead of 0.3 percentage points over Whitmer just hours before polls opened in the Wolverine State. According to ...", "link": "https://www.dailywire.com/news/poll-tudor-dixon-holds-razor-thin-lead-over-gretchen-whitmer-in-michigan", "date_published": "2022-11-08 10:48:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Biden’s DOJ Sending Election Monitors To 64 Jurisdictions, 20 More Than Trump Administration Did In 2020", "description": "On Monday, one day before Election Day, the Biden administration’s Justice Department announced it was sending monitors from its Civil Rights Division to 64 jurisdictions in 24 states in order to “monitor compliance with federal voting rights laws.” The DOJ also alerted Americans that if they had complaints about “possible violations of the federal voting ...", "link": "https://www.dailywire.com/news/bidens-doj-sending-election-monitors-to-64-jurisdictions-20-more-than-trump-administration-did-in-2020", "date_published": "2022-11-08 10:38:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Mastriano Centers On Education, Crime, Economy In Closing Pitch To Pennsylvania Voters", "description": "Republican State Senator and Pennsylvania gubernatorial candidate Doug Mastriano emphasized education reform, public safety, and the economy in one of his final appeals to voters in the Keystone State. As Governor Tom Wolf, a Democrat, nears the completion of his second and final term, Republicans have a chance to seize control of an important swing ...", "link": "https://www.dailywire.com/news/mastriano-centers-on-education-crime-economy-in-closing-pitch-to-pennsylvania-voters", "date_published": "2022-11-08 10:26:45+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Alanis Morissette Said She Dropped Out Of Latest Performance Because of ‘Anti-Woman’ Sentiment, Reminds Fans To Vote", "description": "Singer Alanis Morissette issued a statement saying she dropped out of a scheduled Rock and Roll Hall of Fame performance on Saturday because of sexist behavior and general disrespect from the production team. The Canadian-born singer took to Instagram to explain her reasons for leaving after fans were left speculating. Morissette was slated to perform ...", "link": "https://www.dailywire.com/news/alanis-morissette-said-she-dropped-out-of-latest-performance-because-of-anti-woman-sentiment-reminds-fans-to-vote", "date_published": "2022-11-08 10:15:07+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Top Atlanta-Based Pollster Predicts Outright Win For Herschel Walker Still Possible", "description": "ATLANTA- Whatever happens on Election Day, it doesn&#8217;t seem like Georgia&#8217;s GOP Senate candidate Herschel Walker will lose on Tuesday. At worst, he and his opponent — incumbent Senator Raphael Warnock (D-GA) — will head to a runoff election. At best — as one top Atlanta-based pollster says is still likely —  he will win ...", "link": "https://www.dailywire.com/news/top-atlanta-based-pollster-predicts-outright-win-for-herschel-walker-still-possible", "date_published": "2022-11-08 10:06:57+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Final Polls Showing Major Kemp Victory In Georgia", "description": "Several final polls for Georgia&#8217;s 2022 gubernatorial race show that incumbent Governor Brian Kemp (R) will defeat Democratic candidate Stacey Abrams handily in a rematch of the 2018 election. Per RealClearPolitics&#8217; polling average, Kemp has an 8.3-point lead over Abrams. The Trafalgar Group&#8217;s latest and closing poll for this race reports that the governor could ...", "link": "https://www.dailywire.com/news/final-polls-showing-major-kemp-victory-in-georgia", "date_published": "2022-11-08 08:55:05+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Trump Teases ‘Big Announcement’ Next Week During J.D. Vance Rally", "description": "VANDALIA, OHIO &#8211; Former President Donald Trump said Monday that he will make a &#8220;big announcement&#8221; next week, fueling speculation that he is planning a 2024 presidential run. Trump teased the announcement at an Ohio rally where he joined forces with Ohio Republican Senate candidate J.D. Vance in a final push for Vance&#8217;s campaign. &#8220;I am ...", "link": "https://www.dailywire.com/news/trump-teases-big-announcement-next-week-during-j-d-vance-rally", "date_published": "2022-11-08 08:34:07+00:00", "persistent": false, "user": null, "language": "en-US"}]