[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "FINALLY, a Linux laptop with NO TRADEOFFS! Tuxedo InfinityBook Pro 14 Gen7 Review", "description": "Link to InfinityBook Pro 14 Gen 7 (not sponsored, not affiliated): https://www.tuxedocomputers.com/en/TUXEDO-InfinityBook-Pro-14-Gen7.tuxedo\n\n👏 SUPPORT THE CHANNEL:\nGet access to a weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYouTube: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n📹 MORE VIDEOS FROM ME\nLinux news in Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\nGaming on Linux: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nI'm also on ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\nAnd on PEERTUBE: https://tilvids.com/c/thelinuxexperiment_channel/videos\n\n🏆 FOLLOW ME ELSEWHERE:\nTwitter : http://twitter.com/thelinuxEXP\nInstagram: https://www.instagram.com/nick_thelinuxexp/\nMastodon: https://mastodon.social/web/@thelinuxEXP\nPixelfed: https://pixelfed.social/TLENick\n\nThis video is distributed under the Creative Commons Share Alike license.\n\n#laptop #linux #tuxedo \n\n00:00 Intro\n00:22 Unboxing\n02:04 Design & Build Quality: solid and beautiful\n03:49 Specs & Configuration Options: make it your own\n06:17 Display: good panel, not a fan of the resolution\n07:28 Keyboard & Touchpad: excellent\n08:27 Webcam, Mic & Speakers: decent\n09:36 Performance & battery life: all day workstation\n11:36 This is the template for all Linux laptops\n13:14 Support the channel\n\n\nThe chassis is a magnesium / aliminium alloy. It's really sturdy, but also really lightweight. My review unit came in black, and retains no fingerprints. You can also get it in silver if you prefer. In both cases, it's 1.7cm thick, and 1.3kg.\n\nThe laptop can be opened, and upgraded, you can switch out the RAM and the SDD as you like, with dual channel RAM slots, and an m.2 slot that supports PCIe4 drives.\n\nMy review unit came with a french azerty keyboard, but they have a lot of different layouts, and you can even send them your own to be laser etched, or have a blank keyboard. The super key has a cartoony tux logo, but you can ask for you own super key as well.\n\nYou can add an Nvidia RTX 3050ti to turn the laptop into a real workstation. In terms of ports, on the left side, you get the usual kensington lock, a USB C 3.2 Gen 2 port, which supports display port 1.4 and power delivery, a USB A 3.2 Gen 1 port, a full size SD card reader, and a 2 in 1 audio jack. \n\nOn the right, you have the barrel charging port, an HDMI 2.0b port, a USB 3.2 Gen 1 port, and a thunderbolt 4 port, which also supports display port 1.4 and power delivery.\n\nThe display is a 3K panel, at 2880 by 1800, in a 16:10 aspect ratio. It's 14 inch, and has an anti reflective coating.\n\nIt covers 99% of sRGB, 74.7% of AdobeRGB, and 81.1% of DCI-P3. It goes up to 400 nits, the contrast ratio is 1500:1, and it runs at 90hz.\n\nThe keyboard feels really good. It's a chiclet style keyboard, with black keys, whether you have the black, or the silver variant. It's backlit, and has a tux super key that you can customize, as I said before. \n\nThe touchpad feels awesome, it's super smooth, covered in glass, and it's a joy to use with gestures, it's precise and responsive, and it clicks well.\n\nThe webcam goes up to 1080p30, and while it will need some amount of light to not be too grainy, it's far from the worse I've seen. \n\nThe microphone is a bit better. You'll need to lower the default gain, but the voice is clear, and you can't really hear fan noise, although it will pick up on touchpad clicks and keyboard presses. It's really not bad for a laptop mic.\n\nAs per the speakers, they're bottom firing, and they're also decent. They're not tinny, they don't distort at high volumes, and they get loud enough. Nothing fancy, but they do the trick perfectly for a youtube video or a movie.\n\nThe 12700H is a very powerful CPU, with 14 cores, and 20 threads, and a max frequency of 4.7Ghz. On geekbench 5, it gets 1781 in single core, and 8388 in multi core, which means it beats my desktop 5800H in single core, and gets extremely close in multi core.\n\nhttps://browser.geekbench.com/v5/cpu/18503343\n\nIt's cooled with a dual fan system, with 2 fans and 2 heatpipes, and uses liquid metal, which means temps never got high, staying at around 40 degrees Celsius at idle, and about 80°C under heavy load.\n\nIn terms of battery life, I got around 7 and a half hours of youtube video playback in a loop over wifi, at 50% brightness with bluetooth on. With a more regular workload of web browsing, listening to music, writing this script, and watching the occasional video or running a test or 2 on the laptop, I got 9h.\n\nReview of the 16 inch model (the equivalent model from SLimbook): https://www.youtube.com/watch?v=DTei_ivtONA", "link": "https://www.youtube.com/watch?v=l-LTjXdMe2w", "date_published": "2022-11-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]