[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "20 Tips For Beginners In Disney Dreamlight Valley", "description": "After dozens of hours in the game, we're bringing you some tips to help your garden figuratively and literally grow. Here are 20 quick-hitting tips to help you keep your wardrobe stylish, your house fancy, and your neighborhood full of Disney and Pixar friends.\n#Gaming #DisneyDreamlightValley #GameSpot \n\nDisney Dreamlight Valley is out now on PC, Switch, PlayStation, and Xbox, and is included in Game Pass. \n\nIf you haven't heard by now, the farm-life sim genre that gave us classics such as Animal Crossing and Stardew Valley is getting a new entry soon. Disney Dreamlight Valley is, in large part, exactly what it sounds like: a House of Mouse spin on the popular genre where characters such as Isabelle and Tom Nook are replaced by Princess Jasmine and Scrooge McDuck. \n\nIn many ways, Disney Dreamlight Valley looks to Nintendo's dominant life sim for guidance, which means the two games play a lot alike in some regards. For example, both drop you into the world as a newcomer inheriting a fixer-upper of a home in a town full of friendly faces eager for a meet-and-greet. Both also let you live out your days on your own schedule with activities like fishing, mining, shopping, cooking, and more.\n\nThe (eventually) free-to-play game will require a Founder's Pack to get into the early access period, which the team at Gameloft says will last about a year.", "link": "https://www.youtube.com/watch?v=gcsGJwBJFmQ", "date_published": "2022-09-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 Edgerunners Update Trailer", "description": "Check out Patch 1.6 for Cyberpunk 2077 in this latest teaser trailer that brings over a cross over collaboration with the anime Cyberpunk Edgerunners. You can find a new mission, the jacket that David wears in the anime, a new weapon, and more. \n\nAdditionally, some nice changes coming include the ability to transmogrify your gear so you can look the way you want while still having the bests stats on your character. A new photo mode got added, and also a new arcade cabinet is being put into the game where you can play a game called Roach Race. It's in Cyberpunk 2077 and also on mobile iOS and Android devices.\n\n#cyberpunk2077 #edgerunners #gaming", "link": "https://www.youtube.com/watch?v=qzK2ZqzOago", "date_published": "2022-09-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 Edgerunners Update and Phantom Liberty Full Presentation", "description": "Learn more in this latest presentation during the latest Night City Wire showcase with Gabriel Amatangelo, Game Director on the past, present and future of Cyberpunk 2077's post launch. He breaks down all the updates that they made to enhance the game to where it is today, to speaking on Patch 1.6 the Edgerunners Update to give an idea on what to expect in the latest update, and finally a brief tease and glimpse at the expansion Cyberpunk 2077 Phantom Liberty.\n\nKeanu Reeves even makes a quick guest appearance at the end of the presentation to tell fans he's back as Johnny Silverhand in the upcoming expansion.\n\nTimestamps\n0:00 Edgerunners Update Teaser Trailer\n1:36 Roach's Race Teaser\n3:01 Cyberpunk 2077 Past\n5:04 Edgerunners Update \n9:17 Phantom Liberty Expansion\n10:15 Keanu Reeves Cameo", "link": "https://www.youtube.com/watch?v=mFNa96lL0d4", "date_published": "2022-09-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 Phantom Liberty Official Teaser Trailer", "description": "Get ready for Phantom Liberty a spy-thriller expansion for Cyberpunk 2077 set in an all new district of Night City. Coming in 2023 to PC, PlayStation 5, Xbox Series X and S, and Stadia.\n\nAlso Keanu Reeves is making a return as Johnny Silverhand in the upcoming expansion.\n\n#cyberpunk2077 #gaming", "link": "https://www.youtube.com/watch?v=IJoR1oZwWRA", "date_published": "2022-09-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 Reveals DLC, Ditches Last Gen Consoles | GameSpot News", "description": "Cyberpunk has its biggest update yet, the PlayStation 5 is getting a new look, and is Naughty Dog teasing its next franchise?\n#GameSpot #Cyberpunk2077 #PlayStation5 \n\nCyberpunk 2077 reveals its first expansion, PlayStation 5 is getting some new accessories, and is Naughty Dog teasing its next franchise? All this on today’s GameSpot News.\n\nCyberpunk unveiled its first paid DLC today. Let’s get the bad news out of the way: it won’t be coming to previous gen consoles. Phantom Liberty launches in 2023 and brings back Keanu Reeves' Johnny Silverhand for another adventure. \n\nDescribed as a \"spy-thriller\" expansion that introduces a new cast of characters, Phantom Liberty takes place in a new, previously unexplored district in Night City. \n\nThe new 1.6 update that releases today, September 6, will be the final significant patch for Cyberpunk 2077 on PS4 and Xbox One. This update adds equippable items from the Cyberpunk Edgerunners anime to the game, a handful of new side quests, as well as highly requested features such as transmogging and cross progression .\n\nThere will be small patches for previous gen consoles going forward to address bugs and other fixes, but no new content will be added to those versions of the game, and those who picked up the Limited Edition Bundle for Xbox One at launch will receive a reimbursement for the expansion in the form of Microsoft Store credits. \n\nBetween now and the Phantom Liberty DLC, CD Projekt Red also promised some other long-requested adjustments, such as changes to police behavior and car combat, to come in future updates.\n\nAt the end of the day, it’s probably for the best that CD Projekt Red is ceasing development for the previous generation of consoles, as Cyberpunk’s launch on them was a disaster, even resulting in the game being temporarily delisted from the PlayStation Network’s store.\n\nSpeaking of PlayStation, the PlayStation 5 is getting a camo makeover. Sony has revealed a new set of designs for its PS5 hardware, DualSense controller, and Pulse 3D wired headset, which it calls the Gray Camouflage Collection. Unlike the default white model PS5 or its more vibrant selection of console cover plates, this design will wrap the console in a camouflage design that makes the device great for grabbing someone's attention and hiding it in case a war breaks out on an overcast day.\n\nSony says that preorders will begin on September 15, with the DualSense wireless controller and PS5 console covers launching globally on October 14. The Gray Camouflage Pulse 3D headset will arrive later in December.\n\nTIME STAMPS: \n00:12 - Cyberpunk 2077 update\n01:56 - PlayStation 5 camo design\n02:39 - Naughty Dog's next franchise", "link": "https://www.youtube.com/watch?v=ZqsxHLOb8tM", "date_published": "2022-09-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 Xbox Series S Performance Mode Official Gameplay", "description": "Take a look at the Xbox Series S performance mode Cyberpunk 2077 gameplay one of the newest addition for the console users!\n\nCyberpunk 2077 is an open-world, action-adventure RPG set in Night City, a megalopolis obsessed with power, glamour, and body modification. You play as a cyberpunk mercenary taking on the most powerful forces of the city in a fight for glory and survival. Fully customize your character and playstyle as you take on jobs, build your reputation, and unlock upgrades. The relationships you forge and the choices you make will shape the story and the world around you. \n\nAvailable for Xbox One, PlayStation 4, PC, Google Stadia, Xbox Series X|S or PlayStation 5. \n\n#cyberpunk2077 #xboxseriess #gaming", "link": "https://www.youtube.com/watch?v=YcJVdETiOgE", "date_published": "2022-09-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Splatoon 3 - Everything To Know", "description": "Splatoon has been one of Nintendo's most surprising franchises in years - a wild combination of shooter and zone control in a stylish multiplayer package. Here's everything you need to know about the latest game in the franchise, Splatoon 3.\n\nWith the Nintendo Switch well established and extremely successful, Splatoon 3 looks to bring back the inky magic. Here's everything we know about Splatoon 3 so far including the release date, multiplayer details, and what to expect from the single player campaign mode. Splatoon 3 launches for Nintendo Switch on the 9th September 2022.\n\n00:00 - Intro\n00:28 - Plot & Setting\n02:12 - Gameplay\n04:56 - Multiplayer\n06:09 - DLC\n06:53 - Platforms\n07:48 - Release Date", "link": "https://www.youtube.com/watch?v=sgGDkBTzuuA", "date_published": "2022-09-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]