[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Randall Goosby: Tiny Desk Concert", "description": "Tom Huizenga | September 6, 2022\nViolinist Randall Goosby has arrived – and not just at the Tiny Desk. The young Juilliard graduate is racking up debuts with the world's most important orchestras, he just pocketed the $25,000 Avery Fisher Career Grant and he can boast none other than violin legend Itzhak Perlman as his mentor. Not bad for 26 years old.\n\nWe know Goosby's star is on the rise, but the way his career got off the ground is worth mentioning. Goosby is an alum of the Detroit-based Sphinx Organization, which, for 25 years, has helped launch many prominent musicians of color, including composers Jessie Montgomery and Carlos Simon, pianist Lara Downes and opera stars Davóne Tines and Will Liverman. Goosby, at age 13, was the youngest to win the Sphinx Concerto Competition.\n\nSphinx was also where he first performed neglected music by Black composers. \"With each passing day,\" Goosby told NPR last year, \"you can almost see this wave of reckoning, and people starting to realize the magnitude of the body of work that we've not paid attention to.\"\n\nJoined by the discerning pianist Zhu Wang, Goosby begins with the Black British composer Samuel Coleridge-Taylor's \"Deep River,\" the bittersweet spiritual whose melody floats with uncommon beauty in this performance. Listen for the perfectly placed high note at the end. Goosby then tips his hat to Antonin Dvorak, the composer who suggested that American composers look to the music of African Americans for pure inspiration. The two young musicians close with \"Estrellita,\" a bon-bon of unrequited love from Mexican composer Manuel Ponce.\n\nWith his secure technique, natural phrasing, gorgeous tone and smart programming, Randall Goosby has everything it takes to craft a major career.\n\nSET LIST\nSamuel Coleridge-Taylor: \"Deep River\" (arr. Maud Powell)\nAntonin Dvorak: Sonatina for Violin and Piano, IV. Finale: Allegro\nManuel Ponce: \"Estrellita\" (arr. Jascha Heifetz):\n\nMUSICIANS\nRandall Goosby: violin\nZhu Wang: piano\n\nTINY DESK TEAM\nProducer: Tom Huizenga\nAudio Engineer: Josh Rogosin\nDirector: Kara Frame\nSeries Creator: Bob Boilen\nSeries Producer: Bobby Carter\nEditor: Joshua Bryant\nVideographers: Kara Frame, Joshua Bryant, Pierre Kattar\nAudio Assistant: Natasha Branch\nProduction Assistants: Jill Britton, Joby Tanseco\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#TinyDesk #NPRMusic #RandallGoosby", "link": "https://www.youtube.com/watch?v=7io8CSHjN2E", "date_published": "2022-09-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]