[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCl2mFZoRqjw_ELax4Yisf6w", "title": "FUTO legendary grant recipient Ian Clarke - founder of uncensorable, anonymous, freenet project", "description": "Ian Clarke: https://tinyurl.com/yckrpnsj\nFreenet: https://freenet.org/\nLocutus presentation: https://www.youtube.com/watch?v=d31jmv5Tx5k\n\nFUTO Grant Program - https://futo.org/grants\nFUTO Youtube channel - https://www.youtube.com/channel/UCIBNAd4nO5rk6G8YaEudqNw\nFUTO Odysee - https://odysee.com/@FUTO:e\nFUTO Minds - https://www.minds.com/futo/\n\nemail grantapps@futo.org & answer the following questions to be considered:\n\n  1. What is your project?  Provide a link to more detailed information if it exists.\n  2. How will your project reduce the harm that the Tech Oligopoly inflicts upon the people?\n  3. How and when do you expect to publish the work resulting from your project?\n  4. What have you finished or accomplished so far?\n  5. Who is the target user of your work?\n  6. What do you plan to do with copyrights and patents resulting from your project?\n  7. How will you measure the success of your project?  Please be as specific as possible.\n  8. How would you rate your chances of success?\n  9. What resources can the FUTO organization provide to assist?\n  10. What resources have you been provided before if any, and from what donors?\n\n\n\n0:00 / 55:50\nFUTO legendary grant recipient Ian Clarke - founder of uncensorable, anonymous, freenet project\n12,754 views  Streamed live on Sep 5, 2022  Ian Clarke: https://tinyurl.com/yckrpnsj\nFreenet: https://freenet.org/…\n761\n14\nShare\nClip\nSave\nLouis Rossmann\n1.74M subscribers\nComments\n88\nLouis Rossmann: RANDOM LIVE\nIan may have gotten a legendary grant, but the true legend will be whomever provides timestamps to this stream!\n88 Comments\nLouis Rossmann\nAdd a comment...\nsoli\nPinned by Louis Rossmann\nsoli\n1 day ago\nTimestamps/Questions:\n\n0:12 Introducing Ian Clarke and Freenet\n\n5:10 As the creator of an uncensorable, anonymous network, can you expound on your thoughts of internet censorship?\n\n8:57 Can you talk about the fact that you can't guarantee freedom of speech and enforce copyright law?\n\n12:35 Can you briefly describe what the original Freenet was and your inspiration for creating Freenet?\n\n15:13 What is Locutus doing differently than Freenet?\n\n16:50 What makes Locutus capable of that type of real-time communication in a way that Freenet doesn't, while remaining decentralized?\n\n20:29 How do you deal with the potential masses of spam?\n\n24:51 Can you talk about the reputation system in Locutus and how it functions?\n\n28:29 If you have a network that is uncensorable, decentralized, anonymous, and open-source, how do you prevent the detestable content from getting out? How do you protect yourself?\n\n30:33 The morals and ethics of having an uncensorable, decentralized, anonymous, and open-source network.\n\n34:05 If content is decentralized in nature, how does this affect longevity?\n\n36:58 What are the security risks, if any, to the user running Freenet?\n\n38:15 How easy would it be for someone to build an app that works on top of the software?\n\n41:04 Can you explain how Locutus is different from Ethereum smart contracts?\n\n42:34 If anonymity isn't a focus, what would be the use in China and Saudi Arabia, since governments can still find out who did what?\n\n43:24 What prevents a troll from hijacking the Freenet network?\n\n44:39 What are your thoughts on the GCHQ?\n\n45:27 How simple is it to use? \n\n46:43 Can Locutus run detached from the rest of the internet on a mesh network?\n\n49:48 Is this similar to the Invisible Internet Project?\n\n50:56 Why would governments not just ban it and jail the creator?\n\n53:34 How far along is this, if someone wanted to get this to beta testing?\n\n54:16 If other people would like to give a grant for you to continue moving forward with this development, where can we find it?\n\n55:11 Application process in the description for anyone else who is interested in this grant!", "link": "https://www.youtube.com/watch?v=eoV9amsnaQg", "date_published": "2022-09-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]