[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Mastodon, Peertube, Pixelfed: easily replace Twitter, Instagram and YouTube", "description": "Make sure your Python applications stay relevant for longer: https://bit.ly/3CyfKnL \nGrab a brand new laptop or desktop running Linux:https://www.tuxedocomputers.com/en#\n\n👏 SUPPORT THE CHANNEL:\nGet access to a weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYouTube: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nTwitter : http://twitter.com/thelinuxEXP\nInstagram: https://www.instagram.com/nick_thelinuxexp/\nMastodon: https://mastodon.social/web/@thelinuxEXP\nPixelfed: https://pixelfed.social/TLENick\nI'm also on ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\nAnd on PEERTUBE: https://tilvids.com/c/thelinuxexperiment_channel/videos\n\nThis video is distributed under the Creative Commons Share Alike license.\n\n#mastodon #fediverse #socialmedia \n\n00:00 Intro\n00:39 Sponsor: Extend the life of your Python applications\n01:30 The Fediverse: a network of social networks\n04:57 ActivityPub: all your social networks can talk to each other\n06:44 How Mastodon works\n08:33 How PeerTube works\n10:19 How PixelFed works\n11:39 Parting thoughts\n13:02 Sponsor: buy a device that runs Linux perfectly\n14:11 Support the channel\n\nJoin Mastodon: https://joinmastodon.org/servers\nJoin Peertube: https://joinpeertube.org/\nJoin PixelFed: https://pixelfed.org/servers\n\nPixelFed App for iOS: https://testflight.apple.com/join/5HpHJD5l\nPixelFed App for Android: https://f-droid.org/en/packages/org.pixeldroid.app/\n\nList of Fediverse services: https://fediverse.party/en/miscellaneous/\n\n\nFediverse is a contraction of Federated Universe. It's basically a very large network of servers that form, well, a social network. But contrary to the ones you might be used to, like Facebook, Twitter, Instagram, and others, the Fediverse is composed of different services.\n\nThe more well known are Mastodon, a Twitter-like microblogging service, PeerTube, a youtube-like platform, or PixelFed, an Instagram-like social network, but there are a TON of others.\n\nEach service is also decentralized, which means there is not one big server farm where everything is hosted: each service is split into instances, basically independent servers, with different goals.\n\nActivityPub is an open standard, that lets all services on the Fediverse talk to each other. How does that work? Well, in practice, it means you can use your Mastodon app to follow a Peertube channel, or someone that posts pictures on PixelFed, or see new articles from a Wordpress website.\n\nAnd this goes a bit further: for example, if I comment on Mastodon on a post from Peertube, that comment will also appear on Peertube underneath the video.\n\nLet's start with Mastodon. Mastodon is basically Twitter, but open source and decentralized. It lets you post messages with up to 500 characters, it supports images, videos, polls, content warnings, animated avatar pictures, emojis, links, mentions, hashtags, anything you're used to on Twitter. Mastodon has 1.5 million active users, which might seem small compared to Twitter, but it's more than enough to have interesting conversations with a lot of cool people.\n\nTo join Mastodon, all you need to do is pick a server, also called an instance. You can pick any server you like, and it will let you interact with everyone else on any other server.\n\nAnd then, you can use Mastodon on the web, by typing the address of your instance in your browser, for example, for me, it's mastodon.social, or you can use a mobile app.\n\nNow let's talk about PeerTube. It's a Youtube alternative, although it's much, much smaller. Peertube is also decentralized, being split into different servers, that are federated together, so you can follow people from different instances and still have a complete subscription feed. It also supports ActivityPub, which means you could subscribe to my peerTube channel from a mastodon account, and have a post in your timeline every time I publish a video.\n\nAnd as a creator, it also lets you sync your youtube channel to it, so you can auto-publish all your videos to Peertube in a few clicks, which is also a great help.\n\nTo watch peertube, just type the address of your instance in your browser's URL, for me it's tilvids.com.\n\nAnother cool service on the Fediverse is PixelFed. It's basically Instagram, without all the crap they tacked on lately, like reels, or lives. It's just pictures and videos. It's free software, it also uses the ActivityPub standard, so you can follow PixelFed users on Mastodon, for example, and it's ad-free.\n\nIt also lets you add filters, just like Instagram, or crop, resize, adding alt text, and you can use hashtags, locations, or create collections, basically photo albums.", "link": "https://www.youtube.com/watch?v=5npl2KCt2ok", "date_published": "2022-11-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]