[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "12 SIFU Combat Tips", "description": "Sifu is a demanding game that requires you to master the art of kung-fu on your quest for revenge and in this video, Persia goes over 12 useful tips to help you when you get your first taste of combat. \n\nFrom strategically unlocking abilities to learning combos, there are many different ways to fight your way through Sifu's brutal bosses. Making use of blocking, dodging, and parries can help you stay alive in the middle of a crowded fight and managing your environmental resources, weapons, and structure will be the key to dishing out damage.\n\nPersia also goes over combos, invulnerability frames, and more useful combat tips for the game that you might have overlooked. For more Sifu coverage, be sure to visit gamespot.com.\n\nTimestamps: \nIntro - 00:00\nInvulnerability Frames - 00:16\nLearn combos and use all of your tools - 01:02\nBlock, parry, and dodge - 01:53\nStructure System - 02:37\nBack away to regain Structure - 03:30\nDon’t underestimate your environment - 03:47\nTry to start each fight with a weapon - 04:11\nBuild with your age in mind - 04:50\nGrind levels to earn XP and permanent unlockable skills - 05:22\nShortcuts - 05:55\nFocus attacks - 06:13\nUse the cloud to manipulate saves - 06:15\nOutro - 07:22\n\n#SIFU", "link": "https://www.youtube.com/watch?v=MTkeek5OAUg", "date_published": "2022-02-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Warzone 2 Is Changing Everything! | GameSpot News", "description": "A sequel to Call of Duty: Warzone and 2019’s Modern Warfare, have been revealed. Here are all the newest details. \n\nIn this video, DeVante talks about a sequel to Call of Duty: Warzone and 2019’s Modern Warfare being revealed. According to Activision, the sequels to Modern Warfare and Warzone have been designed together from the ground up by Infinity Ward.\n\n#CallofDuty #Warzone2 #GameSpotNews", "link": "https://www.youtube.com/watch?v=kCrcx0YibXg", "date_published": "2022-02-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Horizon Forbidden West - Everything To Know", "description": "After a five-year wait, Horizon Forbidden West is just around the corner. As we prepare for its February 18th release, check out our video rounding up everything we know so far.\n\nTimestamps:\n00:22 - Plot & Setting\n01:43 - Gameplay\n04:34 - Platforms\n06:27 - DLC\n06:50 - Release Date & Price\n\nHorizon Forbidden West is the long-awaited sequel to one of PlayStation's biggest recent franchise starters, Horizon Zero Dawn. Set in a post-apocalyptic world where feral machines roam like beasts and dinosaurs, the seeds of a new civilization have emerged and begun to rebuild. But the nascent tribal societies are threatened by both the machines and each other. The heroine Aloy emerged as humanity's champion in Zero Dawn, and she's back to unlock new mysteries in Forbidden West as she journeys toward the wreckage of the American west coast. Horizon Forbidden West will serve as a showpiece for the PS5, though it's also appearing on PS4 as well. Here's everything we know about Horizon Forbidden West.", "link": "https://www.youtube.com/watch?v=XdB4_M_0u7Q", "date_published": "2022-02-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xbox Needs To Bring Back These Dead Activision Games", "description": "Microsoft is bound to acquire Activision and its 43 year legacy, and with it, some dormant franchises Xbox could potentially resurrect. \n\nIt's easy to see Activision for what it is now, with Call of Duty and everything Blizzard. But Activision's impact on this industry is deeply rooted in seminal franchises that helped shape the interactive medium.\n\nCEO of Microsoft Gaming Phil Spencer recently expressed interest in going through Activision's deep catalog of franchises in hopes to give some of them new life. Activision is the parent company of industry giants like Sierra Entertainment, pioneers in the adventure genre with games like King's Quest and Phantasmagoria. There's also Radical Entertainment, the developers behind Prototype and The Incredible Hulk: Ultimate Destruction. And before Raven Software was a support studio for Call of Duty, they created the iconic Hexen series and the cult-classic Singularity. All these franchises have been dormant for years, some decades. \n\nIn the above video, Kurt Indovina details Activision's long lineage of classic games that Xbox could potentially rise from the grave. \n\n#Microsoft #Activision", "link": "https://www.youtube.com/watch?v=-4UD4sctx1Y", "date_published": "2022-02-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "13 New Things We Learned About Elden Ring", "description": "GameSpot's very own Dave Klein, or DaveControl, had a chance to play past Elden Ring's Network Test, with a 7 hour hands-on experience. From traveling past Limgrave, through Stormveil, past Godrick, and into Liurna, here are some Elden Ring details you need to know. Elden Ring is FromSoftware's latest game utilizing their Soulsborne style and releases February 25th.\n\n#EldenRing #GameSpot", "link": "https://www.youtube.com/watch?v=EMGWif2Qtbs", "date_published": "2022-02-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "20 Dying Light 2 Easter Eggs You May Have Missed", "description": "Similar to the original Dying Light, Techland has packed Dying Light 2: Stay Human with a lot of secrets for fans to uncover. Here are 20 easter eggs you may have missed. \n\nIn this video, we’re going over a few of the easter eggs sprinkled around the city of Villefor. From video game references like Resident Evil to pop culture references like Harry Potter, we got a list of 20 of the game’s hidden secrets. \n\nDying Light 2: Stay Human is available for PC, PlayStation 5, PS4, Xbox Series X|S and Xbox One. The game will also be available for Nintendo Switch via cloud streaming, however it was delayed on January 19 and is now currently slated to arrive sometime within six months of February 4th.\n\nSTAMPS\n00:00 - Intro\n00:34 - Who Do U Voodoo\n00:53 - Kyle Crane #1\n01:11 - Kyle Crane #2\n01:37 - Cyberpunk 2077\n01:58 - Kyle Crane #3 & 4\n02:44 - Mario Sneakers\n03:00 - Dead Island Tree \n03:26 - DL1 Characters\n03:35 - Resident Evil \n04:13 - Last of Us \n04:27 - Doom Level\n04:52 - The Office\n05:05 - The Walking Dead\n05:18 - Hoverboard\n05:37 - Flying Broomstick\n06:05 - Master Sword\n06:20 - Pan of Destiny\n06:46 - Techland Developer Room\n06:54 - Left Finger of Glova\n07:08 - Infinite weapon repair", "link": "https://www.youtube.com/watch?v=EpHAN1oPwNA", "date_published": "2022-02-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "7 More Hours with Elden Ring", "description": "GameSpot's very own Dave Klein (DaveControl) had the chance to play the first 7 hours of Elden Ring and was able to explore beyond where the Closed Network Test ended. From Limgrave to Stormveil, Godrick, Liurna, and back. Dave talks to Lucy James and Tamoor Hussain about the legacy dungeons of Elden Ring, how the game compares to Dark Souls, Bloodborne, and Demon's Souls, and how it fares as FromSoftware's first open-world game. He also discusses the changes FromSoftware has made to the game since the Closed Network Test, including new enemy locations and how Spirit Ashes have changed. Dave got a chance to explore the game’s legacy dungeons, including Stormveil Castle, and he talks about his experience exploring Limgrave. \n\nHe also discusses the game’s multiplayer elements, and some of the bosses he encountered, including Godrick the Grafted and Margit the Fell Omen, and if the game feels as difficult as Dark Souls. Elden Ring launches on February 25 2022 for PlayStation 4, PlayStation 5, Xbox One, Xbox Series X/S, and PC. For more on the game, including new things Dave spotted in the game’s opening, and our Elden Ring review, make sure to subscribe to GameSpot. \n\n\n#EldenRing #GameSpot", "link": "https://www.youtube.com/watch?v=dXl6SUeSQTQ", "date_published": "2022-02-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Assassin's Creed Valhalla: Dawn Of Ragnarök Hands Off Preview", "description": "We got to see Assassin's Creed Valhalla: Dawn Of Ragnarök in a hands off preview and got a taste of what Ubisoft Sofia's huge expansion will entail. \n\nDawn Of Ragnarök is a 35-hour adventure that makes some massive changes and additions to the base game's formula, putting you in full control of a Norse god and their mythical abilities. Controlling Odin your journey into one of the most dangerous areas of Valhalla is meant as endgame content, though newer players can receive a temporary power and equipment boost if they want to play it earlier.\n\nAssassin's Creed Valhalla: Dawn of Ragnarök releases for PS4, PS5, Xbox One, Xbox Series X|C, and PC on March 10.\n\n#AssassinsCreed #DawnofRagnarok", "link": "https://www.youtube.com/watch?v=iF8Q8iRKcu4", "date_published": "2022-02-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Attack on Titan & Call of Duty Are At It Again | GameSpot News", "description": "Attack on Titan is coming to Vanguard & Warzone again in Season 2, Call of Duty could be coming to Nintendo Switch and Battlefield 2042 players demand refunds. \n\nIn this video, DeVante talks about how Call of Duty players will soon be able to play as an Armored Titan with Season 2 of Warzone and Vanguard. The details of this new Armored Titan bundle have not been revealed, but it should be released sometime during the season.\n\nDeVante also talks about Microsoft revealing it wants to bring more Activision Blizzard games to consoles like the Nintendo Switch. Following that, Battlefield players flock to a Change.org petition demanding that players be allowed to refund Battlefield 2042.\n\nSTAMPS\n00:00 - Intro\n00:07 - Call of Duty on Switch?\n01:20 - New Attack on Titan Skin\n02:07 - Battlefield 2042 Petition\n\n#GameSpotNews #AttackonTitan #COD #Battlefield", "link": "https://www.youtube.com/watch?v=tWR67emSUao", "date_published": "2022-02-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "No Mario Kart 9 Yet From Nintendo But Old Courses Inbound | GameSpot News", "description": "Nintendo makes major announcements at its February Direct, a new Assassin’s Creed may have leaked, and new PS5 features enter beta. \n\nIn this video, DeVante recaps some of the major announcements from February 2022’s Nintendo Direct. Highlights include: a Booster Course Pass for Mario Kart 8 Deluxe, Switch Sports, Xenoblade Chronicles 3 and more. \n\nLater in the video DeVante talks about reports that Assassin’s Creed is getting a smaller stealth focused game as well as new PS5 features entering the consoles beta program for select players.\n\nSTAMPS\n00:00 - Intro\n00:05 - Nintendo Direct\n01:39 - Assassins Creed\n02:49 - PS5 Features Beta", "link": "https://www.youtube.com/watch?v=2m8RLqtoWUc", "date_published": "2022-02-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Best Nintendo Direct February 2022 Trailers", "description": "We take a look at the best trailers from the latest Nintendo Direct.\n\nNintendo Direct February 2022 has wrapped up! In this video, we're taking a look at the best trailers from the event, including Xenoblade Chronicles 3, Nintendo Switch Sports, and Kirby and the Forgotten Land. Check out the video for a look at all of the most exciting reveals.\n\n00:00 - Xenoblade Chronicles 3\n02:02 - Fire Emblem Warriors: Three Hopes\n03:59 - Mario Strikers: Battle League\n06:47 - Nintendo Switch Sports\n09:33 - Mario Kart 8 Deluxe DLC\n11:00 - Kirby and the Forgotten Land\n14:01 - Splatoon 3 – Salmon Run Next Wave\n16:25 - FRONT MISSION 1st: Remake\n16:58 - Advance Wars 1+2: Re-Boot Camp\n18:12 - Chrono Cross: The Radical Dreamers Edition\n19:25 - KLONOA Phantasy Reverie Series\n19:57 - Portal: Companion Collection\n20:47 - EarthBound and EarthBound Beginnings", "link": "https://www.youtube.com/watch?v=bIdecgRPo-w", "date_published": "2022-02-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]