[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "The Bee Weekly: Thrash Metal Apologetics, Worship Leader Uniforms, and Star Trek Nerdery", "description": "This episode is brought to you by Private Internet Access. Get 83% off: https://privateinternetaccess.com/TheBabylonBee \n\n\nThe Babylon Bee analyzes some thrash metal apologetics, evaluates the current state of worship leader life with a real-life worship pastor, and talks to comedian Yannis Pappas! \n\nCheck out Yannis Pappas comedy tour dates and his podcast: https://podcasts.apple.com/us/podcast/longdays-with-yannis-pappas/id1547367594\nhttps://www.yannispappascomedy.com/\n\nThis episode is also brought to you by ADF Legal. Join the fight: https://adflegal.org/babylonbee\n\nKyle and Adam are joined by worship pastor and actor Jarret Lemaster to talk about this week at The Babylon Bee and also the thrash metal apologetics of Tourniquet. They also discuss what the expectations are of a modern worship pastor and the scene of Christian movie acting. The guys talk about what Whoopi Goldberg said on the View and some cases before the Supreme Court relating to the Banger and Bomb articles of the Week. Adam Yenser brings Weakly News and the guys all talk about their favorite thing this week in Stuff That’s Good. Kyle and Adam ask Jarret who he is and get into a discussion involving worship leader skinny jeans and acting in the Christian movie world.\n\nYannis Pappas then joins Kyle and Adam for a lengthy discussion. Viewers are also treated to the Joy of Painting With Hunter Biden sketch that Yannis did with The Bee. The Hate Mail this week is a bit of an epic saga that you don’t want to miss.\n\nIn the subscriber-exclusive lounge, subscribers get access to the full Yannis interview, get to hear Jarret’s answers to The Ten Questions, and also are treated with some spicy hate mail conspiracy theories about how The Babylon Bee is a CIA plant to propagandize its audience.", "link": "https://www.youtube.com/watch?v=G8ntsm3xsrE", "date_published": "2022-02-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "Smashing Leftist Late Night Shows | A Bee Interview with Greg Gutfeld", "description": "Greg Gutfeld, the new king of Late Night, joins Kyle and Adam to talk about how he is destroying all the other Late Night hosts, cancel culture, and why he continues to call Brian Stelter fat. Greg never planned on working in Late Night. He first started writing in the magazine world then working his way up into shows on Fox before landing on his current show, Gutfeld! Greg is bringing his live shows to new cities. Check out the links below for how to get FREE tickets.\n\nGet FREE tickets to see Greg in Dallas here: https://ggutfeld.com/events/\n\nCheck out where to watch Greg here: https://ggutfeld.com/\n\nBecome a premium subscriber:  https://babylonbee.com/plans\n\nThe Official The Babylon Bee Store:  https://shop.babylonbee.com/\n\nFollow The Babylon Bee:\nWebsite: https://babylonbee.com/\nTwitter: https://twitter.com/thebabylonbee\nFacebook: https://www.facebook.com/TheBabylonBee\nInstagram: http://instagram.com/thebabylonbee", "link": "https://www.youtube.com/watch?v=KitGqCUwe00", "date_published": "2022-02-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "Spotify Just BANNED These 11 Songs For Misinformation", "description": "Hot on the heels of their suppression of several episodes of the Joe Rogan Experience, Spotify has banned these 11 songs for containing harmful misinformation. Not good!\n\nBecome a premium subscriber:  https://babylonbee.com/plans\n\nThe Official The Babylon Bee Store:  https://shop.babylonbee.com/\n\nFollow The Babylon Bee:\nWebsite: https://babylonbee.com/\nTwitter: https://twitter.com/thebabylonbee\nFacebook: https://www.facebook.com/TheBabylonBee\nInstagram: http://instagram.com/thebabylonbee", "link": "https://www.youtube.com/watch?v=KlPqPE5KPsc", "date_published": "2022-02-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]