[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Does Gaming Addiction Really Exist? | MindGames", "description": "From Fortnite to Candy Crush, concerns have long been raised about the addictive potential of video games. But when the World Health Organization classified 'Gaming disorder' as an addictive behaviour in 2018, the psychology community found itself divided.\n\nSome believed the WHO's decision was based on poorly-constructed research, while others have reported success in treating the condition. So was the WHO right to make this decision, and does Gaming Addiction really exist?\n\n00:00 Intro\n01:08 WHO did what?\n03:38 Psychology Divisions\n06:04 Treatment\n09:14 What's next?\n\nLost in a Good Game by Pete Etchells: https://iconbooks.com/ib-title/lost-in-a-good-game/\n\nNational Centre for Gaming Disorders: https://www.cnwl.nhs.uk/national-centre-gaming-disorders\n\nUK Addiction Support: https://www.mind.org.uk/information-support/guides-to-support-and-services/addiction-and-dependency/addiction-and-dependency-resources/\n\nUS Addiction Support: https://www.samhsa.gov/\n\n#gamingaddiction #gamingdisorder #gaming #mentalhealth #mindgames #fortnite", "link": "https://www.youtube.com/watch?v=S8qVwomybEI", "date_published": "2022-09-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite Chapter 3 Season 4 Official Battle Pass Trailer", "description": "Get a look at the battle pass trailer for Fortnite Chapter 3 Season 4 including some gameplay, skins and much more. \n\nWelcome to Paradise. A new season filled with Chrome, Chrome, and even more Chrome. This anomalous substance is spreading fast across the Island. Jump in to check out the newest weapons, items, POI’s, and ways to play! \n\nSome Island locations are seeking “safety” in the air — most notably Condo Canyon. Now called Cloudy Condos, attack from above in this expanding POI. Chrome’s not only taking over points of interest, it’s built a brand new one. Ascend Herald’s Sanctum (near the abandoned Sanctuary) and stand atop this tower of Chrome.\n\nDefy the laws of physics by walking through Chrome walls! Throw a Chrome Splash at the walls to make the walls penetrable — jump right through the building and get the drop on your opponent! \n\nPlay Fortnite Battle Royale, the completely free 100-player PvP mode. One giant map, A Battle Bus, Last one standing wins. ESRB Rating: Teen with Violence.\n\n#fortnite #gaming", "link": "https://www.youtube.com/watch?v=R0BhYKu1Vxs", "date_published": "2022-09-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite Chapter 3 Season 4 Official Cinematic Trailer", "description": "Check out the Fortnite chapter 3 season 4 cinematic trailer that showcases the rise of the Chrome.\n\nIn Fortnite Chapter 3 Season 4: Paradise, a mysterious substance has appeared on the Island. Chrome will consume all, Chrome will be all. Embrace the Chrome by turning structures Chrome, making yourself Chrome, and proving the power of Chrome weapons. \n\nAssemble an eclectic crew in your enjoyment of paradise. With this Season’s Battle Pass purchase, you’ll immediately unlock Paradigm (Reality-659). Progress through the Battle Pass to unlock Spider-Gwen.\n\nPlay Fortnite Battle Royale, the completely free 100-player PvP mode. One giant map, A Battle Bus, Last one standing wins. ESRB Rating: Teen with Violence.\n\n#Fortnite #gaming", "link": "https://www.youtube.com/watch?v=8DfIFYZJEbQ", "date_published": "2022-09-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Rainbow Six Siege’s Guns PART 3", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down more of the weaponry of Rainbow Six: Siege, including the AK-74M, the P90 and .44 Mag Semi-Auto.\n\n00:00 - Opening\n00:44 - AK-74M\n02:58 - .44 Mag Semi-Auto\n04:38 - CSRX 300\n06:34 - GSH-18\n07:49 - P90\n09:24 - 6P41\n10:57 - M249 SAW\n13:54 - SMG-12\n15:21 - SPAS-12\n17:22 - TCSG12\n18:37 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down more of the guns of Rainbow Six: Siege and compares them to their real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=HiwKFYBGM7A", "date_published": "2022-09-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village Shadows of Rose DLC Borrows From RE2 Remake", "description": "ReTamoor and Jean-Luc got hands on with the upcoming Shadows of Rose DLC for Resident Evil Village, which remixes familiar locations and brings in the 3rd person perspective of RE2 Remake.\n\nResident Evil Village Shadows of Rose is the upcoming story DLC as a part of the Winter Expansions for Resident Evil Village: Gold Edition. Taking place after the main campaign, the DLC will act as an epilogue of sorts as players take control of Rose Winters, who seeks to be rid of her powers.\n\nUnlike the main game, Shadow of Rose is exclusively in the 3rd person perspective, putting it more in line with the remakes of Resident Evil 2 and 3. The section of the game we got to play takes place in Castle Dimitrescu. The castle is now covered in a goopy red substance and filled a new type of enemy called the face eaters. Rose can use her unique powers to remove the red goop as well as attack the face easters,\n\nResident Evil Village Shadows of Rose launches on October 28th for all platforms.\n\n#residentevilvillage #shadowsofrose #gaming", "link": "https://www.youtube.com/watch?v=dxzBs_MT9bA", "date_published": "2022-09-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]