[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Cordae: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBobby Carter | January 14, 2022\nMidway through his Tiny Desk (home) concert, Cordae shares the backstory behind \"RNP\" from his 2019 debut album, The Lost Boy, and the early stresses he endured as a successful young rapper. It takes a comedic twist, but his father's insight sets him straight. The music industry hasn't tainted him, and he's choosing to have fun with it. There's an undeniably pure quality to his Tiny Desk. The entire performance exudes confidence, and his excitement is palpable.\n\nHe's put a lot of pressure on himself as the self-proclaimed \"best rapper under 25,\" but the DMV-bred emcee has a solid argument. With a critically praised debut under his belt and co-signs from peers and legends alike, he's checking all the boxes. From a rustic, elegant setting in Los Angeles, he plays a combo of Lost Boy favorites and cuts from his new album, From a Birds Eye View. The new music sheds more light on what Cordae is made of.\n\nThe emotional \"Momma's Hood\" and introspective \"C Carter\" round out the set with songs like the barred-up \"Sinister.\" The mood flows perfectly for 20 minutes, and in between cracking a couple of lighthearted funnies about Tiny Desk, he stakes his claim and checks another box as a charismatic live performer.\n\nSET LIST\n\"C Carter\"\n\"Want From Me\"\n\"RNP\"\n\"Thousands Word/Thanksgiving Medley\"\n\"Sinister\"\n\"Momma's Hood\"\n\"Chronicles\"\n\nMUSICIANS\nCordae: vocals\nClarence \"Klueworld\" Lewis IV: drums, music director\nEric Fells: keys\nLeonardo \"LEO\" Varella: guitar\nMike Phillips: bass\nJacob Scesny: saxophone\nDerrick Evans: vocals\nEric Lyn: vocals\nPhylicia Hill: vocals\nAja Grant: vocals\n\nCREDITS\nVideo: Chadrick Fellers, Jeremy Ivory-Chambers, Will Noyce\nAudio: Freddie Johns III\nProduction Manager: Tone Lopez\nStage Manager/Backline Tech: Chris Franco\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Joshua Bryant\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Maia Stern, Kara Frame, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #cordae", "link": "https://www.youtube.com/watch?v=u5puSWxPNyA", "date_published": "2022-01-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]