[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "GTA 6 In 2023? | GameSpot News", "description": "In today’s episode of GameSpot News, Persia talks about the possibility of GTA 6 in 2023, the Hitman Trilogy coming to Game Pass, and more.\n\nVideo Notes: According to one analyst's prediction, the next entry in Rockstar's popular series might be in the works for 2023 or 2024. Other reports have suggested GTA 6 might not release until 2025.\n\nThe Hitman Trilogy, which includes three games in the World of Assassination series, will come to Xbox Game Pass on January 20, IO Interactive announced today as part of the company's Year 2 reveal. There are also a number of updates coming to Hitman 3 in its second year including technical improvements, VR for PC, and a new mode.\n\nLastly, Persia talks about Microsoft discontinuing production on the Xbox One S and Xbox One X just before the launch of the Xbox Series X|S consoles, allowing for retailers to finish selling any remaining stock of the last-gen devices.\n\nFor more information on all of our topics, please visit gamespot.com\n\nTimestamps:\nIntro - 00:00\nGTA 6 - 00:06\nHitman Trilogy - 01:24\nXbox One - 02:33\nOutro - 03:53", "link": "https://www.youtube.com/watch?v=roXsCiqT8YY", "date_published": "2022-01-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Rocket League Sideswipe Review", "description": "The miniaturized version of Rocket League maintains the chaos, fun, and intensity of car-based sports, while perfecting a bite-sized approach.\n\nPsyonix's Rocket League Sideswipe is now available on iOS and Android. You can read the full written Rocket League Sideswipe review by Phil Hornshaw on GameSpot: https://www.gamespot.com/reviews/rocket-league-sideswipe-review-pocket-rocket/1900-6417809/", "link": "https://www.youtube.com/watch?v=Jnk-WWW3pCA", "date_published": "2022-01-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Attack On Titan & Call Of Duty Crossover?! | GameSpot News", "description": "In this episode of GameSpot News, Persia talks about how Attack On Titan will crossover with Call Of Duty, a massive S.T.A.L.K.E.R. 2 delay, and more.\n\nAs part of the midseason update for Call Of Duty: Vanguard and Warzone, players will be able to purchase cosmetic bundles to become a Survey Corps member through the Tracer Pack: Attack on Titan Levi edition bundle starting on January 20. This will be a 10-item store bundle, which includes the \"Titan Piercer'' weapon blueprint, a new finishing move, a Levi skin exclusive for the operator Daniel, and more.\n\nPersia also goes over the delay of Stalker 2 and Hitman 3 revealing a livestream for its 2nd year of post-launch content on January 13. \n\nFor more information on all of our topics, please visit gamespot.com \n\nTimestamps:\nIntro - 00:00\nAttack On Titan/Call Of Duty - 00:07\nS.T.A.L.K.E.R. 2 - 02:09\nHitman 3 - 03:00\nOutro - 03:46", "link": "https://www.youtube.com/watch?v=ALjjSnRL1B0", "date_published": "2022-01-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Legends: Arceus – Gameplay Preview Breakdown", "description": "Watch this new extended gameplay footage of Pokémon Legends: Arceus for a sneak peek at what awaits you in the Hisui region.\n\nCheck out this new gameplay preview ahead of the release of #PokemonLegendsArceus on Friday, 28 January!", "link": "https://www.youtube.com/watch?v=MG-9it-_6ik", "date_published": "2022-01-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Anacrusis Early Access Livestream", "description": "We check out The Anacrusis, a new four-player shooter from former Left 4 Dead developers, now out in Early Access and on Xbox Game Pass.", "link": "https://www.youtube.com/watch?v=sHE_3Y0M8kI", "date_published": "2022-01-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Final New Reveals For Dying Light 2 | Dying 2 Know Episode 6", "description": "The final episode of Dying 2 Know reveals all the information you need right before the release of Dying Light 2.", "link": "https://www.youtube.com/watch?v=v6LIgfKGHl8", "date_published": "2022-01-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Real History Behind The Witcher’s Silver Sword - Loadout", "description": "If you’ve played, read or watched The Witcher, you’ll know that Geralt of Rivia carries 2 swords. A steel sword for non-magic folk, and a silver sword for supernatural creatures and things that go bump in the night. But why a silver sword? What is it about silver that has given it this mysterious supernatural power? And does that myth have any basis in fact?\n\nIn this episode of Loadout, Dave Jewitt visits the Royal Armouries Museum in the UK to talk to Keeper of Firearms & Artillery Jonathan Ferguson, and Historical Interpreter Keith Ducklin about the myths and the realities behind the silver sword.\n\nYou can check out more episodes of Loadout right here. - https://www.youtube.com/watch?v=yzSrmGkpWKk&list=PLpg6WLs8kxGMzIemU1gyyLmg5VlKI2UvC\n\nYou can check out our Firearms Expert Reacts series here. - https://www.youtube.com/watch?v=5FVzcoRjoN4&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/", "link": "https://www.youtube.com/watch?v=2bGdlwI8toA", "date_published": "2022-01-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]