[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Omicron has peaked in UK", "description": "Cases are now still high but on the way down. I expect the US to follow this trend in about 2 to 3 weeks.\n\nLink to free download of my 2 textbooks\n\nhttp://159.69.48.3/\n\nChina\n\nZero covid policy\n\nQuebec stops PCR tests for general public\n\nOmicron, up to 60,000 tests per day\n\nhttps://www.cbc.ca/news/canada/montreal/pcr-tests-stopped-omicron-quebec-1.6304313\n\n(Ontario already limiting)\n\nPCR tests reserved,\n\nhigh risk settings, hospitals, long-term care homes, prisons, homeless shelters, remote communities\n\nDr. Marie-France Raynault, Quebec public health\n\nWe are absolutely overwhelmed by the Omicron wave\n\nAdvice\n\nUse rapid tests (if available)\n\nIsolate if symptomatic\n\nAfter 2 vaccine doses, isolate for 5 days\n\nSickness \n\nHCWs, 11,712 on Monday\n\nMontreal police, 550 to 650, New Year's Day \n\nBritish Colombia\n\nZuher\n\nBritish Columbia, reserved for First Responders, critical care\n\nPublic, just isolate, no LFTs either\n\nLeroy\n\nhttp://www.bccdc.ca/health-info/diseases-conditions/covid-19/testing/when-to-get-a-covid-19-test\n\nBritish Columbia we are asked NOT to get tested if we have symptoms and we have been vaccinated.\n\nIsolate and return to normal work if asymptomatic after 5 days\n\n\nUS\n\nDaily case reports have been falling, Cleveland, Newark, Washington, D.C. \n\nPeaked, Chicago, NY, Puerto Rico, areas of Colorado \n\nZoe\n\nhttps://www.youtube.com/watch?v=GKCiuWL0qnw\n\nSymptomatic cases down 12% on the week\n\nOmicron is more infectious than common colds and influenza\n\nPrevalence in UK\n\nUK, 1 in 24\nLondon, 1 in 18\nNE, 1 in 17\n\nOmicron Symptoms\n\nOmicron incubation 2 days\n\nSymptomatic disease with omicron is shorter\n\nMost people could leave isolation at 5 days\n\nLong covid, probably less than with delta\n\nCurrent symptoms\n\nRunny nose, 73%\n\nHeadache, 68%\n\nFatigue, 64%\n\nSneezing, 60%\n\nSore throat, 60%\n\nPersistent cough, 44%\n\nHoarse voice, 36%\n\nChills or shivers, 30%\n\nFever, 29%\n\nDizzy, 28%\n\nBrain fog, 24%\n\nAltered smell, 23%\n\nSore eyes, 23%\n\nUnusual muscle pains, 23%\n\nSkipped meals, 21%\n\nLoss of smell, 19%\n\nChest pain, 19%\n\nSwollen glands, 19%\n\nFeeling down, 16%\n\nProfessor Tim Spector\n\nhttps://covid.joinzoe.com/post/omicron-waves-had-finally-peaked\n\nThe ZOE data suggests the Omicron wave has peaked, and cases are starting to come down in almost all regions of the UK.\n\nHospitalisation, deaths and early data on the severity of Omicron is also looking positive. \n\nThe other reassuring sign is that cases in the elderly are plateauing at a low level, sparing this more vulnerable group from the worst of the Omicron wave. \n\nThis is likely because this group has been more careful and others are being careful around them. \n\nHowever, we can’t rule out an uptick in children, which could then have a knock on effect on the other age groups. \n\nIn terms of guidance, working from home remains an easy thing many of us can do to slow spread, and wearing high quality masks on public transport to me still feels sensible. \n\nCovid symptoms are now for the first time this winter more common than colds and flu and are indistinguishable. \n\nI don’t expect these rates to go down to zero as Omicron is so infectious that it will probably continue to circulate at manageable levels in the population until late spring\n\nLatest ONS data\n\nhttps://www.ons.gov.uk/peoplepopulationandcommunity/healthandsocialcare/conditionsanddiseases/articles/coronaviruscovid19/latestinsights\n\nElias Balderas \n\nGot Alpha in April. Was Ill for 2 weeks. \n\nJust got omicron last week. Was very mild for me this time around. First 24 hours felt like a cold. \n\nHad the chills over night with slight cough. 72 hours later all is pretty much normal now. \n\nNot vaccinated BTW. I believe prior infection probably made it more mild for me this time.", "link": "https://www.youtube.com/watch?v=LRycK82LsTE", "date_published": "2022-01-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "US hospital concerns", "description": "US hospitals are under great pressure, there are essentially three reasons for this.\n\nOntario, Canada, largest province in Canada, population of 15 million.\n \nSeveral weeks ago we were told to STOP going for testing unless we were in a high risk category, \n\nso the number of cases is dramatically under-reported, \n \nhttps://toronto.ctvnews.ca/this-is-who-can-and-can-t-get-a-covid-19-test-in-ontario-1.5723794\n \nSo when you see cases dropping in Canada and the R value decreasing, its completely inaccurate, Ontario represents almost half of the popular of the entire country.\n \nSteve\n\nUS hospital pressure\n\nhttps://www.theatlantic.com/health/archive/2022/01/for-covid-with-covid-hospitals-are-mess-either-way/621229/\n\nWith or for covid\n\nJeremy Faust, emergency physician Brigham and Women’s Hospital, Massachusetts\n\nThe truth is, we’re still in the emergency phase of the pandemic,\n\nand everyone who is downplaying that should probably take a tour of a hospital before they do\n\nSara Murray, hospitalist at UC San Francisco\n\nIf a virus that causes less severe lung disease affects an extraordinarily large proportion of the population,\n you’ll still get a lot of them in the hospital with severe lung disease\n\nFactors\n\nLow vaccination uptake\n\nComorbidities\n\nResidual circulation of delta\n\nPost delta infection\n\nOmicron areas, lower hospital admissions\n\nDr. Walensky\n\nI suspect the deaths we are seeing now are still from Delta\n\nJames Lawler, infectious-disease physician, University of Nebraska Medical Center\n\nthe vast majority of our COVID-positive cases are at the hospital for reasons related to their COVID infection\n\nTwo neat categories, with and for\n\nVineet Arora, a hospitalist at the University of Chicago Medicine\n\nIf you’re on the margin of coming into the hospital, COVID tips you over\n\nCOVID might not be listed as a reason for admission, but no COVID, no admission\n\nThese incidental infections are not so incidental for people with chronic conditions\n\nWe have a lot of chronically ill people in the U.S., and it’s like all of those people are now coming into the hospital at the same time\n\nSo, its 3 categories\n\nFor covid\n\nWith covid that exacerbated a chronic condition\n\nTruly incidentals\n\nCraig Spencer, emergency physician, Columbia University Medical Center\n\nThe health-care system is in crisis and on the verge of collapse\n\nIt doesn’t matter whether it’s with or for. It’s a pure deluge of numbers\n\nMr Donald J. Trump\n\nBoosters, politicians who refused to say whether they had received one were “gutless”\n\nThe fact is that I think the vaccines saved tens of millions throughout the world\n\nhttps://www.nytimes.com/live/2022/01/12/world/omicron-covid-testing-vaccines?type=styln-live-updates&label=coronavirus%20updates&index=0#the-white-house-says-it-is-considering-offering-high-quality-masks-to-americans\n\nDysphunc \n \nI've had Covid-19 for 3 days now - 2nd vaccination dose 1 month ago. \n\nIt just feels like a bad case of Pharyngitis. \n\nCongested sinus, gunky sore throat and bronchial tract inflamed. \n\nOccasional painful aspiration but nothing like when I had double Pneumonia. \n\nOximeter reporting 95-98% the whole time so far which is reassuring.", "link": "https://www.youtube.com/watch?v=a1R09yIKqq4", "date_published": "2022-01-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]