[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "AMD 2022 Product Premiere CES 2022 Livestream", "description": "Watch CEO Dr. Lisa Su present the AMD 2022 Product Premiere on January 4th, 2022, highlighting upcoming computing and graphics solutions from AMD and its partners, and showcase how AMD will drive best-in-class high-performance computing experiences for gaming and entertainment during CES 2022.\n\n#AMD #CES", "link": "https://www.youtube.com/watch?v=znQ4TIhAbKY", "date_published": "2022-01-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends | Stories from the Outlands: Gridiron - Bangalore's Backstory", "description": "Torn between her brother and the only cause she’s ever known, Bangalore has difficult decisions to make and hard consequences to face after the Battle of Gridiron.  \n\nApex Legends is a free-to-play hero shooter game where legendary characters battle for glory, fame, and fortune on the fringes of the Frontier. Play for free now on PlayStation® 4, PlayStation 5, Xbox One, Xbox Series X|S, Nintendo Switch, and PC via Origin and Steam.", "link": "https://www.youtube.com/watch?v=Mb2tJ6Audjw", "date_published": "2022-01-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Intel at CES 2022 Livestream", "description": "Join Intel senior leaders as they share new developments in two of Intel’s most important businesses: personal computing and automated driving/Mobileye. Gregory Bryant, executive vice president and general manager of Intel’s Client Computing Group, and Prof. Amnon Shashua, Mobileye CEO, will share the stage with several guest executives whose companies, working with Intel, are leading digital transformation and computing growth across two of today’s fastest-growing sectors.", "link": "https://www.youtube.com/watch?v=byXyx8ZYSv4", "date_published": "2022-01-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "N64 Classic Coming To Xbox According To Leak | GameSpot News", "description": "In this episode of GameSpot News, we talk about GoldenEye 007 Achievements for Xbox leaking, trouble at Ken Levine’s Ghost Story Games studio and the January additions to PS Now. \n\nIn this video, DeVante talks about achievement pictures and a GoldenEye 007 thumbnail appearing online, adding to the speculation that the 1997 Nintendo 64 game might be headed to Xbox in the future. 2022 marks the 60th anniversary of the James Bond series and a re-release of GoldenEye 007 could be among the surprise announcements, it seems, though nothing is confirmed at this stage.\n\nDeVante also talks about new details that have emerged regarding BioShock creator Ken Levine's new game that he is making for Take-Two, and the project seems to be facing some issues. Six more games being added to PlayStation Now for January as well as the Tomb Raider reboot trilogy being offered for free on the Epic Games Store.  \n\nTIME STAMPS:\nIntro - 00:00\nGoldenEye - 00:08\nGhost Story Games - 01:17\nPlayStation Now - 02:10\nOutro - 02:40", "link": "https://www.youtube.com/watch?v=BpHvUxTLGzg", "date_published": "2022-01-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "NVIDIA Special Address CES 2022 Livestream", "description": "Tune in Jan 4th at 8am PT for a virtual event of Nvidia's latest technology in accelerated computing, focusing on design and simulation, gaming, and autonomous vehicles.", "link": "https://www.youtube.com/watch?v=xEkTf40kcSI", "date_published": "2022-01-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Nvidia 3050 & 3090 Ti Revealed, But Good Luck Buying One | GameSpot News", "description": "In this episode of GameSpot, new Nvidia GPUs are announced, Halo Infinite is helping Splitgate and Game Pass adds 8 new games for January. \n\nIn this video, DeVante talks about Nvidia announcing it’s newest GPUs, the RTX 3090 Ti and the RTX 3050. Nvidia didn't share any of the key details for the RTX 3090 Ti like its price or release date, the RTX 3050 launches later this month for just $250. \n\nDeVante also talks about Halo Infinite seemingly giving Splitgate a boost on PlayStation. Game Pass adds Mass Effect: Legendary Edition and 7 other games for the month of January. And January’s PlayStation Plus games are now available.  \n\nTIME STAMPS\n00:00 - Intro\n00:07 - Nvidia GPUs\n01:58 - Halo Helps Splitgate\n02:56 - January Game Pass", "link": "https://www.youtube.com/watch?v=yu2dY7OzuL4", "date_published": "2022-01-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Biggest Games of 2022", "description": "2022 is shaping up to be an unbelievably exciting year in video games. Fromsoftware, creator of Dark Souls and Sekiro's hotly anticipated Elden Ring is on its way, Nintendo's sequel to The Legend of Zelda: Breath of the Wild, Bethesda, creator of Skyrim and Fallout finally releasing a new IP in Starfield, and Ghostwire: Tokyo finally seeing a release in 2022 are just a few of the year's hot titles. So, sit back, relax, and check out GameSpot's most anticipated games of 2022.\n\nTimestamps:\n0:10 - Horizon Forbidden West\n0:54 - Starfield\n1:31 - Rainbow Six Extraction\n2:06 - Suicide Squad: Kill the Justice League\n2:46 - Tiny Tina's Wonderlands\n3:19 - Bayonetta 3\n3:46 - Stranger of Paradise: Final Fantasy Origin\n4:29 - Redfall\n5:05 - Dying Light 2\n6:04 - Elden Ring\n7:06 - The Legend of Zelda: Breath of the Wild 2\n7:55 - Forspoken\n8:31 - Ghostwire: Tokyo\n9:09 - God of War: Ragnarök\n9:45 - Advance Wars 1+2: Re-Boot Camp\n10:16 - Gotham Knights\n10:47 - Lego Star Wars: The Skywalker Saga\n11:27 - Marvel's Midnight Suns\n11:56 - Pokémon Legends: Arceus\n12:51 - Splatoon 3", "link": "https://www.youtube.com/watch?v=r9SC6dRbofQ", "date_published": "2022-01-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]