[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "ARC Ensemble: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nTom Huizenga | May 11, 2022\nThe conflicts between Russia and Ukraine reach far and wide, even deep into this Tiny Desk (home) concert performed by the ARC Ensemble — artists from Canada's Royal Conservatory in Toronto. They offer music by the neglected composer Dmitri Klebanov, a Ukrainian Jew whose career was sidelined by the Stalin regime when his First Symphony was denounced in 1949.\n\nKlebanov wrote his Fourth String Quartet — from which the ensemble plays excerpts — three years earlier. He dedicated it to his compatriot, the composer Mykola Leontovych who, as a Ukrainian separatist, was murdered by the Soviet secret police in 1921.\n\nThe opening movement will sound familiar. Klebanov riffs on a Leontovych melody best known in the West as the Christmas chestnut \"Carol of the Bells.\" The sparkling second movement, played largely in pizzicato, again draws from a Leontovych tune, this time inspired by the Hungarian bagpipe. Listen for the wheezy drone in the viola.\n\nTo introduce the final, folk music-inspired section, cellist Tom Wiebe recalls stories from his Ukrainian grandfather. As a musician, he formed an ensemble of string players who stuck together through the Russian Revolution and the following civil war. They even played, reluctantly, for Soviet Red Army soldiers who occupied their village. Wiebe's parents left Ukraine in the 1920s and settled in Canada.\n\nThe ARC Ensemble dedicates this performance to the people of Ukraine.\n\nSET LIST\nDmitri Klebanov: String Quartet No. 4\n\nI. Allegro Moderato\nIII. Scherzando\nIV. Allegro\n\nMUSICIANS\nARC Ensemble: Artists of the Royal Conservatory, Canada\n\nErika Raum: violin\nMarie Bérard: violin\nSteven Dann: viola\nTom Wiebe: cello\n\nCREDITS\nVideo: Suave Hupa, Tom Bellisario\nAudio: Tom Bellisario\nEditor: Peter Turek\nDirector: James Murdoch\nARC Artistic Director: Simon Wynberg\n\nTINY DESK TEAM\nProducer: Tom Huizenga\nVideo Producer: Joshua Bryant\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Michael Zamora, Maia Stern, Ashley Pointer\nVP, NPR Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=qXibG3pG4zM", "date_published": "2022-05-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]