[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "\"Use case distros\" mean Linux desktop needs more work!", "description": "Get 100$ credit for your own Linux and gaming server: https://www.linode.com/linuxexperiment \n\nGrad a brand new laptop or desktop running Linux out of the box: https://www.tuxedocomputers.com/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMastodon: https://mastodon.social/web/@thelinuxEXP\n\nPixelfed: https://pixelfed.social/TLENick\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:51 Sponsor: Get 100$ off your Linux and Gaming server with Linode\n01:44 What is a use case distro?\n03:23 They should still exist\n04:57 User confusion\n07:49 If they exist, it's still too hard\n10:54 What can we do?\n14:03 Sponsor: Grab a Linux laptop or desktop from Tuxedo\n14:51 Support the channel\n\nSo a use case distro is basically a more mainstream distribution, with added tools and packages to make it more suitable for a specific purpose. They generally also include a different theme, wallpaper, but the internals are usually just the exact same as the distro they use as a base, and they differentiate themselves by trying to a make a specific niche easier to get into when moving to Linux.\n\nExamples of these would be Nobara, Ubuntu Studio, SteamOS, DraugerOS...\n\nLinux has always offered a ton of choice. This means we already have tons of general purpose distros, like ubuntu, Mint, Fedora, elementary OS, Manjaro, and all their desktop variants. Choosing between these is pretty tough.\n\nThat choice gets even more confusing when you add distros with specific purposes. See these distros try to cater to ONE use case specifically, like gaming, or audio work. But rarely do new users focus on ONE single use case. people tend to use computers for a variety of stuff.\n\nThe second major issue is that the very existence of these distros means that our mainline distributions still are perceived as too complex to use for specific use cases.\n\nThe point is: not everything is EASY. It might seem like it is, because we knew the previous ways which were even harder, but to a newcomer, that's a bunch of mumbojumbo.\n\nAnd that's why we have \"gaming distros\"': they come with everything preinstalled and preconfigured: you don't need to look for anything, you just login and get started.\n\nJust like with \"Studio distros\", where you don't need to hunt for which apps you need to get creative, they're already all there, plus all the tools you need.\n\n\nSo, what needs to be done? All basic drivers SHOULD be preinstalled when they're needed. Yes, that goes foir nvidia drivers too. It also means that we need MORE applications in the stores.\n\nAnd developers NEED to work to ensure that their apps, whether they're distributed in repos, in flathub, or the snap store, have all the correct permissions set.\n\nTo solve the \"I need to download 20 apps each time I reinstall\" issue, we can also offer app bundles. \n\nAnd finally, we could also work on helpers for people. For example, if you plug in a mouse that has configurable buttons, we could prompt the user to install the correct utility. Plug in a logitech dongle? Prompt to install Solaar. \n\nBasically, it all resides in the ease of use: if a user feels guided, and if the system does things automatically when there's a 99% chance that the user would have to do them anyways, then we've won. We're even more user friendly than windows or mac os. But until then, use case distros still have a use case, and I think they shouldn't be needed for the vast majority of people. Our mainline distros SHOULD absolutely stand on their own for EVERY use case, and people who really want something specific can still get it", "link": "https://www.youtube.com/watch?v=GuCLBzzmsoU", "date_published": "2022-05-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]