[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fighting King Kong And Godzilla In Warzone - Gameplay", "description": "Godzilla and King Kong are now in Call of Duty: Warzone and we're getting up close and personal. In Operation Monarch players collect intel to unlock the S.C.R.E.A.M device which lets them direct Titan attacks on other players. This is still a battle-royale mode and players win by being the last team standing which means managing your position on the Warzone Pacific map, fighting other players, and attacking Titans when they Frenzy.", "link": "https://www.youtube.com/watch?v=PYDWCnopUfM", "date_published": "2022-05-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "King Kong Vs. Godzilla! Call of Duty Warzone Livestream", "description": "Call of Duty's Operation Monarch is here! Join David as he hops into Season 3's climactic battle of titans in Warzone's latest live event.", "link": "https://www.youtube.com/watch?v=0WP18GBBDAs", "date_published": "2022-05-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Nintendo’s Next Console: Company Reveals Its Biggest Concern | GameSpot News", "description": "Nintendo’s opens up about major concern with next console transition, Mario + Rabbids: Sparks of Hope gets a new release window, and BioWare reacts to Mass Effect 5 rumors. \n#GamingNews #Nintendo #MassEffect\n\nDuring a Japanese investor Q&A this week, Nintendo president Shuntaro Furukawa spoke about how the company plans to transition away from the Switch console in the future. In order to ensure it doesn’t lose its massive user base, Furukawa explained that Nintendo’s strategy is to provide services that also use Nintendo Accounts and other IP outside of gaming software.\n\nMario + Rabbits: Sparks of Hope, which was initially announced for 2022, has a new release window.  As part of Ubisoft's latest earnings briefing, the company confirmed that it has more games in development right now than ever before in its history, and this includes a handful of big-name games coming out in the next year April 1, 2022-March 31, 2023.\n\nBioWare has responded to internet speculation that Commander Shepard will return in the next Mass Effect game, and it sounds like that is not going to be the case.\n\nSTAMPS\n00:00 - Intro\n00:06 - Nintendo Switch\n00:55 - Mario + Rabbids\n01:48 - Slipknot x Smite\n02:09 - Mass Effect 5", "link": "https://www.youtube.com/watch?v=nDnl4ygsmTk", "date_published": "2022-05-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "F1 22 Hands-On Preview", "description": "The fervor surrounding Formula 1--the world's premiere racing category--has rarely been stronger. In F1 2022, the latest entry in the franchise developed by Codemasters, a delicate balance of catering to this new audience while also offering enhancements to returning simulation racing fans is evident.\n\n#F122 #Formula1 #Gaming", "link": "https://www.youtube.com/watch?v=CRktd_p-JAY", "date_published": "2022-05-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Gotham Knights Nightwing and Red Hood 4K Official Gameplay", "description": "Watch over 13 minutes of brand-new Gotham Knights gameplay. Featured in this video specifically is Red Hood and Nightwing gameplay. You get a glimpse of Nightwing's glider, as well as his various move sets. Additionally, you get to see Red Hood's move set, his mystical leap ability and motorcycle chase down gameplay.\n\nWe even get a glimpse of a cutscene between Red Hood and Nightwing, as well as a look at various gameplay mechanics in the Belfry. You get to see the map for the world, how the story missions work, and a glimpse of the work bench where we can upgrade our gear. You'll collect blueprints and crafting materials by taking on missions. Each blueprint has different stats, that will allow the players to customize their gear in a way that favors their playstyle. There are even mods to dive into.\n\nGotham Knights releases on October 25, 2022 on PlayStation 5, Xbox Series X and S, and PC.\n\n#GothamKnights #Nightwing #RedHood #gameplay #4K\n\nTimestamps:\n0:00 Intro\n0:27 Gameplay Start\n0:59 Nightwing Gameplay \n1:40 Red Hood Leaping Gameplay\n3:10 Red Hood Motorcycle Gameplay\n3:41 Red Hood Combat Gameplay\n4:34 Belfry Gameplay\n5:10 Work Bench and Gear Gameplay\n5:50 Nightwing and Red Hood Cutscene\n6:49 Nightwing Glider Gameplay\n8:30 Nightwing Stealth and Combat Gameplay\n10:45 Red Hood Combat and Mini Boss Fight Gameplay", "link": "https://www.youtube.com/watch?v=-jj6_6i6Eyw", "date_published": "2022-05-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Monster Hunter Rise: Sunbreak Showcase (May 2022)", "description": "Discover all-new gameplay info, monster reveals and more, in the Monster Hunter Rise: Sunbreak Digital Event with Game Director Yoshitake Suzuki.\n\nLearn more about the new gameplay mechanics, monsters and much more.\n\nMonster Hunter Rise: Sunbreak arrives on Nintendo Switch and PC on June 30, 2022.\n\n#MonsterHunter #Sunbreak #Gaming\n\nTimestamps\n0:00 Intro\n0:37 Monster Hunter Rise: Sunbreak Trailer\n3:36 Sunbreak Gameplay Mechanics Breakdown\n11:47 Sunbreak Product Information\n15:41 Outro", "link": "https://www.youtube.com/watch?v=roBzgsptV90", "date_published": "2022-05-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PS5 Might Get Easier To Buy This Year | GameSpot News", "description": "Finding a PS5 might get easier this year, new Gotham Knights gameplay is released and EA renames FIFA to EA Sports FC. \n#GamingNews #PS5 #GothamKnights\n\nAs part of Sony's latest investor briefing, the company said it projects to sell 18 million PS5 consoles during the fiscal year that began April 1 and runs through March 31, 2023. For comparison, Sony sold 11.5 million PS5 consoles during its fiscal year that ended on March 31, 2022 and 7.8 million PS5 consoles for the fiscal year that ended on March 31, 2021. \n\nGotham Knights has been confirmed that the game is skipping PS4 and Xbox One as well. In a press release the developer said, it’s aiming to provide the best possible gameplay experience using the more powerful hardware available with PS5, Series X|S and PC. Alongside that release info, fans also got a new gameplay trailer that showcased how Nightwing and Red Hood’s playstyles compare. \n\nEA's massively and enduringly popular football/soccer series EA Sports FIFA is changing names. As rumored, the franchise will be called EA Sports FC going forward as part of a rights-negotiation process with FIFA that has been brewing for some time already.\n\nSTAMPS\n00:00 - Intro\n00:07 - PS5\n01:19 - Bayonetta 3\n01:30 - Gotham Knights\n02:18 - EA Sports FC", "link": "https://www.youtube.com/watch?v=dTXbXlvDM-8", "date_published": "2022-05-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]