[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "12 Minutes of Need For Speed Unbound Gameplay", "description": "This 12 minutes of Need For Speed Unbound gameplay features character dialogue, free-roaming and most importantly racing! \n#GameSpot #NeedForSpeedUnbound #PS5 \n\nNeed For Speed Unbound will be racing onto PS5, Series X|S and PC on December 2. A trial of the game is currently available to EA Play and Game Pass subscribers.", "link": "https://www.youtube.com/watch?v=Kmy0i_8ls3w", "date_published": "2022-11-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Development Of Cyberpunk 2077 Sequel To Begin In 2023 | GameSpot News", "description": "CD Projekt Red reveals whats next for Cyberpunk, Monster Hunter Rise is coming to more consoles, and new details on Bethesda's Indiana Jones game.\n#Gaming #Cyberpunk2077 #CDProjektRed \n\nDevelopment of the sequel to CD Projekt Red’s Cyberpunk 2077 will begin in 2023 with pre-production once the team has wrapped and shipped the original game’s upcoming DLC, Phantom Liberty.\n\nAdam Kiciski, president and joint CEO of CD Projekt Red, says in its recent earnings report that the team is finishing up development of the expansion currently, of which almost 350 people are working on.\n\nThanks to the Netflix anime series Cyberpunk: Edgerunners, the game has had a second wind. As previously reported, Cyberpunk 2077 had more than a million people log in and, as of September 21, remained one of the top 10 most-played games on Steam.\n\nThat earnings report, which covered the third quarter of business for CD Projekt (July - September of this year), revealed that this was its best third quarter since its founding in the ‘90s.\n\nThe company brought in $54.2 million in revenue thanks to strong sales of Cyberpunk 2077, which the company will looking to replicate in its sequel.\n\nIt seems like the dark days of the game’s launch are far behind in the rearview mirror for gamers.\n\n2023 won’t just be the start of pre-production for the next Cyberpunk, but may also bring a beloved entry in a beloved franchise to consoles. Capcom apparently plans to bring Monster Hunter Rise to PlayStation 5, PlayStation 4, Xbox Series X|S, and Xbox One next year.\n\nInsider Gaming reported that the game will release January 20 on those platforms, as well as become available on Game Pass, followed by its expansion Sunbreak later in the spring. Capcom will supposedly unveil these plans at The Game Awards on December 8.\n\nMonster Hunter Rise originally released in March 2021 for Nintendo Switch, with the game now on PC too.\n\nWhat’s interesting about the news of it launching on console with Game Pass is that Xbox is supposedly working on its own Monster Hunter-like release according to a report from earlier this year.\n\nIn January, Jeff Grubb of GameSpot sister site Giant Bomb revealed that the title is codenamed Project Suerte, and is under development at Certain Affinity, a studio that has mainly done work supporting other games, including Xbox’s own Halo franchise, of which Certain Affinity is also rumored to be developing a battle royale game for its latest entry Halo Infinite.\n\nTIMESTAMPS: \n00:00 - Cyberpunk 2077\n01:08 - Monster Hunter Rise on Game Pass\n02:33 - Todd Howard talks Indiana Jones", "link": "https://www.youtube.com/watch?v=bgsaIXCdRRA", "date_published": "2022-11-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Marvel's Midnight Suns Review", "description": "Marvel's Midnight Suns delivers strong tactical combat scenarios in a fun superhero romp where it's worth putting stock in the power of friendship.", "link": "https://www.youtube.com/watch?v=M84pw86X1tA", "date_published": "2022-11-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Far Cry 6 Lost Between Worlds Official Announcement Trailer", "description": "Far Cry 6: Lost Between Worlds will be available on December 6th. Conquer life-or-death trials in this all-new Dani Rojas story. Lost Between Worlds is a rich, action-packed gauntlet with deadly crystal enemies, multiple player paths, all-new lore, and a wide variety of unique gameplay challenges. \n\nFar Cry 6: Lost Between Worlds will be available December 6 on Xbox Series X and S, Xbox One, PlayStation 5, PlayStation 4, Ubisoft Connect, Ubisoft+, and Epic Games. \n\n#farcry6 #lostbetweenworlds #gaming", "link": "https://www.youtube.com/watch?v=TMTPlxnJjsA", "date_published": "2022-11-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mass Effect Legendary Edition Headlines PS Plus In December | GameSpot News", "description": "December's PlayStation Plus lineup leaks, Sony is bringing back tournaments, and Gotham Knights gets 4 player co-op.\n\nDealabs user billbil-kun reports that Mass Effect Legendary Edition will reportedly be made available for free December 6, 2022-January 3, 2023 for all PlayStation Plus Essentials, Extra, and Premium subscribers.\n\nThe game, which only has a previous gen version, is by extension playable on both PlayStation 4 and PlayStation 5. The Legendary Edition is a remaster of the original Mass Effect trilogy, which based on everything we’ve seen teased from developer BioWare regarding the next Mass Effect game, will be all you’ll need to play to prepare yourself for it.\n\nSorry, Andromeda fans.\n\nBiomutant and Divine Knockout are the two other games rounding out the lineup, with PS4 and PS5 versions available depending on the console you own. Biomutant is developer Experiment 101's post-apocalyptic action game starring a mammal warrior of your creation, while Divine Knockout is a third-person fighting game featuring evolving battlefields and multiple game modes.\n\nDivine Knockout is launching as a part of PlayStation Plus, so it’s the one title you’re guaranteed to not already own!\n\nIf you’re have an Xbox, Microsoft has confirmed that Game Pass Ultimate and Xbox Live Gold subscribers will be able to claim Colt Canyon, a top-down shooter set in a western wasteland, and Bladed Fury, a side-scrolling action game inspired by Chinese history and mythology. Next month. Colt Canyon will be up for grabs all month long, while Bladed Fury is free starting December 16.", "link": "https://www.youtube.com/watch?v=Z_NLUk9tz4U", "date_published": "2022-11-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Super Mario Bros Movie Official Trailer", "description": "Check out the second teaser trailer for The Super Mario Bros. Movie. This time we get to see Princess Peach, Donkey Kong, Luigi and a few others. We also get to hear their voices for the first time. Princess Peach is voiced by Anya Taylor-Joy, Donkey Kong by Seth Rogan, and Luigi by Charlie Day.\n\nWe also get to see Mario Kart for the first time in the movie and a sneak peak at the classic map Rainbow Road.\n\n#supermariobros #mario #gaming", "link": "https://www.youtube.com/watch?v=tMYg69DfFLs", "date_published": "2022-11-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Warhammer 40,000: Darktide Official Launch Trailer", "description": "As Tertium falls, Rejects Will Rise. Play Warhammer 40,000 Darktide on November 30th, 2022. \n\n#warhammer40k #darktide #gaming", "link": "https://www.youtube.com/watch?v=oMUfKLLynWI", "date_published": "2022-11-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]