[{"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Georgia’s Brian Kemp Breaks Down Why Raphael Warnock Shouldn’t Be Re-Elected", "description": "Georgia&#8217;s Senate runoff is just one week away, and Democratic incumbent Senator Raphael Warnock is neck-and-neck against GOP challenger Herschel Walker. Assisting Walker on the campaign trail is newly re-elected Republican Governor Brian Kemp, who crushed his Democratic opponent Stacey Abrams. Kemp sat down with CNN&#8217;s Kaitlan Collins and explained why Georgians should not vote ...", "link": "https://www.dailywire.com/news/georgias-brian-kemp-breaks-down-why-raphael-warnock-shouldnt-be-re-elected", "date_published": "2022-11-29 22:18:03+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Thousands Of Pedophiles Serve Less Than One Year In California Prisons: Report", "description": "Thousands of convicted pedophiles in California served less than a year in prison after committing lewd or lascivious acts with a child under 14 years old, according to an investigative report. The Daily Mail analyzed a statewide database of sex offenders that showed more than 7,000 child molesters were released within months after federal authorities ...", "link": "https://www.dailywire.com/news/thousands-of-pedophiles-serve-less-than-one-year-in-california-prisons-report", "date_published": "2022-11-29 20:55:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "NYC To Start Hospitalizing Mentally Ill Residents Involuntarily, Taking Them Off Streets, Adams Announces", "description": "New York City Mayor Eric Adams said the city will begin to involuntarily hospitalize mentally ill residents. In a press conference Tuesday, Adams announced that first responders in the city would be able to remove people who appear to be mentally ill and pose a danger to themselves. First responders will be able to remove ...", "link": "https://www.dailywire.com/news/nyc-to-start-hospitalizing-mentally-ill-residents-involuntarily-taking-them-off-streets-adams-announces", "date_published": "2022-11-29 20:17:18+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Marilyn Monroe’s Historic Chocolate Wedding Suit Goes On Sale, But It’s Going To Cost You An Insane Amount", "description": "Marilyn Monroe&#8217;s historic chocolate wedding suit skirt — the one she wore when she married baseball great Joe DiMaggio — has gone up for sale and it&#8217;s going to cost you an insane amount if you are hoping to take it home. Through the &#8220;Gotta Have Rock And Roll&#8217; auction house, fans of the late-Hollywood ...", "link": "https://www.dailywire.com/news/marilyn-monroes-historic-chocolate-wedding-suit-goes-on-sale-but-its-going-to-cost-you-an-insane-amount", "date_published": "2022-11-29 20:14:48+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Three Stowaways Found Alive On Ship’s Rudder After Almost 2,800 Mile Journey At Sea", "description": "Three men were discovered on the rudder of a ship after they stowed away during an 11-day journey across the ocean from Nigeria to the Canary Islands.  Two of the discovered stowaways were helped and put back on the ship in order to be deported. A local government spokesperson reportedly said that the third person ...", "link": "https://www.dailywire.com/news/three-stowaways-found-alive-on-ships-rudder-after-almost-2800-mile-journey-at-sea", "date_published": "2022-11-29 19:51:07+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Top Republican Party Leaders Speak Out About Trump’s Meeting With Holocaust Denier", "description": "Senate Minority Leader Mitch McConnell (R-KY) and House Minority Leader Kevin McCarthy (R-CA) spoke out against former President Donald Trump&#8217;s recent meeting with known anti-Semites, including one who is a Holocaust denier. The remarks from the two leaders come after Trump hosted rapper Kanye &#8220;Ye&#8221; West, who has gone on multiple anti-Semitic tirades in recent ...", "link": "https://www.dailywire.com/news/top-republican-party-leaders-speak-out-about-trumps-meeting-with-holocaust-denier", "date_published": "2022-11-29 19:12:04+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "South Dakota Governor Noem Blocks State Employees From Downloading TikTok", "description": "South Dakota Governor Kristi Noem ordered state government employees to stop using TikTok. Noem signed an Executive Order Tuesday to ban government officials in the state from using the Chinese social media app over growing security concerns. The order takes effect immediately, and bans all state government employees and contractors from downloading the app on ...", "link": "https://www.dailywire.com/news/south-dakota-governor-noem-blocks-state-employees-from-downloading-tiktok", "date_published": "2022-11-29 18:49:40+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "BREAKING: Dem-Controlled Senate Passes Same-Sex Marriage Bill; 12 Republicans Support", "description": "U.S. Senators advanced landmark legislation Tuesday, 61-36, that would codify same-sex marriage protections into law, despite opposition from most GOP lawmakers who argue the bill&#8217;s language infringes on religious freedoms. Senate Democrats unanimously supported — with the help of some Republicans — the Respect for Marriage Act, which repeals the Defense of Marriage Act that ...", "link": "https://www.dailywire.com/news/breaking-dem-controlled-senate-passes-same-sex-marriage-bill-12-republicans-support", "date_published": "2022-11-29 18:45:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "J. Lo Reveals The Three Words Ben Affleck Had Engraved On Her Engagement Ring – They’re Not What You Think", "description": "Singer Jennifer Lopez revealed the three simple words her new husband — actor Ben Affleck — had engraved on her engagement ring when he proposed to her for a second time nearly two decades after the pair had gone their separate ways. Lopez made the revelation during an interview with Apple Music’s Zane Lowe, noting ...", "link": "https://www.dailywire.com/news/j-lo-reveals-the-three-words-ben-affleck-had-engraved-on-her-engagement-ring-theyre-not-what-you-think", "date_published": "2022-11-29 18:28:14+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Norway’s Left-Wing Government To Hit Fleeing Billionaires With Even Higher Taxes", "description": "Norway plans to increase taxes on billionaires attempting to flee the socialistic nation, where residents already experience one of the highest tax burdens on the planet. Officials across multiple Norwegian parties agreed to end a five-year time limit on exit taxes for unrealized gains and extend the rules “to apply to the transfer of shares ...", "link": "https://www.dailywire.com/news/norways-left-wing-government-to-hit-fleeing-billionaires-with-even-higher-taxes", "date_published": "2022-11-29 18:22:11+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Ben Shapiro: Rotten Apple Takes Aim At Free Speech In China And On Twitter", "description": "Apple has been accused of helping China crack down on free speech, and now, according to Ben Shapiro, the tech giant may now be teaming up with the Biden administration and much of the media to silence Americans on Twitter. The Daily Wire radio and podcast host told his listeners Tuesday that Apple’s reported plan ...", "link": "https://www.dailywire.com/news/ben-shapiro-rotten-apple-takes-aim-at-free-speech-in-china-and-on-twitter", "date_published": "2022-11-29 18:04:50+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Why Would Anybody Stay In California?", "description": "I wish we could just cover happy topics all day long, but we have to talk about pedophilia and what’s going on in California. The depressive state of things today beats me down. But it is so much more important to me that everybody is informed — especially if you&#8217;re like me and you&#8217;re a ...", "link": "https://www.dailywire.com/news/why-would-anybody-stay-in-california", "date_published": "2022-11-29 18:04:02+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Twitter Dropped Its COVID ‘Misinformation’ Policy, But No One Noticed Until Now", "description": "Twitter dropped its policies about COVID-19 misinformation last week, but no one noticed until now. According to an update note posted on Twitter&#8217;s blog and &#8220;transparency report,&#8221; as of November 23, the platform is no longer enforcing policies it used to combat &#8220;misleading information&#8221; during the COVID pandemic. But there was no formal announcement of ...", "link": "https://www.dailywire.com/news/twitter-dropped-its-covid-misinformation-policy-but-no-one-noticed-until-now", "date_published": "2022-11-29 17:57:07+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Tuesday Afternoon Update: Biden Calls On Congress To Prevent Rail Strike, ‘Father Stu’ Returns, And More", "description": "This article is a companion piece to today’s Morning Wire Afternoon Update. To listen to the podcast version, click here. Biden Calls On Congress On Tuesday, Congressional Democrats and Republicans pledged to pass legislation to avoid a nationwide rail strike at the behest of President Biden. A strike would disrupt shipping and would likely lead to ...", "link": "https://www.dailywire.com/news/tuesday-afternoon-update-biden-calls-on-congress-to-prevent-rail-strike-father-stu-returns-and-more", "date_published": "2022-11-29 17:56:45+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Virginia Walmart Mass Shooting Survivor Sues Company For $50 Million, Alleges Shooter Had ‘Pattern Of Disturbing And Threatening Behavior’", "description": "A survivor of the mass shooting at a Virginia Walmart filed a lawsuit against Walmart for $50 million on Tuesday. The plaintiff is Donya Prioleau, a Walmart worker, who claims that the company kept allowing the alleged mass shooter to work at the store even though the shooter “had known propensities for violence, threats and strange ...", "link": "https://www.dailywire.com/news/virginia-walmart-mass-shooting-survivor-sues-company-for-50-million-alleges-shooter-had-pattern-of-disturbing-and-threatening-behavior", "date_published": "2022-11-29 17:54:19+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "U.S. Soccer’s Game-Winning Scorer Rushed To Hospital For Injury Sustained During Goal Score", "description": "American forward Christian Pulisic was taken to the hospital Tuesday for evaluations after he was injured while scoring the U.S.&#8217;s game-winning goal against the Islamic Republic of Iran in the World Cup. While playing in Qatar, Pulisic scored the United States’ only goal of the contest in the first half, propelling the team to a ...", "link": "https://www.dailywire.com/news/u-s-soccers-game-winning-scorer-rushed-to-hospital-for-injury-sustained-during-goal-score", "date_published": "2022-11-29 17:47:19+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Shipwreck Found At Bottom Of Norway’s Largest Lake Could Be 700 Years Old, Archaeologists Believe", "description": "Archaeologists believe they have found the shipwreck of a possible medieval vessel in the largest lake in Norway, the Norwegian Defense Research Establishment revealed earlier this month. The shipwreck is dated sometime between 1300 and 1850, meaning it could potentially be from the Middle Ages. It was discovered by researchers who were searching for surplus ...", "link": "https://www.dailywire.com/news/shipwreck-found-at-bottom-of-norways-largest-lake-could-be-700-years-old-archaeologists-believe", "date_published": "2022-11-29 17:36:48+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "What Pediatric Gender Clinics Have In Common With Opioid ‘Pill Mills’", "description": "Hundreds of pediatric gender clinics have proliferated across the country in recent years to meet growing patient demand – not medical necessity – of trans-identified youth. It is an unfortunate reality that market demands, rather than sensible science, can be powerful drivers of the medical industry, often to the detriment of the patient. Sometimes the ...", "link": "https://www.dailywire.com/news/what-pediatric-gender-clinics-have-in-common-with-opioid-pill-mills", "date_published": "2022-11-29 17:20:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Union Allies Turn On ‘Pro-Labor’ Biden For Trying To Prevent Looming Rail Strike", "description": "Labor unions rebuked President Joe Biden on Tuesday for requesting that Congress prevent a looming rail strike. The commander-in-chief said in a Monday evening statement that the possible work freeze, which could begin as soon as December 9, would “devastate” the economy ahead of the holiday season. “As a proud pro-labor President, I am reluctant ...", "link": "https://www.dailywire.com/news/union-allies-turn-on-pro-labor-biden-for-trying-to-prevent-looming-rail-strike", "date_published": "2022-11-29 17:15:58+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Country Singer Jake Flint Dies At 37, Hours After His Wedding", "description": "Country singer Jake Flint has died only hours after he and his bride finally walked down the aisle on Saturday. He was 37. In a message shared on social media on Sunday, the singer&#8217;s manager Brenda Cline wrote that, &#8220;With a broken heart and in deep grief I must announce that Jake Flint has tragically ...", "link": "https://www.dailywire.com/news/country-singer-jake-flint-dies-at-37-hours-after-his-wedding", "date_published": "2022-11-29 16:55:40+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "DC Abuzz With Chatter About Biden Replacing VP Harris", "description": "Something odd is happening in Washington, D.C. &#8212; on both sides of the political aisle. After the GOP performed poorly in the 2022 midterm elections, Republicans openly blamed former President Donald Trump &#8212; even though he is, whether you like it or not, the de facto head of the party. But the weak showing exposed ...", "link": "https://www.dailywire.com/news/dc-abuzz-with-chatter-about-biden-replacing-vp-harris", "date_published": "2022-11-29 16:47:18+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Megyn Kelly Blasts Kim Kardashian’s Response To Balenciaga Scandal", "description": "Megyn Kelly blasted Kim Kardashian&#8217;s response to Balenciaga&#8217;s child &#8220;BDSM&#8221; photo shoot scandal, saying that the &#8220;money is worth more&#8221; to the reality star &#8220;than her morals,” as she called on Kardashian to immediately distance herself from the brand. During Sirius XM’s “The Megyn Kelly Show&#8221; podcast on Tuesday, the host was speaking with Carrie ...", "link": "https://www.dailywire.com/news/megyn-kelly-blasts-kim-kardashians-response-to-balenciaga-scandal", "date_published": "2022-11-29 16:24:38+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "State Attorneys General Move To Block Vanguard’s Climate Crusade From Impacting Public Power Grids", "description": "Attorneys general from multiple conservative states and nonprofit organization Consumers’ Research filed motions seeking to prevent Vanguard from purchasing shares in publicly traded utilities out of a concern that the company’s climate change efforts will raise prices and decrease energy reliability. The motions filed with the Federal Energy Regulatory Commission argue that Vanguard should not ...", "link": "https://www.dailywire.com/news/state-attorneys-general-move-to-block-vanguards-climate-crusade-from-impacting-public-power-grids", "date_published": "2022-11-29 16:17:04+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Democrats Flip Pennsylvania State House In Another Massive Midterm Loss For Republicans, Promise ‘Center-Left’ Agenda", "description": "Pennsylvania Democrats successfully flipped the commonwealth’s House of Representatives by a single seat and plan to advance a &#8220;center-left&#8221; agenda, marking another significant midterm election loss for the Republican Party. Democrats in the Keystone State experienced considerable midterm victories after a forecasted red wave failed to materialize. Candidates flipped a net total of 12 districts, ...", "link": "https://www.dailywire.com/news/democrats-flip-pennsylvania-state-house-in-another-massive-midterm-loss-for-republicans-promise-center-left-agenda", "date_published": "2022-11-29 15:29:17+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Mark Wahlberg, Sony Re-Releasing PG-13 Version Of ‘Father Stu’ In Theaters", "description": "Sony is re-releasing a PG-13 version of the Mark Wahlberg movie &#8220;Father Stu,&#8221; which is based on the true story of a boxer who became a Catholic priest. The 51-year-old actor shared the news on Instagram in a recent post celebrating that the film, which originally came out earlier this year with an R rating, ...", "link": "https://www.dailywire.com/news/mark-wahlberg-sony-re-releasing-pg-13-version-of-father-stu-in-theaters", "date_published": "2022-11-29 15:10:35+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Oklahoma Assistant District Attorney Arrested For Allegedly Possessing Child Pornography", "description": "Oklahoma authorities arrested an assistant district attorney Monday for allegedly possessing child pornography. Kevin Etherington, the 53-year-old first assistant district attorney of Logan and Payne Counties, was arrested in Stillwater, Oklahoma, on one count of aggravated possession of child pornography and one count of violation of the Oklahoma Computer Crimes Act, according to local media. ...", "link": "https://www.dailywire.com/news/oklahoma-assistant-district-attorney-arrested-for-allegedly-possessing-child-pornography", "date_published": "2022-11-29 15:02:15+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Video: Chinese Protesters Destroy COVID Testing Site As Police In Hazmat Suits Deploy To City Streets", "description": "Anti-government protesters in communist China flipped over and destroyed a COVID testing tent in the city of Guangzhou on Monday, prompting police in hazmat suits to flood the streets and disperse the crowds.  Videos on Twitter — confirmed by journalist William Yang of the Taiwan Foreign Correspondents’ Club — showed protesters flipping over a COVID testing ...", "link": "https://www.dailywire.com/news/video-chinese-protesters-destroy-covid-testing-site-as-police-in-hazmat-suits-deploy-to-city-streets", "date_published": "2022-11-29 14:48:14+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Raw Exercise Of Monopolistic Power’: DeSantis Demands Congressional Action If Apple Dumps Twitter From App Store", "description": "Florida Republican Governor Ron DeSantis called on Congress to take action if Apple Inc. moved to take Twitter off the app store, saying that would constitute a &#8220;raw exercise of monopolistic power.&#8221; DeSantis was discussing infrastructure projects in Duval County, Florida, when he pivoted to address several other issues — beginning with the continued COVID-related ...", "link": "https://www.dailywire.com/news/raw-exercise-of-monopolistic-power-desantis-demands-congressional-action-if-apple-dumps-twitter-from-app-store", "date_published": "2022-11-29 14:46:20+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘No Pushback’: Producer Of New Disney+ LGBTQ Fantasy Series For Teens Discusses ‘Paradigm Shift’ Of Acceptance", "description": "Fresh on the heels of their high-profile box office flop “Strange World,” Disney is gearing up to release another project for kids with an LGBTQ storyline. The producer of the fantasy series “Willow” spoke with Polygon about his decision to include a “queer” romance front and center. The show begins streaming on Disney+ starting November ...", "link": "https://www.dailywire.com/news/no-pushback-producer-of-new-disney-lgbtq-fantasy-series-for-teens-discusses-paradigm-shift-of-acceptance", "date_published": "2022-11-29 14:37:35+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Alaska’s Election Shows Why Voters Should Reject ‘Ranked-Choice’ Voting In Their Home State", "description": "Like an infectious disease, the phenomenon of ranked-choice voting is sweeping the nation. It’s already the law of the land in Maine, and is moving ahead in Nevada. As an Alaskan living through the ranked-choice nightmare this year, take it from me — do not let this system infiltrate your state. Proponents will claim ranked-choice ...", "link": "https://www.dailywire.com/news/alaskas-election-shows-why-voters-should-reject-ranked-choice-voting-in-their-home-state", "date_published": "2022-11-29 14:35:15+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Meghan Markle Answers Whether She’d Ever Be On A Reality Show Like ‘Real Housewives’", "description": "During a recent episode of her podcast, Meghan Markle said that while she thinks reality TV shows like &#8220;Real Housewives of Beverly Hills&#8221; are fun, &#8220;there will be no reality show&#8221; centered around her. During the Duchess of Sussex&#8217;s Spotify podcast &#8220;Archetypes&#8221; on Tuesday, TV producer Andy Cohen — who has produced the &#8220;Real Housewives&#8221; franchises ...", "link": "https://www.dailywire.com/news/meghan-markle-answers-whether-shed-ever-be-on-a-reality-show-like-real-housewives", "date_published": "2022-11-29 14:34:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Surveillance And Control’: Vivek Ramaswamy And Tucker Carlson Discuss China-Inspired Push For A ‘Central Bank Digital Currency’", "description": "Strive Asset Management executive chairman Vivek Ramaswamy balked at the possibility of a “central bank digital currency” in the United States during an interview with Fox News host Tucker Carlson. The entrepreneur rejected the notion that a digital dollar managed by the Federal Reserve would be beneficial for the economy, asserting that the project would ...", "link": "https://www.dailywire.com/news/surveillance-and-control-vivek-ramaswamy-and-tucker-carlson-discuss-china-inspired-push-for-a-central-bank-digital-currency", "date_published": "2022-11-29 14:31:23+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘It’s Like A Turf War’: Alyssa Milano Says She’ll Stay On Twitter Despite Trolls, Jokes She’ll Wear ‘A Helmet’", "description": "&#8220;Charmed&#8221; star Alyssa Milano said on Tuesday that she planned to stay on Twitter despite the trolls and her recent dust-up with billionaire and self-described &#8220;Chief Twit&#8221; Elon Musk, arguing that it was like a &#8220;turf war&#8221; and that it was important not to &#8220;cede that territory.&#8221; Milano joined the co-hosts of ABC&#8217;s midday talk ...", "link": "https://www.dailywire.com/news/its-like-a-turf-war-alyssa-milano-says-shell-stay-on-twitter-despite-trolls-jokes-shell-wear-a-helmet", "date_published": "2022-11-29 14:08:13+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘This Isn’t Cancel Culture’: Meghan McCain Blasts Nicole Kidman, Kim Kardashian And Balenciaga Over BDSM-Themed Shoot With Kids", "description": "Meghan McCain blasted actress Nicole Kidman, Kim Kardashian, and Balenciaga over the BDSM-themed photo shoot with kids while claiming she wasn&#8217;t participating in &#8220;cancel culture&#8221; but was motivated by &#8220;protecting children.&#8221; The former co-host of &#8220;The View&#8221; penned an op-ed in The Daily Mail on Monday headlined, &#8220;Balenciaga sexually exploited kids to sell a revolting ...", "link": "https://www.dailywire.com/news/this-isnt-cancel-culture-meghan-mccain-blasts-nicole-kidman-kim-kardashian-and-balenciaga-over-bdsm-themed-shoot-with-kids", "date_published": "2022-11-29 13:34:52+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Washington’s Special Ed Schools Rife With Abuse Complaints, Poor Academics: Report", "description": "Washington state’s special education schools are rife with student abuse allegations and poor academic performance, a new report shows. A severe lack of state oversight has resulted in concerning conditions at a group of private but taxpayer-funded special education schools in Washington, according to a new investigative report from the Seattle Times and ProPublica. The outlets ...", "link": "https://www.dailywire.com/news/washingtons-special-ed-schools-rife-with-abuse-complaints-poor-academics-report", "date_published": "2022-11-29 13:30:22+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘I Have No Idea What He Is!’: Hollywood A-Lister Questions Whether Elon Musk Is A Real Person", "description": "Actor Samuel L. Jackson mocked the furor over Twitter — and the recent takeover by billionaire entrepreneur Elon Musk — during a Tuesday morning appearance on &#8220;The View,&#8221; reminding the audience that Twitter wasn&#8217;t the real world and questioning whether Musk himself was real. Jackson and his wife LaTanya Richardson Jackson punctuated the interview — ...", "link": "https://www.dailywire.com/news/i-have-no-idea-what-he-is-hollywood-a-lister-questions-whether-elon-musk-is-a-real-person", "date_published": "2022-11-29 13:25:10+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Over 400 Migrant Workers Died Preparing For Qatar World Cup, Official Says", "description": "Between 400 to 500 migrant workers died in preparation for Qatar&#8217;s World Cup, according to an official from the local organizing committee. The new report from Hassan al-Thawadi, the secretary-general of the Supreme Committee for Delivery and Legacy, was shared during an interview with Pier Morgan. “What is the honest, realistic total do you think ...", "link": "https://www.dailywire.com/news/over-400-migrant-workers-died-preparing-for-qatar-world-cup-official-says", "date_published": "2022-11-29 13:14:11+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘It’s Absolutely Disgusting!’: Convicted Rapist Under Investigation After Reports He Accessed Dating App From Jail", "description": "St. Louis officials are investigating reports that a convicted rapist managed to access a dating app while incarcerated at the St. Louis County Justice Center ahead of his December 22 sentencing hearing. Dominic Yocco, 23, was convicted by a jury on 16 of 19 counts of rape and sodomy in September, after which his bond ...", "link": "https://www.dailywire.com/news/its-absolutely-disgusting-convicted-rapist-under-investigation-after-reports-he-accessed-dating-app-from-jail", "date_published": "2022-11-29 13:12:16+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Thanksgiving Weekend Holiday Shopping Shatters Expectations Despite Economic Headwinds", "description": "The opening of the holiday shopping season was the most robust on record, even in the face of inflationary pressures, supply chain bottlenecks, and other economic headwinds. A record 196.7 million Americans shopped online and in person during the five days between Thanksgiving and Cyber Monday, according to data released by the National Retail Foundation, ...", "link": "https://www.dailywire.com/news/thanksgiving-weekend-holiday-shopping-shatters-expectations-despite-economic-headwinds", "date_published": "2022-11-29 12:30:08+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "WATCH: Don Lemon Offers Bizarre Rebuttal When Colbert Says New CNN Boss Won’t Let Anchors ‘Be Liberal’", "description": "CNN morning show host Don Lemon managed to surprise &#8220;The Late Show&#8221; host Stephen Colbert during a Monday evening appearance when he asserted that he didn&#8217;t believe his network had ever been &#8220;liberal.&#8221; Lemon and Colbert discussed CNN&#8217;s new management — namely new CEO Chris Licht, who had previously worked for Colbert — and the ...", "link": "https://www.dailywire.com/news/watch-don-lemon-offers-bizarre-rebuttal-when-colbert-says-new-cnn-boss-wont-let-anchors-be-liberal", "date_published": "2022-11-29 12:24:43+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Biden’s Secret Service Rental Vehicles Burn In Flames 1 Day After His Nantucket Departure", "description": "President Joe Biden&#8217;s Secret Service rental vehicles were part of a large fire just one day after he left from a Nantucket vacation. The Monday fire at the Nantucket Memorial Airport in Massachusetts included five vehicles rented from Hertz that were used to transport the president and his family. A large car fire involving multiple ...", "link": "https://www.dailywire.com/news/bidens-secret-service-rental-vehicles-burn-in-flames-1-day-after-his-nantucket-departure", "date_published": "2022-11-29 12:17:08+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "SCOTUS Takes Up Major Immigration Case Between Texas And Biden Administration", "description": "Oral arguments began on Tuesday at the Supreme Court in United States v. Texas, in which Texas and Louisiana are fighting against the Biden administration’s policy of prioritizing certain illegal immigrants for deportation, leaving the states to fend for themselves against the huge number of illegal immigrants in their states. The issue at hand was ...", "link": "https://www.dailywire.com/news/scotus-takes-up-major-immigration-case-between-texas-and-biden-administration", "date_published": "2022-11-29 12:10:45+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Ted Cruz Unloads On White House Over Biden Admin’s Weak China Statement", "description": "Sen. Ted Cruz (R-TX) released a statement condemning the Chinese Communist Party&#8217;s COVID policies &#8212; and the White House&#8217;s weak response. The Texas lawmaker, a member of the Senate Foreign Relations Committee, issued a statement Monday after reports of the Biden administration&#8217;s tepid words regarding the unrest in China over its strict lockdown policies. “The ...", "link": "https://www.dailywire.com/news/ted-cruz-unloads-on-white-house-over-biden-admins-weak-china-statement", "date_published": "2022-11-29 11:59:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Hollywood Bombs At Box Office Over Thanksgiving Weekend; Worst Non-Covid Since 1994", "description": "Hollywood, which has determinedly stuck to its guns in forwarding its woke agenda, crashed and burned over the Thanksgiving weekend, as box office receipts plunged to their lowest Thanksgiving weekend total since 1994. The total from the three-day weekend amounted to $95 million, as IndieWire reported; the two years prior to the 2020 COVID pandemic, ...", "link": "https://www.dailywire.com/news/hollywood-bombs-at-box-office-over-thanksgiving-weekend-worst-non-covid-since-1994", "date_published": "2022-11-29 11:44:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Country Singer Responds To Claims She Photoshopped Abs On Her Kids After Photo Goes Viral", "description": "Country star Jessie James Decker is addressing the massive backlash she’s received since posting a photo of her children on vacation. Images of her three kids, Vivianne, 8, Eric Jr., 7, and Forrest, 4, started circulating online, with fans commenting on how defined the kids’ abdominal muscles looked. Some followers accused Decker of using photo ...", "link": "https://www.dailywire.com/news/country-singer-responds-to-claims-she-photoshopped-abs-on-her-kids-after-photo-goes-viral", "date_published": "2022-11-29 11:31:03+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Russian Crypto Billionaire Dies In Helicopter Crash", "description": "A Russian cryptocurrency billionaire died in a helicopter crash near Monaco, despite good weather in the area, the third cryptocurrency entrepreneur to die unexpectedly in recent weeks. Vyacheslav Taran, 53, died after the helicopter crashed near Villefranche-sur-Mer after lifting off from Lausanne in Switzerland. The French pilot also died. &#8220;It is with great sadness that ...", "link": "https://www.dailywire.com/news/russian-crypto-billionaire-dies-in-helicopter-crash", "date_published": "2022-11-29 11:18:14+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "White House Calls For Congressional Intervention To Avoid ‘Potentially Crippling’ Rail Strike", "description": "President Joe Biden called upon members of Congress to prevent a looming rail strike that would “devastate” the economy ahead of the holiday season. A strike could take place on December 9 as rail companies and labor unions fail to reach an agreement on matters such as health benefits and wage increases. Biden noted in ...", "link": "https://www.dailywire.com/news/white-house-calls-for-congressional-intervention-to-avoid-potentially-crippling-rail-strike", "date_published": "2022-11-29 10:50:58+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘It Tore Us Apart’: Gosselin Sextuplet Collin Reflects On Reality TV, Being Institutionalized Twice", "description": "After years of being gossip column fodder, Jon and Kate Gosselin’s 18-year-old son Collin is speaking out about what he thinks led to the fracture in his family. The teen rose to fame on the reality series “Jon &amp; Kate Plus 8,” which premiered in 2007. The show featured the parents raising their eight children, ...", "link": "https://www.dailywire.com/news/it-tore-us-apart-gosselin-sextuplet-collin-reflects-on-reality-tv-being-institutionalized-twice", "date_published": "2022-11-29 10:43:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Most Advanced Military Aircraft Ever Built’ To Be Unveiled By U.S. Air Force", "description": "On Friday, the U.S. Air Force will give the family and friends of the 8,000 people who worked on it a chance to see the world’s first sixth-generation aircraft: the B-21 Raider stealth bomber. The showing of the B-21, which is named for the World War II Doolittle Raiders B-21 bomber crewmen, will take place ...", "link": "https://www.dailywire.com/news/most-advanced-military-aircraft-ever-built-to-be-unveiled-by-u-s-air-force", "date_published": "2022-11-29 10:38:40+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Will Smith Explains Oscars Slap, Says It Was ‘Rage That Had Been Bottled For A Really Long Time’", "description": "Actor Will Smith, 54, spoke with Trevor Noah on “The Daily Show” Monday, blaming his violent outburst against Chris Rock on an underlying “rage” that had been festering for some time.  “I was gone, dude,” Smith told Noah about the incident, according to Variety. “That was a rage that had been bottled for a really ...", "link": "https://www.dailywire.com/news/will-smith-explains-oscars-slap-says-it-was-rage-that-had-been-bottled-for-a-really-long-time", "date_published": "2022-11-29 10:04:04+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Wait, Hear Me Out Here: AOC Is Exactly Right This Time", "description": "In politics nowadays, there&#8217;s this general feeling that anybody from the party you don&#8217;t support is wrong, wrong, wrong. But that&#8217;s silly, right? Even a broken clock is right twice a day. Even a blind squirrel finds a nut. And nobody is wrong 100% of the time. Take Rep. Alexandria Ocasio-Cortez, the Democratic socialist from ...", "link": "https://www.dailywire.com/news/wait-hear-me-out-here-aoc-is-exactly-right-this-time", "date_published": "2022-11-29 10:02:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Children’s Hospital Slammed For Hiring Transgender Activist As A Chaplain", "description": "Children’s Wisconsin hospital, located in Milwaukee, Wisconsin, has engendered anger after hiring as a chaplain an activist who has shared a poem titled “Jesus at the Gay Bar” and started a GoFund me page for her partner to have her breasts removed. Fliers were posted reading “Meet Your New Chaplain: Kate Newendorp” with her pronouns ...", "link": "https://www.dailywire.com/news/childrens-hospital-slammed-for-hiring-transgender-activist-as-a-chaplain", "date_published": "2022-11-29 09:52:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "How Protesters In China Are Cleverly Defying Their Communist Government", "description": "On June 4, 1989, student-led dissenters gathered in a Chinese city and faced soldiers armed with assault rifles as tanks rolled toward them. The protests had started two months before as the communist People’s Republic of China dealt with economic and social issues sweeping the post-Mao nation. Communist China declared martial law days before, but ...", "link": "https://www.dailywire.com/news/how-protesters-in-china-are-cleverly-defying-their-communist-government", "date_published": "2022-11-29 09:44:59+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Fox News Democrat Analyst Juan Williams Names DeSantis 2022’s Top U.S. Political Player: ‘He Scares Me’", "description": "Fox News Democrat political analyst Juan Williams named Gov. Ron DeSantis (R-FL) as America&#8217;s most influential political player in 2022 despite being terrified of him. Williams highlighted DeSantis&#8217; &#8220;enormous&#8221; impact this year, ranging from dominating the culture war in Florida, to getting the Republican Party more seats in the U.S. House of Representatives by redrawing ...", "link": "https://www.dailywire.com/news/fox-news-democrat-analyst-juan-williams-names-desantis-2022s-top-u-s-political-player-he-scares-me", "date_published": "2022-11-29 08:03:53+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Clarence Gilyard Jr., Known For ‘Top Gun,’ ‘Die Hard,’ ‘Matlock,’ ‘Walker, Texas Ranger,’ Dead At 66", "description": "Clarence Gilyard Jr., known for starring in &#8220;Walker, Texas Ranger&#8221; and for supporting roles in several box office hits, has died. He was 66. Gilyard died after a battle with a &#8220;long illness,&#8221; the Las Vegas Review-Journal reported, adding that no further details are currently known about his death. His death was confirmed in a ...", "link": "https://www.dailywire.com/news/clarence-gilyard-jr-known-for-top-gun-die-hard-matlock-walker-texas-ranger-dead-at-66", "date_published": "2022-11-29 07:51:06+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘The Big Bang’: Twitter Starts Reinstating Tens Of Thousands Of Major Accounts That Were Banned, Report Says", "description": "Twitter CEO Elon Musk has reportedly started to reinstate tens of thousands of Twitter accounts that have significant followings in an event that some inside the company are calling &#8220;the Big Bang.&#8221; The news comes after Musk announced last week a blanket amnesty for Twitter users permanently suspended from the platform. Musk made the decision ...", "link": "https://www.dailywire.com/news/the-big-bang-twitter-starts-reinstating-tens-of-thousands-of-major-accounts-that-were-banned-report-says", "date_published": "2022-11-29 07:33:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "U.S. Representative Donald McEachin Dies At 61", "description": "Rep. Donald McEachin (D-VA) died Monday night after battling cancer for many years, according to a statement from his office. He was 61. &#8220;We are all devastated at the passing of our boss and friend, Congressman Donald McEachin,&#8221; Tara Rountree, his chief of staff, said in the statement. &#8220;Valiantly, for years now, we have watched him ...", "link": "https://www.dailywire.com/news/u-s-representative-donald-mceachin-dies-at-61", "date_published": "2022-11-29 07:16:42+00:00", "persistent": false, "user": null, "language": "en-US"}]