[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Amber Mark: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBobby Carter | January 31, 2022\nIn her Tiny Desk (home) concert, singer-songwriter and producer Amber Mark expresses more than once that performing for the series is a \"bucket list\" moment for her. Upon our first meeting, she came with the concept for her performance entirely laid out. \"The band is gonna sing backup, and we can cut to my family in the audience at the restaurant,\" she said. \"We'll make it beautiful.\" With details that evoked excitement and nervousness all at once, the ideas felt massive to me. And what she delivers here is pretty grand, yet deeply intimate.\n\nFor her concert, Mark stuck to the script, shooting her session at Palma restaurant in New York, a place she's called home since her high school days. This Tiny Desk (home) concert is a celebration of her stunning debut album, Three Dimensions Deep, and is handled with the same intricate attention to detail as she did for the album itself.\n\nThe dimensions Mark explored on the project are what she calls \"without,\" \"withheld,\" and \"within.\" We're taken with her on a quest for answers to questions tied to her personal struggles with self-doubt, loss and heartbreak. She starts her concert with \"On & On,\" which carries us from the \"withheld\" portion of the album right into a revelation of inner peace in songs like \"Bliss\" and \"Worth It.\" Mark also slows it down and plays \"Waiting\" from her 2020 \"COVERED-19\" series.\n\nSET LIST\n\"On & On\"\n\"Bliss\"\n\"Waiting\"\n\"Worth It\"\n\nMUSICIANS\nAmber Mark: vocals\nJosh Hari: bass, music director\nJoy Morales: keys, vocals\nTim Smith: drums, vocals\nCale Hawkins: synth, guitar, vocals\nMayteana Morales: percussion, vocals\nCorey Sanchez: guitar\n\nCREDITS\nDirector/Cinematographer: Hil Steadman, Jake DeNicola\nProducer: Ani Schroeter Audio Engineers: Mark Yoshizumi, Madeleine Campbell\nEditors: Jake DeNicola and Hil Steadman\nProduction Company: Anima Works\n1 AC: Seana Rogovin\nGaffer: John Izarpate\nPD/Grip: David Persaud\nSteadicam: Franz Brun\nProduction Design: Chloerose Brée-D'Orazio\nProduction Assistant: Henry Dolan\nDIT: Bennett Torres\nColor: Ben Federman\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Joshua Bryant\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Maia Stern, Kara Frame, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #ambermark", "link": "https://www.youtube.com/watch?v=1D-QXrC3U0I", "date_published": "2022-01-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tufan Derince: Tiny Desk (Home) Concert", "description": "For the second consecutive year, NPR teamed up with globalFEST in January 2021 for a thrilling online music festival we call Tiny Desk Meets globalFEST: three nights, nine bands, and a world of musical traditions hosted by African pop star Angélique Kidjo. Now, we're posting all the sets from our festival as individual Tiny Desk (home) concerts.\n\nBob Boilen | January 29, 2022\nTufan Derince, a young Kurdish musician from Diyarbakir in southeast Turkey, is a master of the elektro bağlama, an electrified version of the bağlama of Turkish folk music. Now based in Rotterdam, he is in high demand as a performer at events integral to the cultural lives of Kurdish communities throughout Europe and across Turkey.\n\nDerince made his U.S. debut at globalFEST in New York in 2020, which led to glowing coverage from NPR, The New York Times, and Songlines, and invitations to other international festivals like Dubai Expo 2020 and SXSW. --The globalFEST staff\n\nSET LIST\n\"Govend\"\n\"Granî\"\n\"Delilo\"\n\nMUSICIANS\nTufan Derince: elektro bağlama\nZana Baykara: keyboard\nDursun Ferec: kemence\nİnan İçlek: percussion\n\nCREDITS\nProduction: Tufan Derince\nAudio: Tufan Derince\nVideo: Terzan Television\n\nTiny Desk Meets globalFEST\n\nTiny Desk Team\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mixing: Josh Rogosin\nTiny Production Team: Bobby Carter, Kara Frame, Joshua Bryant, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\nglobalFEST Artistic Team\nCo-Directors: Shanta Thake, Isabel Soffer, Bill Bragin\n2022 Curators: Shanta Thake, Isabel Soffer, Bill Bragin, Gabrielle Davenport\n\nglobalFEST Production Team\nEvent Producer: Ian Thake\nProducer: THE OFFICE performing arts + film*\nVideo Producer: Karim Tabbaa\n\nSpecial Thanks\nThe Andrew W. Mellon Foundation, National Endowment for the Arts, NYC Department of Cultural Affairs, NYC Mayor's Office of Media and Entertainment, JanArtsNYC, Valerie French (social media), Yuri Kwon of Pitch Perfect PR (publicity), Tamizdat (legal services) and Duane Morris (legal services)\n\n*THE OFFICE performing arts + film consists of Rachel Chanoff, Laurie Cearley, Olli Chanoff, Erica Zielinski, Nadine Goellner, Lynn Koek, Noah Bashevkin, Catherine DeGennaro, Gabrielle Davenport, Chloe Golding, Kyla Gardner, Tess Peppis, Zion Jackson, Scout Eisenberg and Jose Alvarado", "link": "https://www.youtube.com/watch?v=jHdCIBDsniI", "date_published": "2022-01-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]