[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Specialists now agree on endemic ending", "description": "If you would like John’s text books, (it is free to download the PDFs)\n\nLink to free download of my 2 textbooks (worldwide)\nhttp://159.69.48.3/\n\nPhysiology book in hard copy (UK only)\nhttps://www.ebay.co.uk/itm/154770452796?mkevt=1&mkcid=16&mkrid=710-127635-2958-0\n\nPathophysiology book in hard copy (UK only)\nhttps://www.ebay.co.uk/itm/154770451780?mkevt=1&mkcid=16&mkrid=710-127635-2958-0\n\nMany waited until the evidence was self evident before stating a position, better late than never.\n\nhttps://ourworldindata.org/covid-metrics-previous-waves?utm_source=OWID+Newsletter&utm_campaign=57cd25901b-biweekly-digest-2022-01-14&utm_medium=email&utm_term=0_2e166c1fc1-57cd25901b-536960754\n\nMarco Cavaleri, EMA head of biological health threats and vaccines strategy\n\nhttps://www.ema.europa.eu/en/events/ema-regular-press-briefing-covid-19-11\n\nhttps://www.ema.europa.eu/en/events/ema-regular-press-briefing-covid-19-11\n\nBoosters, can be done once, or maybe twice, but it’s not something that we can think should be repeated constantly\nWe need to think about how we can transition from the current pandemic setting to a more endemic setting\nWith omicron there will be a lot of natural immunity taking place on top of vaccination,\n\nWe will be fastly moving to a scenario which is close to endemicity\n\nFourth dose for all\n\nData has not yet been generated to support this approach\n\nRepeated vaccinations in a short time frame will not represent a sustainable long term strategy\n\nEndemic Covid, very soon\n\nhttps://www.bbc.co.uk/news/health-59970281\n\nOmicron, endemic\n\nConsistent and predictable, not boom and bust\n\nCommon colds, influenza, HIV, measles, malaria, tuberculosis\n\nA new Covid-era\n\nProf Julian Hiscox, Chair in Infection and Global Health, University of Liverpool\n\nUK, New and Emerging Respiratory Virus Threats Advisory Group\n\nWe're almost there, it is now the beginning of the end, at least in the UK\n\nI think life in 2022 will be almost back to before the pandemic\n\nShould a new variant or old variant come along, for most of us, like any other common cold coronavirus, we'll get the sniffles and a bit of a headache and then we're OK\n\nIf you're willing to tolerate zero deaths from Covid, then we're facing a whole raft of restrictions and it's not game over\n\nin a bad flu season, 200-300 die a day over winter and nobody wears a mask or socially distances,\n\nthat's perhaps a right line to draw in the sand\n\nDr Elisabetta Groppelli, virologist, St George's, University of London\n\nI am very optimistic\n\nWe'll soon be in a situation where the virus is circulating, we will take care of people at risk, but for anybody else we accept they will catch it – \n\nand your average person will be fine\n\nWe need to accept the fact that our flu season is also going to be a coronavirus season, and that is going to be a challenge for us\n\nHowever, it is still uncertain how bad winters will be as the people who die from flu and Covid tend to be the same\n\n(You can't die twice)\n\nProf Azra Ghani, epidemiologist, Imperial College London\n\nCovid will still be around, but that we no longer need to restrict our lives\n\nIt seems like it's taken a long time, but only a year ago we started vaccinating and we're already an awful lot freer because of that\n\nA new variant that can outcompete Omicron and be more pathogenic\n\nProf Eleanor Riley, immunologist, University of Edinburgh\n\nWhen Omicron has finished and moved through, immunity in the UK will be high, at least for a while\n\n70 year old overweight male who used to smoke for a lot of years\n\nHi John, I’m going through a period of suffering. Got the infection last Tuesday. \n\nTested on Wednesday and was positive. It is what you described but the sore throat is terrible, you don’t realise how often you swallow until it’s torture to do so, \n\nbeen taking my D3 and zinc\n\nand if nothing else my new Granddaughter will get to know her Granddad \n\nMis en place \nWhen I woke up & feeling like I had a hangover, I immediately took my temperature, sure enough 38.7°c. \n\nKnew I had it, just needed confirmation. Performed a lateral flow test & bang! had a positive result in under 5 minutes. \n\nNo really outstanding symptoms. No sore throat, no real headache (just the tightness of the head - hangover), temperature fluctuated hour to hour, \n\ntaste bud's altered - no loss, just altered. Basically a general feeling of being unwell. \n\nThis lasted about 30 hrs & has improved greatly over a relatively short period. \n\nIt's now day 4 & feeling pretty good. Taste is still altered & a little phlegm but otherwise doing well & just waiting out the isolation protocol.", "link": "https://www.youtube.com/watch?v=U3W84wb5jKo", "date_published": "2022-01-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Pre-infection advice", "description": "If you would like John’s text books, (it is free to download the full PDFs)\n\nPhysiology book in hard copy\nhttps://www.ebay.co.uk/itm/154770452796?mkevt=1&mkcid=16&mkrid=710-127635-2958-0\n\nPathophysiology book in hard copy\nhttps://www.ebay.co.uk/itm/154770451780?mkevt=1&mkcid=16&mkrid=710-127635-2958-0\n\nLink to free download of my 2 textbooks\n\nhttp://159.69.48.3/\n\n\nOmicron exposure is inevitable, an optimised immune system is not\n\nOmicron Symptoms\n\nOmicron incubation 2 days\n\nSymptomatic disease with omicron is shorter\n\nMost people could leave isolation at 5 days\n\nLong covid, probably less than with delta\n\nCurrent symptoms\n\nRunny nose, 73%\n\nHeadache, 68%\n\nFatigue, 64%\n\nSneezing, 60%\n\nSore throat, 60%\n\nPersistent cough, 44%\n\nHoarse voice, 36%\n\nChills or shivers, 30%\n\nFever, 29%\n\nDizzy, 28%\n\nBrain fog, 24%\n\nAltered smell, 23%\n\nSore eyes, 23%\n\nUnusual muscle pains, 23%\n\nSkipped meals, 21%\n\nLoss of smell, 19%\n\nChest pain, 19%\n\nSwollen glands, 19%\n\nFeeling down, 16%\n\nRemember, the 6 Ps. Poor preparation promotes probable poor performance", "link": "https://www.youtube.com/watch?v=mZAa1BsB2ZI", "date_published": "2022-01-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]