[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Natural immunity with Dr Pilz", "description": "Direct link to paper, https://pubmed.ncbi.nlm.nih.gov/35149106/\nSARS-CoV-2 reinfections: Overview of efficacy and duration of natural and hybrid immunity\n\nDr Stefan Pilz, MD, PhD. Thank yo uoso much for this facinating and practical discussion Stefan.\n\nConsultant for endocrinology and for internal medicine and a general practitioner. \n\nAssociate professor at the Department of Endocrinology and Diabetology at the Medical University of Graz, Austria.\n\nPhD from the Department of Epidemiology and Biostatistics, Amsterdam, The Netherlands\n\nMain research interests are cardiovascular endocrinology, vitamin D and related mineral disorders, and steroid hormones with a focus on endocrine hypertension.", "link": "https://www.youtube.com/watch?v=s-E7HNWZW-k", "date_published": "2022-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Vaccines for all 5 year olds", "description": "Is the vaccine interval advice in the United States sub-optimal, increasing myocarditis?\n\nLink to Wefwafwa’s channel, \n\nhttps://www.youtube.com/channel/UCzsLklGgOttU3Se-WGLp7ow\n\nE mail for interested academics\nwefandrew@gmail.com\n\nJCVI updates advice on vaccinations for 5 to 11 age group\n\nDecember 22nd JCVI recommended the vaccine be offered to at-risk 5 to 11 year olds,\n\nrollout of which officially began at the beginning of February\n\nhttps://www.gov.uk/government/news/jcvi-updates-advice-on-vaccinations-for-5-to-11-age-group\n\n5 million\n\nAlthough this age group is generally at very low risk of serious illness from the virus, \n\na very small number of children who get infected do develop severe disease.\n\nLatest evidence suggests that offering the vaccine ahead of another potential wave,\n\nwill protect this very small number of children from serious illness and hospitalisation,\n\nand will also provide some short-term protection against mild infection across the age group.\n\nThe committee has therefore advised\n\na non-urgent offer to all 5 to 11 year olds of 2 (10mcg) doses of the Pfizer-BioNTech paediatric vaccine. \n\nThe 2 doses should be given with an interval of at least 12 weeks between doses.\n\nInternational data from adult programmes\n\nhttps://www.gov.uk/government/publications/jcvi-update-on-advice-for-covid-19-vaccination-of-children-aged-5-to-11/jcvi-statement-on-vaccination-of-children-aged-5-to-11-years-old\n\na longer interval between doses \n\n(greater than the 3 to 4-week schedule widely used in the United States)\n\nis associated with a lower reporting rate of myocarditis following vaccination. \n\nThis association is expected to also apply to the paediatric dose and formulation when used in children.\n\nProfessor Wei Shen Lim, Chair of COVID-19 immunisation on the JCVI\n\nThe main purpose of offering vaccination to 5 to 11 year olds is to increase their protection against severe illness in advance of a potential future wave of COVID-19.\n\nThe Department of Health and Social Care (DHSC) and NHS England will advise on their plans for operationalising the latest JCVI recommendations in due course.\n\nProfessor Paul Hunter\n\nhttps://www.telegraph.co.uk/news/2022/02/09/uk-past-point-covid-vaccinations-children-will-make-difference/\n\nI would lean against offering it to this age group for a number of reasons\n\nthey are actually falling really quickly at the moment\n\nand we’re seeing fewer than half the cases in this age group than we saw in little more than a week ago\n\nThe only reason why they were given it was to hopefully protect them against disruption to schooling\n\nand we haven’t seen that vaccines have done a huge amount to stop those interruptions\n\nMr Javid\n\nThe NHS will prepare to extend this non-urgent offer to all children during April so parents can, if they want, take up the offer to increase protection against potential future waves of Covid-19 as we learn to live with this virus\n\n \n\nhttps://www.gov.uk/government/publications/jcvi-update-on-advice-for-covid-19-vaccination-of-children-aged-5-to-11/jcvi-statement-on-vaccination-of-children-aged-5-to-11-years-old\n\nIt is estimated that over 85% of all children aged 5 to 11 will have had prior SARS-CoV-2 infection by the end of January 2022,\n\nwith roughly half of these infections due to the Omicron variant. \n\nNatural immunity arising from prior infection will contribute towards protection against future infection and severe disease.\n\nuse of the Pfizer-BioNTech 10 mcg paediatric formulation vaccine should be encouraged for all pupils in the relevant academic year for children aged 11 to 12 to reduce complexity in programme delivery and expected reactogenic events for individuals\n\nThis advice on the offer of vaccination to 5 to 11-year olds who are not in a clinical risk group is considered by JCVI as a one-off pandemic response programme. \n\nAs the COVID-19 pandemic moves further towards endemicity in the UK, \n\nJCVI will review whether, in the longer term, an offer of vaccination to this, and other paediatric age groups, continues to be advised.\n\nONS\n\nhttps://www.ons.gov.uk/peoplepopulationandcommunity/healthandsocialcare/conditionsanddiseases/articles/coronaviruscovid19latestinsights/antibodies\n\n10 January to 17 January, antibodies\n\nChildren, 12 to 15, 90.2% to 93.3%\n\nChildren, 8 to 11, 63.3% to 72.7%\n\nAt or above 42 ng/ml\n\nAntibodies concentration in nanograms per millilitre (ng/ml)\n\nImmunoglobulins IgG, based on SARS-CoV-2 trimeric spike protein\n\nA negative antibody test does not mean that a person is not protected\n\nhttps://blog.ons.gov.uk/2021/04/28/antibodies-and-immunity-how-do-they-relate-to-one-another/\n\nA person may have tested positive for antibodies at one time, but then have a negative test result later\n\nAntibody threshold levels and unit measurement\n\nhttps://www.ons.gov.uk/peoplepopulationandcommunity/healthandsocialcare/conditionsanddiseases/articles/moreinformationondatasourcesrelatedtocoronaviruscovid19/2020-12-11#antibodies", "link": "https://www.youtube.com/watch?v=HcsHKUZhB4E", "date_published": "2022-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]