[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "9 AMAZING COMMAND LINE TOOLS for Linux", "description": "Get 100$ credit for your own Linux and gaming server: https://www.linode.com/linuxexperiment \n\nGrab a brand new laptop or desktop running Linux:https://www.tuxedocomputers.com/\n\n👏 SUPPORT THE CHANNEL:\nGet access to a weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYouTube: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n📹 MORE VIDEOS FROM ME\nLinux news in Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\nGaming on Linux: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nI'm also on ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n🏆 FOLLOW ME ELSEWHERE:\nTwitter : http://twitter.com/thelinuxEXP\nMastodon: https://mastodon.social/web/@thelinuxEXP\nPixelfed: https://pixelfed.social/TLENick\nDiscord: https://discord.gg/xK7ukavWmQ\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\nThis video is distributed under the Creative Commons Share Alike license.\n\n\n00:00 Intro\n00:33 100$ FREE CREDIT for your Linux or Gaming server\n01:30 trash-cli & rmtrash: put files in the trash\n03:46 autojump: move quickly to often visited directories\n05:31 ranger: terminal file manager\n06:32 the fuck: auto-correcting your mistakes\n08:12 tldr: actually readable man pages\n09:20 caniuse: check which browser supports what\n10:24 eDex-UI: full screen terminal dashboard\n11:32 espeak-ng: make your computer speak\n12:35 gifgen: create gifs from any video file\n13:52 And more!\n14:33 Get a laptop or desktop that runs Linux out of the box\n15:53 Support the channel\n\nGet the GIF from the video: https://nextcloud.thelinuxexp.com/index.php/s/CKSSmrkyB5ENJXo\n\nTrash-cli & rmtrash:\n\nhttps://github.com/andreafrancia/trash-cli\nhttps://github.com/PhrozenByte/rmtrash\n\nThese let you put files in the trash with the command line, and follow the same options and arguments as the rm command, so you can alias one to the other.\n\nThe syntax is really easy, with trash-put to put a file in the trash, trash-list to list all files, trash-restore to restore a file, and trash-empty, well, you guessed what this one does.\n\nAutojump:\n\nhttps://github.com/wting/autojump\n\nThis is a tool that lets you super quickly jump into a specific directory, based on the folders you visit the most. Autojump starts maintaining a database of the folders you visit based on your history, the more you visit a folder, the higher it's weight in the database.\n\nRanger\n\nhttps://github.com/ranger/ranger\n\nIf the ls command is not enough for your file management needs, you can also use ranger. it's a command line file manager that uses the vim keyboard shortcuts to navigate and interact with files.\n\nTheF*ck\n\nhttps://github.com/nvbn/thef*ck  (replace the \"*\" by a \"u\", of course)\n\nSo, the F*ck is a project that will autocorrect your mistakes when you type a command. Let's say you're trying to install a package on Fedora.\n\nIt will work with a LOT of different errors, like mistyping an argument, or command, forgetting an argument, and a lot more stupid mistakes.\n\nTLDR\n\nhttps://github.com/tldr-pages/tldr\n\nAnother super helpful command is TLDR. If you're starting with the command line, or trying to learn a new command, you might find the --help option insufficient, and the man command way too overstuffed with text.\n\nCaniuse\n\nhttps://github.com/sgentle/caniuse-cmd\n\nThere is an easy way to check which browser supports what, with the \"caniuse\" command. You probably already know about the caniuse website, but you can also check it through your terminal, by just typing caniuse followed by the property or feature you want to use.\n\nedex-UI\n\nhttps://github.com/GitSquared/edex-ui/blob/master/README.md\n\nIt basically displays a ton of system information, multiple terminals, your filesystem, your network usage, an on screen keyboard for touch users, and more!\n\nespeak-ng\n\nhttps://github.com/espeak-ng/espeak-ng\n\nespeak-ng lets you type any sentence you like, and have your computer read it. It supports multiple voices, which you can list with the --voices option, and invoke by adding the argument -v followed by the voice name.\n\nGifgen\n\nhttps://github.com/lukechilds/gifgen\n\nThis little tool will let you turn any video file into an animated image, and it lets you specify the framerate, with the -f option, and even select which portion of the video you want to keep, with the -b option to set the beginning time, and the -d option to set the duration.", "link": "https://www.youtube.com/watch?v=kFh1acsQ8DQ", "date_published": "2022-07-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]