[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Life and Death in Assisted Living (full documentary) | FRONTLINE", "description": "​​More and more elderly Americans will be faced with the decision as to whether to spend their later years in assisted living facilities, which have sprung up as an alternative to nursing homes. But is this loosely regulated, multi-billion dollar industry putting seniors at risk? (Aired 2013)\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nIn this major 2013 investigation with ProPublica, FRONTLINE examines the operations of the nation’s largest assisted living company, raising questions about the drive for profits and fatal lapses in care. Assisted living started in the 1980s as a reaction to nursing homes, which had become more oriented toward hospitalization, and as a way of offering seniors more choices and more independence in the way they live. But over the years, assisted living has evolved to house seniors who need specialized care, such as those with memory impairments. That means that people have more needs, require more attention — and, some senior advocates argue, more or better regulations to ensure that the residents are safe and getting the quality of care they need.\n\nExplore additional reporting on \"Life and Death in Assisted Living\" on our website: https://www.pbs.org/wgbh/frontline/film/life-and-death-in-assisted-living/\n\n#Documentary #AssistedLiving \n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nFRONTLINE is produced at GBH in Boston and is broadcast nationwide on PBS. Funding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; the Heising-Simons Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.\n\nCHAPTERS:\nPrologue - 00:00\nThe Rise of Assisted Living - 01:20\nDementia, Alzheimer's & Memory Care - 10:22\nQuestionable Deaths in Assisted Living Facilities  - 15:55\nAssisted Living Employees Speak Out - 24:23\n“This is About Everyone who has Alzheimer's or Dementia”  - 30:50\nA Lawsuit Against Emeritus - 42:15\nCredits - 51:57", "link": "https://www.youtube.com/watch?v=j5wxhOslUfE", "date_published": "2022-07-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]