[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Can SteamOS and Steam Deck make Linux mainstream?", "description": "Download Safing's Portmaster, or subscribe to the SPN, and take control of your network traffic: https://safing.io/portmaster \n\nGrad a brand new laptop or desktop running Linux out of the box: https://www.tuxedocomputers.com/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\nYou can also protect your privacy by using this extension from Startpage, each install helps the channel with a small commission: https://add.startpage.com/en/protection/?campaign=4&source=aff \n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:54 Sponsor: Get your internet connection under control with Safing\n01:49 Linux gaming: it's a thing!\n05:28 Users like ecosystems\n09:47 Desktop mode needs to be on point\n12:12 If SteamOS succeeds, desktop Linux succeeds\n14:20 Gaming CAN be a driving force\n15:51 Sponsor: Grab a laptop or desktop with Linux preinstalled from Tuxedo\n16:52 Support the channel\n\nLinux gaming used to be basically a hack. You had to use Wine to run Steam or any boxed game, it worked on about 5% of the windows library, it was unstable, it performed terribly in most cases, and native Linux games were almost non existent.\n\nEven with native steam, the native Linux ports were NOT the most frequent thing ever.\nValve then changed gears, and introduced SteamPlay, and Proton, with the results we know today: we have 54% of the top 100 steam games running perfectly on Linux, and 41% of the top 1000. At least according to protonDB.\n\nAnd that's where the Steam Deck came: it runs Linux out of the box, it runs a TON of games, it's appealing hardware that fills a niche that just doesn't have competition yet, at least not at that price point, and it's got backing from one of the biggest gaming companies.\n\nAnd the Steam Deck is a PRIME driver to help Linux grow, not only in the gaming space, and also drive growth for the Linux desktop itself.\n.**\n\nWhile more and more Steam Decks ship, more and more users will get used to the amazing features it brings: a nice curated store and experience, great performance, a good user interface with plenty of gaming specific features that you simply can't find on any other desktop OS? including windows. And users will probably expect this kind of experience on their gaming PCs.\n\nThis means that once you've used a steam deck, windows gaming will look like a sub par experience. And this might lead these users to want to use SteamOS on their PCs, or to buy devices that run SteamOS out of the box.\n\nOf course, a gaming PC is still a PC, and people also do non gaming stuff on these devices. And that's where the desktop mode of Steam OS will come into play.\n\nValve doesn't really have an interest to make KDE better, or easier to understand and use, even if SteamOS grows into a major player. It's a secondary feature for them, the main point is to get Steam in more people's hands, and to get them to buy games.\n\nThe first part for all this to succeed, as I said, is drivers: if manufacturers see that SteamOS is used more and more, and if hardware is being sold, in a variety of configurations with SteamOS preinstalled, then there's an incentive to make sure that most stuff works on Steam OS.\n\nThen there's software: developers will want their stuff on SteamOS: from the GPU config tools from Nvidia, AMD, and Intel, the various launchers we already mentioned, which could follow Steam in adding Proton by default and certification methods to let users know what works and what doesn't.\n\nBasically, if SteamOS, a linux based operating system, succeeds, it might just make all other Linux distros better in the process: while we as a community argue on which distro is the best and should be preinstalled, Valve could actually be DOING something to get Linux in the hands of more people.", "link": "https://www.youtube.com/watch?v=kZEHKQ4CmTk", "date_published": "2022-05-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]