[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "9 Things You Didn't Know About Apex Legends", "description": "Since Apex Legends launched in 2019, developer Respawn Entertainment has added a tonne to the game: new legends like Octane and Seer, maps, abilities, lore, you name it. With so much to dig into, here are 9 things you might not know about Apex Legends.\n\n#GameSpot #gaming #ApexLegends\n\n00:00 Introduction\n00:15 Octane's Titanfall 2 speedrun origins\n01:15 Mirage's pork chop recipe\n02:16 How to play Apex Legends in third person\n02:34 Why Titans aren't in Apex Legends\n03:11 Titanfall 2 references in Apex Legends\n04:32 References to other video games\n05:40 Mirage live at the Game Awards 2019\n06:29 Legends' ages\n07:03 The last Titanfall 2 Easter Egg", "link": "https://www.youtube.com/watch?v=8xgnyGrLwOQ", "date_published": "2022-05-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Gotham Knights Gameplay Teased Amid 4 Player Speculation | GameSpot News", "description": "Gotham Knights PSN page mentions 4-player support, Nightwing and Red Hood info is teased, Xbox Network experiences a big server outage and PUBG Mobile and Baby Shark collaboration revealed.\n#GamingNews #GothamKnights #Xbox\n\nWhen Gotham Knights was first announced, one of the key features revealed for the game was co-op gameplay, with a partner player using either Batgirl, Nightwing, Red Hood, or Robin. However an updated listing on the PlayStation store caused some speculation as to whether or not the game would be expanding that co-op to 4 players instead. Well in a statement PCGamesN via Twitter, Warner Bros Games brand manager Devon Newberry confirmed Gotham Knights will “have two-player campaign co-op as announced previously.\n\nOver the weekend, the Xbox Network struggled with some server issues that made some digital games completely unplayable, even offline. Parris Lilly, who has worked with Xbox in the past, said he hopes Microsoft can be more transparent in the future about its digital rights management (DRM) policy and offer new solutions to avoid these types of headaches for players in the future.\n\nBaby Shark, the popular and catchy YouTube song you've involuntarily heard, is teaming up with PUBG Mobile to deliver exclusive themed unlockable items. This is the second collaboration following last year’s, which gave players a Baby Shark emote and allowed them to unlock permanent Baby Shark outfits by sharing the in-game emote in creative ways.\n\n\nSTAMPS\n00:00 - Intro\n00:07 - Gotham Knights\n01:22 - Xbox troubles\n02:30 - PUBG x Baby Shark", "link": "https://www.youtube.com/watch?v=hwWsxl8Wvzs", "date_published": "2022-05-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sword Master Reacts to Elden Ring Weapons", "description": "David Rawlings, a Sword Master and founder of the London Longsword Academy, breaks down some of the weapons from Elden Ring, everything from katanas and flails to giant anchors and turtle shell shields.\n\nFirearms Expert Reacts Playlist: https://youtube.com/playlist?list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you are interested in training with David and team and learn how to swordfight, check out www.londonlongsword.com or send an email to enquiry@londonlongsword.com\n \nIf you would like to see more videos of David Rawlings and the London Longsword Academy (LLA) check out their YouTube channel: https://www.youtube.com/user/LondonLongsword\n \nIf you like swords and martial arts content, follow the LLA on Instagram  Master_at_Arms and Swordfightress or Facebook London Longsword Academy.\n\nTo see more of Da'Mon Stith you can head to www.silentsword.org or check him out on YouTube at https://www.youtube.com/c/DaMonStith\n\nWeapons Featured:\n\nIntro: 00:00\nBroadsword: 00:27\nUchigatana/Katana: 02:57\nNightrider Flail: 04:35\nShotel: 06:40\nRogier's Rapier: 09:18\nZweihander: 12:32\nBattle Hammer & Turtle Shield: 14:18", "link": "https://www.youtube.com/watch?v=nw-aBjRIvVg", "date_published": "2022-05-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]