[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Aoife O'Donovan: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nStephen Thompson | May 9, 2022\nIdeally, musicians recording Tiny Desk (home) concerts adhere to the series’ core concept and perform behind some sort of desk, tiny or otherwise. But, barring that, it helps to make bookshelves your backdrop. When Aoife O’Donovan assembled her band at Portsmouth Book & Bar in Portsmouth, N.H., she made sure to note her surroundings: “It’s great to be here, surrounded by all these books.”\n\nThe Bostonian singer-songwriter, who these days splits her time between a solo career and her work with the Grammy-winning supergroup I’m With Her, has a sound nicely suited for bookish locales: O’Donovan’s warm folk-pop music conjures memories of the Northeast folk boom of the ’90s, the soaring plaintiveness of Indigo Girls and the winsome lilt of modern bluegrass, elevated by a voice that’s searching and friendly.\n\nBacked by guitarist and singer Isa Burke (from the band Lula Wiles), bassist Ethan Jodziewicz (who’s toured with The Milk Carton Kids and others) and drummer Robin MacMillan, O’Donovan performed four songs from her gorgeous new album Age of Apathy. For the title track, they were joined by Virginia’s Yasmin Williams — herself a Tiny Desk veteran, not to mention one of the most inventive and surprising guitarists around.\n\nSET LIST\n“B61”\n“Elevators”\n“Phoenix”\n“Age of Apathy” (feat. Yasmin Williams)\n\nMUSICIANS\nAoife O’Donovan: vocals, acoustic guitar\nIsa Burke: backing vocals, electric guitar, fiddle\nEthan Jodziewicz: bass\nRobin MacMillan: drums\nYasmin Williams: guitar\n\nCREDITS\nVideo: Joe Aidonidis\nAudio: Daniel Schwartz (recording), Darren Schneider (mixing)\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Joshua Bryant, Michael Zamora, Maia Stern, Ashley Pointer\nVP, NPR Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n\n#NPRMusic # TinyDesk #AoifeOdonovan", "link": "https://www.youtube.com/watch?v=HJDx_8PIqxk", "date_published": "2022-05-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]