[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Alien Isolation Devs Reveal New Sci-Fi Heist Game, Hyenas | GameSpot News", "description": "The developers behind Alien Isolation and Total War announce Hyenas, Nintendo reveals more details about Xenoblade Chronicles 3 in a new direct and Forza Horizon 5 gets a major update ahead of the Hot Wheels expansion release.\n#GamingNews #Sega #nintendo \n\nHyenas is a team-based shooter from Creative Assembly that tasks players with robbing high-tech vaults on massive space freighters. Each match has 15 players split into 3 teams of 5 and the loot that is being stolen includes pop culture artifacts. No release date was announced for Hyenas, but if you have a PC and you live in North America or Europe you can sign up for the upcoming alpha on the game’s official website. \n\nToday’s Nintendo Direct laid out the game's story and battle system, focusing on the party's six classes and their abilities. Those classes include: Swordfighter, Zephyr, Medic Gunner, Tactician, Heavy Guard, and Ogre. Nintendo also revealed the Xenoblade Chronicles 3 Expansion Pass, adding over a year's worth of additional content for $30. \n\nForza Horizon’s latest major update adds story mode co-op, a new event, and new Hot Wheels cars and cosmetics ahead of the July expansion's release. \n\nYou can find the full list of patch notes here: https://www.gamespot.com/articles/a-major-forza-horizon-5-patch-is-out-now/1100-6504805/\n\nSTAMPS\n00:00 - Intro\n00:07 - Hyenas\n01:34 - Xenoblade Chronicles 3\n02:20 - Forza Horizon 5 Update", "link": "https://www.youtube.com/watch?v=VsekUJGYmEA", "date_published": "2022-06-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Diablo Immortal Review", "description": "Diablo Immortal is a surprisingly premium-feeling adventure in the series that hits all the right notes, even if its endgame starts to depend on microtransactions too heavily.", "link": "https://www.youtube.com/watch?v=LRuwVGB0OZY", "date_published": "2022-06-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "HYENAS Official Announcement Trailer", "description": "Watch the new cinematic announcement trailer for HYENAS, a new multiplayer sci-fi FPS from Creative Assembly. Team up with your pack to steal priceless pop culture loot from the Mars billionaires and rival crews.\n\nYou can sign up for the alpha: https://www.playhyenas.com/alpha\n\n#hyenas #gaming", "link": "https://www.youtube.com/watch?v=a8Dw8Og8Xjc", "date_published": "2022-06-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sonic Origins Review", "description": "Sonic is back! This time, members of the Sonic Mania team have updated Sonic for 16:9 with Sonic Origins, a Sonic compilation featuring Sonic 1, Sonic 2, Sonic CD, and Sonic 3 & Knuckles. While Sonic Origins isn't the first time we've seen a compilation, it's the first time we've seen Sonic remade from the ground up with an updated aspect ratio. Sonic Origins releases June 23, 2022.", "link": "https://www.youtube.com/watch?v=fa_l5G4maw0", "date_published": "2022-06-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xenoblade Chronicles 3 Nintendo Direct Full Presentation", "description": "Check out the full presentation for Xenoblade Chronicles 3. You'll learn more about the world, its characters (Noah, Eunie, Lanz, Mio, Taion, and Sena) and what to expect. Additionally get a look at a new trailer for the game as well.\n\n#xenoblade #gaming \n\nTimestamps\n0:00 Introduction\n0:01 Xenoblade Chronicle's 3 Passage of Fate Trailer\n5:41 Character Breakdown\n8:28 World Overview\n12:08 Combat Overview\n14:36 Class Breakdown\n17:21 Hero Breakdown\n19:28 Power of Ouroboros", "link": "https://www.youtube.com/watch?v=5LPZ5TpUvzk", "date_published": "2022-06-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fire Emblem Warriors: Three Hopes Review", "description": "Three Hopes features the often repetitive combat style developer Omega Force is renowned for, but enough dedicated Fire Emblem mechanics exist to make it feel like something more than a simple spin-off.", "link": "https://www.youtube.com/watch?v=A5Ef3HbML8c", "date_published": "2022-06-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PS5 Products May Be Revealed Next Week | GameSpot News", "description": "Sony may reveal new hardware for the PS5 next week, Microsoft confirms there is a controller shortage and Call of Duty teases a Terminator collaboration. \n#GamingNews #PS5 #xbox \n\nSony reportedly has more hardware in development, as it's claimed that new headsets and gaming monitors will be revealed in the coming weeks. This gear is said to be part of the new InZone line, and will feature three new headsets designed to cater to various price points.\n\nMeanwhile, Microsoft has now confirmed that there is a shortage of Xbox Controllers.Speaking to VGC, the company has confirmed that \"supply disruptions\" are currently affecting stock, with a large number of big retailers completely sold out. Users on ResetEra recently shared their inability to acquire a new Xbox controller across Europe, and if there were any it was in very limited supply or through scalpers.\n\nSTAMPS\n00:00 - Intro\n00:06 - New PS5 Hardware\n01:43 - Xbox Controllers\n02:41 - COD Terminator", "link": "https://www.youtube.com/watch?v=2vMl9WizTEw", "date_published": "2022-06-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]