[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Rape on the Night Shift (full documentary) | FRONTLINE", "description": "Every night, as most of us head home, janitors across America, many of them women, begin their night shift. They are often alone or isolated in empty buildings — and vulnerable to sexual violence. (Aired 2018)\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nFollowing up on the award-winning collaboration that produced “Rape in the Fields/Violación de un Sueño” in 2013, FRONTLINE, Univision, the Investigative Reporting Program (IRP) at UC Berkeley, Reveal from The Center for Investigative Reporting (CIR) and KQED teamed up to uncover the sexual abuse of immigrant women, often undocumented, who clean the malls where we shop, the banks where we do business and the offices where we work. Drawing on interviews with the women themselves, an attorney for the federal agency that enforces sexual harassment laws in the workplace and a watchdog group that monitors workplace conditions for janitors, the investigation sheds light on an underreported problem — and reveals how employers have fallen short in dealing with it.\n\nLove FRONTLINE? Find us on the PBS Video App, where there are more than 300 FRONTLINE documentaries available to watch any time: https://to.pbs.org/FLVideoApp​ \n\n#Documentary #Frontline #SexualHarassment\n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nFRONTLINE is produced at GBH in Boston and is broadcast nationwide on PBS. Funding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; the Heising-Simons Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.\n\nCHAPTERS:\nPrologue - 00:00\nDanger on the Night Shift - 01:13\nWhen Companies Investigate Sexual Assault - 21:46\nLegislation to Curb Sexual Harassment - 44:54\nCredits - 51:59", "link": "https://www.youtube.com/watch?v=6zeGu_tgw9c", "date_published": "2022-06-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Weinstein (full documentary) | FRONTLINE", "description": "The inside story of how Harvey Weinstein allegedly sexually harassed and abused dozens of women, and the elaborate ways he tried to silence his accusers. (Aired 2018)\n\nFRONTLINE’s documentary investigates the disgraced mogul’s spectacular downfall, and what Hollywood itself knew — and when. With allegations going back to Weinstein’s early years, the film draws on exclusive insider accounts and examines how Weinstein used lawyers and private detectives to help him suppress sexual harassment allegations.\n\nThis journalism is made possible by viewers like you.\n\nSupport your local PBS station here: http://www.pbs.org/donate\n\nLove FRONTLINE? Find us on the PBS Video App where there are more than 250 FRONTLINE documentaries available for you to watch any time:https://to.pbs.org/FLVideoApp\n\nSubscribe on YouTube: http://bit.ly/1BycsJW\n\n#Weinstein #Documentary\n\nEDITOR'S NOTE, from May 22, 2018: An earlier version of \"Weinstein\" contained comments from New York Attorney General Eric Schneiderman that are no longer in this updated film. Since the initial broadcast, Schneiderman resigned amid allegations that he physically assaulted four women.\n\nInstagram: https://www.instagram.com/frontlinepbs\nTwitter: https://twitter.com/frontlinepbs\nFacebook: https://www.facebook.com/frontline\n\nFRONTLINE is streaming more than 200 documentaries online, for free, here: http://to.pbs.org/hxRvQP \n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the John D. and Catherine T. MacArthur Foundation and the Ford Foundation. Additional funding is provided by the Abrams Foundation, the Park Foundation, The John and Helen Glessner Family Trust, the Heising-Simons Foundation, and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation.", "link": "https://www.youtube.com/watch?v=OJ8fsE_GOlg", "date_published": "2022-06-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]