[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Ravyn Lenae: Tiny Desk Concert", "description": "This year, NPR Music is celebrating Black Music Month with an array of brand new Tiny Desk concerts — both from home and from behind our beloved Desk. Together, these artists represent the past, present and future of Black music. This month of carefully curated shows is a celebration of Black artists expressing themselves in ways we've never seen before, and of the Tiny Desk's unique way of showcasing that talent.\n\nAshley Pointer | June 22, 2022\nHearing Ravyn Lenae’s voice resonate from behind the Tiny Desk for one of our first concerts back in the building had me entranced. With her voice raw and unamplified, Lenae and her dynamic band transformed our office into a funky, futuristic space where she was completely in her element. \n\nHailing from Chicago, Lenae dropped her first EP, Moon Shoes, in 2015. Since then, she’s released two more EPs, her sound permeating the world of contemporary R&B and blurring the lines between soul, funk and R&B. This year Lenae reemerged with the release of her debut full length, HYPNOS, already shaping up to be one of the best albums of 2022. \n\nHer Tiny Desk concert commences with three songs off HYPNOS. Opening with “Venom,” an electro-funk song that seethes, Lenae sings: “Why do you play me for a fool?” Her signature falsetto descends over spacey synth melodies while her drummer keeps an insistent, metallicy groove. Then Lenae performs perhaps the most vulnerable songs from her new album, including “Skin Tight,” a melancholic guitar-led ballad that addresses a past romantic relationship and the energy that was once shared, and “Inside Out,” a love letter to herself that channels a ’90s R&B sound with dramatic piano harmonies, a soulful lead melody and dynamic drums. \n\n“I think it’s a lifelong journey, learning to love yourself and trust yourself, and believe in the skin you’re in,” Lenae says of “Inside Out.” “I wrote this song when I wasn’t so sure… that’s why we sing it together.” With a fiercely energetic upsweep, she closes the show with her hit “Sticky.” As she slides into those distinct shrilling oohs, I can’t help but sing along to her catchy hook — all while realizing that only Lenae can do it quite like that. \n\nSET LIST\n“Venom”\n“Skin Tight”\n“Inside Out”\n“Sticky”\n\nMUSICIANS\nRavyn Lenae: vocals\nMarcus Reddick: bass\nDanielle “Dee” Thompson: drums\nHarrison “Achee” Hawkins: keys/MD\nGarrett Jones: guitar\nAja Grant: vocals\nPhylicia Hill: vocals\n\nTINY DESK TEAM\nProducer: Bobby Carter\nAudio Recording & Mix Engineer: Josh Rogosin\nDirector/Editor: Kara Frame\nSeries Creator: Bob Boilen\nVideographers: Kara Frame, Josh Bryant, Michael Zamora, Pierre Kattar\nProduction Assistant: Ashley Pointer\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Jill Britton, Joby Tanseco, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n\n#NPRMusic #TinyDesk #RavynLenae", "link": "https://www.youtube.com/watch?v=KsDT5Wa0hwI", "date_published": "2022-06-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]