[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Omicron variants drive summer increases", "description": "Direct link to Africa videos, https://www.youtube.com/c/WefwafwaAndrew\n\n(Subscribing to Wefwafwa’s channel will help this work)\n\nAnd Ben’s latest update\nhttps://www.youtube.com/watch?v=hrcbQiAbBtQ\n\nOmicron, BA.4 and BA.5 \n\nGrowth advantage, good at evading the immune system\n\nUK\n\nONS\n\nhttps://www.ons.gov.uk/peoplepopulationandcommunity/healthandsocialcare/conditionsanddiseases/articles/coronaviruscovid19/latestinsights\n\n2.07% in England (1 in 50 people) \n\n2.13% in Wales (1 in 45 people) \n\n2.34% in Northern Ireland (1 in 45 people) \n\n3.36% in Scotland (1 in 30 people)\n\nRisk of re-infection\n\nSeven times higher with Omicron (20 December 2021 onwards)\n\nCompared with Delta (17 May to 19 December 2021).\n\nBMJ, Covid-19: Omicron sub variants driving new wave of infections in UK\n\nhttps://www.bmj.com/content/377/bmj.o1506\n\nStart of a new wave of covid infections, BA.4 and BA.5.\n\nCovid infections up 43% week on week\n \nIndependent Sage, Kit Yates, University of Bath\n\nIt is pretty much official from the latest ONS data that the UK has entered the next wave of covid.\n\nIt is most concerning to see that there has been an increase in covid infections in older age groups\n\nHospital admissions, England\n\nUp 31% week on week\n\nBeds occupied, 5,008\n\n1st June, 3,800\n\nDeepti Gurdasani, William Harvey Research Institute\n\nThis is our second wave in six months, and infection has remained very high even between waves.\n\nIt’s hard to predict how large the wave will be\n\nSteve Powis, NHS England medical director\n\nExpects fewer admissions than previous two 2022 surges\n\nWe are likely to see a bit of an increase over the next few weeks\n\nSouth Africa\n\nBA.4 and BA.5 wave has now passe, with fewer hospital admissions and deaths than BA.1 wave in December. \n\nPortugal\n\nBA.5 is now dominant but their wave has just peaked\n\nUnited States\n\nUS, past 2 weeks\n\nCases, down 15%\n\nDeaths, down 11%\n\nHospitalized, up 2%\n\n100,000 cases announced each day in the U.S.\n\n(flat for the month of June)\n\nSouth and West, cases and hospitalizations increasing, Arkansas, Kentucky, Wyoming\n\nMore than 30,000 people hospitalized, up a little on the month\n\nFewer than 350 deaths being reported each day\n\n(2,600 a day at the height of Omicron surge)\n\nMr Biden\n\nhttps://www.nytimes.com/live/2022/06/22/world/covid-19-mandates-vaccine-cases?campaign_id=185&emc=edit_yct_20220622&instance_id=64705&nl=coronavirus-tracker&regi_id=110300449&segment_id=96440&te=1&user_id=0b87b8c1eea981ec0514047bbfa553ca#nyc-kids-vaccines\n\nMeets 17 families and their children (under 5)\n\nmonumental step forward in the nation’s pandemic response.\n\nThis is no time for politics. \n\nIt’s about parents being able to do everything they can to keep their children safe\n\nFinally, some peace of mind", "link": "https://www.youtube.com/watch?v=yKv2z9pFSUs", "date_published": "2022-06-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Vaccination or natural immunity", "description": "COVID-19 vaccine mandates should not discriminate against natural immunity, The unnaturalistic fallacy\n\nhttps://jme.bmj.com/content/48/6/371\n\nCOVID-19 vaccine requirements, debate,\n\npolicies should have recognised proof of natural immunity,\n\nsufficient basis for exemption to vaccination requirements. \n\nArguments\n\nTwo implausible claims about natural immunity: \n\nNatural immunity is superior to ‘artificial’ immunity\n\nIt is better to acquire immunity through natural infection\n\nNaturalistic fallacy (many things are natural, but not good)\n\n(A natural public health strategy, increased overall morbidity and mortality)\n\nWe lack clear and convincing scientific evidence that vaccine-induced immunity has a significantly higher protective effect than natural immunity.\n\nVaccine requirements represent a substantial infringement of individual liberty, and other significant costs\n\nCan only be justified if they are necessary for achieving a proportionate public health benefit. \n\nWithout compelling evidence for the superiority of vaccine-induced immunity, it cannot be deemed necessary to require vaccination for those with natural immunity. \n\n‘vaccine passports’ ‘health passes’ \n\nRationale for vaccine mandates\n\nPreventing healthcare systems becoming overwhelmed, (staff and patients)\n\nReducing community viral transmission\n\nAcquired immunity naturally, potentially equivalent to vaccination immunity\n\nThis is the unnaturalistic fallacy as opposed to the naturalistic fallacy\n\nNatural immunity and vaccine-induced immunity, evidence\n\nEquivalency of Protection From Natural Immunity in COVID-19 Recovered Versus Fully Vaccinated Persons: A Systematic Review and Pooled Analysis\n\nhttps://www.cureus.com/articles/72074-e\n\nAll of the included studies found at least statistical equivalence between the protection of full vaccination and natural immunity; \n\nand, three studies found superiority of natural immunity. \n\nNNT to prevent one annual case of infection in COVID-recovered patients 218\n\nNNT COVID-naïve patients, 6.5\n\n33.5-fold difference in benefit between the two populations\n\nour review demonstrates that natural immunity in COVID-recovered individuals is, at least, equivalent to the protection afforded by complete vaccination of COVID-naïve populations \n\nVaccinations for recovered people, marginal on an absolute basis. \n\nOmicron in adults aged 65 or over\n\nminimal or no effect against mild disease with the Omicron variant from 20 weeks after the second dose of ChAdOx1-S or BNT162b2\n\ndata are beginning to emerge which suggest that the effect of the vaccines on transmission may diminish within a matter of months\n\nImmunological memory to SARS-CoV-2 assessed for up to 8 months after infection\n\nhttps://www.science.org/doi/abs/10.1126/science.abf4063\nImmunological memory is the basis for durable protective immunity after infections or vaccinations. \n\nSubstantial immune memory is generated after COVID-19, involving,\n\nmemory B cells, antibodies, memory CD4+Tcells, memoryCD8+T cells.\n\nCirculating antibody titers were not predictive of T cell memory.\n\nDo not reflect the richness and durability of immune memory to SARS-CoV-2.\n\nReinfection Rates Among Patients Who Previously Tested Positive for Coronavirus Disease 2019: A Retrospective Cohort Study\n\nhttps://academic.oup.com/cid/article/73/10/1882/6170939?login=true\n\nN = 150,325 patients\n\n8,845 (5.9%)\n\n141,480 (94.1%)\n\nProtection against reinfection, 81.8%\n\nProtection against symptomatic reinfection, 84.5%\n\nRisk of SARS-CoV-2 reinfection and COVID-19 hospitalisation in individuals with natural and hybrid immunity: a retrospective, total population cohort study in Sweden\n\nhttps://www.sciencedirect.com/science/article/pii/S1473309922001438\n\nCohort one, 2,039,106 \n\nCohort two, 962,318 one dose\n\nCohort three, 567,810 two doses\n\n767 individuals with natural immunity needed to be vaccinated to prevent one reinfection\n\nProtection against the Omicron Variant from Previous SARS-CoV-2 Infection\n\nhttps://www.nejm.org/doi/full/10.1056/nejmc2200133\n\nProtection from prior infection against severe outcomes from Omicron remained robust, 87.8%\n\nReinfection often occurs with negligible symptoms and high Ct values, indicating reduced epidemiologic significance\n\nThe case for natural immunity exemptions\n\nVaccine requirements have significant costs\n\nSubstantial infringement of individual liberty\n\nThere are non-trivial risks associated with vaccination\n\nThe Biopharmaceutical Industry Provides 75% Of The FDA's Drug Review Budget. Is This A Problem?\nhttps://www.forbes.com/sites/johnlamattina/2018/06/28/the-biopharmaceutical-industry-provides-75-of-the-fdas-drug-review-budget-is-this-a-problem/?sh=5dc27d7649ec", "link": "https://www.youtube.com/watch?v=eGUJJIdjVSQ", "date_published": "2022-06-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]