[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tori Amos: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nAnn Powers | February 2, 2022\nTori Amos' Tiny Desk (home) concert debut takes place in what looks like close quarters. The singer-songwriter whose music has served as a beacon for so many listeners during her thirty-year career sits at her beloved Bosendorfer piano with a star-embellished Wurlitzer at her back. On a nearby shelf is a stack of books; one is Suzanne Simard's classic of forest ecology, Finding the Mother Tree. As Amos begins \"Baker Baker,\" a fan favorite from her 1994 album Under the Pink, her bell-like voice fills the room. It's easy to imagine she's in a lighthouse on the cliffs of Cornwall instead of the state-of-the-art home studio where her husband, engineer Mark Hawley, ensures that the mix will be perfect. This three-song performance shows Amos both alone and reaching out, casting sonic beams to guide us in the dark.\n\nThe other two songs Amos offers are from her characteristically fearless, self-interrogating, soul-integrating 2021 album Ocean to Ocean. Her renditions of the title track and \"29 Years\" are magnetic, but what really makes this set a treat is the commentary she shares before each song. Talking about the growing she's done during lockdown – learning about the climate crisis, confronting her own long-buried trauma – Amos reveals why she remains so beloved. She still knows how to make the most private and even inchoate feelings accessible. Hers is a lighthouse that welcomes the traveler in for a heart-to-heart exchange.\n\nSET LIST\n\"Baker Baker\"\n\"Ocean to Ocean\"\n\"29 Years\"\n\nMUSICIANS\nTori Amos: vocals, keyboard\n\nCREDITS\nVideo: Dave Meyers\nAudio: Mark Hawley\nAssistant Engineer: Adam Spry\nRecorded at Martian Engineering, Cornwall UK\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Kara Frame, Joshua Bryant, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#toriamos #nprmusic #tinydesk", "link": "https://www.youtube.com/watch?v=SufUZu4h_m8", "date_published": "2022-02-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Announcing the 2022 Tiny Desk Contest", "description": "Have you ever wanted to play a Tiny Desk concert? If you’re an unsigned artist, enter our eighth annual Tiny Desk Contest by Monday, March 14, 2022.\n\nTo enter:\nRecord a video of you playing an original song behind a desk.\nUpload your video to YouTube.\nSubmit on our website: npr.org/tinydeskcontest.\n\nMore details: https://tinydeskcontest.npr.org/\nOfficial rules: http://tinydeskcontest.npr.org/rules", "link": "https://www.youtube.com/watch?v=sP192eOTFpU", "date_published": "2022-02-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]