[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "BOTW's Most Anime Combat Of 2022 Explained", "description": "User Breneko obliterates a Guardian in Breath of the Wild, but how did he pull it off? We go behind the scenes and explain how each trick was done step by step. \n\nAt this point you’re probably wondering, “How did they pull this off? And what the heck actually happened?”. You’d be surprised at just how much preparation, creativity, trial and error, and thought went into this simple 20 second Breath of the Wild clip that you would’ve never known without actually understanding what’s happening behind the scenes, so today I’m going to break down exactly what happened step by step, because this brilliance requires a lot more explaining than you might think, and maybe you’ll appreciate it all a lot more when you see all the pieces. \n\nhttps://twitter.com/bre_Neko/status/1522231456814166016\n\nUser Breneko shared this clip on twitter on May 5th, 2022, and dropped many jaws. There’s a total of 7 major glitches used here, such as Trickshotting, Absolute Thunderclap Rushes, Slow Daruk Marking, Guardian Disabling, and Jelly Bouncing are just a few of the tricks used behind the scenes in this mind blowing clip. Even 5 years later, players in Breath of the Wild continue to create amazing ideas.\n\n0:00 Intro\n0:57 Jelly Bouncing Explanation\n1:29 TCR, Mark and Chase Explanation\n2:40 Slow Daruk Marking Explanation\n3:40 Guardian Range Explanation\n4:20 Guardian Disable Explanation\n6:12 Part 1 Recap\n6:28 Trickshot Setup Explanation\n9:56 Part 2 Recap\n10:44 Outro", "link": "https://www.youtube.com/watch?v=xdANqSNm0vU", "date_published": "2022-05-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sword Master Reacts to MORE Elden Ring Weapons", "description": "David Rawlings, a Sword Master and founder of the London Longsword Academy, breaks down some more of the weapons from Elden Ring, everything from spears, morning stars, twinblades and giant anchors.\n\nIf you want to see David's reaction to the more eclectic and fantasy weapons of Elden Ring be sure to like, subscribe and let us know in the comments! \n\nFirearms Expert Reacts Playlist: https://www.youtube.com/playlist?list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you are interested in training with David and team and learn how to swordfight, check out www.londonlongsword.com or send an email to enquiry@londonlongsword.com\n \nIf you would like to see more videos of David Rawlings and the London Longsword Academy (LLA) check out their YouTube channel: https://www.youtube.com/user/LondonLongsword\n \nIf you like swords and martial arts content, follow the LLA on Instagram  Master_at_Arms and Swordfightress or Facebook London Longsword Academy.\n\n#EldenRing #LongSwordExpert #Gaming\n\nWeapons Featured: \n\nIntro: 00:00\nMorning Star: 00:35\nHalberd : 2:43\nHandaxe: 4:49\nSpear and Shield: 6:14\nGiant Anchor: 8:03\nTwinblade: 8:36\nDual Shields: 10:38", "link": "https://www.youtube.com/watch?v=5vmd9g2r3y4", "date_published": "2022-05-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "\"We're Machine Gun Heavy\" - Firearms Expert Reacts To MORE Squad Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down more of the weaponry of Squad, including the Carl Gustav M2, the F89 Minimi and a couple of different AK variants.\n\n#GameSpot #Gaming #ExpertReacts #Squad\n\n0:00 - Opening\n0:37 - L7A2 GPMG\n04:04 - EF88\n05:47 - HK417\n07:25 - AK-74M & AKS-74\n09:23 - Carl Gustav M2\n11:17 - M110 SASS\n12:39 - F89 Minimi\n14:30 - Maximi\n16:29 - RPD\n18:03 - SKS\n20:36 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down more of the guns of Squad and  compares them to their real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=nzkNNvnvIWk", "date_published": "2022-05-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]