[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War Ragnarök: The Mythology Behind Loki", "description": "Ragnarök is soon upon us, specifically God of War Ragnarök, so we’re taking a look at the central figures of the game and looking at their actual story in Norse myth, how it is similar or different to what we’ve already seen in God of War, and what it might mean for Kratos’s ultimate fate. And today, we’re starting with a crowd favorite; Loki.\n\n#godofwarragnarok #loki #norsemythology", "link": "https://www.youtube.com/watch?v=AJtZrBzTJ6Y", "date_published": "2022-10-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "How Dead By Daylight Uses Human Chaos to Scare You | MindGames", "description": "As a multiplayer horror title, Dead By Daylight relies on something unique to keep the game scary years after release--the unpredictable chaos of human nature.\n\nWe sat down with Dave Richard, Creative Director of Dead By Daylight, to discuss the psychology behind its twisted game of hide-and-seek, and how Behaviour Interactive hope to maintain the fear factor across thousands of matches.\n#deadbydaylight #mindgames", "link": "https://www.youtube.com/watch?v=RkMxY7MudcA", "date_published": "2022-10-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Uncharted Franchise Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down more of the weaponry of the Uncharted franchise, including the INSAS rifle, the P90, and an ancient Flintlock pistol.\n\n00:00 - Opening\n00:38 - Raffica (Uncharted 4: A Thief’s End)\n01:57 - Barok .44 (Uncharted 4: A Thief’s End)\n03:15 - Flintlock Pistol (Uncharted 4: A Thief’s End)\n05:52 - Lantern Mounted Flintlock (Uncharted 4: A Thief’s End)\n07:11 - MP34a (Uncharted 4: A Thief’s End)\n08:46 - China Lake Grenade Launcher (Uncharted 4: A Thief’s End)\n09:51 - FAL (Uncharted 4: A Thief’s End)\n11:34 - Beretta ARX-160 (Uncharted 4: A Thief’s End)\n12:49 - INSAS (Uncharted: The Lost Legacy)\n14:50 - P90 (Uncharted: The Lost Legacy)\n16:18 - US-AN 12 Auto Shotgun (Uncharted: The Lost Legacy)\n17:16 - Carrigan 53 (Uncharted: The Lost Legacy)\n18:21 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of the Uncharted franchise and compares them to their real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=qFE94bb7lEM", "date_published": "2022-10-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Minecraft Live 2022", "description": "Minecraft Live 2022 is starting soon, are you ready? Do you have all the snacks you need? Plenty of beverages? It’s important to hydrate! Have you cast your mob vote yet? From October 14, noon EDT you will be able to cast vote until the show starts! Read more and cast your vote here:\r\nhttps://Minecraft.net/live\r\n\r\n#minecraftlive #gaming", "link": "https://www.youtube.com/watch?v=xh_FS3QuOQk", "date_published": "2022-10-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Modern Warfare 2 - Why I'm Cautiously Optimistic", "description": "From Task Force 141's return in the cinematic campaign, to a robust multiplayer, and a fresh clean slate for Warzone 2.0, here are the biggest reasons I'm hyped for Call of Duty: Modern Warfare 2 and a few things that have me concerned.\n\nCall of Duty Modern Warfare 2 is coming real soon and I’ve been waiting for this game ever since the post credits cutscene of 2019’s Modern Warfare. So here’s what I’m looking forward to, and what I’m not looking forward to in both the campaign & multiplayer.\n\nFrom movie style set pieces, to wicked plot twists, and sick villains, the cod campaigns are something I look forward to every release. Call me casual but I know I’m not the only one who was disappointed when Black Ops 4 didn’t have a campaign. Now so far we’ve only seen the reveal of the Dark Water mission and snippets from the brand new campaign trailer released earlier. Dark Water looked dope to me, but some people online felt that it looked like a rehash of the original Modern Warfare’s opening ship mission which, fair! The cutscenes from the new trailer though? Dude seriously, I had to pause and double take because I thought this was a live-action trailer, the cgi and cutscenes look really awesome and I can not wait to bust it out on my shiny Series X or PC. \n\nUnfortunately, in multiplayer, Activision likes to mess with everything it touches, and a big part of me is warily waiting for something to happen with Modern Warfare 2’s live service model, especially from a “give me more money” point of view. If not at launch, then almost certainly in future season passes. Modern Warfare 2019 was really tame at launch when it came to cosmetics and microtransactions with a lot of skins being pretty neat mil-sim style stuff. Then along came Warzone and suddenly we got crazier and crazier skins compounded with Black Ops and Vanguard all transitioning their skins across games.\n\nModern Warfare 2 is right around the corner with a weird rolling launch. We’ve got the campaign coming up first in an early access period, then the official base launch with multiplayer, and Warzone 2.0 at its heels with a November launch. We've all enjoyed our time with the multiplayer beta so far so be sure to subscribe for more guides, gameplay, livestreams, and of course our official review score once the game launches. \n\n\nTimestamps: \n\n0:00 Intro\n0:14 Why I'm Excited for the Campaign\n04:02 - Why I'm Excited for the Multiplayer\n07:32 - Campaign & Spec Ops Concerns\n09:24 - The Activision Problem\n\n\n#gaming #cod #modernwarfare2", "link": "https://www.youtube.com/watch?v=dykkxgTpF9o", "date_published": "2022-10-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]