{"entries": [{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCHnyfMqiRRG1u-2MsSQLbXA", "link": "https://www.youtube.com/watch?v=evUfG3lrk5U", "title": "What Happens If A Star Explodes Near The Earth?", "date_published": "2022-11-15 14:00:19+00:00", "description": "People have witnessed supernovae for millennia, but what threat do they pose to life on Earth? This video is sponsored by Brilliant. You can get started for free, or the first 200 people to sign up via https://brilliant.org/veritasium get 20% off a yearly subscription. \n\n▀▀▀\nA massive thanks to Prof. Hans-Thomas Janka for helping us with the physics of supernovae and GRBs. A massive thanks to Prof. Brian Thomas for all of his help with the terrestrial effects of supernovae and GRBs. This video would not have been possible without them. Also thanks to Dr. Luke Barnes for his initial help with the literature search.\n\nHydrogen bomb vs Supernova fact was taken from this great article by xkcd/Randall Munroe – https://what-if.xkcd.com/73/ (based on the calculation by Andrew Karam, 2002)\n\nCosmic bubble footage from\nhttps://www.cfa.harvard.edu/news/1000-light-year-wide-bubble-surrounding-earth-source-all-nearby-young-stars\n\nNeutrino driven SN explosion simulations from https://iopscience.iop.org/article/10.1088/2041-8205/808/2/L42\n\n▀▀▀\nReferences:\n\nMelott, A. et al. (2019). Hypothesis: Muon radiation dose and marine megafaunal extinction at the End-Pliocene supernova. Astrobiology, 19(6), 825-830. – https://ve42.co/Melott1\n\nThomas, B. C. et al. (2016). Terrestrial effects of nearby supernovae in the early Pleistocene. The Astrophysical Journal Letters, 826(1), L3 – https://ve42.co/Thomas1\n\nMelott, A. L., & Thomas, B. C. (2019). From cosmic explosions to terrestrial fires?. The Journal of Geology, 127(4), 475-481. – https://ve42.co/Melott2\n\nFields, B. et al. (2019). Near-Earth supernova explosions: Evidence, implications, and opportunities. arXiv preprint arXiv:1903.04589. – https://ve42.co/Fields1\n\nThomas, B. C., Atri, D., & Melott, A. L. (2021). Gamma-ray bursts: not so much deadlier than we thought. Monthly Notices of the Royal Astronomical Society, 500(2), 1970-1973. – https://ve42.co/Thomas2\n\nMelott, A. et al. (2004). Did a gamma-ray burst initiate the late Ordovician mass extinction?. International Journal of Astrobiology, 3(1), 55-61. – https://ve42.co/Melott3\n\nFirestone, R. B. (2014). Observation of 23 supernovae that exploded less than 300 pc from Earth during the past 300 kyr. The Astrophysical Journal, 789(1), 29. – https://ve42.co/firestone1\n\nJanka, H. T. (2017). Neutrino emission from supernovae. arXiv preprint arXiv:1702.08713. – https://ve42.co/Janka1\n\nJanka, H. T., & Hillebrandt, W. (1989). Neutrino emission from type II supernovae-an analysis of the spectra. Astronomy and astrophysics, 224, 49-56. – https://ve42.co/Janka2\n\nJanka, H. T. (2017). Neutrino-driven explosions. arXiv preprint arXiv:1702.08825. – https://ve42.co/Janka3\n\nKaram, P. A. (2002). Gamma and neutrino radiation dose from gamma ray bursts and nearby supernovae. Health physics, 82(4), 491-499. – https://ve42.co/Karam1\n\nMelott, A. L., Thomas, et al.. (2017). A supernova at 50 pc: effects on the Earth's atmosphere and biota. The Astrophysical Journal, 840(2), 105. – https://ve42.co/Melott4\n\nLudwig, P., et al. (2016). Time-resolved 2-million-year-old supernova activity discovered in Earth’s microfossil record. Proceedings of the National Academy of Sciences, 113(33), 9232-9237. – https://ve42.co/Ludwig1\n\nGritschneder, et al. (2011). The supernova triggered formation and enrichment of our solar system. The Astrophysical Journal, 745(1), 22. – https://ve42.co/Gritschneder1\n\nMotizuki, Y., Takahashi, et al. (2009). An Antarctic ice core recording both supernovae and solar cycles. arXiv preprint arXiv:0902.3446. – https://ve42.co/Motizuki\n\nZucker, C. et al. (2022). Star formation near the Sun is driven by expansion of the Local Bubble. Nature, 601(7893), 334-337. – https://ve42.co/Zucker1\n\nHirata, K. et al.(1987). Observation of a neutrino burst from the supernova SN1987A. – https://ve42.co/Hirata1\n\nHayes, L. A., & Gallagher, P. T. (2022). A Significant Sudden Ionospheric Disturbance Associated with Gamma-Ray Burst GRB 221009A. Research Notes of the AAS, 6(10), 222.\n\n▀▀▀\nSpecial thanks to our Patron supporters:\nJames Sanger, Louis Lebbos, Elliot Miller, Brian Busbee, Jerome Barakos M.D., Amadeo Bee, TTST, Balkrishna Heroor, Chris LaClair, John H. Austin, Jr., OnlineBookClub.org, Matthew Gonzalez, Eric Sexton, John Kiehl, Diffbot, Gnare, Dave Kircher, Burt Humburg, Blake Byers, Evgeny Skvortsov, Meekay, Bill Linder, Paul Peijzel, Josh Hibschman, Mac Malkawi, Mike Schneider, John Bauer, jim buckmaster, Juan Benet, Sunil Nagaraj, Richard Sundvall, Lee Redden, Stephen Wilcox, Marinus Kuivenhoven, Michael Krugman, Cy 'kkm' K'Nelson, Sam Lutfi\n\n▀▀▀\nWritten by Petr Lebedev & Derek Muller\nEdited by Fabio Albertelli\nAnimation by Fabio Albertelli, Jakub Misiek, Alex Drakoulis, Ivy Tello, Mike Radjabov, and Charlie Davies\nFilmed by Derek Muller\nAdditional Research by Kovi Rose & Katie Barnshaw\nVideo/photos supplied by NASA, ESA, Pond5, and Getty Images\nMusic from Epidemic Sound & Jonny Hyman\nProduced by Derek Muller, Petr Lebedev, and Emily Zhang", "persistent": false, "language": "en-US"}], "source": {"url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCHnyfMqiRRG1u-2MsSQLbXA", "title": "Veritasium"}}