[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Sheku Kanneh-Mason: Tiny Desk Concert", "description": "Tom Huizenga | November 15, 2022\nOne measure of an artist’s popularity is how long it takes to book them for a Tiny Desk concert. In the case of British cellist Sheku Kanneh-Mason, it took about three years. Granted, the pandemic got in the way, but ever since his 2018 breakthrough performance at the wedding of Prince Harry and Meghan Markle, Duchess of Sussex, he’s been -- needless to say -- in demand. Nearly 2 billion people worldwide saw his royal performance on television. \n\nAt the Tiny Desk, Kanneh-Mason played for only a handful of NPR staffers, and the performance felt like a direct communication from his luminous cello (built in 1700) to our heartstrings. It was especially true in Kanneh-Mason’s own arrangement of “Myfanwy,” the mournful Welsh folk song the cellist first heard from his grandmother. Accompanying himself with left hand pizzicato, Kanneh-Mason makes his instrument sing like a sad old Welshman with a tear in his eye. \n\nAside from his expressive playing, Kanneh-Mason excels at arranging pop songs for his instrument. “No Woman, No Cry,” one of his calling cards, explores the tender and bittersweet side of the Bob Marley classic.  \n\nStill only 23, Kanneh-Mason’s stature commands the attention of composers. Last year, the fine young Brit Edmund Finnis wrote a set of solo preludes for Kanneh-Mason. The music reveals the cello’s many voices, from growling urgency to supple soliloquy to full-throated cry. \n\nWhile we can’t guarantee 2 billion views on our platforms, those who do watch this Tiny Desk performance will witness a rising young star who, whether he knows it or not, represents nothing less than the future of classical music.\n\nSET LIST\nBob Marley: “No Woman, No Cry” (arr. Sheku Kanneh-Mason)\nEdmund Finnis: Preludes I-III for solo cello\nJoseph Parry: “Myfanwy” (arr. Sheku Kanneh-Mason)\n\nMUSICIANS\nSheku Kanneh-Mason: cello\n\nTINY DESK TEAM\nProducer: Tom Huizenga\nDirector/Editor: Joshua Bryant\nAudio Engineer: Andie Huether\nAudio Mix: Josh Rogosin\nCreative Director: Bob Boilen\nSeries Producer: Bobby Carter\nVideographers: Joshua Bryant, Sofia Seidel\nAudio Assistant: Hannah Copeland \nProduction Assistant: Jill Britton\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Kara Frame, Maia Stern, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #shekukannehmason", "link": "https://www.youtube.com/watch?v=8Yu6CQcnQ_A", "date_published": "2022-11-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]