[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Warzone 2.0 Opening Cinematic", "description": "With CoD: Warzone 2.0 launching today, check out the opening cinematic showcasing the new map Al Mazrah.\n\n#callofduty #warzone #gaming", "link": "https://www.youtube.com/watch?v=992B3EFY8NY", "date_published": "2022-11-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Evil West Everything To Know", "description": "Evil West brings dangerous vampires to the American frontier, and its your job to take care of it. Here's everything to know about Evil West. \n\nEvil West is an action filled, gory, fast paced, third-person shooter with a narrative driven linear campaign. So it goes without saying, you’ll be doing a lot of shooting alongside a healthy mix of melee as well.\n\nEvil West features an online co-op for the entire campaign, but only the host progresses the story. Both you and a friend will play as Jesse and encounter challenges with slightly different enemy composition than when playing alone.\n\nEvil West is releasing on PS4, PS5, Xbox One, Series X|S and PC on November 22, 2022.\n\nTimestamps:\n0:00 Intro\n0:12 Gameplay\n0:53 Plot\n2:08 Multiplayer\n2:31 Development\n3:06 Outro", "link": "https://www.youtube.com/watch?v=P3s4vr4fqTo", "date_published": "2022-11-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "First 21 Minutes of Bendy and the Dark Revival Gameplay", "description": "Return to the kingdom of Bendy in the ink soaked horror survival game Bendy and the Dark Revival.\nHere are the first 21 minutes of PC gameplay.\n\n#bendyandtehdarkrevival #gaming", "link": "https://www.youtube.com/watch?v=6teqN9MOBFA", "date_published": "2022-11-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 Phantom Liberty DLC Confirmed To Be Paid | GameSpot News", "description": "CD Projekt Red confirms Cyberpunk's Phantom Liberty DLC will have a price tag, and details on how Modern Warfare 2 and Warzone 2's shared battle pass will work.\n#Cyberpunk2077 #Gaming #Warzone2 \n\nFor anyone hoping that Cyberpunk 2077’s big DLC expansion, Phantom Liberty, was going to be a free addon, guess again, as CD Projekt Red’s global PR director Radek Grabowski has confirmed that if will have a pricetag.\n\nSo much for liberty. Although I guess they did say it was a phantom.\n\nSpeaking to GamesRadar, Grabowski confirmed that \"as for the expansion's pricing - we have not revealed exact details yet, but it will be a paid one.\"\n\nWhile we don’t have any specific pricing information for the DLC, expansions for The Witcher 3, Hearts of Stone and Blood and Wine, cost $10 and $20 at their time of release, respectively, with the latter being a much bigger expansion.\n\nLike The Witcher 3--which has a free next-gen update on the way--Cyberpunk 2077 also received a substantial amount of free DLC after launch, with the Edgerunners update providing a notable amount of free cosmetics, weapons, and even an extra narrative thread.\n\nSomething that will be free is Call of Duty Warzone 2.0, which recently revealed that its battle pass is nonlinear, but we now have new details on exactly how that will work.\n\nInstead of having a linear pass of 100 tiers of unlockable items, Season 1 of Modern Warfare 2 reinvents the battle pass as a multi-sector combat map. The map has at least 20 sectors with five items in each sector. Players will unlock items using earned Battle Token Tier Skips across this map, with the freedom to choose their path and focus on the items they want most.\n\nThe Season 1 battle pass will still include 20 free tiers for players to unlock, which include the Victus XMR sniper rifle and the BAS-P submachine gun as this season's new unlockable weapons. Activision says it will take players 15 Token Tier Skips if they head straight from the map's first sector toward sectors A6 or A7, and 30 to unlock both weapons. As for the season's new operator, the pass introduces Zosar \"Zeus\" Kalu as the operator available within the premium tiers of pass. Zeus is an instant unlock when purchasing the premium battle pass.\n\nThe Season 1 pass is divided into 21 different combat sectors, from A0 to A20. Sectors A1 to A20 are all connected to each other. Once players have unlocked all the rewards in all combat sectors from A0 to A20, there's an additional \"victory sector\" with bonus rewards. The battle pass contains 1,400 total CoD Points. Players can earn 400 free CP within the pass, plus 1,000 more with premium pass and victory sector, allowing players to earn back the CoD Points spent purchasing the full pass.", "link": "https://www.youtube.com/watch?v=NikVjKRO21U", "date_published": "2022-11-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Scarlet & Pokémon Violet Official Overview Trailer", "description": "Learn about the world of Pokémon Scarlet & Pokémon Violet, including different features of the new open-world experience, Pokémon and Trainers you’ll meet, and more! \n\nBegin your adventure in the Paldea region when Pokémon Scarlet & Pokémon Violet release on November 18th!  \n\n#pokemonscarletandviolet #pokemon #gaming", "link": "https://www.youtube.com/watch?v=NW7wjoSNKXM", "date_published": "2022-11-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Scarlet and Violet Everything to Know", "description": "From how multiplayer works, to how to use the new terastal mechanic, here's everything you need to know about Pokémon Scarlet and Violet.\n#gaming #PokemonScarletViolet #gamespot \n\nWith the new open-world approach in Pokemon Scarlet and Violet, the linear structure of past entries in the franchise has changed as well. Instead of a single story, you can pursue one of three major questlines: Victory Road, the Path of Legends, and Starfall Street.\n\nVictory Road is the most recognizable and classic quest in Pokemon, as you vie to be the very best (like no one ever was) by conquering regional gym leaders and, presumably, the Elite Four. This time you can pick which order to challenge the gym leaders, though, which means the difficulty balancing may be very different this time. In the one gym challenge we've seen, you didn't even battle a series of NPCs in the gym--instead, you play a brief hide-and-seek game with some Pokemon and then challenge the gym leader 1-on-1. This could mean that gyms are more based around themed activities, rather than battle gauntlets, much like the trials of Pokémon Sun and Moon.\n\nThe Path of Legends revolves around researching gargantuan Pokemon known as Titans. There are a set number of these massive Pokemon roaming about, and you'll need to follow the clues to track them down and beat them in battle for research purposes. This may be the path we know the least about, because even in our hands-on preview we were restricted from seeing the conclusion of the battle against a gigantic Klawf.\n\nFinally, Starfall Street is the new way of challenging the new antagonist, Team Star. These encounters are no longer woven in and out of the story. Instead, Team Star has set up outposts of their own and you'll need to enter a special area to challenge them. In our time with the game, the one Team Star challenge was to take down a certain number of enemy Pokemon within a time limit, which then led to battling the leader of that Team Star outpost.\n\nTimestamps: \n00:17 - The new region, Paldea\n01:01 - The open world\n02:07 - New features\n04:42 - Path of Legends, Victory Road, and Starfall Street\n06:28 - The Pokédex https://www.gamespot.com/gallery/every-confirmed-pokemon-for-pokemon-scarlet-and-violet-so-far/2900-4413/\n07:19 - Release date", "link": "https://www.youtube.com/watch?v=7aX40rQEuhw", "date_published": "2022-11-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "World of Warcraft: Dragonflight Launch Cinematic Trailer", "description": "Check out the latest launch cinematic trailer for World of Warcraft: Dragonflight \"Take to the Skies\".\n\n#worldofwarcraft #dragonflight #gaming", "link": "https://www.youtube.com/watch?v=6VQB5xFItOA", "date_published": "2022-11-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]