[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "How to run Windows apps on Linux with Bottles", "description": "Download Safing's Portmaster, or subscribe to the SPN, and take control of your network traffic: https://safing.io/portmaster\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\nYou can also protect your privacy by using this extension from Startpage, each install helps the channel with a small commission: https://add.startpage.com/en/protection/?campaign=4&source=aff \n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:58 Sponsor: Secure your internet connection with Safing\n01:53 What is WINE\n04:36 Bottles: a GUI for WINE\n06:07 Creating a Bottle\n08:07 Automated Installers\n09:14 Manual installs and configurations\n12:31 Parting Thoughts\n13:56 Sponsor: Get a Linux laptop or Desktop from Slimbook\n14:37 Support the channel\n\n\nWine is basically an almost complete reimplementation of multiple Windows APIs in a format that Linux can understand. So you're not running a virtual machine, or emulating the system, you HAVE a whole windows environment, except it's not developed by Microsoft, and you don't need a copy of windows to use it.\n\nWine creates a fake C drive inside your home directory, in the .wine hidden folder, and stores everything here.\n\nDo note that Wine does NOT protect you from viruses. Ransomware and other weird malware can still access your fake C drive, and sometimes even the regular folders in your /home directory on Linux, so don't use it to try some weird stuff you downloaded off the internet, cause it's still not safe.\n \nBottles is a graphical user interface that sits on top of Wine. It lets you handle each program in its own \"Bottle\", a bottle being a wine prefix, with different rules, dependencies, libraries, and settings, so each app can run optimally without risking breaking the other ones you're using. It also lets you use Proton to run games that aren't available on Steam, for example, or if you have boxed copies of various games.\n\nThe first step to install anything will be to create a bottle to run the application in. The \"+\" button lets you do that, and you'll get a nice graphical window to let you pick between a Gaming focused bottle, which will have a lot of tweaks specifically for running games, an Application Bottle, with improvements for running desktop apps, or a custom one that has no specific tweaks, so you can experiment yourself. Just select the appropriate Bottle type, enter its name, and click the \"Create\" button that appeared in the top right corner.\n\nOnce the Bottle is created, you can either straight up select an executable you'd have downloaded yourself, and run it, or you can go into more detail.\n\nFor now, Bottles only has a few installers that are mostly gaming related, but that list can expand, as anyone can contribute one of these, so I'd be surprised if we didn't see a lot of installers appearing pretty soon, especially for the most used windows apps.\n\nThese installers all have a rating, from platinum to bronze, letting you know how well the program will run, just like what you could find on protonDB. Platinum means it should run exactly as on Windows, and Bronze means it will run, but expect a few glitches here and there or some performance problems.\n\nIf your favorite program doesn't have an automatic installer script yet, you can configure your own Bottle manually. Just create a Custom Bottle, and head over the the details page.\n\nHere, you'll find a ton of stuff you can configure or install.\n\nLink to article about MS Office on Linux: https://ruados.github.io/articles/2021-05/office365-wine", "link": "https://www.youtube.com/watch?v=VqDgrHCPWG8", "date_published": "2022-04-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]