[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Here's What Other Games Should Steal From Elden Ring", "description": "From Software's games have always had a somewhat niche audience, but with the release of Elden Ring, the size of that audience seems to have exploded. The Soulsborne formula works exceedingly well when applied to the template for open-world games, it turns out. In fact, you could argue that it's exploring a strange and enormous world, rather than the usual Souls-style difficulty and mechanics, that makes Elden Ring so fun.\n\nThe open-world genre is pretty expansive, and as with major winners before it, like Ubisoft's Assassin's Creed games or Nintendo's The Legend of Zelda: Breath of the Wild, Elden Ring is sure to leave a mark on the field. The question is, what should the rest of the open-world genre learn from Elden Ring?", "link": "https://www.youtube.com/watch?v=GXiTqw3sQM4", "date_published": "2022-04-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "KINGDOM HEARTS 4 REVEAL AND KINGDOM HEARTS 20th ANNIVERSARY TRAILER", "description": "Check out the announcement trailer for Kingdom Hearts IV as well as some trailers to celebrate the 20th anniversary for the series.\n\n0:00 Intro\n4:04 Kingdom Hearts IV Reveal Trailer", "link": "https://www.youtube.com/watch?v=Xs-AUVLCMA8", "date_published": "2022-04-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "\"This Rifle Fires WHAT?\" - Firearms Expert Reacts to EVEN MORE Team Fortress 2 Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down more of the weaponry of Team Fortress 2, including the Loose Cannon, the Air Strike rocket launcher, and a sniper rifle that fires urine.\n\n00:00 - Opening\n00:46 - The Soda Popper\n02:19 - Baby Face’s Blaster\n04:09 - Pistol\n06:04 - The Air Strike\n06:54 - Genuine Nostromo Napalmer\n07:36 - Loose Cannon\n09:42 - Mini-Sentry\n10:57 - Frontier Justice\n12:14 - The Sydney Sleeper\n13:53 - The Cleaner’s Carbine\n14:58 - Revolver\n16:56 - The Righteous Bison\n18:00 - The Huo-Long Heater\n20:18 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down more of the guns of Team Fortress 2 and compares them to their real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=2N4WM_fykqU", "date_published": "2022-04-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "FPS Games Are In A Strange Place Right Now", "description": "First-person multiplayer shooters are in a strange place right now, it’s time to talk about recent changes to Call of Duty, Battlefield, and Fortnite.\n\nMultiplayer shooters are in a strange place right now. We've seen some fascinating recent successes, as well as failures. There are games like Call of Duty: Modern Warfare 2019 and Warzone that succeeded and then shot themselves in the foot. There are developers who didn’t listen to the community and saw their games fail hard, like with Battlefield 2042. And there are games that might seem like they've gone on longer than their concepts should allow, but still have new ideas to offer, like Fortnite. \n\nThis video deals with how Call of Duty could finally KO Battlefield with its larger maps and modes. We’ll dig into Vanguard’s new Arms Race mode and how it succeeds in many places that Battlefield's 128-player Conquest mode failed. We’ll also talk about what’s still holding Call of Duty back. After that, we’ll dive into what changes Battlefield 2042 is finally starting to deliver through developer DICE's core feedback initiative, and whether there’s hope for the game's future. Finally, we’ll check in on Fortnite’s permanent no-build mode called Zero Build and how the Battle Royale still manages to stay fresh, largely by borrowing ideas from other games. Fortnite continues to be an evolving game that gives players a lot to do outside of chasing that win.\n\nCall of Duty: Vanguard and Warzone Pacific are out now on all major platforms, with the next Modern Warfare expected to release at the end of this year. Battlefield 2042’s Season One has been delayed till Summer. Fortnite’s Zero Build mode is out now.\n\nTimecode:\n00:00:33 - Battlefield\n00:06:23 - Fortnite \n00:10:43 - Call Of Duty", "link": "https://www.youtube.com/watch?v=LcKeqxpgy08", "date_published": "2022-04-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]