[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "13 Things We Wish We Knew Before Playing Rainbow Six Extraction", "description": "Rainbow Six Extraction is a challenging co-op spinoff from Rainbow Six Siege. We walk you through 13 tips on how to keep your favorite operators alive in their fight against aliens.\n\nRainbow Six Extraction reimagines the tight, team-focused world of Rainbow Six Siege as an unforgiving PvE experience where teams of three take on an alien threat known as the Archaeans. In Extraction, it's team up or die, but the finer details go far beyond that: Simply surviving is only the beginning. In time, you'll want to thrive, because the best Operators will walk away bathed in XP, rather than crawling for the exit. In this beginner's guide, we walk you through 13 tips for not only making it out alive, but doing it efficiently too.", "link": "https://www.youtube.com/watch?v=Moa5a_5XLV4", "date_published": "2022-01-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best Speed Running Moments From GDQ", "description": "Want to see how to beat games fast? Games Done Quick, or GDQ, is an annual event showcasing the best speed running in video games has to offer. Whether it be playing Punch-Out!! Blindfolded or some of the best runs we've ever seen in games like Super Mario 64 and Bloodborne. Here are the highlights and best moments from AGDQ 2022 and even from historical GDQ's leading up to it.\n\nTime Stamps:\n0:22 - Mike Tyson's Punch-Out!! Blindfolded\n1:46 - Mario 64 Blindfolded\n3:39 - Sekiro Blindfolded\n5:16 - Super Metroid 4-way Race\n7:13 - Hades Race\n8:33 - Dark Souls Race\n11:53 - Stardew Valley\n13:23 - Casio Mario World\n15:44 - It Takes Two\n17:43 - Resident Evil Village\n20:00 - Bloodborne\n21:20 - TASBot plays Brain Age\n22:55 - Hollow Knight\n24:41 - Raising $3,000,000", "link": "https://www.youtube.com/watch?v=MTIqjXeMTIU", "date_published": "2022-01-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Every Major Franchise Xbox Now Owns", "description": "Microsoft's $68.7 billion acquisition of Activision Blizzard is the largest buyout in video game history. Here's every major franchise and studio Xbox now owns.\n\nMicrosoft has been spending a lot of money recently to bolster its first party studios. In 2020, Microsoft acquired ZeniMax/Bethesda for $7.5 billion, turning Xbox into the home of iconic franchises like Elder Scrolls (Skyrim), Fallout, and Doom. With this record breaking acquisition of Activision Blizzard, Microsoft now owns juggernaut franchises like Call of Duty, World of Warcraft, Overwatch, and Candy Crush. \n\nXbox has been building its catalog of first party studios with Double Fine (Psychonauts 2), Ninja Theory (Hellblade), and The Initiative (Perfect Dark) over the past few years. With Activision Blizzard under its belt, Microsoft now owns over 30 studios.\n\nMicrosoft is buying Activision Blizzard at the height of a lawsuit filed by the California Department of Fair Employment and Housing against the company for sexual harassment and discrimination directed toward women at the company, with much of the attention falling on the shoulders of Activision's CEO Bobby Kotick. \n\nUntil the deal closes in 2023, Activision Blizzard will operate independently, but after, Bobby Kotick will leave the company, with Activision Blizzard reporting to Phil Spencer as the CEO of Microsoft Gaming.", "link": "https://www.youtube.com/watch?v=UkYe4pRaSQI", "date_published": "2022-01-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Ex FBI Agent Reacts To L.A. Noire | Expert Reacts", "description": "Joe Navarro, former FBI agent and body language expert, breaks down The Golden Butterfly homicide case from Rockstar's L.A. Noire.\n\nJoe Navarro is a former FBI agent, spy-catcher, expert on non-verbal communication, and the author of 13 books including the international bestseller What Every Body Is Saying. In the above video, Joe uses his non-verbal expertise to react to L.A. Noire's iconic face rendering technology, and breaks down how accurately the game captures non-verbal communication in its interviews and interrogations. Having worked many years in homicide as an FBI agent, Joe also has insight as to how accurate L.A. Noire portrays investigating a crime scene.\n\nIf you're interested in learning more about Joe Navarro, visit his website here: https://www.jnforensics.com/\n\nYou can follow him on Twitter here: https://twitter.com/navarrotells\n\nYou can also find his books for purchase here: https://www.jnforensics.com/books", "link": "https://www.youtube.com/watch?v=9xCHv9G0ZfE", "date_published": "2022-01-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Microsoft Nerfs Sony’s Value After Announcement | GameSpot News", "description": "In today’s episode of GameSpot News, Persia talks about Sony’s market value dropping by $20 billion after Microsoft's big acquisition, Battlefield 2042 getting another big patch, and more. \n\nSony Group Corp. share fell by as much as 13% after the Microsoft deal was made public, effectively wiping $20 billion off Sony’s valuation. In contrast to Sony's rocky Tuesday, Japanese publishers such as Capcom, Konami, and Square Enix saw their stock rise by more than 5% on Tokyo's financial markets.\n\nDICE has released the full patch notes for Battlefield 2042's next big update. The 3.2 update is releasing on January 20, and it includes bug fixes and stability improvements, fixes for hit-registration issues, and more.\n\nLastly, Persia talks about the new trailer Sony released for Horizon Forbidden West. the latest trailer focuses on just what spurs Aloy to embark on a new adventure and the dangers that lie hidden in the sinister landscape of the game.\n\nFor more information on all of our topics, please visit gamespot.com.\n\nTimestamps:\nIntro - 00:00\nSony - 00:08\nBattlefield 2042 - 01:23\nHorizon Forbidden West - 02:35\nOutro - 04:14", "link": "https://www.youtube.com/watch?v=xHQSIL7msYg", "date_published": "2022-01-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Horizon Forbidden West Cinematic Story Trailer (4K)", "description": "Discover what lies ahead for Aloy in the Forbidden West...\n\nHorizon Forbidden West is coming to PlayStation4 and PlayStation5 consoles on 18 February 2022. \n\nExplore distant lands, fight bigger and more awe-inspiring machines, and encounter astonishing new tribes as you return to the far-future, post-apocalyptic world of Horizon. \n\n#HorizonForbiddenWest", "link": "https://www.youtube.com/watch?v=zWdv2wE7064", "date_published": "2022-01-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "January Game Pass Games Confirmed | GameSpot News", "description": "More Xbox Game Pass releases are confirmed for January, Game Pass reaches 25 million subscriptions, and Halo Infinite Cyber Showdown event begins. \n\nIn this video, DeVante talks about the next wave of Xbox Game Pass titles for January has now been confirmed following a leak. January 2022 has already been a massive month for Game Pass, with Mass Effect: Legendary Edition, Spelunky 2, and The Outer Wilds landing on the subscription service earlier this month.\n\nDeVante also talks about Microsoft announcing that Xbox Game Pass now has more than 25 million subscribers globally. Later in the video he explains Halo Infinite's new Cyber Showdown event which will last until January 31, 2022 and features a new mode called Attrition.\n\nSTAMPS\n00:00 - Intro\n00:07 - More Game Pass Games\n00:48 - Game Pass Milestone\n01:24 - Halo Infinite Cyber Showdown Event", "link": "https://www.youtube.com/watch?v=MQpfeWVNqIg", "date_published": "2022-01-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Rainbow Six Extraction Review", "description": "Though progression feels too closely tied to a mediocre challenge system, Rainbow Six Extraction offers fun incursions against a parasitic alien threat and rewards teamwork.\n\nTo read the full written review check it out at GameSpot: \nhttps://www.gamespot.com/reviews/rainbow-six-extraction-review-get-in-get-out/1900-6417814/\n\n#RainbowSixExtraction", "link": "https://www.youtube.com/watch?v=TC2u_UJxGEk", "date_published": "2022-01-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Total War: Warhammer 3 - Preview", "description": "Total War: Warhammer 3 contains some of the biggest and most interesting additions to the franchise. 8 playable races and the biggest game world to date, as well as changes to siege battles, diplomacy and a slew of other new features and quality of life changes. We got to play a few hours of the final preview of Total War: Warhammer 3, getting hands-on with the factions of Grand Cathay as well as the newly announced Chaos Undivided demon prince commanding forces from Nurgle, Khorne, Tzeentch and Slaanesh. Here's what GameSpot's resident Warhammer nerd Dave Jewitt thought.", "link": "https://www.youtube.com/watch?v=JfV2UlFgG-U", "date_published": "2022-01-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]