[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Dollars and Dentists (full documentary) | FRONTLINE", "description": "Dental care can be a matter of life or death. Yet millions of Americans either don’t have dental insurance or simply can’t afford to see a dentist. The result? Severe pain, preventable disease, humiliation, bankruptcy and sometimes even death. (Aired 2012)\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nIn a 2012 joint investigation by FRONTLINE and the Center for Public Integrity, correspondent Miles O’Brien uncovers the shocking consequences of a broken dental care system. Poor children, entitled by law to dental care, often cannot find a dentist willing to see them. Others kids receive excessive care billed to Medicaid, or major surgery for preventable tooth infections. For adults with dental disease, the situation can be just as dire and bankrupting. While millions of Americans use emergency rooms for dental care, corporate dental chains are filling the gaps in care, and in some cases have allegedly overcharged patients or loaded them with high priced credit card debt. \n\nLove FRONTLINE? Find us on the PBS Video App, where there are more than 300 FRONTLINE documentaries available to watch any time: https://to.pbs.org/FLVideoApp​ \n\n#Documentary #DollarsAndDentists\n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=oBJkI4LyBgg", "date_published": "2022-01-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]