{"entries": [{"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/twoje-pieniadze/prezes-ure-zatwierdzil-taryfy-rzad-zamrozil-ceny-oto-co-zobaczymy-na-rachunkach/l9phlhs", "title": "Prezes URE zatwierdził taryfy, rząd zamroził ceny. Oto co zobaczymy na rachunkach", "date_published": "2022-12-17 21:11:00+00:00", "description": "Zatwierdzone taryfy na prąd oznaczają, że przyszłoroczne rachunki rodziny zużywającej przeciętnie 2 tys. kWh rocznie wyniesie ok. 300 zł więcej niż w tym roku — wynika z wyliczeń ekspertów portalu WysokieNapiecie.pl. Tauron równocześnie informuje, że zamrożenie cen prądu zatrzyma w kieszeni takiej rodziny ok 2 tys. zł.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/prezes-ure-zatwierdzil-taryfy-ale-nie-wszystkim-sie-podobaja-enea-bedzie-wnioskowac-o/pv1gl3x", "title": "Prezes URE zatwierdził taryfy, ale nie wszystkim się podobają. Enea będzie wnioskować o podwyżkę", "date_published": "2022-12-17 20:24:49+00:00", "description": "Prezes Urzędu Regulacji Energetyki zatwierdził taryfy na przyszły rok, ale jeden z państwowych dostawców jest niezadowolony z jej poziomu i będzie wnioskował o zgodę na wyższe ceny. Enea wskazała bowiem, że zatwierdzony poziom może poskutkować niemal pół miliardem złotych strat spółki.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/biznes/powrotu-do-tego-co-bylo-juz-nie-ma-szefowa-microsoftu-w-polsce-o-przyszlosci-pracy/02k660m", "title": "\"Powrotu do tego, co było, już nie ma\". Szefowa Microsoftu w Polsce o przyszłości pracy", "date_published": "2022-12-17 19:34:31+00:00", "description": "Powrotu do tego, co było, już nie ma. Dziś tworzymy nową rzeczywistość, która, w moim odczuciu, będzie rzeczywistością hybrydową — w ten sposób o tym, jak wyglądać będzie nasza praca, mówi  szefowa Micorosfotu w Polsce Dominika Bettman. Jak dodaje, \"nie wyobraża sobie przymusu\" w ściąganiu pracowników do biur. Menedżerka w rozmowie z BI Polska odnosi się także do fali zwolnień w bigtechach, roli technologii w naszym życiu oraz roli pokolenia Z na rynku pracy.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/kolejny-kraj-rezygnuje-z-kupowania-gazu-od-gazpromu/xvghvr7", "title": "Kolejny kraj rezygnuje z kupowania gazu od Gazpromu", "date_published": "2022-12-17 19:25:52+00:00", "description": "Władze Mołdawii poinformowały, że po raz pierwszy od odzyskania niepodległości w 1991 r. sprowadzą gaz spoza Rosji. Równocześnie zapewniły, że nie będą więcej kupowały błękitnego paliwa od Gazpromu.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/premier-apeluje-o-zakonczenie-sporu-z-bruksela-ostrzega-przed-rynkami-finansowymi/x28bpkk", "title": "Premier apeluje o zakończenie sporu z Brukselą. Ostrzega przed rynkami finansowymi", "date_published": "2022-12-17 18:55:00+00:00", "description": "Premier Mateusz Morawiecki zaapelował o jak najszybsze zakończenie sporu z Komisją Europejską. Jego najnowszy wpis na Facebooku wpisuje się w spór o przyjęcie nowelizacji ustawy o Sądzie Najwyższym. Szef rządu równocześnie ostrzegł przed reakcję rynków finansowych.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/niemcy-uruchomili-pierwszy-terminal-lng-gaz-plynie-do-wilhelmshaven/lb55gnm", "title": "Niemcy uruchomili pierwszy terminal LNG. Gaz płynie do Wilhelmshaven", "date_published": "2022-12-17 18:38:00+00:00", "description": "Niemcy uruchomili pierwszy terminal LNG. Kanclerz Olaf Scholz zapewniał, że dzięki dostawom gazu poprzez Wilhelmshaven i inne dopiero budowane terminale, gospodarka Niemiec stanie się \"niezależna od rurociągów z Rosji\".", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/egipskie-mumie-ze-zlotymi-jezykami-mialy-pomagac-w-rozmowie-z-ozyrysem/kkhqtpv", "title": "Znaleziono egipskie mumie ze złotymi językami. Miały pomagać im w rozmowie z Ozyrysem", "date_published": "2022-12-17 17:25:22+00:00", "description": "Na południu od Kairu znaleziono starożytne egipskie mumie ze złotymi językami w ustach. Na kościach niektórych szczątków znaleziono również złote płatki, co sugerowałoby, że ciała posypano złotem.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/lifestyle/chorwacja-trzecia-ekipa-mundialu-federacja-zarobila-27-mln-dol/5nprvld", "title": "Chorwacja trzecią ekipą mundialu. Federacja zarobiła 27 mln dol.", "date_published": "2022-12-17 16:59:00+00:00", "description": "Reprezentacja Chorwacji po zwycięstwie nad drużyną narodową Maroka zdobyła brązowy medal piłkarskich mistrzostw świata w Katarze. Tym samym chorwacka federacja wzbogaciła się o 27 mln dol.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/finanse/litwini-szturmuja-polskie-sklepy-powodem-polski-zloty-i-nizszy-vat-na-zywnosc/jrrepjb", "title": "Graniczny cud cenowy. Litwini szturmują polskie sklepy i zostawiają tu miliony", "date_published": "2022-12-17 15:44:00+00:00", "description": "Ceny litewskich produktów po polskiej stronie granicy są dużo niższe niż na samej Litwie. To zaś sprawia, że polskie sklepy są szturmowane przez klientów zza granicy. Eksperci podkreślają, że jednym z powodów jest wykoszenie małych sklepów przez sieci handlowe.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/od-tej-ustawy-zaleza-losy-kpo-kaczynski-o-tym-co-dalej/mn6xp6n", "title": "Od tej ustawy zależą losy KPO. Kaczyński o tym co dalej", "date_published": "2022-12-17 14:59:00+00:00", "description": "Zmiany w sądownictwie to kluczowy kamień milowy, od którego wypełnienia zależy uruchomienie przez Brukselę środków na polski Krajowy Plan Odbudowy. Odpowiedzią na zastrzeżenia Komisji Europejskiej miał być zgłoszony przez posłów PiS projekt, który jednak został storpedowany m.in. przez prezydenta.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/finanse/sprzet-narciarski-drozszy-o-10-proc-karnety-o-20-inflacja-nie-omija-sportow-zimowych/ynx05pq", "title": "Sprzęt narciarski droższy o 10 proc., karnety o 20. Inflacja nie omija sportów zimowych", "date_published": "2022-12-17 14:18:45+00:00", "description": "Sezon sportów zimowych ruszył pełną parą. Warunki narciarskie już w połowie grudnia sprawiają, że wiele osób wybiera się na stok, ale inflacja nie oszczędziła w tym roku narciarzy. Ceny sprzętu poszły w górę o ok. 10 proc., a karnety z powodu wzrostu cen energii podrożały o 20 proc.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/twoje-pieniadze/ceny-gazu-w-2023-r-pgnig-wyjasnia-ile-zaplaca-klienci/cfxgb1l", "title": "Ceny gazu w 2023 r. PGNiG wyjaśnia, ile zapłacą klienci", "date_published": "2022-12-17 13:58:00+00:00", "description": "Prezes Urzędu Regulacji Energetyki zatwierdził nową taryfę spółki PGNiG Obrót Detaliczny. \"Cena za gaz dla odbiorców uprawnionych, jak gospodarstwa domowe, nie wzrośnie od nowego roku\" — poinformowała firma w komunikacie.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/biznes/reprezentacja-polski-w-pilce-noznej-stracila-sponsora/xv50w3t", "title": "Reprezentacja Polski w piłce nożnej straciła sponsora", "date_published": "2022-12-17 12:15:32+00:00", "description": "Po ponad dwóch i pół roku współpracy T-Mobile przestanie sponsorować piłkarską reprezentację Polski — dowiedział się serwis wirtualnemedia.pl. Informację potwierdziła sama spółka. Decyzja miała zapaść jeszcze przed mundialem w Katarze.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/twoje-pieniadze/nowe-taryfy-na-energie-co-oznaczaja-dla-odbiorcow/nwnmsdx", "title": "Nowe taryfy na energię. Co oznaczają dla odbiorców?", "date_published": "2022-12-17 11:34:37+00:00", "description": "Prezes Urzędu Regulacji Energetyki zatwierdził w sobotę 17 grudnia taryfy na 2023 r. na sprzedaż energii dla sprzedawców i dystrybutorów. Ta decyzja nie oznacza jednak drastycznych podwyżek dla odbiorców, których chroni rządowa decyzja o zamrożeniu cen prądu.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/prezes-ure-zatwierdzil-taryfy-najwiekszych-przedsiebiorstw-sektora-gazowego/qldkjxj", "title": "Prezes URE zatwierdził taryfy największych przedsiębiorstw sektora gazowego", "date_published": "2022-12-17 10:52:04+00:00", "description": "Prezes Urzędu Regulacji Energetyki zatwierdził taryfy największych przedsiębiorstw sektora gazowego: sprzedawcy gazu PGNiG Obrót Detaliczny i operatora systemu dystrybucyjnego – Polskiej Spółki Gazownictwa – poinformował w sobotnim komunikacie URE.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/taryfy-dla-sprzedawcow-i-dystrybutorow-energii-zatwierdzone/jes25vt", "title": "Prezes URE zatwierdził taryfy sprzedawcom i dystrybutorom energii", "date_published": "2022-12-17 10:30:34+00:00", "description": "Prezes Urzędu Regulacji Energetyki zatwierdził taryfy na sprzedaż energii pięciu tzw. sprzedawcom z urzędu i pięciu największym spółkom dystrybucyjnym – poinformował URE w sobotnim komunikacie. Co istotne dla odbiorców, od stycznia 2023 r., do określonego w przepisach rocznego limitu zużycia energii będą obowiązywały ceny i stawki zgodne z taryfami z 1 stycznia 2022 r.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/biznes/musk-przywraca-twitterowe-konta-zawieszonych-dziennikarzy/1x2sp6k", "title": "Musk przywraca twitterowe konta zawieszonych dziennikarzy", "date_published": "2022-12-17 10:27:24+00:00", "description": "Po publicznym sprzeciwie m.in. europejskich polityków, ONZ oraz użytkowników Twittera, miliarder Elon Musk zdecydował się przywrócić konta kilku amerykańskich dziennikarzy na tej platformie społecznościowej.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/technologie/nauka/w-arktyce-deszcz-moze-wkrotce-zastapic-snieg-ostrzegaja-czolowi-naukowcy/w4zdlsh", "title": "W części Arktyki deszcz może wkrótce zastąpić śnieg, ostrzegają czołowi naukowcy", "date_published": "2022-12-17 09:08:15+00:00", "description": "Obszar podbiegunowy ociepla się dwa razy szybciej niż reszta planety. Skutkiem tego śnieg zamienia się w deszcz, arktyczna pokrywa lodu na morzu się zmniejsza, tundra się zieleni, a morskie ptaki masowo giną z głodu.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/prawo/krajowy-system-e-faktur-coraz-blizej-ministerstwo-odpowiada-na-istotne-pytanie/dd8ww7p", "title": "Krajowy System e-Faktur coraz bliżej. Ministerstwo odpowiada na istotne pytanie", "date_published": "2022-12-17 08:04:14+00:00", "description": "Od 1 stycznia 2024 r. przedsiębiorcy będą musieli korzystać z Krajowego Systemu e-Faktur. Ministerstwo Finansów przygotowało się na wypadek awarii systemu i wyjaśnia, że w takiej sytuacji podatnicy będą wystawiać faktury papierowe lub elektroniczne.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/biznes/niedziela-18-grudnia-niedziela-handlowa-sklepy-beda-otwarte/7tygr6g", "title": "Jutro niedziela handlowa. Szansa na przedświąteczne zakupy", "date_published": "2022-12-17 07:30:32+00:00", "description": "Niedziela 18 grudnia jest niedzielą handlową — ostatnią w tym roku. To oznacza, że sklepy będą otwarte. Ma to pomóc rozładować przedświąteczne kolejki w sklepach.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/stoltenberg-putin-przygotowuje-rosje-do-dlugiej-wojny/qh2hs2x", "title": "Stoltenberg: Putin przygotowuje Rosję do długiej wojny", "date_published": "2022-12-17 06:47:27+00:00", "description": "Rosja przygotowuje się do długiej wojny z Ukrainą — powiedział w rozmowie z agencją AFP sekretarz generalny NATO Jens Stoltenberg. Jak przekonuje szef Sojuszu, ten konflikt musi zakończyć się przy stole negocjacyjnym, ale by do tego doszło, należy wspierać militarnie Ukrainę.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/biznes/jakie-beda-ceny-paliw-po-powrocie-vat-u-obajtek-odpowiada/226peht", "title": "Jakie będą ceny paliw po powrocie VAT-u? Obajtek odpowiada", "date_published": "2022-12-17 06:22:40+00:00", "description": "Powrót VAT-u nie powinien mieć istotnego wpływu na ceny paliw i kieszenie Polaków — zapewnia prezes PKN Orlen Daniel Obajtek. Jak przekonuje szef koncernu, paliwa w kraju nie zabraknie, a ceny ropy nie są obecnie głównym czynnikiem kształtującym ceny paliw w Europie.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/rada-jaka-legendarny-bokser-dal-synowi-ktory-chce-isc-w-jego-slady/fwdmd0v", "title": "Rada, jaką legendarny bokser dał swojemu synowi, który chce iść w jego ślady", "date_published": "2022-12-17 05:41:28+00:00", "description": "Legendarny filipiński bokser, były mistrz świata organizacji WBC w wadze muszej, Manny Pacquiao zdradza najlepszą radę, jaką dał swojemu 21-letniemu synowi, który chce iść w ślady ojca.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/najwiekszy-jarmark-swiateczny-berlina-szokujaca-inflacja/zdyk8m1", "title": "Byłem na największym jarmarku świątecznym Berlina. Nie tylko ceny są problemem", "date_published": "2022-12-17 05:34:06+00:00", "description": "Święta kojarzą się Niemcom z jarmarkami – w samym Berlinie jest ich przynajmniej kilkadziesiąt. Można skosztować tam bożonarodzeniowych przekąsek, wypić grzane wino czy poszukać prezentów. Ten sezon jednak wyraźnie różni się od poprzednich. Ceny są wyjątkowo wysokie, a Niemcy wyraźnie zaciskają pasa. Okazuje się również, że na kondycji jarmarków odbiły się... porażki niemieckiej reprezentacji.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/kamienie-milowe-w-kpo-zobacz-na-co-zgodzil-sie-rzad-w-zamian-za-pieniadze/s4c898q", "title": "Nowe podatki i polski satelita. Zobacz, na co zgodził się rząd w zamian za KPO", "date_published": "2022-12-17 05:25:56+00:00", "description": "Nowy podatek dla właścicieli samochodów, wysłanie na orbitę pierwszego polskiego satelity, niższe pensje dla milionów Polaków czy więcej płatnych dróg w całym kraju. To tylko niektóre kamienie milowe, na które rząd zgodził się, gdy składał w Brukseli polski KPO. O konieczności zmian w sądach słyszał każdy. O innych warunkach już niekoniecznie.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gielda/wiadomosci/holding-pis-przy-orlenie-reszta-panstwowych-firm-to-plankton/64y7jnd", "title": "Przy Orlenie cała reszta państwowych firm to plankton. Nowe rekordy Holdingu PiS", "date_published": "2022-12-17 05:14:46+00:00", "description": "Nigdy dotąd wyniki Holdingu PiS nie były o tyle wyższe od wyników dwudziestki największych prywatnych spółek notowanych na giełdzie. Różnica przekroczyła w trzecim kwartale 20 mld zł. Po konsolidacji Orlenu z Lotosem i PGNiG pod zarządem Daniela Obajtka jest gigant, przy którym zyski całej reszty państwowych firm to tylko tło.", "persistent": false, "language": "en-US"}], "source": {"url": "https://businessinsider.com.pl/.feed", "title": "Business insider"}}