{"entries": [{"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/17/former-pdc-finalist-simon-whitlock-survives-scare-against-christian-perez", "title": "Former PDC finalist Simon Whitlock survives scare against Christian Perez", "date_published": "2022-12-17 23:33:57+00:00", "description": "<ul><li>Whitlock, finalist 13 years ago, beats Perez 3-2</li><li>Lisa Ashton loses 3-2 to Meikle after fighting back</li></ul><p>The former finalist Simon Whitlock survived a major scare to reach the second round of the PDC World Darts Championship, while Lisa Ashton suffered a narrow loss.</p><p>Whitlock, the runner-up 13 years ago, battled to a 3-2 victory over Christian Perez of the Philippines at Alexandra Palace. Perez twice fought back from a set down and had chances in the decider but missed nine darts at double with the final set tied at 1-1.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/17/former-pdc-finalist-simon-whitlock-survives-scare-against-christian-perez\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/17/president-cyril-ramaphosa-one-of-just-two-contenders-for-anc-leadership", "title": "South Africa president Cyril Ramaphosa one of just two candidates for ANC leadership", "date_published": "2022-12-17 23:26:56+00:00", "description": "<p>Incumbent faces Zweli Mkhize, whom he suspended as health minister over corruption allegations, in a party vote</p><p>South Africa’s ruling African National Congress (ANC) nominated just two candidates to run for its top job on Saturday, leaving President <a href=\"https://www.theguardian.com/world/2022/dec/10/south-africas-cyril-ramaphosa-time-running-out\">Cyril Ramaphosa</a> facing the health minister he suspended over corruption allegations in a party vote.</p><p>The winner will have the ANC’s blessing to run for president in 2024 elections under its banner, historically a shoo-in for the country’s top job since the party’s leading light Nelson Mandela ended white minority rule in 1994.</p> <a href=\"https://www.theguardian.com/world/2022/dec/17/president-cyril-ramaphosa-one-of-just-two-contenders-for-anc-leadership\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/17/vikings-comeback-colts-nfl-saturday-games", "title": "Vikings rally from 33-0 down to stun Colts in biggest ever NFL comeback", "date_published": "2022-12-17 22:40:29+00:00", "description": "<ul><li>Greg Joseph’s field goal in OT caps Vikings’ 39-36 shock triumph</li><li>Minnesota breaks 30-year-old record for largest NFL comeback</li></ul><p>The Minnesota Vikings completed the biggest comeback in NFL history, erasing a 33-point deficit by beating the Indianapolis Colts 39-36 on Greg Joseph’s 40-yard field goal with three seconds left in overtime on Saturday to clinch the NFC North division in their typical dramatic fashion.</p><p>Kirk Cousins passed for 460 yards and four touchdowns to lead the Vikings (11-3), who trailed 36-7 late in the third quarter and became just the third team in league history to win 10 games in one season by eight points or fewer.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/17/vikings-comeback-colts-nfl-saturday-games\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/17/this-really-hurts-las-celebrity-mountain-lion-p-22-euthanized-amid-health-woes", "title": "‘This really hurts’: LA’s celebrity mountain lion P-22 euthanized amid health woes", "date_published": "2022-12-17 22:37:07+00:00", "description": "<p>Experts and officials mourn cougar who became ‘an iconic ambassador for wildlife’ in the city</p><p>The reign of Los Angeles’s most famous mountain lion – hailed as an “ambassador for wildlife” in the city – has come to an end, after health and behavioral concerns led to P-22’s euthanization.</p><p>The cougar, who became another LA celebrity after making his home in the city a decade ago, “went to sleep” on Saturday morning, according to state wildlife officials.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/17/this-really-hurts-las-celebrity-mountain-lion-p-22-euthanized-amid-health-woes\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/17/january-6-capitol-attack", "title": "Tennessee man accused of plot to kill FBI agents in latest January 6 charges", "date_published": "2022-12-17 22:22:13+00:00", "description": "<p>Pair allegedly had list of 37 law enforcement agents they planned to assassinate</p><p>In the latest in an ever-growing list of criminal charges brought against January 6 rioters, a Tennessee man was arrested on Friday for allegedly plotting to kill the FBI agents who were investigating him.</p><p>With the House of Representatives committee on the insurrection preparing to deliver its final recommendations on Monday, 34-year old Edward Kelley of Maryville was charged with conspiracy, retaliating against a federal official and solicitation to commit a crime of violence, <a href=\"https://www.cnn.com/2022/12/16/politics/edward-kelley-january-6-fbi-agents/index.html\">reported CNN</a>.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/17/january-6-capitol-attack\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/17/tunisian-parliamentary-election-records-just-88-turnout", "title": "Tunisian parliamentary election records just 8.8% turnout", "date_published": "2022-12-17 22:14:51+00:00", "description": "<p>Fall in votes follows President Kais Saied’s suspension of legislature and redrawing of country’s political map</p><p>Tunisia has recorded the lowest electoral turnout in its recent history after President Kais Saied’s suspension of parliament and subsequent redrawing of the country’s political map.</p><p>Officials at the country’s Instance Supérieure Indépendante pour les Élections (ISIE) announced the final tally of votes <a href=\"https://www.theguardian.com/world/2022/dec/17/tunisians-go-to-polls-in-election-set-to-cement-rule-of-strongman-president\">in the legislative election</a> as 8.8%, though this may increase slightly as additional votes are tabulated.</p> <a href=\"https://www.theguardian.com/world/2022/dec/17/tunisian-parliamentary-election-records-just-88-turnout\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/18/our-game-is-in-tatters-australian-football-reacts-with-shock-to-melbourne-derby-violence", "title": "‘Our game is in tatters’: Australian football reacts with shock to Melbourne derby violence", "date_published": "2022-12-17 22:07:59+00:00", "description": "<ul><li>‘Disgraceful’ scenes are ‘darkest day for football in Australia’</li><li>Fans express fears that post-World Cup goodwill has been lost</li></ul><p>Australian football has reacted with a mixture of shock, anger, sadness and disbelief to the chaotic and violent scenes that resulted in the abandonment of the A-League Men’s Melbourne derby on Saturday night.</p><p>City goalkeeper Thomas Glover was left bloodied after he was hit by a metal bucket allegedly thrown by a Victory fan as supporters stormed the pitch midway through the first half of the match at AAMI Park.</p> <a href=\"https://www.theguardian.com/football/2022/dec/18/our-game-is-in-tatters-australian-football-reacts-with-shock-to-melbourne-derby-violence\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/17/gareth-southgate-to-continue-as-england-manager-after-world-cup-exit", "title": "Gareth Southgate to continue as England manager after World Cup exit", "date_published": "2022-12-17 21:42:34+00:00", "description": "<ul><li>Southgate spent time weighing up future after France defeat</li><li>He has contract with FA that runs to December 2024</li></ul><p>Gareth Southgate has decided to continue as England’s head coach after considering his future in the wake of the World Cup quarter-final <a href=\"https://www.theguardian.com/football/2022/dec/10/england-france-world-cup-quarter-final-match-report\">defeat by France</a>.</p><p>Southgate <a href=\"https://www.theguardian.com/football/2022/dec/10/gareth-southgate-will-wait-before-making-decision-on-england-future\">said he would take time</a> to weigh up whether he had the energy to carry on and hold talks with the Football Association, which wanted him to honour a contract that runs to December 2024.</p> <a href=\"https://www.theguardian.com/football/2022/dec/17/gareth-southgate-to-continue-as-england-manager-after-world-cup-exit\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/society/2022/dec/17/nurses-pledge-tougher-new-strikes-as-nhs-crisis-deepens", "title": "Nurses pledge tougher new strikes as NHS crisis deepens", "date_published": "2022-12-17 21:02:38+00:00", "description": "<p>Nursing union gives ministers until Thursday to open pay talks as first signs emerge of bid to end dispute and prevent NHS collapse</p><p>• <a href=\"https://www.theguardian.com/uk-news/2022/dec/17/nhs-strikes-england-wales-northern-ireland\">How will NHS strikes affect you?</a></p><p>Union leaders threatened on Saturday night to order a fresh wave of more severe strikes in the new year in which nurses would offer “less generous” support inside hospitals, in a dramatic escalation of their pay dispute with the government.</p><p>The Royal College of Nursing (RCN), in a marked hardening of its line, said there would be “more hospitals and more nurses taking part than at present” in strikes throughout January, unless ministers backed down by Thursday.</p> <a href=\"https://www.theguardian.com/society/2022/dec/17/nurses-pledge-tougher-new-strikes-as-nhs-crisis-deepens\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/17/shark-fin-sales-ban-us", "title": "Conservationists hail US plan to ban shark fin trade", "date_published": "2022-12-17 20:32:55+00:00", "description": "<p>Biden poised to sign measure into law as US faces criticism at Cop15 biodiversity conference over failing to sign 30-year-old pact to protect nature</p><p>As the UN meets in Montreal to discuss <a href=\"https://www.theguardian.com/environment/2022/dec/17/cop15-us-biodiversity-cbd\">saving biodiversity without the US</a>, whose representatives are joining only as observers, conservationists are hailing one American step in the right direction: a likely ban on the trade of shark fins.</p><p>Although shark finning – the practice of cutting off shark fins and dumping the rest of the body back into the ocean – is illegal in the US, much of the trade in fins happens in US territory. As many as 73 million sharks are finned around the world each year.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/17/shark-fin-sales-ban-us\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/17/cop15-us-biodiversity-cbd", "title": "The US touts support for biodiversity – but at Cop15, it remains on the sidelines", "date_published": "2022-12-17 20:15:37+00:00", "description": "<p>Washington hasn’t signed a 30-year-old pact, leaving Biden’s envoy in the role of ‘influencer’ in Montreal</p><p>Only two countries in the world have not joined the UN Convention on Biological Diversity: the Vatican and the US. Few have missed the Holy See, but the US not joining the CBD 30 years ago has been described as the “<a href=\"https://digitalcommons.law.ggu.edu/cgi/viewcontent.cgi?article=1844&amp;context=ggulrev\">major holdout</a>” among countries looking to support the convention’s goals.</p><p>In Montreal, where negotiations for this decade’s UN biodiversity targets are entering their frantic final stages, the absence of the US political machine is noticeable, changing the power dynamics in talks between the remaining 196 countries.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/17/cop15-us-biodiversity-cbd\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/blog/2022/dec/17/julian-alvarez-evokes-argentina-spirit-mario-kempes-world-cup-qatar-2022", "title": "Julián Álvarez evokes Argentina’s spirit of Kempes and can resurrect old glories | Jonathan Wilson", "date_published": "2022-12-17 20:00:29+00:00", "description": "<p>Before Sunday’s World Cup final, the striker has become part of a proud lineage who broke cover on the biggest stage</p><p>The oddity of this Argentina side is that it arrived in Qatar having gone 36 games unbeaten and yet has still found itself making it up as it went along. For once there seemed no questions about selection. There were few doubts about how Argentina should play or who should play up front with Lionel Messi, even after the injury to Giovani Lo Celso. There was a sense of stability and a quiet confidence. They had won the Copa América last year. There was no need to change anything. Then they <a href=\"https://www.theguardian.com/football/2022/nov/22/argentina-saudi-arabia-world-cup-group-c-match-report\" title=\"\">lost to Saudi Arabia</a>.</p><p>Argentina are habitually poor starters at World Cups. In 40 years their only really impressive opening performance was the 4-0 win over Greece in 1994 and that culminated in Diego Maradona failing the drug test that would end his international career.</p> <a href=\"https://www.theguardian.com/football/blog/2022/dec/17/julian-alvarez-evokes-argentina-spirit-mario-kempes-world-cup-qatar-2022\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/17/ellyse-perry-blasts-australia-to-thrilling-series-clinching-victory-over-india", "title": "Ellyse Perry blasts Australia to thrilling series-clinching victory over India", "date_published": "2022-12-17 19:34:58+00:00", "description": "<ul><li>Fourth T20: Australia (188-3) beat India (181-5) by seven runs</li><li>Perry smashes four sixes in unbeaten 72 from 42 balls</li></ul><p>Australia have secured the T20 series against India with a match to spare following a tense seven-run victory in Mumbai, built around another scintillating innings from Ellyse Perry. </p><p>The veteran continued her successful comeback to the short-form side at Brabourne Stadium with a 42-ball unbeaten 72 with seven fours and four sixes. It was quicker than the 47-ball 75 she made in <a href=\"https://www.theguardian.com/sport/2022/dec/15/ellyse-perry-delivers-matchwinning-innings-as-australia-beat-india-in-third-t20\">Wednesday’s third match</a>, which was her first T20I knock for 14 months.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/17/ellyse-perry-blasts-australia-to-thrilling-series-clinching-victory-over-india\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/17/iranian-actor-taraneh-alidoosti-arrested-after-criticism-of-death-penalty", "title": "Iranian actor Taraneh Alidoosti arrested after criticism of death penalty", "date_published": "2022-12-17 19:21:18+00:00", "description": "<p>Detention of one of Iran’s most famous performers sign state wants to crack down on celebrities who challenge regime</p><p>Taraneh Alidoosti, one of Iran’s most famous actors, has been detained by security forces in Tehran days after she criticised the state’s use of the death penalty against protesters.</p><p>She had previously posted a picture of herself on her Instagram page in which she was not wearing the hijab and holding a piece of paper reading “women, life, freedom” – the slogan that has <a href=\"https://www.theguardian.com/music/2022/nov/16/woman-life-freedom-concert-women-in-iran-royal-festival-hall\">come to encapsulate the fight against the current Iranian regime</a>.</p> <a href=\"https://www.theguardian.com/world/2022/dec/17/iranian-actor-taraneh-alidoosti-arrested-after-criticism-of-death-penalty\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/politics/2022/dec/17/tories-at-risk-from-rightwing-insurgency-warns-donor-lord-cruddas", "title": "Tories ‘at risk from rightwing insurgency’ warns donor Lord Cruddas", "date_published": "2022-12-17 19:19:16+00:00", "description": "<p>Peer says Conservatives no longer party of centre right and are threatened by Reform, Brexit party successor, if Nigel Farage takes leadership</p><p>The Conservative party is under threat from a rightwing insurgency after a “drag to the left” under Rishi Sunak, one of its biggest recent donors has warned, amid growing tensions on the Tory right.</p><p>Peter Cruddas, the peer who has given the party more than £3.5m, said the Conservatives were “no longer a centre-right party” under Sunak, adding that he refused to back it financially until it changed course.</p> <a href=\"https://www.theguardian.com/politics/2022/dec/17/tories-at-risk-from-rightwing-insurgency-warns-donor-lord-cruddas\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/17/dont-bank-on-nuclear-fusion-to-save-the-world-from-a-climate-catastrophe-i-have-seen-it-all-before", "title": "Despite the hype, we shouldn’t bank on nuclear fusion to save the world from climate catastrophe | Robin McKie", "date_published": "2022-12-17 19:16:00+00:00", "description": "Last week’s experiment in the US is promising, but it’s not a magic bullet for our energy needs<p>The revelation that researchers had succeeded in creating a <a href=\"https://www.theguardian.com/environment/2022/dec/12/breakthrough-in-nuclear-fusion-could-mean-near-limitless-energy\" title=\"\">nuclear fusion reaction</a> that generated more energy than it consumed made reassuring reading last week. For almost half a century, I have reported on scientific issues and no decade has been complete without two or three announcements by scientists claiming their work would soon allow science to recreate the processes that drive the sun. The end result would be the generation of clean, cheap nuclear fusion that would transform our lives.</p><p>Such announcements have been rare recently, so it gave me a warm glow to realise that standards may be returning to normal. By deploying a set of 192 lasers to bombard pellets of the hydrogen isotopes deuterium and tritium, researchers at the US National Ignition Facility (NIF) in Livermore, California, were able to generate temperatures only found in stars and thermonuclear bombs. The isotopes then fused into helium, releasing excess energy, they reported.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/17/dont-bank-on-nuclear-fusion-to-save-the-world-from-a-climate-catastrophe-i-have-seen-it-all-before\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/australia-news/2022/dec/18/a-months-wages-soaring-air-fares-leave-australians-spending-christmas-apart-or-out-of-pocket", "title": "‘A month’s wages’: Soaring air fares leave Australians spending Christmas apart or out of pocket", "date_published": "2022-12-17 19:00:30+00:00", "description": "<p>Christmas had to come early this year for some families – in the form of interstate flights. While for others, reunions will be on hold for another year</p><ul><li>Get our <a href=\"https://www.theguardian.com/australia-news/2022/oct/29/email-newsletters-guardian-australia-best-daily-news-emails-newsletter-free-sign-up-inbox-subscribe-headlines?CMP=cvau_sfl\">morning and afternoon news emails</a>, <a href=\"https://www.theguardian.com/technology/ng-interactive/2018/may/15/the-guardian-app?CMP=cvau_sfl\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></li></ul><p>Jonathan Brown got to see the joy on his nieces and nephews’ faces as they tore open their presents. The potato salad and ham were on the table. So were the Christmas crackers and hats.</p><p>It was a typical family Christmas just like any other year – except that it took place on 27 November.</p> <a href=\"https://www.theguardian.com/australia-news/2022/dec/18/a-months-wages-soaring-air-fares-leave-australians-spending-christmas-apart-or-out-of-pocket\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/artanddesign/2022/dec/17/architecture-rowan-moore-five-best-buildings-of-2022", "title": "Architecture: Rowan Moore’s five best projects of 2022", "date_published": "2022-12-17 19:00:29+00:00", "description": "<p>Playful, elegant additions to universities and colleges were the class acts to follow, while the newly opened Elizabeth line exceeded all design expectations</p><ul><li><a href=\"https://www.theguardian.com/culture/series/observer-critics--review-of-2022\">Read the Observer critics’ review of 2022 in full</a></li></ul><p>1. <strong><a href=\"https://www.theguardian.com/artanddesign/2022/mar/20/the-marshall-building-london-review-brutalist-brilliance\">Marshall Building, LSE, London</a></strong><br /><strong>Grafton Architects</strong><br />A multifaceted concrete palazzo for students, a place for learning, gathering, sport and music whose design runs several gamuts – grand and intimate, formal and twisting, calm and energetic. It has tree-like columns at the scale of motorway structures, sweeping staircases, alcoves for study and an expansive ground-floor “student commons”. You sense that its architects enjoyed designing it and that its users will enjoy being there.</p><p>2. <strong><a href=\"https://www.theguardian.com/uk-news/2022/mar/13/elizabeth-line-crossrail-opening-london\">Elizabeth line</a></strong><br /><strong>Line-wide design by Grimshaw</strong><br />The Elizabeth line, when it finally opened in May, revealed an alternative universe of underground railway travel where everything is bigger, brighter and swisher. This is due to the sheer scale of the stations and to their design – unified and orderly but also curvaceous and a touch baroque.</p> <a href=\"https://www.theguardian.com/artanddesign/2022/dec/17/architecture-rowan-moore-five-best-buildings-of-2022\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/18/the-moment-i-knew-a-buffet-of-international-men-couldnt-sway-me", "title": "The moment I knew: ‘A buffet of international men couldn’t sway me’", "date_published": "2022-12-17 19:00:29+00:00", "description": "<p>When she set out for a long international trip, <strong>Freya Bennett</strong> knew she liked Serge. But it took 10,427 miles of distance for her to realise how much</p><ul><li><a href=\"https://www.theguardian.com/newsletters/2019/oct/18/saved-for-later-sign-up-for-guardian-australias-culture-and-lifestyle-email?CMP=cvau_sfl\">Get our weekend culture and lifestyle email</a></li></ul><p>It was a balmy night in Paris. Earlier that evening my single friend and I had dressed up for one last night on the town. A magical Parisian sendoff was glittering ahead of us and we shone back, relishing our youth and the freedom of travel.</p><p>At a little bar on Rue Mouffetard I found myself talking to a charming French man named Etienne. I told him from the start that I had a boyfriend but he just shrugged, a twinkle in his eye and said: “I have a girlfriend also.”</p><p><strong><a href=\"https://www.theguardian.com/newsletters/2019/oct/18/saved-for-later-sign-up-for-guardian-australias-culture-and-lifestyle-email?CMP=copyembed\">Sign up for the fun stuff with our rundown of must-reads, pop culture and tips for the weekend, every Saturday morning</a></strong></p><p>I’m watching Ratatouille with my sister. Paris looks beautiful! xox</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/18/the-moment-i-knew-a-buffet-of-international-men-couldnt-sway-me\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/travel/2022/dec/18/a-locals-guide-to-brisbane-what-do-you-want-because-its-all-here", "title": "A local’s guide to Brisbane: ‘What do you want? Because it’s all here’", "date_published": "2022-12-17 19:00:28+00:00", "description": "<p>Brisbane may be a medium-sized city but thanks to a multicultural food, arts and nightlife scene, it’s also a world tour, says star chef <strong>Louis Tikaram</strong></p><p></p><p>Brisbane is this really tight, convenient food city. If I have friends visiting from Sydney or Los Angeles, I just ask, “What do you want? Because it’s all here.”</p><p><strong><a href=\"https://www.theguardian.com/newsletters/2019/oct/18/saved-for-later-sign-up-for-guardian-australias-culture-and-lifestyle-email?CMP=copyembed\">Sign up for the fun stuff with our rundown of must-reads, pop culture and tips for the weekend, every Saturday morning</a></strong></p> <a href=\"https://www.theguardian.com/travel/2022/dec/18/a-locals-guide-to-brisbane-what-do-you-want-because-its-all-here\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/australia-news/gallery/2022/dec/18/celebration-and-survival-the-best-of-guardian-australias-2022-photography-in-pictures", "title": "Celebration and survival: the best of Guardian Australia’s 2022 photography – in pictures", "date_published": "2022-12-17 19:00:28+00:00", "description": "<p>This year’s best photography from Guardian Australia’s photographic team and freelance photographers across Australia and New Zealand</p> <a href=\"https://www.theguardian.com/australia-news/gallery/2022/dec/18/celebration-and-survival-the-best-of-guardian-australias-2022-photography-in-pictures\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/17/frances-survivors-daring-for-greatest-heist-yet-against-messi-and-argentina", "title": "France’s survivors daring for greatest heist yet against Messi and Argentina", "date_published": "2022-12-17 18:00:28+00:00", "description": "<p>Didier Deschamps’ pragmatists will be set on stifling Lionel Messi’s magic as they aim to complete a hat-trick of World Cups</p><p>If France are the new West Germany – unflinching under pressure, unconcerned with claiming neutral hearts – then perhaps time has spun back to 1986. If so then it is good news for Argentina. It has been 36 years since the South Americans edged past the West Germans in a thrilling final and, by the time this most unsettling of World Cups comes to an end at the Lusail Stadium, most football romantics will hope that Lionel Messi has finally <a href=\"https://www.theguardian.com/football/2022/dec/17/lionel-messi-is-not-becoming-diego-maradona-he-is-becoming-himself-argentina-world-cup-final\">claimed his place alongside Diego Maradona</a> in Argentinian folklore.</p><p>Destiny awaits. Messi in 2022 has been the equivalent of Maradona at Mexico 86, making an ordinary team believe they are capable of winning the greatest prize of all. This is surely his time. Unless, of course, France overcome <a href=\"https://www.theguardian.com/football/2022/dec/16/varane-konate-and-coman-train-apart-virus-france-world-cup-final\">the virus sweeping through their camp</a> and pull off their latest heist. “I know that Argentinian people, many people around the world, maybe even some French people hope Messi will win the World Cup,” Didier Deschamps acknowledged. “But we will do everything to achieve our objective.”</p> <a href=\"https://www.theguardian.com/football/2022/dec/17/frances-survivors-daring-for-greatest-heist-yet-against-messi-and-argentina\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/17/irritating-yes-silly-yes-but-harry-and-meghan-are-right-on-one-thing-press-persecution", "title": "Irritating, yes. Silly, yes. But Harry and Meghan are right on one thing: press persecution | Catherine Bennett", "date_published": "2022-12-17 18:00:28+00:00", "description": "The Sussexes may have colluded, but elements of the reporting have been shameful<p>If <em><a href=\"https://www.netflix.com/title/81439256\" title=\"\">Harry &amp; Meghan</a></em>, the series, didn’t please everyone, Prince Andrew must have adored it. Beyond group pictures, not even a glimpse of Andrew (the Epstein/Maxwell favourite still embedded in a Windsor mansion after the £12m settlement of a contested sex claim) was deployed to underline the non-compromised couple’s contrasting exile from their tribe, for reasons that seem largely to do with resentment, carelessness and pettiness.</p><p>Since likewise overlooked are the King’s mishaps with <a href=\"https://www.theguardian.com/uk-news/2021/sep/19/prince-charles-cash-for-honours-scandal-grows-with-fresh-allegations\" title=\"\">donors and honours</a>, his grotesque first marriage and ditto enthusiasms for <a href=\"https://www.theguardian.com/books/2001/sep/30/biography.highereducation\" title=\"\">Laurens van der Post</a> and <a href=\"https://www.theguardian.com/uk-news/2022/apr/06/prince-charles-repeatedly-sought-jimmy-savile-advice-documentary-claims\" title=\"\">Jimmy Savile</a>, there was much for him and the extended family to celebrate. What an example to <em>The Crown</em>! The Windsors’ many embarrassments scarcely featured, even in sections where scholars offered long views on the ducal couple’s struggle, including unexpected connections with Brexit, Stephen Lawrence and the Grenfell Tower fire. What little, after some baleful trailers, the programmes firmly alleged about Harry’s relations – shouting, plotting and neglect – left them looking not much worse than the dysfunctional, emotionally stunted zoo exhibits we already know them to be.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/17/irritating-yes-silly-yes-but-harry-and-meghan-are-right-on-one-thing-press-persecution\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/17/we-have-a-long-way-to-go-can-the-uk-hit-its-ambitious-30-rewilding-targets", "title": "‘We have a long way to go’: can the UK hit its ambitious 30% rewilding targets?", "date_published": "2022-12-17 18:00:27+00:00", "description": "<p>Britain is a vocal supporter of the global bid to return land to nature, but its record is dismal. Can it make up lost ground in time?</p><p>More than 5 million tonnes of coal were hewn from land at West Chevington in Northumberland in the 1980s. Lorries, cranes and bulldozers crisscrossed the vast opencast mine that had been created there, flinging clouds of coal dust into the air and brutalising the landscape to provide fuel for the nation’s power stations and factories.</p><p>Today, the 327-hectare (808-acre) site faces a remarkable transformation. It is to become the focus of a major rewilding programme that will allow the land to return to a mix of scrub and wood and in the process provide homes for animals that could range from water voles to marsh harriers, and from curlews to harvest mice.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/17/we-have-a-long-way-to-go-can-the-uk-hit-its-ambitious-30-rewilding-targets\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/17/lionel-messi-is-not-becoming-diego-maradona-he-is-becoming-himself-argentina-world-cup-final", "title": "Lionel Messi is not becoming Diego Maradona – he is becoming himself", "date_published": "2022-12-17 18:00:26+00:00", "description": "<p>The totem of Sunday’s finalists is revealing his true self rather than becoming a mirror image of the great who led his nation to World Cup glory in 1986</p><p>For Lionel Messi’s Argentina this is the eve of a World Cup final that has been a long time coming. As the bumpy yet steadily improved road to glory unfolds, the inevitable comparisons with the late Diego Maradona get ever stronger. Like some phantom standard that Messi is supposed to reach, the pinnacle of triumphalism on lifting the trophy, the shadow cast by Maradona looms ever larger.</p><p>On Argentinian radio, as in south-east Asian reports, European media and the USA, the comparison between the two players is being underscored, feeding the idea that somehow Messi has to become “more Maradona” if the feat of winning this tournament is to be finally achieved.</p> <a href=\"https://www.theguardian.com/football/2022/dec/17/lionel-messi-is-not-becoming-diego-maradona-he-is-becoming-himself-argentina-world-cup-final\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/17/alabama-women-stray-cats-arrest-food-trap", "title": "Alabama women, 85 and 61, sentenced after feeding stray cats", "date_published": "2022-12-17 17:47:31+00:00", "description": "<p>Beverly Roberts and Mary Alston sought to trap the cats so they could be neutered</p><p>Two Alabama women were given suspended jail sentences last week after feeding stray cats and trapping them so they could be neutered, a common public health intervention to reduce stray numbers.</p><p>Beverly Roberts, 85, and Mary Alston, 61, of Wetumpka, Alabama, were sentenced to two years of unsupervised parole and a $100 fine each on Tuesday, <a href=\"https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwiqrOPgiYH8AhVMp3IEHYZaBucQFnoECBcQAQ&amp;url=https%3A%2F%2Fwww.montgomeryadvertiser.com%2Fstory%2Fnews%2Fcrime%2Fprogress%2F2022%2F12%2F13%2Fwetumpka-alabama-cat-ladies-found-guilty-on-all-four-charges%2F69722572007%2F&amp;usg=AOvVaw3Cw_ASWrlQLv-Plb1vCIMl\">reported the Montgomery Advertiser.</a> The women were also given suspended 10-day jail sentences.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/17/alabama-women-stray-cats-arrest-food-trap\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/17/leicester-clermont-champions-cup-rugby-union-match-report", "title": "Leicester give Steve Borthwick perfect send-off with victory over Clermont", "date_published": "2022-12-17 17:38:59+00:00", "description": "<ul><li>Pool B: Leicester 23-16 Clermont</li><li>Borthwick expected to be named England head coach this week</li></ul><p>If this should prove his last game in charge, Steve Borthwick left Welford Road with a familiar sign-off – discipline, commitment and the result. Just about. </p><p>Popular opinion no doubt has it that the end of the Eddie Jones era might mean England unfurl their wings and fly - those who know Borthwick might be less quick to jump to that conclusion. But if results are your thing, England could do worse, should the seemingly inevitable be announced this week. </p> <a href=\"https://www.theguardian.com/sport/2022/dec/17/leicester-clermont-champions-cup-rugby-union-match-report\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/17/championship-roundup-manuel-benson-puts-burnley-six-points-clear", "title": "Championship roundup: Manuel Benson puts Burnley six points clear", "date_published": "2022-12-17 17:36:11+00:00", "description": "<ul><li>Benson strikes twice in 3-1 win over Middlesbrough</li><li>Watford go third after 2-0 victory at Huddersfield</li></ul><p>Manuel Benson scored twice, making up for an earlier costly error, as Vincent Kompany’s leaders <strong>Burnley</strong> moved six points clear at the top of the Championship with a 3-1 win over <strong>Middlesbrough</strong>.</p><p>The 25-year-old winger was on the mark twice in seven second-half minutes, having gifted Michael Carrick’s visitors the opening goal of the game just after half-time at Turf Moor. That Boro goal, scored by substitute Duncan Watmore, came as Benson attempted to keep a loose ball in play on the halfway line. He succeeded only in hooking the ball blindly back towards his own goal, allowing Watmore to race through and convert.</p> <a href=\"https://www.theguardian.com/football/2022/dec/17/championship-roundup-manuel-benson-puts-burnley-six-points-clear\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/17/german-police-recover-31-items-stolen-in-2019-dresden-jewel-heist", "title": "German police recover 31 items stolen in 2019 Dresden jewel heist", "date_published": "2022-12-17 17:30:45+00:00", "description": "<p>‘Considerable portion’ of priceless treasures from Green Vault museum recovered amid trial of suspects</p><p>German authorities say they have found a “considerable portion” of items stolen in <a href=\"https://www.theguardian.com/world/2019/nov/25/thieves-steal-priceless-treasures-dresden-green-vault-museum\">a spectacular 2019 robbery of priceless 18th-century jewels</a> from a state museum.</p><p>The authorities retrieved 31 individual items in the capital Berlin, the police and prosecutors said.</p> <a href=\"https://www.theguardian.com/world/2022/dec/17/german-police-recover-31-items-stolen-in-2019-dresden-jewel-heist\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/17/j-robert-oppenheimer-atomic-bomb-security-clearance", "title": "US voids 1954 revoking of J Robert Oppenheimer’s security clearance", "date_published": "2022-12-17 17:27:32+00:00", "description": "<p>Biden administration says 1954 decision that ended atomic bomb scientist’s career was part of ‘flawed process’</p><p>The Biden administration has overturned a 1954 decision that revoked the security clearance of J Robert Oppenheimer, the scientist credited as a key architect of the atomic bomb who was caught up in the Red Scare over communism in US politics.</p><p>The US energy secretary, Jennifer Granholm, <a href=\"https://thehill.com/policy/energy-environment/3778263-energy-dept-vacates-1950s-decision-revoking-security-clearance-for-father-of-the-atomic-bomb-j-robert-oppenheimer/\">wrote in a statement</a> published on Friday that the original decision by the Atomic Energy Commission on Oppenheimer’s security clearance had been part of a “flawed process that violated the Commission’s own regulations”.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/17/j-robert-oppenheimer-atomic-bomb-security-clearance\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/17/peru-president-general-election-protests-dina-boluarte", "title": "Peru’s president urges Congress to bring forward general elections amid protests", "date_published": "2022-12-17 17:25:09+00:00", "description": "<p>Dina Boluarte assumed the presidency after Pedro Castillo tried to illegally dissolve Congress and was arrested</p><p>The Peruvian president, Dina Boluarte, who has said she is leading a transitional government, urged the country’s Congress to pass a proposal to bring forward general elections in a news conference from the presidential palace on Saturday.</p><p>Boluarte, formerly Peru’s vice-president, assumed the presidency earlier this month after ex-president Pedro Castillo tried to illegally dissolve Congress and was arrested.</p> <a href=\"https://www.theguardian.com/world/2022/dec/17/peru-president-general-election-protests-dina-boluarte\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/17/croatia-morocco-world-cup-third-place-playoff-match-report", "title": "Croatia finish third at World Cup after Mislav Orsic’s winner against Morocco", "date_published": "2022-12-17 17:06:51+00:00", "description": "<p>Croatia beat Morocco 2-1 in the World Cup third-place playoff on Saturday to secure a top-three finish in the tournament for the second consecutive edition. Runners-up in 2018, Croatia also came third in the 1998 World Cup, beating the Netherlands 2-1. </p><p>Josko Gvardiol put Croatia in front after a well-designed set-piece play. Lovro Majer lobbed a free-kick to Ivan Perisic, who peeled away from his marker to head the ball to the middle of the box where Gvardiol was perfectly positioned to nod the ball into the net with a brilliant diving header. </p> <a href=\"https://www.theguardian.com/football/2022/dec/17/croatia-morocco-world-cup-third-place-playoff-match-report\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/17/france-boosted-as-varane-konate-and-coman-return-to-training-after-virus", "title": "France boosted as Varane, Konaté and Coman return to training after virus", "date_published": "2022-12-17 17:00:42+00:00", "description": "<ul><li>Social distancing was put in place after players fell unwell</li><li>All 24 fit players reported for training before World Cup final</li></ul><p>France hope they have contained the virus that has swept through their camp after Kingsley Coman, Raphaël Varane and Ibrahima Konaté returned to training before Sunday’s World Cup final against Argentina.</p><p>The world champions have had to put social distancing measures in place in an attempt to stop more players falling unwell before the final at the Lusail Stadium. Coman, Dayot Upamecano and Adrien Rabiot missed <a href=\"https://www.theguardian.com/football/2022/dec/14/france-morocco-world-cup-semi-final-match-report\">France’s semi-final victory against Morocco</a> on Wednesday and the situation worsened when Varane and Konaté were forced to skip training on Friday.</p> <a href=\"https://www.theguardian.com/football/2022/dec/17/france-boosted-as-varane-konate-and-coman-return-to-training-after-virus\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/17/cats-pop-stars-and-dressing-room-showdowns-qatar-world-cup-highlights", "title": "Cats, pop stars and dressing-room showdowns: Qatar World Cup highlights", "date_published": "2022-12-17 17:00:27+00:00", "description": "<p>Sure there were sporting zeniths, but what about Chesney Hawkes, maltreated felines and a surfeit of dancing …</p><p>“<a href=\"https://www.theguardian.com/football/2022/nov/19/fifa-gianni-infantino-world-cup-qatar\" title=\"\">Today I feel gay,”</a> Fifa’s head told surprised journalists pre-tournament. “Today I feel disabled, today I feel a migrant worker.” He revealed he knew how migrants felt because “as a child [in Switzerland] I was bullied. I had red hair and freckles, plus I was Italian, so imagine”. His basic point: media should stop the “profoundly unjust” scrutiny of the hosts. “It’ll be the best World Cup ever.”</p> <a href=\"https://www.theguardian.com/football/2022/dec/17/cats-pop-stars-and-dressing-room-showdowns-qatar-world-cup-highlights\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/artanddesign/gallery/2022/dec/17/childrens-beloved-toys-become-shape-shifters-in-pictures", "title": "Children’s beloved toys become shape-shifters – in pictures", "date_published": "2022-12-17 17:00:26+00:00", "description": "<p>London-based graphic designer <a href=\"https://www.dutchuncle.co.uk/noma-bar\">Noma Bar</a>’s new project is a tribute to his children’s cuddly animals. The toys were reprieved from the charity shop to take part in Transitions, a set of photographs that reimagines stuffed ducks and monkeys as new beings. Bar used to do this as a game with his now teenage children when they were young. “I remember that magical moment and my daughters’ expressions when I showed them that their Care Bear turned upside down becomes a rabbit.” The manipulated toys’ new forms are fixed with poppers, so they can return to their original shape. “There is more than one side to everything in life,” says Bar. “Imagination and curiosity are important – look at something you’ve seen many times in your life and rediscover it.”</p> <a href=\"https://www.theguardian.com/artanddesign/gallery/2022/dec/17/childrens-beloved-toys-become-shape-shifters-in-pictures\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/17/emiliano-martinez-as-likely-as-lionel-messi-argentina-x-factor-world-cup", "title": "Emiliano Martínez the man as likely as Messi to be Argentina’s X-factor", "date_published": "2022-12-17 17:00:26+00:00", "description": "<p>Aston Villa’s goalkeeper has gone from fan in the stands in 2018 to indispensable part of Argentina’s run to the World Cup final</p><p>It was an image that spoke volumes. All bar two of Argentina’s players had run to the far corner flag, taking it in turns to leap atop the bundle that had formed around Lautaro Martínez. He had just scored the penalty that confirmed their place in the semi-finals, shaking off the scare caused by Wout Wieghost and the Netherlands.</p><p>Across the pitch from them lay Emiliano Martínez, splayed over the turf and thumping the grounds with his fists. The keeper was not alone for long: while everyone else had sprinted left, Lionel Messi made a beeline to the right. The pair embraced in a clinch that may yet come to define their side’s campaign.</p> <a href=\"https://www.theguardian.com/football/2022/dec/17/emiliano-martinez-as-likely-as-lionel-messi-argentina-x-factor-world-cup\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/artanddesign/2022/dec/17/paolo-di-paolo-the-man-who-shot-the-glamour-and-grit-of-postwar-italy", "title": "Paolo Di Paolo: the man who shot the glamour – and grit – of postwar Italy", "date_published": "2022-12-17 17:00:26+00:00", "description": "<p>A new film charts the extraordinary career of a photographer who captured the moment country came to life</p><p>Glamour, with it’s qualities of mystery, realism and discretion, is notoriously difficult to define, but the photographs of 97-year-old Paolo Di Paolo provide definitive visual clues. For 14 years through the 50s and 60s, he photographed post-war Italy as it was, an agrarian society racing toward industrialisation.</p><p>Di Paolo’s reportage, of luminous movie stars, writers, directors of Italian cinema, agricultural and factory workers, and the poor – all in the spirit of empathetic curiosity – sometimes found their way into <em>Il Mundo</em>, a renowned 12-page political-intellectual weekly magazine, that counted Thomas Mann and George Orwell as contributors.</p> <a href=\"https://www.theguardian.com/artanddesign/2022/dec/17/paolo-di-paolo-the-man-who-shot-the-glamour-and-grit-of-postwar-italy\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/17/david-beckham-makes-first-statement-on-his-qatar-world-cup-involvement", "title": "David Beckham makes first statement on his Qatar World Cup involvement", "date_published": "2022-12-17 16:41:05+00:00", "description": "<p>The former England captain, whose role as ambassador was criticised by the LGBTQ+ community, said he believes sport is ‘a force for good’</p><p>David Beckham has made his first public statement on his controversial involvement with the World Cup host nation Qatar, telling a US newspaper through a spokesperson that he “has always believed that sport has the power to be a force for good in the world”.</p><p>“We understand that there are different and strongly held views about engagement in the Middle East but see it as positive that debate about the key issues has been stimulated directly by the first World Cup being held in the region,” the statement continued.</p> <a href=\"https://www.theguardian.com/football/2022/dec/17/david-beckham-makes-first-statement-on-his-qatar-world-cup-involvement\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/science/2022/dec/17/dinosaur-head-sold-for-6m-at-us-auction-reveals-new-breed-of-art-collectors", "title": "Dinosaur head sold for $6m at US auction reveals new breed of art collectors", "date_published": "2022-12-17 16:00:25+00:00", "description": "<p>Sale of Maximus T rex at Sotheby’s reveals growing interest in palaeontological finds at auction houses</p><p>Sotheby’s New York Luxury Week auctions offered a surprising first earlier this month. This series of sales showcases “the best of the best” in opulent goods, from jewellery and cars to wine and handbags. So you’d expect rare Rolexes or a mint condition 911 Porsche Targa, but the rarest possession up for grabs this time was a skull.</p><p>Named Maximus, it’s one of the most complete Tyrannosaurus rex skulls ever discovered. The first of its kind to appear at public auction, it sold for $6,069,500 to one of a new breed of art collectors who view dinosaurs as collectibles.</p> <a href=\"https://www.theguardian.com/science/2022/dec/17/dinosaur-head-sold-for-6m-at-us-auction-reveals-new-breed-of-art-collectors\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/17/i-stumbled-into-a-real-life-meet-cute-so-why-couldnt-i-go-through-with-it", "title": "I stumbled into a real-life meet-cute, Bridget Jones-style, so why couldn’t I go through with it? | Bidisha Mamata", "date_published": "2022-12-17 16:00:25+00:00", "description": "A handsome, stranded man asked me for help with his car on a snowy night, a perfect scene for a movie<p>It’s going to be a quiet Christmas as we balance the books financially and play it safe health-wise. Let’s nest at home watching our favourite Christmas movies. Mine are <em>Last Christmas</em>, <em>While You Were Sleeping</em>, <em>Carol</em> and <em>Bridget Jones’s Diary</em>. A sprinkle of romance, a dash of snow, a pinch of pure fantasy.</p><p>Except that it almost happened to me last week. I was walking home when I saw a stuck car whose wheels were spinning in the slush. I called: “D’you need a push?”</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/17/i-stumbled-into-a-real-life-meet-cute-so-why-couldnt-i-go-through-with-it\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/17/inside-the-kaleidoscopic-home-of-a-colour-loving-nonconformist", "title": "Inside the kaleidoscopic home of a colour-loving nonconformist", "date_published": "2022-12-17 16:00:25+00:00", "description": "The Mexican wave decorating one bright London home this Christmas<p>There’s a lot of pressure around Christmas – a feeling that everything must be done right,” says Zoe Anderson. “So I like to create an anti-stress atmosphere, fuelled by fun.” </p><p>Her north London home, which she shares with her husband, Gavin, and their daughter, Ruby, is a stone’s throw from Arsenal’s football ground. It is a kaleidoscope of colourful joy and homage to her nonconformist energy. Zoe refuses to surrender to the mainstream, and is unashamedly true to herself – which, she says, is liberating.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/17/inside-the-kaleidoscopic-home-of-a-colour-loving-nonconformist\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/media/2022/dec/17/digital-services-act-inside-the-eus-ambitious-bid-to-clean-up-social-media", "title": "Digital Services Act: inside the EU’s ambitious bid to clean up social media", "date_published": "2022-12-17 16:00:24+00:00", "description": "<p>The legislation aims to tackle problems as wide-ranging as misogyny, disinformation and consumer fraud</p><p>Nearly two decades after the birth of Facebook ushered in the social media era, the EU is introducing ambitious legislation designed to clean up the world’s biggest online forums.</p><p>Intended to tackle misogyny, protect children, stop consumer fraud, curb disinformation and protect democratic elections, the Digital Services Act (DSA) is wide-ranging. The UK is introducing its own statute, the <a href=\"https://www.theguardian.com/technology/2022/nov/24/online-safety-bill-to-return-to-parliament-next-month\" title=\"\">online safety bill</a>, but the EU’s rules are likely to have a bigger impact because they cover a bigger market, and the EU is more influential as a regulatory power.</p> <a href=\"https://www.theguardian.com/media/2022/dec/17/digital-services-act-inside-the-eus-ambitious-bid-to-clean-up-social-media\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/17/sam-bankman-fried-arrest-ftx-media-sec", "title": "Of all the failures enabling Sam Bankman-Fried, the media’s was the most deplorable | John Naughton", "date_published": "2022-12-17 16:00:24+00:00", "description": "<p>Credulous or ignorant interviewers made it easier for the disgraced crypto wunderkind to pull the wool</p><p>So Sam Bankman-Fried (henceforth SBF) was <a href=\"https://www.theguardian.com/technology/2022/dec/13/sam-bankman-fried-ftx-charged-sec-crypto-exchange\">eventually arrested</a> at his multimillion-dollar residence in the Bahamas, a tax haven with nice beaches attached. The only mystery about this was the unconscionable length of time that it took the Bahamian authorities to measure him for handcuffs. The police said that he was arrested at the request of US legal authorities for “financial offences” under US and Bahamian laws connected with the FTX cryptocurrency exchange that he co-founded in 2019 and Alameda Research, a hedge fund that he set up in 2017. On Tuesday, a local court denied him bail, which suggests that an extradition request from the US will be granted and he will soon be appearing in a New York courtroom.</p><p>The grisly details of what SBF is alleged to be guilty of will emerge in forthcoming criminal proceedings. But already expectations are high: <a href=\"https://www.business-standard.com/article/international/amazon-is-making-series-on-ftx-with-marvel-movies-famed-russo-brothers-122112700858_1.html\">Amazon has announced</a> that it is working on a series about the scandal in partnership with the Russo brothers, the makers of Marvel movies.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/17/sam-bankman-fried-arrest-ftx-media-sec\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/uk-news/2022/dec/17/woman-dies-of-injuries-sustained-in-brixton-asake-concert-crush", "title": "Family pay tribute to woman who died after Brixton concert crush", "date_published": "2022-12-17 15:58:17+00:00", "description": "<p>Rebecca Ikumelo, 33, of Newham, died in hospital on Saturday</p><p>The family of Rebecca Ikumelo, who died after a crowd <a href=\"https://www.theguardian.com/uk-news/2022/dec/16/four-people-in-critical-condition-after-crush-at-o2-academy-brixton\">crush at a concert in Brixton</a> at the O2 Academy Brixton, have paid tribute to the mother of two for her “care, kindness and love”.</p><p>In a statement released through the Metropolitan police, her family said: “Rebecca was a graduate of nursing. She was an adorable mother of two children who loved working with kids.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/17/woman-dies-of-injuries-sustained-in-brixton-asake-concert-crush\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/17/argentinas-stand-in-lionel-scaloni-has-got-the-country-singing-again", "title": "Argentina’s stand-in Lionel Scaloni has got the country singing again", "date_published": "2022-12-17 15:30:24+00:00", "description": "<p>It was a job nobody wanted but the adaptable Scaloni has bonded with Lionel Messi and led his team to a World Cup final</p><p>All aboard the <em>Scaloneta</em>. There’s standing room only on the blue and white bus with Lionel Scaloni at the wheel, next stop the World Cup final: an entire country packed in, everyone right behind him, squeezed together, singing. It wasn’t always this way but as Muchachos, the song that has become the soundtrack of the last month, puts it: Argentina, land of Maradona and Messi that cried so many years, has its hope back. They have come a long way fast, and so has he, leading them back to Lusail on Sunday evening.</p><p>Scaloni was in a hotel gym in Spain when <a href=\"https://www.theguardian.com/football/2022/nov/18/lionel-scaloni-when-you-play-for-argentina-that-grrr-is-always-there\" title=\"\">the AFA called four years ago</a>, his first senior squad drawn up that evening as he walked along the beach with Pablo Aimar. There to coach the under-20s in L’Alcúdia, his may not have been the first number they dialled but he answered. “Nobody wanted to take the national team,” admits <a href=\"https://www.theguardian.com/football/2022/nov/21/argentina-interview-nicolas-tagliafico-messi?CMP=share_btn_tw\" title=\"\">Nicolás Tagliafico, among seven survivors from 2018</a>.</p> <a href=\"https://www.theguardian.com/football/2022/dec/17/argentinas-stand-in-lionel-scaloni-has-got-the-country-singing-again\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/17/exeter-bulls-champions-cup-rugby-union-match-report", "title": "Luke Cowan-Dickie’s first-half hat-trick lights up Exeter’s easy win over Bulls", "date_published": "2022-12-17 15:10:54+00:00", "description": "<ul><li>Pool A: Exeter 44-14 Bulls</li><li>South African side never in the game as Chiefs run away with it</li></ul><p>In theory this should have been a historic occasion: a top South African provincial side heading over the equator to test themselves in one of England’s most evocative venues. Despite the festive bonanza of tries, though, even Exeter’s fans left feeling slightly empty, having witnessed another contest that makes it difficult to hold up the Champions’ Cup as a club tournament without equal.</p><p>The Bulls, perfectly understandably, rested a large chunk of their squad ahead of their United Rugby Championship game against the Stormers in Cape Town this coming weekend. As their coach Jake White has made clear, there is no way the same group of players can compete in the URC, the Champions’ Cup and the Currie Cup and, selection-wise, something had to give.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/17/exeter-bulls-champions-cup-rugby-union-match-report\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/music/2022/dec/17/i-will-always-love-you-why-whitney-houstons-legacy-lives-on-10-years-after-her-death", "title": "I will always love you: why Whitney Houston’s legacy lives on 10 years after her death", "date_published": "2022-12-17 15:08:23+00:00", "description": "<p>With a new biopic, a branded makeup range and her place at the V&amp;A next summer, the late US singer is being discovered by a whole new generation of fans</p><p>They are among the most successful pop videos of the 1980s – certainly in terms of the sales they drove – and they made Whitney Houston’s huge voice familiar around the world. But for the British choreographer Arlene Phillips, who worked on the dance routine that accompanied 1987’s hit track I Wanna Dance with Somebody (Who Loves Me), there were clear signs of the acute self-doubt behind Houston’s talent even then.</p><p>“The funniest memory is how she hated her feet. She thought they were too big. It was always about what shoes she was going to wear and how I was going to make her walk,” the former <em><a href=\"https://www.theguardian.com/tv-and-radio/strictly-come-dancing\" title=\"\">Strictly Come Dancing</a></em> judge once recalled.</p> <a href=\"https://www.theguardian.com/music/2022/dec/17/i-will-always-love-you-why-whitney-houstons-legacy-lives-on-10-years-after-her-death\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/tv-and-radio/2022/dec/17/motsi-mabuse-strictly-tony-adams-interview", "title": "Motsi Mabuse: ‘You might grumble about the world, then you see Tony Adams doing a samba…’", "date_published": "2022-12-17 15:00:24+00:00", "description": "<p>The Strictly Come Dancing judge on Hamza’s courage on the dancefloor, her family Christmas in South Africa and what Craig Revel Horwood is really like</p><p>South African-born Latin dance champion Motshegetsi “Motsi” Mabuse, 41, was expected to become a lawyer and join the family law firm but dropped out while studying and moved to Hamburg to dance professionally. She found fame as a pro on <em>Let’s Dance</em>, the German version of <em><a href=\"https://www.theguardian.com/tv-and-radio/strictly-come-dancing\">Strictly Come Dancing</a>,</em> before joining the judging panel. In 2019, <a href=\"https://www.theguardian.com/tv-and-radio/2019/jul/22/motsi-mabuse-to-join-strictly-come-dancing-judging-panel\">she replaced Darcey Bussell </a>as a judge on the UK series. She runs <a href=\"https://motsimabuse--dietanzschule-de.translate.goog/?_x_tr_sl=de&amp;_x_tr_tl=en&amp;_x_tr_hl=en&amp;_x_tr_pto=sc\">a dance school</a> near Frankfurt with her second husband, Ukrainian dancer Evgenij Voznyuk, with whom she has a four-year-old daughter.</p><p><strong>What have you made of this series of </strong><em><strong>Strictly</strong></em><strong>?<br /></strong>I absolutely fell in love with [it]. We’ve not only had great couples but the standard of dance has been so high. It’s worked in both entertainment value and quality, which is extremely satisfying.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/17/motsi-mabuse-strictly-tony-adams-interview\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/17/ousmane-dembele-unlikely-france-comeback-set-for-thrilling-final-act", "title": "Ousmane Dembélé’s unlikely France comeback set for thrilling final act", "date_published": "2022-12-17 15:00:24+00:00", "description": "<p>The winger has grafted to lift France to another World Cup final but now wants to shine against former club-mate Lionel Messi</p><p>Ousmane Dembélé is a player who drifts in and out of focus. While Kylian Mbappé explodes down the left flank for France, Dembélé is more of a gliding presence on the opposite side. Sometimes marking him is like trying to catch smoke. The France winger has this lovely way of floating up the right, a softness to the way he dips inside and out, and when he is in full flow he is a bewitching sight, so slippery as he unbalances defenders with his feints, body swerves and zigzagging dribbling.</p><p>Those are the moments when it is easy to see why Barcelona, wounded after losing Neymar to Paris Saint-Germain, spent £97m on Dembélé five years ago. The problem, though, is there have not been enough good times for the 25-year-old. Sometimes he looks special but he often lets games pass him by, underlining why he barely featured for France in the four years leading up to this World Cup.</p> <a href=\"https://www.theguardian.com/football/2022/dec/17/ousmane-dembele-unlikely-france-comeback-set-for-thrilling-final-act\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/17/enrique-macaya-marquez-argentina-maradona-world-cup-qatar", "title": "‘I told Maradona to train harder’: Enrique Macaya Márquez, Argentina’s voice of football", "date_published": "2022-12-17 15:00:24+00:00", "description": "<p>The legendary broadcaster, who has been in Qatar to cover his 17th World Cup finals, reflects on an extraordinary career</p><p>Enrique Macaya Márquez, the legendary Argentinian broadcaster, the voice of football in his country for as long as anyone can care to remember, plots the timeline with his hands. He begins with Alfredo Di Stéfano. “For me, he was the best player of them all,” Macaya Márquez says. “Although, I suppose it depends on the era. I saw Johan Cruyff as being like Di Stéfano … So, Di Stéfano, Pelé, Cruyff, Maradona, Messi. On that timeline. They are the top five.”</p><p>Macaya Márquez is impeccably placed to comment. He grew up with Di Stéfano and was close enough to Diego Maradona to be invited to his wedding in 1989. “Maradona used to tell me that when he became a manager, he would take me as his assistant coach,” he adds.</p> <a href=\"https://www.theguardian.com/football/2022/dec/17/enrique-macaya-marquez-argentina-maradona-world-cup-qatar\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/stage/2022/dec/17/sarah-crompton-five-best-dance-shows-of-2022", "title": "Dance: Sarah Crompton’s five best shows of 2022", "date_published": "2022-12-17 15:00:23+00:00", "description": "<p>Past and present entwined in a sparkling postmodern revival, plus a sensational take on Stravinsky and Crystal Pite’s sublime dance of life</p><ul><li><a href=\"https://www.theguardian.com/culture/series/observer-critics--review-of-2022\">Read the Observer critics’ review of 2022 in full</a></li></ul><p>1. <strong><a href=\"https://www.theguardian.com/stage/2022/oct/23/light-of-passage-crystal-pite-royal-opera-house-royal-ballet-review-flight-pattern-full-length\">Light of Passage</a></strong><br /><strong>Royal Opera House, London; October</strong><br />A good year for the Royal Ballet was crowned by <a href=\"https://www.theguardian.com/stage/crystal-pite\">Crystal Pite</a>’s full-length work to Henryk Górecki’s <em>Symphony of Sorrowful Songs</em> that covered life, death and just about everything in between. Bringing children and veteran dancers on to the stage alongside the company’s fleet elite, the piece was full of beauty, sorrow and belief in the communicative power of dance. Sublime.</p><p>2. <strong><a href=\"https://www.theguardian.com/stage/2022/dec/04/israel-galvan-la-consagracion-de-la-primavera-review-stravinsky-rite-of-spring-reborn\">La Consagración de la Primavera (Rite of Spring)</a></strong><br /><strong>Sadler’s Wells, London; December</strong><br />We’ve seen three interpretations of Stravinsky’s <em>The Rite of Spring</em> this year. A specially created all-African company danced <a href=\"https://www.theguardian.com/stage/2022/jun/12/the-rite-of-spring-sadlers-wells-review-pina-bausch-foundation-ecole-des-sables-a-bruising-collision-of-life-sex-and-death\">Pina Bausch’s elemental version</a> and Mats Ek invented a searing domestic drama <a href=\"https://www.theguardian.com/stage/2022/nov/12/english-national-ballet-ek-forsythe-quagebeur-sadlers-wells-triple-bill-review-tamara-rojo-farewell-mats-ek-the-rite-of-spring-william-forsythe-blake-works-i-stina-quagebeur-take-five-blues\">for English National Ballet</a>. Both were terrific but neither matched this sensational solo by Israel Galván, which seemed to lay the bones of the music bare, with exhilarating flair.</p> <a href=\"https://www.theguardian.com/stage/2022/dec/17/sarah-crompton-five-best-dance-shows-of-2022\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/film/2022/dec/17/peter-von-kant-review-francois-ozon-gender-swapping-flirt-with-fassbinder", "title": "Peter von Kant review – François Ozon’s gender-swapping flirt with Fassbinder", "date_published": "2022-12-17 15:00:23+00:00", "description": "<p>A director’s infatuation with a boy turns sour in the French film-maker’s frothy reworking of The Bitter Tears of Petra von Kant</p><p>Director <a href=\"https://www.theguardian.com/film/2020/oct/18/francois-ozon-young-people-now-dont-have-the-inhibitions-older-actors-summer-of-85\">François Ozon</a> has had something of a lifelong creative crush on <a href=\"https://www.theguardian.com/film/2017/apr/24/rainer-werner-fassbinder-bfi-merchant-four-seasons\">Rainer Werner Fassbinder</a>. An early career breakthrough for Ozon came with the mannered but amusing ménage-à-quatre <em>Water Drops </em><em>on Burning Rocks</em>, based on a stage play that Fassbinder wrote when he was still in his teens. Now Ozon consummates his ongoing flirtation with the German auteur with his latest picture, a gender-swapped reworking of Fassbinder’s 1972 film <em>The Bitter Tears of Petra </em><em>von Kant</em>.</p><p>French actor Denis Ménochet stars as Peter, a decadent film director at the peak of his success and power who falls for Amir (Khalil Ben Gharbia), the young, staggeringly beautiful boy who wafts into Peter’s apartment (the film takes place entirely within Peter’s home) as the guest of Peter’s best friend, Sidonie (Isabelle Adjani).</p> <a href=\"https://www.theguardian.com/film/2022/dec/17/peter-von-kant-review-francois-ozon-gender-swapping-flirt-with-fassbinder\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/17/history-maker-rehan-ahmed-calls-england-debut-the-best-day-of-my-life", "title": "History-maker Rehan Ahmed calls England debut the ‘best day of my life’", "date_published": "2022-12-17 14:55:28+00:00", "description": "<ul><li>18-year-old becomes England’s youngest men’s Test cricketer</li><li>Leg-spinner overcomes nervous start to claim two key wickets</li></ul><p>Rehan Ahmed wore a smile as wide as the Arabian Sea as he walked off the pitch in Karachi and declared it “the best day of my life”. On a tour of Pakistan already dripping in history, Ahmed’s debut continued the theme when, aged 18 years and 126 days, he broke Brian Close’s record (18 years and 149 days against New Zealand in 1949) to become <a href=\"https://www.theguardian.com/sport/2022/dec/16/rehan-ahmed-to-become-england-youngest-ever-mens-test-debutant-cricket-azhar-ali\" title=\"\">England’s youngest men’s Test cricketer</a>.</p><p>But Leicestershire’s leg-spinning all-rounder, playing in his fourth first-class match, was not done: his crucial removals of Saud Shakheel and Faheem Ashraf either side of tea on day one of the third Test, as he finished with figures of two for 89 from 22 overs, underlined the potential Ben Stokes and Brendon McCullum have seen.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/17/history-maker-rehan-ahmed-calls-england-debut-the-best-day-of-my-life\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/17/leo-varadkar-ireland-taoiseach-coalition-government", "title": "Leo Varadkar returns as Ireland’s taoiseach in rotation agreement", "date_published": "2022-12-17 14:44:43+00:00", "description": "<p>Micheál Martin hands over to Fine Gael leader after two years at head of coalition government</p><p><a href=\"https://www.theguardian.com/world/leo-varadkar\">Leo Varadkar</a> has become <a href=\"https://www.theguardian.com/world/ireland\">Ireland</a>’s taoiseach after swapping posts with Micheál Martin, who took over as tánaiste, or deputy prime minister.</p><p>The Dáil, the Irish parliament, approved Varadkar’s nomination in a vote on Saturday that drew a line under Martin’s two-year premiership and put Varadkar at the head of the coalition government for the rest of its term.</p> <a href=\"https://www.theguardian.com/world/2022/dec/17/leo-varadkar-ireland-taoiseach-coalition-government\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/17/eve-hewson-i-have-a-cat-i-like-to-sleep-12-hours-a-night-", "title": "Eve Hewson: ‘I have a cat, I like to sleep 12 hours a night’", "date_published": "2022-12-17 14:00:22+00:00", "description": "The actor, 31, on starring in Bad Sisters, working with James Gandolfini, coming home to Dublin and not going skydiving<p><strong>I loved growing up </strong>in Dublin. I had a pretty normal childhood. I took the train to a local school every day. But I was a little rebellious. Sitting in a classroom wasn’t enough for me. Once I did my first film, at 15, I didn’t want to do anything else.</p><p><strong>I’m massively close</strong> to my three siblings. We’re very involved with each other and in each other’s lives. <a href=\"https://www.theguardian.com/tv-and-radio/sharon-horgan\" title=\"\">Sharon Horgan</a> [Hewson’s <em>Bad Sisters</em> co-star] understands those complicated relationships, the absolute love and the absolute anger, how you flip-flop between those emotions in a minute.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/17/eve-hewson-i-have-a-cat-i-like-to-sleep-12-hours-a-night-\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/17/us-president-nft-salesman-trump-finally-hit-rock-bottom", "title": "From US president to NFT salesman – has Trump finally hit rock bottom? | Arwa Mahdawi", "date_published": "2022-12-17 14:00:22+00:00", "description": "<p>Is anyone really stupid enough to waste their money on a digitally-generated image of Trump dressed like Superman? Apparently so</p><p>Oh how the mighty have fallen! Just a few years ago Donald Trump was the most powerful man in the world. He had an army of “yes men”, acolytes who hung on his every word. He was close to his family: his eldest daughter and his son-in-law were his special advisers. He had a Twitter account with millions of followers. He made policy and moved markets. He may have been something of a laughing stock, but he had power and influence.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/17/us-president-nft-salesman-trump-finally-hit-rock-bottom\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/music/2022/dec/17/steve-lacy-roundhouse-london-review-gemini-rights", "title": "Steve Lacy review – the real deal", "date_published": "2022-12-17 14:00:22+00:00", "description": "<p><strong>Roundhouse, London</strong><br />The feted young California singer-songwriter gives a blistering performance centred on his 2022 album Gemini Rights – a record so good he plays some of it twice…</p><p>No calendar year can ever belong to any single artist. But a 24-year-old guitarist from Compton, California – <a href=\"https://www.theguardian.com/music/2022/jul/08/steve-lacy-us-singer-tiktok-stevie-wonder-prince-kendrick-lamar-bisexual\">Steve Lacy</a> – can certainly lay claim to being one of 2022’s more satisfying success stories. On the first of two sold-out nights in London, the bandleader exudes a wiry, genial presence, as befits a creative who has entered their imperial phase.</p><p>Not so long ago, Lacy was a teenager, brought into hazy Los Angeles neo-funk outfit the Internet to play guitar. He ended up being <a href=\"https://www.thefader.com/2016/04/19/steve-lacy-the-internet-interview\">nominated for a 2016 Grammy </a>for his production work. Now, catapulted into working with A-listers such as <a href=\"https://www.youtube.com/watch?v=J87pJrxvJ5E\">Kendrick Lamar</a> and J Cole, he is two albums into a solo career – a storied prodigy who has pupated into the real deal.</p> <a href=\"https://www.theguardian.com/music/2022/dec/17/steve-lacy-roundhouse-london-review-gemini-rights\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/food/2022/dec/17/tiramisu-choux-buns-two-festive-twists-on-classic-desserts-recipes-big-mamma", "title": "Tiramisu and choux buns: two festive twists on classic desserts – recipes", "date_published": "2022-12-17 14:00:22+00:00", "description": "<p>A mountain of choux buns smothered in chocolate sauce and pistachio spread, plus a festive panettone tiramisu, from Big Mamma’s pastry guru</p><p>Two showstopping Christmas desserts. The first is a choco-pistachio choux bun spectacular: three buns a head will make a generous serving, and, if you have more guests, just make more buns and build a taller tower. The second is a festive take on <a href=\"https://bigmammagroup.com/en/accueil\">Big Mamma</a>’s signature tiramisu, and is a great way to use up leftover or old panettone (or to add a spiced, fruity twist to the traditional classic). Bear in mind, too, that I always weigh out liquids for baking – it’s just so much more precise – so I recommend you do the same.</p><p>Raphaël Henry is executive pastry chef for <a href=\"https://bigmammagroup.com/en/accueil\">Big Mamma Group UK</a>, including <a href=\"https://www.theguardian.com/food/2019/mar/08/gloria-london-ec2-restaurant-review-grace-dent\">Gloria</a>, <a href=\"https://www.bigmammagroup.com/en/trattorias/circolo-popolare\">Circolo Populare</a> and <a href=\"https://www.bigmammagroup.com/en/trattorias/ave-mario\">Ave Mario</a>; their fourth UK restaurant, Jacuzzi, opens in January 2023.</p> <a href=\"https://www.theguardian.com/food/2022/dec/17/tiramisu-choux-buns-two-festive-twists-on-classic-desserts-recipes-big-mamma\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/17/my-finale-frankie-dettori-set-to-retire-from-riding-after-2023-flat-season-horse-racing", "title": "‘My finale’: Frankie Dettori set to retire from riding after 2023 Flat season", "date_published": "2022-12-17 13:48:24+00:00", "description": "<ul><li>The 52-year-old hopes to bow out at next year’s Breeders’ Cup</li><li>Dettori retires after more than three decades as a Flat jockey</li></ul><p>Frankie Dettori is to retire from racing at the end of next year after a glittering career, the rider has confirmed.</p><p>Dettori, who celebrated his 52nd birthday on Thursday, will bring the curtain down on his time as one of the most popular jockeys to ever saddle up in the paddock.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/17/my-finale-frankie-dettori-set-to-retire-from-riding-after-2023-flat-season-horse-racing\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/live/2022/dec/17/croatia-morocco-world-cup-2022-third-place-playoff-live-score-updates", "title": "Croatia v Morocco: World Cup 2022 third-place playoff – live", "date_published": "2022-12-17 13:42:02+00:00", "description": "<ul><li>World Cup updates from the 3pm GMT /10am ET kick-off</li><li>And you can email Rob with your match thoughts <a href=\"mailto:rob.smyth@theguardian.com\">here</a></li></ul><p><strong>Croatia have happy memories of the third-place playoff. </strong>In 1998 they beat the Netherlands 2-1; more importantly, Davor Suker scored his sixth goal of the tournament, which gave him the Golden Boot ahead of Gabriel Batistuta and Christian Vieri. Look out also for an, ahem, unique celebration from Bolo Zenden.</p><p><strong>Wait, come back</strong></p> <a href=\"https://www.theguardian.com/football/live/2022/dec/17/croatia-morocco-world-cup-2022-third-place-playoff-live-score-updates\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/17/fifa-world-cup-qatar-international-football-argentina-france", "title": "Forget Fifa’s power play – Qatar’s World Cup has displayed international football at its finest", "date_published": "2022-12-17 13:30:21+00:00", "description": "<p>Argentina v France will be a fitting end to a tournament where the game proved bigger than problems that dogged it off pitch</p><p>“We are convinced of the power of our game.” A short phrase by Gianni Infantino, the president of Fifa, from his closing press conference at this winter’s World Cup. Compared with <a href=\"https://www.theguardian.com/football/2022/nov/19/gianni-infantino-does-his-football-jesus-act-during-bizarre-monologue-on-qatar\" title=\"\">his opening speech</a> some four weeks previously, a wild-eyed address that went viral in a manner unusual for sports administrators, it appears harmless enough. But the more you stare at the words, the more revealing the sentence becomes.</p><p><a href=\"https://www.theguardian.com/football/2022/dec/12/strange-unfair-history-world-cup-fair-play-award-england-japan-qatar\" title=\"\">The power of football </a>has been a matter of contention for the duration of Qatar 2022. What the world’s most popular spectator sport symbolises, what it can achieve, and what it can cover up have been the subject of intense debate. Tomorrow the tournament reaches its climax with a blue-chip final between France and Argentina. As the world tunes in, perhaps now is the time to draw conclusions as to the effect of such power.</p> <a href=\"https://www.theguardian.com/football/2022/dec/17/fifa-world-cup-qatar-international-football-argentina-france\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/gallery/2022/dec/17/the-quirky-and-wonderful-side-of-world-cup-2022-in-pictures", "title": "The quirky and wonderful side of World Cup 2022 – in pictures", "date_published": "2022-12-17 13:06:15+00:00", "description": "<p>A roundup of some of the stranger photographs from Qatar and beyond, featuring murals, animals and sweets</p> <a href=\"https://www.theguardian.com/football/gallery/2022/dec/17/the-quirky-and-wonderful-side-of-world-cup-2022-in-pictures\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/17/teenager-rehan-ahmed-takes-two-wickets-as-england-bowl-out-pakistan", "title": "Teenager Rehan Ahmed takes two wickets as England bowl out Pakistan", "date_published": "2022-12-17 13:04:21+00:00", "description": "<ul><li><a href=\"https://www.theguardian.com/sport/cricket/match/2022-12-17/england-cricket-team\">Third Test, day one: Pakistan 304, England 7-1</a></li><li>Ahmed makes history but visitors lose Zak Crawley for a duck</li></ul><p>The opening day of this series finale in the city of lights was another fast forward affair and one to savour for the travelling England supporters, their team chiselling out all 10 Pakistan wickets on a slow, low pitch. Among them was a pair of wickets to savour for young Rehan Ahmed.</p><p>It started with a kiss, Ahmed embraced by his doting father, Naeem, after receiving his cap in the huddle at the tender age of 18 years and 126 days. And it ended with his teammates abuzz at his success, England’s youngest men’s Test cricketer – a leg-spinner whose career has risen this year like one of the kites overhead in Karachi – claiming figures of two for 89 from 22 overs on debut.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/17/teenager-rehan-ahmed-takes-two-wickets-as-england-bowl-out-pakistan\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/uk-news/2022/dec/17/harry-and-meghan-invited-to-king-charles-coronation-report-suggests", "title": "Harry and Meghan invited to Charles’s coronation, report suggests", "date_published": "2022-12-17 12:02:38+00:00", "description": "<p>Invitation comes despite continued fallout from Duke and Duchess of Sussex’s Netflix documentary</p><p>The Duke and Duchess of Sussex will have a place at the king’s coronation should they wish to attend, despite the continued fallout from their Netflix documentary, it has been reported.</p><p>Harry and Meghan will be invited to Charles’s ceremony on 6 May, with all family members expected to feature on a guest list still to be drawn up, according to a report.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/17/harry-and-meghan-invited-to-king-charles-coronation-report-suggests\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/17/dawn-oporter-looks-back-flashback", "title": "Dawn O’Porter looks back: ‘That little girl went through an awful lot’", "date_published": "2022-12-17 12:00:19+00:00", "description": "<p>The TV presenter turned author on losing her mother at seven, meeting actor husband Chris O’Dowd, and becoming a writer</p><p>Born in Scotland in 1979, Dawn O’Porter is a TV presenter turned bestselling author. After studying acting at the Liverpool Institute for Performing Arts, she became a runner, before stepping in front of the camera in the early noughties for a string of zeitgeisty documentaries such as Super Slim Me, Extreme Wife, Mail Order Bride and later My Breasts Could Kill Me, exploring breast cancer, having lost her own mother to the condition. O’Porter pivoted to novel writing in 2006, and she has since written eight books – her latest, <a href=\"https://guardianbookshop.com/cat-lady-9780008385392\" title=\"\">Cat Lady</a>, is out now. She lives in Los Angeles with her two children and husband, actor <a href=\"https://www.theguardian.com/culture/chris-o-dowd\" title=\"\">Chris O’Dowd</a>.</p><p><strong>Here I am, four years old </strong>and getting my photo taken at primary school. I look quite miserable, probably because I wanted attention all the time, but got quite shy when someone actually gave it to me.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/17/dawn-oporter-looks-back-flashback\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/food/2022/dec/17/vegan-christmas-baklava-recipe-meera-sodha", "title": "Meera Sodha’s recipe for vegan Christmas baklava | The new vegan", "date_published": "2022-12-17 12:00:19+00:00", "description": "<p>Ready-made mincemeat, marzipan and filo sheets make this a relatively faff-free festive dessert</p><p>As much as I love cooking for people, I <em>adore</em> watching Poirot re-runs and playing rounds of Who Am I? on Christmas Day. This means getting well ahead of the cooking, and things such as this baklava are a bit of a no-brainer: it has all the fun and flavour of Christmas, but none of the faff. It’s made using ready-made mincemeat, marzipan and filo sheets, and so “making” it is actually more of an assembly job. And, just like me, it can then sit around quite happily for a week or so without any trouble.</p> <a href=\"https://www.theguardian.com/food/2022/dec/17/vegan-christmas-baklava-recipe-meera-sodha\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/tv-and-radio/2022/dec/17/making-prince-andrew-musical-kieran-hodgson-interview", "title": "‘We’re introducing viewers to the man behind the lack of sweat’: making Prince Andrew – The Musical", "date_published": "2022-12-17 11:55:20+00:00", "description": "<p>As part of its ‘Truth or Dare’ season, Channel 4 is setting the life of Prince Andrew to a series of song and dance numbers. But is this musical take on the disgraced royal too much, too soon?</p><p>When I arrive at Brocket Hall, a stately home in Welwyn Garden City, Prince Andrew is having his photograph taken on the grand staircase, a rose clamped between his teeth as a fleet of butlers dance around him. Or rather, not Prince Andrew, but the comedian Kieran Hodgson. He is in young Andrew mode today, in his military uniform and with a full head of hair, but Hodgson later tells me that as old Andrew, he looks truly awful. “I showed some pictures of old Andrew mode to my husband and said: “Look at these!” And he said: “I find you physically repellent.”</p><p>We are on the set of Channel 4’s upcoming Prince Andrew the Musical, written by Hodgson for the channel’s Truth and Dare: 40 Years of Pushing Boundaries season. Other programmes in the season have included shows on “challenging” topics such as Too Large for Love, a documentary about men living with extra-large penises, and another about an Afghan porn star. To do a musical about Prince Andrew was Channel 4’s idea, according to producer Adam Reeve. “We were very excited that they were willing to go there,” he tells me.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/17/making-prince-andrew-musical-kieran-hodgson-interview\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/17/insulate-britain-on-what-happened-next-energy-crisis", "title": "‘We’ll be hated, but it will stir things up’: Insulate Britain on what happened next – and being right all along", "date_published": "2022-12-17 11:55:19+00:00", "description": "<p>Their sit-down protests caused chaos on roads and made them a target for tabloid ire and drivers’ fury. Then an energy crisis hit – and now the government is playing catchup as we shiver in our draughty homes </p><p>Shortly before 8am on 13 September 2021, 92 people gathered in small groups at five junctions along the M25, the busy motorway that encircles most of Greater London. It was a warm day and adrenaline ran high.</p><p>Cameron Ford, a 31-year-old carpenter, was at junction 3, in Kent. The protesters gathered at the side of the road and prepared for the crucial moment. They did a group meditation on a grassy layby, rush-hour traffic roaring in the background. Louise Lancaster, a 56-year-old teacher with sharp blue eyes, was at junction 31, in Essex. They had amassed in a car park, and everyone took turns running into a nearby shopping centre to use the toilet. David Nixon, a 36-year-old care worker from Yorkshire, had woken early that morning feeling sick. As the group huddled together at junction 14, in Surrey, he found himself completely overwhelmed.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/17/insulate-britain-on-what-happened-next-energy-crisis\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/17/china-shanghai-schools-online-classes-covid-infections", "title": "Shanghai schools ordered to hold classes online to stem Covid infections", "date_published": "2022-12-17 11:27:54+00:00", "description": "<p>City’s kindergartens and childcare centres also to stop in-person lessons as cases rise across China after easing of restrictions</p><p>Shanghai’s education bureau has told schools to hold classes online from Monday as rising numbers of Covid infections hit cities across China.</p><p>On Saturday the bureau also instructed kindergartens and childcare centres in the city to shut all in-person classes, according to an online statement.</p> <a href=\"https://www.theguardian.com/world/2022/dec/17/china-shanghai-schools-online-classes-covid-infections\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/uk-news/2022/dec/17/home-secretary-suella-braverman-acting-unlawfully-over-asylum-seeker-support-high-court-rules", "title": "Braverman acting unlawfully over asylum seeker support, high court rules", "date_published": "2022-12-17 11:08:17+00:00", "description": "<p>Ruling follows legal challenge over amount of financial support given to asylum seekers during cost of living crisis</p><p>The home secretary is acting unlawfully in failing to ensure the rate of support for more than 50,000 asylum seekers is adequate by not implementing an increase of almost £5 a week recommended by officials, the high court has ruled.</p><p>In a case brought in the high court in Manchester by an asylum seeker known only as CB, the amount of financial support given to asylum seekers during the cost of living crisis was challenged. Internal Home Office advice to ministers was disclosed, which revealed that officials told ministers the current rate of £40.85 a week was no longer sufficient to meet basic needs because of the cost of living crisis.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/17/home-secretary-suella-braverman-acting-unlawfully-over-asylum-seeker-support-high-court-rules\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/17/young-country-diary-we-found-a-freezing-goldfinch-in-the-garden", "title": "Young country diary: We found a freezing goldfinch in the garden | Summer", "date_published": "2022-12-17 11:01:18+00:00", "description": "<p><strong>East Sussex:</strong> I went out to fill the birdfeeder, and there it was, just a few minutes away from death</p><p>It was morning in the valley, and I knew it had hailed outside and all the water was ice. The birds were frantically feeding on all the seeds; there’s a group of about 30 that come here often. When I went out to feed them, I saw there was a goldfinch that was frozen. It was a few minutes away from death!</p><p>My dad and I brought the bird inside. She wouldn’t open her mouth to drink. We started to worry, so we piled her up in warm blankets. There still was a chance she could stay alive, and just then she started to drink. She was really thirsty so we got her a dropper and some warm water, and I looked up how to save a freezing bird. I was scared that she might be in pain. She was so gentle, small and fragile.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/17/young-country-diary-we-found-a-freezing-goldfinch-in-the-garden\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/17/how-to-party-if-youre-shy-socially-awkward-or-just-plain-boring", "title": "How to party if you’re shy, socially awkward – or just plain boring", "date_published": "2022-12-17 11:00:19+00:00", "description": "<p>Three writers who struggle with socialising explain how they make it through festive season</p><p>Fanny Brice was right. People who need people <em>are</em> the luckiest people, at least when party season rolls around. Imagine, if you will, <em>wanting</em> to go to a party. Imagine knowing that you will have a good time – that the mere experience of being around people fills you, as a matter of course, with joy and contentment. That you go home with a spring in your step, a song in your heart, a smile on your lips – refreshed, restored, rejuvenated and ready for the next one.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/17/how-to-party-if-youre-shy-socially-awkward-or-just-plain-boring\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/17/easter-island-statues-chile-moai-wildfire", "title": "Easter Island rebounds from wildfire that damaged famous statues", "date_published": "2022-12-17 11:00:18+00:00", "description": "<p>October fire blackened with soot monolithic human figures, of which there are more than 900, carved centuries ago</p><p>The hillside of Rano Raraku volcano on Rapa Nui feels like a place that froze in time.</p><p>Embedded in grass and volcanic rock, almost 400 moai – the monolithic human figures carved centuries ago by this remote Pacific island’s Rapanui people – remained untouched until recently. Some are buried from the neck down, the heads seemingly observing their surroundings from the underground.</p> <a href=\"https://www.theguardian.com/world/2022/dec/17/easter-island-statues-chile-moai-wildfire\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/books/2022/dec/17/innocence-sex-and-war-geoff-dyer-on-why-the-go-between-is-a-novel-for-our-time", "title": "Innocence, sex and war: Geoff Dyer on why the Go-Between is a novel for our time", "date_published": "2022-12-17 11:00:18+00:00", "description": "<p>When the novelist finally read The Go-Between, almost 70 years after its publication, he shared the same perspective as the novel’s ‘60-odd’ narrator, finding unintended echoes of the future in the past</p><p>“The past is a foreign country” has finally become part of my present. I’ve just read LP Hartley’s 1953 novel The Go-Between for the first time, a book everyone else my age read at least 45 years ago. I’d seen the film and that seemed to be enough. And then, a few weeks ago, I came across a seductive Penguin edition in a secondhand bookshop in Edinburgh and became curious to find out what I’d been missing.</p><p>A book about a boy becoming initiated into the mysteries of adult life (sex and its frequent thematic partner, betrayal), it is itself the kind of novel that introduces youngish readers into the mysteries and subtleties of fiction. Reading the novel is part of the process of learning how to read novels. But there was something appropriate, also, about the long delay in my getting round to it. I was reading The Go‑Between at the same age as the “60-odd” narrator when he looks back at the momentous summer of 1900. As a result, my experience of the book became inflected with the reading that had come between the age when I might or should have read it and the advanced age when I eventually did.</p> <a href=\"https://www.theguardian.com/books/2022/dec/17/innocence-sex-and-war-geoff-dyer-on-why-the-go-between-is-a-novel-for-our-time\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/17/melbourne-a-league-derby-abandoned-as-fans-storm-pitch-and-keeper-attacked", "title": "Melbourne A-League derby abandoned as fans storm pitch and keeper attacked", "date_published": "2022-12-17 10:02:43+00:00", "description": "<ul><li>Incident leaves City goalkeeper Tom Glover with bloodied face</li><li>Flares thrown on to pitch from both sets of fans at AMMI Park</li></ul><p>The A-League Men Melbourne derby descended into chaos after fans invaded the pitch amid ugly scenes at AAMI Park that left the City goalkeeper Tom Glover bloodied and the match abandoned for player safety reasons.</p><p>League leaders City were ahead through Aiden O’Neill’s 11th-minute goal when trouble erupted in the 22nd minute of the match. Both sets of fans had been throwing flares on to the pitch but the situation escalated when a flare appeared to hit a Channel 10 cameraman, then exploded when Glover picked another off the ground and threw it back into the stands.</p> <a href=\"https://www.theguardian.com/football/2022/dec/17/melbourne-a-league-derby-abandoned-as-fans-storm-pitch-and-keeper-attacked\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/money/2022/dec/17/draught-excluders-cut-energy-bills", "title": "Mind the gap: draught excluders are back as Britons rush to cut energy bills", "date_published": "2022-12-17 10:00:18+00:00", "description": "<p>The 1970s staple is once again becoming a hot product, with energy costs rising and temperatures falling</p><p>You already have a low-energy air fryer sitting in pride of place in the kitchen, and an electric throw to snuggle under while watching TV. But are you using what is fast becoming the UK’s must-have accessory, a draught excluder?</p><p>After a week of shivering in below-zero temperatures that have cruelly exposed any draughty gaps in people’s homes, householders are fighting back and increasingly turning to the long-forgotten furnishing item.</p> <a href=\"https://www.theguardian.com/money/2022/dec/17/draught-excluders-cut-energy-bills\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/17/portrait-bidding-war-audrey-amiss", "title": "This obscure portrait gave me goosebumps – but I never expected a bidding war | Carol Morley", "date_published": "2022-12-17 10:00:18+00:00", "description": "<p>My film about Audrey Amiss, whose career was overshadowed by illness, was done. Now I had a chance to own a piece of her work</p><ul><li>Carol Morley is a film-maker, and the director of Typist Artist Pirate King</li><li>What was the image on your phone that defined 2022? <br /><a href=\"https://www.theguardian.com/commentisfree/series/snapshot-of-2022\">Writers give their perspectives</a></li></ul><p>In late September, I received a direct message on Instagram: “Hi, I read a <a href=\"https://www.theguardian.com/artanddesign/2016/nov/20/carol-morley-discovers-amazing-life-of-artist-audrey-amiss\">piece</a> you did about the artist Audrey Amiss in the Guardian a few years ago. Wondering if she’s still of interest. Think I’ve found one of her works. Thanks.” Sent by Ant Cosgrove of <a href=\"https://www.pinterest.com/pin/the-northern-art-page-pod-on-instagram-joan-eardley-19211963-snow-c1958-collection-national-gall--802274121129131367/\">thenorthernartpage</a>, this message arrived just as a BFI-backed feature <a href=\"https://www.imdb.com/title/tt16060476/\">film</a> I had written and directed, starring Monica Dolan as Amiss and Kelly Macdonald as her psychiatric nurse, was being completed. Conceived at the start of my Wellcome screenwriting fellowship, during which I researched Amiss’s vast archive, the title of the film was taken from the occupation she had put in her passport: Typist Artist Pirate King.</p><p>I told Cosgrove that I was “intrigued” by the possible Amiss work he had found – downplaying the fact that his message had given me goosebumps. He replied that he was a “proper art nerd”, and outlined how he had researched an unsigned painting coming up for auction. Armed with the title of the piece, Portrait of a Girl, together with the auction house’s online photograph of the rear of the frame, on which was written “exhibited at the Royal Academy 1957” and “Holland Park”, he looked into the original catalogue of the exhibition of the Royal Academy of Arts from 1957. While it had no reproductions of the art exhibited, there were three paintings titled Portrait of a Girl – and one of them was by Amiss and gave her address.</p><p>Carol Morley is a film-maker, and the director of Typist Artist Pirate King</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/17/portrait-bidding-war-audrey-amiss\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/17/losing-my-mother-as-my-baby-was-born", "title": "‘I knew she was dying, but didn’t expect her to time it so spectacularly’: losing my mother as my baby was born", "date_published": "2022-12-17 10:00:18+00:00", "description": "<p>As I lay in the maternity ward, I learned my mother was gravely ill. What followed was a year full of love, rage, resentment – and a strange cocktail of new life and imminent death</p><p>At the top of my fridge is a small ceramic jar of stilton, and every time I open the door I can smell it. Recently, it’s started contaminating other food. This morning I binned some butter after it took on the same scent.</p><p>The stilton went off in July 2019 but I can’t bring myself to throw it away. It was a flat-warming gift from my mother, even though my boyfriend, Oscar, hates strong cheese and I was then six months pregnant, so unable to eat it. When she produced it from a calligraphed paper bag, wrapped in green tissue, we didn’t tell her this. Instead, we thanked her and put the cheese in the fridge. When we moved flats two years later, the cheese came with us.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/17/losing-my-mother-as-my-baby-was-born\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/food/2022/dec/17/festive-pear-sherry-trifle-recipe-updown-farmhouse-kent-oli-brown", "title": "Oli Brown’s recipe for a festive pear-and-sherry trifle", "date_published": "2022-12-17 10:00:17+00:00", "description": "<p>The chef of the celebrated Updown Farmhouse in Kent shares his favourite Christmas dessert</p><p>A trifle is not just for Christmas! It is one of the best puddings in the world. Deep down, I don’t really care about the fruit; the truth is, it’s a vessel for everything else – the layers of boozy sponge, the jelly, the custard, the cream. But I suppose the addition of pears or quinces in lieu of, say, strawberry jam gives it a slightly more sophisticated and, of course, seasonal look.</p><p>Oli Brown is chef/co-owner of <a href=\"https://updownfarmhouse.com/\">Updown Farmhouse</a>, Betteshanger, Kent</p> <a href=\"https://www.theguardian.com/food/2022/dec/17/festive-pear-sherry-trifle-recipe-updown-farmhouse-kent-oli-brown\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/17/smart-shot-joe-macdonald-best-phone-picture", "title": "‘It was such a Wes Anderson moment’: Joe Macdonald’s best phone picture", "date_published": "2022-12-17 10:00:17+00:00", "description": "<p>The cameraman captured the three girls bickering in a perfect movie-style shot. The next moment, they were smiling again</p><p>The argument broke out a few minutes into the rickety tram ride from Port de Sóller in Mallorca. Sisters Rosa, four, on the right, and Lois, seven, nearest the camera, were bickering with their friend Bibi, eight, all three a little cranky after a busy day on the beach. Their parents sat opposite, and Rosa and Lois’s dad, Joe Macdonald, used his iPhone 13 Pro Max to capture the scene.</p><p>“It was late afternoon, maybe five or six, so the lighting was just right,” Macdonald says. “I work with camera and lighting for film and TV, so spend a lot of time looking at monitors, and know how fortunate it is to capture a moment that has drama but is also real. </p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/17/smart-shot-joe-macdonald-best-phone-picture\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/film/2022/dec/17/angelina-jolie-un-refugee-agency-unhcr-ambassador", "title": "Angelina Jolie leaves role as UN refugee agency ambassador", "date_published": "2022-12-17 09:41:14+00:00", "description": "<p>UNHCR praises actor for her ‘tireless’ work in countries including Yemen and Burkina Faso since 2001</p><p>Angelina Jolie is stepping down from her role as an ambassador for the UN’s refugee agency.</p><p>The Oscar-winning actor said refugees were “the people I admire most in the world” and that she would now focus her time working with organisations led by people most directly affected by conflict.</p> <a href=\"https://www.theguardian.com/film/2022/dec/17/angelina-jolie-un-refugee-agency-unhcr-ambassador\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/17/phil-wang-be-remembered-as-man-solved-nuclear-fusion", "title": "Phil Wang: ‘How would I like to be remembered? As the man who solved nuclear fusion’", "date_published": "2022-12-17 09:30:16+00:00", "description": "<p>The standup and author on overcoming shyness, dying on stage, and dressing for the apocalypse</p><p>Comedian Phil Wang, 32, was born in Stoke-on-Trent and raised in Malaysia. He studied engineering at Cambridge University, where he became president of the Footlights. Last year, he released a Netflix comedy special, <a href=\"https://www.theguardian.com/stage/2021/aug/10/phil-wang-netflix-special-review\" title=\"\">Philly Philly Wang Wang</a>, and published a book, <a href=\"https://guardianbookshop.com/sidesplitter-9781529350272\" title=\"\">Sidesplitter: How to Be from Two Worlds at Once</a>. The UK and Ireland leg of his world tour, <a href=\"https://www.seetickets.com/tour/phil-wang\" title=\"\">Wang in There, Baby!</a> begins in spring 2023. He is single and lives in London.</p><p><strong>What is your greatest fear?</strong><br />Nuclear annihilation. And not having the right clothes for it.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/17/phil-wang-be-remembered-as-man-solved-nuclear-fusion\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/artanddesign/2022/dec/17/national-gallery-botched-restoration-nativity", "title": "‘Almost as botched as Monkey Christ!’ Has the National Gallery ruined a Nativity masterpiece?", "date_published": "2022-12-17 09:00:17+00:00", "description": "<p>The restoration of this treasure took three years. So why do the shepherds look so gormless? Is the curly-haired one at a school disco – and is the other trying to remember where he parked the donkey?</p><p>The National Gallery has ruined Christmas. Or, to be more precise, it has had a very good go at wrecking one of the world’s greatest Nativity paintings. The fact that Piero della Francesca’s Nativity is back on view for the festive season, after a three-year restoration <a href=\"https://www.nationalgallery.org.uk/about-us/press-and-media/press-releases/following-three-year-restoration-piero-s-nativity-returns-to-public-display-for-christmas-with-long-standing-mysteries-answered\">the London gallery vaunts as careful and revealing</a>, should be glad tidings. But my joy turned to ash when I saw it. What in the name of God inspired the restorers to paint two completely new and distractingly moronic shepherd’s faces? Or a big white blob on the stable wall?</p><p>The Nativity, a mysterious and elusive work of haunting wonder, has been, oh so carefully and responsibly, rendered clumsy and plodding, if not downright comical. Almost every colour has been altered, every line re-emphasised. It’s like a garish digital reconstruction of what the painting may have looked like in 1475 when it was new – except, instead of offering this as a hypothetical, it has been physically repainted or, in the evasive language of restorers, “retouched”.</p> <a href=\"https://www.theguardian.com/artanddesign/2022/dec/17/national-gallery-botched-restoration-nativity\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/17/ukraine-greatest-threat-russian-world-vladimir-putin", "title": "In Ukraine, I saw the greatest threat to the Russian world isn’t the west – it’s Putin | Timothy Garton Ash", "date_published": "2022-12-17 09:00:16+00:00", "description": "<p>The Kremlin’s imperial war has made its own culture and language a common enemy for people across its former empire</p><p>The time has come to ask whether, objectively speaking, Vladimir Putin is an agent of American imperialism. For no American has ever done half as much damage to what Putin calls the “Russian world” as the Russian leader himself has.</p><p>This thought came to me recently when I was in the Ukrainian city of Lviv, talking to Ukrainians made refugees in their own country by Putin’s war. “I was a Russian speaker until 24 February,” said Adeline, an art student from the now Russian-occupied town of <a href=\"https://www.theguardian.com/world/2022/dec/08/it-has-been-machine-guns-lately-fighting-intensifies-in-southern-kherson-dnipro-kyiv\">Nova Kakhovka</a>, referencing the date of Russia’s full-scale invasion earlier this year. Russia has failed to take over Ukrainian culture, she said, so now it has set out to kill it. Several other Ukrainian students told me they find “the spirit of freedom” in Ukrainian literature, but of subservience to power in Russian literature.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/17/ukraine-greatest-threat-russian-world-vladimir-putin\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/books/2022/dec/17/ive-been-banned-since-the-beginning-jason-reynolds-talks-to-joseph-coelho", "title": "‘I’ve been banned since the beginning’: Jason Reynolds talks to Joseph Coelho", "date_published": "2022-12-17 09:00:16+00:00", "description": "<p>The UK children’s laureate and America’s ambassador for young people’s literature discuss finding a voice and how to get kids reading</p><p>Joseph Coelho and Jason Reynolds have plenty in common. Both are award-winning authors who are currently national representatives for children’s literature: earlier this year, Coelho became the UK children’s laureate, while Reynolds holds the equivalent role in the US, the national ambassador for young people’s literature. They are around the same age (Coelho is 42 and Reynolds is 38), both found a love for words through poetry, and both are Black writers passionate about making the white-dominated world of children’s books more diverse. They also both never read books as young children.</p><p>Coelho grew up in a single parent family in Roehampton, south-west London, with “a teen mother who was doing her best, but had herself left school at a very young age”. He wasn’t read to at home, and couldn’t read properly until he was about seven or eight. At that point, he managed to catch up with his peers and found a love of books through his local library’s <a href=\"https://summerreadingchallenge.org.uk/\" title=\"\">summer reading challenge</a>. An inspirational school visit from “the late great” Jean “Binta” Breeze made him realise that he could be a writer too, and ultimately sparked his career as a poet and picture-book author.</p> <a href=\"https://www.theguardian.com/books/2022/dec/17/ive-been-banned-since-the-beginning-jason-reynolds-talks-to-joseph-coelho\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/live/2022/dec/17/world-cup-2022-latest-news-blog-croatia-morocco-argentina-france-live", "title": "World Cup 2022: buildup to the final, plus Croatia v Morocco news – live", "date_published": "2022-12-17 08:37:54+00:00", "description": "<ul><li>Updates from Qatar with third-place playoff at 3pm GMT</li><li>And you can <a href=\"mailto:john.brewin.casual@theguardian.com\">email John</a> or tweet <a href=\"https://twitter.com/JohnBrewin_\">@JohnBrewin_</a></li></ul><p><strong>Let’s start with the big one, the third-place playoff.</strong></p><p>From today’s World Cup briefing: </p><p><strong>Another chance to see Infantino</strong><br />It seems within seconds of any World Cup match starting, the camera pans to Fifa president Gianni Infantino looking glum in the stands. The host broadcast camera operator always knows where to find him, allowing the world to celebrate his greatness. Rarely has he looked happy when watching a match but he is always there, committed to the cause like a parent on muddy sidelines every weekend. He will make the best of the occasion to celebrate football as a cohesive power for good or some such, while ignoring the empty seats. And if that does not entice you, then nothing will.</p> <a href=\"https://www.theguardian.com/football/live/2022/dec/17/world-cup-2022-latest-news-blog-croatia-morocco-argentina-france-live\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/17/australia-south-africa-first-test-day-one-report", "title": "Travis Head puts Australia in charge against South Africa after Warner’s golden duck", "date_published": "2022-12-17 08:28:51+00:00", "description": "<ul><li>South Africa 152; Australia 145-5 | Australia trail by seven runs</li><li>Head unbeaten on 78 at stumps on day one of first Test</li></ul><p>Test match cricket got a burst of life for the southern summer, as 29,306 people turned up for the biggest non-Ashes crowd ever hosted at the Gabba. They were treated to a sizzling first day: Australia dismissed South Africa for 152 just before the tea break, slipped to 27 for three in reply, produced an astonishing counterattack from Travis Head and Steve Smith, then lost Smith and nightwatchman Scott Boland to reach stumps at 145 for five, still seven runs behind.</p><p>It was another Brisbane special from Head, who followed his Ashes century a year ago with a carefree 78 not out from 77 balls in the final session. Smith had already begun positively, hitting his first ball through cover for four and producing some immaculate straight drives.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/17/australia-south-africa-first-test-day-one-report\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/society/2022/dec/17/english-hospitals-urged-to-free-up-beds-before-ambulance-staff-strike", "title": "English hospitals urged to free up beds before ambulance staff strike", "date_published": "2022-12-17 08:27:22+00:00", "description": "<p>Hospitals are told strikes on 21 and 28 December – also taking place in Wales – will lead to ‘extensive disruption’ </p><p>Hospitals in England should free up as many beds as possible to prepare for “extensive disruption” caused by the ambulance staff strikes, NHS bosses have said.</p><p>Ambulance staff in England and Wales are due to strike on 21 and 28 December.</p> <a href=\"https://www.theguardian.com/society/2022/dec/17/english-hospitals-urged-to-free-up-beds-before-ambulance-staff-strike\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/books/picture/2022/dec/17/tom-gaulds-gift-finder-cartoon", "title": "Tom Gauld’s gift finder – cartoon", "date_published": "2022-12-17 08:00:16+00:00", "description": "<p> </p> <a href=\"https://www.theguardian.com/books/picture/2022/dec/17/tom-gaulds-gift-finder-cartoon\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/uk-news/2022/dec/17/two-pms-a-race-row-and-harry-meghan-charles-first-100-days-as-king", "title": "Two PMs, a race row and Harry & Meghan: Charles’ first 100 days as king", "date_published": "2022-12-17 08:00:16+00:00", "description": "<p>Amid a steady stream of controversy, keeping calm and presenting a united front remains the monarchy’s mantra</p><p>The king could have been forgiven if he allowed himself a small, rueful smile as the Prince of Wales gave a reading on the spirit of togetherness at the royal family’s Westminster Abbey carol service hosted by the Princess of Wales this week.</p><p>Hours earlier, a recalcitrant Duke of Sussex had <a href=\"https://www.theguardian.com/uk-news/2022/dec/15/prince-william-bullied-sussexes-royal-duties-harry-meghan\">torpedoed any sense of that spirit within the family fold.</a> Now Prince William – the embodiment of the institution according to brother Harry – found himself reciting their late grandmother’s 2012 Christmas message on that very theme.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/17/two-pms-a-race-row-and-harry-meghan-charles-first-100-days-as-king\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/business/2022/dec/17/baby-banks-parents-of-living-crisis-families", "title": "‘It gives us hope’: how baby banks are helping parents in the cost of living crisis", "date_published": "2022-12-17 08:00:16+00:00", "description": "<p>Charities provide struggling families with much-needed items such as toys, nappies and buggies, as well as advice</p><p>“Sometimes my daughter would ask me: ‘Daddy, can we get these toys?’ – but I didn’t have any money. Being a father, I don’t want to show the sad expressions on my face to my children. This kind of support means at least I can give things to my kids, like clothes and toys.”</p><p>It is a chilly Monday afternoon in north London and a father in his 30s is talking about the help he has received from <a href=\"https://littlevillagehq.org/\" title=\"\">Little Village</a>.</p> <a href=\"https://www.theguardian.com/business/2022/dec/17/baby-banks-parents-of-living-crisis-families\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/tv-and-radio/2022/dec/17/mayflies-interview-martin-compston-tony-curran-andrea-gibb-bbc-andrew-o-hagan", "title": "‘I’m getting a wee bit choked up’: Martin Compston and Tony Curran on their hugely moving new drama", "date_published": "2022-12-17 08:00:16+00:00", "description": "<p>Would you help your best pal to die? That’s the question posed by Andrea Gibb’s devastating new series Mayflies. The real-life friends discuss couch-surfing, working together – and AC-12 mania</p><p>Martin Compston – AKA strait-laced DI Steve Arnott in Line of Duty – was a long way from AC-12 when he received the script for Mayflies, based on <a href=\"https://www.theguardian.com/books/2020/sep/12/mayflies-by-andrew-ohagan-review-a-bittersweet-tale-of-friendship\">Andrew O’Hagan’s novel</a> about lifelong friends plunged into a crisis in adulthood. “I was in a field in Budapest after an Arctic Monkeys gig when I got the email,” says the actor, from his home in Las Vegas. “I saw Tony was in it and thought, ‘Is this for real?’” That’s Tony Curran, with whom he has been pals since they played menacing Glaswegian miscreants in the haunting 2006 thriller Red Road. “The big man really took me under his wing,” he says.</p><p>Like the chipmunk-cheery Compston, the dry, droll Curran is a Scot abroad: he joins our call from Los Angeles, where he has lived for nearly 20 years. Compston even kipped on his kitchen floor once when he was in LA for pilot season. “I gave you a couch at least, didn’t I?” says Curran. “Not at first, cos there was someone else on it,” says Compston. “Aye, it’s a lot like the YMCA, my pad,” Curran concedes.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/17/mayflies-interview-martin-compston-tony-curran-andrea-gibb-bbc-andrew-o-hagan\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/film/2022/dec/17/streaming-the-best-festive-crowd-pleasers-recent-films-to-watch-at-christmas-2022", "title": "Streaming: the best crowd-pleasers​ to watch this festive season", "date_published": "2022-12-17 08:00:15+00:00", "description": "<p>Tired of It’s a Wonderful Life? This Christmas, try feasting with family and friends on recent films ranging from Top Gun: Maverick to Pinocchio and The Banshees of Inisherin</p><p>From the lengthy list of unenviable tasks that Christmas brings, “choosing what to watch” is hardly the most labour-intensive, though it is quietly high-stakes. Finding a film that all factions of the family can enjoy – or at least endure – is a thankless task; choose a dud and you’ll be reminded of your error every Christmas for the rest of your life. (As the film critic in the family, I accept this burden.)</p><p>Small wonder, then, that many simply settle for rewatching <em><a href=\"https://www.justwatch.com/uk/movie/its-a-wonderful-life\">It’s a Wonderful Life</a> </em>or <em><a href=\"https://www.justwatch.com/uk/movie/bridget-joness-diary\">Bridget Jones’s Diary</a></em> year after year. But for those seeking to switch things up, a number of recent streamable crowdpleasers should fit the bill for families of various descriptions. Anecdotally, I already know a few people who have pencilled in the year’s biggest film, <strong><a href=\"https://www.justwatch.com/uk/movie/top-gun-maverick\">Top Gun: Maverick</a></strong>, for Christmas Day viewing, which makes sense. Tom Cruise’s slick flyboy reboot is new and sexy enough for teens, nostalgic enough for their parents, and undemanding enough to watch on a full stomach in a sherry-induced fog.</p> <a href=\"https://www.theguardian.com/film/2022/dec/17/streaming-the-best-festive-crowd-pleasers-recent-films-to-watch-at-christmas-2022\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/education/2022/dec/17/climate-change-studies-connecticut", "title": "‘Face it head on’: Connecticut makes climate change studies compulsory", "date_published": "2022-12-17 08:00:14+00:00", "description": "<p>Enshrining the curriculum in law insulates the subject from budget cuts and culture wars related to the climate crisis</p><p>Starting next July, Connecticut will become one of the first states in America to mandate climate change studies across its public schools as part of its science curriculum.</p><p>The new law passed earlier this year comes as part of the state’s attempts to address concerns over the short duration – and in some cases, absence – of climate change studies in classrooms. The requirement follows in the footsteps of New Jersey, which in 2020 became the first state to mandate K-12 climate change education across its school districts.</p> <a href=\"https://www.theguardian.com/education/2022/dec/17/climate-change-studies-connecticut\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/17/didier-deschamps-a-born-competitor-with-only-one-mission-in-life-to-win", "title": "Didier Deschamps: a born competitor with only one mission in life – to win", "date_published": "2022-12-17 07:30:14+00:00", "description": "<p>Victory in Sunday’s World Cup final against Argentina is all that matters for a man who has come to favour prose over poetry</p><p>This has already been a World Cup of records for France, who are chasing a third title in less than a quarter of a century on Sunday. <a href=\"https://www.theguardian.com/football/2022/dec/15/france-hugo-lloris-world-cup-final-sunday-argentina-greatest-goalkeeper\" title=\"\">The captain, Hugo Lloris</a>, will celebrate his 145th cap against Argentina, three more than the previous record holder, Lilian Thuram. Olivier Giroud equalled, then surpassed, the 52 goals that Thierry Henry had scored for <em>Les Bleus</em>. Antoine Griezmann, one of this tournament’s standout performers, has now played a barely believable 72 consecutive games for France.</p><p>Then there is Didier Deschamps, who will be attempting to win the World Cup for a third time to go level with Pelé, the only other person to have achieved that feat; Deschamps, one of only three men, the others being Brazil’s Mário Zagallo and Germany’s Franz Beckenbauer, to become a world champion as a manager and as a player; Deschamps who, if France win on Sunday, will have a legitimate claim to be considered the most decorated man in the history of the game; Deschamps, who only joined a football club at the age of 11, and has certainly made up for lost time since then.</p> <a href=\"https://www.theguardian.com/football/2022/dec/17/didier-deschamps-a-born-competitor-with-only-one-mission-in-life-to-win\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/books/2022/dec/17/is-mother-dead-by-vigdis-hjorth-a-daughters-lament", "title": "Is Mother Dead by Vigdis Hjorth – a daughter’s lament", "date_published": "2022-12-17 07:30:14+00:00", "description": "<p>The author of the controversial Will and Testament reopens old wounds in this gripping account of family trauma</p><p>Last time the Norwegian author Vigdis Hjorth wrote about an estranged daughter, in her 2016 novel <a href=\"https://www.theguardian.com/books/2019/sep/18/will-and-testament-by-vigdis-hjorth-review\" title=\"\">Will and Testament</a>, she caused ructions with her family, who felt the novel was too autobiographical for comfort.</p><p>In that chilling book, which Charlotte Barslund translated into English in 2019, a row over inheritance prompts the main character, Bergljot, to confront her family about claims her father sexually abused her as a child. One of Hjorth’s sisters retaliated by writing her own novel, retelling the story from a different perspective, while Hjorth’s mother threatened to sue a Bergen theatre for its stage adaptation – moves that only heightened the novel’s autobiographical associations. Is Mother Dead also features a disaffected daughter who can’t resist reopening old wounds: it’s as if Bergljot – and Hjorth, who has had almost no contact with most of her family in years – has unfinished business.</p> <a href=\"https://www.theguardian.com/books/2022/dec/17/is-mother-dead-by-vigdis-hjorth-a-daughters-lament\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/live/2022/dec/17/russia-ukraine-war-kyiv-mayor-says-most-people-without-heat-or-water-after-russian-strikes-live", "title": "Russia-Ukraine war: Kyiv mayor says water supply restored but many without power and heat after Russian strikes – live", "date_published": "2022-12-17 07:26:37+00:00", "description": "<p>Klitschko also says metro system back in service a day after Ukraine’s capital withstood one of the biggest missile attacks since invasion began</p><p>Here are some of the latest images we have received from the Ukraine after Russia fired more than 70 missiles at Ukraine in <a href=\"https://www.theguardian.com/world/2022/dec/16/russia-begins-mass-air-strike-in-apparent-move-to-destroy-ukraines-power-grid\">one of its biggest attacks </a>since the start of the war.</p><p>The mayor of Ukraine’s capital said early Saturday the city’s metro system was back in service and that all residents had been reconnected to water supply a day after the latest wave of Russian air strikes on critical infrastructure.</p> <a href=\"https://www.theguardian.com/world/live/2022/dec/17/russia-ukraine-war-kyiv-mayor-says-most-people-without-heat-or-water-after-russian-strikes-live\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/film/2022/dec/17/tootsie-1982-movie-dustin-hoffman-oscar", "title": "Tootsie at 40: a dazzling comedy with something serious on its mind", "date_published": "2022-12-17 07:17:13+00:00", "description": "<p>The 1982 Oscar-winner is known for its farcical hijinks but it’s the focus on weightier issues that helped it stay the course</p><p>The classic American screwball comedies of the late 30s and 40s are revered for their sparkling dialogue, their intricate plotting and their mixing-and-matching of glamorous, witty Golden Age icons like Cary Grant, Katharine Hepburn, Jimmy Stewart, Barbara Stanwyck and Claudette Colbert. But one of the important, under-appreciated qualities of those movies – what made Adam’s Rib, Bringing Up Baby, The Lady Eve, His Girl Friday, and others really pop – is there was something serious at stake. These romcoms were not all meet-cutes and gimmicks, but cultural arenas for a battle of the sexes that was being waged off screen, too. Happy endings were achieved through intense negotiations.</p><p>There was something in the water 40 years ago when Tootsie, a self-conscious and ingenious throwback to the screwball era, was released to great acclaim and huge box office takings. It seems no mistake that two of its stars, Dustin Hoffman and Dabney Coleman, had appeared in a couple of the most talked-about films of recent vintage, Kramer vs Kramer and 9 to 5, both about men and women renegotiating the terms of their relationships at home and in the workplace. Hoffman’s career-driven character in Kramer vs Kramer learns that fatherhood isn’t a ceremonial role after his wife leaves him and he figures out how to make French toast for his son. Coleman’s boss in 9 to 5 serves as the ultimate example of women having to navigate a hostile, sexist workplace.</p> <a href=\"https://www.theguardian.com/film/2022/dec/17/tootsie-1982-movie-dustin-hoffman-oscar\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/tv-and-radio/2022/dec/17/1923-review-harrison-ford-and-helen-mirren-yellowstone-prequel", "title": "1923 review: Harrison Ford and Helen Mirren lead intriguing Yellowstone prequel", "date_published": "2022-12-17 07:08:13+00:00", "description": "<p>The latest show in the Taylor Sheridan universe features strong performances from two elder statesmen of the screen</p><p>Of all the <a href=\"https://www.theatlantic.com/magazine/archive/2022/12/yellowstone-tv-series-taylor-sheridan/671897/\">super-producers</a> in television, Taylor Sheridan has perhaps the strongest affinity for grandeur. His ever-expanding universe of shows – <a href=\"https://www.adweek.com/convergent-tv/how-taylor-sheridan-turned-yellowstone-into-televisions-hottest-franchise/\">nine within the year</a>, almost all solely written by him – largely concern such expansive themes as generational inheritance, the maintenance of realm, and the defense of hard-won values, land and family. His magnum opus, Paramount’s <a href=\"https://www.theguardian.com/tv-and-radio/2022/jan/12/yellowstone-the-smash-hit-tv-show-that-exposed-a-cultural-divide\">Yellowstone</a>, is the most-watched linear TV show in America behind NFL football. It is best described not as a “red-state show” or “Republican Succession” (too simple and condescending for Yellowstone’s muddled politics) but as a soap opera about property rights: between the mega-ranch-owning Dutton family, long-displaced Native Americans, and the gentrifiers/coastal elites whose land development threatens a pastoral way of life.</p><p>Sheridan’s latest star-studded Yellowstone prequel, 1923, extends the same ethos back in time, to a limbo era between the wars and before the Depression, between pre-prequel limited series 1883 and Kevin Costner’s gravelly modern patriarch. Epic sensibilities abound from the jump: “Violence has always haunted this family,” says the voiceover of Elsa Dutton (Isabel May), the fiery pioneer daughter of ancestors John and Margaret (played by country superstars Tim McGraw and Faith Hill) in 1883. She’s following up a cold intro, after Cara Dutton (Helen Mirren) wins a reloading war and kills an unidentified man. Cut to another unidentified man barely escaping a lion’s pounce – “and where it doesn’t follow we hunt it down, we seek it”.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/17/1923-review-harrison-ford-and-helen-mirren-yellowstone-prequel\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/business/2022/dec/17/sam-bankman-fried-bernie-madoff-fraud-ftx", "title": "Fraud, cons and Ponzi schemes: did Sam Bankman-Fried use Madoff tactics?", "date_published": "2022-12-17 07:00:15+00:00", "description": "<p>The fallen crypto mogul is fighting off accusations he followed a similar playbook to Madoff – and deceived investors in the process</p><p>At first glance, Sam Bankman-Fried bears little resemblance to Bernie Madoff. One is a smartly-suited, grey-haired financial titan with a 40-year career on Wall Street, and the other a 30-year-old millennial king of crypto in shorts and T-shirt.</p><p>But almost 14 years to the day since Madoff was <a href=\"https://www.theguardian.com/world/2008/dec/13/useconomy-usa-fraud\">arrested</a> and charged with fraud in New York for orchestrating a long-running pyramid scheme, the FTX crypto scandal is being compared to Madoff’s criminal enterprise.</p> <a href=\"https://www.theguardian.com/business/2022/dec/17/sam-bankman-fried-bernie-madoff-fraud-ftx\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/travel/2022/dec/17/22-of-the-best-travel-discoveries-of-2022", "title": "‘The view was heavenly’: 22 of the best travel discoveries of 2022", "date_published": "2022-12-17 07:00:15+00:00", "description": "<p>Cityscapes, sherry bodegas, wilderness trails, medieval marvels and the joys of youth hostelling ... we share their finds of the year</p><p>We’d come for a family wedding in County Cavan, and spent a few days exploring the “Irish Lake District” in neighbouring County Fermanagh.</p> <a href=\"https://www.theguardian.com/travel/2022/dec/17/22-of-the-best-travel-discoveries-of-2022\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/business/2022/dec/16/self-checkout-us-retail-walmart", "title": "‘Unexpected item’: how self-checkouts failed to live up to their promise", "date_published": "2022-12-17 07:00:15+00:00", "description": "<p>The kiosks promised to make life easier for shoppers and stores. Instead, they’ve done the opposite</p><p>When the first self-checkout kiosks were rolled out in American stores more than three decades ago, they were presented as technology that could help stores cut costs, save customers time, and even prevent theft.</p><p>Businesses still fret over these issues, and against a tight labor market, more companies are making self-checkouts the norm. This week Walmart revealed that thefts from its stores are at a historical high, which many <a href=\"https://businessinsider.com/walmart-employees-and-customers-blame-self-checkout-shoplifting-rising-theft-2022-12?r=US&amp;IR=T\">staff and customers link to</a> self-checkouts. But not only have the machines failed to live up to their promises; they’ve made things harder for just about everyone, including the workers who they were supposed to replace.</p> <a href=\"https://www.theguardian.com/business/2022/dec/16/self-checkout-us-retail-walmart\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/business/2022/dec/17/how-putins-alleged-business-associate-made-400m-from-a-major-russian-gas-deal", "title": "How Putin’s alleged ‘business associate’ made $400m from a major Russian gas deal", "date_published": "2022-12-17 07:00:14+00:00", "description": "<p>French oil group Total writes off Novatek shareholding as Guardian investigation raises questions over ties to Kremlin and ownership of superyacht used by Russian president</p><p>In the icy waters of a Siberian harbour, the Christophe de Margerie, a Russian ship with an unusual French name, was ready for loading. The world’s first ice-breaking gas tanker had been designed for a very specific purpose: opening up Russia’s Arctic shipping routes towards Europe and Asia during the winter months.</p><p>It was December 2017, and the temperatures had plunged to -27C, but the politicians and oil executives gathered in Sabetta, on the Yamal peninsula, were jubilant. Vladimir Putin had flown in for the event. At the president’s signal, gas began to pump into the tanker.</p> <a href=\"https://www.theguardian.com/business/2022/dec/17/how-putins-alleged-business-associate-made-400m-from-a-major-russian-gas-deal\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/17/whoopi-goldberg-alanis-morissette-saturday-quiz", "title": "What links Whoopi Goldberg and Alanis Morissette? The Saturday quiz", "date_published": "2022-12-17 07:00:14+00:00", "description": "<p>From a philosopher to a polymath, test your knowledge with the Saturday quiz</p><p><strong>1</strong> Which polymath scammed the French lottery in 1730?<br /><strong>2</strong> Dutch monarchs are buried in what city’s Nieuwe Kerk?<br /><strong>3</strong> What produces a pyroclastic flow?<br /><strong>4</strong> In US presidential politics, what is a ‘faithless elector’?<br /><strong>5</strong> Which philosopher won the Booker prize?<br /><strong>6</strong> The world’s population passed what milestone in November?<br /><strong>7</strong> Lasting from 1958 until 1971, what was the UAR?<br /><strong>8</strong> What economic phenomenon can be cost push or demand pull?<br /><strong>What links:<br />9</strong> Fellowes; Turpin; Hathaway; Soros; Mallett?<br /><strong>10</strong> Hello; OK; Kerrang; Shoot?<br /><strong>11</strong> Bixby; Cortana; Siri; Alexa?<br /><strong>12</strong> Ap; bar; bin; Fitz; Mac?<br /><strong>13</strong> Alanis Morissette; Whoopi Goldberg; Morgan Freeman; George Burns?<br /><strong>14</strong> First to Seventh; Barons’; Albigensian; Northern?<br /><strong>15</strong> Indian; Javan; Sumatran; white; black?</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/17/whoopi-goldberg-alanis-morissette-saturday-quiz\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/film/2022/dec/17/daniel-craig-glass-onion-cast-interview-kate-hudson-janelle-monae-leslie-odom-jr-edward-norton", "title": "‘If Agatha Christie was writing now, there’d be a tech billionaire’: Daniel Craig and the stars of Knives Out on the new age of whodunnits", "date_published": "2022-12-17 07:00:13+00:00", "description": "<p>It was the slowburn hit of 2019 that revived murder mysteries for the big screen. Now Knives Out is back with another killer cast – who talk dressing up, their festive plans and the Mafia fiend among them</p><p>In the last couple of years, you didn’t need to be sporting a monocle to notice that there were murder mysteries everywhere. On television, you could guess whodunnit on <a href=\"https://www.theguardian.com/tv-and-radio/2022/jan/28/the-afterparty-review-apple-tv-tiffany-haddish\" title=\"\">The Afterparty</a> or <a href=\"https://www.theguardian.com/tv-and-radio/2021/aug/31/only-murders-in-the-building-review-steve-martin-selena-gomez-martin-short\" title=\"\">Only Murders in the Building</a>. On the big screen, Kenneth Branagh worked his way through two starry Poirots with <a href=\"https://www.theguardian.com/film/2017/nov/02/on-the-orient-express-review-kenneth-branagh-judi-dench-johnny-depp-agatha-christie\" title=\"\">Murder on the Orient Express</a> and <a href=\"https://www.theguardian.com/film/2022/feb/07/death-on-the-nile-review-kenneth-branagh-agatha-christie\" title=\"\">Death on the Nile</a>. The Agatha Christie love continued with <a href=\"https://www.theguardian.com/film/2022/sep/07/see-how-they-run-review-agatha-christie-spoof-scampers-through-50s-theatreland\" title=\"\">See How They Run</a>, a retro crime caper pegged to her play <a href=\"https://www.theguardian.com/stage/2021/may/05/case-covid-compliant-mousetrap-snapping-back-agatha-christie-whodunnit\" title=\"\">The Mousetrap</a>. And then there was <a href=\"https://www.theguardian.com/film/2019/sep/08/knives-out-review-rian-johnson-crafts-a-devious-meta-whodunnit\" title=\"\">Knives Out</a>.</p><p>Released in 2019 and directed by Rian Johnson, the film juggled a rollercoaster plot with huge names and borderline slapstick, while giving viewers the vicarious pleasure of watching entitled, bratty rich people collapse into chaos. It starred Daniel Craig as Benoit Blanc, a southern gentleman detective with a “Kentucky-fried Foghorn Leghorn accent” and a Sherlock-esque mind. Blanc was there to crack the case of a dead crime author who died in his mansion, surrounded by his money-grubbing descendants. The film’s cast was all-star, with Ana de Armas, Jamie Lee Curtis, Chris Evans and Toni Collette joining the melee, and its tone was fresh. It was thrilling, it was brainy, and it was surprisingly farcical and funny. Unsurprisingly, it was a huge hit. Netflix quickly commissioned two more Knives Out mysteries.</p> <a href=\"https://www.theguardian.com/film/2022/dec/17/daniel-craig-glass-onion-cast-interview-kate-hudson-janelle-monae-leslie-odom-jr-edward-norton\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/technology/2022/dec/17/elon-musk-reinstates-twitter-accounts-of-suspended-journalists", "title": "Elon Musk reinstates Twitter accounts of suspended journalists", "date_published": "2022-12-17 06:24:08+00:00", "description": "<p>On a wild day of bans, sudden U-turns and chaotic messaging, Musk abides by Twitter poll result that favoured restoring the accounts of reporters he accused of ‘doxxing’ him   </p><p>Elon Musk has lifted the suspensions of the Twitter accounts of several journalists he had banned a day earlier, after the second poll he conducted on the topic went against his preferred outcome.</p><p>On Thursday, Musk suspended a group of tech journalists from the website, including Ryan Mac from the New York Times, Drew Harwell of the Washington Post and CNN’s Donie O’Sullivan, for what he said were breaches of the company’s new rule about revealing people’s locations.</p> <a href=\"https://www.theguardian.com/technology/2022/dec/17/elon-musk-reinstates-twitter-accounts-of-suspended-journalists\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/16/us-trans-non-binary-youth-suicide-mental-health", "title": "More than 50% of trans and non-binary youth in US considered suicide this year, survey says", "date_published": "2022-12-17 06:00:14+00:00", "description": "<p>The alarmingly high rates of depression, anxiety and suicide attempts are spread across liberal and conservative regions</p><p>More than 50% of transgender and non-binary youth in states across the US seriously considered suicide in the past year, according to new survey data on a worsening LGTBQ+ youth mental health crisis.</p><p>The Trevor Project, a non-profit organization dedicated to LGBTQ+ youth suicide prevention, on Thursday <a href=\"https://www.thetrevorproject.org/blog/the-trevor-project-releases-new-state-level-data-on-lgbtq-youth-mental-health-victimization-access-to-support/\">released</a> state-level <a href=\"https://www.thetrevorproject.org/research-briefs/2022-u-s-national-survey-on-lgbtq-youth-mental-health-by-state-dec-2022/\">data</a> from nearly 34,000 queer and trans youth ages 13 to 24, showing alarmingly high rates of suicide attempts, depression and anxiety across liberal and conservative regions.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/16/us-trans-non-binary-youth-suicide-mental-health\">Continue reading...</a>", "persistent": true, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/17/blind-date-will-james", "title": "Blind date: ‘He said he didn’t think I was weird – that was pretty heartening’", "date_published": "2022-12-17 06:00:13+00:00", "description": "<p>James, 25, an events manager, meets Will, 23, an office administrator</p><p><strong>What were you hoping for?</strong><br />To meet someone I connect with. My night started in Wetherspoons, where I popped in to use the loo and then had a tequila shot. It could only go up from there …</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/17/blind-date-will-james\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/stage/2022/dec/17/the-best-comedy-shows-of-2022", "title": "The best comedy shows of 2022", "date_published": "2022-12-17 06:00:13+00:00", "description": "<p>From dazzling comic debuts at the Edinburgh fringe to occult sketches, soul-searching standup and deeply strange revelations, it was a top year for laughing matters</p><p>• <a href=\"https://www.theguardian.com/culture/series/2022-in-culture\">More on the best culture of 2022</a></p><p>A set delivering all the livid topical comedy we expect from the Mash Report man and more, as Kumar explored the implications (for the state of the nation, for his mental health) of the moment when his anti-colonial, anti-Brexit jokes at a posh charity gig saw him pelted with bread rolls. As funny as ever but soul-searching too. <a href=\"https://www.theguardian.com/stage/2022/jan/25/nish-kumar-your-power-your-control-review-this-time-its-personal\">Read the full review</a></p> <a href=\"https://www.theguardian.com/stage/2022/dec/17/the-best-comedy-shows-of-2022\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/17/tim-dowling-a-local-fox-has-started-stalking-me", "title": "Tim Dowling: a local fox has started stalking me", "date_published": "2022-12-17 06:00:13+00:00", "description": "<p>He is recognisably the same animal every time. I could even pick him out in a fox lineup</p><p>Several times a day I receive email updates from a website that purports to be dedicated to my immediate neighbourhood. Together these updates comprise a litany of lost pets, suspicious characters, unscrupulous tradespeople and stolen deliveries. Occasionally, I’ll click through for more information, and when I do I always think: this is not a local issue. Stop coming on here with your Chiswick problems.</p><p>My local issue is a fox. Where last year’s fox formed an <a href=\"https://www.theguardian.com/lifeandstyle/2021/apr/10/tim-dowling-is-the-dogs-friendship-with-the-fox-sweet-or-a-bad-omen\">unholy friendship with our dog</a> – they played together in the dead of night, by standing appointment – this year’s fox wants to be friends with me.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/17/tim-dowling-a-local-fox-has-started-stalking-me\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/17/ukraine-warns-of-long-outages-after-wave-of-russian-strikes-hit-power-grid", "title": "Ukraine warns of long outages after wave of Russian strikes hit power grid", "date_published": "2022-12-17 05:51:10+00:00", "description": "<p>Kyiv mayor says only one-third of residents have heat or water after volley of missiles cut power to the capital and 14 regions</p><p>Ukraine was working to restore electricity to hospitals, heating systems and other critical infrastructure in major cities after Russia’s latest wave of attacks on the power grid prompted accusations of “war crimes”.</p><p>The volley of missiles unleashed Friday pitched multiple cities into darkness, cutting water and heat and forcing people to endure freezing cold.</p> <a href=\"https://www.theguardian.com/world/2022/dec/17/ukraine-warns-of-long-outages-after-wave-of-russian-strikes-hit-power-grid\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/17/our-team-will-win-how-so-many-indians-started-supporting-argentina-world-cup-fever", "title": "‘Our team will win’: how so many Indians started supporting Argentina", "date_published": "2022-12-17 05:00:11+00:00", "description": "<p>Better known for its love of cricket, every four years India and the wider region are gripped by World Cup fever</p><p>In one village, dozens of houses have been painted white and blue. In another, vast 10-metre statues of football star Lionel Messi have been erected in rivers and along roadsides. But this is not Argentina proudly supporting their national team ahead of Sunday’s World Cup final, where Argentina will face France, but instead is India’s southernmost state of Kerala.</p><p>India, and the south Asia region, is known more for its love of cricket and the countries have never participated in major international football tournaments. But every four years, in corners of India and across Bangladesh, football fever comes alive with the arrival of the World Cup. Without their own national squads to support, fans instead have developed decades-long allegiances to other teams; none more so than an enduring love for Argentina, the team of football icons Messi and Maradona.</p> <a href=\"https://www.theguardian.com/football/2022/dec/17/our-team-will-win-how-so-many-indians-started-supporting-argentina-world-cup-fever\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/17/donald-trumps-digital-trading-card-collection-sells-out-in-less-than-a-day", "title": "Donald Trump’s digital trading card collection sells out in less than a day", "date_published": "2022-12-17 04:49:25+00:00", "description": "<p>NFTs were priced at $99 each and depict the former US president in guises including superhero, astronaut and race car driver</p><p>Despite being widely mocked online, former US president Donald Trump’s collection of digital trading cards have sold out in less than a day, netting US$4.5m in sales.</p><p>On Wednesday, Trump alerted fans to a “major announcement” on his Truth social media platform. A day later, the 45th president of the United States revealed he was offering “limited edition cards featur[ing] amazing ART of my Life &amp; Career”, which he promised would prove “very much like a baseball card but hopefully much more exciting”.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/17/donald-trumps-digital-trading-card-collection-sells-out-in-less-than-a-day\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/live/2022/dec/17/pakistan-v-england-third-test-day-one-live", "title": "Pakistan v England: third Test, day one – live", "date_published": "2022-12-17 04:41:08+00:00", "description": "<ul><li>Updates from the first day’s play in Karachi</li><li>Get in touch: contact Tanya <a href=\"mailto:tanya.aldred.freelance@theguardian.com\">by email</a> or <a href=\"https://twitter.com/tjaldred\">on Twitter</a></li></ul><p><strong>England:</strong> Zak Crawley, Ben Duckett, Ollie Pope, Joe Root, Harry Brook, Ben Stokes (captain), Ben Foakes (wkt), Rehan Ahmed, Ollie Robinson, Jack Leach, Mark Wood.</p><p>Gloves to Foakes, Pope bats, Ahmed on debut. Anderson rested, Jacks on the bench.</p> <a href=\"https://www.theguardian.com/sport/live/2022/dec/17/pakistan-v-england-third-test-day-one-live\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/17/peru-ministers-resign-after-deadly-protests-as-pressure-on-government-rises", "title": "Peru ministers resign after deadly protests as pressure on government rises", "date_published": "2022-12-17 04:37:00+00:00", "description": "<p>Education and culture ministers resign following ongoing unrest that has seen at least 17 people killed</p><p>Pressure rose on Peru’s fledgling government as two cabinet members resigned following deadly protests that have rocked the country since former president Pedro Castillo’s removal from office and arrest last week.</p><p>Education minister Patricia Correa and culture minister Jair Perez announced their resignations on Twitter on Friday, citing the deaths of individuals during the unrest.</p> <a href=\"https://www.theguardian.com/world/2022/dec/17/peru-ministers-resign-after-deadly-protests-as-pressure-on-government-rises\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/17/tunisians-go-to-polls-in-election-set-to-cement-rule-of-strongman-president", "title": "Tunisians go to polls in election set to cement rule of strongman president", "date_published": "2022-12-17 03:00:08+00:00", "description": "<p>Opposition groups are boycotting vote that one prominent party leader describes as ‘a still-born farce’</p><p>Tunisians return to the polls on Saturday, 11 years to the day since <a href=\"https://www.theguardian.com/world/2011/jan/20/tunisian-fruit-seller-mohammed-bouazizi\">a vendor’s self-immolation</a> sparked <a href=\"https://www.theguardian.com/world/2019/sep/19/zine-al-abidine-ben-ali-obituary\">the fall of their ruling tyrant</a> and triggered a wave of popular revolts across north Africa and the Middle East.</p><p>In the troubled decade since, other regional states that once cracked under the strain of popular revolts have been increasingly smothered by counterrevolutions that clawed back civic gains and political freedoms championed by their citizens.</p> <a href=\"https://www.theguardian.com/world/2022/dec/17/tunisians-go-to-polls-in-election-set-to-cement-rule-of-strongman-president\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/17/malaysia-landslide-kills-at-least-21-campers-as-recovery-efforts-continue", "title": "Malaysia landslide kills at least 21 campers as recovery efforts continue", "date_published": "2022-12-17 02:05:05+00:00", "description": "<p>Two of the dead found locked in an embrace, officials say, with 12 still missing after the disaster north of the capital Kuala Lumpur</p><p></p><p>A thunderous crush of soil and debris killed 21 people at a campground in Malaysia and rescuers dug through the mud in the night for another 12 who were feared buried in the landslide.</p><p>More than 90 people were sleeping on an organic farm when the dirt tumbled from a road about 30 meters (100 feet) above the site and covered about 1 hectare (3 acres) on Friday. Two of the dead were found locked in an embrace, according to the state fire department chief.</p> <a href=\"https://www.theguardian.com/world/2022/dec/17/malaysia-landslide-kills-at-least-21-campers-as-recovery-efforts-continue\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/17/russia-ukraine-war-at-a-glance-what-we-know-on-day-297-of-the-invasion", "title": "Russia-Ukraine war at a glance: what we know on day 297 of the invasion", "date_published": "2022-12-17 01:31:46+00:00", "description": "<p>Kharkiv left without power, heating and water after new wave of Russian missile strikes across country</p><ul><li><a href=\"https://www.theguardian.com/world/ukraine\">See all our Ukraine war coverage</a></li></ul> <a href=\"https://www.theguardian.com/world/2022/dec/17/russia-ukraine-war-at-a-glance-what-we-know-on-day-297-of-the-invasion\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/live/2022/dec/17/australia-vs-south-africa-cricket-live-updates-score-first-test-day-one-latest-scores-aus-v-sa", "title": "Australia v South Africa: first Test, day one – live", "date_published": "2022-12-17 00:37:17+00:00", "description": "<ul><li>Updates as the three-Test cricket series begins at the Gabba</li><li>Start time in Brisbane is 10:20am/11:20am AEDT/12:20am GMT</li><li>Any thoughts? <a href=\"mailto:geoff.lemon@theguardian.com\">Email Geoff</a> or tweet <a href=\"https://twitter.com/GeoffLemonSport\">@GeoffLemonSport</a></li></ul><p>The national anthems round out the formalities. Both teams on the field, as per tradition, with large flags held parallel to the ground behind them. The reserve players and support staff ring the boundary, standing to attention with hands behind their backs as they have done for the duration. </p><p>The Welcome to Country is performed by Aunty Deb Sandy of the Yuggerah people, who asks everyone in the crowd to call out their names so that she can welcome them properly. A nice addition that I haven’t seen before. She also sends out condolences to the Wieambilla victims.</p> <a href=\"https://www.theguardian.com/sport/live/2022/dec/17/australia-vs-south-africa-cricket-live-updates-score-first-test-day-one-latest-scores-aus-v-sa\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/17/world-cup-2022-briefing-why-the-third-place-playoff-is-worth-watching", "title": "World Cup 2022 briefing: why the third-place playoff is worth watching", "date_published": "2022-12-17 00:30:05+00:00", "description": "<p>Morocco’s coach has called it a ‘booby prize’ but there are still reasons to tune in</p><p>It is quite easy to forget about the third-place playoff at a World Cup with everyone focusing on the final. But who could forget Poland 3-2 France in 1982? Or Turkey 3-2 South Korea in 2002? Or even whatever happened when England played Belgium four years ago?</p> <a href=\"https://www.theguardian.com/football/2022/dec/17/world-cup-2022-briefing-why-the-third-place-playoff-is-worth-watching\">Continue reading...</a>", "persistent": false, "language": "en-US"}], "source": {"url": "https://www.theguardian.com/international/rss", "title": "The Guardian - International"}}