{"entries": [{"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-17/niespodziewany-gosc-w-ukryl-sie-w-choince-nagranie-hitem-internetu/", "title": "Niespodziewany gość ukrył się w choince. Nagranie hitem internetu", "date_published": "2022-12-17 22:23:00+00:00", "description": "Ubieranie choinki kojarzy się z pełnym relaksu czasem świątecznym. Tiktokerka Gina nie odczuwała jednak radości, kiedy znalazła mysz chroniącą się w gałęziach jej drzewka. Kobieta zamieściła w mediach społecznościowych nagranie, który podpisała krótko: Pomocy!.", "persistent": false}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-17/wnuk-bronislawa-pilsudskiego-nie-zyje-kazuyasu-kimura-zmarl-w-japonii/", "title": "Wnuk Bronisława Piłsudskiego nie żyje. Kazuyasu Kimura zmarł w Japonii", "date_published": "2022-12-17 19:48:00+00:00", "description": "Kazuyasu Kimura, wnuk Bronisława Piłsudskiego, starszego brata Józefa Piłsudskiego, zmarł w Japonii w wieku 70 lat. Kimura utrzymywał kontakty z Muzeum Tatrzańskim w Zakopanem, którego zbiory tworzył jego dziadek. W 2013 r. w muzeum Ajnów w Shiraoi na wyspie Hokkaido odsłonięto pomnik jego dziadka - polskiego zesłańca i antropologa kultury.", "persistent": false}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-17/niemcy-polski-skarb-odnaleziony-w-dreznie-zostal-skradziony-trzy-lata-temu/", "title": "Niemcy. Polski skarb odnaleziony w Dreźnie. Został skradziony trzy lata temu", "date_published": "2022-12-17 19:07:00+00:00", "description": "Śledczy dokonali przełomu w sprawie włamania do skarbca Gruene Gewoelbe (Zielone Sklepienie) w Dreźnie, do którego doszło trzy lata temu. Znaleziono część łupu - wśród drogocennej biżuterii natrafiono także na gwiazdę polskiego Orderu Białego. Łączna wartość skradzionych klejnotów wynosi 113 mln euro.", "persistent": false}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-17/chorwacja-trzecia-druzyna-swiata-polka-ze-splitu-jest-wielka-radosc/", "title": "Chorwacja trzecią drużyną świata. Polka ze Splitu: Jest wielka radość", "date_published": "2022-12-17 18:37:00+00:00", "description": "- Sztuczne ognie latają nad nami - powiedziała na antenie Polsat News Monika Waligórska, Polka z Chorwacji. - Tu jest teraz wielka radość. Ten mecz nie umknął niczyjej uwadze - dodała. Reprezentacja Chorwacji wygrała w sobotnim meczu o 3. miejsce z Marokiem i zdobyła brązowy medal Mistrzostw Świata w Katarze 2022.", "persistent": false}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-17/ukraina-ze-studni-zamiast-wody-poplynela-ropa-naftowa-sprawe-badaja-sluzby/", "title": "Ukraina. Ze studni zamiast wody popłynęła ropa naftowa. Sprawę badają służby", "date_published": "2022-12-17 18:31:00+00:00", "description": "Niecodzienna sytuacja wydarzyła się we wsi na północy Ukrainy. Mieszkańcy, którzy chcieli nabrać wody z pobliskiej studni mocno się zdziwili, gdy zamiast niej popłynęła ropa naftowa. Sprawą zajęły się służby.", "persistent": false}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-17/rodzina-ulmow-bedzie-beatyfikowana-papiez-franciszek-zatwierdzil-dekret-o-jej-meczenstwie/", "title": "Rodzina Ulmów będzie beatyfikowana. Papież Franciszek zatwierdził dekret o jej męczeństwie", "date_published": "2022-12-17 13:34:00+00:00", "description": "Podczas II wojny światowej rodzina Ulmów ukryła w swoim domu ośmioro Żydów, mimo biedy i ciągłego zagrożenia ze strony Niemców. Okupanci w 1944 roku dowiedzieli się o tym i zamordowali rodziców oraz dzieci, a także chroniące się u nich osoby. Niemal 80 lat po tych wydarzeniach papież Franciszek wydał zgodę na beatyfikację Ulmów.", "persistent": false}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-17/angelina-jolie-podjela-decyzje-rezygnuje-ze-specjalnej-funkcji-w-onz/", "title": "Angelina Jolie podjęła decyzję. Rezygnuje ze specjalnej funkcji w ONZ", "date_published": "2022-12-17 10:05:00+00:00", "description": "Amerykańska aktorka Angelina Jolie zrezygnowała z funkcji specjalnej wysłanniczki ONZ do spraw uchodźców. Ostatnio w tej roli była m.in. w Ukrainie. We wspólnym oświadczeniu z Wysokim Komisarzem ONZ ds. uchodźców gwiazda poinformowała, że czas na inne działania i bezpośredni kontakt z uchodźcami oraz lokalnymi organizacjami. Aktorka współpracowała z Narodami Zjednoczonymi od ponad 20 lat.", "persistent": false}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-17/ukraina-miasto-krzywy-rog-ostrzelane-spod-gruzow-wyciagnieto-cialo-poltorarocznego-chlopca/", "title": "Ukraina. Miasto Krzywy Róg ostrzelane. Spod gruzów wyciągnięto ciało półtorarocznego chłopca", "date_published": "2022-12-17 08:59:00+00:00", "description": "W piątkowym ostrzale Krzywego Rogu w obwodzie dniepropietrowskim w Ukrainie zginęły cztery osoby. W sobotę rano spod gruzów wydobyto ciało 1,5-rocznego chłopca. Rosjanie zabili 64-letnią kobietę oraz małżeństwo i ich małego synka - podał gubernator. Spośród trzynastu rannych osób czworo to dzieci. Rosja nie przestaje ostrzeliwać osiedli przy linii frontu oraz bombardować terytorium Ukrainy.", "persistent": false}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-17/wielka-brytania-krol-karol-iii-tanczy-z-siostra-anne-frank-uroczystosc-z-okazji-chanuki/", "title": "Wielka Brytania: Król Karol III tańczy z siostrą Anne Frank. Uroczystość z okazji Chanuki", "date_published": "2022-12-17 08:48:00+00:00", "description": "- Król był słodki, nie wywyższa się. Bardzo łatwo się z nim rozmawia - powiedziała 93-letnia Eva Schloss, z którą zatańczył Karol III podczas obchodów Chanuki. Monarcha odwiedził członków społeczności żydowskiej w Londynie i nauczył się od nich kroków ludowego tańca - hory.", "persistent": false}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-17/elon-musk-odblokowuje-zawieszone-konta-dziennikarzy-na-twitterze-skutek-glosowania-internautow/", "title": "Elon Musk odblokowuje zawieszone konta dziennikarzy na Twitterze. Skutek głosowania internautów", "date_published": "2022-12-17 07:24:00+00:00", "description": "Ludzie przemówili - napisał Elon Musk na Twitterze, sugerując, ze przywróci zablokowane konta dziennikarzy, którzy go krytykowali i linkowali do zbanowanego profilu 19-latka z Florydy. Młody mężczyzna publikował dane o położenia samolotu miliardera. Musk uważa, że krytykowanie go non stop jest w porządku, ale śledzenie samolotów celebrytów to podawanie współrzędnych porwania.", "persistent": false}], "source url": "https://www.polsatnews.pl/rss/swiat.xml", "source title": "Polsat News"}