{"entries": [{"source": "https://www.gamespot.com/feeds/mashup", "link": "https://www.gamespot.com/videos/best-pc-games-2022/2300-6460269/", "title": "Best PC Games 2022", "date_published": "2022-12-17 18:00:00+00:00", "description": "<img height=\"480\" src=\"https://www.gamespot.com/a/uploads/square_medium/1352/13527689/4078617-gs-boty-2022-best-pc-games.jpg\" width=\"480\" /> Here are our five best PC games of 2022 and five honorable mentions that you should check out ASAP.", "persistent": false}, {"source": "https://www.gamespot.com/feeds/mashup", "link": "https://www.gamespot.com/videos/firearms-expert-reacts-to-bonelabs-guns/2300-6460155/", "title": "Firearms Expert Reacts To Bonelab’s Guns", "date_published": "2022-12-17 15:00:00+00:00", "description": "<img height=\"480\" src=\"https://www.gamespot.com/a/uploads/square_medium/1571/15719603/4071834-bonelab_site.jpg\" width=\"480\" /> Jonathan Ferguson, a weapons expert and Keeper of Firearms &amp; Artillery at the Royal Armouries, breaks down more of the weaponry of Bonelab, including the Benelli M4 shotgun being used in tandem with a shield, and AKM being used as a club, as well as the M1 Garand, and a Micro-Uzi.", "persistent": false}, {"source": "https://www.gamespot.com/feeds/mashup", "link": "https://www.gamespot.com/gallery/the-5-best-pc-games-of-2022/2900-4513/", "title": "The 5 Best PC Games Of 2022", "date_published": "2022-12-17 14:00:00+00:00", "description": "<p><img src=\"https://www.gamespot.com/a/uploads/scale_large/1632/16320660/4073977-ss_4e43fc5c0302825007c35f51e03964726a06e984.1920x1080.jpg\" /><br /><h3><p dir=\"ltr\">Like we do every December, it's time to celebrate the best gaming experiences we had over the past 12 months. Today we're taking a look at what we feel are the five best PC games of 2022. As usual with PC games, determining the best games on the platform can get tricky. Unlike Switch or PlayStation, there isn't exactly a \"first-party\" publisher on PC, which means the realm of PC \"exclusives\" can get murky. However, there are plenty of games that are either timed exclusives or just happen to play best on PC due to any number of factors, including the advent of the Steam Deck, which is a consideration new to 2022.</p><p dir=\"ltr\">Therefore, this list of the year's five best PC games naturally features games you'll sometimes (though not always) find elsewhere, but in cases where multiplatform games appear, we believe they're best played on PC and deserve a spot on this list. This year's list is an eclectic bunch, too, with a speedrunning gem, a deep detective-like experience, and a physics playground all all earning top spots.</p><p dir=\"ltr\">Be sure to also check out our Best Of lists for other platforms, including Xbox, PlayStation, and <a href=\"https://www.gamespot.com/gallery/the-5-best-nintendo-switch-exclusive-games-of-2022/2900-4495/\">Switch</a>. It was a fun year in games no matter where you play them, so you'll find something for your taste somewhere, no doubt. Oh, and one final note: This list is unranked, so while you may have a favorite shown here (I know I do), don't get caught up in the order in which they appear.</p><p dir=\"ltr\">Whether you're spending the holiday season catching up on some great games you may have missed or you're reading this just to tell us where you agree or disagree, we stand by our picks for the best PC games of 2022.</p></h3></p><br />     <p><h2>The Case of the Golden Idol</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1632/16320660/4074054-zqbm8kx4g6nb3mtrf85uwx.jpg\" /><br /><h3><p>In <a href=\"https://www.gamespot.com/games/the-case-of-the-golden-idol/\">The Case of the Golden Idol</a>, many players have found the heir apparent to <a href=\"https://www.gamespot.com/games/return-of-the-obra-dinn/\">Return of the Obra Dinn</a>. It's a game that devilishly obscures the truth from you at every turn, which makes uncovering its many secrets all the more satisfying. With a unique and even bizarre art style, the mystery game is as visually striking as it is confounding. If played with all the answers, you could see the whole game in under two hours, but to do it that way would rob yourself of what makes Golden Idol so memorable.</p><p>Golden Idol is a game that quickly teaches you to think for yourself. You'll explore the point-and-click world through a number of differently styled puzzles, including interviewing witnesses and judging their claims, piecing together notes that are missing key information, and simply reading items like notes and newspapers that can feel out of context until, eventually, you have your \"aha!\" moment. The entire game ends up feeling like one big notebook of clues, allowing you to comb through each one on hand until the mystery is unraveled--or until you tie yourself in knots with the red string on your corkboard.</p><div><div class=\"norewrite\" title=\"\">           <a href=\"https://store.steampowered.com/app/1677770/The_Case_of_the_Golden_Idol/\">See at Steam</a> </div></div><p> </p></h3></p><br />     <p><h2>Neon White</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1632/16320660/4074053-3860884-5.gif\" /><br /><h3><p><a href=\"https://www.gamespot.com/games/neon-white/\">Neon White</a> is a far cry from developer Ben Esposito's previous game, Donut County. The dev traded raccoons and an all-consuming hole in the ground for a speedrunner's paradise that is liable to consume all of your free time. Upon its first reveal, the game was arguably hard to comprehend. In a first-person anime art style, players were seen scrambling around something like a castle trading gunfire with baddies in between the playing of ability cards. It's dizzying at first glance.</p><p>But the beauty of it is in the details, and as you start to play Neon White, it's quickly obvious how subtly wonderful its design is at full speed. Leaping, sliding, and air-dashing all to shave off milliseconds provides an arcade-like thrill on its own, and the added wrinkle of gunplay allows for plenty of right answers to be discovered on the way to Neon Leaderboards immortality. It's now available on most other platforms, but is played best with mouse and keyboard, in our opinion.</p><p>In our <a href=\"https://www.gamespot.com/reviews/neon-white-review-heavenly-sprint/1900-6417905/\">Neon White review</a>, Richard Wakeling said the game is \"flawless from a gameplay perspective and is not only stylish and incredibly satisfying, but a magnetic execution of a fascinating idea. There's nothing else quite like it, and you'd be doing yourself a massive disservice if you don't at least give it a try.\"</p><div class=\"norewrite\" title=\"\">           <a href=\"https://www.anrdoezrs.net/links/9020176/type/dlg/sid/subid_value/https://www.fanatical.com/en/game/neon-white\">See on Fanatical</a> </div></h3></p><br />     <p><h2>PowerWash Simulator</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1632/16320660/4073961-3822118-powerwashsimulator.jpg\" /><br /><h3><p>Sometimes a game's name gives away its entire premise, but the aptly-named <a href=\"https://www.gamespot.com/games/powerwash-simulator/\">PowerWash Simulator</a> still manages to hide its hypnotic allure. If ever you've appreciated the before-and-after visual differences of mowing a lawn, mopping a floor, or--of course--powerwashing a shed, I've got just the game for you. In PowerWash Simulator, you're kickstarting your business as a powerwasher-for-hire, taking your incredibly powerful hoses to any backyard or garage that's paying, and even if you're not the type to enjoy job simulation games, this is likely to be an exception.</p><p>There's something so simple yet so gratifying in watching the grime disappear by your hand, and the game cleverly offers a video-gamey depth that takes it to the next level. Upgrading your hoses with new nozzles, buying special soaps to speed up jobs, and even applying stylish skins to your hoses like they're skateboard decks are all available features, and collectively hint at a subtle sense of humor the game has. But as lighthearted as it feels, its simulation gameplay is quite detailed, and when played in co-op especially, you'll likely find an appreciation for its strangely soothing gameplay loop.</p><p>In our <a href=\"https://www.gamespot.com/reviews/powerwash-simulator-review-filthy-rich/1900-6417923/\">PowerWash Simulator review</a>, Richard Wakeling said, \"At its best, PowerWash Simulator is a quiet, relaxing experience that's best enjoyed in small doses. It's time-consuming, yes, but once in a while, we all need something to consume our time.\"</p><div class=\"norewrite\" title=\"\">           <a href=\"https://store.steampowered.com/app/1290000/PowerWash_Simulator/\">See at Steam</a> </div></h3></p><br />     <p><h2>Teardown</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1632/16320660/4073977-ss_4e43fc5c0302825007c35f51e03964726a06e984.1920x1080.jpg\" /><br /><h3><p>Having been in Steam Early Access for a while, you might've missed that Teardown launched into its 1.0 state in 2022, but you ought not miss it much longer. The clever physics playground is fun and experimental enough on its own, but rather than just be a simple sandbox with really compelling destructibility, it's also a stylish heist game that winds up playing like a voxel-style Rube Goldberg machine of epic proportions.</p><p>In Teardown, you'll be tasked with stealing fine art, destroying rivals' boats, trashing supercars, and more. You'll do it all in sandbox levels that are thoughtfully designed and totally reactive right down to the last pixel. Each mission tends to have multiple objectives, and as soon as you initiate any one of them, you'll have just a minute or so to complete the rest and escape before the police show up and bust you. Thus, the game becomes a series of well-considered and even better-executed obstacle courses of your own creation. It's like the world's coolest display of falling dominos. You set up each scene with the shortcuts, timed explosives, and getaway cars you think you'll need, then you run through it all like a frantic race to mission success. Trial and error here is not a caveat; it's the main draw.</p><p>In our <a href=\"https://www.gamespot.com/reviews/teardown-review-came-in-like-a-wrecking-ball/1900-6417871/\">Teardown review</a>, Alessandro Barbosa said, \"Teardown's greatest strength then lies in its underlying premise. The ability to jump into highly reactive maps with an assortment of fun tools to tear them apart remains as entertaining now as it was when I first started playing, and the chaotic nature of its physics are a consistent source of joy.\"</p><div class=\"norewrite\" title=\"\">           <a href=\"https://store.steampowered.com/app/1167630/Teardown/\">See at Steam</a> </div></h3></p><br />     <p><h2>Two Point Campus</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1632/16320660/4074056-two-point-campus-header.jpg\" /><br /><h3><p>If you played Two Point Hospital, you already know how the similarly named dev house, Two Point Studios, is really good at this sort of thing, but if you're new to the series--or even the simulation genre, here's a succinct explainer on why Two Point Campus is awesome. With the studio's returning Wallace &amp; Gromit-esque art style, a sense of humor and lightheartedness seen in every corner of the game, and a deep suite of features and mechanics, Two Point Campus takes the sim genre to fairly novel territory and makes it compelling for old and new players alike.</p><p>Building and organizing a successful college campus could've been the entire game, but Two Point Studios adds clever depth to the experience, like managing the school's party aspect as much as you do its academic intentions. There's also a weird cult in the neighborhood, but we won't spoil all that here. Happy students mean tuition payments are flowing in, so creating the classrooms <em>and</em> dorm rooms they expect to find are paramount, but every college kid wants to let loose once in a while (at least), and striking that balance between prestigious university and wild party school makes Two Point Campus a funny and sometimes unpredictable entry to the sim genre.</p><p>In our <a href=\"https://www.gamespot.com/reviews/two-point-campus-review-old-school/1900-6417929/\">Two Point Campus review</a>, Richard Wakeling said, \"Two Point Campus maintains reverence for its roots, but it also embraces its fresh new setting in a way that captures more of the magic that made Theme Hospital so beloved.\"</p><div class=\"norewrite\" title=\"\">           <a href=\"https://store.steampowered.com/app/1649080/Two_Point_Campus/\">See at Steam</a> </div></h3></p><br />", "persistent": false}, {"source": "https://www.gamespot.com/feeds/mashup", "link": "https://www.gamespot.com/videos/best-nintendo-switch-games-2022/2300-6460271/", "title": "Best Nintendo Switch Games 2022", "date_published": "2022-12-17 02:29:00+00:00", "description": "<img height=\"480\" src=\"https://www.gamespot.com/a/uploads/square_medium/1352/13527689/4078618-gs-boty-2022-best-nintendo-games.jpg\" width=\"480\" /> The Nintendo Switch is getting up in years, but the hybrid portable console is still going strong. The platform had a solid year of great new releases, especially from outside the realm of Nintendo's usual top-tier franchises.", "persistent": false}], "source url": "https://www.gamespot.com/feeds/mashup", "source title": "GameSpot"}