[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "THE BEE WEEKLY: Flying Spaghetti Monsters and Bad British Food", "description": "Kyle, Adam, and Dan talk about this week at The Babylon Bee and talk to Justin Brierley from the ‘Unbelievable?’ podcast about bad British food, the worst atheist arguments, and staying Christian even while arguing with other Christians. Kyle and Adam also try to roast the resident Reformed guy in the office. The interview show is now a part of The Bee Weekly, so tune in to a new action-packed Bee Weekly!\n\nBe sure to check out Justin Brierley’s ‘Unbelievable?’ book and podcast. He also hosts The Big Conversation, so check that out! https://www.youtube.com/c/Unbelievableshow\n\nThis episode is brought to you by Enduring Word Bible Commentary. Go to https://enduringword.com for David Guzik’s completely free teaching resources.\n\nThis episode is also brought to you by INKL. Go to https://inkl.com/bee for curated ad-free news from reliable sources.\n\nThis episode is also brought to you by Faithful Counseling. Go to https://faithfulcounseling.com/babylonbee to connect with a fellow believer online within a network of licensed, professional therapists.\n\nThe Bee guys talk about the banger and bomb article of the week and then Weakly News with Adam Yenser gives you all the news you need to know for this week. Kyle and Adam roast the Reformed guy Dan Coats. The Babylon Bee obtained an exclusive interview with one of Kamala Harris’ staffers, so hear it here on The Bee Weekly. Then, Justin Brierley of ‘Unbelievable?’ sits down with Kyle and Adam to talk about apologetics, annihilationism, and how British people sound very intelligent, but still have bad British food. And then, The Bee gets called out for being blasphemous for writing a story about Chick Fil-A getting an order wrong.\n\nIn the subscriber lounge, Dan answers more questions from subscribers to The Babylon Bee about predestination, Roman Catholicism, and NFTs. There’s also the best subscriber headlines, classic article of the week, and bonus hate mail. There’s also a lot of N.T. Wright discussion in the rest of the interview with Justin Brierley!", "link": "https://www.youtube.com/watch?v=Pr5MirlHFlk", "date_published": "2022-01-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]