[{"source": "https://www.theguardian.com/rss", "title": "‘Vaccinations work, I encourage people to have them’: the army veteran helping his community to get boosted", "description": "<p>Nigel Jones, an emergency medical technician, has spent 41 years working for the army and the emergency services. Here, he explains why what he saw during the pandemic prompted him, along with other military veterans, to lend his skills to the Covid-19 vaccination effort</p><p>Nigel Jones is no stranger to emergency situations. After nearly 11 years in the Royal Signals, followed by 24 years in the fire service, Jones, from Penperlleni in Monmouthshire, now works as a full-time emergency medical technician with the Welsh ambulance service.</p><p>Alongside the day job, his passion for volunteering has seen him join forces with charities such as SSAFA (the armed forces charity), the Fire Fighters Charity and mountain rescue. Two-and-a-half years ago, he began offering his help as an international responder to Re:Act Disaster Response, a charity that deploys military veterans to emergency situations where their hard-earned skills often prove invaluable.</p> <a href=\"https://www.theguardian.com/all-in-all-together/2022/jan/21/vaccinations-work-i-encourage-people-to-have-them-the-army-veteran-helping-his-community-to-get-boosted\">Continue reading...</a>", "link": "https://www.theguardian.com/all-in-all-together/2022/jan/21/vaccinations-work-i-encourage-people-to-have-them-the-army-veteran-helping-his-community-to-get-boosted", "date_published": "2022-01-21 11:19:38+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Love jihad: India's lethal religious conspiracy theory – video", "description": "<p>The mutilated body of a 24-year-old Muslim, Arbaaz Aftab Mullah, was discovered on a railway track near his home. His family believe he was murdered because of his interfaith relationship with a Hindu woman and that he is one of the latest victims of the 'love jihad' conspiracy theory, which has swept across groups of Hindu nationalists in India. The theory claims that Muslim men are seducing Hindu women and luring them into marriage in order to convert them to Islam. The claims are baseless, yet the consequences are real</p><p><b>• This video was amended on 24 January 2022 to correctly refer to [Narendra] Modi as prime minister rather than president.</b></p><ul><li><a href=\"https://www.theguardian.com/world/2022/jan/21/they-cut-him-into-pieces-indias-love-jihad-conspiracy-theory-turns-lethal\">‘They cut him into pieces’: India’s ‘love jihad’ conspiracy theory turns lethal</a></li></ul> <a href=\"https://www.theguardian.com/world/video/2022/jan/21/love-jihad-indias-lethal-religious-conspiracy-theory-video\">Continue reading...</a>", "link": "https://www.theguardian.com/world/video/2022/jan/21/love-jihad-indias-lethal-religious-conspiracy-theory-video", "date_published": "2022-01-21 05:00:21+00:00", "persistent": false, "user": null, "language": "en-UK"}]