[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Meets globalFEST: Al Bilali Soudan, Kiran Ahluwalia, Tufan Derince", "description": "For the second consecutive year, NPR teams up with globalFEST for a thrilling online music festival we call Tiny Desk Meets globalFEST: three nights, nine bands, and a world of musical traditions beamed into your living room.\n\nBob Boilen | January 20, 2022\nEvery January, I attend globalFEST at a New York City nightclub and see some of the most fantastic music I'll experience all year. Not being able to do this live and in person again is a challenge, but it's also an opportunity: Leaving the nightclub for the desktop lets us share this festival with the world. And ... IT'S FREE!\n\nFor each of the three nights, Tiny Desk Meets globalFEST will present artists in intimate settings (often behind their own globe-topped tiny desks), some of whom are making their globalFEST debuts, while a few others are notable past performers.\n\nIt's all hosted by African pop star and four-time Grammy Award winner Angélique Kidjo. She is one of the greatest artists in international music today, a creative force with 13 albums to her name. She also performed at the inaugural edition of globalFEST in 2004.\n\nTiny Desk has been working from home since March 2020, bringing you performances from across the country and the world. We've tried to maintain the same spirit as the shows at my NPR desk — stripped-down sets, an intimate setting — just in a different space. The following biographical information about each performer was written by the globalFEST team.\n\nAl Bilali Soudan\nThe family members of Al Bilali Soudan, from Timbuktu, Mali, are sought-after musicians and griots. Led by Abellow Yattara, the band is a torch-bearer of quintessentially Tamasheq (or Tuareg) music, shaped by a continuous exchange between the tehardent (lute), vocals and hand percussion. The words sung are similarly percussive, like an instrument themselves. This genre of music has been performed for half a millennium by Tuareg griots to celebrate the end of harvest and the changing seasons, heroic warriors and noble families.\n\nSET LIST\n\"Apolo\"\n\"Djaba\"\n\nKiran Ahluwalia\nKiran Ahluwalia's original compositions embody the essence of Indian music while embracing influences from Mali and Western blues, rock, R&B and jazz. With her six-piece group of electric guitar, accordion, organ, tabla, bass and drum kit, Ahluwalia creates boundary-breaking songs that invite us to explore the human condition, transcending the self by losing ourselves in a trance of groove and melody. The two-time JUNO and Songlines award winner's open-hearted vocals have positioned her as one of global music's most compelling cross-pollinators.\n\nSET LIST\n\"Dil\"\n\"Rabba Ru\"\n\"We Sinful Women\"\n\nTufan Derince\nTufan Derince, a young Kurdish musician from Diyarbakir in southeast Turkey, is a master of the elektro bağlama, an electrified version of the bağlama of Turkish folk music. Now based in Rotterdam, he is in high demand as a performer at events integral to the cultural lives of Kurdish communities throughout Europe and across Turkey.\n\nDerince made his U.S. debut at globalFEST in New York in 2020, which led to glowing coverage from NPR, The New York Times, and Songlines, and invitations to other international festivals like Dubai Expo 2020 and SXSW.\n\nSET LIST\n\"Govend\"\n\"Granî\"\n\"Delilo\"\n\nTiny Desk Meets globalFEST\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mixing: Josh Rogosin\nTiny Production Team: Bobby Carter, Kara Frame, Joshua Bryant, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\nGLOBALFEST ARTISTIC TEAM\nCo-Directors: Shanta Thake, Isabel Soffer, Bill Bragin\n2022 Curators: Shanta Thake, Isabel Soffer, Bill Bragin, Gabrielle Davenport\n\nGLOBALFEST PRODUCTION TEAM\nEvent Producer: Ian Thake\nProducer: THE OFFICE performing arts + film\nVideo Producer: Karim Tabbaa\n\nSPECIAL THANKS\nThe Andrew W. Mellon Foundation\nNational Endowment for the ArtsNYC Department of Cultural Affairs\nNYC Mayor's Office of Media and Entertainment\nJanArtsNYC.org\nSocial Media Manager: Valerie French\nPublicity: Yuri Kwon, Pitch Perfect PR\nLegal Services: Tamizdat\nLegal Services: Duane Morris\nTHE OFFICE performing arts + film consists of Rachel Chanoff, Laurie Cearley, Olli Chanoff, Erica Zielinski, Nadine Goellner, Lynn Koek, Noah Bashevkin, Catherine DeGennaro, Gabrielle Davenport, Chloe Golding, Kyla Gardner, Tess Peppis, Zion Jackson, Scout Eisenberg and Jose Alvarado", "link": "https://www.youtube.com/watch?v=G3QgBxK5Ev8", "date_published": "2022-01-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]