[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "IS LINUX MINT 20.3 still the BEST LINUX DISTRO for BEGINNERS?", "description": "Extend the life of your CentOS 8 servers while you plan your migration: https://tuxcare.org/eol-linux-support\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nI also do a Gaming Podcast: https://www.youtube.com/channel/UCbRPZ11S1quJ4ESoj42A3ug\n\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:27 Sponsor: Extend the life of your CentOS 8 servers\n01:27 Mint makeover: the new theme\n03:47 Cinnamon updates\n05:31 Application updates\n06:58 Is Mint still the best for beginners?\n10:31 Get a new Linux device\n11:02 Support the channel\n\nFirst, there is a new default theme. It's not a huge departure from the previous one, but it makes a few interesting choices.\n\nThe titlebars now have rounded corners. The titlebar buttons are a bit bigger now, and their hover zone has been expanded, so they're easier to click. These buttons have also taken on a more Windows-like appearance. The toolbar buttons don't use green anymore, nor do the menu items in the still pervasive menubars, the file manager's sidebar also doesn't use a black background anymore, and generally, the default grey has been made lighter compared to the previous one.\n\nThe older theme is still available in the repos, under the mint-themes-legacy package, and you can still change colors in the appearance settings.\n\nSpeaking of dark mode, Mint now supports it properly, and has made some of their default apps dark by default, mostly the one that display media\n\nThis can be configured per app, in their respective preferences.\n\nAlso to be noted, the titlebars will now automaticallyt adapt to the dark theme you picked.\n\nMint 20.3 also improves on the Cinnamon desktop.\n\nFirst is the calendar integration. In the calendar applet, you can now see events from multiple calendars, using their attributed color, so you can get a quick heads-up of what your day's going to look like\n\n\nNemo, the file manager now correctly handles moving or copy pasting files with the same name. \n\nWindow animations have been simplified and tuned. Cinnamon also improved support for right to left languages, and it has better integration with nvidia optimus, for supporting apps that don't want to use the default GPU, among a lot of other smaller fixes.\n\nThe default apps also have received a lot of updates.\n\nFirst, there is a new application, called \"Thingy\". It serves as a document manager, which means it will list all your recent and favorite documents, like PDFs, but also LibreOffice documents.\n\nHypnotix, the IPTV player now has search to find channels, but also specific movies and series. \n\nThe sticky notes app now lets you search through your notes, the title of each note is now embedded into its body, which looks much better, and you can change the text size from the notes toolbar.\n\nXReader, the PDF and document viewer can now read manga properly using right to left mode, and using the arrow keys moves the pages in the right direction: going left moves the document forward. \n\n\nIs Linux Mint still THE distro to recommend to beginners? Does it still hold up compared to other options that have moved more aggressively, like Fedora, or Zorin OS ?\n\nMint still offers one of the most complete experiences for newcomers. It comes with a backup tool, a driver manager, power statistics, preferences for virtually anything you might want to change. In that, it still retains an edge over GNOME based distributions, for beginners, especially coming from Windows.\n\nWhere Mint falls behind, in my opinion, is in the software manager. Mint bases itself on Ubuntu 20.04, which means that the apps in its repos are outdated. Really outdated.\n\nApart from that, I don't really see anything that can compete with Mint for beginners, still.\n\nSo yeah, for now, MINT keeps the crown, in my opinion. If you want a complete graphical experience, you go to MINT, if you want better looks out of the box, you go to Zorin.", "link": "https://www.youtube.com/watch?v=pNWDnJ_kESM", "date_published": "2022-01-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]