[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Call Of Duty: Modern Warfare 2 Remastered's Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of the Call Of Duty: Modern Warfare 2 Remastered, including the iconic Intervention sniper rifle, the Aug assault rifle, and a gold Desert Eagle embraced by a teddy bear.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Call Of Duty: Modern Warfare 2 Remastered and compares them to their real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=F4hTzvlwKLk", "date_published": "2022-01-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Things You Never Knew About Pokémon", "description": "From Mew almost never existing, to Satoru Iwata adding in Gen 2's most beloved feature, here are 10 things you might not know about the Pokémon franchise.\n\n\nPokémon has had plenty of fun stories and interesting tidbits throughout its lifetime. The historic franchise has been going strong for over 25 years. With that longevity comes iconic glitches, bugs, and playground stories of secret Pokémon embedded in-game codes. We break down a small handful of things that you may not know about Pokémon in this video.\n\nThe stories range wildly, from the fact that Nintendo had no idea Mew even existed to late president Satoru Iwata being an absolute legend with his assistance on compressing data in Gold and Silver. There are dozens of Easter eggs and fun trivia-style facts about Pokémon.\n\nPokémon Legends: Arceus will be the latest entry in the Pokémon franchise and arguably one of the most anticipated games in 2022. Be sure to check out our coverage and upcoming guides, breakdowns, and previews by subscribing to our GameSpot YouTube channel!\n\n#Pokémon", "link": "https://www.youtube.com/watch?v=WxYIK8vnHZY", "date_published": "2022-01-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "20 MORE Things You STILL Didn't Know In Zelda Breath Of The Wild", "description": "We're not slowing down anytime soon! This time we take a look at new ways to detonate bomb arrows, how to smuggle wildlife into the Gerudo Desert, and the hidden meaning behind the Yiga Assassin's cursed letters!\n\nIn the video above, we cover 20 facts, tips and tricks that aren’t quite as well known, ranging from secrets to glitches, some that are pretty simple and others that are fairly complex. The Legend of Zelda: Breath of the Wild has been out for four years at this point, and players have found some amazing things, intended or not, that keep the game and its sense of discovery feeling fresh.\n\n0:00 Intro\n0:14 Bomb Arrow Duds Explode\n0:47 Collapse Stalnox Instantly\n1:15 Mipha's Initial Design\n1:36 Pot Buoyancy\n1:55 Smuggle Deer Into The Desert\n2:15 Shrine Targets With Bomb Arrows\n2:37 Read Cut Down Signs\n2:51 Stal Enemies Throw Damage\n3:14 Explode Into The Sky\n3:44 Final Memory Changes\n4:16 Lizalfos Arm Design\n4:33 Flip Guardians With Bomb Arrows\n4:49 Rainbows At Night\n4:56 Royal Family Portrait\n5:22 Nintendo Explains Visual Effects\n5:49 Shielded Flip\n6:31 Yiga Ninjutsu\n7:05 Minecart Trains\n7:38 Enemies Are Awkward With Windcleavers\n7:59 Multishot Fire/Bomb Arrows Carry Ancient Flames\n8:30 Outro\n\nIf you'd like to see advanced combat techniques, you can check out the Combat Glossary listed here. \nhttps://docs.google.com/document/d/1qtYT06sxweRW3tRnovcCc-f4xIOGFNsD02pG1TzloHc/edit?usp=sharing", "link": "https://www.youtube.com/watch?v=XtAFMmCAqWo", "date_published": "2022-01-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call Of Duty Still On PlayStation, Might Not Be Yearly | GameSpot News", "description": "Call Of Duty Will Still Release On PlayStation, Call Of Duty Might Stop Being A Yearly Series and Battlefield 2042 Might Go Free-To-Play.\n\nIn this video, DeVante talks about Microsoft Gaming CEO Phil Spencer tweeting about the future of Call of Duty on PlayStation following Microsoft’s acquisition of Activision Blizzard. Other Activision Blizzard brands remain question marks regarding exclusivity.\n\nLater in the video, DeVante covers a report that Call of Duty might stop releasing yearly. As well as the possibility of Battlefield 2042 going free-to-play due to disappointment from EA.\n\nSTAMPS\n00:00 - Intro\n00:08 - Call of Duty on PlayStation\n01:20 - Call of Duty Yearly Releases\n02:03 - Battlefield might go free-to-play", "link": "https://www.youtube.com/watch?v=m3nQDRkFSMQ", "date_published": "2022-01-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PlayStation Reacts To Xbox & Activision News | GameSpot News", "description": "Sony responds to Xbox/Activision news, says games will stay multiplatform for now, Call Of Duty: Vanguard and Warzone Pacific Season 2 delayed, and despite Call Of Duty's new anti-cheat efforts, hackers are flying cars in Warzone\n\nIn this video, DeVante talks about Sony reacting to this week’s massive Xbox news and Activision releasing more details about the deal with Microsoft. The company recently published the prospectus of its deal with Microsoft, and there are multiple sections pertaining to what happens with regards to \"existing partner agreements.\"\n\nDeVante also talks about Activision delaying the launch of Call of Duty: Vanguard and Warzone Pacific's Season 2 to Monday, February 14. One reason for this could be the hackers currently flying cars around Caldera and Rebirth Island to rack up easy kills.\n\nSTAMPS\n00:00 - Intro\n00:05 - Sony Reacts\n01:36 - COD Season 2 Delay\n02:15 - COD Hackers", "link": "https://www.youtube.com/watch?v=rWvqD_tRtBA", "date_published": "2022-01-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]