[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "GTA 5's Franklin Reacts To Grand Theft Auto V", "description": "Shawn Solo Fonteno, aka Franklin from Grand Theft Auto 5, joins us to break down viral scenes from the game as well as GTA Online's The Contract missions. \n\n00:00 Introduction\n00:15 Franklin talks to a dog mission\n02:22 Franklin gets roasted by Lamar\n05:20 Trevor falls over\n09:08 Franklin in GTA Online's The Contract\n12:58 Chop\n13:58 Choosing ending C\n18:28 Outro\n\nIt's hard to believe it's been almost a decade since GTA 5 launched, partly because it is still getting updated and brought to current-gen consoles, and partly because its multiplayer counterpart, GTA Online, is still getting meaningful updates. Take its most recent update, The Contract, for example, not only did it pull in heavyweights Dr Dre and DJ Pooh, but also brought back GTA 5 protagonist Franklin.\n\nTo celebrate, we brought in Franklin's actor, Shawn 'Solo' Fonteno, to discuss what it was like making GTA 5, and to react to some of the game's most popular clips. In the above video, he describes what it was like to work with both the real and fake Chop the dog, his experience learning Franklin's role in the story, as well as the origins of the infamous Franklin gets roasted clip. \n\nCheck out Shawn's book here: https://sologamechanger.com/book/ \nhttps://twitter.com/Shawn_Fonteno \n\n#GTA5 #GrandTheftAuto5", "link": "https://www.youtube.com/watch?v=TcX-RvyW4tk", "date_published": "2022-05-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "What A Modern Warfare 2 Logo, Battlefield Redemption Arc, And Overwatch 2 Beta Means For Shooters", "description": "Call of Duty is bringing King Kong And Godzilla to Warzone Season 3, Overwatch 2 has a PvP beta live right now, and Battlefield 2042 seems ready for a redemption arc? Join Aaron and David as they break down what's happening in shooter games this week.\n\nTimestamps\n0:00 Introduction\n0:38 Call of Duty Season 3\n4:00 Battlefield 2042 Update\n7:48 Overwatch 2 Beta Thoughts\n14:45 Community Thoughts", "link": "https://www.youtube.com/watch?v=NPZqARSMY-k", "date_published": "2022-05-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "23 MORE Things You STILL Didn't Know In Zelda Breath Of The Wild", "description": "Its been a whole year since we first started, thank you all for sticking around! This time we'll be escaping the earthly borders of Hyrule, super swimming through water, and finding out the only way to break metal treasure chests.\n\nIn the video above, we cover 23 facts, tips and tricks that aren’t quite as well known, ranging from secrets to glitches, some that are pretty simple and others that are fairly complex. The Legend of Zelda: Breath of the Wild has been out for four years at this point, and players have found some amazing things, intended or not, that keep the game and its sense of discovery feeling fresh.\n\n0:00 Intro\n0:16 Break Metal Chests\n0:38 Go to Space\n1:10 We Got The Impossible Shock Arrow\n1:23 Mysterious Mushrooms In Lost Woods\n1:56 Sneak Into Gerudo Town\n2:22 Large Barrels Can Float\n2:31 Walk Backwards On Large Barrels\n2:36 Escape Hyrule\n2:50 Gerudo Greeting Secret\n3:08 Gerudo Secret Club Interaction\n3:18 All Lynels Have a Plunge Attack\n3:33 Hyrule's Western Plateau\n3:53 Knockout Sidon\n4:13 Selmie's Shield Preferences\n4:39 Nintendo Used Old Characters During Testing\n5:01 Moblins Can Cut Trees With Spears\n5:21 Cute Horse Things We Never Got\n5:47 Zora Domain Cutscene Changes\n6:05 Stand On Korok Balloons\n6:11 What A Korok Flower Looks Like Underneath\n6:18 BOTW Super Swim\n6:50 Moza Can Fight... Sort Of\n7:05 Nintendo's Default Template For Items\n7:45 Outro", "link": "https://www.youtube.com/watch?v=mSGErDhf88k", "date_published": "2022-04-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "“Positively Shocking” - Firearms Expert Reacts To Ready Or Not’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Ready Or Not including a number of non-lethal firearms such as the Taser and a paintball gun that fires irritant, as well as more conventional weapons like the MP5 and the FN FAL.\n\n00:00 - Opening\n00:43 - MP5 A4\n03:45 - Mossberg 500 Breaching Shotgun\n05:29 - Taser\n07:42 - M4A1\n11:00 - Colt Python\n14:07 - Paintball Gun\n15:37 - FN FAL\n17:50 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Ready Or Not and compares them to their potential real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=cQj1loCn7t0", "date_published": "2022-04-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]