[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "4 areas where LINUX still FAILS compared to other operating systems", "description": "Download Safing's Portmaster for FREE and take control of your network traffic, or try out the SPN until the end of January: https://safing.io/portmaster\n\n\nGet 300€ off the Slimbook TITAN with offer code titan-laptop-nickfan: https://slimbook.es/en/store/titan/titan-comprar\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nI also do a Gaming Podcast: https://www.youtube.com/channel/UCbRPZ11S1quJ4ESoj42A3ug\n\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:58 Sponsor: Get your internet connection under control\n01:50 Niche and Pro Applications\n03:54 Gaming\n05:47 Hardware availability\n07:51 Presenting Choice in a Legible Manner\n11:08 Final thoughts\n\n\nLet's get this out of the way: WIndows and mac os have superior app support than our Linux desktops have. We do have plenty of great software, alternatives to most, if not all, the biggest proprietary utilities that people use.\n\nProfessionals that rely on these niche applications need the missing 10% of features in most cases. And even if they could do without these 10%, there's still the matter of compatibility with your existing projects, files, and the training required.\n\nLinux still fails at that, even though we could still say that these app developers fail at bringing their apps to Linux, the fact remains: their apps aren't on Linux, and so the pros that depend on them aren't on Linux either.\n\nSecond area where Linux fails is gaming\n\nWe've come a long way. With Proton, Steamplay, Heroic Games Launcher, Lutris, and plenty of other awesome utilities, gaming on Linux is a reality. For singleplayer titles. If you love your day one multiplayer sessions from the latest AAA titles,though, Linux does NOT work well.\n\nAnti cheat is coming, in the meantime, 50% the top 10 most played games on Steam don't run on Linux for multiplayer, or at all. And that number grows if you start looking at games that aren't on Steam.\n\nThird area where Linux fails is hardware.\n\nFirst thing is, Linux distros don't ship preinstalled on most hardware. We have tons of hardware manufacturers and resellers, and even bigger ones like Dell and Lenovo start shipping devices with Ubuntu or Fedora.\n\nWe have Tuxedo and SLimbook, Starlabs and System76, Entroware, Purism, Juno Computers, the Pine64, and probably a lot more that I'm forgetting. But none of these devices are making their way in a general, mass market, retail store.\n\nThe goal is to make sure that people SEE that these options exist. They probably won't buy them outright, but after your second computer renewal, maybe you decide to go for the one that's slightly cheaper, with that interesting looking OS.\n\nFInal area where Linux fails is the choice.\n\nNot because we lack choice. And, surprisingly, not because we have too much choice. Simply because we have a lot of choices, and they're super hard to present in a legible manner\n\nDistrowatch is not a good resource for picking a distro. Its ranking system makes no sense for newcomers and the website looks straight out of the 90s. No way anyone wants to browse that to find which distro they should use.\n\nDistro Chooser is way more user friendly, but after you completed the questionaire, you're presented with something like 40 options, which doesn't narrow it down at all.\n\nAlmost all the answers are valid. It all depends on what the user wants, likes, is used to, is looking for, their hardware, their ethical preference... It's virtually impossible to answer this kind of question:\n\nWhat we, as a community, need to realize, is that we should have ONE distro per desktop environment to recommend for beginners. Neon, some kind of GNOME OS, XFCE OS, MATE OS, Linux Mint, and PopOS once they have their own DE.", "link": "https://www.youtube.com/watch?v=gIClssVcVoo", "date_published": "2022-01-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]