[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo 3: 10 Things You Never Knew", "description": "Halo is much more than just a game. The series is a cultural touchstone that has become a pillar in the shooter genre. So in honor of the 15th anniversary of Halo 3 this month, I wanted to focus on one of the most influential shooters of all time. These are ten things you never knew about Halo 3.\n#gaming #Halo #gamespot #Bungie \n\nStu here to break down the hidden secrets and fun facts about Halo 3. Halo, especially the Bungie-made entries, are regarded as some of the most prestigious shooters in video games. They tell a compelling and highly praised story and offer a plethora of multiplayer options that are bar none in the industry. I love that the devs were able to add some ridiculous secrets and easter eggs in Halo 3. Now all I want to do is get in some crazy gravity hammer battles on Narrows.\n\nCREDITS: \nStuart Kimball: Writer / Host / Producer\n\nSTAMPS:\n00:00 Intro\n00:18 Here Kitty Kitty!\n00:58 Bomb Voyage\n01:31 Missing Link\n02:23 Jason Jones\n03:21 Hippos? In My Halo Game?\n03:45 Marine Versus Password\n04:35 Yeah, Suck it Fronk!\n05:18 Ears of The Devil\n06:49 Life's A Beach, And We're Just Playin In The Sandbox\n07:42 Outro", "link": "https://www.youtube.com/watch?v=cPh0yALVZ_I", "date_published": "2022-09-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Moonbreaker Exclusive Lore & Gameplay Livestream with Brandon Sanderson & Charlie Cleveland", "description": "Tune in at 5pm PT for the Moonbreaker Lore Showcase, presented by GameSpot. Legendary author and creator of the Moonbreaker universe, Brandon Sanderson, and Game Director, Charlie Cleveland, will be showing off the game and talking about its story and worldbuilding.\r\n\r\n#moonbreaker #gamespot #brandonsanderson", "link": "https://www.youtube.com/watch?v=sDSBNZBh4xA", "date_published": "2022-09-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Original Heroes Locked For New Players In Overwatch 2 | GameSpot News", "description": "In today’s GameSpot News, we discuss Overwatch 2 locking the original game’s heroes for new players as well as MultiVersus doubling the leveling requirement.\n#GamingNews #Overwatch2 #MultiVersus\n\nAccording to Blizzard's blog post, new players are those who are making their accounts post-Overwatch 2 launch and aren't those who already have an account in Overwatch.\n\nNew players will first begin with a restricted pool of modes and heroes. In the first half of Overwatch 2's First Time User Experience, they'll unlock all the modes. In the second half, players will progressively obtain original Overwatch heroes. It will take 100 matches to unlock the full original roster.\n\nThe game’s 1.03 patch will increase the amount of experience needed to level up a single character between levels 3 and 15, as the developers found that \"players could get to level 15 of the mastery track too quickly.\" MultiVersus fans reacted to the change over on the game’s subreddit with memes and long threads about whether or not this is a positive change. One of the suggestions a handful of users think would help the experience is the addition of more rewards after level 15. Another user suggested making a character’s gameplay related perks complete at level 10 and make everything above 10 cosmetic or currency. \n\nFull Patch Notes: \nhttps://www.gamespot.com/articles/multiversus-1-03-patch-adds-rick-sanchez-makes-shaggy-free-for-all-new-players/1100-6507834/\n\nSTAMPS\n00:00 - Intro\n00:08 - Overwatch 2\n02:13 - MultiVersus", "link": "https://www.youtube.com/watch?v=z3HZu8qS6UQ", "date_published": "2022-09-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 Official Launch Trailer", "description": "Overwatch 2 launches October 4!\n\nPrepare yourselves for a  one-of-a-kind, action-packed, free-to-play experience with new maps, new modes, and new heroes.\n\n#overwatch2 #gaming", "link": "https://www.youtube.com/watch?v=53c0mcwJd6Q", "date_published": "2022-09-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 Dev Reacts To Game’s Popularity | GameSpot News", "description": "One of Cyberpunk 2077’s developers has reacted to the game’s rise in popularity and a solid date for E3 2023 has been officially announced.\n#GamingNews #Cyberpunk2077 #Witcher3 \n\nCyberpunk 2077's initial launch period was highlighted by game-breaking bugs and massive performance issues across last-gen Xbox One and PlayStation 4 consoles at the time. In an unprecedented move, Microsoft and Sony began issuing refunds, with Cyberpunk 2077 being removed from the PlayStation storefront for a lengthy period of time.\n\nFast-forward to 2022, and Cyberpunk 2077's road to recovery has seen developer CD Projekt release massive patches that have helped it find new life on console and PC. The recent Cyberpunk: Edgerunners anime series on Netflix has also helped shift new fans to the game, and on Steam the game has climbed the charts and remains in the top 10 most-played games on Steam currently.", "link": "https://www.youtube.com/watch?v=YeAEHpF_z7U", "date_published": "2022-09-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Complete GOD OF WAR Timeline Explained!", "description": "The God of War franchise has a sprawling timeline that interweaves its Great Greek Tragedy across 9 games, and 2 wildly distinct mythologies. But how does it all tie together?\n\n00:00 - Opening \n00:44 - Ghost of Sparta Flashbacks\n02:11 - God of War Flashbacks\n04:17 - God of War: Ascension\n06:16 - God of War: Chains of Olympus\n08:40 - God of War (2005)\n12:03 - God of War: Ghost of Sparta\n13:42 - God of War: Betrayal\n14:15 - God of War 2\n17:49 - God of War 3\n22:11 - God of War (2018)\n25:30 - God of War: Ragnarök\n26:12 - Ending\n\nThis video breaks down the franchise chronologically, charting the story of Kratos from a hot headed youth, through to a captain in the Spartan army all before his grand odyssey through the Greek and Norse mythologies.\n\nWith God of War Ragnarök set to further slide the franchise’s anti-hero, Kratos, into a mythological mire, what better time to dive back into the Ghost of Sparta’s saga of gods and monsters.\n\nTimeline Playlist - https://www.youtube.com/watch?v=3gaFRoP4RUA&list=PLpg6WLs8kxGN7aotOq-B5tYZWpvTZ3KRS", "link": "https://www.youtube.com/watch?v=iCksL4z1vs4", "date_published": "2022-09-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "World of Warcraft Wrath of the Lich King Remastered Cinematic Trailer", "description": "Experience one of World of Warcraft’s most iconic cinematic trailers now remastered in 4K.\n\nWrath of the Lich King Classic launches September 26 at 3PM PDT. \n#wow  #warcraft #gaming", "link": "https://www.youtube.com/watch?v=FIRYWOqJUxc", "date_published": "2022-09-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]