[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCW0gH2G-cMKAEjEkI4YhnPA", "title": "LIVE with Maxim Baldry (Isildur in The Rings of Power)", "description": "We'll chat LIVE with Maxim Baldry, Isildur in The Lord of the Rings: The Rings of Power!\r\n\r\n#theringsofpower #lordoftherings #ringsofpower", "link": "https://www.youtube.com/watch?v=X-AbQwhOUDo", "date_published": "2022-09-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCW0gH2G-cMKAEjEkI4YhnPA", "title": "Helm of Théoden Unboxing | Lord of the Rings Collectibles Review", "description": "Check out the Helm of Théoden: https://bit.ly/3D1OdeR\n\nProduct Description: Théoden was the noble and courageous King of Rohan and Lord of the Riddermark. He led his people to victory against the Uruk-hai in the Battle of Helm’s Deep, despite overwhelming odds. He then rallied his forces in the defense of Gondor, to protect the white city of Minas Tirith and the hope of all Middle-earth. He bravely fought against the forces of Mordor on the Pelennor Fields, where he made his last stand. Théoden’s armor and weapons were the finest in Rohan. His steel helm was ornately engraved and enameled, featuring a horse head crest. The surface was highly decorated with sun and horse motifs of bronze and copper. The leather neck guard was embossed with Rohirric designs. This authentically detailed replica is a reproduction of the actual filming prop built by Weta Workshop and used in “The Lord Of The Rings” films presented by New Line Cinema. The helm is crafted of reinforced polyresin and genuine leather, with precisely-molded details and coloring. It is presented with a polystone and wood display, sculpted in the shape of Théoden’s neck and shoulder armor. It includes a certificate of authenticity, and each piece is individually serial numbered on a metal shield.\n\nWhile this was sent to me by a vendor, I was under no obligation to give this item a positive review.  Any praise/criticism in my reviews is my genuine opinion/thoughts.  If you are surprised that I really enjoy a LOTR piece of memorabilia, you really shouldn't be. :)\n\n#lordoftherings #theoden #unboxing", "link": "https://www.youtube.com/watch?v=QEGsGSYipS4", "date_published": "2022-09-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]