[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Svaneborg Kardyb: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nKara Frame | May 25, 2022\nSvaneborg Kardyb’s Tiny Desk (home) concert was recorded in the countryside of Djursland, Denmark. “You have to drive for a while on a gravel road, and then you come to a lovely old house surrounded by hills and a stream on one side and a very flat landscape on the other, where you can see 10 miles away,” the band wrote to us, describing the location of the shoot. It’s this place that inspired Svaneborg Kardyb’s second album, Haven. “‘Haven’” (means garden in Danish). Haven celebrates places we like to be,” the duo writes.\n\nThe Danish jazz duo is composed of Nikolaj Svaneborg — on the Wurlitzer, synthesizer and piano, and Jonas Kardyb — on drums and percussion. Their instrumentation set-up is untraditional, with the drums and keys facing each other, a position that they play in on stage just as they do in Jonas’ kitchen and living room here. They open up their set with the title track from Haven, which begins with a quiet melody over an effervescent loop. The sound mimics the shimmy of leaves in the breeze. \n\nThis concert is the soundtrack for lying beneath a tree canopy and watching the sun illuminate each leaf, seeing the veins clearly as the sun makes its way down to reach each branch. Immersing yourself in nature is grounding, which is reflected in Jonas’ last line describing their (home) concert: “The countryside reminds you that it is lovely to place both feet in the grass.”\n\n\nSET LIST\n\"Haven\"\n\"Et Lite Øyeblikk Bare\"\n\"Orbit\"\n\"Terrassedør\"\n\nMUSICIANS\nNikolaj Svaneborg: Wurlitzer, synthesizer, piano\nJonas Kardyb: drums, percussion\n\nCREDITS\nVideo: Kristoffer Juel Poulsen \nAudio: Simon Wetterstrøm Mariegaard\n\nTINY DESK TEAM\nProducer: Kara Frame\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Michael Zamora, Joshua Bryant, Maia Stern, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #SvaneborgKardyb", "link": "https://www.youtube.com/watch?v=M1mg0yLDzvU", "date_published": "2022-05-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]