[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 Expansion Details May Have Leaked | GameSpot News", "description": "Cyberpunk 2077 expansion details have leaked, the Witcher 4 has completed its research phase, God of War: Ragnarok gets rated in Korea and Returnal may be coming to PC.\n#GamingNews #Cyberpunk2077 #TheWitcher\n\nAccording to VGC, which has seen the leaked files and first reported on them, hundreds of lines of dialogue spelling out most of the events and characters of Cyberpunk’s expansion have appeared online. The dialogue points to a datamined character named Songbird as the focus of the DLC. \nCD Projekt Red has announced that the latest installment in the Witcher saga has completed its \"research phase\" and is moving forward with development. This means that The Witcher 4 could be entering pre-production relatively soon, at which point CD Projekt Red will figure out the structure and scale of the game among countless other \n\nAccording to a SteamDB listing codenamed \"Oregon\", it contains tags and descriptions that match Returnal's world and gameplay mechanics. For example, it contains \"Tower of Sisyphus,\" which is an endless mode that is part of the game's latest expansion, Returnal: Ascension.\n\nSTAMPS\n00:00 - Intro\n00:06 - Cyberpunk 2077\n00:59 - Witcher 4\n01:42 - God of War Ragnarok\n02:15 - Sony’s PC plans\n02:38 - Returnal on PC?", "link": "https://www.youtube.com/watch?v=S4Gts-g71n4", "date_published": "2022-05-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sniper Elite 5 - 10 Things I Wish I Knew", "description": "Sniper Elite 5 brings a Hitman-esque sandbox to Rebellion’s series, so it’s time for you to learn tips and tricks about gun customization, how to survive invasions, why bottles are the funniest piece of kit, and more. \n\nSniper Elite 5 is the latest World War II-focused sniping game from developer Rebellion. It’s a game that sports massive Hitman-esque levels with tons of secrets, unlockables, and routes to find. Sniper Elite 5 also features extensive gun customization, with ammo types, scopes, wraps, trigger assemblies, and barrel attachments to swap out between missions or at weapon benches within each level. Players can build multiple load-outs to fit their playstyles. Because it’s a sandbox, there’s a lot to learn and plenty of things you probably didn’t know you could do.\n\nIn this video, we’ll show you 10 things we wish we knew before starting Sniper Elite 5. That means covering how powerful bottles really are in the game, why the 1911 pistol is one of the best starting weapons, why you should run through levels at first, and what weapon mechanics you should know about. Then, we’ll teach you how to survive player invasions, master the art of setting traps and distractions, use the overpowered melee to your best advantage, and even how to play if you don’t like stealth. Finally, we’ll take the most hardcore mil-sim players through the basics of Authentic mode, where the environment has a huge impact on projectiles and the game gives you minimal information. \n\nSniper Elite 5 releases on PS5, PlayStation 4, Xbox Series X|S, Xbox One, and PC on May 26. It has single-player, multiplayer, horde mode, and co-op, as well as cross-play.", "link": "https://www.youtube.com/watch?v=ycstMY0RhrQ", "date_published": "2022-05-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sniper Elite 5 Review", "description": "Sniper Elite 5 emphasizes player agency with another thrilling sandbox that excels when you're looking down the scope.", "link": "https://www.youtube.com/watch?v=JdHPR1Rxwo4", "date_published": "2022-05-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Quarry Hands-on Preview", "description": "While The Quarry doesn't make any drastic changes to Supermassive's attitude to horror games, a strong cast and solid writing prove that approach still works just fine.\n\nFor The Quarry, the latest story-driven horror game from Supermassive Games, the campfire setup is partially an homage to '80s-era horror and teen slasher movies like A Nightmare on Elm Street, Halloween, and of course, Friday the 13th. It's also partially a case of not fixing something that isn't broken. In fact, a lot of The Quarry will be familiar to anyone who's played Supermassive's other games: 2015's Until Dawn or the three games of the ongoing Dark Pictures anthology series. Supermassive has a pretty specific formula that works for its brand of cinematic adventure game, and it doesn't deviate from it with The Quarry--meaning that if you like its other games, you should have a fun time with this one.", "link": "https://www.youtube.com/watch?v=UNr_pjnMXBQ", "date_published": "2022-05-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Modern Warfare 2 Release Date Confirmed, More Info Coming | GameSpot News", "description": "Call of Duty: Modern Warfare 2 gets an official release date, Battlefield 2042 winding down Hazard Zone mode, and Apex Legends players on Xbox suffer from cheaters. \n#GamingNews #ModernWarfare2 #Battlefield2042 \n\nActivision has revealed the release date of October 28, 2022 for Call of Duty: Modern Warfare 2 in a new trailer. The trailer teased appearances from Simon “Ghost” Riley,  Captain John Price, John \"Soap\" MacTavish, Kyle \"Gaz\" Garrick, and a new character, Mexican Special Forces Colonel Alejandro Vargas.\n\nDICE has announced that support for Battlefield 2042's Escape from Tarkov-inspired mode, Hazard Zone, is \"winding down.\" This news comes as DICE outlined what the team has learned since Battlefield 2042's rocky launch and what the teams are currently focusing on ahead of the launch of Season 1, set to release in June.\n\nFollowing Season 13's update on May 10, a few bugs popped up, but none of them seemed particularly serious--that is, until several reports emerged claiming that freshly killed squads were using some sort of exploit to crash servers.\n\nSTAMPS\n00:00 - Intro\n00:06 - Modern Warfare 2\n01:08 - Battlefield 2042\n02:09 - Apex Legends", "link": "https://www.youtube.com/watch?v=PzUEFJDpmZ4", "date_published": "2022-05-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PS5 Pro & New Xbox Coming In 2023? | GameSpot News", "description": "TCL thinks PS5 Pro and a new Xbox is coming in 2023 or 2024, fans create Starfield in Unreal Engine 5, and No Man’s Sky releases its Leviathan update. \n#GamingNews #PS5 #XboxSeriesX\n\nTCL claims that these consoles will provide 60-120 FPS at 4K resolution, as well as have the ability to display 8K. They will also apparently utilize AMD Radeon RX 7700 XT technology and release sometime between 2023 and 2024 according to the company. \n\nA group of talented artists have created its own interpretation of what Starfield may look like if it were to use Unreal Engine 5. Starfield won't run on Unreal Engine 5 but rather Bethesda's Creation Engine 2, an evolution of the game engine the studio has previously used for games like Fallout 4 and The Elder Scrolls V: Skyrim.\n\nNo Man’s Sky has a new update in which time is slightly broken. Out today, this update features a roguelike-style Leviathan expedition that gives players a single life to use when they attempt to break the loop, with each death resetting the timeline and sending them back to square one.\n\nSTAMPS\n00:00 - Intro\n00:08 - PS5 Pro & New Xbox \n01:35 - Starfield fan creation\n02:18 - No Man’s Sky update\n02:57 - Marvel MMO canceled", "link": "https://www.youtube.com/watch?v=6h3zpldah80", "date_published": "2022-05-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]