[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Hippo Campus - session at The Current (full performance + interview)", "description": "According to Jake Luppen, the day that Hippo Campus sold out the Armory was the best day of his life. Not only did the band perform for 8,000 fans in their hometown, they also glimpsed a dream come true: a Hippo Campus star on First Avenue’s exterior wall.\n\nDespite the pandemic and all else, the members of Hippo Campus have had a lot to celebrate over the past few years. They’d planned to take a break from touring and write their next album starting in late 2019, but those months turned into years of settling back into the Twin Cities scene and even producing music for younger artists. “This record is the first time we got to be dead [as Hippo Campus],” Luppen says. “I finally got to live in reality.”\n\nHippo Campus’s third album, LP3, came out at long last earlier this year. Three of its earliest tracks — the ones that helped shape its sound — are “Ride Or Die,” “Bang Bang,” and “Ashtray.” Those are the tunes they performed at The Current’s studio this month.\n\nThere’s lots more to learn from Ayisha Jaffer’s interview with Jake Luppen and Zach Sutton of Hippo Campus. Enjoy the full interview and musical performances in the video above.\n\nSegments in this video:\n00:00 “Ride Or Die”\n03:28 “Bang Bang”\n06:46 “Ashtray”\n09:23 Interview with host Ayisha Jaffer\n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent?sub_confirmation=1\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/\nhttps://twitter.com/TheCurrent\nhttps://www.instagram.com/thecurrent/\n\n#hippocampus #thehalocline #hippocampusband", "link": "https://www.youtube.com/watch?v=hxM56KRHZ_s", "date_published": "2022-05-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]