[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PS1 Gameplay Shown On PS5 In New Video | GameSpot News", "description": "PS1 games are tested on PS5 in a new video, Elden Ring is getting a seamless co-op mod and Call of Duty Warzone’s season 3 mid-season update includes fast travel.\n#GamingNews #PS5 #EldenRing\n\nPlayStation 1 games have started to show up on PSN in Malaysia and YouTuber Mystic dropped a new video testing out the functionality of classic games on a modern console aka the PS5. \n\nPS1 Game on PS5 - https://www.youtube.com/watch?v=lkd7Xz15bao\n\nLast week LukeYui on YouTube dropped a trailer for an Elden Ring Seamless Co-op mod that they say “removes all multiplayer boundaries and allows for connections to persist after death. Game progression is shared between all players.”\n\nCall of Duty Season 3's mid-season update will go live for both Vanguard and Warzone following a May 24 update in Vanguard at 10 AM PT / 1 PM ET, and a Warzone update at 9 AM PT / 12 PM ET May 25. New additions will include a multiplayer map for Vanguard, while a new fast travel system is coming to Warzone.\n\nCall of Duty Season 3 Reloaded: https://www.gamespot.com/articles/call-of-duty-season-3-reloaded-will-bring-fast-travel-to-warzone-new-map-and-weapon-for-vanguard/1100-6503745/\n\nSTAMPS\n00:00 - Intro\n00:07 - PS1 on PS5\n01:19 - Elden Ring Mod\n02:11 - Call of Duty", "link": "https://www.youtube.com/watch?v=4JORXdeaE4U", "date_published": "2022-05-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sniper Elite 5 - Everything to Know", "description": "Sniper Elite 5, the latest in Rebellion’s head-shottin’, x-rayin’ shooter series is upon us, releasing May 26, 2022. If this is your first Sniper Elite game, or you’re a series veteran, here’s everything you need to know about Sniper Elite 5. #SniperElite #Gaming #GameSpot\n\n0:00 - Intro\n0:19 - Plot & Setting\n1:10 - Gameplay\n4:54 - Multiplayer\n6:52 - DLC\n7:07 - Platforms\n7:40 - Release Date & Price\n8:54 - Outro", "link": "https://www.youtube.com/watch?v=-CrtvYIxy7w", "date_published": "2022-05-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "7 Ways Fortnite Changed Gaming", "description": "Epic Games' Fortnite took the gaming world by storm in 2017 and remains an icon in the battle royale genre. In this video we break down 7 different ways Fortnite pioneered the live-service model of free-to-play games from establishing a successful battle pass, to being the first game to get true cross-play and cross-progression across major platforms. #Gaming #Fortnite #GameSpot\n\nFew games have made a lasting impact on a global scale like Fortnite. Epic Games free-to-play battle royale erupted onto the scene in 2017 and never looked back, constantly pushing the envelope and redefining what a live-service game should be. In this video we break down some of the significant changes Fortnite pioneered through its battle-royale game mode.\n\nWe take a deep look into Fortnite’s history and the state of gaming before then. For example cross-play and cross-progression systems were still uncommon and not something gamers expected to be a thing until Fortnite put the pressure on Sony to relent on its stingy position on multiplayer servers and their exclusivity on particular platforms. \n\nOn the other hand live-service games and microtransactions were increasingly common but few games were able to figure out how to make a rewarding system where players could feel like the free-to-play games were more than simple loot box cash cows. Not to mention consistent content updates and once in a lifetime live events. The jaw dropping concerts helmed by some of the biggest pop culture icons of our generation all in-game, are just some of the few ways Fortnite pioneered radical change in games.\n\nWe’ll have so much more to break down on Fortnite as well as other popular shooters like Call of Duty and Halo, so be sure to subscribe to GameSpot for all things gaming!", "link": "https://www.youtube.com/watch?v=2PllNVtwPb0", "date_published": "2022-05-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]