[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "esperanza spalding: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nSuraya Mohamed | January 7, 2022\nEnter into esperanza spalding's safe space for healing through music and song with a Tiny Desk (home) concert of selections from her Songwrights Apothecary Lab, (S.A.L.) project. A constant iteration of evolutionary ideas, her songwriting workshop is both a bold examination of human existence and resilience and a guided research collaboration with a collective of musicians and researchers in the practices of neuroscience, psychology and music therapy.\n\n\"All Formwelas (songs) from the S.A.L. are created through our research, divination, intuition, musicianship, taste, inspiration, and collaborative effort to design songs that enhance a specific salutary affect,\" spalding writes on her project site, along with brief descriptions for each of the three Formwelas performed here.\n\n\"Formwela 3\":\"a re-membering with the sun's vast and perpetual blessing as evidenced by one's own aliveness and capacity for creating within self and community an un-corruptible home-planet\"\n\n\"Formwela 4\": \"the articulation of needs streaming oxygenation through your ancestral vessel/vein of infinite life\"\n\n\"Formwela 8\": \"a sound at ease, with no urge to move from that comfort place\"\n\nspalding's performance here is outstanding, and her top notch band, Loving presences (aka singers) and the Magical dance presence (aka dancer) add a dimension of creativity that amplifies the music's message and nourishes the spirit. Green-screened walls explode to reveal a constellation of imagery that complements the flow of this seductive music. Be sure to watch until the end.\n\nSET LIST\n\"Formwela 3\"\n\"Formwela 4\"\n\"Formwela 8\"\n\"Formwela 3\"\n\nMUSICIANS\nesperanza spalding: vocals, bass\nVuyo (Vuyolwethu) Sotashe: vocals\nSafa Ishmel-Muhammad: vocals\nCorey King: vocals, guitar\nMatthew Stevens: guitar\nLeo Genovese: piano, Farfisa, Rhodes\nAaron Burnett: saxophone\nFrancisco Mela: drums\n\nLOVING PRESENCES\nDonna Hope: vocals\nJeff Tang: vocals\nLileana Blain Cruz: vocals\nMariza Scotch: vocals\nLisa Lamothe: vocals\nDiery Prudent: vocals\nAdobuere Ebiama: vocals\nShamel Pitts: dancer\n\nCREDITS\nDirector: Adrien GYSTERE Peskine\nProducer: esperanza spalding\nRecorded and mixed by Fernando Lodeiro\nConcept, Direction, Creative Direction, Sets, Editing, Foley, Choreography: Adrien GYSTERE Peskine\nProduction: Héloïse Darcq\nAdditional Production, Set Design: Anthony Peskine\nAdditional cameras: Jessica Cochran, Daniel Santos, Meg Stacker\nAssistant Sound Engineer: Quinn McCarthy\nSudan Pyramids Footage: Alexis Peskine\nWardrobe: JOJO ABOT\nRecorded at The Creamery Studio\n\nTINY DESK TEAM\nProducer: Suraya Mohamed\nVideo Producer: Kara Frame\nAudio Mastering: Andy Huether\nTiny Production Team: Bob Boilen, Bobby Carter, Maia Stern, Josh Rogosin, Joshua Bryant, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #esperanzaspalding", "link": "https://www.youtube.com/watch?v=2arc30068Wk", "date_published": "2022-01-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]