[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call Of Duty: Warzone 2 Review", "description": "New additions are fresh for the battle royale, while overhauls to some of Warzone classic features feels like a step backwards.\n\n#warzone #cod #gaming", "link": "https://www.youtube.com/watch?v=IPwdjsF7wEY", "date_published": "2022-11-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokemon Scarlet & Violet Exclusives And Differences Explained", "description": "From the available Pokemon, to the school and paradox forms, here are all the differences between Pokemon Scarlet and Violet.\n\nTimestamps:\n00:09 - Available Pokemon\n01:43 - The Naranja and Uva Academies\n3:05 - Professors and paradox form\n\n#gaming #pokemonscarletviolet #gamespot", "link": "https://www.youtube.com/watch?v=DVy-zhTeDtQ", "date_published": "2022-11-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Witcher 3 Update - What To Expect | GameSpot News", "description": "The Witcher 3: Wild Hunt is still getting new updates, and CD Projekt Red has detailed what to expect when the next major update arrives on December 14.\n\n#GamingNews #Witcher3\n\nThe Witcher 3 is also adding ray-tracing and ambient occlusion on PC, as well as \"ultra-plus\" settings on PC that introduce more details on background characters and environmental elements.\n\nFor PlayStation 5 and Xbox Series X|S, players can look forward to Performance and Quality modes that allow players to choose if they want to prioritize performance (higher frame rate) or quality (better visuals). Additionally, PS5 and Xbox Series X players will get ray-tracing, ambient occlusion, and other graphical features. These won't come to the less powerful Series S, but it does have 30fps and 60fps options to choose from.\nOn PS5, The Witcher 3 will use the DualSense controller's haptic feedback and adaptive triggers, so players will \"feel\" the action when they smack and enemy with a sword or perform magic. There will also be a new special mode where players can hold L2 and use face buttons to cast signs instead of needing to access the radial menu each time.\n\nContent inspired by Netflix's Witcher TV show is coming to The Witcher 3 as well, including swords based on what Henry Cavill wielded during Season 1 and Season 2. What's more, cross-progression is coming to The Witcher 3, so players can switch between platforms more easily going forward.\nThe new update arrives on December 14 alongside the Complete Edition, which includes the base game, all DLC, and the two major expansions: Hearts of Stone and Blood and Wine. At launch, the Complete Edition will be digital-only, but a physical version is coming later.", "link": "https://www.youtube.com/watch?v=Jbg7q107oLo", "date_published": "2022-11-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Witcher 3 Wild Hunt Next Gen Update Official Trailer", "description": "The free next-gen update for The Witcher 3: Wild Hunt is coming to PC, PlayStation 5 and Xbox Series S and X on December 14th, 2022! Experience the game as never before, with improved visuals and performance, new additional content, Photo Mode, and much more.\n\n#thewitcher3 #witcher #gaming", "link": "https://www.youtube.com/watch?v=py0a8QrFIsw", "date_published": "2022-11-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Witcher 3: Wild Hunt Next-Gen Update Full Presentation", "description": "Learn more about the upcoming The Witcher 3: Wild Hunt Next-Gen Update in the latest CD Projekt REDStream. We learn more about the various graphical upgrades, quest updates, new features and much more. The Witcher 3: Wild Hunt Next-Gen Update is free for those who own the game already and will be playable December 14th, 2022.\n\n#thewitcher3 #witcher #gaming \n\nTimestamps\n0:00 Intro\n1:20 Ray Tracing Discussion\n3:05 Photo-Mode\n4:15 New Camera Modes\n6:07 Next Gen Console Discussion\n7:30 Haptic Feedback and Adaptive Triggers (PS5)\n8:10 Quick Cast Feature\n10:30 Map Filters\n13:07 Environment and Character Adjustments\n16:34 Additional Modes and Features\n18:10 2 Quest Fixes and Changes\n19:55 Additional Languages\n23:36 Netflix DLC Quest\n28:04 The Witcher 3 Wild Hunt Next Gen Trailer", "link": "https://www.youtube.com/watch?v=HI3YX871G08", "date_published": "2022-11-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Invisible Player Glitch Is Ruining Warzone 2.0 | GameSpot News", "description": "Warzone 2.0 glitch makes players invisible, a Modern Warfare 2 player gets one year of double XP and Warzone 2.0 celebrates 25 million players.\n#GamingNews #Warzone2.0 #MW2\n\nAs spotted by PCGamesN, Warzone 2.0 players have encountered an issue that causes their opponents to appear totally invisible.\n\nThe glitch first became known to the community when streamer SuperEvan posted a gameplay clip to his Twitter account. That footage shows SuperEvan being downed and killed by an opponent who did not appear in his field of view, even though the killcam clearly shows that the attacker was standing directly in front of him. The replies to the streamer's tweet show a variety of examples of the glitch in action, suggesting that it may be commonplace.\nHowever, things aren’t all bad. A Call of Duty fan booted up Warzone 2.0 recently and discovered they had a very, very generous double XP boost applied to their account and they had no idea why.\nIn a now deleted post, Reddit user CranberryCarney asked the community, \"Can someone tell me how and why I have a 1 YEAR double xp???\"\nCommenters quickly replied that CranberryCarney was likely a winner of a Mountain Dew promotion that offered up 12 months of double XP in Call of Duty as a grand prize. Now, CranberryCarney doesn't get double XP for every minute of the next year. Instead, they get one hour's worth of double XP each day for 365 days after they activate the token, according to the fine print.\nAnd if you’re curious just how many other players Cranberry will be leveling up faster than, the official Call of Duty Twitter account revealed over 25 million players played War", "link": "https://www.youtube.com/watch?v=4KECRLSbIBY", "date_published": "2022-11-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Warhammer 40,000: Darktide Official Overview Trailer (4K)", "description": "Check out the overview trailer for Warhammer 40K Darktide. \n\nTimestamps\n0:59 Character Creation\n2:27 Missions\n3:37 Hybrid Combat\n4:39 Cooperative Play\n5:23 Progression\n6:26 Future Content\n\n#warhammer40k #Warhammer #Darktide", "link": "https://www.youtube.com/watch?v=m8q6917pmOo", "date_published": "2022-11-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]