[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Post Mortem (full documentary) | FRONTLINE", "description": "How errors by coroners and forensic pathologists have allowed potentially guilty perpetrators to go free and the innocent to be accused of crimes they did not commit. (Aired 2011)\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nPopular television shows have portrayed death investigators as high-tech sleuths wielding the most sophisticated tools of 21st century science. A 2011 investigation by FRONTLINE, ProPublica and NPR found a very different reality: A dysfunctional system with few standards and little oversight. In state after state, reporters found autopsies conducted by doctors who lacked certification and training, an increasing number of Americans going to the grave without being examined at all – and vulnerable people suffering most from the country’s system of death investigation. \n\nExplore additional reporting in connection with \"Post Mortem\" on our website:\nhttps://www.pbs.org/wgbh/pages/frontline/post-mortem/\n\n#Documentary #Autopsy #Death\n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nFRONTLINE is produced at GBH in Boston and is broadcast nationwide on PBS. Funding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; the Heising-Simons Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.\n\nCHAPTERS:\nPrologue - 00:00\nA Trail of Autopsies by an \"Incompetent\" Forensic Pathologist  - 1:43 \nThe Role of Coroners in Death Investigations  - 12:50 \nThe New Orleans Coroner and the Police - 17:30 \nA Call for National Standards for Death Investigations - 33:05 \nDeaths of Elderly People Are Among Least Likely to Be Investigated  - 37:11 \n“Autopsies Can Save Lives As Well As Solve Crimes”  - 43:09 \nCredits - 51:57", "link": "https://www.youtube.com/watch?v=mhuRGam7xG0", "date_published": "2022-11-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]