[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cat Behavior Expert Reacts To Stray", "description": "JoAnna Puzzo, a Feline Welfare Manager at Battersea Dogs and Cats Home, breaks down the various antics of the cats in Stray, including some of their behavioral traits, and of course, the odd moment of mischief.\n\n00:00 - Opening\n00:43 - Cat Colony Behavior\n02:47 - Cats knocking things off shelves\n02:59 - Defense mechanisms \n04:28 - Cats wearing clothes\n05:33 - Greeting behavior\n06:13 - Sleeping behavior\n06:53 - Cats walking on stuff they really shouldn’t be\n07:27 - Cat getting stuck in a paper bag\n08:08 - Injury behavior\n09:07 - Playful behavior\n09:52 - Cats tripping people up\n10:30 - JoAnna’s final thoughts\n\nIn the latest video in GameSpot’s Expert Reacts series, JoAnna Puzzo--a Feline Welfare Manager at Battersea Dogs and Cats Home--breaks down the feline antics of the Stray.\n\nSupport Battersea Cats And Dogs Home: www.battersea.org.uk/support-us\n\nPet Advice: /www.battersea.org.uk/pet-advice\n\nBattersea Twitter: twitter.com/battersea_\n\nBattersea Instagram: www.instagram.com/battersea/\n\nMeet Kipp: www.battersea.org.uk/cats/kipp", "link": "https://www.youtube.com/watch?v=sgvC854IeN0", "date_published": "2022-07-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "11 Biggest Game Releases For August 2022", "description": "August is upon us, which means the summer is starting to wind down. But that doesn’t mean that game releases are slowing down! Here is a list of the biggest games releasing in August 2022.\n#Gaming #SaintsRow #MaddenNFL23 \n\nFootball is back and has once again managed to improve on last year’s game.\n\nPerhaps the biggest new feature in Madden NFL 23 is the \"Fieldsense\" system that EA promises will deliver \"more control at all positions in every mode.\" EA said this new system will help deliver \"ultra-realistic gameplay,\" including new animations and player control mechanics.\n\nMadden NFL 23 also updates Face of the Franchise with a new experience called The League. There will be new position-specific mechanics and player-focused cameras. Franchise mode, meanwhile, will offer \"simplified\" team-building mechanics.\n\nIn terms of visuals, Madden NFL 23 aims to offer a \"new level of visual realism\" in all stages of the football experience. There will be new \"player-locked, 4K touchdown cameras\" that aim to match what the latest NFL TV broadcasts offer.\n\nYou can continue to secretly pretend you’re Tom Brady when Madden NFL 23 drops on August 19 for PC and every console except Switch.\n\nSoul Hackers 2 is the follow-up to Demon Summoner: Soul Hackers, itself a sci-fi spin-off in the Shin Megami Tensei franchise.\n\nSet in the same world as Soul Hackers without continuing that tale, you play as Ringo, a character created by a sentient artificial intelligence and dispatched to stop some coming event from ending the world. With Soul Hackers 2, you're dealing with a group of characters who are older, rather than those making their way through high school. But this is also a supernatural sci-fi RPG, so expect some fantastical elements; for instance, there are demons, and you summon them.\n\nAccording to Atlus, while the first Soul Hackers had a pretty hardcore RPG bend that might have turned off some players, the sequel is looking to be a little more welcoming, while also seemingly borrowing a lot of what works from recent successes like Persona 5 to present a new story.\n\nYou can summon some demons when Soul Hackers 2 comes to PC and every console except Switch on August 25.\n\nSo which of these games are you most interested in? Are there any that you can’t wait to play that didn’t make the list? Let us know in the comments and stay tuned to GameSpot for more.\n\nTimestamps:\n00:00 - Intro\n00:11 - Saints Row\n01:01 - Cult of the Lamb\n01:39 - Madden 23\n02:39 - Turbo Golf Racing\n03:18 - Two Point Campus\n03:52 - Rumbleverse\n04:35 - Marvel’s Spider-Man\n05:07 - Rollerdrome\n05:54 - Midnight Fight Express\n06:38 - F1 Manager 2022\n07:05 - Soul Hackers 2", "link": "https://www.youtube.com/watch?v=0jjrwwkFc40", "date_published": "2022-07-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Killing Floor 2’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Killing Floor 2, including the unique ‘Doshinegun’, a ‘Tommy Gun In Space’, and a lever action shotgun combined with a magic axe blade for good measure.\n\n00:00 - Opening\n00:44 - AA-12\n01:24 - HRG Tommy Boom\n02:21 - AF 2011-A1\n03:34 - Dual-wielded AF 2011-A1\n04:29 - Pulverizer\n06:17 - Doomstick\n08:22 - Glock 18C\n10:31 - Frostfang\n12:04 - Mosin Nagant M91/30 with bayonet\n14:50 - Helios Rifle Microwave Gun\n16:03 - Spitfire\n18:20 - Doshinegun\n20:08 - HMTech-501 Grenade Rifle\n22:10 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Killing Floor 2 and compares them to their potential real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nRoyal Armouries' Boarding Axe Carbine Video - https://www.youtube.com/watch?v=s7GnbhiNUbk&t=50s\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=3utFiYkMFJg", "date_published": "2022-07-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Toughest Decisions In Games | GameSpot After Dark Episode 155", "description": "This week on After Dark, the crew welcomes our newest hire Stuart to the team! We also discuss Xenoblade Chronicles 3, Bear and Breakfast, the new Sims 4 update that has broken the game, and some of the toughest decisions we've had to make in a video game.\n\n0:00:00 - Welcome To The Team Stuart!\n0:13:03 - Xenoblade Chronicles 3\n0:22:27 - One Piece\n0:33:23 - Bear and Breakfast\n0:35:24 - Sims 4 Update Breaks The Game\n0:45:50 - The Queen's Ball - A Bridgerton Experience\n0:59:05 - Nanaca Crash\n1:08:51 - The Toughest Decisions In Games For Us\n\n#gaming #masseffect #gamespotafterdark", "link": "https://www.youtube.com/watch?v=X--dM6X2qYU", "date_published": "2022-07-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]