[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "ADG7: Tiny Desk Concert", "description": "Bob Boilen | August 19, 2022\nHow do you fit a gayageum and an ajaeng behind the Tiny Desk? That’s the question I whispered into the ear of our Tiny Desk audio engineer, Josh Rogosin, when we first saw ADG7 playing those five-foot long string instruments at globalFEST in New York City at the top of 2020. The Tiny Desk team solved the puzzle and the nine-piece Korean band filled the room with joy and a sound that’s unique in Tiny Desk history. ADG7 mixes traditional, shamanistic ritual sounds with Korean folk songs from Hwanghae Province. The group’s full name is Ak Dan Gwang Chil: “Ak Dan” translates as band, while “Gwang Chil” is in honor of the band having formed during the 70th anniversary of Gwangbokjeol, the National Liberation Day of Korea. The music is from the band’s 2020 album, Such is Life, and its self-titled 2017 album.\n\nThe three singers, Hong Ok, Myeong Wol and Yoo Wol, immediately capture my eyes and ears but my attention begins to sway toward Lee Man Wol, who appears to be blowing into a pipe organ she holds in her hands. The instrument is a saenghwang, just one of ADG7’s transfixing instruments — including brilliant percussion and a large bamboo flute known as a daegeum played by bandleader Kim Yak Dae — that make this enthusiastic and adventurous concert an eye-opener. \n\nSET LIST\n“Whatever”  \n“Yeong Jeong Geo Ri” \n“Hee Hee”\n\nMUSICIANS\nHong Ok: vocals\nMyeong Wol: vocals\nYoo Wol: vocals\nWeon Meondongmaru: gayageum\nChoi Byung Hwal: ajaeng\nChun Gung Dal: percussion\nSunwoo Barabarabarabam: percussion\nLee Man Wol: piri, saenghwang, taepyeongso\nKim Yak Dae: daegeum\n\n\nTINY DESK TEAM\nProducer/Series Creator: Bob Boilen \nAudio Engineer: Josh Rogosin \nDirector: Kara Frame \nSeries Producer: Bobby Carter \nEditor: Joshua Bryant\nVideographers: Kara Frame, Michael Zamora, Pierre Kattar, Joshua Bryant\nAudio Assistant: Andie Huether\nProduction Assistants: Jill Britton, Alanté Serene, Joby Tanseco\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #ADG7", "link": "https://www.youtube.com/watch?v=sdaOtnuw-Ew", "date_published": "2022-08-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]