[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Minutes of LEGO Star Wars: The Skywalker Saga Gameplay", "description": "Check out new gameplay from  LEGO Star Wars: The Skywalker Saga from Episode VIII The Last Jedi. In this gameplay clip Rey makes her way to find Kylo Ren to stop him from continuing down the path of the Dark Side. \n\nKylo Ren takes her to Supreme Leader Snoke, and Snoke tells Kylo his apprentice to fulfill his destiny as the son of darkness, heir apparent to Lord Vader.\n\nWatch as Kylo and Rey take on the Snokes elite Praetorian guards.\n\n#LEGOStarWars #SkywalkerSaga", "link": "https://www.youtube.com/watch?v=xGyT5dRpmww", "date_published": "2022-04-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Forge Delay Explained, Campaign Co-op Still Missing | GameSpot News", "description": "343 Industries share new details about Halo Infinite Season 2: Lone Wolves and explain the lengthy delay or Forge. \n#GamingNews #Halo #HaloInfinite\n\nIn the new season, which launches May 3, 343 is adding new maps: Catalyst and Breaker. The new season will also feature multiplayer announcer Jeff Steitzer's voice for medals that players earn. The existing multiplayer announcer will remain in place for everything else.\n\nDeveloper 343 Industries has now explained the delay of Forge a little more. In a blog post the dev said, \"It broke our hearts to not be able to launch Forge alongside the rest of Infinite but to ensure it meets the bar we're setting for it to achieve, this massive overhaul to Forge in Infinite just wasn't able to make it out before the end of last year”.\n\nA sequel to Secret of Monkey Island and Monkey Island 2: LeChuck's Revenge is coming this year. 31 years after LeChuck's Revenge launched in 1991 comes Return to Monkey Island, and director Ron Gilbert is returning for the long-awaited game.\n\nSTAMPS\n00:00 - Intro\n00:06 - Halo Infinite\n03:01 - Return To Monkey Island", "link": "https://www.youtube.com/watch?v=yU4KZXQdcAw", "date_published": "2022-04-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "LEGO Star Wars: The Skywalker Saga - Everything To Know", "description": "Here is everything you need to know about the latest Lego Star Wars game.\n\nThe original Lego Star Wars is the granddaddy of the Lego video game empire, a cute and hilarious take on the prequel trilogy, who's success spawned dozens of licensed Lego games. Now we’re returning to a galaxy far far away with Lego Star Wars: The Skywalker saga, a massive collection that takes you through all nine core Star Wars movies, including the final two films in the sequel trilogy, which haven’t been Lego-fied yet. But even though we are returning to films already covered before, don’t expect a simple retread of the previous games. The Skywalker Sega is built from the ground up and makes changes to the traditional Lego formula to stand out.\n\nTimestamps:\n00:00 - Intro\n00:53 - Plot & Setting\n02:40 - Gameplay\n05:12 - DLC\n06:18 - Platforms", "link": "https://www.youtube.com/watch?v=2YMWIuZ1waQ", "date_published": "2022-04-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]