[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Essential Voices USA: Tiny Desk Concert", "description": "Tom Huizenga | July 1, 2022\nWith all the crazy politics and a stubborn pandemic dragging on, it’s easy to be pessimistic about America this Fourth of July. But this Tiny Desk performance — happily back in our NPR Music office — will help turn dark skies to blue and remind us of the best and brightest version of our country. \n \nThis video marks the world premiere performance of excerpts of Washington Women, uplifting songs built on speeches and writings by amazing women — First Ladies, Secretaries of State, Senators and Supreme Court Justices — who had strong visions of what America should be.\n \nThe project is the brainchild of intrepid choral conductor and composer Judith Clurman, who directs the meticulously fine-tuned Essential Voices USA, a New York-based choir. While the songs have their own musical personalities, they also contain iconic political personalities. Hillary Rodham Clinton states, “Human rights are women’s rights, and women’s rights are human rights once and for all,” while Shirley Chisholm, the first Black congresswoman, declares that laws can be used to compel “the insensitive majority to reexamine its unconscious attitudes.” Betty Ford speaks of “the search for human freedom,” and Vice President Kamala Harris talks about the importance of dreaming big.\n \nClurman says she wrote the piece (along with Broadway arranger David Chase) not just for professional choruses to sing. She hopes that high school choirs will pick it up as well so that young people across the country will know how influential these women were and are, in making America a brighter, better place. \n\nSET LIST\n“The Essence of America” (text by Condoleezza Rice)\n“For Centuries Now” (text by Elena Kagan)\n“Freedom” (text by Eleanor Roosevelt, Hillary Rodham Clinton, Betty Ford)\n“In the Field of Equal Rights” (text by Shirley Chisholm)\n“Remember the Ladies” (text by Abigail Adams)\n“We Not Only Dream” (text by Kamala Harris, Nancy Pelosi)\n\nMUSICIANS\nMusic by Judith Clurman and David Chase\nJudith Clurman: director\nEssential Voices USA Choir:\nPaul D’Arcy\nChloe Holgate\nAmy Justman\nHelen Karloski\nEnrico Lagasca\nSteven Moore\nHeather Petrie\nJamet Pittman\nGregory Purnhagen\nElisa Singer Strom\nJason Weisinger\n\nTedd Firth: piano\nRaman Ramakrishnan: cello\n\nTINY DESK TEAM\nProducer: Tom Huizenga\nAudio Recording & Mix Engineer: Josh Rogosin\nDirector: Kara Frame\nSeries Creator: Bob Boilen\nSeries: Producer: Bobby Carter\nEditor: Joshua Bryant\nVideographers: Kara Frame, Joshua Bryant, Michael Zamora, Pierre Kattar, \nProduction Assistant: Ashley Pointer\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Jill Britton, Joby Tanseco, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\nSpecial Thanks: Yamaha Artist Services, New York, Jordan Kitt's Music\n\n#tinydesk #nprmusic #EssentialVoicesUSA", "link": "https://www.youtube.com/watch?v=D3XZg82Z52A", "date_published": "2022-07-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]