[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "I bought THIS LAPTOP: Tuxedo Stellaris 15 Gen 4 Review", "description": "Grab a brand new laptop or desktop running Linux:https://www.tuxedocomputers.com/\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMastodon: https://mastodon.social/web/@thelinuxEXP\n\nPixelfed: https://pixelfed.social/TLENick\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\nThis video is distributed under the Creative Commons Share Alike license.\n\n#tuxedo #linux #laptop \n\n00:00 Intro\n01:03 Build Quality\n02:56 Display\n03:58 Webcam and Mic\n04:48 Keyboard and Touchpad\n06:39 Speakers\n07:03 I/O\n08:52 Performance and Benchmarks\n11:51 Battery Life\n12:51 Software Experience\n16:10 Why did I buy it?\n17:48 Support the channel\n\nRe-enable sound on newer intel chips: \nsystemctl --user --now enable pipewire pipewire-pulse\n\nAdd the TearFree Option for screen tearing:\n\nEdit or create this file: /etc/X11/xorg.conf.d/20-intel.conf\n\nAdd these lines:\n\nSection \"Device\"\n  Identifier \"Intel Graphics\"\n  Driver \"intel\"\n  Option \"TearFree\" \"true\"\nEndSection\n\n\nIt's made of matte black aluminium, with the backplate being made out of plastic. It's 15.6 inches, and it's 2.6cm thick, at a total weight of 2.2kg.\n\nThe chassis is super rigid without any hint of deck flex. You can of course open up the device very easily with a few screws, and upgrade the RAM and the storage.\n\nThe display is a 1440p screen, at 2560 by 1440, with a 16:9 ratio. It's a 240hz refresh rate panel, anti-reflective, at 350 nits, and supports 95% of SRGB.\n\nOn top of the display, you get a decent webcam, a 1080p one. The microphone is decent.\n\nOn to the keyboard. It's the best keyboard I ever used on a laptop.\n\nThe touchpad is nice, if not incredible. It's smooth, and feels good for gestures, but it's a bit small for this size of laptop.\n\nOn to the speakers, and they're decent. Finally, the I/O. On the left side, you get a full size USB 3.2 Gen 2 port, a mic jack and an audio jack, plus that kensington lock. On the right, you have a full size SD card reader, and 2x USB-A 3.2 Gen1. Finally, on the back, you have a thunderbolt 4 port, an HDMI 2.1 port, a gigabit ethernet jack, and the barrel charger.\n\nThe i7 12700H is a monster. It's a 14 core, 20 threads CPU, which goes up to 4.68ghz. On Geekbench 5, it scores 1815 in single core, and 11588 in multi core. It's the most powerful CPU I own, out of all my devices, including my desktop ryzen 7 5800H.\n\nIn terms of battery life, of course, it will depend on what you do. Using only the intel graphics card, with a typical workload for me of writing on Nextcloud notes inside of Firefox, listening to music, with wifi on, bluetooth on for my mouse, headphones, and mid brightness, the laptop got up to 7h of use, thanks to the 93 Wh battery.\n\nWhen using the nvidia dGPU for gaming, though, if you let it run as fast as it can, you can expect something more along the lines of 3 to 4 hours. Video editing lasted about 4 and a half hours for me.", "link": "https://www.youtube.com/watch?v=8eRsbv-rsU8", "date_published": "2022-06-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]