[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Boston gain of function virus", "description": "Please share this video, this research must STOP. Gain of function research in the USA today using enhanced potential pandemic pathogen (ePPP) research\n\nProfessor Shmuel Shapira, lead scientist, Israeli Government\n\nhttps://www.dailymail.co.uk/health/article-11323677/Outrage-Boston-University-CREATES-Covid-strain-80-kill-rate.html\n\nThis should be totally forbidden, it's playing with fire\n\nDr Richard Ebright, Rutgers University, New Brunswick\n\nThe research is a clear example of gain of function research.\n\nIf we are to avoid a next lab-generated pandemic, \n\nit is imperative that oversight of enhanced potential pandemic pathogen research be strengthened.\n\nit is imperative that officials at US-government agencies,\n\nwho repeatedly have placed the public at risk by repeatedly violating the existing policies be held accountable\n\nProf David Livermore, microbiology, University of East Anglia\n\ngiven the strong likelihood that the Covid pandemic originated from the escape of a lab-manipulated coronavirus in Wuhan, \n\nthese experiments seem profoundly unwise\n\nBoston University's National Emerging Infectious Diseases Laboratories is one of 13 biosafety level 4 labs in the US\n\nRole of spike in the pathogenic and antigenic behavior of SARS-CoV-2 BA.1 Omicron\n\n14th October 2022\n\nBoston University School of Medicine\n\nhttps://www.biorxiv.org/content/10.1101/2022.10.13.512134v1\n\nPredominant SARS-CoV-2 Omicron variant (BA.1) is highly transmissible, \n\neven in fully vaccinated individuals, \n\nand causes attenuated disease compared with other major viral variants recognized to date\n\nThe Omicron spike (S) protein, unusually large number of mutations, \n\nis considered the major driver of these phenotypes\n\nWe generated chimeric recombinant SARS-CoV-2\n\nA chimera or chimeric virus\n\nOne virus containing genetic material derived from two or more distinct viruses\n\nUS Center for Veterinary Biologics\n\nhttps://www.aphis.usda.gov/animal_health/vet_biologics/publications/notice_05_23.pdf\n\nA new hybrid microorganism,\n\ncreated by joining nucleic acid fragments from two or more different microorganisms,\n\nin which each of at least two of the fragments,\n\ncontain essential genes necessary for replication \n\nWe generated chimeric recombinant SARS-CoV-2\n\nEncoding the S gene of Omicron in the backbone of an ancestral SARS-CoV-2 isolate,\n\nand compared this virus with the naturally circulating Omicron variant. \n\nThe Omicron S-bearing virus robustly escapes vaccine-induced humoral immunity, \n\nmainly due to mutations in the receptor-binding motif,\n\nyet unlike naturally occurring Omicron, \n\nefficiently replicates in cell lines and primary-like distal lung cells. \n\nIn K18-hACE2 mice\n\nhttps://www.jax.org/strain/034860\n\nK18-hACE2 transgenic mice express human ACE2, \n\nincluding airway epithelia where infections typically begin. \n\nBecause K18-hACE2 are susceptible to SARS-CoV-2 and SARS-CoV viruses, they are useful for studying antiviral therapies to COVID-19 and SARS.\n\nIn K18-hACE2 mice\n\nOmicron causes mild, non-fatal infection, \n\nthe Omicron S-carrying virus inflicts severe disease with a mortality rate of 80%. \n\nThis indicates that while the vaccine escape of Omicron is defined by mutations in S, \n\nmajor determinants of viral pathogenicity reside outside of S.\n\nFrankenstein, Mary Shelley, 1818\n\nFrightful must it be; for supremely frightful would be the effect of any human endeavour to mock the stupendous mechanism of the Creator of the world (1831 edition)", "link": "https://www.youtube.com/watch?v=_WTZo9ieBKY", "date_published": "2022-10-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]