[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War Ragnarok: The Mythology Behind Thor", "description": "God of War Ragnarök will soon give us the showdown to end all showdowns: the Norse Gods will finally face their final battle, with Kratos and Atreus in the mix for good measure. \n\nThe god of thunder himself, Thor, is one of the major players in Norse mythology, and will butt heads with Kratos in Sony Santa Monica’s latest. So, let’s become the Gods of Lore as we take a look at how Thor initially appeared in Norse Mythology, discuss how that compares to what we already know about the thunder god in the game, and what that might mean for his ultimate fate as the end times, Ragnarok itself, thunders closer.", "link": "https://www.youtube.com/watch?v=oLnrTfNaiWU", "date_published": "2022-10-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "SAS Soldier Breaks Down CoD Modern Warfare SAS Missions | Expert Reacts", "description": "Mark \"Billy\" Billingham served in the British SAS for over 17 years. He was responsible for planning and executing strategic operations across the world, and has led countless hostage rescues.\n\nSince leaving the military he has worked as both a celebrity bodyguard, appears on Channel 4's \"SAS: Who Dares Wins\", \"SAS Australia\", and has just released his latest book \"Survive To Fight\".\n\nToday he's joining us once again to break down and react to some of the most iconic missions from the Call of Duty franchise, including CoD 4, Modern Warfare 2, and Modern Warfare 2019\n\nYou can find more of Billy Billingham as well as his book here: \nFacebook: www.facebook.com/MarkBillinghamSAS \nTwitter: https://twitter.com/billingham229b\nInstagram: https://www.instagram.com/billingham22b \nTikTok: https://www.tiktok.com/@billy_billingham \nWebsite: https://www.markbillybillingham.com/ \n\nBilly's new book (UK): https://cnet.co/3ANEl6O \nBilly's new book (US): https://cnet.co/3R8rdOT", "link": "https://www.youtube.com/watch?v=4n1p_CGH6ng", "date_published": "2022-10-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Silent Hill 2 Remake - What Can We Expect From Bloober Team? | MindGames", "description": "Ever since the release of Layers of Fear, Bloober's games have been obsessed with getting you inside the damaged minds of their characters–sometimes literally. However, their games have also attracted criticism for their sometimes troubling messaging around trauma and mental health.\n\nWe spoke to Mateusz Lenart, Lead Director of the upcoming Silent Hill 2 Remake, about the origins of Layers of Fear, Bloober's horror philosophy, and how they hope to make psychological horror games that get inside the player's head too.\n\n#mindgames #silenthill2 #blooberteam #gamespot", "link": "https://www.youtube.com/watch?v=SXz4MwOMmB0", "date_published": "2022-10-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call Of Duty: Modern Warfare 2 Campaign Review", "description": "Modern Warfare 2 had big shoes to fill, but the campaign includes a large serving of nostalgia and a fun variety of missions making it a worthy rebooted sequel.\n\n#callofduty #cod #gaming", "link": "https://www.youtube.com/watch?v=ZaNYqkXd0JY", "date_published": "2022-10-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Call of Duty: Warzone’s Guns PART 2", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down more of the weaponry of Call of Duty: Warzone, including the hideous Burger Town Classic, the knife/pistol hybrid, the Valois Revolver, and a disgusting pink-hued P90.\n\n00:00 - Opening\n00:39 - AN-94\n02:38 - Armaguerra 43\n04:16 - Cooper Carbine\n05:22 - LW3 - Tundra\n06:45 - Casanova\n07:53 - Gorenko Anti-Tank Rifle\n09:15 - Itra Burst\n10:52 - C58\n12:05 - EX1 Laser Gun\n13:13 - Burger Town Classic\n14:37 - FFAR 1\n15:43 - FN Scar 17\n17:24 - Valois Revolver\n18:26 - Whitley\n18:21 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Call of Duty: Warzone and compares them to their real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=WpO3wsLExcg", "date_published": "2022-10-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mario + Rabbids: Sparks of Hope Review", "description": "Mario + Rabbids: Sparks of Hope is an improvement over its predecessor in every way, and one of the best modern Mario spin-offs.", "link": "https://www.youtube.com/watch?v=LUmpw_Pfj9g", "date_published": "2022-10-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]