[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Arma Reforger Early Access - The Good And Bad", "description": "On the road to Arma 4, Arma Reforger is a standalone early access game looking to hook a new generation of Arma players as it goes into Early Access on PC and Xbox. \n\nArma Reforger by Bohemia Interactive is a standalone Arma game going into Early Access while Arma 4 is in development. Reforger is intended to get the mil-sim community involved in testing out the new Enfusion engine, modding the game, coming up with fun combat scenarios, and fighting player vs. player. Reforger has two main multiplayer modes: Conflict, which sees two teams fighting over capture points, and Game Master, which lets players engage in and edit scenarios in real-time. The game also includes a Workshop that allows players to expand and modify the game. Mods can be used on both PC and, for the first time Xbox. Keep in mind the Arma Mod Day Z eventually led to PUBG and the modern battle royale craze. \n\nArma Reforger takes place in a large open world on the island of Everon, set in the 1980s. The island’s design is inspired by the former state of Czechoslovakia. You’ll see a lot of classic ’80s guns in the game, like the M16A2, M21 SWS, and M72A3 Law. The game builds off the Arma series roots that started in 2001 with Arma: Cold War Assault and helped define the military simulation genre. \n\nArma Reforger is part of the road to Arma 4 and is out now in Early Access for PC and Xbox.\n\n#Arma4 #ArmaReforger #Gaming", "link": "https://www.youtube.com/watch?v=lYxuD7h2498", "date_published": "2022-05-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 Fan Project In Unreal 5 Looks Amazing | GameSpot News", "description": "Cyberpunk 2077 is recreated in Unreal Engine 5, GTA+ is off to a great start and Elden Ring's Malenia battles all other bosses thanks to a new mod. \n#GamingNews #Cyberpunk2077 #EldenRing\n\nImagining the NEXT Cyberpunk 2077 - https://youtu.be/jOwNE60bbfU\nELDEN RING: Malenia VS All Bosses - https://youtu.be/pz7Rpce2cRc \n\nYouTuber and developer Enfant Terrible, alside a number of other artists, put together a reimaging of Cyberpunk 2077's Night City within Epic's software. The artists used environment megapacks from the Epic Marketplace to recreate Night City and populated it with characters from Epic's the MetaHumans Creator.\n\nBack in March 2022, Take-Two Interactive rolled out GTA+, an optional paid subscription service for GTA Online. The initial announcement was met with some mixed reactions from fans, but according to Take-Two, the service is apparently doing well. In a recent earnings call for the fiscal period that ended on March 31, CEO Strauss Zelnick said the company is \"thrilled\" with the number of players who've signed up for GTA+\n\nSoulsborne content creator Garden of Eyes has created a mod that pits the game's various bosses against one another, and it's clear in a new video from the creator that Malenia is a cut above the rest.\n\nSTAMPS\n00:00 - Intro\n00:07 - Cyberpunk 2077\n01:00 - GTA Online\n01:59 - Elden Ring", "link": "https://www.youtube.com/watch?v=PzrJg2CFEIY", "date_published": "2022-05-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New PlayStation Plus Games Revealed And Classic Games Confirmed So Far | GameSpot News", "description": "Sony reveals a list of games for new PlayStation Plus, Ubisoft+ is confirmed for PlayStation Plus, and MultiVersus reveals news characters and an open beta. \n#GamingNews #PS5 #PlayStationPlus\n\nToday Sony confirmed a list of games that will be available as part of its overhauled PS Plus subscription service, which includes a selection of PS4 and PS5 titles for the PS Plus Extra and Premium tiers. Classic games from the original PlayStation and PSP will also be made available through a smaller library, which also includes a mix of first and third-party games. Ape Escape, Syphon Filter, and Wild Arms 3 are just some of the games joining the list, alongside Tekken 2 and several more. \n\nUbisoft+ Classics is being bundled into the PS Plus Extra and Premium tiers. Ubisoft+ Classics will launch with 27 curated games on June 13 in the US. The standard version of Ubisoft+ will be added to PlayStation at a later date.\n\nA new trailer for MultiVersus shows off new characters like Iron Giant and Taz as well as confirming an open beta coming in July 2022.\n\nSTAMPS\n00:00 - Intro\n00:05 - PlayStation Plus\n01:51 - Ubisoft Plus\n02:38 - MultiVersus", "link": "https://www.youtube.com/watch?v=1jfZJEqj-Vs", "date_published": "2022-05-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Toughest Game Achievements That Aren't Worth The Stress", "description": "Whether you're hunting for achievements on an Xbox console or pursuing that elusive platinum trophy on a PlayStation, there's something endlessly satisfying about a digital high-five when you nail a feat within a game. Here are the 20 toughest ones to get.\n\n#Gaming #GameSpot #AchievementHunting #TrophyHunting\n\n00:00 Intro\n00:27 Call of Duty 4: Modern Warfare\n00:57 Dead Rising\n01:29 Dead Space 2\n01:51 The Evil Within\n02:12 Gears 5\n02:45 GTA 5\n03:14 Half-Life 2\n03:58 Halo: The Master Chief Collection\n04:24 Limbo\n04:51 Max Payne 3\n05:12 Mega Man 10\n05:40 MGS4\n06:09 Mortal Kombat (2011)\n06:33 Outlast 2\n06:53 Ori and the Will of the Wisps\n07:18 Overwatch\n07:47 Rock Band 2\n08:10 Sniper Elite 4\n08:39 The Stanley Parable\n08:56 Wolfenstein 2: The New Colossus", "link": "https://www.youtube.com/watch?v=2yLafmktRo4", "date_published": "2022-05-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]