[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Fontaines D.C.: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nAnn Powers | May 17, 2022\nFilmed in Chicago’s beautiful brick Irish American Heritage Center during a recent tour, this four-song set begins with Fontaines D.C. singer Grian Chatten in the stacks at the center’s library, playing a button accordion and singing the mordant ballad “The Couple Across the Way” as cellist Maureen Dunne and violist Isaac Henry accompany him. An emotional touchstone on the band’s latest album, \"Skinty Fia,\" it’s a taste of an unfinished Fontaines project: the Irish group originally planned to release a double set with half traditionally-styled tunes and half the searing, atmospheric post-punk that makes this third LP the band’s best.\n\nBut we won’t stay here in the quiet, unsettled heart. Chatten ambles over to the library’s open area, where the band is set up alongside members of the Northwestern University Choir to perform “In ár gCroíthe go deo.” The eerie blend of the choir’s harmonies and the band’s droning, building rhythms moves this music from storytelling to poetry. The song is a keen: an Irish lament for a dead woman whose family wanted the song’s title phrase inscribed on her grave but were thwarted when officials in their English hometown demanded a translation. “Gone is the night, gone is the day,” Chatten sings through gritted teeth as the choir and his bandmates chant those lost Irish words. Another library corner offers a dynamic shift, as Carlos O’Connell leads the tender, drifting “Big Shot” with delicate keyboard. Then it’s back to the noise with “Nabokov” — the perfect tune for tearing up an archive — and a final surprise sends the set into happy chaos.\n\n\nSET LIST\n“The Couple Across The Way”\n“In ár gCroíthe go deo” \n“Big Shot” \n“Nabokov” \n\n\nMUSICIANS\nGrian Chatten: vocals, accordion\nCarlos O'Connell: guitar, keyboard\nConor Curley: guitar, backing vocals\nConor Deegan III: bass guitar, backing vocals\nTom Coll: drums\nMaureen Dunne: cello\nIsaac Henry: viola\n\nChoir:\nTom Avery\nJoe Blanchard\nEmily Ann Brooks\nPeter Carroll\nMartina Cavard Blanco\nMariana Leone\nMaddie Mazzella\nEmily Somé\nJackson Owen\nOlivia Whitmer\n\n\nCREDITS\nProduced and Directed by Jamie Fleischel and Josh Modell\nCameras by Corey Lillard, Matt Carroll, John Sedivy\nRecorded by Chris Butterworth\nMonitors by Mat Acreman\nAudio mixed by Dan and Orla Carey\nString arrangements by Violeta Vicci\nVocal Consultant: Melissa Foster\nThank you to the Irish American Heritage Center in Chicago\n\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Joshua Bryant, Michael Zamora, Maia Stern, Ashley Pointer\nVP, NPR Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n\n#NPRMusic #TinyDesk #FontainesDC", "link": "https://www.youtube.com/watch?v=mgMwGBtt4rE", "date_published": "2022-05-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Leikeli47 Wants You to Look and Listen Deeper", "description": "In an industry that places high premium on aesthetics, Leikeli47 has always challenged her listeners to look and listen deeper than what's on the surface. Four years — and a whole pandemic — removed from the rapper's last release, Leikeli47's 'Shape Up' marks the third and final installment of what 47 has anointed the Beauty Series trilogy. This latest LP builds on the messages of 2017's 'Wash & Set' and 2018's 'Acrylic': beauty as self care, self care as communal work and the genuine, intrinsic growth required for both.\n\nWhere 'Wash & Set' marked her introduction and 'Acrylic' walked into the safe space of a salon, 'Shape Up' walks out of that metaphorical salon feeling brand new. \"Hence, the closure,\" she tells NPR. \"I'm leaving the shop and I have just what I want.\"\n\nSitting in a Brooklyn studio wearing a black Celine tracksuit with matching mask, gold chains and elaborate orange eyeliner, 47 simultaneously looks cozy and coiffed. The MC broke down some essential tracks off the project for this exclusive Listening Party interview on NPR Music's YouTube channel. \"Zoom\" makes comedic fodder out of a real life confrontation. \"BITM\" is a soundtrack to the fiercest of walks, whether at a vogue ball or in aisle 5 at the grocery store. \"Hold My Hand\" is a letter to God for never leaving her side. \"Carry Anne\" creeps, then bellows with a desperately needed feminist call for 2022's misogynistic masses in and outside of the music industry.\n\nTogether, 'Shape Up' tracks 47's learning process to embody the confidence she so often preaches onstage to others. \"'Shape Up' came and said, 'You know that girl that you thought you was? Now you really her now.' 'Shape Up' is the confidence I've been praying for,\" 47 says. \"Like my mask, it became my best friend. I lived with it for four [years] ... We tugged, we pulled, but it was a confident pull. It was a different sort of pull from the 'Wash & Set' and 'Acrylic' eras, I really stood on mines with this.\"\n\nThe way she sees it, this album is for the sure as much as the unsure. \"Even if you're sitting on your hands, you feeling a little lazy about it. It's not what it looks like,\" she declares. \"Read those books. Get up. Meditate. Pray. Reverse your thinking. The same way you thought you couldn't is the same way you know you can.\"\n\nWatch Leikeli47's Tiny Desk https://www.youtube.com/watch?v=AB-S8wL-AKY \n\nCREDITS\n\nHost:\nSidney Madden\n\nProducers:\nTaylor Jennings-Brown\nLars Gotrich\nKara Frame\n\nEditor:\nAlanté Millow\n\nVideographers:\nKara Frame\nAnnabel Edwards\n\nAudio Recording Engineer\nNeal Rauch\n\nAudio Mix Engineer\nJosh Rogosin\n\nSenior Producer, Louder Than A Riot:\nGabby Bulgarelli\n\nVP, NPR Music:\nKeith Jenkins\n\nSenior VP, Programming:\nAnya Grundmann", "link": "https://www.youtube.com/watch?v=y51Av743JEs", "date_published": "2022-05-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]