[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCHnyfMqiRRG1u-2MsSQLbXA", "title": "Future Computers Will Be Radically Different (Analog Computing)", "description": "Visit https://brilliant.org/Veritasium/ to get started learning STEM for free, and the first 200 people will get 20% off their annual premium subscription. Digital computers have served us well for decades, but the rise of artificial intelligence demands a totally new kind of computer: analog.\n\nThanks to Mike Henry and everyone at Mythic for the analog computing tour! https://www.mythic-ai.com/\nThanks to Dr. Bernd Ulmann, who created The Analog Thing and taught us how to use it. https://the-analog-thing.org\nMoore’s Law was filmed at the Computer History Museum in Mountain View, CA.\nWelch Labs’ ALVINN video: https://www.youtube.com/watch?v=H0igiP6Hg1k\n\n▀▀▀\nReferences:\nCrevier, D. (1993). AI: The Tumultuous History Of The Search For Artificial Intelligence. Basic Books. – https://ve42.co/Crevier1993\nValiant, L. (2013). Probably Approximately Correct. HarperCollins. – https://ve42.co/Valiant2013\nRosenblatt, F. (1958). The Perceptron: A Probabilistic Model for Information Storage and Organization in the Brain. Psychological Review, 65(6), 386-408. – https://ve42.co/Rosenblatt1958\nNEW NAVY DEVICE LEARNS BY DOING; Psychologist Shows Embryo of Computer Designed to Read and Grow Wiser (1958). The New York Times, p. 25. – https://ve42.co/NYT1958\nMason, H., Stewart, D., and Gill, B. (1958). Rival. The New Yorker, p. 45. – https://ve42.co/Mason1958\nAlvinn driving NavLab footage – https://ve42.co/NavLab\nPomerleau, D. (1989). ALVINN: An Autonomous Land Vehicle In a Neural Network. NeurIPS, (2)1, 305-313. – https://ve42.co/Pomerleau1989\nImageNet website – https://ve42.co/ImageNet\nRussakovsky, O., Deng, J. et al. (2015). ImageNet Large Scale Visual Recognition Challenge. – https://ve42.co/ImageNetChallenge\nAlexNet Paper: Krizhevsky, A., Sutskever, I., Hinton, G. (2012). ImageNet Classification with Deep Convolutional Neural Networks. NeurIPS, (25)1, 1097-1105. – https://ve42.co/AlexNet\nKarpathy, A. (2014). Blog post: What I learned from competing against a ConvNet on ImageNet. – https://ve42.co/Karpathy2014\nFick, D. (2018). Blog post: Mythic @ Hot Chips 2018. – https://ve42.co/MythicBlog\nJin, Y. & Lee, B. (2019). 2.2 Basic operations of flash memory. Advances in Computers, 114, 1-69. – https://ve42.co/Jin2019\nDemler, M. (2018). Mythic Multiplies in a Flash. The Microprocessor Report. – https://ve42.co/Demler2018\nAspinity (2021). Blog post: 5 Myths About AnalogML. – https://ve42.co/Aspinity\nWright, L. et al. (2022). Deep physical neural networks trained with backpropagation. Nature, 601, 49–555. – https://ve42.co/Wright2022\nWaldrop, M. M. (2016). The chips are down for Moore’s law. Nature, 530, 144–147. – https://ve42.co/Waldrop2016\n\n▀▀▀\nSpecial thanks to Patreon supporters: Kelly Snook, TTST, Ross McCawley, Balkrishna Heroor, 65square.com, Chris LaClair, Avi Yashchin, John H. Austin, Jr., OnlineBookClub.org, Dmitry Kuzmichev, Matthew Gonzalez, Eric Sexton, john kiehl, Anton Ragin, Benedikt Heinen, Diffbot, Micah Mangione, MJP, Gnare, Dave Kircher, Burt Humburg, Blake Byers, Dumky, Evgeny Skvortsov, Meekay, Bill Linder, Paul Peijzel, Josh Hibschman, Mac Malkawi, Michael Schneider, jim buckmaster, Juan Benet, Ruslan Khroma, Robert Blum, Richard Sundvall, Lee Redden, Vincent, Stephen Wilcox, Marinus Kuivenhoven, Clayton Greenwell, Michael Krugman, Cy 'kkm' K'Nelson, Sam Lutfi, Ron Neal\n\n▀▀▀\nWritten by Derek Muller, Stephen Welch, and Emily Zhang\nFilmed by Derek Muller, Petr Lebedev, and Emily Zhang\nAnimation by Ivy Tello, Mike Radjabov, and Stephen Welch\nEdited by Derek Muller\nAdditional video/photos supplied by Getty Images and Pond5\nMusic from Epidemic Sound\nProduced by Derek Muller, Petr Lebedev, and Emily Zhang", "link": "https://www.youtube.com/watch?v=GVsUOuSjvcg", "date_published": "2022-03-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]