[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Putin's Way (full documentary) | FRONTLINE", "description": "In this 2015 documentary, FRONTLINE traces Vladimir Putin’s ascent from unemployed spy to modern-day czar, and investigates the accusations of criminality and corruption that have surrounded his reign in Russia. (Aired 2015)\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nIn this 2015 film, a coproduction with the Canadian Broadcasting Corporation, producer Neil Docherty and correspondent Gillian Findlay traced Putin’s career back two decades to his political start in St. Petersburg, where allegations of corruption began almost immediately. Drawing on firsthand accounts from exiled Russian business tycoons, writers and politicians, as well as the exhaustive research of scholar and best-selling “Putin’s Kleptocracy” author Karen Dawisha, the film examined troubling episodes in Putin’s past, from alleged money-laundering activities and ties to organized crime, to a secret personal fortune said to be in the billions.\n\nLove FRONTLINE? Find us on the PBS Video App, where there are more than 300 FRONTLINE documentaries available to watch any time: https://to.pbs.org/FLVideoApp​ \n\n#Documentary \n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=NIgqhU4lkgo", "date_published": "2022-03-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]