[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "More Realistic GTA 5 While You Wait For GTA 6 | GameSpot News", "description": "GTA V is getting another new coat of paint thanks to mods, Pokemon Scarlet and Violet get new battle details and The Game Awards has an official date.\n#GamingNews #GTAV #pokemon \n\nNaturalVision is a long-running visual enhancement mod for GTA 5. The mod originally got a full release under the name NaturalVision Remastered, but development has continued under the moniker NaturalVision Evolved. In a new trailer, the team behind it shows off their work and outlines recent additions to the mod. This latest update adds parallax roads, pavement, and building interiors, giving the ground more layered textures and granting inaccessible interiors the illusion of depth. A wider variety of vegetation and volumetric clouds lend additional fidelity to the game's natural landscapes. The mod has yet to have a full release, but is in early access beta and you can download it for free on the Razed Mods website. \n\nAt the conclusion of the 2022 Pokemon World Championships in London, The Pokemon Company CEO Tsunekazu Ishihara unveiled a new trailer for Pokemon Scarlet and Violet, which focused on battle mechanics and online play. The trailer opened with the introduction of a new Pokemon, the Dragon- and Normal-type Cyclizar, which showed off a new move called Shed Tail. \n\nAfter a 2021 event that saw the highest streaming numbers in its history, Geoff Keighley will present the 2022 Game Awards on December 8 live from Los Angeles. The ninth annual Game Awards will be broadcast live on over 40 streaming services around the world, but you’ll only have to worry about 2 of them because we’ll be broadcasting the event right here at GameSpot via our YouTube and Twitch channels.  \n\nSTAMPS\n00:00 - Intro\n00:09 - GTA 5 Mod\n01:21 - Pokemon Scarlet & Violet\n02:36 - 2022 Game Awards", "link": "https://www.youtube.com/watch?v=7R38x5AeAZU", "date_published": "2022-08-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Scarlet and Pokémon Violet Official Competitive Play Trailer", "description": "Pokémon VG players, this one’s for you. \n\nThe game’s about to change in Pokémon Scarlet and Pokémon Violet! Learn more about competitive play in the upcoming title.\n\n#pokemon #scarletviolet #gaming", "link": "https://www.youtube.com/watch?v=TxJMN0WRmYM", "date_published": "2022-08-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Saints Row - The First 20 Minutes 4K Gameplay", "description": "The Saints Row reboot is here, and here is the first 20 minutes captured in 4K with a 2080 TI graphics card.\n\nThe long-awaited Saints Row reboot is finally here, and it is just as explosive as ever. In this video we're taking a look at the first 20 minutes of uninterrupted gameplay. The user created \"Boss\" finds himself working for a PMC company called Marshall. \n\nThe Boss is hunting down a gang a leader with the help of his Marshall companions. In this video you'll see some cutscenes, gameplay, and how the ray-tracing is implemented in Saints Row.\n\nSaints Row is available on Xbox, PlayStation, and PC. For more Saints Row coverage, stay tuned to GameSpot.", "link": "https://www.youtube.com/watch?v=CSMFNRcEs-w", "date_published": "2022-08-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Saints Row Review", "description": "The Saints Row reboot ditches the over-the-top aspects of its predecessor, but still feels like it's trapped in the past.\n\nIt's been nine years since Saints Row IV was released, pitting the 3rd Street Saints against an alien invasion that featured superpowers, time-travel, Matrix-style simulations, and the complete destruction of Earth. Where do you go after a game so ridiculous and outlandish? After a period of absence, rebooting the series sounds like a logical next step, and that's exactly what developer Deep Silver Volition has done with this new, stripped-back Saints Row.", "link": "https://www.youtube.com/watch?v=pv4NEvH3-KU", "date_published": "2022-08-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Soulframe Official 4K Reveal Trailer", "description": "Check out an in-game cinematic Soulframe trailer in stunning 4K.\n\nSoulframe will deliver its own spell-binding and uniquely immersive fantasy experience. Soulframe is being made by the developers who brought you Warframe.\n\n#soulframe #warframe #gaming", "link": "https://www.youtube.com/watch?v=IjUqHCDh3D8", "date_published": "2022-08-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Redesign That Saved Deathloop", "description": "Before Deathloop was released to critical acclaim, early playtesters found the game so incomprehensible that it required a redesign in order to save the game from utter disaster.\n\nBack in June 2020, the world saw gameplay from Deathloop for the very first time, revealing its slick gunplay, cool aesthetic, and an intriguing mystery to unravel. The video was met with roaring excitement.\n\nFor fans, the chance to delve into a new world developed by Arkane Lyon was exciting. Internally, however, Deathloop wasn't garnering the same enthusiasm, with a lot of early playtesters not understanding what the game even was.\n\nDana Nightingale, Deathloop's campaign director, tells the story of the redesign that saved the game from near disaster. Early user research had criticized the game for its obtuse and esoteric design, with some players confusing it for a different genre entirely. Much like the premise of the game, Dana had to approach the game's design from many different angles over and over again, until piecing together something coherent for early playtesters to understand only weeks before its official release date. \n\nThis is the story of the redesign that saved Deathloop.\n\n#gaming #deathloop #gamespot", "link": "https://www.youtube.com/watch?v=9uzhjl8xh_M", "date_published": "2022-08-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Things You Didn't Know About Saints Row", "description": "Although the Saints Row games throw secrets and easter eggs your way at breakneck speed, here are some things you might now know about the bombastic series. \n\nStu here to unravel the mysteries and zany references throughout the Saints Row games. From Arc Numbers to Fight Club, Saints Row is a series that revels in featuring the pop culture references and memes from the zeitgeist of the eras that they came out in. Some of these secrets occur as easter eggs within the games themselves, and some can be found within the development of the series as a whole. I'm excited to see how the series expands on its history of debauchery in the upcoming Saints Row reboot. Saints Row is Available on Playstation, Xbox, and PC. Saints Row The Third remastered is available on Playstation, Xbox, PC, and Switch.\n\nTime Stamps: \n00:00 Intro\n00:28  Chuck Niuk's Books\n00:49 The Mehrman\n01:28 Missing Ships\n03:11 Red Faction Series\n04:48 PC Projekt Red\n05:24 The 31 Theory\n07:49 Secret Areas\n08:31 Secret Stash\n09:27 Sky Divers\n09:51 Mathematical!\n10:11 Outro\n\n#gaming #saintsrow #gamespot", "link": "https://www.youtube.com/watch?v=KX3ELNMA3lY", "date_published": "2022-08-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]