[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Kaleo – studio session, 2016 (audio only)", "description": "Kaleo are a glorious mashup: their name is Hawaiian, the band members are Icelandic, they recorded their EP in London and their home is now Austin, Texas. Not that Kaleo (the name means \"the sound\" in Hawaii) have spent too much time in Austin yet. \"We've seen less of Austin than we'd like,\" says front man JJ Julius Son. \"We've been doing a lot of touring.\"\n\nIt is touring that brought the Icelandic foursome to the Twin Cities in March 2016; Kaleo — comprising JJ on guitar and vocals, Rubin Pollock on lead guitar, David Antonsson on drums and Danny Kristjánsson on bass — visited The Current's studio for a session hosted by Mark Wheat.\n\n\"It was a logical decision to move to the U.S.,\" JJ says. \"That made sense. Our management is based in Austin, too, so that played a part.\"\n\nKaleo have discovered quite an audience in the U.S., which also precipitated the band's move. \"We've sold everything out,\" JJ says about the band's tour. \"It's quite a surprise, but a pleasant one.\"\n\nAlthough Iceland and the Hawaiian archipelago are both volcanic islands, the band members tell Mark the name \"Kaleo\" was selected purely because of its sound and its meaning. That said, they also describe how their video for the song \"Way Down We Go\" was shot over 24 hours inside an actual Icelandic volcano. \"A lot of friends helped out,\" JJ says. \"And it sounds really good in there.\"\n\nListen to the complete interview and the song performances above.\n\nSongs Played and Interview Segments:\n00:00 \"All the Pretty Girls\"\n05:06 Interview segment 1 with host Mark Wheat\n08:49 \"I Can't Go On Without You\"\n15:52 Interview segment 2 with host Mark Wheat\n20:22 \"Way Down We Go\"\n\nPerformance video:\nhttps://www.youtube.com/watch?v=WQMU8dYMXao\n\nFind more:\nKaleo perform in The Current studio:\nhttps://www.thecurrent.org/feature/2016/03/03/kaleo-perform-in-the-current-studio\nThe Current's Guitar Collection - Kaleo's JJ Julius Son, 1935 National Guitar:\nhttps://www.thecurrent.org/feature/2016/03/08/the-currents-guitar-collection-kaleo-jj-juliusson-1935-national-guitar\n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent?sub_confirmation=1\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/\nhttps://twitter.com/TheCurrent\nhttps://www.instagram.com/thecurrent/\n\n#kaleo #kaleoband #thecurrentsessions", "link": "https://www.youtube.com/watch?v=Dl7WauWaG5M", "date_published": "2022-05-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]