[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends: Saviors - Official Gameplay Trailer", "description": "See how new Legend Newcastle wields his shield, the monstrous changes to Storm Point and the reworked Ranked system, all coming in Apex Legends: Saviors!\n\n\n#ApexLegendsSaviors  #ApexSaviors #ApexLegends", "link": "https://www.youtube.com/watch?v=urI-BiKwZO8", "date_published": "2022-05-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Godrick the Grafted and Stormveil Castle - Elden Ring Lore", "description": "Godrick the Grafted, also known as Godrick the Golden, is the first major boss most players will find in Elden Ring. So, it's time to dig into the story and lore of Godrick. How much his golden linage from Godfrey the First Elden Lord affects his ego, and the seeming inferiority complex he develops compared to the likes of other great demigods like Marika, Radahn, Rykard, and Ranni. This is the tale and lore of Godrick the Grafted.\n\nLet’s discuss the first major boss of Elden Ring. A demigod and lord who despite his status, was laughed at behind his back, but would yearn for approval. Today, we’ll discuss Godrick the Grafted and Stormveil Castle.\n\n#EldenRing #GodrickLore", "link": "https://www.youtube.com/watch?v=kLvG2ySzwsI", "date_published": "2022-05-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Switch Sports Fans Are Smashing TVs Like It's 2006 | GameSpot News", "description": "Nintendo Switch Sports Is Leading To Smashed TVs, a modded toddler toy can play Elden Ring, and Square Enix Sells Tomb Raider, Deus Ex Studios And IP Rights To Embracer Group. \n#GamingNews #SwitchSports #EldenRing\n\nNintendo Switch Sports players are reporting broken televisions due to Joy-Cons flying out of sweaty hands. This is similar to how the many TV screens were shattered this same way in the 2000s as a result of Wii Sport players losing their grip on the WiiMote.\n\nTwitter user Rudeism has modded the Fisher-Price Laugh & Learn Game Controller to be a fully functional Xbox controller. Rudeism recently showed footage of the controller in action, using it to play Elden Ring on PC.\n\nEmbracer Group has announced that it has acquired Crystal Dynamics, Eidos-Montreal, Square Enix Montreal, and a catalog of IPs from Square Enix. The $300 million deal will see IPs such as Tomb Raider, Deus Ex, Thief, Legacy of Kain and more than 50 back-catalog games added to Embracer's portfolio.", "link": "https://www.youtube.com/watch?v=ZWLWwyjcrfU", "date_published": "2022-05-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "GTA 5's Franklin Reacts To Grand Theft Auto V", "description": "Shawn Solo Fonteno, aka Franklin from Grand Theft Auto 5, joins us to break down viral scenes from the game as well as GTA Online's The Contract missions. \n\n00:00 Introduction\n00:15 Franklin talks to a dog mission\n02:22 Franklin gets roasted by Lamar\n05:20 Trevor falls over\n09:08 Franklin in GTA Online's The Contract\n12:58 Chop\n13:58 Choosing ending C\n18:28 Outro\n\nIt's hard to believe it's been almost a decade since GTA 5 launched, partly because it is still getting updated and brought to current-gen consoles, and partly because its multiplayer counterpart, GTA Online, is still getting meaningful updates. Take its most recent update, The Contract, for example, not only did it pull in heavyweights Dr Dre and DJ Pooh, but also brought back GTA 5 protagonist Franklin.\n\nTo celebrate, we brought in Franklin's actor, Shawn 'Solo' Fonteno, to discuss what it was like making GTA 5, and to react to some of the game's most popular clips. In the above video, he describes what it was like to work with both the real and fake Chop the dog, his experience learning Franklin's role in the story, as well as the origins of the infamous Franklin gets roasted clip. \n\nCheck out Shawn's book here: https://sologamechanger.com/book/ \nhttps://twitter.com/Shawn_Fonteno \n\n#GTA5 #GrandTheftAuto5", "link": "https://www.youtube.com/watch?v=TcX-RvyW4tk", "date_published": "2022-05-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "What A Modern Warfare 2 Logo, Battlefield Redemption Arc, And Overwatch 2 Beta Means For Shooters", "description": "Call of Duty is bringing King Kong And Godzilla to Warzone Season 3, Overwatch 2 has a PvP beta live right now, and Battlefield 2042 seems ready for a redemption arc? Join Aaron and David as they break down what's happening in shooter games this week.\n\nTimestamps\n0:00 Introduction\n0:38 Call of Duty Season 3\n4:00 Battlefield 2042 Update\n7:48 Overwatch 2 Beta Thoughts\n14:45 Community Thoughts", "link": "https://www.youtube.com/watch?v=NPZqARSMY-k", "date_published": "2022-05-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]