[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "16 MORE Things You STILL Didn't Know In Zelda Breath Of The Wild", "description": "This time in Breath of the Wild, we dive and sink into the water to find things unknown far underwater, NPC reactions that you may not have seen before, and the secret behind the Zora domain and its ties to music.\n\nIn the video above, we cover 16 facts, tips and tricks that aren’t quite as well known, ranging from secrets to glitches that are pretty simple and others that are fairly complex. The Legend of Zelda: Breath of the Wild has been out for five years at this point, and players have found some amazing things, intended or not, that keep the game and its sense of discovery feeling fresh.\n\n0:00 Intro\n0:16 Surprising Kakariko Residents\n1:20 Kakariko And Tropical Fruits\n1:42 Kakariko's Special Freebie\n1:54 Rare Link Animation\n2:03 Naked Link Reactions\n2:49 Goron Armor Shop Judges Your Armor\n3:01 Windmill's Turn Speeds\n3:18 Magnesis Windmills\n3:30 Dive Underwater\n4:19 Equipment Tracking Bug\n4:40 Brigo Always Points Correctly\n5:08 Durability Transfer Since Day One\n5:43 Cool WMC Weapons\n6:25 Return Of The Ice Cream\n6:46 Lynel Trampoline\n7:01 Zora's Musical Secret\n8:31 Outro\n\n#botw #gaming", "link": "https://www.youtube.com/watch?v=KMP0-IS1O08", "date_published": "2022-08-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Disney And Marvel Games Showcase - What To Expect | GameSpot News", "description": "Marvel and Disney plan on showing off some new games in September so we’re letting you know what you can expect and more.\n#GamingNews #Marvel #Disney \n\nDisney's D23 expo kicks off in September, and this year there'll be a digital showcase devoted to featuring new content from upcoming Disney and Marvel games, hosted by Kinda Funny’s Blessing Adeoye Jr., and livestreamed through its social channels. According to Disney, new reveals for Disney Dreamlight Valley, Marvel’s Midnight Suns, LEGO Star Wars: The Skywalker Saga, as well as the first look at Skydance New Media's Marvel game. Described as a Marvel ensemble game, the game was officially confirmed in October last year and development is being led by Uncharted writer and director Amy Hennig. Marvel's Midnight Suns has been delayed to next year and the Firaxis-developed tactical turn-based RPG will now release before the end of Take-Two's fiscal year, which concludes on March 2023.\n\nGenshin's version 3.0 update, The Morn A Thousand Roses Brings, will go live on August 24. Developer HoYoverse says that this update will add new characters and quests in the Sumeru region, which has expansive rainforest, desert, and city sections.The big gameplay edition will be the Dendro element, the seventh and final piece in Genshin Impact's elemental system. According to the developer, Dendro can trigger burning, bloom, and catalyze reactions when used with pyro, hydro, and electro elements respectively, with more advanced combinations also available.\n\nSTAMPS\n00:00 - Intro\n00:06 - Disney and Marvel Games\n02:24 - Genshin Impact 3.0", "link": "https://www.youtube.com/watch?v=hDVAWPBvTJ4", "date_published": "2022-08-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God Of War Ragnarök Official Myths of Midgard Trailer", "description": "To get you ready for God of War Ragnarök's release on November 9th, Sony PlayStation has invited two of the best storytellers we know to recap the journey of Kratos and Atreus from God of War (2018): the amazing Felicia Day and the Smartest Man Alive, Mimir!\n\nThe new Myths of Midgard video is an animated storybook recounting the events of God of War (2018), with a goal of catching you up on the previous game.\n\n#gaming #godofwar #playstation5", "link": "https://www.youtube.com/watch?v=u0nRJziOuuw", "date_published": "2022-08-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Madden NFL 23 Early Access Livestream", "description": "Madden NFL 23 is now live in early access for EA Play subscribers and All-Madden edition owners. Join David as he hops into a few exhibition matches and explores the different game modes. We'll check out the new FieldSENSE and much more. The FieldSENSE system addresses more than just tackling, however. It touches on virtually every part of the field, with EA Tiburon citing improvements to DBs covering wideouts, to pass rushers collapsing the pocket and getting to QBs, and with better blocking in the trenches.\r\n\r\n#maddennfl23 #madden #gaming", "link": "https://www.youtube.com/watch?v=0SqmM8mx9wU", "date_published": "2022-08-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sword Master Reacts to Chivalry 2’s Combat And Weapons", "description": "David Rawlings, a Sword Master and founder of the London Longsword Academy, breaks down some of the combat and the weapons from Chivalry 2, including the Falchion, the Longsword, and a Greatsword.\n\nExpert Reacts Playlist: https://youtube.com/playlist?list=PLp...\n\nIf you are interested in training with David and team and learn how to swordfight, check out www.londonlongsword.com or send an email to enquiry@londonlongsword.com\n \nIf you would like to see more videos of David Rawlings and the London Longsword Academy (LLA) check out their YouTube channel: https://www.youtube.com/user/LondonLo...\n \nIf you like swords and martial arts content, follow the LLA on Instagram  Master_at_Arms and Swordfightress or Facebook London Longsword Academy.\n\nWeapons Featured:\n\n00:00 - Intro\n00:45 - Warhammer\n02:06 - Falchion\n03:29 - Longsword Defense\n04:34 - Fighting with a chair\n05:09 - Dane Axe\n06:18 - Greatsword\n09:22 - Longsword\n11:53 - Spear", "link": "https://www.youtube.com/watch?v=Kpw41wvo7Dw", "date_published": "2022-08-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]