[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCmKurapML4BF9Bjtj4RbvXw", "title": "Abraham Lincoln Tribute - The Piano Guys (Official Video)", "description": "“Abraham Lincoln Tribute” piano & cello song from The Piano Guys.\nGET OUR LATEST ALBUM: https://smarturl.it/TPG_LATEST_ALBUM \nWE’RE ON TOUR: https://smarturl.it/the10tour | SUBSCRIE: https://bit.ly/2XH4GCF \n\nOur NEWEST videos: https://www.youtube.com/playlist?list=PL7j5iXGSdMwdfnzc8Faa-HJITq9hPEEdI\n\n👉🏽 This video will be part of an \"Evening at the Museum\" fundraiser featuring the first story in the digital exhibit Religious Ideas During Times of National Crisis: The Prayers of Both Could Not Be Answered - Lincoln's Religion in His Second Inaugural. Go here to register at no-cost for the premier on June 24, 8pm Eastern: https://nmar.getresponsepages.com/\n\n👉🏽 Mosaic Data Science is an award-winning data science consultancy helping organizations use machine learning and artificial intelligence to make better decisions.  See more at https://www.mosaicdatascience.com\n\nLearn about our beliefs here: https://smarturl.it/TPG_Beliefs \n\nFollow The Piano Guys:\nInstagram: https://instagram.com/thepianoguys\nFacebook: https://facebook.com/ThePianoGuys\nTikTok: https://tiktok.com/@thepianoguys \nTwitter: https://twitter.com/thepianoguys\n\nStory Behind the Song\n\nWhen I was a kid our family vacations were seldom a remote beach or a big city. Instead, we’d vacation in Gettysburg! Or Independence Hall. Why? My Dad LOVED history. He wanted us to learn and love it so much that he’d print out homespun quizzes for us to sleuth out while at a historical site with a promised reward of a prize to whoever could get a “passing grade.” I remember running from place to place at each site we’d visit, seeking out the people who were dressed up like they were from history itself. They always knew the answers. I promised to share my candy prize with them in exchange for their services. I admit, at the time, I didn’t fully appreciate what my dad was trying to do for me. But now, I recognize the value in a father striving to instill in his son a love for the salient events of yesterday that allow us to enjoy the freedoms of today.\n\nWhen the American Museum of American Religion asked if we’d compose a piece of music for their exhibit surrounding Abraham Lincoln and some of his story, my father would never forgive me if I were to say no!\n\nI love Abraham Lincoln. I love his powerful, authentic style, his courage, his humility in giving the glory to God, and his tenacity in striving for what is right.\n\nHe loved the song “Battle Hymn of the Republic” — it was written to encourage men and women to volunteer to stand and fight for the union of the nation and the freedom of all humankind. When Lincoln first heard the piece performed with full orchestra and choir, he stood and wept, halting the concert for a personal request to hear it once more.\n\nThe most powerful line in the hymn, “As He died to make men holy, let us live to make men free,” truly inspires me.\n\nI wanted to write a very different arrangement of this hymn. Typically it is performed in grand fashion, with powerful voices, brass and crashing cymbals. I wanted, instead, to represent the pensive nature of President Lincoln, his deeply spiritual side – the part of him that found a way to draw strength again and again from a wellspring of resilience leading America during the most divisive time of its history. The part of him that ached when he lost his son.\n\nWhat to listen for in the piece:\nHow many key changes do you hear? This represents the dramatic changes occurring in the 1860’s.\nWhen the melody of the hymn is presented in a minor key, opposite of its original setting, I hope you can imagine the pain Lincoln felt as he lost his sweet boy Willie, at 11 years old, right in the middle of the civil war. This event nearly destroyed Lincoln, but instead galvanized his faith and determination to see the principles of freedom through. Can you also hear a fragment of another famous hymn that was written around the same time?\n\nSPECIAL THANKS: \nWe would like to thank THIS IS THE PLACE HERITAGE PARK for generously hosting our music video. They rolled out the red carpet for us and were so kind to open their incredible venue to us. If you are anywhere near Utah, this place MUST go on your bucket list.\nhttps://www.thisistheplace.org\n\n\n“Battle Hymn of the Republic” written by: Julia Ward Howe (1865)\n“Nearer My God to Thee” (Traditional)\nArrangement and original material written by: Steven Sharp Nelson\nProduced by: Al van der Beek & Steven Sharp Nelson\nRecorded at: TPG Studios, Utah\nMixed and Mastered by: Al van der Beek\nJon Schmidt: Piano\nSteven Sharp Nelson: Cello, keyboards, percussion\nFilming and Editing: Nick Sales\n\nAbout The Piano Guys:\nPaul, a Yamaha dealer who dabbled in videography, Jon, a professional pianist, Al, a music producer and studio engineer, and Steve, a cellist with a creative superpower called ADHD, all serendipitously joined forces to create the most successful YouTube instrumental music group in history.\n\n#AbrahamLincolnTribute #Piano #Cello #ThePianoGuys", "link": "https://www.youtube.com/watch?v=QYHXGnE_asM", "date_published": "2022-05-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]