[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Modern Warfare 2 Official Release Date and Artwork Reveal Trailer", "description": "Get a glimpse of some of the artwork for Call of Duty: Modern Warfare II including the release date reveal for the game.\n\nIn Call of Duty: Modern Warfare II, Task Force 141 makes its massive return with a global squad of iconic veterans, these Operators include Captain John Price,  Simon “Ghost” Riley, John “Soap” MacTavish, Kyle 'Gaz' Garrick and introducing Mexican Special Forces Colonel Alejandro Vargas. \n\nCall of Duty: Modern Warfare II releases October 28, 2022.\n\n#CallOfDuty #ModernWarfare2 #COD", "link": "https://www.youtube.com/watch?v=IreHwba6FFk", "date_published": "2022-05-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Destiny 2: The Witch Queen - Season of the Haunted Official Trailer", "description": "Driven by an insatiable lust for power, Calus seeks the approval of a new master. His once-opulent ship, now derelict and corrupted, has returned to our galaxy—its sights set on the power promised by the Pyramid ship lying dormant on the Moon. \n\nAs the Leviathan forms a connection with the Pyramid, Nightmares of humanity’s past awaken and threaten to torment any who dare intervene. Stare into the abyss and find bravery within the mantle of the reaper and the steel of the scythe.\n\n#Destiny2 #SeasonoftheHaunted #Levithan #Gaming", "link": "https://www.youtube.com/watch?v=Xlp_Q6kV5gQ", "date_published": "2022-05-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Lord of the Rings: Gollum 7 Things We Learned", "description": "The Lord of the Rings: Gollum is an upcoming stealth-action game from Daedalic Entertainment, so Lord of the Rings expert Lucy James checked out what it's all about. #Gaming #GameSpot #Gollum\n\nGollum: a miserable, wretched creature from the works of J.R.R. Tolkien who’s easy to hate, and just as easy to pity. After playing bit parts in Bilbo and Frodo’s journeys and all the adaptations of them, he’s now going to be the main character in his own game: The Lord of the Rings: Gollum. \n\nGameSpot's Lord of the Rings expert Lucy James recently attended a hands-off presentation featuring Gollum gameplay and a Q and A session with the game's developers, Daedalic. In the video above, she describes what she saw from the game, including its stealth gameplay, other recognizable characters, like Gandalf and Thranduil, as well as famous Middle-earth locations like Cirith Ungol and Mirkwood.\n\nThe Lord of the Rings: Gollum launches on September 1, 2022, for PlayStation 4, PlayStation 5, Xbox One, Xbox Series X and S, and PC. It is confirmed to be coming to Nintendo Switch later this year, but there’s no release date just yet. That's the day before the upcoming Lord of the Rings TV series, The Rings of Power, launches on Amazon Prime Video.", "link": "https://www.youtube.com/watch?v=bxU3IEO56Is", "date_published": "2022-05-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PS1 Gameplay Shown On PS5 In New Video | GameSpot News", "description": "PS1 games are tested on PS5 in a new video, Elden Ring is getting a seamless co-op mod and Call of Duty Warzone’s season 3 mid-season update includes fast travel.\n#GamingNews #PS5 #EldenRing\n\nPlayStation 1 games have started to show up on PSN in Malaysia and YouTuber Mystic dropped a new video testing out the functionality of classic games on a modern console aka the PS5. \n\nPS1 Game on PS5 - https://www.youtube.com/watch?v=lkd7Xz15bao\n\nLast week LukeYui on YouTube dropped a trailer for an Elden Ring Seamless Co-op mod that they say “removes all multiplayer boundaries and allows for connections to persist after death. Game progression is shared between all players.”\n\nCall of Duty Season 3's mid-season update will go live for both Vanguard and Warzone following a May 24 update in Vanguard at 10 AM PT / 1 PM ET, and a Warzone update at 9 AM PT / 12 PM ET May 25. New additions will include a multiplayer map for Vanguard, while a new fast travel system is coming to Warzone.\n\nCall of Duty Season 3 Reloaded: https://www.gamespot.com/articles/call-of-duty-season-3-reloaded-will-bring-fast-travel-to-warzone-new-map-and-weapon-for-vanguard/1100-6503745/\n\nSTAMPS\n00:00 - Intro\n00:07 - PS1 on PS5\n01:19 - Elden Ring Mod\n02:11 - Call of Duty", "link": "https://www.youtube.com/watch?v=4JORXdeaE4U", "date_published": "2022-05-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sniper Elite 5 - Everything to Know", "description": "Sniper Elite 5, the latest in Rebellion’s head-shottin’, x-rayin’ shooter series is upon us, releasing May 26, 2022. If this is your first Sniper Elite game, or you’re a series veteran, here’s everything you need to know about Sniper Elite 5. #SniperElite #Gaming #GameSpot\n\n0:00 - Intro\n0:19 - Plot & Setting\n1:10 - Gameplay\n4:54 - Multiplayer\n6:52 - DLC\n7:07 - Platforms\n7:40 - Release Date & Price\n8:54 - Outro", "link": "https://www.youtube.com/watch?v=-CrtvYIxy7w", "date_published": "2022-05-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]