[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Ada Lea: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nMarissa Lorusso | May 24, 2022\nAda Lea's Tiny Desk (home) concert opens just as her 2021 album, one hand on the steering wheel the other sewing a garden, does: with the careening, beautiful track \"damn.\" It's the story of a turbulent New Year's Eve party, told through songwriter Alexandra Levy's stream-of-conscious delivery. Here, she and her band lean into the song's slowly simmering tension and frustration, ending on an extremely close shot of Levy's expressive face in the song's final moments.\n\nAs Ada Lea, Levy excels at writing observational, artful indie rock; one hand..., her sophomore album, feels like a companion for driving around a city you know well and feeling a pang of nostalgia on every other block. In fact, many of the songs capture life in and around Montreal, where Levy grew up — fittingly, this (home) concert was shot at that city's storied recording studio Hotel2Tango. The songs are sharply detailed and dreamy — like \"partner,\" the second song in this set, which Levy says is a continuation of the story in \"damn.\" For \"writer in ny,\" Levy relocates with her guitar to a sofa; bandmate Felicity DeCarle, who also plays synth during the performance, sits beside her on the floor offering exquisite harmonies. And just as the album ends, Ada Lea's (home) concert closes out with \"hurt,\" a contemplative track about isolation and indecision that's made warm and cathartic in this rendition.\n\nSET LIST\n\"damn\" \n\"partner\"\n\"writer in ny\" \n\"hurt\" \n\nMUSICIANS\nAlexandra Levy: vocals, guitar\nChris Hauer: guitar, vocals\nFelicity DeCarle: synth, vocals\nLeighton Harrell: bass\nValérie Lacombe: drums\n\nCREDITS\nDirection and production: Monse Muro, Erica Orofino\nAudio: Shae Brossard \nEditor: Alexa Gagnon\nCameras: Felix Perreault, Lea Dumouli, Erica Orofino\nColor: Monse Muro\nCostume Design: Kayleigh Choiniere \nRecorded at Hotel2Tango, Montreal, Quebec, Canada\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Michael Zamora\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Kara Frame, Joshua Bryant, Maia Stern, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=JgOWuWchf88", "date_published": "2022-05-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]