[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "The BEST email clients for Linux", "description": "Download Safing's Portmaster, or subscribe to the SPN, and take control of your network traffic: https://safing.io/portmaster \n\nGrad a brand new laptop or desktop running Linux out of the box: https://www.tuxedocomputers.com/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMastodon: https://mastodon.social/web/@thelinuxEXP\n\nPixelfed: https://pixelfed.social/TLENick\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:35 Sponsor: Monitor and secure your internet connection with Safing\n01:30 Thunderbird\n04:14 Geary\n05:49 Kmail\n07:45 Evolution\n09:36 MailSpring\n11:11 BlueMail\n14:13 Sponsor: Grab a device running Linux from Tuxedo!\n15:32 Don't let me end up like Bradley Cooper in Nightmare Alley\n\nThunderbird is cross platform email client that was initially developed by Mozilla using the same technologies as Firefox. Thunderbird does a LOT. You get a calendar and tasks list, and a complete address book.Thunderbird also has plenty of configuration options to let you tweak how it looks and works, manage tags, offline use, spellchecking, and how your email actually displays.\n\nIt also has plenty of hidden, features, like a complete RSS Feed reader, that you can access by adding a new Feed account in the settings, and you can even use it a chat client for Google Talk, IRC or any app using the XMPP protocol.\n\nYou also get access to extensions! You can add, for example, sticky notes, or integrate Thunderbird with Nextcloud to upload your large attachments to your storage and send them via a link in the email, you can add a conversation view, you can turn your favorite folders into tabs in the interface, you can add Google calendar support, or even add Exchange support. \n\n\nIf you're looking for something that will look right at home on your GNOME desktop, with a simple and easy experience, Geary is what you want. It's very simple, without many options to change how it works0.\n\nIf you use KDE, you'll probably want to head towards Kmail, which is designed to look right at home on that desktop environment.\n\nKmail can work with Exchange accounts, supports OpenPGP,  and you can integrate SPamAssassin or Bogofilter to remove spam.\n\nIf you want a more complete suite for handling all your productivity needs, Kmail can also integrate with Kontact, which brings in an address book, a calendar, a todo list, RSS feeds, a journaling solution, and some sticky notes.\n\nEvolution doesn't get many updates these days, and it looks more at home on a GNOME 2 desktop than on a GNOME 3 one, it's still a pretty useful email application. Evolution will pick up on your dark theme and GTK theme, and you get access to your email, contacts, calendar, tasks, and notes.\n\nYou can change how things look, with the message panel on the right or the bottom. You also get a ton of preferences to change how you write your email, manage your labels, how the calendar and tasks work, if you want to load external content in HTML emails.\n\n\nMailspring is a pretty nice email client that you can get from flathub. It can use most email providers, like Gmail, iCloud, GMX, Office 365, or Outlook, and of course independent IMAP accounts. It comes with multiple themes out of the box, including one that looks like Yaru, Ubuntu's theme, and it has a dark theme.\n\nIt's got a comprehensive set of keyboard shortcuts, including presets, and you can set rules for incoming email, create hmtl signatures, as well as configure a lot of things.\n\nBluemail isn't open source but it still has a Linux version, and it has an interesting approach: treating your inbox as a todo list.\n\nIt has a small kanban board to let you organize your email as if they were tasks. You just drag them to a column, like Today, Later, or Done, and you've got yourself a little organizer to avoid using another app to convert your actionable emails into tasks. You can create other columns if you like to sort your work exactly how you like.", "link": "https://www.youtube.com/watch?v=Z4nV_RJ4nNU", "date_published": "2022-05-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]