[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "\"A Gun Made Of Poop?\" - Firearms Expert Reacts To Borderlands 3’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Borderlands 3, including the talking gun, the Clearance Humungous P.A.T,, the gun that shoots guns, the Edirian Fabricator, and the disgusting Porta-Pooper 5000.\n\n00:00 - Opening\n00:42 - Bloom\n03:18 - Clearance Humungous P.A.T. Mk III\n04:34 - Arctic Vanquisher\n06:15 - Molten Faisor\n08:25 - Eridian Fabricator\n09:37 - One Pump Chump\n11:35 - Annexed Ruthless Lyuda\n13:57 - Porta-Pooper 5000\n15:45- Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Borderlands 3 and compares them to their potential real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=M2qB-HvRyl8", "date_published": "2022-03-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Things I Wish I Knew Before Playing Kirby and the Forgotten Land", "description": "As the deepest and most varied Kirby yet, Kirby and the Forgotten Land isn't as straightforward as its predecessors.\n\nKirby and the Forgotten Land is the pink puff ball's biggest game yet. It has more moving parts to keep track of than its predecessors, and it also happens to be the trickiest entry from a puzzle and combat perspective. While the Forgotten Land is still fairly straightforward, there are some tricks of the trade we picked up throughout our time with the game. We've rounded up 10 tips and tricks for Kirby and the Forgotten Land. Our Kirby and the Forgotten Land beginner's guide includes combat and puzzle tips as well as general advice to help you get the most out of your time with the game.\n\nFor more on Kirby and the Forgotten Land we've got you covered here on GameSpot:\n\n10 Minutes of Gameplay: https://youtu.be/jeiXmLpQ0VY\nReview (written version): https://www.gamespot.com/reviews/kirby-and-the-forgotten-land-review-the-best-kirby-yet/1900-6417850/\nReview (video version): https://youtu.be/pwPe7ntbDBM\nEverything to Know: https://youtu.be/suG3-SozEQs\nThings I Wish I Knew (written version): https://www.gamespot.com/articles/kirby-and-the-forgotten-land-tips-and-tricks-11-things-you-should-know/1100-6501906/\n\n#Kirby", "link": "https://www.youtube.com/watch?v=r6jiuOsHcVc", "date_published": "2022-03-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Which Tiny Tina’s Wonderlands Class Is Right For You?", "description": "There are six starting character classes in Tiny Tina’s Wonderlands, and whether you want to be a hammer swinging fire god or a badass dual wielding gun wizard, or you just can’t decide what you want to be, we have you covered.\n\n00:14 - Spore Warden\n03:23 - Spellshot\n06:36 - Brr-Zerker\n11:06 - Clawbringer\n15:01 - Graveborn\n21:30 - Stabbomancer\n\nTiny Tina’s Wonderlands departs from the core Borderlands series and allows you to make your own character. Instead of a vault hunter, you’ll play as a highly customizable Fatemaker. When it comes to how you’ll fight, you get to choose one of six starting classes: Brr-Zerker, Clawbringer, Graveborn, Spellshot, Spore Warde, or Stabbomancer. Later in the game, you can multiclass and build your hero using a second skill tree from another class. That means you’ll be able to come up with some pretty wild and powerful builds with the ability to do things like bring multiple pets with you into battle.\n\nIt can be pretty daunting trying to decide on a starting class, so in this video, we’re going to give you a rundown of each and to help you figure out which one is right for you. There are easy solo classes like the Stabbomancer, which focuses on critical damage and can go invisible to escape bad situations. There are team-player classes like the Clawbringer, which can buff the party with fire damage while running around smashing things with a hammer. For original Borderlands fans who love Salvador the Gunzerker, you have something similar in the Spellshot, which can dual-wield magic. Druid/ranger types will love the ranged class Spore Warden. Glass cannon types will appreciate the Graveborn, and Krieg fans will enjoy running into and smashing things with the Brr-Zerker. \n\nTiny Tina’s Wonderlands releases on March 25 for PC, PlayStation 4, PS5, Xbox One, and Xbox Series X|S, although you need to purchase the more expensive editions of the game for new-gen optimizations. Its first post-launch content season begins starting April 21 and developer Gearbox has said it'll add a seventh class at a later point.\n\n#tinytinaswonderlands", "link": "https://www.youtube.com/watch?v=PGyX-93W_Zg", "date_published": "2022-03-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Everything We Want In The New Witcher Game", "description": "With novels, games, comics and now a television show, the Witcher is arguably bigger than ever. On March 21, 2022, CD Projekt Red announced the next game in the Witcher series has begun development and would be using the Unreal 5 Engine instead of REDengine. However, following the rough launch of the studio’s last game, Cyberpunk 2077, is it safe to be excited for another Witcher game? Well DeVante has enough hope for everyone and in this video he walks through everything he wants from the new Witcher.\n\n#Witcher #Lynx", "link": "https://www.youtube.com/watch?v=8NVuYLGjQf8", "date_published": "2022-03-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PlayStation’s Game Pass Could Reveal Next Week | GameSpot News", "description": "PlayStation’s service to compete with Xbox Game Pass could be revealed next week, GTA Online is adding a subscription service and Last of Us cast images leak. \n#GamingNews #PS5 #GTAV\n\nPlayStation is reportedly going to reveal its Xbox Game Pass competitor, codenamed \"Spartacus, as soon as next week. The subscription service will combine PlayStation Now and PlayStation Plus and consist of three tiers reportedly priced at $10, $13, and $16. \n\nRockstar Games has announced GTA+, a new membership program launching March 29 on PS5 and Xbox Series X|S that provides members with access to various extras and bonuses for $6 per month.\n\nNew images and video from the Last of Us set offer fans a closer look at Joel and Ellie as well as a first look at supporting characters Sam and Henry. In the games, the characters are sibling survivors who cross paths with Joel and Ellie. However, their meeting has a profound effect on Ellie throughout both games.\n\nSTAMPS\n00:00 - Intro\n00:10 - PlayStation\n01:28 - GTA Online\n02:25 - Last of Us", "link": "https://www.youtube.com/watch?v=d9hMbY0rs-g", "date_published": "2022-03-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]