[{"source": "https://www.theguardian.com/world/rss", "title": "Protesters defy crackdown at universities across Iran", "description": "<p>Tension mounts as ceremonies marking 40 days since Mahsa Amini’s death expected to take place on Wednesday</p><p>Students have protested at universities across <a href=\"https://www.theguardian.com/world/iran\">Iran</a>, defying a bloody crackdown as tensions mount on the eve of planned ceremonies marking 40 days since Mahsa Amini’s death.</p><p>“A student may die but will not accept humiliation,” demonstrators chanted at Shahid Chamran University of Ahvaz, in the southwestern province of Khuzestan, in an online video verified by AFP.</p> <a href=\"https://www.theguardian.com/world/2022/oct/25/protesters-defy-crackdown-at-universities-across-iran\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/25/protesters-defy-crackdown-at-universities-across-iran", "date_published": "2022-10-25 21:39:05+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Russia steps up Ukraine ‘dirty bomb’ claim in letter delivered to UN", "description": "<p>Kyiv’s allies dismiss allegation it could use such a weapon on its own soil as scientifically absurd and a distraction effort</p><ul><li><a href=\"https://www.theguardian.com/world/live/2022/oct/25/russia-ukraine-war-live-news-ukraine-invites-un-nuclear-inspectors-after-discredited-dirty-bomb-claim\">Russia-Ukraine war – latest updates</a></li></ul><p>Russia has stepped up its nuclear propaganda and delivered a letter to the United Nations claiming that Ukraine is preparing to detonate a “dirty bomb” on its territory, an allegation <a href=\"https://www.theguardian.com/world/2022/oct/24/us-dismisses-transparently-false-russian-claims-of-ukraine-plan-to-use-dirty-bomb\">dismissed by Kyiv, western governments and weapons experts </a>as absurd and an attempt at distraction or pretext for Moscow’s own escalation.</p><p>The letter was addressed to the UN secretary general and the Gabonese ambassador, who currently holds the rotating presidency of the security council, and follows calls by Russia’s defence minister to foreign ministers in recent days making similar unfounded allegations. </p> <a href=\"https://www.theguardian.com/world/2022/oct/25/russia-to-raise-ukraine-dirty-bomb-claim-at-un-security-council\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/25/russia-to-raise-ukraine-dirty-bomb-claim-at-un-security-council", "date_published": "2022-10-25 21:35:18+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "New Zealand couple detained in Iran for months leave the country", "description": "<p>Influencers Christopher Richwhite and Bridget Thackwray had disappeared after entering Iran in July and had been prevented from leaving</p><p>Two New Zealand social media influencers who were detained in Iran for almost four months have been released and have now left the country.</p><p>Social media influencers Christopher “Topher” Richwhite and Bridget Thackwray were undertaking a trip called Expedition Earth in which they aimed to travel across 90 countries in a Jeep. The two recorded their travels with near-<a href=\"https://www.instagram.com/expeditionearth.live/?hl=en\">daily vlogs and Instagram posts</a>, and documented their border crossing into Iran from Turkey in early July.</p><p>This article was amended on 27 October 2022 to make clear that Dr Kat Eghdamian was speaking in an independent capacity.</p> <a href=\"https://www.theguardian.com/world/2022/oct/25/new-zealand-couple-detained-in-iran-for-months-leave-the-country\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/25/new-zealand-couple-detained-in-iran-for-months-leave-the-country", "date_published": "2022-10-25 20:30:47+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Hu Jintao argued about official papers before being escorted out of congress", "description": "<p>Footage shows former Chinese president involved in apparent disagreement over documents</p><p>China’s former leader Hu Jintao was arguing about official papers, moments before he was <a href=\"https://www.theguardian.com/world/2022/oct/22/former-chinese-president-hu-jintao-unexpectedly-led-out-of-party-congress\">escorted off the stage at a key Communist party meeting in Beijing</a>, new footage shows.</p><p>Hu’s apparently reluctant departure from the stage at the 20th congress of the Chinese Communist party (CCP) was a rare moment of unscripted drama at what was otherwise a carefully choreographed week of political theatre.</p> <a href=\"https://www.theguardian.com/world/2022/oct/25/hu-jintao-argued-about-official-papers-before-being-escorted-out-of-congress\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/25/hu-jintao-argued-about-official-papers-before-being-escorted-out-of-congress", "date_published": "2022-10-25 19:49:04+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Tigray peace talks begin in South Africa but hopes low for halt to fighting", "description": "<p>Violence has intensified recently as Ethiopia and TPLF seek to bolster their negotiating position </p><p>Peace talks aiming to end the nearly two-year-old war in the Tigray region of northern Ethiopia have started in South Africa, although the chances of bringing the conflict to an immediate stop are believed to be low.</p><p>Representatives of the Ethiopian government and a team sent by the Tigray People’s Liberation Front (TPLF), a political organisation that has ruled the northern region for decades, are to spend five days together in the most serious effort yet to find a negotiated solution to the conflict.</p> <a href=\"https://www.theguardian.com/world/2022/oct/25/tigray-peace-talks-begin-in-south-africa-but-hopes-low-for-halt-to-fighting\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/25/tigray-peace-talks-begin-in-south-africa-but-hopes-low-for-halt-to-fighting", "date_published": "2022-10-25 18:05:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Five Palestinians killed amid mounting violence ahead of Israeli elections", "description": "<p>21 people also wounded in one of deadliest operations this year by Israeli forces in West Bank </p><p>Five Palestinians have been killed and 21 wounded in a huge raid by Israeli forces in Nablus, one of the deadliest operations so far during a year of mounting violence in the occupied West Bank.</p><p>Snipers, soldiers with shoulder-launched missiles and members of Israel’s Shin Bet intelligence agency attacked the old city in the early hours of Tuesday, the Israeli military said, blowing up what it said was a bomb lab and killing one of the leaders of an increasingly popular Palestinian militant group in a gunfight.</p> <a href=\"https://www.theguardian.com/world/2022/oct/25/palestinians-killed-west-bank-firefight-israeli-forces\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/25/palestinians-killed-west-bank-firefight-israeli-forces", "date_published": "2022-10-25 17:59:21+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Ukraine fears Russia planning false flag attack amid Kremlin’s ‘dirty bomb’ claims – as it happened", "description": "<p>Ukraine foreign minister says experts from UN nuclear watchdog will soon arrive in Ukraine and receive full access. </p><p>This blog is now closed</p><ul><li><a href=\"https://www.theguardian.com/world/2022/oct/25/russia-ukraine-war-latest-what-we-know-on-day-244-of-the-invasion\">At a glance: what we know on day 244 of the invasion</a></li></ul> <a href=\"https://www.theguardian.com/world/live/2022/oct/25/russia-ukraine-war-live-news-ukraine-invites-un-nuclear-inspectors-after-discredited-dirty-bomb-claim\">Continue reading...</a>", "link": "https://www.theguardian.com/world/live/2022/oct/25/russia-ukraine-war-live-news-ukraine-invites-un-nuclear-inspectors-after-discredited-dirty-bomb-claim", "date_published": "2022-10-25 17:58:56+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Uber whistleblower calls on Europe to tackle ‘undemocratic’ power of tech companies", "description": "<p>Mark MacGann tells MEPs Uber had ‘almost unlimited finance’ to silence drivers with legal disputes</p><p>The whistleblower who revealed how Uber flouted the law and secretly lobbied governments around the world has called on European lawmakers to take on the “disproportionate” and “undemocratic” power held by tech companies.</p><p>Speaking to a committee of MEPs in the European parliament, Mark MacGann, who was Uber’s top lobbyist in Europe, said the cab-hailing company’s practices were “borderline immoral” as he recalled the “almost unlimited finance” executives had to lobby and silence drivers with legal disputes.</p> <a href=\"https://www.theguardian.com/technology/2022/oct/25/uber-whistleblower-calls-on-europe-to-tackle-undemocratic-power-of-tech-companies\">Continue reading...</a>", "link": "https://www.theguardian.com/technology/2022/oct/25/uber-whistleblower-calls-on-europe-to-tackle-undemocratic-power-of-tech-companies", "date_published": "2022-10-25 17:29:23+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Norway arrests ‘Brazilian researcher’ accused of spying for Russia", "description": "<p>Investigators believe man posing as academic at University of Tromsø, in sensitive far north, was using false identity</p><p>Norway’s domestic security agency has arrested a man claiming to be a Brazilian academic whom it suspects of being a Russian spy.</p><p>“We have requested that a Brazilian researcher at the University of Tromsø be expelled from Norway because we believe he represents a threat to fundamental national interests,” the police security service (PST) deputy chief, Hedvig Moe, told the <a href=\"https://www.nrk.no/nyheter/mistenkt-russisk-spion-arrestert-i-tromso--1.16152155\">public broadcaster NRK</a>.</p> <a href=\"https://www.theguardian.com/world/2022/oct/25/norway-arrests-brazilian-researcher-accused-of-spying-for-russia\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/25/norway-arrests-brazilian-researcher-accused-of-spying-for-russia", "date_published": "2022-10-25 16:56:25+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Peter Tatchell stopped in Qatar while staging LGBT+ rights protest", "description": "<p>Incident outside National Museum in Doha comes less than a month before start of men’s football World Cup</p><p>The human rights campaigner Peter Tatchell has been stopped by police in Qatar while staging a protest against the Gulf state’s criminalisation of LGBTQ+ people.</p><p>Tatchell’s protest outside the National Museum of Qatar in the capital, Doha, comes less than a month before the start of the Fifa <a href=\"https://www.theguardian.com/football/world-cup-football\">World Cup</a>, which is expected to attract 1.2 million visitors from around the world.</p> <a href=\"https://www.theguardian.com/uk-news/2022/oct/25/peter-tatchell-qatar-doha-lgbt-rights-protest\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/oct/25/peter-tatchell-qatar-doha-lgbt-rights-protest", "date_published": "2022-10-25 13:33:54+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Indian minister calls for abolition of 1,500 laws dating back to Raj", "description": "<p>Archaic laws include fining those who fail to beat a drum to beat back locusts or report money found in street</p><p>An Indian minister has called for his country to abolish 1,500 archaic laws dating back to the <a href=\"https://www.theguardian.com/world/2021/jun/29/british-empire-india-amartya-sen\">British Raj</a>.</p><p>On the statute book are laws that range from equating kites with aircraft so that anyone wanting to fly a kite needs a licence, to a requirement for car inspectors to have “well-brushed” teeth.</p> <a href=\"https://www.theguardian.com/world/2022/oct/25/indian-minister-calls-for-abolition-of-1500-laws-dating-back-to-raj\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/25/indian-minister-calls-for-abolition-of-1500-laws-dating-back-to-raj", "date_published": "2022-10-25 08:47:09+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Rishi Sunak to meet King Charles and give first address to the nation as PM – UK politics live", "description": "<p>Liz Truss to hold final cabinet meeting before tendering resignation at Buckingham Palace; new PM expected to speak at Downing Street before noon</p><p>The BBC’s political correspondent, <strong>Nick Eardley</strong>, has just summed things up on BBC Radio 4 like this: “Liz Truss faced one of the most daunting entries of modern times, Mr Sunak faces an even more daunting one – plus he has to pick a cabinet that will unite the party.”</p><p>When he becomes PM, Rishi Sunak will be doing many things for the first time in modern politics – he will be the first PM of colour, the first Hindu, the youngest since William Pitt the Younger.</p> <a href=\"https://www.theguardian.com/politics/live/2022/oct/25/uk-politics-live-sunak-to-meet-king-charles-and-give-first-address-to-the-nation-as-pm\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/live/2022/oct/25/uk-politics-live-sunak-to-meet-king-charles-and-give-first-address-to-the-nation-as-pm", "date_published": "2022-10-25 07:39:38+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Federal budget 2022 live updates: treasurer Jim Chalmers to deliver speech tonight", "description": "<p>Australian treasurer says Labor’s October budget announcement ‘will do more than batten the hatches against global uncertainty’. Follow today’s news live before the speech tonight</p><ul><li><a href=\"https://www.theguardian.com/australia-news/2022/oct/25/australia-federal-budget-2022-jim-chalmers-announce-national-housing-accord-to-build-1m-homes\">2022 budget: Jim Chalmers delivers national housing agreement to build 1m homes</a></li><li>Get our <a href=\"https://www.theguardian.com/australia-news/2022/sep/23/morning-mail-newsletter-best-daily-news-email-guardian-australia-free-sign-up-inbox-subscribe?CMP=cvau_sfl\">morning</a> and <a href=\"https://www.theguardian.com/australia-news/2022/oct/13/afternoon-update-newsletter-best-daily-news-email-guardian-australia-free-sign-up?CMP=cvau_sfl\">afternoon</a> news emails, <a href=\"https://www.theguardian.com/technology/ng-interactive/2018/may/15/the-guardian-app?CMP=cvau_sfl\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></li></ul><p>We will be breaking into the political coverage today to keep you updated on the floods as well:</p><p>Overnight, residents of the north west NSW town of Narrabri have been ordered to evacuate due to flooding, with the SES issuing the warnings for the town’s industrial and residential areas.</p><p>The rivers are very, very full and, of course, our dams are mostly at full capacity at present. So, even the smallest rainfall can cause an elevated risk of flash flooding and riverine flooding. We will see rivers decline, but the risk is real.</p><p>We are bracing for another wet weather system into the state on the weekend.</p><p>He is a friend of Australia as the UK is a friend of Australia. We congratulate him on his elevation to the Prime Ministership. The UK, like Australia, has no shortage of challenges and no shortage of economic challenges.</p><p>So, we wish Rishi Sunak well. Some of us had the opportunity to work with him briefly when we first came to government. I was able to exchange messages with him when he was unsuccessful in the last leadership ballot. I think it says something about his commitment and his persistence, the way that he conducted himself in the interim. I don’t think it’s insignificant that a country like the United Kingdom has its first Prime Minister of colour.</p> <a href=\"https://www.theguardian.com/australia-news/live/2022/oct/25/australia-politics-live-budget-jim-chalmers-deficit-debt-housing-cost-of-living-spending-economy-unemployment-inflation-labor-coalition-vic-nsw-qld-floods\">Continue reading...</a>", "link": "https://www.theguardian.com/australia-news/live/2022/oct/25/australia-politics-live-budget-jim-chalmers-deficit-debt-housing-cost-of-living-spending-economy-unemployment-inflation-labor-coalition-vic-nsw-qld-floods", "date_published": "2022-10-25 07:39:25+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Rishi Sunak to become PM after meeting the king – how the day will unfold", "description": "<p>Ex-chancellor to become third Tory prime minister in less than two months and fifth in six years</p><ul><li><a href=\"https://www.theguardian.com/politics/live/2022/oct/25/uk-politics-live-sunak-to-meet-king-charles-and-give-first-address-to-the-nation-as-pm\">Rishi Sunak to meet king and become PM - live news updates</a></li></ul><p>Rishi Sunak, the UK’s prime minister-designate, will formally become prime minister on Tuesday, despite losing the Conservative leadership contest to Liz Truss only six weeks ago.</p><p>The former chancellor, who resigned dramatically from Boris Johnson’s government in July, will become the third Conservative prime minister in less than two months and the fifth in six years.</p> <a href=\"https://www.theguardian.com/politics/2022/oct/25/rishi-sunak-to-become-pm-after-meeting-the-king-how-the-day-will-unfold\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/oct/25/rishi-sunak-to-become-pm-after-meeting-the-king-how-the-day-will-unfold", "date_published": "2022-10-25 07:35:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Whitbread warns of £60m increase in costs due to inflation", "description": "<p>Premier Inn and restaurant chains owner reports profit bounceback to pre-Covid levels</p><p>The owner of Premier Inn and restaurant chains including Beefeater has reported a bounceback in profits to above pre-Covid levels but warned of a £60m increase in costs this year fuelled by soaring inflation.</p><p>Whitbread, which runs 800 Premier Inn hotels, also said it was increasing its target of number of rooms from 110,000 to 125,000 to take advantage of independent accommodation operators going bust in the UK and Ireland.</p> <a href=\"https://www.theguardian.com/business/2022/oct/25/whitbread-costs-increase-inflation\">Continue reading...</a>", "link": "https://www.theguardian.com/business/2022/oct/25/whitbread-costs-increase-inflation", "date_published": "2022-10-25 07:27:15+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Fungal disease spiked during Covid pandemic and pathogens spreading due to climate crisis, WHO says", "description": "<p>World Health Organization identifies priority pathogens of greatest threat to public health as diseases grow resistant to antifungal treatments</p><p>Health-threatening fungi are spreading in geographic range due to climate change, while some fungal diseases spiked during the Covid-19 pandemic, according to authors of a newly released World Health Organization report.</p><p>On Tuesday the WHO published its first ever list of fungal priority pathogens, cataloguing 19 organisms that experts identified as being of the greatest threat to public health.</p><p>Sign up for our free <a href=\"https://www.theguardian.com/australia-news/2022/sep/23/morning-mail-newsletter-best-daily-news-email-guardian-australia-free-sign-up-inbox-subscribe?CMP=copyembed\">morning newsletter</a> and <a href=\"https://www.theguardian.com/australia-news/2022/oct/13/afternoon-update-newsletter-best-daily-news-email-guardian-australia-free-sign-up?CMP=copyembed\">afternoon email</a> to get your daily news roundup</p> <a href=\"https://www.theguardian.com/science/2022/oct/25/fungal-disease-spiked-during-covid-pandemic-and-pathogens-spreading-due-to-climate-crisis-who-says\">Continue reading...</a>", "link": "https://www.theguardian.com/science/2022/oct/25/fungal-disease-spiked-during-covid-pandemic-and-pathogens-spreading-due-to-climate-crisis-who-says", "date_published": "2022-10-25 07:08:15+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "AFL apologises to players in concussion study after review finds it produced no published research", "description": "<p>Multimillion-dollar study led by Dr Paul McCrory led to ‘confusion’ among player participants over tests and procedures, review says</p><ul><li><a href=\"https://www.theguardian.com/australia-news/live/2022/oct/25/australia-politics-live-budget-jim-chalmers-deficit-debt-housing-cost-of-living-spending-economy-unemployment-inflation-labor-coalition-vic-nsw-qld-floods\">Follow our Australia news live blog for the latest updates</a></li><li>Get our <a href=\"https://www.theguardian.com/australia-news/2022/sep/23/morning-mail-newsletter-best-daily-news-email-guardian-australia-free-sign-up-inbox-subscribe?CMP=cvau_sfl\">morning</a> and <a href=\"https://www.theguardian.com/australia-news/2022/oct/13/afternoon-update-newsletter-best-daily-news-email-guardian-australia-free-sign-up?CMP=cvau_sfl\">afternoon</a> news emails, <a href=\"https://www.theguardian.com/technology/ng-interactive/2018/may/15/the-guardian-app?CMP=cvau_sfl\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></li></ul><p>A massive AFL study which promised to make “groundbreaking” findings about concussion resulted in no published research and “confusion” about what happened to tests performed on players, a review into the work of the league’s former concussion adviser, Dr Paul McCrory, has found.</p><p>On Tuesday, the AFL apologised to players involved in the study and admitted they were “let down”.</p><p>Sign up for our free <a href=\"https://www.theguardian.com/australia-news/2022/sep/23/morning-mail-newsletter-best-daily-news-email-guardian-australia-free-sign-up-inbox-subscribe?CMP=copyembed\">morning newsletter</a> and <a href=\"https://www.theguardian.com/australia-news/2022/oct/13/afternoon-update-newsletter-best-daily-news-email-guardian-australia-free-sign-up?CMP=copyembed\">afternoon email</a> to get your daily news roundup</p> <a href=\"https://www.theguardian.com/sport/2022/oct/25/afl-apologises-to-players-in-concussion-study-after-review-finds-it-produced-no-published-research\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/oct/25/afl-apologises-to-players-in-concussion-study-after-review-finds-it-produced-no-published-research", "date_published": "2022-10-25 07:03:52+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Echuca residents say emergency levee has divided town with some homes protected at expense of others", "description": "<p>Victorian authorities say nature of emergency flood management means ‘sometimes difficult and challenging decisions need to be made’</p><ul><li><a href=\"https://www.theguardian.com/australia-news/live/2022/oct/25/australia-politics-live-budget-jim-chalmers-deficit-debt-housing-cost-of-living-spending-economy-unemployment-inflation-labor-coalition-vic-nsw-qld-floods\">Follow our Australia news live blog for the latest updates</a></li><li>Get our <a href=\"https://www.theguardian.com/australia-news/2022/sep/23/morning-mail-newsletter-best-daily-news-email-guardian-australia-free-sign-up-inbox-subscribe?CMP=cvau_sfl\">morning</a> and <a href=\"https://www.theguardian.com/australia-news/2022/oct/13/afternoon-update-newsletter-best-daily-news-email-guardian-australia-free-sign-up?CMP=cvau_sfl\">afternoon</a> news emails, <a href=\"https://www.theguardian.com/technology/ng-interactive/2018/may/15/the-guardian-app?CMP=cvau_sfl\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></li></ul><p>Trucks began spraying stormwater “full tilt” into the back yard of Bobby Lang’s Echuca home two days ago.</p><p>Lang said that since an emergency levee was built to help protect part of the town from recent flooding, those houses within the levee have no outlet for their stormwater, so authorities are pumping it back over the barrier when it rains.</p><p>Sign up for our free <a href=\"https://www.theguardian.com/australia-news/2022/sep/23/morning-mail-newsletter-best-daily-news-email-guardian-australia-free-sign-up-inbox-subscribe?CMP=copyembed\">morning newsletter</a> and <a href=\"https://www.theguardian.com/australia-news/2022/oct/13/afternoon-update-newsletter-best-daily-news-email-guardian-australia-free-sign-up?CMP=copyembed\">afternoon email</a> to get your daily news roundup</p> <a href=\"https://www.theguardian.com/environment/2022/oct/25/echuca-residents-say-emergency-levee-has-divided-town-with-some-homes-protected-at-expense-of-others\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/oct/25/echuca-residents-say-emergency-levee-has-divided-town-with-some-homes-protected-at-expense-of-others", "date_published": "2022-10-25 07:00:14+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Medibank reveals hack could affect all of its 3.9m customers", "description": "<p>Medibank says it is in communication with the hacker, but declined to say whether it would pay any demands made</p><ul><li><a href=\"https://www.theguardian.com/australia-news/live/2022/oct/25/australia-politics-live-budget-jim-chalmers-deficit-debt-housing-cost-of-living-spending-economy-unemployment-inflation-labor-coalition-vic-nsw-qld-floods\">Follow the latest updates live</a></li><li>Get our <a href=\"https://www.theguardian.com/australia-news/2022/sep/23/morning-mail-newsletter-best-daily-news-email-guardian-australia-free-sign-up-inbox-subscribe?CMP=cvau_sfl\">morning</a> and <a href=\"https://www.theguardian.com/australia-news/2022/oct/13/afternoon-update-newsletter-best-daily-news-email-guardian-australia-free-sign-up?CMP=cvau_sfl\">afternoon</a> news emails, <a href=\"https://www.theguardian.com/technology/ng-interactive/2018/may/15/the-guardian-app?CMP=cvau_sfl\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></li></ul><p>Australian health insurance giant Medibank has revealed the hack of customer records has affected more customers than first thought, with the CEO saying the company is acting on the assumption all customers are affected.</p><p>Earlier this month Medibank said it believed that only customers of its subsidiary ahm and those who were international students might have been affected by the hack of its systems. But now the company has said it has received files from the hackers that include main brand customers – widening the range of those potentially affected to 3.9m.</p><p>Sign up for our free <a href=\"https://www.theguardian.com/australia-news/2022/sep/23/morning-mail-newsletter-best-daily-news-email-guardian-australia-free-sign-up-inbox-subscribe?CMP=copyembed\">morning newsletter</a> and <a href=\"https://www.theguardian.com/australia-news/2022/oct/13/afternoon-update-newsletter-best-daily-news-email-guardian-australia-free-sign-up?CMP=copyembed\">afternoon email</a> to get your daily news roundup</p> <a href=\"https://www.theguardian.com/australia-news/2022/oct/25/medibank-reveals-hack-has-affected-more-customers-than-first-thought\">Continue reading...</a>", "link": "https://www.theguardian.com/australia-news/2022/oct/25/medibank-reveals-hack-has-affected-more-customers-than-first-thought", "date_published": "2022-10-25 06:02:24+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "2022 budget: Jim Chalmers delivers national housing agreement to build 1m homes", "description": "<p>‘Historic’ accord includes state and federal funding commitments for 20,000 new affordable dwellings</p><ul><li><a href=\"https://www.theguardian.com/australia-news/live/2022/oct/25/australia-politics-live-budget-jim-chalmers-deficit-debt-housing-cost-of-living-spending-economy-unemployment-inflation-labor-coalition-vic-nsw-qld-floods\">Australia federal budget 2022 live updates: Jim Chalmers’ announcement and speech – latest news</a></li><li><a href=\"https://www.theguardian.com/australia-news/live/2022/oct/25/australia-politics-live-budget-jim-chalmers-deficit-debt-housing-cost-of-living-spending-economy-unemployment-inflation-labor-coalition-vic-nsw-qld-floods\">Explore all of our 2022 Australia federal budget coverage</a></li><li>Get our <a href=\"https://www.theguardian.com/australia-news/2022/sep/23/morning-mail-newsletter-best-daily-news-email-guardian-australia-free-sign-up-inbox-subscribe?CMP=cvau_sfl\">morning</a> and <a href=\"https://www.theguardian.com/australia-news/2022/oct/13/afternoon-update-newsletter-best-daily-news-email-guardian-australia-free-sign-up?CMP=cvau_sfl\">afternoon</a> news emails, <a href=\"https://www.theguardian.com/technology/ng-interactive/2018/may/15/the-guardian-app?CMP=cvau_sfl\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></li></ul><p>A national plan to build 1m new homes before the end of the decade will be announced in the federal budget as part of a historic agreement between governments, investors and the construction sector.</p><p>The treasurer, Jim Chalmers, will announce the national housing accord during Tuesday’s budget, which will include the target of building 1m “well-located” and energy-efficient homes in five years, starting from 2024.</p><p>Sign up for our free <a href=\"https://www.theguardian.com/australia-news/2022/sep/23/morning-mail-newsletter-best-daily-news-email-guardian-australia-free-sign-up-inbox-subscribe?CMP=copyembed\">morning newsletter</a> and <a href=\"https://www.theguardian.com/australia-news/2022/oct/13/afternoon-update-newsletter-best-daily-news-email-guardian-australia-free-sign-up?CMP=copyembed\">afternoon email</a> to get your daily news roundup</p> <a href=\"https://www.theguardian.com/australia-news/2022/oct/25/australia-federal-budget-2022-jim-chalmers-announce-national-housing-accord-to-build-1m-homes\">Continue reading...</a>", "link": "https://www.theguardian.com/australia-news/2022/oct/25/australia-federal-budget-2022-jim-chalmers-announce-national-housing-accord-to-build-1m-homes", "date_published": "2022-10-25 06:00:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Mike Lindell: MyPillow chief’s influence grows as devoted backer of Trump’s big lie", "description": "<p>The wealthy Lindell has found a home among diehard Trumpists and has spent tens of millions to expose unproven electoral fraud</p><p>Members of the crowd cheer when a man, wearing a blue suit and a long red striped tie, walks by their section in the Covelli Centre . Some of the rally attendees stand as the man smiles and waves at them, applauding him before he climbs the steps to the press risers.</p><p>Surprisingly, the man at the center of this praise is not Donald Trump, even though the former US president is the host of the rally in the hardscrabble rust belt city of Youngstown, Ohio.</p> <a href=\"https://www.theguardian.com/us-news/2022/oct/25/mike-lindell-mypillow-trump-big-lie-midterms\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/oct/25/mike-lindell-mypillow-trump-big-lie-midterms", "date_published": "2022-10-25 06:00:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Two-thirds of cattle farms in north Devon cause river pollution", "description": "<p>Nearly nine in 10 farms inspected failed to comply with regulations, according to a report from the Environment Agency</p><p>The government’s efforts to protect UK rivers have been labelled an “abject failure” after two-thirds of farms in Devon were found to be causing pollution when inspected by the Environment Agency.</p><p>Between 2016 and 2020, the agency visited more than 100 cattle farms in north Devon to check levels of compliance with environmental regulations, particularly around safe slurry storage and spreading.</p> <a href=\"https://www.theguardian.com/environment/2022/oct/25/two-thirds-of-cattle-farms-in-north-devon-cause-river-pollution\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/oct/25/two-thirds-of-cattle-farms-in-north-devon-cause-river-pollution", "date_published": "2022-10-25 05:30:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "More than 30 dead in tribal fighting on Papua New Guinea’s ‘island of love’", "description": "<p>Another 15 people are missing after tensions between two groups boiled over into violence</p><p>Tribal warfare on Kiriwina Island in Papua New Guinea’s east has left 32 people dead and 15 others missing, with fighting continuing.</p><p>The fighting erupted on Monday between the Kulumata and Kuboma people on the island, which is in Milne Bay province.</p> <a href=\"https://www.theguardian.com/world/2022/oct/25/more-than-30-dead-in-tribal-fighting-on-papua-new-guineas-kiriwina-island\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/25/more-than-30-dead-in-tribal-fighting-on-papua-new-guineas-kiriwina-island", "date_published": "2022-10-25 05:18:49+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Donatello’s David sculpture to go on display in UK for first time", "description": "<p>Renaissance artist’s famous marble to form part of V&amp;A exhibition exploring his cultural impact</p><p>Donatello’s most famous marble sculpture, David, is to go on display in the UK for the first time as part of the country’s first exhibition of the Renaissance master’s work.</p><p><a href=\"https://www.vam.ac.uk/exhibitions/donatello-sculpting-the-renaissance?gclid=CjwKCAjw79iaBhAJEiwAPYwoCP8mGI4bciuukDY8jbZcv9ClATWSK1fDlhT9_0aeadbQXTr-_YuboRoCP9kQAvD_BwE\">Donatello: Sculpting the Renaissance</a>, which will be staged at the Victoria and Albert Museum, will feature other previously unseen works in Britain, offering a fresh vision of the artist and his impact on the the cultural and artistic development of 15th-century Italy.</p> <a href=\"https://www.theguardian.com/artanddesign/2022/oct/25/donatello-david-sculpture-display-uk-first-time-v-and-a-exhibition\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/2022/oct/25/donatello-david-sculpture-display-uk-first-time-v-and-a-exhibition", "date_published": "2022-10-25 05:01:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "FCA to examine how to regulate big tech’s financial services", "description": "<p>Firms such as Apple, Google and Amazon could harm competition in UK’s  sector, Financial Conduct Authority says </p><p>The UK’s City watchdog is to examine how to regulate “big tech” companies such as Apple, Google and Amazon over fears they could harm competition in Britain’s financial services sector.</p><p>The Financial Conduct Authority (FCA) said that big tech companies could provide innovations in financial services and drive down costs, but also expressed concerns that they could build dominant positions leading to the “potential exploitation of market power”, according to analysis published on Tuesday.</p> <a href=\"https://www.theguardian.com/business/2022/oct/25/fca-to-examine-how-to-regulate-big-tech-financial-services\">Continue reading...</a>", "link": "https://www.theguardian.com/business/2022/oct/25/fca-to-examine-how-to-regulate-big-tech-financial-services", "date_published": "2022-10-25 05:01:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Will Rishi Sunak find the fractured Tory party is ungovernable?", "description": "<p>Despite public displays of loyalty by former opponents, the new PM’s honeymoon period is likely to be brief</p><ul><li><a href=\"https://www.theguardian.com/politics/live/2022/oct/25/uk-politics-live-sunak-to-meet-king-charles-and-give-first-address-to-the-nation-as-pm\">Rishi Sunak to meet king and become PM - live news updates</a></li></ul><p>When Conservative MPs are asked privately if the party will pull itself out of a seemingly never-ending spiral of disunity now <a href=\"https://www.theguardian.com/politics/2022/oct/24/sunak-poised-become-uk-pm-mordaunt-johnson-withdraw\">Rishi Sunak is at the helm</a>, rather than reply with the affirmative, most instead say that “it can” or “it has to”.</p><p>The new prime minister will expect to get a reprieve from colleagues’ acidic briefings as those who tried everything to keep him out of Downing Street slink away to lick their wounds and the more moderate doubters magnanimously fall into line.</p> <a href=\"https://www.theguardian.com/politics/2022/oct/25/will-rishi-sunak-find-the-fractured-tory-party-is-ungovernable\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/oct/25/will-rishi-sunak-find-the-fractured-tory-party-is-ungovernable", "date_published": "2022-10-25 05:00:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "‘Groundbreaking milestone’: world reacts to Rishi Sunak as next British prime minister", "description": "<p>World leaders lauded the significance of Sunak’s victory as the UK’s first prime minister of colour</p><p>News that Rishi Sunak will take office as Britain’s next prime minister – the third in less than two months – raised cheers in New Delhi, calls for stability from Europe and praise as a “groundbreaking milestone” from the US. </p><p>World leaders lauded the significance of Sunak’s victory as the <a href=\"https://www.theguardian.com/politics/2022/oct/24/rishi-sunak-becomes-first-british-pm-of-colour-and-also-first-hindu-at-no-10\">UK’s first prime minister of colour</a> and the youngest in modern political history.</p> <a href=\"https://www.theguardian.com/politics/2022/oct/25/groundbreaking-milestone-world-reacts-to-rishi-sunak-as-next-british-prime-minister\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/oct/25/groundbreaking-milestone-world-reacts-to-rishi-sunak-as-next-british-prime-minister", "date_published": "2022-10-25 04:30:37+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Xi Jinping’s party purge prompts fears of greater Taiwan invasion risk", "description": "<p>Observers wonder whether there is anyone left in CCP to stop Chinese president making a rash move</p><p>Xi Jinping’s purging of political rivals and elevation of loyalists to the top ranks of the Chinese Communist party has raised fears that his now unfettered and unquestionable power could increase the risk of an attack on Taiwan.</p><p>Beijing has pledged to annex Taiwan under a disputed claim that it is a Chinese province, and in recent years has increased its <a href=\"https://www.theguardian.com/world/2022/aug/10/china-taiwan-military-drills-the-new-normal-analysts-say\">military activity</a> and other forms of harassment and coercion. No timeline has been set, but senior defence figures have said China could be capable of invasion as early as 2027. Others point to Xi’s pledge of “national rejuvenation” by 2047 – the centenary of the People’s Republic of China – as a potential goal.</p> <a href=\"https://www.theguardian.com/world/2022/oct/25/xi-jinping-party-purge-china-taiwan-invasion-risk\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/25/xi-jinping-party-purge-china-taiwan-invasion-risk", "date_published": "2022-10-25 02:24:42+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Harvey Weinstein’s new rape trial begins in Los Angeles", "description": "<p>Disgraced Hollywood producer denies accusations from five women who say he abused them between 2004 and 2013</p><p>As Harvey Weinstein faces a new trial on multiple rape and sexual assault charges in Los Angeles, a prosecutor alleged a series of graphic rapes in hotel rooms across the city, and a group of women who were left terrified by Weinstein’s power within Hollywood.</p><p>Opening statements began on Monday, with prosecutors in Los Angeles saying that eight women would testify about Weinstein’s alleged crimes, including Jennifer Siebel Newsom, a documentary film-maker and actor who is now married to the governor of California, Gavin Newsom. Siebel Newsom alleges that Weinstein raped her during what she thought would be a business meeting in 2005, when she was a young actor trying to build her career.</p> <a href=\"https://www.theguardian.com/world/2022/oct/24/harvey-weinstein-rape-trial-jennifer-siebel-newsom-los-angeles-court\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/24/harvey-weinstein-rape-trial-jennifer-siebel-newsom-los-angeles-court", "date_published": "2022-10-25 02:03:15+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "New Zealand Uber drivers win landmark case declaring them employees", "description": "<p>Uber said it would appeal against the decision, which judge said ‘may well’ affect other drivers’ status and entitle them to workers’ rights and protections</p><p>A group of New Zealand Uber drivers have won a landmark case against the global ridesharing company, forcing it to treat them as employees, not contractors, and entitling them to a suite of worker rights and protections.</p><p>New Zealand’s employment court ruled on Tuesday that the drivers were employees, not independent contractors. While the ruling applies specifically to the case of four drivers, the court noted that it may have wider implications for drivers across the country.</p> <a href=\"https://www.theguardian.com/technology/2022/oct/25/new-zealand-uber-drivers-win-landmark-case-declaring-them-employees\">Continue reading...</a>", "link": "https://www.theguardian.com/technology/2022/oct/25/new-zealand-uber-drivers-win-landmark-case-declaring-them-employees", "date_published": "2022-10-25 01:35:36+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Chorus of outrage against Kanye West grows as antisemitic incidents rattle LA", "description": "<p>Sports brand Adidas is also facing pressure to cut ties with the rapper over his hateful comments</p><p>Kanye West is facing a growing backlash among California political leaders, entertainment industry figures and members of the Jewish community – who have called on Adidas to cut ties with the star – following several antisemitic incidents in Los Angeles that came after the artist made bigoted comments about Jewish people.</p><p>The fashion designer and rapper now known as Ye has been spreading antisemitic conspiracy theories for weeks in interviews and on social media. He generated further outrage for wearing a “white lives matter” T-shirt during his runway show at Paris fashion week earlier this month.</p> <a href=\"https://www.theguardian.com/us-news/2022/oct/24/los-angeles-leaders-condemn-kanye-wests-antisemitic-comments\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/oct/24/los-angeles-leaders-condemn-kanye-wests-antisemitic-comments", "date_published": "2022-10-25 00:59:02+00:00", "persistent": false, "user": null, "language": "en-US"}]