[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Bayonetta 3 Review", "description": "Bayonetta 3 is a show-stopping spectacle that feels familiar in all the right ways while also adding mechanics that are sure to delight old and new fans alike.", "link": "https://www.youtube.com/watch?v=l6T3ysyqNBU", "date_published": "2022-10-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Modern Warfare 2: Realism Mode, No Death Pistols Only", "description": "We head to the US/Mexico border in 4k on Realism difficulty, no deaths and only our pistol to hunt down Hassan Zayani and stop a terrorist threat in Call of Duty: Modern Warfare II. \n\nThe multiplayer releases on October 28, 2022 so check out Call of Duty: Modern Warfare 2 on PlayStation 5, PlayStation 4, Xbox Series X and S, Xbox One and PC.\n\n#callofduty #cod #gaming", "link": "https://www.youtube.com/watch?v=t7oT9bp-8yc", "date_published": "2022-10-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Modern Warfare 2’s Multiplayer Launch Details | GameSpot News", "description": "Today we’re talking about what you can expect from Modern Warfare 2’s multiplayer at launch as well as a new Last of Us multiplayer update\n\nCurrently, players who pre-order Modern Warfare II can get early access to the game's single-player campaign. Multiplayer will arrive for all players on October 28, though those wanting to experience Warzone 2.0 will have to wait a bit longer, as the free-to-play battle royale isn't arriving until November 16.\n\nModes in Modern Warfare II are broken down into two categories: Core Map modes and Battle Map modes. Core Map modes are smaller, 6v6 combat zones players familiar with the series are no doubt accustomed to. Battle Map modes, however, are built for 32v32 game types and include vehicles.\n\nAnd sticking with the multiplayer news, a recent job listing at Naughty Dog might be pointing towards the untitled The Last of Us multiplayer title being free-to-play.\n\nAs spotted by Reddit user JadedDarkness, shared to the GamingLeaksAndRumours subreddit, a live ops producer role posted by Naughty Dog seems to suggest that the studio's multiplayer The Last of Us game might be free-to-play. In the bonus skills section, one of the points listed reads, \"Proven experience in a production role supporting a AAA, free to play, live title.\"\n\nNaughty Dog hasn't announced a free-to-play title, but last year the studio was looking for an economy designer for a multiplayer game with live service elements, which was prior to the official reveal that The Last of Us multiplayer would be a standalone title. Considering Sony has plans to launch 12 live service games by 2025, a free-to-play, multiplayer The Last of Us would fit quite nicely in there.", "link": "https://www.youtube.com/watch?v=yMMOO0-E9xs", "date_published": "2022-10-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Callisto Protocol Isn't Just Another Dead Space", "description": "GameSpot had the opportunity to check out Striking Distance's survival horror game, The Callisto Protocol. Jordan played for around 90 minutes, and it didn't end up being as scary as he expected.\n\n#gaming #thecallistoprotocol #gamespot", "link": "https://www.youtube.com/watch?v=Uy-qYqaz9FU", "date_published": "2022-10-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Age of Empires 25th Anniversary Livestream", "description": "Celebrate 25 years of Age of Empires with a special Anniversary Broadcast featuring announcements, trailers, and some surprises!\r\n\r\n#ageofempires #gaming", "link": "https://www.youtube.com/watch?v=FUcEToqYAOE", "date_published": "2022-10-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Bayonetta 3 Everything To Know", "description": "Bayonetta, the angel-hunting umbra witch is back for her 3rd installment in the much beloved PlatinumGames title. With the planned release date of October 28, 2022 fast approaching, here is Everything You Need to Know about Bayonetta 3.\n#bayonetta #bayonetta3 #gamespot \n\nThe original Bayonetta was created and directed by Hideki Kamiya. The same man behind Devil May Cry, and the advent of the arcadey combo-heavy 3D action game style. So, after creating a 2D game in a similar style via Viewtiful Joe, Kamiya created what would become another beloved combo-heavy action game -  Bayonetta.\nBayonetta took what Devil May Cry started, and added a stylistic new protagonist in its titular character, as well as stand out, gigantic boss fights. Her clothing is her hair, which she also uses for magic and to summon demons, and there’s overt sexual overtones throughout.\nBayonetta 3 releases October 28, 2022\n\nTimestamps:\n0:00 - Intro\n0:18 - Development\n1:46 - Gameplay\n4:58 - Story\n5:36 - Controversy\n8:08 - Release Date", "link": "https://www.youtube.com/watch?v=yNdtz6JAc6w", "date_published": "2022-10-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Free PS Plus For November 2022 Leaked | GameSpot News", "description": "November’s free games for PlayStation Plus and Amazon Prime Gaming have reportedly leaked. \n#GamingNews #PSPlus #PS5 \n\nNioh 2 is a yokai-slaying action game from Team Ninja that combines the pinpoint swordplay of Ninja Gaiden with the mechanics of Dark Souls. If you're up for that sort of thing, it's one of the best Souls-likes around, and is definitely worth a look. Both the PS5 and PS4 versions of Nioh 2 will be free.\n\nThe Lego Harry Potter Collection is not the most recent Lego video game out there, as it was released in 2016, but it's regarded as one of the best by reviewers and fans alike. This collection combines Years 1-4 and Years 5-7 into one game. If you've already blasted your way through the recent Lego Star Wars: The Skywalker Saga, it's a good next step.\n\nThe physics-based puzzle game Heavenly Bodies rounds out November's selection of games. It allows players to explore a zero-gravity environment, solve puzzles, and collect space goodies. The PS5 and PS4 versions of Heavenly Bodies will be available to claim.\n\nFallout: New Vegas is developed by Obsidian Entertainment originally released in 2010 for consoles and PC. New Vegas improved on the gameplay systems presented in Fallout 3 and offered a wider mission variety. With a huge open world and a huge collection of sidequests, New Vegas was engaging even after completing the main campaign.", "link": "https://www.youtube.com/watch?v=ColqiVPm2gk", "date_published": "2022-10-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War Ragnarök | Combat and Enemies Official 4K Dev Overview", "description": "We’re heading to Alfheim, land of the elves, for Episode 2 of the God of War Ragnarök Behind the Scenes series. \n\nThis episode will explore how the team at Santa Monica Studio is elevating the fluid and expressive combat of God of War Ragnarök, as well as the importance of building a unique, memorable, and varied cast of enemies for players to test their skill against. \n\nGod of War Ragnarök is coming to PS4 and PS5 on November 9th!\n\n#GodOfWar #GodOfWarRagnarok", "link": "https://www.youtube.com/watch?v=ycuyY_B5qAc", "date_published": "2022-10-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Scarlet & Violet | Introducing Greavard Official HD Trailer", "description": "Greavard is so affectionate that paying it any attention will make it so happy that it will follow you wherever you go. However, Greavard will slowly and inadvertently absorb the life-force of those around it. \n\n#Pokemon #PokemonScarletAndViolet #Greavard", "link": "https://www.youtube.com/watch?v=S7VYm7T3chU", "date_published": "2022-10-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Scarlet and Violet Ghost Hunt Cinematic Trailer", "description": "A student from the Paldea region just uploaded this footage of their search for Ghost-type Pokemon.\n\n#Pokemon #PokemonScarletAndViolet #GhostHunt", "link": "https://www.youtube.com/watch?v=ma2q9yYj_XM", "date_published": "2022-10-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Redfall - Into the Night Official 4K Trailer", "description": "Halloween tastes different here. What better way to get into the spirit than with a brand new trailer highlighting some of the game’s creepiest bloodsuckers. From the devious Angler to the ever-vigilant Watcher, this is just a bite of what you and your squad will face as you fight to take back Redfall.\n\nRedfall arrives exclusively on Xbox Series X|S and PC in 2023. Play it day one with Game Pass.\n\n#Redfall #Bethesda #Gaming", "link": "https://www.youtube.com/watch?v=BhvYVwT4uW0", "date_published": "2022-10-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village: Winters' Expansion Review", "description": "New additions to The Mercenaries make the Winters' Expansion for Resident Evil Village worthwhile, but Shadows of Rose is a fleeting slice of forgettable story DLC.", "link": "https://www.youtube.com/watch?v=E14vZquDMEM", "date_published": "2022-10-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]