[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "E3 2022 Officially Canceled | GameSpot News", "description": "E3 is officially canceled, Xbox Game Pass could be getting a family plan and Battlefield 2042 is getting major map changes. \n\nA spokesperson for the ESA told VentureBeat that E3 will return in 2023 with a \"reinvigorated showcase that celebrates new and exciting video games and industry innovations.\" While E3 2022 may not be going ahead, Geoff Keighley's annual Summer Game Fest is coming back this year, though there are no details yet regarding the specifics of the show.\n\nAccording to a report from Windows Central, Microsoft has wanted to create a Family Plan.\nThis plan will reportedly use Microsoft's Family Account system already in place for Office 365, and up to five players within the same country can share a subscription.\n\nIn a new blog post, Battlefield community lead Adam Freeman outlined all the feedback DICE has gathered from the game's community and the changes it will be making as a result, with most of those initially revolving around Battlefield 2042's Renewal and Kaleidoscope maps. All of those concerns are being addressed and will be coming in the near future.\n\nSTAMPS\n00:00 - Intro\n00:06 - E3\n01:41 - Xbox Game Pass\n02:50 - Battlefield 2042", "link": "https://www.youtube.com/watch?v=7COOpWTjS-g", "date_published": "2022-03-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New PS Plus Feels Boring Compared to Xbox Game Pass", "description": "GameSpot's console crew Lucy, Tamoor, and Jordan, break down why Sony's new PlayStation Plus tiers aren't setting the gaming world on fire.\n\nLearn more about what the crew think of this new subscription service from Sony.\n\n#PlayStationPlus #GamePass\n\nAfter months of speculation, PlayStation has finally announced changes to its PlayStation Plus scheme. PS+ will now offer three tiers: PlayStation Plus Essential, which is akin to the current PS Plus subscription, PS Plus Extra, which offers a library of 400 PS4 and PS5 games to download and play, and the most expensive tier, PS Plus Premium, which offers an additional 350 games from the PlayStation, PS2, PS3, and PSP libraries. \n\nComparisons are already being made to Xbox Game Pass, Microsoft's subscription service that offers a rotating catalogue of over 100 games, and day one releases of major Xbox titles. So we gathered GameSpot's trusty Console Crew: Tamoor Hussain, Jordan Ramée, and Lucy James to discuss the pros and cons of PlayStation's new tiers, and the gang are... not exactly impressed. \n\nFor more on changes to PlayStation Plus, as well as updates as to the games leaving and joining Xbox Game Pass, make sure to keep your eyes on GameSpot.", "link": "https://www.youtube.com/watch?v=36GViN7DMZQ", "date_published": "2022-03-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Warhammer 40,000: Darktide - Release Date Trailer", "description": "Warhammer 40,000: Darktide will release September 13, 2022, on PC and Xbox series X|S. \n\nFight together with your friends against hordes of enemies in this new Warhammer 40,000 experience. From the developers of the best-selling and award-winning co-op action franchise Vermintide, Warhammer 40,000: Darktide is a visceral 4-player co-op action game set in the hive city of Tertium.", "link": "https://www.youtube.com/watch?v=0Q_cbBr_t0M", "date_published": "2022-03-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "9 Biggest Game Releases for April 2022", "description": "So far, 2022 has been a great year for games. This means you’ve probably had some awesome experiences, but you probably also have a handful of new additions to your backlog. Not to worry though because even though April has some great games as well, it's a little slower than January thru March.  \n\nHere are all the big games you can look forward to playing in the month of April\n\nSTAMPS\n00:00 - Intro\n00:24 - LEGO Star Wars: The Skywalker Saga\n01:17 - MLB The Show 22\n01:59 - Chrono Cross: The Radical Dreamers Edition\n02:42 - The House of the Dead: Remake\n03:39 - 13 Sentinels: Aegis Rim\n04:33 - Star Wars: The Force Unleashed\n05:08 - MotoGP 22\n05:45 - The Serpent Rogue\n06:19 - Nintendo Switch Sports", "link": "https://www.youtube.com/watch?v=m_E-0--duiI", "date_published": "2022-03-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring - 10 MORE Things You Didn't Know", "description": "Our Soulsborne expert Dave Klein is here with another ten things about Elden Ring. At this point, episode five will be getting into some late game content, so you have been warned for potential spoilers! Did you know you can use Mohg's Shackle on Mohg, Lord of Blood? What about Ruins Greatsword, one of the best colossal swords? Or the secret in Sellia, Town of Sorcery? And why is the big jellyfish in Stargazer's Ruins so sad?\n\n#EldenRing\n00:12 - Stargazers’ Ruins\n01:16 - Margit’s Shackle can be used again\n01:51 - The Purifying Crystal Tear\n03:24 - The other Mohg Strategy\n04:18 - Redmane Castle Ain’t Over Yet\n05:15 - Distinguishing Mausoleums\n06:05 - The Secret of Sellia\n06:47 - Two Mohgwyn Palace Entrances\n07:47 - The Hermit Village\n08:37 - Exploding Concoctions", "link": "https://www.youtube.com/watch?v=rRfDsgne_tU", "date_published": "2022-03-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Free PS Plus Games For April Confirmed! | GameSpot News", "description": "Sony confirmed April’s free PlayStation Plus games, Persona 5 will be leaving the PS Plus Collection in May, and Halo Infinite Season 2 details are on the way.\n#GamingNews #PS5 #HaloInfinite \n\nSony has officially confirmed the PlayStation Plus lineup for April 2022 following a leak. The games being offered are the platformer SpongeBob SquarePants: Battle for Bikini Bottom Rehydrated, the online multiplayer Hood: Outlaws & Legends, and the deck-building Slay the Spire. \n\nHead of creative at 343 Industries, Joseph Staten, says fans can expect new details on what's next for Halo Infinite \"really soon.\" Staten also stressed that 343 Industries wants fans to be able to rely on whatever new information the team puts out in regards to Halo Infinite.\n\nSTAMPS\n00:00 - Intro\n00:08 - PS Games\n01:09 - Persona 5\n01:51 - PS Plus Changes\n02:30 - Halo Infinite", "link": "https://www.youtube.com/watch?v=z95a4NwAM80", "date_published": "2022-03-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PS Plus Vs Xbox Game Pass: Price, Features & Games Differences", "description": "Sony has finally announced its new version of PlayStation Plus, which combines PS Plus and PS Now into a single offering with additional, more expensive tiers available for those seeking extra benefits. Let's compare it to Microsoft's Xbox Game Pass to see how the two popular membership programs in the console space match up. \n\n#PlayStation #Xbox\n\nAfter months of speculation, Sony has finally and formally announced the changes it will be making to its PlayStation Plus online service. Launched in 2010, PS Plus has offered free games, cloud storage, access to multiplayer, and discounts on items available on the PlayStation Store. Ever since Xbox launched Game Pass, its subscription service that allows players to download and play games from a rotating catalogue of titles, people have been asking if PlayStation would change PlayStation Plus to compete. \n\nIn this video, we break down the three tiers of the new PlayStation Plus: PlayStation Plus Essential, PlayStation Plus Extra, and PlayStation Plus Premium, and compare their pricing, the games available at each tier, and other benefits, like streaming PlayStation, PS2, PS3, PS, and PSP games. We also compare it to Xbox Game Pass Ultimate's offerings, which allows players to play on both an Xbox console and PC, as well as use xCloud streaming technology to play games. \n\nThe changes to PlayStation Plus will be rolling out in June 2022, for more on the changes to the service, as well as the list of the games that will be available, make sure you subscribe to GameSpot. \n\nTimestamp\n0:00 - Intro\n0:50 - Pricing\n1:37 - PS Plus Benefits\n3:18 - Game Pass Benefits\n4:36 - The Games\n5:40 - Day One Releases\n7:33 - Outro", "link": "https://www.youtube.com/watch?v=Zln8xwgISYg", "date_published": "2022-03-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]