[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCG2kQBVlgG7kOigXZTcKrQw", "title": "Pieniny Jesienią! Samotnie przez pienińskie szczyty. PIEKNIE, ŻE HEJ! 🚶‍♂️🐑 Silent Hiking", "description": "Kurs filmowo-montażowy 🎬 https://www.kursfilmowaniaimontazu.pl/\nDodatek Podróżniczy 🎬 http://filmypodroznicze.pl/\nFilmowy klaps info 🎬 https://youtu.be/5sw6a9UgHEA\n\n\nPiekne te Pieniny, przyznajcie!  Będzie już chyba z 3 lata jak byłem tutaj ostatnio. Spędziłem na potrzeby tego filmu w Pieninach 8 dni i nie ukrywam, że głównym powodem mojej obecności tutaj była Pienińska Jesień. Baza kolorów została zaktualizowana :D\n\nW końcu zapraszam na wyjątkowo widokowy i klimatyczny film w stylu Silent Hiking. Odwiedzimy sobie mnóstwo ciekawych i pięknych miejsc - także tych nieznanych. Polecam oglądać do kawy, obiadu, w ciszy i spokoju. No i podajcie też dalej! Będzie mi mega miło.\n\nSPROSTOWANIE 😌 \nJako, że internet nie pyta, tylko od razu ocenia, kilka słów na temat \"drażliwych\" tematów i zarzutów w moją stronę, jakie pojawiły się po tym  filmie. W punktach\n1. Nie zaśmiecam parku naklejką. Jest to zabawa prowadzona z widzami od lat. Odklejacie naklejki, za co dostajecie czapki. Ta naklejka zniknęła dzień po jej naklejeniu i ponad tydzień przed publikacją. Nie zostawiła śladu, bo dbam o to, aby nie było na niej praktycznie kleju(pocierając o ubranie).  Może zamiast pisać, że promuję zaśmiecanie (co jest błędem, bo w wielu filmach namawiam do zbierania śmieci po innych), to może lepiej byłoby napisać, że promuję odklejanie naklejek? Bo o to w tej zabawie chodzi.\n\n2. Wychodzenie poza wyznaczony szlak. Istotnie tak to może wyglądać na kilku ujęciach (np. z barierkami), jednak musicie mi uwierzyć, że jest to tylko i wyłącznie efekt filmowo-montażowy i wynik odpowiednio zastosowanych tricków. Tak tylko przypomnę, że trochę się na tym znam i nie jest to w ogóle trudne do wykonania. Czy słusznie? Chyba nie. Może faktycznie było to głupie z mojej strony, jednak siedząc namintażu miałem ochotę zrobić sobie takie \"ujęcia\" jak np. to siedząc nad przepaścią, czy poza barierkami, jednak finalnie mnie tam nie było. Przepraszam za to, to było widocznie zbędne.\n\n3. Dron w parku. Wszystkie ujęcia wykonane były podczas lotów na granicy Parku, poza strefą. Niektóre mogą\n wydawać się jakoby było inaczej, jednak to również jest wynik odpowiedniego kadrowania, a przede wszystkim optyki obiektywu, który ma możliwość zastosowania dłuższej ogniskowej (tzn. przybliżania).Autorem części ujęć i fotografii też nie jestem ja sam.\n4. Pies na terenie Parku/bez smyczy. Pieska nie znam, właścicieli rowniez. Pies nie jest nasz, biegł przez kilka godzin na równi z nami co też wykorzystałem do kilku ujęć. Podobnie jak wiele innych zwierząt w tym odcinku.\n5. Chodzenie po zmroku. Tutaj faktycznie wyszedłem 30 minut przed wschodem słońca i nie dążyłem wrócić raz przed zachodem. uważam, że nie jest to jakieś wielkie przestępstwo, ale jeśli ktoś jest innego zdania, to przepraszam. biorę odpowiedzialność za to na siebie.\n\nTo tyle\n\n Mam nadzieję, że spoko! Z góry dzieki za posłanie filmu dalej, szczególnie, że niestety będzie mniej filmów w najbliższym czasie.", "link": "https://www.youtube.com/watch?v=-rnOA15sbUg", "date_published": "2022-10-26 15:17:28+00:00", "persistent": false, "user": null, "language": "pl-PL"}]