[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Viral secrets", "description": "Virus secrets, some known unknowns\n\nhttps://www.washingtonpost.com/health/2022/09/26/covid-questions-variants-long-covid/?utm_campaign=wp_to_your_health&utm_medium=email&utm_source=newsletter&wpisrc=nl_tyh\n\n6.5 million deaths, 16% in the US\n\nResearchers, more than 200,000 studies\n\nFour times the number on influenza in the 100 years\n\nWhere did the virus come from, and why has it been so successful?\n\nVincent Munster, virus ecology, Rocky Mountain Laboratories, National Institute of Allergy and Infectious Diseases\n\nWe’ve now identified 20 or 30 of these viruses that all look very similar, but they are not the same. What is the true hideout place of the progenitor of SARS-CoV-2\n\nEscape from a lab\n\nVirus evolved in nature and was being studied\n\nVirus was created in the lab by researchers\n\nHow does it mutates so rapidly?\n\n(proofreading systems)\n\nImmune compromised people\n\nReverse zoonosis\n\nhttps://www.cdc.gov/coronavirus/2019-ncov/daily-life-coping/animals.html\n\nhttps://www.biorxiv.org/content/10.1101/2022.02.22.481551v1.full\n\nVirus found in 29 other animals so far\n\nMink, hamsters, mice, white-tailed deer, cats, dogs, ferrets, lions, tigers, snow leopards, otters, non-human primates, hyenas, hippopotamuses, and manatees.\nmule deer, a black-tailed marmoset, a giant anteater\n\nMassively variable clinical picture?\n\nWhy are older people effected more and children and the young protected?\n\nWhy is it better to be 1 than 50?\n\n1918 flu pandemic\n\nHighest mortality rates, children 5 and under, adults 20 to 40, 65 and older\n\n1957 flu pandemic, Increases in the mortality rate relative to baseline\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC4747626/\n\nGreatest in school-aged children, young adults, elderly population\n\nSomething to do with mucosal immunity and interferons?\n\nhttps://www.nature.com/articles/s41586-021-04345-x\n\nGenetic variation\nAssociation Between the LZTFL1 rs11385942 Polymorphism and COVID-19 Severity in Colombian Population\nhttps://pubmed.ncbi.nlm.nih.gov/35795626/\n\nGenetic and non-genetic factors are responsible for the high interindividual variability in the response to SARS-CoV-2. \n\nhttps://support.google.com/youtube/answer/9891785\nContent that claims that any group or individual has immunity to the virus or cannot transmit the virus\nWhy do some people develop long covid?\n\nWhy does covid severity differ by age and from one person to another?\n\nSelf-reported long COVID more common\n\nhttps://www.ons.gov.uk/peoplepopulationandcommunity/healthandsocialcare/conditionsanddiseases/articles/coronaviruscovid19latestinsights/infections\n\naged 35 to 69 years\n\nfemales \n\npeople living in more deprived areas \n\nthose working in social care\n\npeople not looking for work (less common in people looking for work)\n\nanother activity-limiting health condition or disability   \n\nAs time goes by\n\nBill Powderly, Division of Infectious Diseases, Washington University School of Medicine, St. Louis.\n\nThe virus is becoming more infectious but less dangerous for the majority of people\n\nBut we’ve no guarantee that the virus wouldn’t develop additional mutations that would eventually make it more virulent in the future", "link": "https://www.youtube.com/watch?v=Eg0r2z5tX0c", "date_published": "2022-10-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]