[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Biggest Game Releases For October 2022", "description": "Spooky season is officially here! And there is nothing spookier than being haunted by the September games you didn’t finish yet. Here are 10 of the biggest games releasing in October 2022. \n#ModernWarfare2 #Overwatch2 #Gamespot\n\nModern Warfare 2 follows three years after the events of MW 2019, with Captain Price's Task Force 141 now fully formed and operating around the world. Price is joined by the iconic characters of Simon \"Ghost\" Riley, Kyle \"Gaz\" Garrick, and John \"Soap\" MacTavish, but this newly assembled Task Force 141 also includes a new character known as Alejandro Vargas.\n\nOverwatch 2 is the sequel to 2016’s Overwatch and will include some new takes on the combat we saw in the original game. That includes a brand-new game mode called Push, in which two teams fight to escort a robot into enemy territory, as well as the game’s switch to 5v5 matches instead of the original game’s 6v6 model. Team composition is also being adjusted so that teams only contain one tank character so plan accordingly when assembling your friends to play.  \n\nWhile its predecessor saw Mario and company in familiar territory as the Rabbids were transported to the Mushroom Kingdom, that won't be the case in Mario + Rabbids Sparks of Hope. The adventure will take our heroes across multiple planets as they work together to stop an \"evil influence”. Sparks of Hope combines free-roaming exploration with turn-based combat. While wandering each planet, you're free to move as you wish in order to solve puzzles and uncover secrets and collectibles. Once you make contact with an enemy, however, the game switches to a turn-based strategy system. \n\nSTAMPS\n00:00 - Intro\n00:12 - Call of Duty: Modern Warfare 2\n01:47 - Overwatch 2\n03:11 - Mario + Rabbids: Sparks of Hope\n04:23 - Scorn\n05:18 - Gotham Knights\n06:03 - Bayonetta\n07:17 - A Plague Tale: Requiem-\n08:15 - Dragon Ball: The Breakers\n09:05 - NHL 23\n10:09 - RE Village Winter Expansion", "link": "https://www.youtube.com/watch?v=G9_Bi5ldwsc", "date_published": "2022-10-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "FIFA 23 Review", "description": "FIFA 23 makes incremental improvements to last year's game, but the looming presence of Ultimate Team's microtransactions cast a shadow over everything.\n#FIFA23 #gamespot #EASports \n\nFIFA 23 marks the end of an era for the long-running series. After an almost 30-year partnership that began with players like David Platt gracing the cover, EA Sports has parted ways with football's governing body over a licensing disagreement. Future games in the series will now drop the FIFA name in favor of a new EA Sports FC moniker. Not that you'd be able to tell from playing FIFA 23, mind you. Despite being the last game adorned with the household name, it's business as usual both on and off the pitch for EA's latest footballing sim. There are a few new additions spread across its various game modes--and Ultimate Team sees its most significant change in years--but for the most part, FIFA's swansong is a game of minor iterations.", "link": "https://www.youtube.com/watch?v=PyQy6Bs6WUQ", "date_published": "2022-10-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Foxhole’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Foxhole, including the Aalto Storm Rifle, the Neville Anti-Tank Rifle, and a whole squadron of Storm Cannons.\n\n00:00 - Opening\n00:46 - Argenti r.II\n02:20 - Neville Anti-Tank Rifle\n03:54 - Catara mo.II\n05:13 - No.2 Loughcaster\n06:33 - Cremari mortar\n08:01 - Cutler Launcher\n08:54 - Malone MK2\n10:09 - Dusk ce.III\n11:46 - Fiddler SMG Model 868\n12:56 - Lamentum mm.IV\n14:28 - Aalto Storm Rifle\n15:43 - Lionclaw MC VIII\n16:46 - Storm Cannon\n18:23 - Flamethrowers\n19:43 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Foxhole and compares them to their real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=3CdzVU6c5dQ", "date_published": "2022-10-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "18 Things You Didn't Know About Modern Warfare 2 Multiplayer", "description": "Call of Duty: Modern Warfare 2’s sandbox is shaping up in both familiar and unexpected ways, and there’s a lot you can do that you might not know.\n\nIntro - 00:00\nYou played Warzone Already! How Was It? - 00:20\nAttention To Detail Baby - 01:02\nStabby - 01:32\nSo Much Around Vehicles - 01:51\nHang On - 02:30\nHop On - 02:48\nShell Game - 03:00\nGadgets Have Other Modes Uses - 03:28\nDrone Bomber - 04:23\nFrisbee Golf - 04:39\nLearn The Routes - 04:48\nMaster Your Inner Dolphin - 05:05\nSide Chute - 05:19\nFirst Downgrades? - It’s A Beta - 05:34\nWorking As Intended? Maybeeee? - 06:28\nDrill Baby Drill - 07:08\nKillstreaks Kill Killstreaks - 07:42\nThe Eye Of Sauron - 08:16", "link": "https://www.youtube.com/watch?v=4PqFnZWCfQY", "date_published": "2022-09-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 Players Want Stadia Cloud Saves | GameSpot News", "description": "Cyberpunk 2077 fans are asking for cloud saves on Stadia and other developers are reacting to the news of the service coming to an end.\n#GamingNews #Cyberpunk2077 #Stadia\n\nIf you missed it, Google announced that its cloud streaming service Stadia will officially be shut down on January 18, 2023. All Stadia hardware purchases made through the Google Store will be refunded, including games and add-on content purchased from that specific storefront. \n\nCyberpunk 2077 is one of the games that has been available to Stadia gamers since launch, but with the service’s looming doom, that means lots of fans may have to start their journey in Night City all over again. Over on the Stadia subreddit, one user asked CD Projekt Red to add cloud saves to the Stadia version of Cyberpunk and added “I care more about my save game than a game refund.” \n\nOther members of the community came to the rescue, suggesting the use of Google Takeout, a service that allows users to grab data from Google services, to download the save files for import into Steam or GOG. There are a number of replies in the thread confirming that this method works, but there are also a good handful of users having trouble with the work around as Stadia was failing to show up in their Takeout menu.  \n\nAt the time of this recording there is no word from CDPR about the possibility of cloud saves for Stadia’s version of Cyberpunk, but January is still a couple months away so anything can happen. For now, if you happen to be dealing with this issue, keep giving Google Takeout a try with your fingers crossed.", "link": "https://www.youtube.com/watch?v=GbOUrv50GxE", "date_published": "2022-09-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 - Everything To Know", "description": "Huge changes, never-before-seen characters, mythic skins, hero missions, and a new free-to-play model? Here's everything you need to know about Overwatch 2.\n#gaming #blizzard #overwatch2 \n\nOverwatch 2 will introduce new playable heroes every other season--or approximately every 18 weeks. These will include both characters that are brand new and “characters you’ve been waiting for.” It will also carry over every hero from the first Overwatch. \nConfirmed heroes new to Overwatch 2 include:\n\nSojourn\nJunker Queen\nKiriko\n\nDescribed as a mid-range specialist with incredible mobility and artillery skills, Sojourn's primary weapon is a railgun that generates energy on each successful hit and can then consume that power for a high-impact shot. This makes Sojourn well-suited for players with marksman skills, as they can use that accuracy to deal devastating blows with the railgun's secondary fire mode.\n\nIn addition, Sojourn also has an area-of-effect ability that will snare enemies and eat away at their health, a rocket-powered slide, and an ultimate ability called Overclock. During Overclock, Sojourn can fire shots that pierce through enemies. Secondary fire on the railgun enables her to quickly eliminate enemies with high-powered shots, which Blizzard likened to a \"hitscan version\" of a Genji's Dragon Blade attack.\n\nTeased for years by Blizzard, Junker Queen is the not-so-benevolent ruler of Junkertown. Equipped with a mohawk, six-pack abs, a shotgun, and a battle ax, Junker Queen is the game's newest tank, and seems more than capable of leading her team to victory.\n\nDescribed as a fierce and resourceful survivalist, Junker Queen's play kit perfectly showcases her will to not only survive but thrive in the harsh, Australian outback. Her passive ability allows her to heal her wounds over time by dealing damage to other players, encouraging those playing Junker Queen to adopt a more aggressive playstyle.\n\nIn addition, many of Junker Queen's moves are most impactful at close-range, including Scattergun and Carnage. Scattergun refers to Junker Queen's powerful shotgun blast, while Carnage is the name given to her big, sweeping ax swing.\n\nCommanding Shout sees Junker Queen increase the health and movement speed of herself and the teammates around her, similarly to Lucio. Junker Queen's ultimate ability, Rampage, allows the tank to lunge toward her opponents using her magnetic gauntlet. Once there, she also prevents her enemies from healing, making Rampage the first ability since Ana's biotic grenade to apply an anti-heal.\n\nKiriko is the final hero coming to the game at launch, and is a healer with a DPS edge. Called the \"Protector of Kanezaka,\" Kiriko is a Japanese ninja who trained alongside Hanzo and Genji under the tutelage of her mother--though she is much younger (and feistier) than the pair. Much of Kiriko's abilities come from her use of spiritual objects associated with Shintoism, such as ofuda and suzu, and her character as a whole represents the merging of the spiritual world with \"youthful intelligence.\"\n\nAs for her moveset, Kiriko's primary ability is to heal. She does this by sending homing ofuda--paper talismans offering the wielder protection--to her teammates.Her secondary ability sees her precisely aim and throw her kunai, giving her an edge of lethality that rivals actual DPS characters. She also has the Protection Suzu ability, which sees her ring a Suzu--or Shinto bell--and \"cleanse\" an area of debuffs and potentially devastating attacks. These attacks include Sombra's hack, Reinhardt's Shatter, Ashe's Burn, Ana's Sleep Dart, and Junkrat's RIP-Tire.\n\nSwift Step allows Kiriko to see her allies through barriers in order to teleport beside them, making her the first character in Overwatch who can phase through walls. Her ultimate, Kitsune Rush, summons a spirit fox to guide her teammates and provide them with accelerated movement speed, attack speed, and cool-down rates. \n\nTimestamps: \n00:12 - Free-to-Play\n00:56 - Battle Pass\n02:06 - Challenges\n02:35 - Maps and Modes\n03:24 - Ping System\n03:48 - PvE\n04:40 - Item System\n05:13 - Talent System\n05:44 - New Heroes\n09:49 - Skins and Progress\n10:18 - Mythic Skins\n10:38 - Hero Redesigns\n12:15 - Release Date", "link": "https://www.youtube.com/watch?v=pPEDqr0LLVc", "date_published": "2022-09-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]