[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To MORE Valorant Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down more of the weaponry of Valorant, including the Sheriff revolver, the Odein machine gun, and the Operator sniper rifle.\n\n00:00 - Opening\n00:42 - Classic\n03:12 - Stinger\n04:51 - Operator\n07:18 - Guardian\n10:24 - Odin\n14:36 - Sheriff\n17:33 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down more of the guns of Valorant and compares them to their potential real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=BJ5tDVExpzs", "date_published": "2022-07-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "IST - BOTW's Most Powerful Glitch Of 2022 Explained", "description": "Breath of the Wild's newest discovery, IST, or Inventory Slot Transfer, is the newest key to unlocking Nintendo's secrets, such as creating the patched Ice Cream elixir, duplicating items, exploring the end of the game, and finally modifying weapons in powerful ways.\n\n#gaming #breathofthewild #glitch\n\nFound first by zxrobin, Inventory Slot Transfer can manipulate the menu and inventory items in ways never seen before. This leads to incredible abilities, starting from basic item duplication, to duplicating stamina meals hundreds of times for endless stamina, create tens of thousands of fairies and become invincible to never care about being hit again, even glitch the save prompt using Save Prompt Storage into cutscenes to save and load into that cutscene, and explore a peaceful liberated Hyrule, with calamity’s pillars blue and a malice-free world, the last canon state of Hyrule before Breath of the Wild 2. But that's not even the best part, we’ve finally accessed the world of customizing weapon modifiers and putting them on weapons normally impossible, and unlock official modifiers Nintendo never released, like 10 wide shot bows, 10 linear shot bows, This is the closest we can get to activating cheats in Breath of the Wild, and there is likely more to be found with this massive glitch in the future. \n\nTimestamps:\n0:00 Intro\n0:26 What it's capable of\n1:27 WARNING\n2:37 How to do base IST\n5:26 IST Explained\n8:08 Outro", "link": "https://www.youtube.com/watch?v=mbthdP2SkNA", "date_published": "2022-07-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Soulframe Reveal Trailer", "description": "Digital Extremes the makers of Warframe have revealed a brand new game Soulframe today during Tennolive 2022. Get a glimpse of this new game in this reveal trailer.\n\n#soulframe #warframe #gaming", "link": "https://www.youtube.com/watch?v=rrMGRvuxsuA", "date_published": "2022-07-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "TennoLive | TennoCon 2022", "description": "TennoLive is TennoCon's main event! A celebration of all things Warframe with the year’s biggest reveals, including a look into the world of Duviri. Tune in at 2pm PT / 5pm ET.\r\n\r\n#gaming #warframe #tennocon", "link": "https://www.youtube.com/watch?v=u0qtfJdAbkk", "date_published": "2022-07-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Warframe The Duviri Paradox Gameplay Demo", "description": "Check out the opening mission for the Duviri Paradox coming to Warframe in the Winter of 2022. This was showcased during Tennolive 2022.\n\n#warframe #gaming #duviriparadox", "link": "https://www.youtube.com/watch?v=khLnxmYkZJs", "date_published": "2022-07-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Bayonetta 3: Everything We Know So Far", "description": "Bayonetta 3 had a spicy new trailer revealing the official release date for the game. In this video we break down everything you need to know about the latest Nintendo Switch exclusive.\n\n#gaming #bayonetta3 #gamespot\n\nBayonetta 3 has been one of the most-anticipated games for Nintendo Switch for several years. It was announced way back in 2017 at The Game Awards and since then all we’ve gotten were ports of the first two games. We finally got to see the game in action in Summer 2021, assuring us that it wasn’t vaporware, but still most of the game's features remained a complete mystery.\n\nThat is until recently when Bayonetta 3 finally got a release date and some shiny new info for fans to feast on.    \n\nIn Bayonetta 3, the Umbra Witch teams up some familiar faces, as well as a new one named Viola, in order to put an end to the terror of the mysterious evil known as Homunculi. These new baddies are considered man-made bioweapons and according to Viola, hope for defeating them lies with a scientist named Sigurd. As far as who Viola is, very little is still known, but the release date trailer does hint at a connection between the character and Luka. But I’m sure we’ll have plenty of time to uncover everything about Viola as she is a playable character that wields a sword and has a cat companion named Cheshire.   \n\nAside from Luka, some of those other familiar faces you can expect to see include: Jeanne, Rodin, and Enzo. \n\nAnd that’s pretty much all we’ve been given in terms of plot, as developer Platinum Games has remained tight-lipped about many details for years. However, we can confirm some of the locations players will visit in Bayonetta 3 include Tokyo and China. As for why the game’s main character is taking out enemies in the middle of the Shibuya District, fans have their theories, but we’ll have to wait for the official word from Platinum before diving into all of that.\n\nTimestamps: \n0:00 Intro\n0:35 Plot\n1:43 Gameplay\n2:56 Development Team\n3:57 Release", "link": "https://www.youtube.com/watch?v=I1Td5VTLJKU", "date_published": "2022-07-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Exoprimal Hands-On Preview", "description": "Capcom's third-person multiplayer game is a thoughtful cooperative shooter that puts a premium on teamwork and team composition.\n#gaming #capcom #exoprimal \n\nWe played about three hours of Exoprimal during its recent closed network test, which gave a sense of some of its multiplayer modes and the mech suit character classes you can use within them. While matches involve fighting off waves of prehistoric creatures, your actual goal is to beat another team of exosuit-wearing dino hunters.\n\nThough we only played for a few hours and saw only a small portion of what Exoprimal has to offer, overall, the game offered a lot of goofy, over-the-top fun in this technical test. Developer Capcom's approach to team-based gameplay uses a lot of tried-and-true ideas borrowed from other games to great effect, and fighting huge dinosaurs is just as cool and pulse-pounding as it sounds. The PvP aspects might not be quite as solid when it comes to class mechanics, but they can definitely be just as exciting and engaging, especially with a smart, communicative team. \n\nExoprimal is a surprisingly fun and smart team-based shooter with a lot that works--it'll be fascinating to see just how well the game works when all its components are offered to players.\n\n\nTimestamps:\n00:00 - Intro\n00:48 - Dino Survival mode\n01:45 - Exosuits\n03:19 - T-Rex and Triceratops\n04:50 - PvP battles\n08:44 - Neo T-Rex", "link": "https://www.youtube.com/watch?v=MEIkK11k09U", "date_published": "2022-07-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God Of War Ragnarök Collector's Editions Snatched Up By Resellers | GameSpot News", "description": "God of War Ragnarok Collector's Editions are hard to come by, Secret Lab creates an Assassin's Creed chair, and gaming merch for your cat is incoming.\n\n#Gaming #GodofWarRagnarok #AssassinsCreed \n\nThe God of War: Ragnarök collector’s editions are on sale, but can you get your hands on one? Plus, more stuff to buy, including a new Secret Lab chair and Stray merch for your cat. All this on today’s GameSpot News.\n\nEarlier today, the Collector’s and Jötnar editions of God of War: Ragnarök went on sale at various retailers, but in traditional limited edition fashion, it seems like they’ve sold out fast. While inventory has fluctuated across various retailers, many would-be purchasers are reporting that they’re unable to acquire the highly coveted physical collections.\n\nOf course, where there’s thunder, there’s lighting, AKA resellers, with listings of the most premium Jötnar edition listed for hundreds of dollars more on eBay.\n\nThinking of putting down the money on one of the two deluxe releases? Here’s what you need to know. The Collector’s Edition retails for $200, including a 1:1 scale replica of Thor’s hammer Mjölnir, Dwarven Dice, Vanir Carvings, and a steelbook case. The $260 Jotnar edition includes all that, plus a 7 inch vinyl of the game’s soundtrack, a cloth map of the in-game world, a ring, and a pin set. Both versions include the same digital, in-game cosmetics, and while both have the steelbook case, the copy of the game provided is a digital one.\n\nIf you wish to purchase either the Collector’s Edition or the Jötnar Edition of the game, we heavily advise you to not do it through a reseller and try your luck with an official retailer. God (of War) speed to you.\n\nIf you find yourself out of luck with that, and you have money burning a hole in your pocket, perhaps a new gaming chair will scratch your retail therapy itch. Themed around Assassin’s Creed for your Ass’s need, Secret Lab has partnered with Ubisoft to create this limited edition gaming chair for the series’ 15th anniversary. A Titan Evo model, which GameSpot named best gaming chair of 2022, the white, red, and grey seat is adorned with a spherical diagram on the back detailing the evolution of the Assassin’s Creed logo.\n\nAnd if you’re looking to do a full upgrade of your gaming space, Secret Lab is also producing an Assassin’s Creed version of its Magnus desk, which is adorned with numerous magnets to hold things in place such as your cable management system and desk mat.\n\nUbisoft is celebrating the 15th anniversary of Assassin’s Creed all year long, with in-game events and new cosmetics for Valhalla, and an upcoming future of the franchise presentation happening in September.\n\nTIME CODES: \n00:18 - God of War Ragnarök Collector's Editions being resold\n01:35 - Secret Lab x Assassin's Creed gaming chair\n02:29 - Stray gaming merchants for your cat", "link": "https://www.youtube.com/watch?v=Dv8eh_Rkl-8", "date_published": "2022-07-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PowerWash Simulator Is Surprisingly Great | GameSpot After Dark Episode 153", "description": "This week we let the GameSpot Magic 8 Ball determine our future. Lucy and Tam have been cleaning up the streets in PowerWash Simulator, and Jordan is here to tell you if you play Escape Academy solo, you're PLAYING IT WRONG GREG MILLER!\n\n#gaming #powerwashsimulator #gamespotafterdark", "link": "https://www.youtube.com/watch?v=jFTyDF26nk0", "date_published": "2022-07-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]