[{"source": "https://www.theguardian.com/rss", "title": "Aubameyang to seal Barcelona move from Arsenal on free transfer", "description": "<ul><li>Confirmation due on Tuesday after successful medical</li><li>Talks appeared to have broken down over wage split</li></ul><p>Pierre-Emerick Aubameyang has passed a medical and is due to be confirmed as a Barcelona player on a free transfer on Tuesday morning after several hours of negotiations during which it appeared a proposed move from Arsenal had broken down.</p><p>He is out of the picture on disciplinary grounds at Arsenal, where he had 18 months left on his £300,000-a-week contract, and the transfer suits all parties. The 32-year-old travelled to Barcelona to be there on deadline day in the hope of completing the deal – it is understood he also has family in the city.</p> <a href=\"https://www.theguardian.com/football/2022/jan/31/barcelona-aubameyang-loan-arsenal\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/jan/31/barcelona-aubameyang-loan-arsenal", "date_published": "2022-01-31 23:26:50+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘We only have a pen’: fury as fourth journalist killed in Mexico this year", "description": "<p>Roberto Toledo was shot dead by three gunmen in a carpark in Zitácuaro, where he reported for a local news outlet</p><p>Journalists in Mexico have responded with fury and despair at the murder of a fourth reporter in the country this year, cementing its reputation as the world’s most murderous country for media workers.</p><p>Roberto Toledo was shot dead by three gunmen on Monday afternoon in a carpark in the city of Zitácuaro, where he reported for a local news outlet, Monitor Michoacán. Zitácuaro is best known for the nearby monarch butterfly reserves, but the region is rife with violence as drug cartels and criminal groups fight to control illegal logging.</p> <a href=\"https://www.theguardian.com/world/2022/jan/31/mexico-fourth-journalist-killed-roberto-toledo\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/jan/31/mexico-fourth-journalist-killed-roberto-toledo", "date_published": "2022-01-31 23:07:16+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Scotland wary of ‘unpredictability’ of England playmaker Marcus Smith", "description": "<ul><li>Harlequins fly-half impressed Scotland coaches on Lions tour</li><li>Smith expected to make his Six Nations debut at Murrayfield</li></ul><p>Scotland have been told to keep a close eye on Marcus Smith if they want to make a winning start in the Six Nations. England’s fly-half impressed on last summer’s British &amp; Irish Lions tour and within the Scotland camp there is a belief that he poses the biggest threat to their Calcutta Cup prospects.</p><p>Smith has not played in the Six Nations before but his <a href=\"https://www.theguardian.com/sport/blog/2021/nov/13/marcus-smith-england-australia-autumn-international\">autumn form for England</a> and <a href=\"https://www.theguardian.com/sport/2022/jan/14/cardiff-harlequins-european-rugby-champions-cup-match-report\">match-turning performances for Harlequins</a> have made him a key figure in the view of Scotland’s defence coach, Steve Tandy. “He is an outstanding individual,” said Tandy, also a member of the Lions coaching staff. “He has an outstanding kicking game, makes really good decisions, hits the line and opens the game up a little bit more. There is an unpredictability about him as well so we know we are going to have to be on the money defensively.”</p> <a href=\"https://www.theguardian.com/sport/2022/jan/31/scotland-wary-of-unpredictability-of-england-playmaker-marcus-smith\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/jan/31/scotland-wary-of-unpredictability-of-england-playmaker-marcus-smith", "date_published": "2022-01-31 22:00:01+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Liz Truss tests positive for Covid after speaking in packed Commons", "description": "<p>Foreign secretary had also attended packed meeting of Tory MPs without a mask and was due to fly with Boris Johnson to Ukraine</p><p>Liz Truss has tested positive for Covid, shortly after sitting in a packed House of Commons without wearing a mask.</p><p>Writing <a href=\"https://twitter.com/trussliz/status/1488243196509495299\">on Twitter</a> on Monday evening, the foreign secretary said: “I tested positive for Covid this evening. Thankfully I’ve had my three jabs and will be working from home while I isolate.”</p> <a href=\"https://www.theguardian.com/politics/2022/jan/31/liz-truss-tests-positive-for-covid-after-speaking-in-packed-commons\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/jan/31/liz-truss-tests-positive-for-covid-after-speaking-in-packed-commons", "date_published": "2022-01-31 21:22:55+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Gray finds ‘failure of leadership’ at No 10 as police investigate 300 photos", "description": "<p>Angry Tories confront Boris Johnson as report finds many of 16 lockdown events ‘difficult to justify’</p><ul><li><a href=\"https://www.theguardian.com/uk-news/2022/jan/31/sue-gray-report-into-downing-street-parties\">Read Sue Gray’s report</a></li><li><a href=\"https://www.theguardian.com/politics/live/2022/jan/31/uk-politics-live-omicron-nhs-workers-coronavirus-vaccines-no-10-sue-gray-report\">Today’s politics news – live updates</a></li><li><a href=\"https://www.theguardian.com/world/coronavirus-outbreak\">See all our coronavirus coverage</a></li></ul><p>Boris Johnson has been left desperately trying to shore up his premiership after the Sue Gray report as detectives were revealed to be investigating 300 photos and 12 events in Downing Street, including a party in the prime minister’s private flat.</p><p>Johnson faced a wall of anger from Conservative MPs in the House of Commons after Gray’s investigation concluded that many of the 16 parties were “difficult to justify” and condemned “failures of leadership and judgment” in No 10 and the Cabinet Office.</p> <a href=\"https://www.theguardian.com/politics/2022/jan/31/gray-finds-a-failure-of-leadership-at-no-10-as-police-investigate-300-photos-boris-johnson\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/jan/31/gray-finds-a-failure-of-leadership-at-no-10-as-police-investigate-300-photos-boris-johnson", "date_published": "2022-01-31 20:57:53+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Ministers plan to scrap vaccine mandate for NHS staff in England", "description": "<p>Health secretary Sajid Javid announces U-turn that will prevent exodus of thousands of health workers</p><ul><li><a href=\"https://www.theguardian.com/world/series/coronavirus-live/latest\">Coronavirus – latest updates</a></li><li><a href=\"https://www.theguardian.com/world/coronavirus-outbreak\">See all our coronavirus coverage</a></li></ul><p>Ministers have announced plans to scrap an order forcing all NHS staff in England to get vaccinated against Covid, in a U-turn that will prevent an exodus of thousands of frontline health workers.</p><p>Sajid Javid, the health secretary, confirmed the move in a statement to MPs on Monday evening, ditching a policy that he had championed in spite of growing concern that it would endanger patient safety by triggering the loss of key personnel from the already understaffed health service.</p> <a href=\"https://www.theguardian.com/society/2022/jan/31/ministers-plan-to-scrap-vaccine-mandate-for-nhs-staff-in-england\">Continue reading...</a>", "link": "https://www.theguardian.com/society/2022/jan/31/ministers-plan-to-scrap-vaccine-mandate-for-nhs-staff-in-england", "date_published": "2022-01-31 20:37:13+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "SpaceX flight winner gives ticket to friend because he exceeded weight limit", "description": "<p>Kyle Hippchen, a Florida-based captain for  Delta’s regional carrier, Endeavor Air, won a ticket last September</p><p>A Florida man who won a seat on the first space tourism flight operated by Elon Musk and SpaceX gave his ticket to a friend, because he was too heavy for blast-off.</p><p>Kyle Hippchen, 43 and a Florida-based captain for Delta’s regional carrier, Endeavor Air, won a ticket to be on <a href=\"https://www.theguardian.com/science/2021/sep/19/heck-of-a-ride-spacexs-historic-amateur-astronauts-land-safely-in-atlantic\">the SpaceX flight last September</a>.</p> <a href=\"https://www.theguardian.com/science/2022/jan/31/spacex-winner-gives-ticket-away-kyle-hippchen\">Continue reading...</a>", "link": "https://www.theguardian.com/science/2022/jan/31/spacex-winner-gives-ticket-away-kyle-hippchen", "date_published": "2022-01-31 20:22:14+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Faced with the Gray report, Johnson was left without honesty and without honour", "description": "<p>As Starmer chose scorn, Johnson blamed everyone else. Much more of it and he would have denied all knowledge of being PM</p><p>Sometimes less is more. When the Metropolitan police finally got round to investigating the parties at No 10, after being presented with the evidence by Sue Gray, and then insisted she doctor her final report, it was generally assumed to be a win for The Suspect. The Greased Piglet escapes again after an establishment cover-up. Only Gray had other ideas.</p><p>Rather than punting out a whitewash, she just said: “Fuck you” and downed tools.</p> <a href=\"https://www.theguardian.com/politics/2022/jan/31/faced-with-the-gray-report-johnson-was-left-without-honesty-and-without-honour\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/jan/31/faced-with-the-gray-report-johnson-was-left-without-honesty-and-without-honour", "date_published": "2022-01-31 20:02:37+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Global count estimates Earth has 73,000 tree species – 14% more than reported", "description": "<p>Second world war codebreaking calculations used at Bletchley Park find 9,000 of those species are yet to be discovered</p><p>There are an estimated 73,300 species of tree on Earth, 9,000 of which have yet to be discovered, according to a global count of tree species by thousands of researchers who used second world war codebreaking techniques created at Bletchley Park to evaluate the number of unknown species.</p><p>Researchers working on the ground in 90 countries collected information on 38 million trees, sometimes walking for days and camping in remote places to reach them. The study found there are about 14% more tree species than previously reported and that a third of undiscovered tree species are rare, meaning they could be vulnerable to extinction by human-driven changes in land use and the climate crisis.</p> <a href=\"https://www.theguardian.com/environment/2022/jan/31/global-count-estimates-earth-has-73000-tree-species-bletchley-park-good-turing-frequency-estimation\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/jan/31/global-count-estimates-earth-has-73000-tree-species-bletchley-park-good-turing-frequency-estimation", "date_published": "2022-01-31 20:00:06+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Martin Rowson on Boris Johnson and the Sue Gray report – cartoon", "description": "<a href=\"https://www.theguardian.com/commentisfree/picture/2022/jan/31/martin-rowson-on-boris-johnson-and-the-sue-gray-report-cartoon\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/picture/2022/jan/31/martin-rowson-on-boris-johnson-and-the-sue-gray-report-cartoon", "date_published": "2022-01-31 20:00:06+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The Guardian view on Boris Johnson: a PM without shame | Editorial", "description": "<p>Reading Sue Gray’s interim report, it’s hard to believe that the people who made the law had obeyed the law</p><p>The interim <a href=\"https://www.theguardian.com/politics/2022/jan/31/what-sue-gray-edited-report-into-alleged-lockdown-parties-says\" title=\"\">findings</a> of a report by the civil servant Sue Gray are damning of the culture at the heart of Boris Johnson’s government. Ms Gray cited “failures of leadership and judgment”; “excessive” consumption of alcohol in the workplace; and officials cowed into silence about Covid rule-breaking in Downing Street. Ms Gray said she has been “extremely limited” by a police investigation and was unable to make firm conclusions about what she had discovered. However, Ms Gray’s report suggests that some of the events she examined didn’t comply with lockdown rules, saying that “a number of these gatherings should not have been allowed to take place or to develop in the way that they did”. Reading this, it’s hard to believe that the people who made the law had obeyed the law.</p><p>Mr Johnson’s argument to MPs had been that the Downing Street parties were not parties because lockdown guidance had been heeded. The Johnson logic was that since the rules said there could be no party, whatever happened wasn’t a party. The trouble with this reasoning is that Ms Gray has amassed enough evidence for the police to investigate a dozen potential criminal breaches of Covid rules in Mr Johnson’s <a href=\"https://www.theguardian.com/politics/2022/jan/31/sue-gray-report-criticises-no-10-over-difficult-to-justify-parties\" title=\"\">home</a> and office. The Met has 300 photographs and 500 pieces of paper from Ms Gray, which only raise the stakes for Tory MPs. This feels more like the vapour trail from a cruise missile than the wispy smoke coming off a warm gun.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/jan/31/the-guardian-view-on-boris-johnson-a-pm-without-shame\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/jan/31/the-guardian-view-on-boris-johnson-a-pm-without-shame", "date_published": "2022-01-31 19:23:24+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The Guardian view on the care-leaving age: teenagers are children too | Editorial", "description": "<p>There should be a national outcry about the government’s decision to withhold the entitlement to care from the over-15s</p><p>Terry Galloway and his siblings grew up in care. His sister had a difficult life, which ended when she was murdered by a partner. As children, the Galloways made a pact to try to improve the care system, which is part of the reason why he will travel to Downing Street as part of a delegation of care leavers on Tuesday. Their petition objects to a new law that, because it took the form of secondary legislation, has so far failed to generate the national outcry that it merits. That law makes official in England the practice of forcing children out of care at the age of 16. </p><p>Between 2018 and 2020, while living in this type of setting, <a href=\"https://questions-statements.parliament.uk/written-questions/detail/2021-10-27/64629\" title=\"\">22 children aged 16 and 17 died</a>. The government won’t say which councils were responsible for these children, but a review following the <a href=\"https://www.bbc.co.uk/news/uk-england-hereford-worcester-58986059\" title=\"\">death of Caitlin Sharp</a> criticised Worcestershire social services, and said that she should not have been living independently, partly due to her epilepsy. Forcing children to manage life on their own leads to other forms of harm too. Last year, the Together Trust found that <a href=\"https://www.togethertrust.org.uk/news/new-research-wheres-care\" title=\"\">3,253 16- and 17-year-olds</a> were not in education, employment or training while living in non-care settings. More recently, Ofsted published research showing that more than <a href=\"https://www.gov.uk/government/news/care-leavers-feel-they-left-care-too-early-ofsted-finds\" title=\"\">a third of care leavers</a> don’t know where to turn in an emergency, and that money worries make many feel unsafe.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/jan/31/the-guardian-view-on-the-care-leaving-age-teenagers-are-children-too\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/jan/31/the-guardian-view-on-the-care-leaving-age-teenagers-are-children-too", "date_published": "2022-01-31 19:23:00+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The Sue Gray report on No 10 parties: our writers on what should happen next | Nesrine Malik and others", "description": "<p>With some of Sue Gray’s findings published, what will the implications be for Boris Johnson? Our experts give their view</p><p>In any normal political climate, the <a href=\"https://www.theguardian.com/politics/2022/jan/31/what-sue-gray-edited-report-into-alleged-lockdown-parties-says\">Sue Gray report</a> should be a final word. It is not short on statements that should condemn the prime minister, confirming the facts that have been out in the public domain for weeks now. Twelve parties – all but four of those that took place – are under criminal investigation. One of those, and this is not a passing detail, took place in the prime minister’s own flat. While the rest of the country was negotiating the fine technicalities of what constitutes a breach of the rules, in some instances pondering whether to sit on a bench in the park or not, these parties seem to suggest that No 10 and civil service staff, under the eye of the prime minister, believed they were exempt.</p><p>Nesrine Malik is a Guardian columnist</p> <a href=\"https://www.theguardian.com/commentisfree/2022/jan/31/sue-gray-report-no-10-boris-johnson\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/jan/31/sue-gray-report-no-10-boris-johnson", "date_published": "2022-01-31 19:17:33+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Banker wins £2m for sexual discrimination in ‘witch hat’ case", "description": "<p>Stacey Macken sued BNP Paribas after years of unequal pay and belittlement by male colleagues</p><p>A City banker who had a witch’s hat left on her desk by drunken male colleagues has won more than £2m in compensation for sexual discrimination.</p><p>Stacey Macken, 50, sued French bank BNP Paribas after being belittled by her boss who kept telling her “not now, Stacey” – a phrase he used so often that colleagues even copied it.</p> <a href=\"https://www.theguardian.com/money/2022/jan/31/banker-wins-2m-for-sexual-discrimination-in-witch-hat-case\">Continue reading...</a>", "link": "https://www.theguardian.com/money/2022/jan/31/banker-wins-2m-for-sexual-discrimination-in-witch-hat-case", "date_published": "2022-01-31 19:15:49+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Prince Andrew case: British and Australian authorities called to help get witness testimony", "description": "<p>Judge overseeing Virginia Giuffre’s sexual abuse case requests assistance in obtaining testimony from witnesses outside US</p><p>The New York judge overseeing Virginia Giuffre’s sexual abuse case against Britain’s Prince Andrew has officially requested assistance from British and Australian legal authorities in obtaining testimony from potential witnesses outside the US.</p><p>Judge Lewis Kaplan’s formal request stems from petitions filed several weeks ago by both Giuffre and the Duke of York’s legal teams. Giuffre on 14 January <a href=\"https://www.theguardian.com/uk-news/2022/jan/14/prince-andrew-sexual-abuse-lawsuit-testimony-virginia-giuffre\">requested</a> that Kaplan ask British authorities for help in obtaining testimony from Andrew’s former equerry, Robert Olney.</p><p><em>Information and support for anyone affected by rape or sexual abuse issues is available from the following organisations. In the US, <a href=\"https://www.rainn.org/\">Rainn</a> offers support on 800-656-4673. In the UK, <a href=\"https://rapecrisis.org.uk/\">Rape Crisis</a> offers support on 0808 802 9999. In Australia, support is available at <a href=\"https://www.1800respect.org.au/\">1800Respect</a> (1800 737 732). Other international helplines can be found at <a href=\"http://ibiblio.org/rcip/internl.html\">ibiblio.org/rcip/internl.html</a></em></p> <a href=\"https://www.theguardian.com/uk-news/2022/jan/31/prince-andrew-case-british-australian-authorities-called-witness-testimony\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/jan/31/prince-andrew-case-british-australian-authorities-called-witness-testimony", "date_published": "2022-01-31 19:14:36+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Are Tory MPs willing to be taken for fools by Boris Johnson? | Gaby Hinsliff", "description": "<p>The party’s dysfunctionality comes from the top – and those waiting for the right moment to unseat the PM risk being dragged into the mire</p><p>When <a href=\"https://www.bbc.co.uk/news/av/uk-politics-60205158\">Aaron Bell</a> attended his grandmother’s funeral, he could not allow himself to hug his grieving parents and siblings.</p><p>After she was laid to rest with only 10 mourners present, in accordance with Covid regulations, he turned around and drove the three hours home without stopping for a cup of tea, because those were the rules and in a pandemic they<strong> </strong>were to be obeyed. His question to Boris Johnson on Monday afternoon was couched in tones of barely suppressed fury: “Does the prime minister think I’m a fool?”</p><p>Gaby Hinsliff is a Guardian columnist</p> <a href=\"https://www.theguardian.com/commentisfree/2022/jan/31/tory-mps-boris-johnson-party\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/jan/31/tory-mps-boris-johnson-party", "date_published": "2022-01-31 18:53:32+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Storms Malik and Corrie: disruption extends to fourth day", "description": "<p>Thousands of homes still without power, transport severely affected and some schools to remain closed on Tuesday after back-to-back storms</p><p>Thousands of people are facing another night without power in Scotland and north-east England after two storms battered parts of the UK.</p><p>Some schools in Scotland will remain closed on Tuesday after winds of up to 92mph were recorded in northern parts of the UK over the weekend as the <a href=\"https://www.theguardian.com/uk-news/2022/jan/30/uk-weather-storm-corrie-to-batter-scotland-and-northern-england\">storms Malik and Corrie</a> hurtled in from the Atlantic. </p> <a href=\"https://www.theguardian.com/uk-news/2022/jan/31/schools-rail-services-disrupted-uk-storms-malik-and-corrie\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/jan/31/schools-rail-services-disrupted-uk-storms-malik-and-corrie", "date_published": "2022-01-31 18:37:55+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Chris Mullin to resist police bid to identify IRA pub bombing sources", "description": "<p>Police believe the author and ex-MP has interviews that could identify IRA member behind the 1974 pub bombings</p><p>A journalist and former member of parliament who helped uncover one of the worst miscarriages of justice in British history is to fight a police attempt to force him to reveal source material for his research into the Birmingham pub bombings.</p><p>Chris Mullin, 74, said he will contest the police attempt to get a high court order served on him in relation to his investigation into the Birmingham Six, whose <a href=\"https://www.theguardian.com/uk/1991/mar/15/northernireland.davidpallister\">convictions were quashed in 1991</a>.</p> <a href=\"https://www.theguardian.com/uk-news/2022/jan/31/chris-mullin-to-resist-police-order-to-reveal-ira-pub-bombing-sources\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/jan/31/chris-mullin-to-resist-police-order-to-reveal-ira-pub-bombing-sources", "date_published": "2022-01-31 18:36:51+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "António Costa pledges to make Portugal ‘fairer’ after surprise poll victory", "description": "<p>Ruling Socialist party wins absolute majority in snap election, as populist anti-Roma party also increases share</p><p>Portugal’s ruling Socialists are preparing for a third consecutive term after winning a <a href=\"https://www.theguardian.com/world/2022/jan/31/portugal-general-election-pm-antonio-costa-wins-surprise-outright-majority\">surprise absolute majority</a> in a <a href=\"https://www.theguardian.com/world/2022/jan/29/splits-in-left-are-set-to-boost-far-right-tv-pundit-in-portugals-snap-election\">snap general election</a> that confounded predictions, pundits and pollsters and saw the far-right become the third-largest group in parliament.</p><p>The prime minister, António Costa, has pledged to use his unexpectedly large mandate to bring in reforms and investments that will make Portugal “more prosperous, fairer, and more innovative”.</p> <a href=\"https://www.theguardian.com/world/2022/jan/31/antonio-costa-pledges-to-make-portugal-fairer-after-surprise-poll-victory\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/jan/31/antonio-costa-pledges-to-make-portugal-fairer-after-surprise-poll-victory", "date_published": "2022-01-31 18:21:59+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Ethical carbon offsetting has a role to play in tackling the climate crisis | Letters", "description": "<p><strong>Prof Mark Huxham</strong> and<strong> Mukti Kumar Mitchell </strong>on concerns about the viability of carbon offsets in response to an article by George Monbiot. Plus <strong>Barbara Foster</strong> and<strong> MSR Seshu </strong>on the climate implications of flights</p><p>George Monbiot makes important points about the role of nature-based solutions (<a href=\"https://www.theguardian.com/commentisfree/2022/jan/26/carbon-offsetting-environmental-collapse-carbon-land-grab\" title=\"\">Carbon offsetting is not warding off environmental collapse – it’s accelerating it, 26 January</a>). We need to preserve our natural forests, mangroves, sea grasses and peatlands to slow current heating levels, and we need to restore and expand them to deal with our legacy carbon. But in suggesting that all offsetting is simply greenwashing, he does a disservice to the hundreds of community-based projects that are working to improve lives and conserve natural carbon sinks.</p><p>The <a href=\"https://aces-org.co.uk/\" title=\"\">Association for Coastal Ecosystem Services</a> helps people in Kenya protect their mangrove forests and use money from the sale of carbon credits for water, education and health. The forests, the money and the projects belong to them. We do not take money from fossil-fuel companies, but rather from individuals and small corporations that are committed to reducing emissions but still want to compensate for those that they cannot avoid.</p> <a href=\"https://www.theguardian.com/environment/2022/jan/31/ethical-carbon-offsetting-has-a-role-to-play-in-tackling-the-climate-crisis\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/jan/31/ethical-carbon-offsetting-has-a-role-to-play-in-tackling-the-climate-crisis", "date_published": "2022-01-31 18:14:02+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Dumping Spotify is principled – and easy | Letters", "description": "<p><strong>Les Bright </strong>praises the actions of Neil Young and Joni Mitchell, and <strong>Richard Smith </strong>recommends switching to Deezer</p><p>Neil Young and Joni Mitchell are part of the soundtrack of my life; I have bought their albums for 50 years. I am also aware that each of these remarkable artists contracted polio before a vaccination was available. Young’s challenge to Spotify to remove a popular podcast that has featured anti-vaxxers and conspiracy theorists, and Mitchell’s act of solidarity with him, will cost them money they can afford to lose (<a href=\"https://www.theguardian.com/technology/2022/jan/31/spotify-to-direct-listeners-to-correct-covid-information-after-joe-rogan-controversy\" title=\"\">Report, 31 January</a>). However, their principled stand has warmed the hearts of many retired hippies whose trust in other institutions such as parliament and the police has been sorely tested recently.<br /><strong>Les Bright</strong><br /><em>Exeter, Devon</em></p><p>• There is no need to worry about losing playlists, saved artists and albums etc when leaving Spotify (<a href=\"https://www.theguardian.com/commentisfree/2022/jan/29/spotify-joe-rogan-neil-young-playlists\" title=\"\">My Spotify playlists tell the story of my life – can I really quit now?, 29 January</a>). Deezer, for one, allows you to transfer over everything to its streaming service in just a few seconds. So I can now listen to Neil Young once more, and everyone should do the same. Bye, Spotify!<br /><strong>Richard Smith</strong><br /><em>Carbis Bay, Cornwall</em></p> <a href=\"https://www.theguardian.com/technology/2022/jan/31/dumping-spotify-is-principled-and-easy\">Continue reading...</a>", "link": "https://www.theguardian.com/technology/2022/jan/31/dumping-spotify-is-principled-and-easy", "date_published": "2022-01-31 18:09:19+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Dream work: the new creativity hack Hollywood stars swear by", "description": "<p>Jane Campion, Benedict Cumberbatch and Sandra Oh all say they have used a coach to harness the power of their dreams and say the results have been extraordinary</p><p><strong>Name: </strong>Dream work.</p><p><strong>Age: </strong>People have been dreaming since people have been people. This is more about the exploration of dreams.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/jan/31/dream-work-the-new-creativity-hack-hollywood-stars-swear-by\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/jan/31/dream-work-the-new-creativity-hack-hollywood-stars-swear-by", "date_published": "2022-01-31 18:07:06+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Boris Johnson to publish full Gray report after Met inquiry ends", "description": "<p>Significant U-turn comes after No 10 previously said it would only consider publishing more detailed evidence</p><p>Boris Johnson will publish the full report into lockdown parties in Downing Street once the Metropolitan police investigation has concluded, in a significant U-turn after an angry response from Conservative MPs.</p><p>No 10 had promised only to consider publishing fuller evidence once police inquiries have ended. But a spokesperson said on Monday night that Johnson would ask Sue Gray to make a further update to her report, after a severely redacted version was published to avoid prejudicing the Scotland Yard probe.</p> <a href=\"https://www.theguardian.com/politics/2022/jan/31/boris-johnson-to-publish-full-gray-report-after-met-inquiry-ends\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/jan/31/boris-johnson-to-publish-full-gray-report-after-met-inquiry-ends", "date_published": "2022-01-31 18:06:17+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Golf’s global power struggle heats up with UK set to host Asian Tour event", "description": "<ul><li>Plans for 10 events to be revealed ahead of Saudi International</li><li>Saudi Arabian business funding rival to PGA and DP World Tour</li></ul><p>The latest move in golf’s global power struggle will take place on Tuesday, when the Saudi Arabian business fronted by Greg Norman reveals detailed plans for 10 events – including one in the UK – on the 2022-23 Asian Tour schedule. The UK element of the new series will be perceived as openly hostile given relations between the Saudis and golf’s main tours.</p><p>Norman is due to hold a press conference at Royal Greens Golf &amp; Country Club ahead of this week’s Saudi International, which is now sanctioned by the Asian Tour. The DP World and PGA Tours are strongly opposed to <a href=\"https://www.theguardian.com/sport/2021/may/04/saudi-arabia-plan-breakaway-golf-tour\">Saudi’s plans for the top level game</a> – which they view as a commercial threat – meaning leading players may soon have a choice to make over whether to remain in the current ecosystem or accept vast sums to play within a rival organisation. Ultimately the Saudis have plans for a Super Golf League, comprising 14 events.</p> <a href=\"https://www.theguardian.com/sport/2022/jan/31/golfs-global-power-struggle-steps-up-with-uk-set-to-host-asian-tour-event-saudi-arabia-dp-world-pga-tour\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/jan/31/golfs-global-power-struggle-steps-up-with-uk-set-to-host-asian-tour-event-saudi-arabia-dp-world-pga-tour", "date_published": "2022-01-31 17:50:00+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Police get more time to question Mason Greenwood over alleged rape", "description": "<p>Manchester United footballer was arrested on Saturday after a woman made claims on social media</p><p>Police have been given extra time to question the Manchester United footballer Mason Greenwood on suspicion of rape and sexual assault.</p><p>The 20-year-old was arrested on Sunday afternoon after a woman posted images, a video and audio online alleging he had assaulted her.</p> <a href=\"https://www.theguardian.com/uk-news/2022/jan/31/police-get-more-time-to-question-mason-greenwood\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/jan/31/police-get-more-time-to-question-mason-greenwood", "date_published": "2022-01-31 17:38:55+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Tell us: have you stopped exercising at home?", "description": "<p>Do you continue to keep up your fitness routine at home, or has your exercise bike become a clothes horse since gyms reopened? </p><p>We would like to hear about your exercise routines and how they might have changed since Covid restrictions eased in the UK. </p><p>Do you continue to use your exercise bike at home? Or have you abandoned it and returned to the gym or exercising outside? Tell us all about it below.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/jan/31/tell-us-have-you-stopped-exercising-at-home\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/jan/31/tell-us-have-you-stopped-exercising-at-home", "date_published": "2022-01-31 17:17:01+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "T20 series designed to give answers only posed questions for England | Simon Burnton", "description": "<p>Eoin Morgan said the result did not matter but will be worried by the failure of his batters and seamers in the West Indies</p><p>“The whole tour is one where the development of our game is actually more important than the series win,” Eoin Morgan said before a ball was bowled. “Our level of intensity and our performance is far more important than the result, and actually the result looks after itself.”</p><p>The results did not, in the end, look after themselves. England leave Barbados <a href=\"https://www.theguardian.com/sport/2022/jan/30/west-indies-win-t20-series-decider-as-england-fall-to-jason-holder\" title=\"\">defeated 3-2 in the T20 series</a> but having participated in some gripping games in front of boisterous crowds. There is no shame in providing compelling entertainment and after a lopsided opening match, when on a poor pitch England were bowled out for 103 and <a href=\"https://www.theguardian.com/sport/2022/jan/22/brandon-king-steers-west-indies-home-after-englands-batting-collapses\" title=\"\">West Indies won with ease</a>, this series was tense throughout.</p> <a href=\"https://www.theguardian.com/sport/blog/2022/jan/31/a-series-designed-to-provide-answers-only-posed-questions-for-england\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/blog/2022/jan/31/a-series-designed-to-provide-answers-only-posed-questions-for-england", "date_published": "2022-01-31 16:57:50+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Kitchen hacks, fitness tips and Irish Siri: 31 easy ways to make your life a little better", "description": "<p>If you don’t have the energy for sweeping life changes, don’t worry. A few small tweaks can add up to a big difference. Here are all of our <a href=\"https://www.theguardian.com/lifeandstyle/series/easy-wins\">easy wins</a></p><p>This year hasn’t exactly got off to a roaring start for most people. 2022 feels more like, as one friend put it: “2020 – the trilogy”. As much as we’re hungry for change, many of us do not have the energy to make big, sweeping shifts; and even if we did, it’s entirely possible that the world will have other plans.</p><p>So, what little things can we do to feel better right now? This January, Guardian Australia staff and contributors embarked on a month of <a href=\"https://www.theguardian.com/lifeandstyle/series/easy-wins\">easy wins</a> – sharing the small discoveries and changes that improved their lives. Some involved giving back, some giving yourself a break, and a few involved personal admin – because if you just need to achieve something, anything, you can always turn to paperwork.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/feb/01/kitchen-hacks-fitness-tips-and-irish-siri-31-easy-ways-to-make-your-life-a-little-better\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/feb/01/kitchen-hacks-fitness-tips-and-irish-siri-31-easy-ways-to-make-your-life-a-little-better", "date_published": "2022-01-31 16:30:04+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Unlike Putin's Russia, the west doesn’t know what it wants in eastern Europe | Timothy Garton Ash", "description": "<p>The west must stop dithering and reaffirm that all European states – including Ukraine – should be independent and free</p><p>As Russian troops mass on the <a href=\"https://www.theguardian.com/world/2022/jan/30/nato-calls-on-europe-to-diversify-energy-supply-amid-russia-standoff\">frontiers of Ukraine</a>, threatening the largest war in Europe since 1945, the whole world is trying to guess Vladimir Putin’s intentions. But the strategic question the democracies of Europe and North America need to ask is: what are <em>our </em>intentions?</p><p>Putin’s long-term goal in eastern Europe is, in fact, perfectly clear. He wants to restore as much as possible of the empire, great power status and sphere of influence that Russia lost so dramatically 30 years ago, with the disintegration of the Soviet Union in December 1991. It is only his tactics that keep us guessing. Since 2008, when he secured two secessionist <a href=\"https://www.theguardian.com/world/2008/aug/12/georgia1\">chunks of Georgia</a> by force, and most certainly since his <a href=\"https://www.theguardian.com/world/2014/feb/27/ukraine-pro-russian-gunmen-seize-crimea-parliament-live-updates\">seizure of Crimea</a> in 2014, it has been evident that he is ready to use any and all means, from diplomacy and disinformation to cyber-attacks and outright war.</p><p>Timothy Garton Ash is a Guardian columnist</p><p><strong>Guardian Newsroom: Will Russia invade Ukraine? </strong>Join Mark Rice-Oxley, Andrew Roth, Luke Harding, Nataliya Gumenyuk and Orysia Lutsevych discussing the developments with Russia and Ukraine on Tuesday 8 February, 8pm GMT | 9pm CET | midday PDT | 3pm EDT. Book tickets<a href=\"https://membership.theguardian.com/event/guardian-newsroom-will-russia-invade-ukraine-254486334477\"> here</a></p> <a href=\"https://www.theguardian.com/commentisfree/2022/jan/31/putin-russia-eastern-europe-ukraine\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/jan/31/putin-russia-eastern-europe-ukraine", "date_published": "2022-01-31 15:50:12+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Talking Horses: listen to jockeys in battle of the scales with racing’s rulers", "description": "<p>The latest war of words between the jockeys’ association and the British Horseracing Authority is unlikely to be the last</p><p>Another week, another war of words between the British Horseracing Authority (BHA) and the Professional Jockeys Association (PJA): two bodies which seem to be, for the moment at least, in a state of perpetual antipathy.</p><p>The latest dispute concerns the BHA’s announcement last week that the 3lb Covid allowance for riders, which has been in place since June 2020, will be replaced by a general 2lb rise in the weights from 26 March. The allowance was introduced when racing emerged from lockdown in June 2020, but with weighing-room saunas off-limits to maintain social distancing. Jockeys – or the 250 or so who responded to a survey – subsequently voted to keep the saunas closed, but apparently in the expectation that the 3lb allowance would be retained.</p> <a href=\"https://www.theguardian.com/sport/blog/2022/jan/31/talking-horses-listen-to-jockeys-in-battle-of-the-scales-with-racings-rulers-horse-racing-tips\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/blog/2022/jan/31/talking-horses-listen-to-jockeys-in-battle-of-the-scales-with-racings-rulers-horse-racing-tips", "date_published": "2022-01-31 14:22:34+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "A timber tiger and a lantern display: Monday’s best photos", "description": "<p>The Guardian’s picture editors select photo highlights from around the world</p> <a href=\"https://www.theguardian.com/news/gallery/2022/jan/31/a-timber-tiger-and-a-lantern-display-mondays-best-photos\">Continue reading...</a>", "link": "https://www.theguardian.com/news/gallery/2022/jan/31/a-timber-tiger-and-a-lantern-display-mondays-best-photos", "date_published": "2022-01-31 14:18:47+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Pamcore! How Pamela Anderson became an unlikely Gen Z fashion icon", "description": "<p>As sex tape drama arrives on Disney+, much of Anderson’s aesthetic has also come back around</p><p>Pamela Anderson and Tommy Lee may not have been the defining celebrity couple of their era, but they perhaps heralded the next: the leaked sex tapes, tabloid infamy and rock’n’roll excess presaged the game of media cat-and-mouse that has now become commonplace.</p><p>A <a href=\"https://www.theguardian.com/tv-and-radio/2022/jan/29/pam-tommy-disneys-sex-tape-tale-makes-for-outrageous-and-unmissable-tv\">new drama series on Disney+</a>, documenting their romance and how their stolen sex tape unwittingly ushered in a new era of celebrity pornography, begins next week.</p> <a href=\"https://www.theguardian.com/fashion/costume-and-culture/2022/jan/31/pamcore-how-pamela-anderson-became-an-unlikely-gen-z-fashion-icon\">Continue reading...</a>", "link": "https://www.theguardian.com/fashion/costume-and-culture/2022/jan/31/pamcore-how-pamela-anderson-became-an-unlikely-gen-z-fashion-icon", "date_published": "2022-01-31 13:22:33+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Tell us: have you bought groceries through a buy now, pay later scheme?", "description": "<p>We would like to hear your experiences of buying groceries through buy now, pay later schemes offered by credit firms</p><p>Credit firms and online stores such as Zilch, Flava or Clearpay are <a href=\"https://www.theguardian.com/money/2022/jan/29/buy-now-pay-later-grocery-schemes-are-a-debt-trap-for-struggling-families?CMP=Share_iOSApp_Other\">offering “buy now, pay later” deals</a> on items including groceries, pet food and hot drinks.</p><p>We would like to hear about people’s experiences of buy now, pay later grocery schemes. What led to your decision to use one? What has your experience been like? </p> <a href=\"https://www.theguardian.com/money/2022/jan/31/tell-us-have-you-bought-groceries-through-a-buy-now-pay-later-scheme\">Continue reading...</a>", "link": "https://www.theguardian.com/money/2022/jan/31/tell-us-have-you-bought-groceries-through-a-buy-now-pay-later-scheme", "date_published": "2022-01-31 11:10:19+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘What’s going on with me?’ Canadian victims of mystery illness suffer alone", "description": "<p>A distressing neurological condition has afflicted dozens in New Brunswick – so why has the investigation slowed down? </p><p>For more than two years, dozens of people in the Canadian province of New Brunswick have suffered from a distressing array of neurological symptoms, prompting speculation that they had fallen victim to <a href=\"https://www.theguardian.com/world/2021/mar/30/mystery-brain-disorder-baffles-canadian-medicine\">an unknown degenerative illness</a>.</p><p>Provincial authorities are soon expected to release a report examining whether the cases are linked, or simply the result of misdiagnosis and clinical error. But as the public awaits the findings, those enduring the extreme symptoms say they’ve been left to suffer alone.</p> <a href=\"https://www.theguardian.com/world/2022/jan/31/canada-new-brunswick-neurological-illness-victims\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/jan/31/canada-new-brunswick-neurological-illness-victims", "date_published": "2022-01-31 10:15:46+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Texas Democrat tied to Azerbaijan inquiry faces tough primary election contest", "description": "<p>An FBI raid could give Henry Cuellar’s progressive challenger a primary boost – but a Cuellar loss could open the door for Republicans</p><p>Few people outside of south Texas, and even fewer outside the state, have heard of US representative Henry Cuellar, though he is one of the state’s most fascinating elected officials. But now the nation may know him as yet another member of Congress tied to a <a href=\"https://www.texastribune.org/2022/01/27/henry-cuellar-azerbaijan/\">federal investigation</a>. A recent FBI raid at this nine-term Democratic congressman’s home and campaign headquarters in Laredo, on the US-Mexico border, has potentially significant implications for Washington politics: it deals another blow to the art of compromise, a once-essential legislative tool, and one that Cuellar has mastered in his long political career.</p><p>The<a href=\"https://www.theguardian.com/us-news/2022/jan/21/henry-cuellar-fbi-searches-home-texas-democrat-azerbaijan\"> FBI raid </a>on January 19 is part of an investigation of several people with ties to the former Soviet nation of Azerbaijan. I have no direct knowledge of the nature of the federal investigation – and Cuellar has not been charged with anything – but allowing an FBI raid weeks before his hotly contested 1 March primary suggests the highest levels of the justice department signed off on this action.</p> <a href=\"https://www.theguardian.com/us-news/2022/jan/31/texas-democrat-henry-cuellar\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/jan/31/texas-democrat-henry-cuellar", "date_published": "2022-01-31 10:00:47+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Tell us: how have you been affected by Storm Malik?", "description": "<p>We would like to hear from those who have been without power and have been affected by storm damage</p><p>As Storm Carrie approaches with winds of up to 90mph, <a href=\"https://www.theguardian.com/uk-news/2022/jan/30/uk-weather-storm-corrie-to-batter-scotland-and-northern-england\">thousands of homes in Scotland and north-east England are still without power</a> after being affected by Storm Malik. The areas mainly include Northumberland, County Durham and rural Aberdeenshire.</p><p>If you have been affected by Storm Malik, we would like to hear from you. We are also interested in hearing from those who are still without power. </p> <a href=\"https://www.theguardian.com/uk-news/2022/jan/31/tell-us-how-have-you-been-affected-by-storm-malik\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/jan/31/tell-us-how-have-you-been-affected-by-storm-malik", "date_published": "2022-01-31 09:39:59+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The age of intimacy famine: when we interact with our phones rather than our loved ones", "description": "<p>My biggest distraction from my work, family and friends – and yet I can’t pull away, even when my own research says I should</p><p>Like most humans, I want intimacy. But as a developmental psychologist, I consider intimacy a fundamental human need. Sharing feelings, embraces, intellectual conversations, sex – these intimate moments are often the touchstones of a rich human experience. Yet millions of people worldwide are isolated and <a href=\"https://www.kff.org/other/report/loneliness-and-social-isolation-in\">lonely</a>, woefully lacking in the meaningful and diverse social experiences that help support emotional and physical health.</p><p><a href=\"https://www.pewresearch.org/internet/2018/05/31/teens-social-media-technology-2018/\">Teens</a> are spending most of their waking hours online, eschewing in-person gatherings for online chats, games and Netflix. And even those of us with socially rich networks sometimes long for flashes of intimacy, like hugs from friends or sex with lovers, amid the doldrum of our daily lives.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/jan/31/age-of-intimacy-famine-interact-with-phones-rather-than-loved-ones\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/jan/31/age-of-intimacy-famine-interact-with-phones-rather-than-loved-ones", "date_published": "2022-01-31 09:00:45+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Beijing warms up for the Winter Olympics – in pictures", "description": "<p>Excitement is running high before the opening on 4 February. Beijingers have been increasingly participating in winter sports since China was awarded the games</p> <a href=\"https://www.theguardian.com/sport/gallery/2022/jan/31/beijing-warms-up-for-the-winter-olympics-in-pictures\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/gallery/2022/jan/31/beijing-warms-up-for-the-winter-olympics-in-pictures", "date_published": "2022-01-31 08:00:44+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Polar bears move into abandoned Arctic weather station – photo essay", "description": "<p>Photographer Dmitry Kokh discovered polar bears living in an abandoned weather station in Kolyuchin, in the Chukotka Autonomous Okrug of the Russian Federation, while on a trip to Wrangel Island, a Unesco-recognised nature reserve that serves as a refuge to the animals</p><p>I had dreamed about photographing polar bears for a long time. Some time ago my hobby, wildlife photography, ceased to be just a hobby and turned into a large part of my life. And if you devote so much time to an activity then your goals should be ambitious. Most of all I like to take pictures of large marine animals, whether on land or under water. Not everyone knows, but zoologists classify polar bears as marine mammals since they spend most of their time on ice floes away from land. And their paws even have webbing.</p><p>There are only a few places on the planet where polar bears can be found in large numbers. One of them is <a href=\"https://www.theguardian.com/world/2016/mar/03/russia-investigators-polar-bear-abuser-explosive\">Russia’s Wrangel Island</a>, a nature reserve under Unesco protection that is often called a polar bear maternity ward. The place is very inaccessible, which may be bad for tourists but is great for the animals.</p><p>Polar bears living in an abandoned weather station in Kolyuchin, in the Chukotka Autonomous Okrug of the Russian Federation</p> <a href=\"https://www.theguardian.com/world/2022/jan/31/polar-bears-move-into-abandoned-arctic-weather-station-photo-essay\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/jan/31/polar-bears-move-into-abandoned-arctic-weather-station-photo-essay", "date_published": "2022-01-31 07:00:43+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘There is nothing more magical’: resurrected theatre brings ancient Greece to life", "description": "<p>New passion for reviving country’s monuments is returning Little Theatre of Epidavros to heart of community</p><p>For nearly two millennia, the Little Theatre of Epidavros lay underground. Its engraved seats, concentric and tiered, belonged to a world of roots; in this case the roots of an olive grove owned by Christos Zafiris, a local farmer. “They say that had it not been for pigs digging at the soil, we might never have known of its existence,” says Prof Vassilis Lambrinoudakis. “Until the appearance of the stones in 1970, the theatre was a secret hidden under the earth for 18 centuries.”</p><p>The classical archaeologist, renowned for his work at Athens University, has spent more than four decades ensuring the chance find would not go to waste. Excavations have not disappointed. Inscriptions discovered at the site, on the slopes of a peninsula overlooking the sea, have shed light on the history of those who may have commissioned the theatre. Evidence of multiple phases of construction, starting in the mid-fourth<sup> </sup>century BC, have further illuminated the ancient city of Epidavros that once surrounded the architectural gem.</p> <a href=\"https://www.theguardian.com/science/2022/jan/31/there-is-nothing-more-magical-resurrected-theatre-brings-ancient-greece-to-life\">Continue reading...</a>", "link": "https://www.theguardian.com/science/2022/jan/31/there-is-nothing-more-magical-resurrected-theatre-brings-ancient-greece-to-life", "date_published": "2022-01-31 05:00:40+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Grenfell inquiry final phase: will politicians be held accountable?", "description": "<p>As the Grenfell inquiry heads towards its concluding stages, politicians will be called to account for their part in the deadly fire. Our social affairs correspondent Robert Booth has been watching on throughout</p><p>• <a href=\"https://www.theguardian.com/media/2017/oct/07/how-to-listen-to-podcasts-everything-you-need-to-know?CMP=podcast-help\">How to listen to podcasts: everything you need to know</a></p><p>The fire that engulfed Grenfell Tower on 14 June 2017 was one of the UK’s worst modern disasters. Seventy-two people died after a fire broke out in one of the apartments and quickly spread to the floors above as combustible cladding on the outside of the building went up in flames.</p><p>The Grenfell Tower inquiry was set up to establish the factors that led to the tragedy and to make recommendations for how to avoid anything similar ever happening again. It has heard from hundreds of witnesses and has looked at the disaster from multiple viewpoints: from the residents, the fire brigade, the developers and the cladding firms. Now in the next phase the inquiry will begin hearing from the politicians who set the regulatory framework that builders and contractors worked within.</p> <a href=\"https://www.theguardian.com/news/audio/2022/jan/31/grenfell-inquiry-final-phase-will-politicians-be-held-accountable\">Continue reading...</a>", "link": "https://www.theguardian.com/news/audio/2022/jan/31/grenfell-inquiry-final-phase-will-politicians-be-held-accountable", "date_published": "2022-01-31 03:00:37+00:00", "persistent": false, "user": null, "language": "en-UK"}]