[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Announcing the 2022 Tiny Desk Contest", "description": "Have you ever wanted to play a Tiny Desk concert? If you’re an unsigned artist, enter our eighth annual Tiny Desk Contest by Monday, March 14, 2022.\n\nTo enter:\nRecord a video of you playing an original song behind a desk.\nUpload your video to YouTube.\nSubmit on our website: npr.org/tinydeskcontest.\n\nMore details: https://tinydeskcontest.npr.org/\nOfficial rules: http://tinydeskcontest.npr.org/rules", "link": "https://www.youtube.com/watch?v=sP192eOTFpU", "date_published": "2022-02-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Amber Mark: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBobby Carter | January 31, 2022\nIn her Tiny Desk (home) concert, singer-songwriter and producer Amber Mark expresses more than once that performing for the series is a \"bucket list\" moment for her. Upon our first meeting, she came with the concept for her performance entirely laid out. \"The band is gonna sing backup, and we can cut to my family in the audience at the restaurant,\" she said. \"We'll make it beautiful.\" With details that evoked excitement and nervousness all at once, the ideas felt massive to me. And what she delivers here is pretty grand, yet deeply intimate.\n\nFor her concert, Mark stuck to the script, shooting her session at Palma restaurant in New York, a place she's called home since her high school days. This Tiny Desk (home) concert is a celebration of her stunning debut album, Three Dimensions Deep, and is handled with the same intricate attention to detail as she did for the album itself.\n\nThe dimensions Mark explored on the project are what she calls \"without,\" \"withheld,\" and \"within.\" We're taken with her on a quest for answers to questions tied to her personal struggles with self-doubt, loss and heartbreak. She starts her concert with \"On & On,\" which carries us from the \"withheld\" portion of the album right into a revelation of inner peace in songs like \"Bliss\" and \"Worth It.\" Mark also slows it down and plays \"Waiting\" from her 2020 \"COVERED-19\" series.\n\nSET LIST\n\"On & On\"\n\"Bliss\"\n\"Waiting\"\n\"Worth It\"\n\nMUSICIANS\nAmber Mark: vocals\nJosh Hari: bass, music director\nJoy Morales: keys, vocals\nTim Smith: drums, vocals\nCale Hawkins: synth, guitar, vocals\nMayteana Morales: percussion, vocals\nCorey Sanchez: guitar\n\nCREDITS\nDirector/Cinematographer: Hil Steadman, Jake DeNicola\nProducer: Ani Schroeter Audio Engineers: Mark Yoshizumi, Madeleine Campbell\nEditors: Jake DeNicola and Hil Steadman\nProduction Company: Anima Works\n1 AC: Seana Rogovin\nGaffer: John Izarpate\nPD/Grip: David Persaud\nSteadicam: Franz Brun\nProduction Design: Chloerose Brée-D'Orazio\nProduction Assistant: Henry Dolan\nDIT: Bennett Torres\nColor: Ben Federman\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Joshua Bryant\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Maia Stern, Kara Frame, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #ambermark", "link": "https://www.youtube.com/watch?v=1D-QXrC3U0I", "date_published": "2022-01-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]