[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War (2018) Full Story Recap", "description": "2018’s God of War packed a lot of story into its 20 hour campaign. Not only did it have the Herculean task of reinventing the franchise’s central anti-hero, Kratos, but it had a whole new world of myths and legends to introduce. Whether you played the original back in 2018 and want a story recap, or you’re just jumping in to prep yourself for Ragnarok, let’s break down the story so far.\n\nIn the above video, we break down and recap the full story of Sony Santa Monica’s God of War (2018). The video goes through the story beats of the 20-hour campaign, from Kratos and Atreus’s journey to the highest peak in the Nine Realms through to their encounters with the many gods and monsters.\n\nTimeline Playlist - https://www.youtube.com/watch?v=3gaFRoP4RUA&list=PLpg6WLs8kxGN7aotOq-B5tYZWpvTZ3KRS\n\n00:00 - Opening \n00:29 - The Journey Begins\n03:34 - The Light of Alfheim\n04:23 - The Mountain\n05:44 - Gods and Giants\n06:58 - A Funny Thing Happened on the Way to Jotunheim\n08:38 - Helheim and Back\n09:43 - A God in the Family\n11:25 - The Realm Between Realms\n12:41 - The Belly of the Beast\n14:07 - Jotunheim, Finally\n16:25 - Ending", "link": "https://www.youtube.com/watch?v=cqlrMjlhvcc", "date_published": "2022-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Infinity Ward Fixes Modern Warfare 2 Vault Edition Confusion | GameSpot News", "description": "MW2 Vault Edition players get a bonus, Marvel Snap will let you play with friends, and Final Fantasy XVI is almost finished.\n#Gaming @ModernWarfare2 #MarvelSnap #FFXVI \n\nDid you pick up the Modern Warfare Vault Edition? Good news! You’re getting 10 hours of double xp and double weapons xp tokens.\n\nInitially this offer was only available to purchasers of the Vault edition that picked up the game via one of the previous, recent Call of Duty titles: Modern Warfare 2019, Black Ops Cold War, or Vanguard.\n\nHowever, since almost no one purchases a game in that manner, the vast majority of people that picked up the Vault edition were not eligible for these bonuses, leading to confusion amongst many of the players that picked up the more expensive version of the game\n\n\"We understand there has been some confusion about an in-game store exclusive reward for the Vault Edition,\" reads an image Tweeted out by the official Call of Duty Twitter. “ Therefore, we've decided to reward all players that currently own or purchase any version of the MWII Vault Edition with 10 hours of double xp tokens and 10 hours of double weapon xp tokens. Current owners who have not already received the tokens should expect to see them in their account over the next 48 hours”\n\nThat means, even if you purchase the Vault Edition after this announcement was made via the means of your choosing, you’re still going to net yourself those double XP and double weapons XP tokens, which, yeah, you should get if you’re paying $100 for this game.\n\nNow, if only there was double XP in Marvel Snap, the new hit mobile card game from former Hearthstone devs, and my personal latest obsession.\n\nIf you’ve been playing Marvel Snap, and you’ve wanted to absolutely wipe the floor with your friends that are also just as addicted, you won’t have to wait long. An update that is coming to the game before the end of the year will allow you to do just that.\n\nAs reported by The Washington Post, a new Battle mode will be coming to Marvel Snap before the end of 2022, and will allow players to challenge specific people, like friends, as opposed to using the game's current matchmaking system, but matches will work differently to the regular mode already in the game.\n\nIn the current mode, players play for ranked points, with the Snap mechanic effectively serving as a way to double down on the amount of ranked points on the line. As it wouldn't exactly be fair to bet ranked points on matches between friends, Battle mode will instead introduce a HP system. \n\nEach player will have 10 HP, with the number of points on the line for a given match instead affecting the losing player's HP pool as opposed to rank. Battle mode matches will consist of multiple rounds, and the first player to lose all their HP will lose the match.\n\nMarvel Snap is currently the 5th most popular free-to-play game on the App Store, but can also be played via Steam. If you haven’t checked it out yet, I implore you do, unless you have responsibilities in your life you absolutely cannot neglect.", "link": "https://www.youtube.com/watch?v=9fLUxRsMJC8", "date_published": "2022-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Wo Long: Fallen Dynasty 8 Minutes of New Gameplay", "description": "Set in a dark fantasy version of China during its warring Three Kingdoms period of history, Wo Long: Fallen Dynasty is aiming to be bigger in scale than Team Ninja's Nioh games and even more challenging.\n\nWhile Wo-Long: Fallen Dynasty will launch on Xbox One and Xbox Series X|S as a day-one Game Pass title--it'll also be available on PC, PS5, and PS4 on March 3, 2023. \n#Gaming #WoLongFallenDynasty #Gamespot", "link": "https://www.youtube.com/watch?v=YBIa99gulDM", "date_published": "2022-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Day of the Devs Showcase 2022 Livestream", "description": "Tune in November 3rd at 10am PT for Day of the Devs! This digital showcase will feature amazing indie games and the passionate developers that make them.\r\n\r\n#gaming", "link": "https://www.youtube.com/watch?v=pLTfX838Bgs", "date_published": "2022-11-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God Of War Ragnarok PS5 vs PS4 Comparison", "description": "We take a look at God Of War Ragnarok graphical differences on a base PS4 in 1080p, and compare it to PS5's 4K version with fidelity mode on.\n\n0:00 Combat Side By Side\n0:22 Top/Bottom Comparison\n2:01 Wiped Comparison\n3:05 Top/Bottom Comparison 2\n3:41 PS5 Raw Gameplay\n4:48 PS4 Raw Gameplay\n5:38 Split Comparison\n\n\n#godofwarragnarok #godofwar #gaming", "link": "https://www.youtube.com/watch?v=yf1uHJ-4iB0", "date_published": "2022-11-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War Ragnarok Review", "description": "Sony Santa Monica brings back what made the original God of War reboot great and delivers another fantastic story with exceptional writing.\n\n#godofwarragnarok #gamespot #gaming", "link": "https://www.youtube.com/watch?v=veulTkE_QZE", "date_published": "2022-11-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War Ragnarok Review Roundup | GameSpot News", "description": "God of War Ragnarok reviews are here, a tease at a second Warzone 2.0 map, and Modern Warfare 2 gets its first post launch patch. All this on today’s GameSpot News.\n#Gaming #GodOfWarRagnarok #Warzone2.0 \n\nGod of War Ragnarok reviews are here, a tease at a second Warzone 2.0 map, and Modern Warfare II gets its first post launch patch. All this on today’s GameSpot News.\n\nRagnarok Reviews are here, and it sounds like the game Ragnarocks. \n\nLook. I’m sorry. I tried to write this script and not make that joke, but I just couldn’t do it. I promise it’s the only one.\n\nOn Metacritic, which, full disclosure, is a sister site to GameSpot, the game at the time of recording has a 94 avg based on 112 reviews. That is the exact same score its 2018 predecessor has on the site as well based on 118 reviews.\n\nOur own review from Tamoor Hussain states, “God of War Ragnarok is a lavish production with pristine visuals, jaw-dropping scale, crunchy combat that is as satisfying as it is brutal, and a world that begs to have its every corner and crevice explored.” Hussain’s singular gripe with the game stems from elements of its combat, noting, “ the mechanics can struggle under the pressure of the increased speed and aggression [as the game progresses]”\n\nLeon Hurley at Games Radar has some light criticism of the game’s first half, saying, “I found God of War Ragnarok an oddly split experience overall. There's a light start that feels padded – still good but missing depth – which leads into a weighty finish that's every bit the equal of its predecessor.”\n\nGame Informer’s Kyle Hilliard, who used to be GameSpot’s Kyle Hilliard — they won him over by saying he could review Ragnarok, I’m sure — writes, “God of War Ragnarök feels a lot like God of War (2018), which is a compliment considering how fantastic that game is. Sony Santa Monica was right to not break what wasn't broken and it has expertly continued the story threads that were left hanging from the previous game. Any complaints about the overall experience (familiar combat, collecting and leveling up equipment isn't particularly interesting) are quickly forgotten in the face of the compelling narrative, believable character relationships, and incredible visuals and animation.”\n\nNot too Badnarok. \n\nTIMESTAMPS: \n00:14 - Ragnarok review roundup\n02:15 - Warzone 2.0 map easter egg\n03:15 - Modern Warfare 2 patch", "link": "https://www.youtube.com/watch?v=JTZNLwCOD6M", "date_published": "2022-11-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War Ragnarok: The Mythology Behind the End of the World", "description": "Ragnarök is coming, and Kratos and Atreus will soon find themselves facing the end of the world itself. Yet, as the great battle with the most dangerous of Aesir approaches, let’s look at the history of behind the Norse apocalypse, Ragnarok itself, to see what that might mean for God of War Ragnarok.", "link": "https://www.youtube.com/watch?v=FWwgkfPtZks", "date_published": "2022-11-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sonic Frontiers Showdown Official Trailer", "description": "It's almost time. Explore the Starfall Islands, gather the Chaos Emeralds, and get ready for the showdown of a lifetime in Sonic Frontiers.\n\nSonic Frontiers releases on November 8th, 2022 on PlayStation 4, PlayStation 5, Xbox Series X and S, Nintendo Switch, and Steam!", "link": "https://www.youtube.com/watch?v=ciO7N6Y6frE", "date_published": "2022-11-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]