[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC9lKBRxxsDIarUmNaPe0h0Q", "title": "The most secret bank in the world", "description": "✉️ OUR NEWSLETTER: https://www.abundantia.co/\n📚 OUR COURSE/MEMBERSHIP: http://jointheorder.co/\n\nThis is the most secret bank in the world. Called the \"Istituto per le Opere di Religione\", or the Institute for the Works of Religion, the IOR has secrets and mystery that go back more than a century. And controversies that still abound today.\n\nCreated in the 1940s, its history actually goes back much further to the founding of the Vatican itself in 1929. An event that had much to do about money, that was helped along via donations of cash and land from Italian dictator Benito Mussolini. Since then, the Church's secret bank has done all it can to hide its financial dealings over the years.\n\nToday, the Catholic Church has said that it wants to do all it can to change the sordid history of the Vatican bank. However, as you'll see in the video, it seems like not all its strange dealings are behind it.\n\nI'd love to hear your thoughts below.\n\n0:00 - God's bankers\n0:30 - The founding of the Vatican bank\n2:19 - Early IOR controversies\n4:29 - The Vatican bank's modern problems\n7:17 - Are things changing?\n\n► IMPORTANT LINKS:\nEnter your email via the link below for free weekly lessons and insights into becoming financially free, investing, global tax and corporate structures, passports, residencies, and more.\nJOIN: https://www.abundantia.co/\n\n► SOCIAL MEDIA:\n• Abundantia Instagram: @abundantia.co https://www.instagram.com/abundantia.co/\n• Sorelle's Instagram: @sorelleamore  https://instagram.com/sorelleamore\n• Leon's Instagram: @leonhill  https://instagram.com/leonhill\n• Abundantia Twitter: https://twitter.com/abundantiaco\n• Abundantia Facebook: http://facebook.com/abundantiafinance\n\nSorelle and Leon.\nFounders, Abundantia\n\nLiability Disclaimer: https://www.abundantia.co/disclaimer\n*We may earn a commission if you buy any products or services via the links in this video's description. This video is not investment, financial, or legal advice. It may be incorrect, outdated, inaccurate, or reflect personal opinions. This video is for entertainment purposes only.\n\nPresented by Sorelle Amore.\nWritten by Leon Hill.\n\n#Vatican #VaticanBank #IOR", "link": "https://www.youtube.com/watch?v=eT7HEIc5RoM", "date_published": "2022-11-03 15:04:10+00:00", "persistent": false, "user": null, "language": "en-US"}]