[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "15 Things You Never Knew About Uncharted", "description": "The Uncharted franchise is about many things, but secrets and treasure might be at the top of that list. Here are 15 things you may not know about the series. \n\nSince the first game in 2007, the Uncharted series from Naughty Dog has been packing its games with treasure hunts for Nathan Drake as well as easter eggs for the player. However, the reference to old Naughty Dog games aren’t the only secrets around the series.  \n\nIn this video, we’re talking about a handful of things you may not know about the Uncharted franchise. From the original inspiration for Nathan Drake, to his greatest fear and the original story concepts for series spin-off, The Lost Legacy. \n\nUncharted: The Legacy of Thieves Collection released on PlayStation 5 and PC on January 28, 2022. The PS5 version features 3 modes: fidelity, which runs at 4K at 30fps. Performance, which runs at 1440p at 60fps and Performance +, which runs at 1080p at 120fps.\n\nSTAMPS\n00:00 - Intro\n00:18 - Original inspiration for Nate\n00:52 - Harrison Ford Commercial\n01:46 - Uncharted movie changes\n02:30 - Nate's age throughout the series\n02:59 - Cassie's namesake\n03:05 - Nate's real last name\n03:26 - Vicky's namesake\n03:46 - Daxter wetsuits\n04:12 - Crash Bandicoot plane\n04:22 - TLoU reference\n05:00 - LittleBigPlant reference\n05:12 - Nate's luck meter\n05:54 - Sam's original role in UC4 \n06:33 - Nadine's original role in UC4\n06:43 - The Lost Legacy alternatives \n07:13 - Bonus: Nate's biggest fear", "link": "https://www.youtube.com/watch?v=or5IBAdMmLo", "date_published": "2022-01-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Legends: Arceus - Space-Time Distortion Event Gameplay", "description": "The Space Time Distortion is a random event that can occur in the Hisui region at any time and brings with strong Pokémon and valuable items. In this video we have over 8 minutes of catching, dodging, and battling a bunch of different Pokémon while doing our best to keep our team from fainting!\n\nPokémon: Legends Arceus is out now, and we've got some sick gameplay showing off one of the more interesting parts of the Hisui region: the random and rare Space-Time Distortion mini-event. In this video, we're going to show over 8 minutes of gameplay of us going into these distortion fields and engaging with several powerful Pokémon.\n\nThe game has vast open areas where wild Pokémon will roam, but if you linger in a region long enough, a notification will appear that a Space-Time Distortion field is nearby. There's not a lot of information explaining why these fields occur, but if you explore one of them, you'll quickly notice a lot of powerful and, at times, aggressive Pokémon appearing.\n\nThe distortion field shows dangerous Pokémon, but there are plenty of rare items on the ground, too, like Nuggets or even evolution items like the Electirizer. You'll also notice two clips: the first is our original experience with the field where we didn't know what to expect. The second half of the video is in the distortion field with a stronger team, which means more successful battles and catches!\n\nIf you want more Pokémon, subscribe to our channel, as we'll have plenty of guides and features for Pokémon Legends: Arceus coming your way!\n\n#Pokemon", "link": "https://www.youtube.com/watch?v=GCDM_iQwpsE", "date_published": "2022-01-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sekiro Speedrunner Breaks Down Blindfold GDQ Run", "description": "At AGDQ 2022, Mitchriz completed Sekiro: Shadows Die Twice in just over two hours completely blindfolded. Watch as he breaks down his incredible run, including facing off against the troublesome Blazing Bull.\n\nCheck out Mitchriz on Twitch! https://www.twitch.tv/mitchriz\nCheck out the full Sekiro blindfold run: https://youtu.be/FQeeRBtQgzE\nSupport GDQ: https://gamesdonequick.com/ \n\n00:00 Intro\n00:18 How to speedrun Sekiro blindfolded\n00:55  Gyoubu Oniwa boss fight blindfolded\n04:02 Blazing Bull boss fight\n07:50 Genichiro Ashina boss fight\n10:10 Guardian Ape boss fight\n12:29 Emma, the Gentle Blade and Isshin Ashina boss fight\n17:52 Outro, Mist Noble boss fight\n\n#sekiro #AGDQ2022 #speedrun", "link": "https://www.youtube.com/watch?v=yretQdE_kfY", "date_published": "2022-01-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Canceled Star Wars 1313 Game Footage Released | GameSpot News", "description": "New footage Of canceled Star Wars 1313 game is revealed, Hyper Scape servers are shutting down April 28, and Xbox Games With Gold Free Games for February 2022 revealed.\n\nIn this video, DeVante talks about new footage of the canceled Star Wars: 1313 being unearthed by The Vault. This game was originally revealed at E3 2012, and would have seen players descend into the criminal underworld of the Galactic Empire's capital city, Coruscant.\n\nDeVante also talks about the games being offered in February for Xbox Games with Gold, as well as the shut down of Ubisoft’s Hyper Scape in April. \n\nSTAMPS\n00:00 - INTRO\n00:08 - Star Wars 1313\n02:10 - February Game with Gold\n02:45 - Hyper Scape Getting Shut down", "link": "https://www.youtube.com/watch?v=6SNtsEJm_8Y", "date_published": "2022-01-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PS Plus February Games Revealed… Let The Crumpocalypse Begin | GameSpot News", "description": "In today’s episode of GameSpot News, Persia talks about February's PS Plus games, the next few Call Of Duty’s releasing on PlayStation, and more. \n\nVideo Notes:\nThe February PS Plus line-up will include EA Sports UFC 4, Planet Coaster: Console Edition, and Tiny Tina's Assault on Dragon Keep: A Wonderlands One-Shot Adventure. All three will be available starting Tuesday, February 1.\n\nLater in the video, Persia goes over the report that Activision Blizzard are committed to releasing the next three entries in the Call of Duty series on PlayStation, following its impending buyout by Microsoft.\n\nAnd Lastly, Persia talks about the possibility of another Uncharted game after Naughty Dog dev says “Never say never.”\n\nFor more information on all of our topics, please visit gamespot.com.\n\nTimestamps:\nIntro - 00:00\nPS Plus - 00:08\nCall Of Duty - 01:06\nUncharted - 02:17\nOutro - 03:22", "link": "https://www.youtube.com/watch?v=KdyNzG14f24", "date_published": "2022-01-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Elder Scrolls Online Global Reveal Livestream", "description": "Learn about The Elder Scrolls Online's next big adventure! Discover the new lands, characters, and dangers coming to Tamriel in 2022.", "link": "https://www.youtube.com/watch?v=DVNSIhJgJ_Y", "date_published": "2022-01-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]