[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Data, we want it all, and we want it now", "description": "And we want it now.\n\nCovid-19 vaccines and treatments: we must have raw data, now\nhttps://www.bmj.com/content/376/bmj.o102\n\nData should be fully and immediately available for public scrutiny\n\n2009 - 2012\n\nhttps://clinicaltrials.gov/ct2/show/NCT04368728\n\nGovernments spent billions stockpiling Tamiflu\n\nMajority of trials sponsored by manufacturer\n\nPapers ghostwritten, paid by the manufacturer\n\nAcademics who requested access to the data for independent analysis were denied\n\nGodlee  F. We want raw data, now. BMJ2009;339:b5405doi:10.1136/bmj.b5405. \nFREE Full TextGoogle Scholar\n\nGodlee  F, Clarke  M Why don’t we have all the evidence on oseltamivir?BMJ2009;339:b5351.doi:10.1136/bmj.b5351 pmid:19995815\nFREE Full TextGoogle Scholar\n\nCohen  D Complications: tracking down the data on oseltamivir. BMJ2009;339:b5387.doi:10.1136/bmj.b5387 pmid:19995818\nFREE Full TextGoogle Scholar\n\nDoshi  P Neuraminidase inhibitors—the story behind the Cochrane review. BMJ2009;339:b5164.doi:10.1136/bmj.b5164 pmid:19995813\nFREE Full Text\n\nToday\n\nDespite the global rollout of covid-19 vaccines and treatments, \n\nthe anonymised participant level data underlying the trials for these new products remain inaccessible to doctors, researchers, and the public\n\nThis is morally indefensible for all trials, but especially for those involving major public health interventions.\n\nPfizer’s pivotal covid vaccine trial, designed, run, analysed, and authored by Pfizer employees. \n\nThe company and the contract research organisations that carried out the trial hold all the data.\n\nPfizer has indicated that it will not begin entertaining requests for trial data until May 2025, (NCT04368728).\n\nModerna data\n\nmay be available … with publication of the final study results in 2022\n\nDatasets will be available upon request and subject to review once the trial is complete\n\nEestimated primary completion date 27 October 2022 (NCT04470427).\n\n\n\nAstraZeneca\n\nAs of 31 December 2021 \n\ntimelines vary per request and can take up to a year upon full submission of the request\n\nRegeneron’s phase III trial of monoclonal antibody therapy REGEN-COV\n\nParticipant level data will not be made available to others EMU)\n\nShould the drug be approved, sharing will be considered\n\nRemdesivir\n\nUS National Institutes of Health, (funders) The longitudinal data set only contains a small subset of the protocol and statistical analysis plan objectives\n\nIn our view, there is no dilemma\nthe anonymised individual participant data from clinical trials must be made available for independent scrutiny.\nUS Food and Drug Administration, freedom of information request to the agency for Pfizer’s vaccine data\n\nUK, Medicines and Healthcare Products Regulatory Agency\n\ndoes not proactively release clinical trial documents\n\nTransparency and trust\n\nTransparent decision making is essential. \n\nAt least three of the many companies making covid-19 vaccines have past criminal and civil settlements costing them billions of dollars\n\nThe BMJ supports vaccination policies based on sound evidence. \n\nThe same applies to treatments for covid-19 \n\nData must be available when trial results are announced, published, or used to justify regulatory decisions. \n\nThere is no place for wholesale exemptions from good practice during a pandemic. \n\nThe public\n\nHas paid for covid-19 vaccines through vast public funding of research\n\nthat takes on the balance of benefits and harms\n\nhas a right and entitlement to those data, as well as to the interrogation of those data by experts.\n\nPharmaceutical companies are reaping vast profits without adequate independent scrutiny of their scientific claims.\n\nThe purpose of regulators is not to dance to the tune of rich global corporations and enrich them further; \n\nit is to protect the health of their populations. \n\nWe need complete data transparency for all studies, we need it in the public interest, and we need it now.", "link": "https://www.youtube.com/watch?v=YDxkloJ-4kE", "date_published": "2022-01-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Omicron BA. 2 will displace BA. 1", "description": "Omicron is out competing omicron\n\nCurrent symptoms\n\nRunny nose, 73%\n\nHeadache, 68%\n\nFatigue, 64%\n\nSneezing, 60%\n\nSore throat, 60%\n\nPersistent cough, 44%\n\nHoarse voice, 36%\n\nChills or shivers, 30%\n\nFever, 29%\n\nDizzy, 28%\n\nBrain fog, 24%\n\nAltered smell, 23%\n\nSore eyes, 23%\n\nUnusual muscle pains, 23%\n\nSkipped meals, 21%\n\nLoss of smell, 19%\n\nChest pain, 19%\n\nSwollen glands, 19%\n\nFeeling down, 16%\nONS\n\nhttps://www.ons.gov.uk/peoplepopulationandcommunity/healthandsocialcare/conditionsanddiseases/articles/coronaviruscovid19/latestinsights\n\nhttps://www.ons.gov.uk/peoplepopulationandcommunity/healthandsocialcare/conditionsanddiseases/articles/coronaviruscovid19latestinsights/deaths#pre-existing-health-conditions\n\nPrevalence, week ending 22 January 2022\n\nEngland, 2,629,400 people, 1 in 20\n\nWales, 99,500 people, 1 in 30\n\nScotland, 163,600 people, 1 in 30\n\nNorthern Ireland, 96,500 people, 1 in 20\n\nDouble vaccinated less likely to report long COVID\n\nCompared to unvaccinated when infected\n\n41.1% decrease in the likelihood of self-reported long COVID at least 12 weeks later \n\nRisk of COVID-19 death higher for most ethnic minority groups\n\nRisk of death involving COVID-19 was higher for people from all ethnic minority groups,\n\nexcept for Chinese men and women\n\nBangladeshi group\n\nWomen, 5.2 times higher than White British group\n\nMen, 4.4 times higher than White British group\n\nZoe, Omicron bounces back\n\nhttps://covid.joinzoe.com/post/omicron-bounces-back\n\n159,486 new daily symptomatic cases of COVID in the UK\n\nAn increase of 10% from 144,527 reported last week\n\nUK R value, around 1.0 \n\nPrevalence\n\nOne in 30 people in the UK currently have symptomatic COVID\n\nProfessor Tim Spector\n\nEnd of school holidays repeatedly usher in a rapid rise in cases among children\n\nA new subtype of Omicron is taking over called BA.2\n\nOne in 20 new cases had this variant last week, and as it's doubling every few days,\n\nthis should predominate within a month. \n\nNatural infection with Delta may not offer much protection. \n\nI expect that cases will continue to stay high until spring. \n\nMost vaccinated infections are mild, \n\nwith symptoms lasting on average for a shorter time than Delta\n\nwith less severe cases. \n\nVulnerable groups\n\nUK data\n\nhttps://coronavirus.data.gov.uk\n\nUS cases and deaths data\n\nhttps://covid.cdc.gov/covid-data-tracker/#trends_dailycases\n\nSouth Africa references\n\nhttps://twitter.com/rid1tweets\n\nhttps://www.nicd.ac.za/diseases-a-z-index/disease-index-covid-19/surveillance-reports/daily-hospital-surveillance-datcov-report/", "link": "https://www.youtube.com/watch?v=xMLZepCMFQo", "date_published": "2022-01-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]