[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Contest Top Shelf: Bob Boilen, iLe and Michelle Zauner of Japanese Breakfast", "description": "NPR Music received thousands of submissions to this year's Tiny Desk Contest, our annual search for the next great undiscovered artist to play a Tiny Desk concert. Before we reveal this year's winner, our Contest judges are sharing their favorite entries as part of our annual Tiny Desk Contest Top Shelf livestream series.\n\nFeatured entries:\n- Pocket Queen & The Royal Flush, “WE CAME TO MOVE” https://www.youtube.com/watch?v=5UMaYqBYSj4 \n- Aubrey Hays, \"Love Didn't Hurt You\" https://www.youtube.com/watch?v=rIGm3syX424 \n- Micah Edwards Jean Leon https://www.youtube.com/watch?v=fP16uCTpfAI \n- Alisa Amador Milonga accidental https://www.youtube.com/watch?v=g6SFOXXeV4c \n- Raine Stern, “Lydia” https://www.youtube.com/watch?v=zu1GPL2Xc8I\n- Piquete, “Fluir” https://www.youtube.com/watch?v=GhfbKJUc0Q8 \n- Ollella, “Lava” https://www.youtube.com/watch?v=zkmZcHsI6jw \n- John Ferrara, “Perhaps Everything, Perhaps Nothing” https://www.youtube.com/watch?v=96fsJ4tMdSI \n\nLearn more about the Contest: https://npr.org/tinydeskcontest", "link": "https://www.youtube.com/watch?v=7Ur_455ttZY", "date_published": "2022-05-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Ron Carter: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nNikki Birch | May 4, 2022\nThe velvety sapphire of what may be the most recognizable curtains in jazz are the backdrop for this special Tiny Desk (home) concert. Dapper and distinguished in matching ties, legendary bassist Ron Carter and the members of his trio sit comfortably on the prestigious stage of The Blue Note in Manhattan. This is jazz with a capital J, complete with cocktails and \"Candlelight.\" The first tune in this set romances us, inviting deep sighs as the lushness of the trio's intricate interplay carries us away to moments spent gazing deeply into the eyes of a lover.\n\nRon Carter's career spans 60 years. It includes playing with the greatest of the greats in jazz, plus film scoring, teaching, writing and numerous awards, from Grammys to a Guinness World Record as the most-recorded bassist in history. After the first song of this set ends, the soft-spoken maestro in pinstripes gives a simple introduction; then, we are treated to a taste of his mastery with a solo bass performance entitled \"Blues for Tiny Desk.\"\n\nRussell Malone and Donald Vega again join Carter for the final song, \"Eddie's Theme.\" The way they share sonic space is truly a testament to the sense of community that jazz fosters. We see how they exchange glances, looking and listening as they give space and support each other musically, celebrating free expression. We are honored and delighted to join in the celebration as we wish this jazz luminary a very happy 85th birthday today. May the 4th be with you.\n\nSET LIST\n\"Candlelight\"\n\"Blues for Tiny Desk\"\n\"Eddie's Theme\"\n\nMUSICIANS\nRon Carter: bass\nDonald Vega: piano\nRussell Malone: guitar\n\nCREDITS\nA Partisan Pictures Production\nProduced by: Simone Banos and Penny Kjellberg\nDirected by: Peter Schnall\nVideo Editor: Andrew Baker\nCamera: Andrew Baker and Peter Schnall\nAssociate Producer: Lena Schnall\nAudio by: Alex Glasgow\nTechnical Manager: Sergio Larios\nSpecial Thanks: Blue Note Jazz Club and Blue Note Entertainment Group\n\nTINY DESK TEAM\nProducer: Nikki Birch\nVideo Producer: Joshua Bryant\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Michael Zamora, Maia Stern, Ashley Pointer\nVP, NPR Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #roncarter", "link": "https://www.youtube.com/watch?v=9ix2DCAzDp0", "date_published": "2022-05-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]