[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Childhood viral hepatitis – Vulnerabilities and the Chickenpox (Varicella) Vaccine", "description": "Thank you Rachel and Tom Barker for sharing your daughters recent illness and treatment, together with the need for chicken pox vaccinations. We all wish Clara and yourselvs the best possible outcomes.\nSummary of the USA status on Chickenpox (Varicella) and the benefits of the vaccine - Centers for Disease Control and Prevention (CDC) – Chickenpox (Varicella) in the United States - https://www.cdc.gov/chickenpox/about/index.html \n\nSummary of the need for representative Chickenpox (Varicella) modelling in the UK- https://www.ox.ac.uk/research/everything-you-need-know-about-chickenpox-and-why-more-countries-don%E2%80%99t-use-vaccine\n\nPlanning for new Chickenpox (Varicella) Vaccine modelling - The Joint Committee on Vaccination and Immunisation (JCVI) Minutes - https://www.gov.uk/government/groups/joint-committee-on-vaccination-and-immunisation#minutes\n\nChickenpox (Varicella) key facts - Oxford University - Chickenpox (Varicella) Vaccine - https://vk.ovg.ox.ac.uk/vk/chickenpox-varicella-vaccine", "link": "https://www.youtube.com/watch?v=Ap76Uq5JLS4", "date_published": "2022-10-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Who fact checks the fact checkers", "description": "Now all of the facts were equal, but some facts were more equal than others.\n\nInstitute for Scientific Freedom\n\nhttps://www.scientificfreedom.dk/strategy/?utm_source=substack&utm_medium=email\n\n1 All science should strive to be free from financial conflicts of interest.\n\n2 All science should be published as soon as possible and made freely accessible.\n\n3 All scientific data, including study protocols, should be freely accessible, allowing others to do their own analyses.\n\nOpen letter from BMJ to Facebook about inappropriate censoring of serious data integrity issues in Pfizer’s COVID-19 vaccine trial\n\nhttps://www.scientificfreedom.dk/2021/12/18/open-letter-from-bmj-to-facebook-about-inappropriate-censoring-of-serious-data-integrity-issues-in-pfizers-covid-19-vaccine-trial/\n\nhttps://www.bmj.com/content/375/bmj.n2635/rr-80\n\nFiona Godlee, editor in chief\n\nKamran Abbasi, incoming editor in chief\nThe BMJ\n\nCompeting interests:\n\nAs current and incoming editors in chief, we are responsible for everything The BMJ contains.\n\nDear Mark Zuckerberg,\n\nThe BMJ, one of the world’s oldest and most influential general medical journals. \n\nhttps://www.bmj.com/about-bmj/history-of-the-bmj\n\n3rd October 1840\n\nSerious concerns about the “fact checking” \n\nbeing undertaken by third party providers on behalf of Facebook/Meta.\n\nIn September, a former employee of Ventavia, a contract research company helping carry out the main Pfizer covid-19 vaccine trial, began providing The BMJ with dozens of internal company documents, photos, audio recordings, and emails.\n\nThese materials revealed a host of poor clinical trial research practices occurring at Ventavia that could impact data integrity and patient safety. \n\nWe also discovered that, despite receiving a direct complaint about these problems over a year ago, the FDA did not inspect Ventavia’s trial sites.\n\nThe BMJ commissioned an investigative reporter to write up the story for our journal. \n\nThe article was published on 2 November, (2021) following legal review, external peer review and subject to The BMJ’s usual high level editorial oversight and review.\n\nCovid-19: Researcher blows the whistle on data integrity issues in Pfizer’s vaccine trial\n\nhttps://www.bmj.com/content/375/bmj.n2635\n\nBut from November 10, readers began reporting a variety of problems when trying to share our article. \n\nSome reported being unable to share it. \n\nMany others reported having their posts flagged with a warning about “Missing context … Independent fact-checkers say this information could mislead people.” \n\nThose trying to post the article were informed by Facebook that people who repeatedly share “false information” might have their posts moved lower in Facebook’s News Feed. \n\nGroup administrators where the article was shared received messages from Facebook informing them that such posts were “partly false.”\n\nReaders were directed to a “fact check” performed by a Facebook contractor named Lead Stories.\n\nFact Check: The British Medical Journal Did NOT Reveal Disqualifying And Ignored Reports Of Flaws In Pfizer COVID-19 Vaccine Trials\n\nhttps://leadstories.com/hoax-alert/2021/11/fact-check-british-medical-journal-did-not-reveal-disqualifying-and-ignored-reports-of-flaws-in-pfizer-vaccine-trial.html\n\nWe find the “fact check” performed by Lead Stories to be inaccurate, incompetent and irresponsible.\n\n– It fails to provide any assertions of fact that The BMJ article got wrong\n\n– It has a nonsensical title: “Fact Check: The British Medical Journal Did NOT Reveal Disqualifying And Ignored Reports Of Flaws In Pfizer COVID-19 Vaccine Trials”\n\n– The first paragraph inaccurately labels The BMJ a “news blog”\n\n– It contains a screenshot of our article with a stamp over it stating “Flaws Reviewed,” despite the Lead Stories article not identifying anything false or untrue in The BMJ article\n\n– It published the story on its website under a URL that contains the phrase “hoax-alert”\n\nWe have contacted Lead Stories, but they refuse to change anything about their article or actions that have led to Facebook flagging our article.\n\nWe have also contacted Facebook directly, requesting immediate removal of the “fact checking” label and any link to the Lead Stories article, thereby allowing our readers to freely share the article on your platform.\n\nThere is also a wider concern that we wish to raise. \n\nWe are aware that The BMJ is not the only high quality information provider to have been affected by the incompetence of Meta’s fact checking regime.\n\nTo give one other example, we would highlight the treatment by Instagram (also owned by Meta) of Cochrane, the international provider of high quality systematic reviews of the medical evidence.\n\nhttps://twitter.com/cochranecollab/status/1458439812357185536", "link": "https://www.youtube.com/watch?v=YuqDu9ZCP_c", "date_published": "2022-10-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Florida changes vaccine advice for young men", "description": "Florida, Guidance for mRNA COVID-19 Vaccines \n\nOctober 7, 2022 \n\nhttps://floridahealthcovid19.gov/wp-content/uploads/2022/10/20221007-guidance-mrna-covid19-vaccines-doc.pdf\n\nFlorida continues to emphasize that health care providers review all data to evaluate risks and benefits unique to each patient when determining any health care services to provide, \n\nincluding the administration of COVID-19 vaccines containing Messenger RNA (mRNA) which both the Pfizer- BioNTech and the Moderna vaccines utilize. \n\nThe Florida Department of Health (Department) conducted an analysis through a self-controlled case series, \n\nhttps://www.bmj.com/content/354/bmj.i4515\n\na technique originally developed to evaluate vaccine safety. \n\nThis studied mortality risk following mRNA COVID-19 vaccination. \n\nThis analysis found there is an 84% increase in the relative incidence of cardiac-related death among males 18-39 years old within 28 days following mRNA vaccination. \n\nIndividuals with preexisting cardiac conditions, such as myocarditis and pericarditis, \n\nshould take particular caution when considering vaccination and discuss with their health care provider. \n\nFlorida Department of Health has issued the following guidance: \n\nBased on currently available data, \n\npatients should be informed of the possible cardiac complications that can arise after receiving a mRNA COVID-19 vaccine. \n\nWith a high level of global immunity to COVID-19, \n\nthe benefit of vaccination is likely outweighed by this abnormally high risk of cardiac- related death among men in this age group. \n\nThe State Surgeon General now recommends against the COVID-19 mRNA vaccines for males ages 18-39 years old. \n\nMales over the age of 60 had a 10% increased risk of cardiac-related death within 28 days of mRNA vaccination. \n\nNon-mRNA vaccines were not found to have these increased risks among any population. \n\nFloridians are encouraged to discuss all the potential benefits and risks of receiving mRNA COVID-19 vaccines with their health care provider. \n\nThe risk associated with mRNA vaccination should be weighed against the risk associated with COVID-19 infection. \n\nThe Department continues to stand by its Guidance for Pediatric COVID-19 Vaccines \n\nhttp://ww11.doh.state.fl.us/comm/_partners/covid19_report_archive/press-release-assets/g2-jtr_QWBT4hJpqr_20220308-1923.pdf\n\n(issued March 2022), \n\nwhich recommends against use in healthy children and adolescents 5 years old to 17 years old. \n\nThis now includes recommendations against COVID-19 vaccination among infants and children under 5 years old, \n\nwhich has since been issued under Emergency Use Authorization. \n\nYT Guidelines\n\nCOVID-19 medical misinformation policy\n\nhttps://support.google.com/youtube/answer/9891785\n\nClaims about COVID-19 vaccinations that contradict expert consensus from local health authorities or the WHO\n\nhttps://support.google.com/youtube/answer/11161123\n\nVaccine safety: content alleging that vaccines cause chronic side effects, outside of rare side effects that are recognised by health authorities\n\nEfficacy of vaccines: content claiming that vaccines do not reduce transmission or contraction of disease \n\nIngredients in vaccines: content misrepresenting the substances contained in vaccines", "link": "https://www.youtube.com/watch?v=JRPkfGKI5ao", "date_published": "2022-10-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]