[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Santigold: Tiny Desk Concert", "description": "Stephen Thompson | November 21, 2022\nThe Tiny Desk often forces radical changes to an artist's sound and style, but Santigold faced more than most. There was the live band assembled for the occasion, which included George Lewis Jr. (aka Twin Shadow) on bass and drummer Chuck Treece, who's worked with everyone from Bad Brains to Billy Joel. There was the lack of a microphone — and, by extension, vocal amplification — not to mention the fact that, as Santigold herself noted, \"I don't know what I'm doing up here with no dancers.\"\n\nFortunately, Santi White has been revising and reinventing her sound for two decades now. If anything, performing her genre-straddling R&B and electro-pop with a live band represented a return to roots, given that she'd spent the early aughts singing in the punk band Stiffed — with Treece on drums, in fact. Everything about this set feels like the culmination of hard work, from the custom arrangements to the singer's hair/hat combo, an architectural marvel that warrants closer inspection. Given that Santigold had canceled her North American tour weeks earlier — she flew into D.C. for this occasion — it's a wonder her Tiny Desk debut even happened. Thank goodness it did.\n\nSET LIST\n\"L.E.S. Artistes\"\n\"I'm A Lady\"\n\"Shake\"\n\"Fall First\"\n\"Ain't Got Enough\"\n\nMUSICIANS\nSantigold (Santi White): vocals\nRay Brady: guitar, synth \nChuck Treece: drums \nGeorge Lewis, Jr. (Twin Shadow): bass \nMelanie Nyema: background vocals \nStephany Mora: background vocals \n\nTINY DESK TEAM\nProducer: Abby O'Neill\nDirector/Editor: Maia Stern\nAudio Engineer: Josh Rogosin\nCreative Director: Bob Boilen\nSeries Producer: Bobby Carter\nVideographers: Maia Stern, Joshua Bryant, Michael Zamora, Sofia Seidel\nAudio Assistant: Natasha Branch\nProduction Assistant: Jill Britton\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Kara Frame, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #santigold", "link": "https://www.youtube.com/watch?v=IG76Rf28MQA", "date_published": "2022-11-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]