[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCy0tKL1T7wFoYcxCe0xjN6Q", "title": "A Complete Beginner's Guide to Electric Vehicles", "description": "That is what this video is. It's a lot simpler than you think!\nLinks 'n' stuff\nReferenced videos:\nElectric car chargers aren't chargers at all — EVSE Explained\nhttps://youtu.be/RMxB7zA-e4Y\n\nThe tech which can charge an electric car in 10 minutes (DC Fast Charging)\nhttps://youtu.be/sZOuz_laH9I\n\n2nd channel discussion\nhttps://www.youtube.com/watch?v=1WuJtcgExa8\n\nTechnology Connections on Twitter:\nhttps://twitter.com/TechConnectify\nThe TC Subreddit\nhttps://www.reddit.com/r/technologyconnections\n\nThis channel is supported through viewer contributions on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!\nhttps://www.patreon.com/technologyconnections\n\nOh, and look at these wonderful patrons!\nJacob Francis, ShoddyCast , Casa De Nyquil, Alice V, Kang Seonghoon, Thomas Bohmbach, Jr., Jeff Andrews, Enrique Gutierrez, Magnus Kvevlander, Mr. Kitty, Zefram Marks, Zach Matthews, Andrew Dunham, Darryl Smith, Kirit Sælensminde, Roger, L8 4 Tea, Dustin Schoenbrun, Candice Colby, Kain Mahaney, Dick Jones, Palyk , Barrett Olson, Dan Turner, Maddie Goldberg, Pierce Staab, João Andrade, JP Addison, Marcus, Lancaster, SnorkY2K, Diego Elio Pettenò, Chris, Rick Egli, Mike V, John Malkin, Trltexx , Tobias Wooldridge, Chris Johnston, Thomas Lovell, Karunamon, Daniel Miles-Sackett, Stephen Edmonds, Petr Petras, Alex Hall, Jtwenty7 , Just Roy, Jade Sharpe, Peter Springer, Domas Šiaudvytis, Erik Padgen, James Robertson, JDubs, David H, John Bradley, Sam Martinez, Jason A. Diegmueller, David Shaffer, Scott Earle, Lucas, Paul Hart, Jennifer Skahen, Techdisk, Mark I Sullivan, Yashwin Pamecha, Alan Cooper, Mark Cockrell, Jesse Lang, Jeff Sowell, Nicholas Menghini, Caledron, Edward Aten, Scyler Yang, Michael Parlier, Jorge Luis Borges, Cate Stock, Brett , Dale Green, Lou Paris, Erik Granlund, Kerbal01, Jessamyn De Vos, Dianna Black, Ken Snider, Bish, Sam Carl, Paul Bernard, Matt, Colin O, Tom McMahon, Moon moon, Alexandra Robison, Sembiance , Brandon Lewis, Derek Cowburn, Devil of the Ceilingful Mount, Bennett Staley, David Wedekemper, Jason Banich, Ed O'Brien, Edverything , Noah b, Ian C, Aaron Bruce, Onigiri-Kun , Joshua (InexorableTash) Bell, Raena Jackson Armitage, popular_penguin, Nicholas H (TheNH813), David Greve, Nick Kirk, Adam Steele, Clara Schultz, Kevin DeGraaf, James Ribe, Charles Keisler, Rinnn Tosaka, mikebad, Dr. Clyde H. Hedgcoth Jr.\n\n00:00 Intro\n02:35 Understanding Energy and Electric Vehicles\n10:36 Power and Charging Speed\n16:27 Charging Solution to Fit Your Needs\n19:15 Level 1 Charging (charging from a household outlet)\n23:51 Level 2 Charging - Installation options\n28:09 Sizing a New Charging Circuit\n32:34 How far an overnight charge will take you\n34:43 Basic charging circuits are powerful\n37:42 Multi-car families\n40:24 DC Fast Charging\n46:49 Factors which affect driving range\n55:32 Conclusion\n56:48 Bloopers", "link": "https://www.youtube.com/watch?v=Iyp_X3mwE1w", "date_published": "2022-09-09 16:34:24+00:00", "persistent": false, "user": null, "language": "en-US"}]