[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "15 Things I Wish I Knew In Pokemon Scarlet & Violet", "description": "Pokemon Scarlet and Violet are finally out and they mark a number of changes for the mainline series. Here are 15 ways to make the most of your time in Paldea!\n#gaming #gamename #gamespot", "link": "https://www.youtube.com/watch?v=Wx8XKS-Jnc8", "date_published": "2022-11-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best PlayStation Plus Games November 2022", "description": "Brought to you by PlayStation Plus. There are plenty of awesome games joining PlayStation Plus this month, including Kingdom Hearts, Skyrim, Rainbow Six Siege, and a bunch of Ratchet and Clank titles. Here's your rundown of everything coming to PS+ this month. \n\nThe nights are getting longer, the weather’s getting colder, and your family is hitting you up about your plans for the holidays. So you know what that means: time to park yourself in front of the telly and get some gaming going. Here’s what’s coming to PlayStation Plus this month, and my recommendations for some cozy games to play from the Game Catalog.\n\nIf you're a PlayStation Plus Extra member, you can play through the entire Dark Seeker saga as Kingdom Hearts 1.5+2.5 ReMix, Kingdom Hearts 3, and Melody of Memory join the Game Catalog. Team up with your friends in Rainbow Six Siege or The Division 2, or become the Dragonborn and adventure to your heart's content in Skyrim. There are also fantastic indies like What Remains of Edith Finch and The Gardens Between to dig into. If you're a PlayStation Plus Premium member, five more Ratchet and Clank games are joining the Classics Catalog to celebrate the series' 20th anniversary. We also list our five favorite cozy games from the Game Catalog.\n\nThere are so many more games coming to PS Plus, so to keep up to date, make sure to subscribe to GameSpot.\n\n#playstation #psplus #gaming", "link": "https://www.youtube.com/watch?v=RP_S7Hudzts", "date_published": "2022-11-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Call of Duty: Modern Warfare 2 (2022)’s Guns PART 2", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down more of the weaponry of Call of Duty: Modern Warfare 2 (2022), including the PP-19 Bizon 2, the SA-25 PILA missile launcher, and a Glock with a FAB Defence chassis.\n\n00:00 - Opening\n00:40 - FightLite MCR\n01:53 - Browning Citori 725\n02:45 - Steyr AUG HBAR T\n04:10 - PP-19 Bizon 2\n05:46 - HK932A2\n07:21 - SA-25 PILA\n09:16 - Glock with FAB Defence chassis\n10:32 - RPK\n12:03 - SCAR 17S\n15:11 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down more of the guns of Call of Duty: Modern Warfare 2 (2022) and compares them to their real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=K75aarJ-Vxs", "date_published": "2022-11-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Marvel's Spider-Man: Miles Morales - PC Ultrawide Max Settings Gameplay", "description": "Check out the first 20 minutes of Spider-Man: Miles Morales running on max settings with ray tracing on ultrawide.\n\n#spidermanmilesmorales #pcgaming #gamespot", "link": "https://www.youtube.com/watch?v=C7wq74Y2KUc", "date_published": "2022-11-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Scarlet & Pokémon Violet – Official HD Launch Trailer", "description": "The long wait for the next chapter in Pokémon is over! Embark on a new, open-world Pokémon adventure through the rich and expansive Paldea region! Choose your path to earning Champion Rank as a Pokémon Trainer, meet new Pokémon, and explore an open world for the first time in the Pokémon series in Pokémon Scarlet and Pokémon Violet,  available now on Nintendo Switch!\n\n#PokemonScarletViolet #Pokemon #NintendoSwitch", "link": "https://www.youtube.com/watch?v=rSMqv0EKZPw", "date_published": "2022-11-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Violet: The First 24 Minutes", "description": "Jump into the Paldea region with the first 24 minutes of Pokémon Violet.\n\nThe newest Pokémon adventure awaits! Jake takes you through the first 20 minutes of Pokémon Violet. Although the Paldea region is brimming with Pokémon to catch, the most important decision is choosing a starter. Who will he choose? Sprigatito, Fuecoco, or Quaxly? Meet new friends and rivals including Nemona and Mr. Clavell, and check out the battle system as Jake takes on Nemona in his first Pokémon battle! Now, it's your turn to go out and catch em' all when Pokémon Scarlet and Violet launch on November 18th.", "link": "https://www.youtube.com/watch?v=vNKZekBhdGs", "date_published": "2022-11-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Scarlet and Violet Lowest Rated Pokémon Gen On Metacritic | GameSpot News", "description": "Pokemon Scarlet and Violet have some problems, you can get a free flying Pikachu in the games, and Modern Warfare 2/Warzone 2's battle pass is free for certain players.\n#Gaming #PokemonScarletViolet #Warzone2 \n\nPokemon Scarlet and Violet are out now, and the reception to both highly anticipated titles has been mixed to say the least. Multiple reviews, including our own at GameSpot, mention that while the open world is an excellent step forward for the franchise, the games are held back by technical issues such as pop in, frame rate drops, and muddy textures.\n\nAs such, the current score at GameSpot sister site Metacritic sits at a 77, which is the lowest score for a new mainline Pokemon game ever. Before these entries, no new generation of Pokemon has scored below an 80 before. \n\nI should note, that neither Pokemon Red/Blue or Gold/Silver have ratings on the site, but their remakes Fire Red/Leaf Green and Heart Gold/SoulSilver are also rated highly. Which of course they are, cus those are some of the greatest games of all time.\n\nDespite the mixed reception to the new games, it seems to not have had any affect on sales, as Scarlet and Violet are the most preordered Pokemon games in the series’ history.\n\nThe Pokemon Company’s chief operating officer Takato Utsunomiya announced the news at a launch event for the pair of Pokemon games, though didn't specify how many preorders the games had received. He did note that 440 million units of Pokemon-related games have been sold since the launch of the very first titles in Japan, Pokemon Red and Green.\n\nThe chief operating officer also revealed that because of the new elements Scarlet and Violet has introduced, for first-time players, playtimes could go all the way up to 60 hours, which is quite a bit longer than the typical Pokemon adventure.\n\nIf you are picking up either of the new games, make sure to grab your free, rare Pikachu. Once you unlock the Poke Portal in the game, which requires you to to start the Treasure Hunt activity early on in the game, you’ll be able to access Mystery Gifts like in previous entries in the series. Select “Get Via Internet” and the Pikachu will be awarded to you.\n\nWhat makes this Pikachu worth obtaining? Besides the adorability factor, this particular electric rat knows the move Fly, which Pikachu are usually incapable of learning. Usually reserved for Flying-type Pokemon, Fly is a useful two-turn attack that can demolish Fighting and Grass-type Pokemon on the field, adding some extra utility to this particular Pikachu. This Pikachu will also change its typing from Electric to Flying when it is terastalized, the new power up mechanic in the game.\n\nMake sure to head to GameSpot dot come for a ton, and I do mean a ton, more content around Pokemon Scarlet and Violet.\n\nIf you’re still in too deep with Call of Duty Modern Warfare 2 and Warzone 2 to care about pocket monsters, and you also have Xfinity internet, I hope you haven’t paid for your battle pass yet, as you can pick it up for free.", "link": "https://www.youtube.com/watch?v=7oToIni2cUo", "date_published": "2022-11-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]