[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Horace Andy: Tiny Desk (Home) Concert", "description": "Bob Boilen | November 18, 2022\nToday, right here, we get to peek into the decked-out living room of producer Adrian Sherwood's home and watch masters of reggae playfully chill. We hear Horace Andy's gruff tenor tell stories with 55 years of experience, rasp and wear.\n\n\"You've got to live, live, live for today, for tomorrow might never come your way,\" he pleads as he sings \"Today Is Right Here,\" a track on his 2022 album Midnight Rocker. And then the lines I love best, \"My mama told me when I was a child, said all the best things take a little while. But mama was wrong, wrong, wrong, the best things in life come and they go in the blink of an eye.\" All the while, a single snare drum and hi-hat keep the beat, and the band of bass, guitar, keyboard, sax, trumpet and cello warmly support the emotions pouring from Horace Andy.\n\nSitting on the right side of the screen is Adrian Sherwood, the hugely influential dub producer, banging out stuttered rhythms and textures. Adrian Sherwood produced Midnight Rocker, and six months later its younger, dubbed-out sibling, Midnight Scorchers. Seeing all these pioneers pouring out these chill vibes for this Tiny Desk (home) concert is a total thrill.\n\nSET LIST\n\"Today Is Right Here\"\n\"Safe From Harm\"\n\"This Must Be Hell\"\n\nMUSICIANS\nHorace Andy: vocals\nAdrian Sherwood: live FX\nCharlie \"Eskimo\" Fox: drums\nCrucial Tony: guitar\nDoug Wimbish: bass\nCyrus Richards: keyboards\nIvan ''Celloman'' Hussey: cello\nDave Fullwood: trumpet\nRichard Doswell: saxophone\nSkip McDonald: guitar\n\nCREDITS\nVideo: Joshua Thompson, Dave Meyer\nAudio: Matthew Smyth\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Editor: Sofia Seidel\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Maia Stern, Joshua Bryant, Kara Frame, Marissa Lorusso, Hazel Cills, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic  #tinydesk  #horaceandy", "link": "https://www.youtube.com/watch?v=RfkXW0Gm3eQ", "date_published": "2022-11-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]