[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "G20 and the next pandemic", "description": "G20 Bali Leaders’ Declaration\n\nArgentina, Australia, Brazil, Canada, China, France, Germany, Japan, India, Indonesia, Italy, Mexico, Russia, South Africa, Saudi Arabia, South Korea, Turkey, United Kingdom, United States, and European Union.\n\nhttps://www.consilium.europa.eu/en/press/press-releases/2022/11/16/g20-bali-leaders-declaration/\n\nhttps://www.whitehouse.gov/briefing-room/statements-releases/2022/11/16/g20-bali-leaders-declaration/\n\nPart 22\n\nWe recognize that the extensive COVID-19 immunization is a global public good\n\nSection 23\n\nWe recognize the need for strengthening local and regional health product manufacturing capacities\n\nWe support the WHO mRNA Vaccine Technology Transfer hub\n\nWe acknowledge the importance of shared technical standards and verification methods, \nto facilitate seamless international travel, \n\ninteroperability, and recognizing digital solutions and non-digital solutions, \n\nincluding proof of vaccinations. \n\nEstablishment of trusted global digital health networks,\n\nthat should capitalize and build on the success of the existing standards and digital COVID-19 certificates. \n\nPart 24\n\nThe COVID-19 pandemic has accelerated the transformation of the digital ecosystem and digital economy. \n\nWe recognize the importance of digital transformation in reaching the SDGs. \n\nWe also reaffirm the role of data for development, economic growth and social well-being. \n\nG20 update\n\nhttps://www.g20.org/wp-content/uploads/2022/11/2022-G20-Bali-Update.pdf\n\n“Endeavour to move towards interoperability of systems including mechanisms that validate proof of vaccination, \n\nwhilst respecting the sovereignty of national health policies, \n\nand relevant national regulations such as personal data protection and data-sharing.” \n\nIndonesia’s Minister of Health Budi Gunadi Sadikin \n\nhttps://twitter.com/TimHinchliffe/status/1592232822483419138\n\nG20 countries should adopt digital health certificate using WHO standards\n\nLet’s have a digital health certificate acknowledged by WHO — if you have been vaccinated or tested properly — then you can move around\n\n(next World Health Assembly in Geneva) \n\nWHO seem to be on it already\n\nhttps://www.who.int/publications/i/item/WHO-2019-nCoV-Digital_certificates-vaccination-2021.1\n\nDigital documentation of COVID-19 certificates: vaccination status: technical specifications and implementation guidance, 27 August 2021\n\nUse of scan codes\n\nKlaus Schwab, World Economic Forum (WEF) Chair\n\nAttended\n\nFrom a doctor in Austria\n\nIt is currently a very emotional situation in my hospital \n\n(and in general in hospitals in Austria) \n\nbecause many of us in the health care sector are more or less forced to get a fourth vaccine dose. \n\nEven in my case as a physician who has received three doses and one infection just 6 months ago. \n\nThe rule is that if the last vaccination is more than one year and/or the last infection is more than 6 months ago you either have to test all 72 hours or to get an additional vaccine dose; \n\nif not you are at risk of having to pay 500 to 3600 Euros and may even get fired.\n\nVaccine passports\nhttps://lc.org/newsroom/details/111722-world-leaders-agree-to-implement-vaccine-passports-1", "link": "https://www.youtube.com/watch?v=zVBcITMAqnM", "date_published": "2022-11-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]