[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "15 AWESOME Linux apps for GNOME", "description": "Try OnlyOffice, the best open source office suite for Linux: https://www.onlyoffice.com/desktop.aspx\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\nYou can also protect your privacy by using this extension from Startpage, each install helps the channel with a small commission: https://add.startpage.com/en/protection/?campaign=4&source=aff \n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:23 Sponsor: The best Open Source Office Suite\n01:17 Getting Things GNOME - Todos\n02:59 Shortwave - WebRadio\n04:06 Fragments - Torrents\n05:14 Cozy - Audiobooks\n06:12 Deja Dup - Backups\n07:13 Boxes - Virtual Machines\n08:04 Drawing - Paint for Linux\n09:01 Pitivi - iMovie for Linux\n09:55 Mousai - Shazam for Linux\n10:31 Text Pieces - Text Manipulation\n11:06 Font Downloader\n11:35 Curtail - Image Compression\n11:54 Identity - File comparison\n12:16 Blanket - Sound Ambiance\n12:43 Metadata Cleaner\n13:31 Sponsor: Get a Linux laptop or Desktop\n14:06 Support the Channel\n\nLet's begin with Getting Things GNOME, a productivity app to enter all your todo lists and make sure you actually do something. It lets you create tasks, of course, with start dates, and due dates, as well as tags, that you can create on the fly by preceding any word with the @ symbol. \n\n\nShortwave is a handy app that lets you browse webradios, and listen to any music genre you want, for free. It shows you the top voted stations first, as well as trending radio stations, but of course you can search for anything you might want, whether it's a genre or a station name.\n\n\nIf you like books, but reading makes you sleepy, maybe you have some audiobooks lying around? In that case, Cozy is going to be amazing for you. Just point it to the directory where you store them, and it will auto detect them, or you can simply drag and drop files. Cozy will auto detect the metadata for each book, and add some nice cover art. You can filter books by recently listened to, by author, or by the person reading the book, or search through your library. \n\nFragments is a torrent client. It lets you download these nifty little files using that wonderful peer to peer network.\n\nFor Backups, we have Deja Dup. It's made to backup your home user directory, not your whole system, but it's still pretty important to have backups of all your personal files.\n\nGNOME Boxes lets you run virtual machines. Not only does it let you create a VM from the ISOs you already have in your downloads folder, but it also lets you download some ISOs directly from the app, or select one yourself. \n\n\nSometimes you just need a very basic app for drawing a few thins on top of a screenshot, or create a pixel art masterpiece. Drawing does just that. It's basically Microsoft Pain, but for Linux.\n\n\nIf you want to start your own videos, but don't want to use something super complex, Pitivi should be right up your alley.\n\n\nMousai is basically Shazam for your Linux desktop.\n\n\nIf you have to interact with text a lot, Text pieces might come in handy.\n\n\nIf you're a graphic designer, or you just like fancy fonts, Font Downloader will be a cool program to add to your applications grid.\n\n\nYou might want to compress images, and for that, Curtail is perfect.\n\n\nIf you want to check how much that compression process has affected your picture, you can use Identity.\n\n\nIf you prefer working with a bit of noise, but music distracts you too much, Blanket might have a solution. it lets you select a few \"white noises\" like rain, storms, wind, waves, or birds, and tune each one of them to get the ambiance you want to work or relax.\n\nLet's finish this with metadata cleaner, a super handy tool to let you remove any metadata from any file type you have.", "link": "https://www.youtube.com/watch?v=O5As4HocCrw", "date_published": "2022-04-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]