[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Everything To Know About MLB The Show 22", "description": "MLB The Show is back and there are a lot of improvements and changes in The Show 22. Here's everything you need to know.\n\nMLB The Show is back and there are a lot of improvements and changes in San Diego Studios latest entry, MLB The Show 22. We’re going to break down everything you need to know before you step onto the diamond. Don’t forget to like this video and subscribe to our channel, and keep your eyes open for our official MLB The Show 22 review coming soon.\n\nThe Show returns with several modes players have grown accustomed to such as Road to the Show and March to October. These game modes have had various changes and adjustments made to them such as improved trade logic in March to October, and the ability to customize and create up to 10 ball players to take with you in the other game modes.\n\nMLB The Show will be available on Xbox One, Series S|X, PS4, PS5, and Nintendo Switch with full cross-play and cross-progression functionality. The game comes out officially on April 5th but MVP and Digital Deluxe owners have early access to the game right now.", "link": "https://www.youtube.com/watch?v=RJOveraoPmE", "date_published": "2022-04-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "“The Most American Gun Ever” - Firearms Expert Reacts To MORE Payday 2 Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down more of the weaponry of Payday 2, including the baby Deagle, the iconic Colt M733, and a selection of MP5s.\n\n00:00 - Opening\n00:36 - IWI Jericho Pistol/Baby Desert Eagle\n02:49 - Mauser C96 Broomhandle Pistol\n04:57 - Desert Eagle\n07:20 - MP5\n10:25 - Gold AK\n12:20 - Mateba Auto Revolver\n13:17 - Colt M733\n15:42 - Taser\n17:07 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down more of the guns of Payday 2 and compares them to their potential real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=aLVsIlYfRXQ", "date_published": "2022-04-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "23 Minutes of MLB The Show 22 Gameplay", "description": "Watch as the Oakland Athletics take on the San Francisco Giants in the Battle of the Bay in MLB The Show 22 on Xbox Series X. \n\nGet a glimpse of over 20 minutes of gameplay in an epic struggle between both teams at the Oracle Park in San Francisco. Find out who wins in this showdown. MLB The Show 22 will be playable for those who purchased the Deluxe Edition or MVP Edition on April 1st otherwise the full release will be coming on April 5th.\n\nMLB The Show 22 is being released for the PlayStation 4, Playstation 5, Xbox One, Xbox Series X and S, as well as the Nintendo Switch for the first time in the franchise. You can bring your cross saves on the go and play MLB The Show 22 wherever you go. \n\nThis year Shohei Otani makes his way as the MLB The Show 22 cover star with his versatile ability for pitching and hitting.\n\n#MLBTheShow22", "link": "https://www.youtube.com/watch?v=boH0m36Gof4", "date_published": "2022-04-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "More PlayStation Acquisitions Coming | GameSpot News", "description": "PlayStation president says more acquisitions are coming, 2 of April’s Xbox Games with Gold are available now, and Halo Infinite will get content inspired by the TV show.  \n\nSony Interactive Entertainment president Jim Ryan has promised that the company will continue to acquire more studios in the future following a big buying spree in 2021. Sony acquired five studios in 2021, and in 2022 so far, it announced deals to buy Destiny 2 developer Bungie and Jade Raymond's Haven Studios.\n\nNew free Games With Gold games available now for Xbox Live Gold and Game Pass Ultimate subscribers. Right now, subscribers can claim Another Sight and Outpost Kaloki X. In the back half of April, subscribers can grab the off-road racing game MX vs. ATV Alive.\n\n343 Industries community director Brian Jarrard confirmed Halo Infinite will one day feature content inspired by the Paramount+ TV show. He did not provide any hints at when the content might arrive.\n\nSTAMPS\n00:00 - Intro\n00:05 - PlayStation\n01:20 - Xbox\n02:12 - Halo Infinite", "link": "https://www.youtube.com/watch?v=vqEfN3ugTpQ", "date_published": "2022-04-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Persona 4 Arena Ultimax Livestream | Congrats, It's Friday", "description": "It's time to kick back, relax, and throw some god hands at each other.\r\n\r\nOur favorite fighting game about high schoolers who jump into TVs is back on the PS4 and PC. A sequel to the beloved Atlus JRPGs, Persona 4 and Persona 3, Arena Ultimax (known in Japan as Persona 4: The Ultimax Ultra Suplex Hold) is a wonderful fighting game and certainly not one to be missed.\r\n\r\nGameSpot's Persona Boys; Evan Langer, Ben Janca, and Jean-Luc Seipke, are here to hang out and have a good time with you! Challenge us in the ring or just vibe on this chill Friday.", "link": "https://www.youtube.com/watch?v=74xYAGM6Ohk", "date_published": "2022-04-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Weird West Review", "description": "Weird West slings a few effective yarns, but fumbles when it comes to dealing in lead.\n\nWolfEye Studios and Devolver Digital's Weird West is now available on PC, PS4, and Xbox One. You can read the full written Weird West review by Justin Clark on GameSpot: https://www.gamespot.com/reviews/weird-west-review-occult-of-personality/1900-6417853/", "link": "https://www.youtube.com/watch?v=s14aAMeAG70", "date_published": "2022-04-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]