[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "12 Minutes of A Plague Tale: Requiem Official Extended Gameplay Trailer", "description": "Focus Entertainment released an extended look at gameplay for A Plague Tale: Requiem as well revealing the release date of October 18, 2022. You get a glimpse of various gameplay mechanics and more. Watch 12 minutes of new gameplay for A Plague Tale: Requiem.\n\n#plaguetale #gaming", "link": "https://www.youtube.com/watch?v=EIuaKHUfkAU", "date_published": "2022-06-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Warzone Season 4 Map: Fortune's Keep Gameplay", "description": "Call of Duty has a new season of content for Warzone in Mercenaries of Fortune. Here are some gameplay highlights of the Resurgence game mode on the brand new battle royale map, Fortune's Keep.", "link": "https://www.youtube.com/watch?v=WMkTIR1EutM", "date_published": "2022-06-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 replacing Overwatch 1 | GameSpot News", "description": "Overwatch 2 will replace the original game, Apex Legends Mobile is nerfing bunny hops, Xbox Cloud Gaming will get keyboard and mouse support, and A Plague Tale: Requiem gets a release date.\n#GamingNews #Overwatch #xbox \n\nDuring a Reddit AMA, Overwatch 2 director Aaron Keller confirmed, “When OW2 launches on Oct 4th it will be a replacement for the current Live Service”. According to Blizzard, this is to keep the player base unified and as for the players that can’t let go of the past and try to play OW1 after October 4th, they'll be asked to update to the sequel instead.\n\nFor more on Overwatch 2, make sure you watch our big interview with Aaron Keller - https://youtu.be/wU538SH3A-k\n\nIn Respawn's mobile battle royale, Apex Legends Mobile, being able to successfully pull off the bunny hopping technique can make you extremely difficult to hit. This has created frustration in the community so it's good to see Respawn finally address it with an upcoming nerf. The change will be made in the game's next update.\n\nXbox Cloud Steaming will add mouse and keyboard support to its streaming service. This announcement was made by Xbox software engineer, Morgan Brown. During a presentation, Brown clarified that mouse and keyboard support for Xbox Cloud Gaming is coming and that developers should work on adding it to their games.\n\nFocus Entertainment has revealed that A Plague Tale: Requiem will launch on October 18 for PC, PlayStation 5, Nintendo Switch, and Xbox Series X|S. In an extended gameplay trailer, Focus Entertainment showed off more of the game, and it looks even more cinematic than its predecessor. It shows the protagonist Amicia and her little brother Hugo trying to escape enemies while she fights them off.\n\nSTAMPS\n00:00 - Intro\n00:06 - Overwatch 2\n00:36 - Apex Legends Mobile\n01:16 - Xbox Cloud Gaming\n02:16 - A Plague Tale: Requiem", "link": "https://www.youtube.com/watch?v=b3lrX_oUinw", "date_published": "2022-06-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Alien Isolation Devs Reveal New Sci-Fi Heist Game, Hyenas | GameSpot News", "description": "The developers behind Alien Isolation and Total War announce Hyenas, Nintendo reveals more details about Xenoblade Chronicles 3 in a new direct and Forza Horizon 5 gets a major update ahead of the Hot Wheels expansion release.\n#GamingNews #Sega #nintendo \n\nHyenas is a team-based shooter from Creative Assembly that tasks players with robbing high-tech vaults on massive space freighters. Each match has 15 players split into 3 teams of 5 and the loot that is being stolen includes pop culture artifacts. No release date was announced for Hyenas, but if you have a PC and you live in North America or Europe you can sign up for the upcoming alpha on the game’s official website. \n\nToday’s Nintendo Direct laid out the game's story and battle system, focusing on the party's six classes and their abilities. Those classes include: Swordfighter, Zephyr, Medic Gunner, Tactician, Heavy Guard, and Ogre. Nintendo also revealed the Xenoblade Chronicles 3 Expansion Pass, adding over a year's worth of additional content for $30. \n\nForza Horizon’s latest major update adds story mode co-op, a new event, and new Hot Wheels cars and cosmetics ahead of the July expansion's release. \n\nYou can find the full list of patch notes here: https://www.gamespot.com/articles/a-major-forza-horizon-5-patch-is-out-now/1100-6504805/\n\nSTAMPS\n00:00 - Intro\n00:07 - Hyenas\n01:34 - Xenoblade Chronicles 3\n02:20 - Forza Horizon 5 Update", "link": "https://www.youtube.com/watch?v=VsekUJGYmEA", "date_published": "2022-06-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Diablo Immortal Review", "description": "Diablo Immortal is a surprisingly premium-feeling adventure in the series that hits all the right notes, even if its endgame starts to depend on microtransactions too heavily.", "link": "https://www.youtube.com/watch?v=LRuwVGB0OZY", "date_published": "2022-06-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "HYENAS Official Announcement Trailer", "description": "Watch the new cinematic announcement trailer for HYENAS, a new multiplayer sci-fi FPS from Creative Assembly. Team up with your pack to steal priceless pop culture loot from the Mars billionaires and rival crews.\n\nYou can sign up for the alpha: https://www.playhyenas.com/alpha\n\n#hyenas #gaming", "link": "https://www.youtube.com/watch?v=a8Dw8Og8Xjc", "date_published": "2022-06-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sonic Origins Review", "description": "Sonic is back! This time, members of the Sonic Mania team have updated Sonic for 16:9 with Sonic Origins, a Sonic compilation featuring Sonic 1, Sonic 2, Sonic CD, and Sonic 3 & Knuckles. While Sonic Origins isn't the first time we've seen a compilation, it's the first time we've seen Sonic remade from the ground up with an updated aspect ratio. Sonic Origins releases June 23, 2022.", "link": "https://www.youtube.com/watch?v=fa_l5G4maw0", "date_published": "2022-06-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xenoblade Chronicles 3 Nintendo Direct Full Presentation", "description": "Check out the full presentation for Xenoblade Chronicles 3. You'll learn more about the world, its characters (Noah, Eunie, Lanz, Mio, Taion, and Sena) and what to expect. Additionally get a look at a new trailer for the game as well.\n\n#xenoblade #gaming \n\nTimestamps\n0:00 Introduction\n0:01 Xenoblade Chronicle's 3 Passage of Fate Trailer\n5:41 Character Breakdown\n8:28 World Overview\n12:08 Combat Overview\n14:36 Class Breakdown\n17:21 Hero Breakdown\n19:28 Power of Ouroboros", "link": "https://www.youtube.com/watch?v=5LPZ5TpUvzk", "date_published": "2022-06-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]