[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCmGSJVG3mCRXVOP4yZrU1Dw", "title": "Why We NEED a Male Birth Control Pill", "description": "Let Audible help you discover new ways to laugh, be inspired, or be entertained. New members can try it free for 30 days. Visit https://www.Audible.com/JOHNNYHARRIS or text JOHNNYHARRIS to 500-500.\n\nThe future of abortion rights in America just got a bit more complicated now that the Supreme Court overturned Roe v. Wade. It makes me wonder, when is there actually going to be a male birth control pill?\n\nThank you to all of the people who sent in their experiences with hormonal birth control. Your voices are so important in this story. One of those was Sarah Dietschy, you can see her Youtube channel here: https://www.youtube.com/c/saradietschy. So many of you responded with how hormonal birth control has made your life better. We didn’t have time to include these in the video, but you can watch some of those testimonials with this link: https://youtu.be/tHpZOKWCcnI\n\nA big thanks to all of the people we spoke with:\n- Dr. Stephanie Page \n- Dr. John Amory\n- Kevin Shane from the Male Contraceptive Initiative. MCI has a ton of information on the latest non hormonal methods being researched as male contraceptives. Check out their website (https://www.malecontraceptive.org), and listen to Kevin and his colleagues on their podcast “Intended”: https://www.malecontraceptive.org/intended.html\n- Claudia Grammer from the Museum of Contraception and Abortion\n\nHere’s some information on the hormonal gel trials happening right now in a ton of locations, they’re looking for couples to participate:  \n- Click the “participate in this trial” at the top of this site and they’ll help find the closest trial near you: https://www.malecontraception.center/clinical-trials-1\n- UCLA’s trial: https://www.menshealth-lundquist.org/nest_male_birth_control_trial\n- University of Utah’s trial: https://studypages.com/s/interested-in-trying-out-a-male-birth-control-method-participate-in-a-research-study-549601/\n- Scroll to the bottom of this page to see if a university near you is recruiting for trial participants: https://clinicaltrials.gov/ct2/show/NCT03452111\n\n- ways to support - \nMy Patreon: https://www.patreon.com/johnnyharris\nOur custom Presets & LUTs: https://store.dftba.com/products/johnny-iz-luts-and-presets\n\n- where to find me -\nInstagram: https://www.instagram.com/johnny.harris/\nTiktok: https://www.tiktok.com/@johnny.harris\nFacebook: https://www.facebook.com/JohnnyHarrisVox\nIz's (my wife’s) channel: https://www.youtube.com/iz-harris\n\n- how i make my videos -\nTom Fox makes my music, work with him here: https://tfbeats.com/\nI make maps using this AE Plugin: https://aescripts.com/geolayers/?aff=77\nAll the gear I use: https://www.izharris.com/gear-guide\n \n- my courses - \nLearn a language: https://brighttrip.com/course/language/\nVisual storytelling: https://www.brighttrip.com/courses/visual-storytelling\n\n- about -\nJohnny Harris is a filmmaker and journalist. He currently is based in Washington, DC, reporting on interesting trends and stories domestically and around the globe. Johnny's visual style blends motion graphics with cinematic videography to create content that explains complex issues in relatable ways. He holds a BA in international relations from Brigham Young University and an MA in international peace and conflict resolution from American University.\n\n- press - \nNYTimes: https://www.nytimes.com/2021/11/09/opinion/democrats-blue-states-legislation.html\nNYTimes: https://www.nytimes.com/video/opinion/100000007358968/covid-pandemic-us-response.html\nVox Borders: https://www.youtube.com/watch?v=hLrFyjGZ9NU\nFinding Founders: https://findingfounders.co/episodes/johnny-harris-2esj3-c3pet-2pg4c-xbtwa-5gaaa\nNPR Planet Money: https://www.npr.org/transcripts/1072164745", "link": "https://www.youtube.com/watch?v=_mimITJ0tLQ", "date_published": "2022-06-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]