[{"source": "https://www.theguardian.com/rss", "title": "A third of UK ‘buy now, pay later’ users say they can’t handle payments", "description": "<p>Research finds BNPL shoppers now paying off average of 4.8 purchases since cost of living began to surge</p><p>Almost a third of shoppers who use <a href=\"https://www.theguardian.com/business/buy-now--pay-later\">buy now, pay later</a> credit say repayments on the loans have become “unmanageable”, with the cost of living crisis pushing them into a debt spiral, new research has found.</p><p>Consumers are spending more via the controversial form of credit, with shoppers who use BNPL now paying off an average of 4.8 purchases – almost double the 2.6 purchases in February, the research found. The average BNPL user’s outstanding balance currently stands at £254. </p> <a href=\"https://www.theguardian.com/business/2022/jun/23/buy-now-pay-later-uk-research\">Continue reading...</a>", "link": "https://www.theguardian.com/business/2022/jun/23/buy-now-pay-later-uk-research", "date_published": "2022-06-22 23:01:32+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Students show ‘shocking growth in support for censorship’, ministers warn", "description": "<p>Survey reveals many students value safety, compassion and avoidance of discrimination above free speech</p><p>Ministers have warned that students are showing “shocking growth in support for censorship” after a survey revealed that many favoured safety and avoidance of discrimination over unrestrained free speech.</p><p>The survey by the Higher Education Policy Institute (Hepi) found that current students are more likely to support measures that restrain freedom of speech or expression on campus, and approve of removing offensive materials and memorials, compared with their predecessors six years ago, when it last conducted the survey.</p> <a href=\"https://www.theguardian.com/education/2022/jun/23/students-shocking-growth-support-censorship-ministers-warn\">Continue reading...</a>", "link": "https://www.theguardian.com/education/2022/jun/23/students-shocking-growth-support-censorship-ministers-warn", "date_published": "2022-06-22 23:01:32+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Failure to pardon women persecuted as witches in Scotland ‘prolongs misogyny’", "description": "<p>MSP Natalie Don launches Holyrood bill to pardon people tortured and executed under Witchcraft Act 1563</p><p>The failure to serve posthumous justice to the thousands of people – mainly women – persecuted as witches in post-Reformation Scotland “prolongs misogyny”, an MSP launching a bid to grant them a legal pardon has said.</p><p>Speaking before the launch of a Holyrood member’s bill on Thursday, the SNP MSP Natalie Don explained: “The only way we can move forward in terms of where we are with misogyny and prejudice in society is by fixing these injustices of our past.” She also hoped that the member’s bill could contribute to awareness of parts of the world where women and girls still faced such accusations and their violent consequences.</p> <a href=\"https://www.theguardian.com/uk-news/2022/jun/23/failure-to-pardon-women-persecuted-as-witches-in-scotland-prolongs-misogyny\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/jun/23/failure-to-pardon-women-persecuted-as-witches-in-scotland-prolongs-misogyny", "date_published": "2022-06-22 23:01:31+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "S Club 7 star calls out ‘lack of empathy’ for gambling addicts", "description": "<p>Jo O’Meara recalls her issues with fruit machines and says addiction ‘can happen to anybody at any time’</p><p>Jo O’Meara, a former member of the 90s pop group S Club 7, has shared how she became addicted to gambling on fruit machines as a “form of escape” from the pressures of touring, before realising she had to quit because it made her antisocial.</p><p>O’Meara said she first went to bingo halls with family at about 18, where she began playing on fruit machines. Although she did not consider it an addiction at the time, she found herself playing regularly over five years before deciding, she said, that “the gambler never wins” and she was “wasting valuable time which would be better spent with friends and family”.</p> <a href=\"https://www.theguardian.com/society/2022/jun/23/s-club-7-star-calls-out-lack-of-empathy-for-gambling-addicts\">Continue reading...</a>", "link": "https://www.theguardian.com/society/2022/jun/23/s-club-7-star-calls-out-lack-of-empathy-for-gambling-addicts", "date_published": "2022-06-22 23:01:31+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Labour MP signed off sick after ‘campaign of misogynistic abuse’", "description": "<p>Apsana Begum tweeted that she had attended hospital and been signed off work by her GP</p><p>A Labour MP has announced that she is taking time away from work because of the strain caused by what she said was “misogynistic abuse and harassment” linked to efforts to make her seek formal reselection for her seat.</p><p>In <a href=\"https://twitter.com/ApsanaBegumMP/status/1539679904039673857\">a statement</a> posted on Twitter, Apsana Begum, the MP for Poplar and Limehouse in east London since 2019, said she had been obliged to go to hospital on 12 June, and had since been signed off sick by a GP.</p> <a href=\"https://www.theguardian.com/politics/2022/jun/22/labour-mp-apsana-begum-signed-off-sick-after-campaign-of-misogynistic-abuse\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/jun/22/labour-mp-apsana-begum-signed-off-sick-after-campaign-of-misogynistic-abuse", "date_published": "2022-06-22 21:43:38+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Boris Johnson and Prince Charles to hold Rwanda talks", "description": "<p>Pair are visiting for Commonwealth meeting, after Charles criticised government’s asylum policy</p><p>Boris Johnson will have a potentially awkward meeting with the Prince of Wales in Rwanda after the heir to the throne criticised the government’s policy of sending asylum seekers to the east African state.</p><p>The talks will take place at the <a href=\"https://www.theguardian.com/world/2022/jun/20/commonwealth-leaders-head-to-rwanda-for-first-\">Commonwealth heads of government meeting</a> (Chogm) in Kigali this week. Prince Charles reportedly described the government’s plan to fly people 4,000 miles on a one-way ticket as “appalling”.</p> <a href=\"https://www.theguardian.com/uk-news/2022/jun/22/boris-johnson-and-prince-charles-to-hold-rwanda-talks\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/jun/22/boris-johnson-and-prince-charles-to-hold-rwanda-talks", "date_published": "2022-06-22 21:35:41+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Ukrainian photographer and friend were ‘executed in cold blood’ – report", "description": "<p>Having gathered evidence on deaths of Maksim Levin and Oleksiy Chernyshov in March, Reporters Without Borders says evidence against Russia is ‘overwhelming’</p><p><a href=\"https://www.theguardian.com/world/2022/apr/02/ukrainian-photographer-maksim-levin-killed-while-covering-war\">Ukrainian photographer Maksim Levin</a> was “executed in cold blood” alongside his friend Oleksiy Chernyshov by Russian forces north of Kyiv on 13 March, Reporters Without Borders (RSF) said in a 16-page report on Wednesday.</p><p>“<a href=\"https://rsf.org/en/exclusive-rsf-investigation-death-maks-levin-information-and-evidence-collected-indicates\">The evidence against the Russian forces is overwhelming</a>,” the press freedom group said in an introduction to the report on its website.</p> <a href=\"https://www.theguardian.com/world/2022/jun/22/ukrainian-photographer-maksim-levin-executed-cold-blood-russia\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/jun/22/ukrainian-photographer-maksim-levin-executed-cold-blood-russia", "date_published": "2022-06-22 21:16:05+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Exposed Boehly can make Tuchel as powerful as Guardiola and Klopp | Jacob Steinberg", "description": "<p>It’s all change at Chelsea after Granovskaia’s exit but the club’s new co-owner, chairman and sporting director has a big task</p><p>As recently as a week ago Marina Granovskaia was telling figures inside football that she had not decided whether to continue working for Chelsea’s new owners. Granovskaia was as active as ever in discussions with agents about potential signings and, despite the director’s long-standing ties to Roman Abramovich, there was a feeling that any announcement about her future would be unlikely until the transfer window was over.</p><p>That all changed on Monday morning. First came the announcement that Bruce Buck, another associate of Abramovich, had agreed to step down as chairman. Then, in a development that caught a fair few people by surprise, it emerged that Granovskaia would indeed be the next high-profile departure. Ties with the previous regime were being cut and, though there were initially suggestions that Granovskaia would keep her job until the end of August, by the end of the day several sources were tipping her to be gone before the end of the week.</p> <a href=\"https://www.theguardian.com/football/blog/2022/jun/22/todd-boehly-thomas-tuchel-guadiola-klopp-chelsea-granovskaia\">Continue reading...</a>", "link": "https://www.theguardian.com/football/blog/2022/jun/22/todd-boehly-thomas-tuchel-guadiola-klopp-chelsea-granovskaia", "date_published": "2022-06-22 21:00:28+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Serena Williams and Ons Jabeur sail into Eastbourne semis with new nickname", "description": "<ul><li>‘Onsrena’ duo beat Shuko Aoyama and Chan Hao-ching 6-2, 6-4</li><li>Nadal and Djokovic start grass seasons with easy wins</li></ul><p>The joyful return of Serena Williams in Eastbourne lasted for another day as she and Ons Jabeur reached the doubles semi-final by outclassing Shuko Aoyama and Chan Hao‑ching 6-2, 6-4.</p><p>Having shaken off rust and nerves respectively, Williams and Jabeur got to work and played extremely well. The pair served exceptionally, with Williams even slamming down three consecutive aces from a 15-40 deficit.</p> <a href=\"https://www.theguardian.com/sport/2022/jun/22/serena-williams-and-ons-jabeur-sail-into-eastbourne-semi-finals\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/jun/22/serena-williams-and-ons-jabeur-sail-into-eastbourne-semi-finals", "date_published": "2022-06-22 20:58:42+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The merry wives of Rupert Murdoch: who has the tycoon been wed to before?", "description": "<p>Actor and ex-model was the fourth to marry the 91-year-old media mogul, following Wendi Deng, Anna Torv and Patricia Booker</p><ul><li><a href=\"https://www.theguardian.com/media/2022/jun/22/rupert-murdoch-jerry-hall-divorce-report\">Rupert Murdoch and Jerry Hall set to divorce – report</a></li></ul><p>Rupert Murdoch and Jerry Hall, a former top model, are reportedly set to divorce. Hall was the billionaire media mogul’s fourth wife.</p> <a href=\"https://www.theguardian.com/media/2022/jun/22/the-merry-wives-of-rupert-murdoch-marriage-to-jerry-hall-is-reportedly-over\">Continue reading...</a>", "link": "https://www.theguardian.com/media/2022/jun/22/the-merry-wives-of-rupert-murdoch-marriage-to-jerry-hall-is-reportedly-over", "date_published": "2022-06-22 20:42:07+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "British man facing death sentence in Donetsk told: ‘Time is running out’", "description": "<p>Aiden Aslin has been told his execution in Russian-occupied Ukraine will be carried out, his family say</p><p>A British man sentenced to death by a Russian proxy court for fighting in Ukraine has been told the execution will be carried out, his family have said.</p><p>Aiden Aslin, 28, and Shaun Pinner, 48, <a href=\"https://www.theguardian.com/world/2022/jun/09/britons-sentenced-to-death-russian-occupied-ukraine-aiden-aslin-shaun-pinner\">were sentenced on charges of “terrorism”</a> by a court that is not internationally recognised earlier this month in the self-proclaimed Donetsk People’s Republic (DPR).</p> <a href=\"https://www.theguardian.com/world/2022/jun/22/british-man-facing-death-sentence-donetsk-told-time-running-out\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/jun/22/british-man-facing-death-sentence-donetsk-told-time-running-out", "date_published": "2022-06-22 20:34:57+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Rupert Murdoch and Jerry Hall set to divorce – report", "description": "<p>Billionaire media baron, 91, to split from model and actor wife, 65, he married in London in 2016, New York Times reports</p><ul><li><a href=\"https://www.theguardian.com/media/2022/jun/22/the-merry-wives-of-rupert-murdoch-marriage-to-jerry-hall-is-reportedly-over\">The merry wives of Rupert Murdoch: marriage to Jerry Hall is reportedly over</a></li></ul><p>The billionaire media mogul Rupert Murdoch and Jerry Hall, a former top model, are reportedly set to divorce.</p><p><a href=\"https://www.nytimes.com/2022/06/22/business/media/rupert-murdoch-divorce-jerry-hall.html\">The New York Times</a> cited two anonymous sources for its report on the coming split. It said a spokesman for Murdoch did not comment while representatives for Hall could not be reached.</p> <a href=\"https://www.theguardian.com/media/2022/jun/22/rupert-murdoch-jerry-hall-divorce-report\">Continue reading...</a>", "link": "https://www.theguardian.com/media/2022/jun/22/rupert-murdoch-jerry-hall-divorce-report", "date_published": "2022-06-22 19:50:24+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘It’s not the waiting, it’s the indignity’: disabled passengers tell of air travel torment", "description": "<p>As campaigners highlight how the burden of travel chaos is falling on disabled passengers, five people describe their recent airport indignities</p><ul><li><a href=\"https://www.theguardian.com/society/2022/jun/22/disabled-passengers-bearing-brunt-of-travel-disruption-say-charities\">Disabled passengers bearing brunt of travel disruption, say charities</a></li></ul><p>Passengers with a disability or reduced mobility are legally entitled to special assistance when travelling by air, with airports and airlines required to provide help and assistance free of charge.</p><p>Recent experiences of disabled passengers, however, suggests that this support is not always available and cannot be relied on.</p> <a href=\"https://www.theguardian.com/travel/2022/jun/22/its-not-the-waiting-its-the-humiliation-disabled-passengers-on-their-travel-torments\">Continue reading...</a>", "link": "https://www.theguardian.com/travel/2022/jun/22/its-not-the-waiting-its-the-humiliation-disabled-passengers-on-their-travel-torments", "date_published": "2022-06-22 19:43:12+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Rory McIlroy brands LIV Golf players ‘duplicitous’ as Koepka is latest to move", "description": "<ul><li>Brooks Koepka to play in second LIV event in Oregon next week</li><li>PGA Tour set to ban the four-time major winner as a result</li></ul><p>Rory McIlroy has labelled the players who have joined the LIV Golf Series “duplicitous” for the way they have handled their breakaway.</p><p>Brooks Koepka, the four-time major winner whose brother Chase played in the opening event at Centurion Club in Hertfordshire this month, has signed up to the Saudi-backed invitational events. LIV Golf confirmed Koepka will play in the second 54-hole, 48-man tournament, which has a prize fund of $25m (£20.4m), in Portland, Oregon next week.</p> <a href=\"https://www.theguardian.com/sport/2022/jun/22/rory-mcilroy-brands-liv-golf-players-duplicitous-as-koepka-is-latest-to-move\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/jun/22/rory-mcilroy-brands-liv-golf-players-duplicitous-as-koepka-is-latest-to-move", "date_published": "2022-06-22 19:39:59+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Eritrea women’s team footballers still in hiding after escaping in Uganda", "description": "<ul><li>Five players fled before match against Uganda on 2 November</li><li>More than 60 footballers have escaped Isaias Afwerki’s regime</li></ul><p>Five members of Eritrea’s Under-20 women’s team who escaped after playing in a tournament in Uganda last year remain in hiding, the Guardian understands.</p><p>According to sources close to the players, the five – Luwam Solomon, Yordanos Abraham, Shamat Futsum, Rahel Michael and Trhas Habate, who are aged between 16 and 19 – are “safe and well” after fleeing hours before their game against the hosts in the Cecafa Women’s Under-20 Championship on 2 November. It is estimated that more than 60 players have used their status as internationals to escape the oppressive regime of the Eritrean president, Isaias Afwerki, since 2009, although this is the first case involving female players.</p> <a href=\"https://www.theguardian.com/football/2022/jun/22/eritrea-womens-footballers-hiding-uganda\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/jun/22/eritrea-womens-footballers-hiding-uganda", "date_published": "2022-06-22 19:00:26+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Rugby’s card-happy approach to concussion is just not working | Michael Aylwin", "description": "<p>As injuries keep rising, it is obvious that simply penalising players is no remedy. The answer lies in neuroscience</p><p>Another year, another set of concussion statistics as high as the last. Higher. This year’s, revealed on Tuesday in English rugby’s perennially comprehensive <a href=\"https://nam12.safelinks.protection.outlook.com/?url=http%3A%2F%2Flinks.emails.rfumail.com%2Fels%2Fv2%2F400Ps78-aet7%2FQUpJeUdUeitsQmwvMDBqMUR5NUdrdFZNM0VCblFKYXlzOXNDc0tWNEFFdnIwSEt5TWxIZHQycUZWTDN5ZlJvNGU5N0NHNTl1em1UYmIrdU92RkdZcmpWK1FUN2piMkhrTFI2cFYvbDhQV289S0%2F&amp;amp;data=05%7C01%7C%7C7d6ac08f66654d4fc20808da535c2c9b%7C84df9e7fe9f640afb435aaaaaaaaaaaa%7C1%7C0%7C637913956659959125%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&amp;amp;sdata=or6JdnojhPB66r603tSACkoax5OxTNssQAC8aiXF8x4%3D&amp;amp;reserved=0\" title=\"\">Professional Rugby Injury Surveillance Project report</a>, is actually the highest recorded since PRISP began in 2002.</p><p>Surely at some point the penny will drop that the red-card wild-west rugby embarked upon <a href=\"https://www.world.rugby/news/213339\" title=\"\">officially on 3 January 2017</a>, five and a half years ago, but unofficially before even that, is not working – and it never will work. To send players off and ban them for the ugliest (though far from the only) examples of contact with the head is meant to act as a deterrent, but deterrents in the wider world work only when the infringements targeted are the result of deliberate decision-making by the perpetrators in their own good time.</p> <a href=\"https://www.theguardian.com/sport/blog/2022/jun/22/rugby-card-happy-approach-to-concussion-just-is-not-working\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/blog/2022/jun/22/rugby-card-happy-approach-to-concussion-just-is-not-working", "date_published": "2022-06-22 19:00:26+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Finns are ready to fight any Russian attack, says armed forces chief", "description": "<p>Gen Timo Kivinen says Nato applicant is prepared and motivated to defend against neighbour and would be ‘tough bite’ to chew</p><p>Finland has prepared for decades for a Russian attack and would put up stiff resistance should one occur, its armed forces chief has said.</p><p>The Nordic country has built up a substantial arsenal. But aside from the military hardware, Gen Timo Kivinen said, a crucial factor is that Finns would be motivated to fight.</p> <a href=\"https://www.theguardian.com/world/2022/jun/22/finns-are-ready-to-fight-any-russian-attack-says-its-armed-forces-chief\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/jun/22/finns-are-ready-to-fight-any-russian-attack-says-its-armed-forces-chief", "date_published": "2022-06-22 18:30:50+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Obi-Wan Kenobi finale recap – the fight scenes were perfect", "description": "<p>This action-packed final episode delivered epic lightsaber duels and flawless drama, even if there were few surprises</p><p><em>Spoiler warning … this recap is for people who have been watching Obi-Wan Kenobi on Disney+. Do not read unless you have seen episodes one to six.</em></p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/jun/22/obi-wan-kenobi-finale-recap-the-fight-scenes-were-perfect\">Continue reading...</a>", "link": "https://www.theguardian.com/tv-and-radio/2022/jun/22/obi-wan-kenobi-finale-recap-the-fight-scenes-were-perfect", "date_published": "2022-06-22 18:00:25+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The Guardian view on Raab’s bill of rights: liberty bent to prejudice | Editorial", "description": "<p>Plans to make universal rights subordinate to ministerial opinion and political whim mark a backwards step for British democracy</p><p>There are two ways ministers can avoid falling foul of human rights law. One is to govern with respect for universal human rights, as codified after the second world war in response to unspeakable atrocities. The other way is to redefine those rights, making their interpretation subordinate to political expediency. Boris Johnson’s government has chosen the second path.</p><p>The method is a new <a href=\"https://publications.parliament.uk/pa/bills/cbill/58-03/0117/220117.pdf\" title=\"\">bill of rights</a>, replacing the 1998 Human Rights Act, which incorporated the 1953 European convention on human rights into UK law. The change is not a withdrawal from the European court of human rights (ECHR) in Strasbourg, which adjudicates on the convention, but it is a dilution of the protections it represents.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/jun/22/the-guardian-view-on-raabs-bill-of-rights-liberty-bent-to-prejudice\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/jun/22/the-guardian-view-on-raabs-bill-of-rights-liberty-bent-to-prejudice", "date_published": "2022-06-22 17:48:15+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The Guardian view on privatisation: the god that failed | Editorial", "description": "<p>We were told privatisation would mean great services, savings for the government and an investment boom. It was a lie</p><p>Three ghastly faces of the UK’s privatised economy have been on show this week. On Wednesday, the energy regulator, Ofgem, was judged guilty of <a href=\"https://www.theguardian.com/money/2022/jun/22/failing-energy-suppliers-cost-uk-consumers-2-billion-pounds-watchdog\" title=\"\">adding £2.7bn to household bills</a> because it was so keen to create a competitive energy market that it did not properly check the slew of shaky outfits setting up as suppliers. Now that 28 providers have collapsed, such light-touch regulation is producing costly chaos – not only for customers of Bulb and the others, but for everyone, because we will all foot the bill.</p><p>Earlier, Anglian Water announced that it would pay a £92m dividend to investors, despite the Environment Agency fining it for <a href=\"https://www.theguardian.com/business/2022/mar/14/severn-trent-and-anglian-water-pledge-to-do-more-to-protect-rivers\" title=\"\">water pollution</a> on three separate occasions in the past few months. And in the story of the week, the transport secretary, <a href=\"https://www.theguardian.com/uk-news/2022/jun/19/shapps-tories-rail-strikes-rmt-starmer-labour\" title=\"\">Grant Shapps</a>, ducked out of talks with the rail unions, claiming it wasn’t his responsibility to negotiate. Yet the government not only owns the company that owns the tracks, tunnels and signals, but is also the paymaster for all the train operators.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/jun/22/the-guardian-view-on-privatisation-the-god-that-failed\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/jun/22/the-guardian-view-on-privatisation-the-god-that-failed", "date_published": "2022-06-22 17:46:49+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Boris produces bubbles of nonsense when quizzed about Carrie | John Crace", "description": "<p>A Labour question rattled Johnson at PMQs, and then a revitalised Keir Starmer pounced</p><p>Boris Johnson could count himself lucky. He wasn’t up against the RMT union leader. Mick Lynch has already seen off <a href=\"https://www.theguardian.com/global/video/2022/jun/22/marxist-the-hood-rmt-mick-lynch-asked-bizarre-questions-rail-strikes-video\">Kay Burley, Piers Morgan</a>, Labour’s Jenny Chapman and several half-witted Tory MPs. Chris Philp and Jonathan Gullis were chewed up and spat out. So it would be a racing certainty that the Convict would come off worse in any one-to-one with Lynch. One very good reason why the Tories have made no effort to engage with the RMT.</p><p>But the Convict did have to face a revitalised Keir Starmer. In recent weeks, the Labour leader has seemed underpowered. As if his mind was elsewhere. But at Wednesday’s prime minister’s questions he was fully on it. Not all the gags landed, but then they didn’t need to. Johnson looked hopelessly out of his depth from the start. Powerless to defend his record. Not even the Tories now believe the Tory line that Labour is to blame for the rail strikes. More to the point, the public certainly seem to know where the fault lies.</p> <a href=\"https://www.theguardian.com/politics/2022/jun/22/boris-johnson-produces-bubbles-of-nonsense-when-quizzed-about-carrie\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/jun/22/boris-johnson-produces-bubbles-of-nonsense-when-quizzed-about-carrie", "date_published": "2022-06-22 17:32:55+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Test captains left to field thorny questions while the suits hide at Headingley", "description": "<p>Ben Stokes and Kane Williamson have had more than cricket to discuss with Yorkshire the hosts following the racism scandal</p><p>A day out from the third Test between England and New Zealand and Headingley could scarcely have looked more ripe for the occasion, with azure skies overhead, the white roof of the new football stand shimmering in the sunshine and the combination of a beige pitch and cambered green outfield hinting at another feast of runs.</p><p>There is a huge appetite for this match, too. England may be <a href=\"https://www.theguardian.com/sport/2022/jun/14/england-new-zealand-second-test-day-five-match-report\" title=\"\">2-0 up with one to play</a> but the swagger shown during the run chase at Trent Bridge last week – plus a trio of locally produced players in Joe Root, Jonny Bairstow and Alex Lees – has left around 400 tickets spare on days one and four, with two sell-outs sandwiched in between. Around £3m in net revenue is on the cards and that is before punters have slaked their thirsts and filled bellies at the various bars and food outlets.</p> <a href=\"https://www.theguardian.com/sport/2022/jun/22/england-new-zealand-captains-third-test-headingley-cricket\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/jun/22/england-new-zealand-captains-third-test-headingley-cricket", "date_published": "2022-06-22 17:28:22+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Keir Starmer is too timid just when he needs to show leadership | Letters", "description": "<p><strong>John Robinson,</strong> <strong>David Napier</strong>, <strong>Mike Cowley</strong> and <strong>Stephen Smith</strong> on the need for the Labour leader to speak up as rail workers take strike action</p><p>Zoe Williams says people are “crying out to hear some real values” from a Labour leader (<a href=\"https://www.theguardian.com/commentisfree/2022/jun/20/the-lesson-politicians-refuse-to-learn-people-are-crying-out-for-a-leader-who-is-honest-about-what-they-stand-for\" title=\"\">Opinion, 20 June</a>). She is right, of course, just as the Labour party is wrong when its leaders keep hiding behind the “we can’t tell you what we would do to solve the problem because the election is two years away” fence. We still don’t know what Labour really stands for, and it doesn’t appear to have the big beasts capable or willing to tell us.</p><p>In 2001, <a href=\"https://www.theguardian.com/politics/2001/may/29/uk.election20015\" title=\"\">Jonathan Freedland quoted</a> the historian Ze’ev Mankowitz as saying that “people don’t believe in ideas: they believe in people who believe in ideas”, illustrating Labour’s then weakness. He pointed out that many people didn’t care about Northern Ireland until Mo Mowlam was put in charge; then everyone paid attention. Why? Big personality, big ideas, an articulated plan for the future. Just what Labour needs now, not in two years’ time.</p> <a href=\"https://www.theguardian.com/politics/2022/jun/22/keir-starmer-is-too-timid-just-when-he-needs-to-show-leadership\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/jun/22/keir-starmer-is-too-timid-just-when-he-needs-to-show-leadership", "date_published": "2022-06-22 17:25:29+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Beware delays in monkeypox test results | Letters", "description": "<p><strong>Sebastian Sandys</strong> says he had to be in isolation for more than a week with no information on when his test result would be ready</p><p>The claim by the UK Health Security Agency that individuals tested for monkeypox are usually informed of their result within 24 hours contrasts with my experience (<a href=\"https://www.theguardian.com/world/2022/jun/19/monkeypox-patients-raise-concerns-uk-tracing-delays\" title=\"\">‘It’s taken so long’: Monkeypox patients raise concerns over UK tracing delays, 19 June</a>).</p><p>I was admitted to a major London teaching hospital on 10 June following my return from Africa with an unidentified infection. Monkeypox was ruled out and I was treated with intravenous antibiotics. Unexpectedly, on 12 June I was informed that I was to be tested for monkeypox after all. I would be placed in isolation and all staff would wear full PPE for the 48 hours that it would take to get a result.</p> <a href=\"https://www.theguardian.com/world/2022/jun/22/beware-delays-in-monkeypox-test-results\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/jun/22/beware-delays-in-monkeypox-test-results", "date_published": "2022-06-22 17:23:56+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "What happens if Russia turns off Europe’s gas supply this winter?", "description": "<p>European countries are racing to prepare for the risk of Russia cutting gas exports. Here’s how things look</p><p>Vladimir Putin and Russian state-owned energy giant Gazprom appear to be turning the screw on Europe by limiting gas supplies. The head of the <a href=\"https://www.theguardian.com/business/2022/jun/22/europe-told-to-get-ready-now-for-russia-to-turn-off-all-gas-exports-iea-winter\">International Energy Agency has now warned</a> that Europe needs to prepare immediately for the eventuality of Russia turning off all gas exports to the region this winter. The invasion of Ukraine has triggered a scramble by countries to wean themselves off energy imports from Russia, but fresh urgency has been injected into those efforts.</p> <a href=\"https://www.theguardian.com/business/2022/jun/22/what-if-russia-cuts-europe-gas-exports-winter\">Continue reading...</a>", "link": "https://www.theguardian.com/business/2022/jun/22/what-if-russia-cuts-europe-gas-exports-winter", "date_published": "2022-06-22 15:50:20+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Without a proper plan, stagflation will be the least of Britain’s problems | Larry Elliott", "description": "<p>Rising prices and recession mean the last thing the government should do is muddle through and leave everything to the market</p><p>Inflation is back with a <a href=\"https://www.theguardian.com/business/2022/jun/22/uk-inflation-rises-to-91-its-highest-rate-in-40-years\">vengeance</a>. The cost of living has not been rising this fast since the Falklands war. Prices are climbing faster than wages. In every respect bar one, this is clearly bad news. The best that Britain can hope for in the months ahead is a period of stagflation: weak growth and rapidly rising prices. If things get really bad, we could be on course for an “incession” – high inflation combined with a recession. Either way, the outlook is grim, especially for those on the lowest incomes, who spend most on energy and food, for which price increases are heftiest.</p><p>The one consolation is that high inflation acts as a national wake-up call. Or at least it should do. For far too long, the UK has drifted along convinced that all is well because cheap imports from China are keeping inflation low and rock-bottom interest rates are fuelling a <a href=\"https://www.theguardian.com/business/2020/mar/19/bank-of-england-cuts-interest-rates-to-all-time-low-of-01are\">house-price boom</a>. It would be nice to think we have finally woken up to reality. But that in itself is an illusion. Just as in the 1970s, the economy’s structural weaknesses have been exposed by a period when prices are hurtling upwards. </p> <a href=\"https://www.theguardian.com/commentisfree/2022/jun/22/stagflation-britain-rising-prices-recession-inflation\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/jun/22/stagflation-britain-rising-prices-recession-inflation", "date_published": "2022-06-22 14:55:09+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The female orgasm: lots of throbbing and quivering – but no moaning", "description": "<p>A woman enjoying a noisy end to sex is a cliche of TV and film. But is there any truth to it?</p><p><strong>Name:</strong> <a href=\"https://www.theguardian.com/society/2016/aug/01/mystery-of-the-female-orgasm-may-be-solved\">The female orgasm</a>.</p><p><strong>Age:</strong> As old as humans.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/jun/22/the-female-orgasm-lots-of-throbbing-and-quivering-but-no-moaning\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/jun/22/the-female-orgasm-lots-of-throbbing-and-quivering-but-no-moaning", "date_published": "2022-06-22 14:12:05+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Baltimore Ravens’ Jaylon Ferguson dies at 26: ‘He was a wonderful young man’", "description": "<ul><li>Linebacker held FBS record for career sacks with 48</li><li>NFL has been hit by a number of premature deaths recently</li></ul><p>Baltimore Ravens linebacker Jaylon Ferguson has died at the age of 26, the team confirmed on Wednesday. </p><p>“We are profoundly saddened by the tragic passing of Jaylon Ferguson,” the team said in a statement. “He was a kind, respectful young man with a big smile and infectious personality. We express our heartfelt condolences to Jaylon’s family and friends as we mourn a life lost much too soon.”</p> <a href=\"https://www.theguardian.com/sport/2022/jun/22/jaylon-ferguson-baltimore-ravens-linebacker-dies-nfl-football\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/jun/22/jaylon-ferguson-baltimore-ravens-linebacker-dies-nfl-football", "date_published": "2022-06-22 13:33:29+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Glastonbury, Windrush and Javanese fire sticks: Wednesday’s best photos", "description": "<p>The Guardian’s picture editors select photo highlights from around the world</p> <a href=\"https://www.theguardian.com/news/gallery/2022/jun/22/glastonbury-windrush-and-javanese-fire-sticks-wednesdays-best-photos\">Continue reading...</a>", "link": "https://www.theguardian.com/news/gallery/2022/jun/22/glastonbury-windrush-and-javanese-fire-sticks-wednesdays-best-photos", "date_published": "2022-06-22 13:13:05+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "It’s never been easier to love English wine", "description": "<p>In the 1990s, wine production was seen as an eccentric hobby. Now, despite their relatively high cost, England is home to some wines of outstanding quality</p><p>Having spent much of my working life with winemakers who never had to leave home to find their dream job, I’ve sometimes wondered what it might be like to have been born and raised in a great wine region. Would it have stripped away the romantic lens through which British wine lovers like me tend to view places such as Burgundy or Barossa? Or would I now be filled with the same easy pride that Burgundians and Barossans, even those who don’t work in the wine business, feel about their local product?</p><p>Probably the latter, given recent developments in the part of Essex where I grew up. Praise for the latest wine produced within a 10-mile radius of where I was born always provides a little flutter of positivity and recognition, not unlike coming across my small town on TV as a kid (“Look, we’re on <em>Lovejoy</em>!”) . Over the past decade place names from bus routes of my childhood have been infused with a sense of glamour. Danbury, Althorne, Latchingdon, Purleigh are all home to vineyards, and wines, that have helped set the new mood in English wine.</p> <a href=\"https://www.theguardian.com/food/2022/jun/22/its-never-been-easier-to-love-english-wine\">Continue reading...</a>", "link": "https://www.theguardian.com/food/2022/jun/22/its-never-been-easier-to-love-english-wine", "date_published": "2022-06-22 13:00:45+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Rwanda is a brutal, repressive regime. Holding the Commonwealth summit there is a sham | Michela Wrong", "description": "<p>Uniting heads of government in Kigali exposes a gaping hole in the association’s values</p><p>Back when I was a reporter based in Africa in the 1990s, there were two organisations whose meetings regularly took place amid widespread media indifference: the Organisation of African Unity (OAU) and the Commonwealth.</p><p>There were solid reasons for our lack of enthusiasm. Such get-togethers were strong on pomp and rigmarole, but the interesting decisions usually took place behind closed doors. Both organisations were widely seen as little more than dictators’ clubs, attuned to the interests of ruling elites while aloof from the millions of citizens they nominally represented.</p><p>Michela Wrong is the author of Do Not Disturb: The Story of a Political Murder and an African Regime Gone Bad</p> <a href=\"https://www.theguardian.com/commentisfree/2022/jun/22/rwanda-hosting-commonwealth-summit-exposes-gaping-hole-values\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/jun/22/rwanda-hosting-commonwealth-summit-exposes-gaping-hole-values", "date_published": "2022-06-22 13:00:45+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "National incident declared over polio virus findings in London sewage", "description": "<p>UK Health Security Agency says evidence of limited community transmission of virus found in wastewater</p><p>Public health officials have declared a national incident after routine surveillance of wastewater in north and east London found evidence of community transmission of poliovirus for the first time.</p><p>The UK Health Security Agency (UKHSA) said waste from the Beckton sewage treatment works in Newham tested positive for vaccine-derived poliovirus in February and that further positive samples had been detected since.</p> <a href=\"https://www.theguardian.com/society/2022/jun/22/polio-uk-public-health-officials-declare-national-incident-over-poliovirus\">Continue reading...</a>", "link": "https://www.theguardian.com/society/2022/jun/22/polio-uk-public-health-officials-declare-national-incident-over-poliovirus", "date_published": "2022-06-22 12:30:13+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "EU plan to halve use of pesticides in ‘milestone’ legislation to restore ecosystems", "description": "<p>Proposals – the first in 30 years to tackle catastrophic wildlife loss in Europe – include legally binding targets for land, rivers and sea</p><p>For the first time in 30 years, legislation has been put forward to address catastrophic wildlife loss in the EU. Legally binding targets for all member states to restore wildlife on land, rivers and the sea were announced today, alongside a crackdown on chemical pesticides.</p><p>In a boost for <a href=\"https://www.theguardian.com/environment/series/the-road-to-kunming\">UN negotiations</a> on halting and reversing biodiversity loss, targets released by the European Commission include reversing the decline of pollinator populations and restoring 20% of land and sea by 2030, with all ecosystems to be under restoration by 2050. The commission also proposed<strong> </strong>a target to cut the use of chemical pesticides in half by 2030 and eradicate their use near schools, hospitals and playgrounds.</p> <a href=\"https://www.theguardian.com/environment/2022/jun/22/eu-legislation-restoration-ecosystems-biodiversity-aoe\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/jun/22/eu-legislation-restoration-ecosystems-biodiversity-aoe", "date_published": "2022-06-22 12:26:58+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Boxing legend Christy Martin: ‘My husband told me for 20 years he would kill me’", "description": "<p>The newly minted Hall of Famer opens up about her trials outside the ring: substance abuse, domestic violence and an attempted murder by her husband, who left her to die on their bedroom floor</p><p>Christy Martin’s original story, the well-trodden narrative of the coal miner’s daughter from West Virginia who left home and stepped into the boxing ring for her professional debut in 1989, ends on the floor of her bedroom in Apopka, Florida, on 23 November 2010. She was 42 years old. At the time, she was the welterweight champion who put women’s boxing on the map, the first female to sign with the sport’s iconic promoter, Don King, the first and, to this day, only, female boxer to appear on the cover of Sports Illustrated.</p><p>Those bits of history were the stuff used to frame her rise, to shape her career within the narrative arc of an underdog. Stories that sung the barriers she’d broken and records she’d set. But they omitted chunks of reality. Christy was gay, and trapped in a violent marriage to her manager, Jim Martin, who was 25 years her senior. She constantly needed to get high. And on that early November evening in 2010, Jim, her then-husband, who was also her abuser and cocaine supplier, her blackmailer and confidant, stabbed her three times and shot her in the chest. There would be no more separation between who she was in public and how she survived at home.</p> <a href=\"https://www.theguardian.com/sport/2022/jun/22/boxing-legend-christy-martin-my-husband-told-me-for-20-years-he-would-kill-me\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/jun/22/boxing-legend-christy-martin-my-husband-told-me-for-20-years-he-would-kill-me", "date_published": "2022-06-22 11:21:31+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "How to make carrot cake – recipe | Felicity Cloake's Masterclass", "description": "<p>It dates back hundreds of years, but carrot cake as we know it today is an altogether more luxurious treat. Here’s a step-by-step guide to making it</p><p>A medieval idea given a new lease of life by wartime rationing, carrots in desserts disappeared as soon as sugar became widely available again, only to pop up in the 1980s as a glamorous American import. It’s fair to say that, these days, carrot cake is a little more decadent than it was under the Ministry of Food, and all the nicer for it.</p><p>Prep <strong>45 min</strong><br />Cook <strong>30 min</strong><br />Serves <strong>6-8</strong></p> <a href=\"https://www.theguardian.com/food/2022/jun/22/how-to-make-carrot-cake-recipe-felicity-cloake-masterclass\">Continue reading...</a>", "link": "https://www.theguardian.com/food/2022/jun/22/how-to-make-carrot-cake-recipe-felicity-cloake-masterclass", "date_published": "2022-06-22 11:00:43+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘Honour killings? It should be called the devil’s work’: Bekhal Mahmod on the murder of her sister", "description": "<p>After Banaz Mahmod was killed by her father, uncle and three other men in 2006, it was her sister’s testimony that helped bring them to justice. Before the release of her memoir she tells of her rage at what happened and why she is still living in hiding</p><p>Bekhal Mahmod, like an avenging angel, doesn’t forgive. To do so would be to betray her younger sister, Banaz. She has watched the film Law Abiding Citizen, in which Gerard Butler takes brutal revenge on the men who murdered his wife and daughter, 50 times. She fantasises about hurting those who murdered her sister in the same way they hurt Banaz. She wishes they would die in jail and their ashes would be flushed down a sewer. She hopes that the people who covered up Banaz’s murder will never see the light of heaven.</p><p>She has a long list of people she hates. Her father, Mahmod Mahmod, who arranged the murder of her beloved Banaz in an “honour” killing. Her uncle Ari Mahmod, who pressed Mahmod to have Banaz killed and fixed the murder. Mohammed Saleh Ali, Omar Hussain and Mohamad Hama, who spent hours torturing and raping 20-year-old Banaz, before strangling her to death on 24 January 2006. The south London Kurdish community, who blocked and resisted the Metropolitan police’s investigation into Banaz’s killing with its omertà.</p> <a href=\"https://www.theguardian.com/uk-news/2022/jun/22/honour-killings-devils-work-bekhal-banaz-mahmod\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/jun/22/honour-killings-devils-work-bekhal-banaz-mahmod", "date_published": "2022-06-22 09:00:40+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Inside the Israeli army’s mock Gaza – in pictures", "description": "<p>Zeelim army base in southern Israel is known officially as the Urban Warfare Training Centre. But to some soldiers, it is known as Mini Gaza, simulating a Palestinian urban area with 500 buildings and narrow alleyways adorned with murals and posters honouring slain fighters</p> <a href=\"https://www.theguardian.com/world/gallery/2022/jun/22/inside-israeli-army-mock-gaza-zeelim-army-base-in-pictures\">Continue reading...</a>", "link": "https://www.theguardian.com/world/gallery/2022/jun/22/inside-israeli-army-mock-gaza-zeelim-army-base-in-pictures", "date_published": "2022-06-22 07:23:15+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "After the flood: torrential monsoon rains devastate Bangladesh once again", "description": "<p>At least 60 people have been killed and millions need help after floodwater submerged 80% of Sylhet district in what aid agencies say is the worst monsoon in 20 years</p> <a href=\"https://www.theguardian.com/global-development/gallery/2022/jun/22/after-the-flood-torrential-monsoon-rains-devastate-bangladesh-once-again\">Continue reading...</a>", "link": "https://www.theguardian.com/global-development/gallery/2022/jun/22/after-the-flood-torrential-monsoon-rains-devastate-bangladesh-once-again", "date_published": "2022-06-22 06:30:23+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "A moment that changed me: a car crash altered my mother for ever – and I was sent back to boarding school", "description": "<p>I was 10 when our car was forced off the road by an unqualified driver, and in the ambulance when my mother had a stroke. Yet no one explained to me why she was so different</p><p>It was the Easter holidays and I was 10. We were going to see Wardour Castle in Wiltshire. My mother was driving our Morris Traveller and my eldest brother was beside her. I was giggling in the back with a cousin. Possibly my mother was arguing with my brother. He was her favourite, but growing away from her so they argued a lot. There was no radio; the car was too old for that. Both the front windows were wound down as we were in deep countryside, on a woody lane, and my mother liked fresh air.</p><p>We would say afterwards that the other car “came out of nowhere” but it simply came around a corner. It just happened to be on our side of the narrow lane, and the driver, inexperienced and unqualified slammed his foot on the accelerator instead of the brake. Their car drove ours into a bank, which made it hard to clamber out but my mother said we must all get out in case the car burst into flames. My cousin was in tears but unhurt. My jaw hurt where I had been flung against my brother’s seat. My brother’s long legs had been braced against the impact, seemingly. While he was left to deal with the weeping cousin and sheepish young driver, I led my mother down the lane to a nearby cottage so she could call the police and the <a href=\"https://www.theguardian.com/money/2021/nov/10/rac-and-aa-to-end-salute-traffic-danger-archive-1961\">AA</a>.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/jun/22/a-moment-that-changed-me-a-car-crash-altered-my-mother-for-ever-and-i-was-sent-back-to-boarding-school\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/jun/22/a-moment-that-changed-me-a-car-crash-altered-my-mother-for-ever-and-i-was-sent-back-to-boarding-school", "date_published": "2022-06-22 06:00:23+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "A world without adults! Julie Blackmon’s domestic visions – in pictures", "description": "<p>With barely a grownup in sight, Blackmon’s ‘fever dream’ images are comical and idyllic … and yet fraught with danger too</p><p></p><p></p> <a href=\"https://www.theguardian.com/artanddesign/gallery/2022/jun/22/a-world-without-adults-julie-blackmons-domestic-visions-in-pictures\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/gallery/2022/jun/22/a-world-without-adults-julie-blackmons-domestic-visions-in-pictures", "date_published": "2022-06-22 06:00:23+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "A tale of two byelections", "description": "<p>After the resignations in disgrace of two Tory MPs, the Lib Dems and Labour are hoping to snatch victories in Thursday’s byelections. Are Boris Johnson’s voters ready to desert him?</p><p>After the resignations in disgrace of two Conservative MPs, voters in the constituencies of <a href=\"https://www.theguardian.com/politics/2022/jun/10/tories-face-tough-test-as-they-try-to-hang-on-to-tiverton-and-honiton-seat\">Tiverton and Honiton</a> and <a href=\"https://www.theguardian.com/politics/2022/jun/19/he-comes-over-as-weak-keir-starmer-fails-to-convince-wakefield-voters\">Wakefield</a> will go to the polls on Thursday in byelections that could hold clues to the outcome of the next general election.</p><p>Our political correspondent <strong>Peter Walker </strong>has been in Tiverton where, despite the Tories defending a huge majority, the Liberal Democrats are hopeful they can snatch the seat. He tells <strong>Hannah Moore </strong>that voters are increasingly fed up with Boris Johnson and may be in the mood to punish him.</p> <a href=\"https://www.theguardian.com/news/audio/2022/jun/22/a-tale-of-two-byelections\">Continue reading...</a>", "link": "https://www.theguardian.com/news/audio/2022/jun/22/a-tale-of-two-byelections", "date_published": "2022-06-22 02:00:18+00:00", "persistent": false, "user": null, "language": "en-UK"}]