[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCy0tKL1T7wFoYcxCe0xjN6Q", "title": "Is Philips discontinuing their coolest warmest product?", "description": "Gonna take on a light subject today.\n\nLinks n' stuff\nTechnology Connections on Twitter:\nhttps://twitter.com/TechConnectify\nThe TC Subreddit\nhttps://www.reddit.com/r/technologyconnections\n\nThis channel is supported through viewer contributions on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!\nhttps://www.patreon.com/technologyconnections\n\nOh, and look at these wonderful patrons!\nPatrick, Andrew Hoddinott, Benjamin Rister, Oswyn Brent, A tall shade of the color red, Colin Gagich, Mike McCaffrey, Mike Olpin, Victor Engmark, Michael Steinmetz, Andrew Krew, Devedander, Bryan Countryman, David McGrath, Richie Gaiser, Benjamin Albert, Truls, Cuervo , Mauve, Martin, Eric Graves, Philip Cheek, Alexander Schlickenmaier, Jesse Weaver, Thomas Kula, Ed McCloskey, Harold Godwinson, Jordan DeLong, Keith Hemenway, Aaron Greenberg, Matt Brown, Oliver White, Andrew Eslick, Joel V, John Harris, Mike and Zack, DCBuffalo, Emilio Mendoza, Patricia , Cody, Cuddlefisch , nate grover, Martin Smith, bagel mode, DankPods, Ian McDougall, Derek Watson, Marten van Wezel, Dan Barrett, Kristofer Luck, Arazil, Corey W. Anderson, Nathaniel Caza, Andrew Chappell, Sammie Mammel, Serge Wroclawski, Matthew Hackbarth, Joel Neatrour, John Zelinka, Jimmy Albin, Jordan Thoms, Andre Alforque, Kevin , Paul HW, Anthanasius, Steven gindler, Matt Keaveney, Keegan Carter, TJ , Zengwish, Bennett Colesberry, Ivan Avdeev, Ron Thomas, John Haager, Joshua Nahum, Chris, Sobol, cyberstorm, Keith Chang, Brad Feehan, Mitch Brunner, Eric Rakestraw, Brett Caven, h2g2guy , Charlie Davidson, Matthew Abbitt, Thomas & Robert Rhode, Steve McClellan, nitind, Dennis Morhardt, Scott Albertine, Jelle De Loecker, Michal Miškerník, Ry Biesemeyer, NobTinker , Devin Edwards, Randy Messinger, Seth Persigehl, Piro606, Hans Guthrie, Nathan Friedly, Matthew David Chapin, Bill King, Roadrunner 531, Gareth Brown, Butter Penguin, John Whitaker, João Pedro Francese, Mike Richards, ZGryphon , Andreas Trottmann, Lee Sweet, Justin Zakrzeski, Jared Julien, Max Maguire, Gunnsteinn Þórisson, RandallA, John Heavisides, Rob Newman, Mark Muir, Andrew Moriarty, Steve Murray, J.C. Lundberg, Jacob Tuley, Matthew Barnes, Hugh Jasole, Brian Thomas Garcia-Luense, Joel Eblin, Ted Kaplan, Sarah Marchesi, Jim Thoenen, Russell Pitcher, David Cichowski, ioangogo", "link": "https://www.youtube.com/watch?v=tbvVnOxb1AI", "date_published": "2022-06-22 16:01:39+00:00", "persistent": false, "user": null, "language": "en-US"}]