[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Biggest Game Releases For September 2022", "description": "Back to school season is upon us, but we’ve got a list of games that you can play instead of doing that homework. Here are 10 of the biggest games releasing in September 2022.\n#Gaming #Splatoon3 #NBA2K23\n\nSeptember is starting strong with the re-remaster of one of the best games of all time. The Last of Us Part 1 features updated and improved AI, a new permadeath mode, a speedrun mode, an updated photo mode, unlockable costumes for Joel and Ellie and a model viewer. On the technical side, Part 1 can render in native 4K at a targeted 30fps or a dynamic 4K at a targeted 60fps display mode.\n\nThis year’s NBA offering from 2K makes a host of changes to the gameplay and focuses on bringing balance back to the offensive game. New gesture combos, such as double throws and switchbacks, are meant to provide shooting windows in tight quarters. Double-throw gestures are used for hop-step layups, while switchback gestures are used for Euro-step and cradle layups. The game's ball handling combos are also getting expanded on, with the full list of Moving Crossovers nearly doubling from last year's game, from 15 to 28 options.\n\nSplatoon is back and this time around it's introducing new modes like Splatfests, matches that will feature not two but three competing sides and table Turf Battle, a new card-collecting puzzle game mode. All of the weapons from previous Splatoon games will be returning, along with a new bow-and-arrow-like weapon called a Stringer, and a melee sword weapon with a charged slash called a Splatana.\n\nSTAMPS\n00:00 - Intro\n00:10 - The Last of Us Part 1\n01:23 - NBA 2K23\n02:18 - Splatoon 3\n03:22 - JoJo’s Bizarre Adventure\n04:11 - Steelrising\n04:59 - Metal: Hellsinger\n05:51 - Return To Monkey Island\n06:25 - Soulstice\n07:02 - Serial Cleaners\n07:49 - The DioField Chronicle", "link": "https://www.youtube.com/watch?v=SSFp_dnSD5A", "date_published": "2022-08-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best Xbox Game Pass Games To Play Right Now", "description": "Xbox Game Pass continues to grow each month, with new games like Immortality and action brawlers such as Midnight Fight Express. Here's a list of seven great games you can play on the service right now.\n#gamespot #gamepass #xbox \n\nXbox Game Pass, Microsoft's gaming subscription service, is often referred to as the best deal in gaming, and for good reason. Each month, multiple games are added to its rotating catalog of titles, a mix of first-party Xbox games, indies, and other huge games. \n\nIt can be a little overwhelming, but have no fear. In this video, we're going to tell you the best games to play on Xbox Game Pass. There's something for everyone, from puzzle mystery games like Immortality, to unrelenting brawlers such as Midnight Fight Express. If you're in the mood for something more chill, there's also Coffee Talk and Cooking Simulator. And speaking of sims, Two Point Campus is also available on Game Pass this month. Each month, GameSpot highlights the best games on Xbox Game Pass, so make sure you subscribe to get the best recommendations.\n\nTIMESTAMPS:\n00:00 - Intro\n00:15 - Immortality\n01:13 - Midnight Fight Express\n02:13 - Tinykin\n03:28 - Immortals Fenyx Rising\n04:20 - Coffee Talk\n05:31 - Cooking Simulator\n06:40 - Two Point Campus\n07:35 - Outro", "link": "https://www.youtube.com/watch?v=XScPiR3-5Cw", "date_published": "2022-08-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Big Chungus Might Be Headed To MultiVersus | GameSpot News", "description": "Big Chungus might be headed to MultiVersus and September’s Games with Gold have been revealed.\n#GamingNews #BigChungus #Xbox \n\nAs spotted in a European Union trademark filing that was shared on Twitter by Andrew Marmo, it looks like Big Chungus might be headed to MultiVersus. The trademark filing for video game software doesn't mention MultiVersus in its fine text, but Big Chungus would be a natural fit for MultiVersus and its varied roster that includes Scooby Doo characters, Batman, and Morty from Adult Swim's Rick and Morty animated series. Big Chungus is also canon to Looney Tunes, as the character appeared in the iOS and Android game World of Mayhem in 2021 and on the big screen in Space Jam 2.\n\nAnd sticking with the subject of free games, Microsoft has unveiled the next batch of monthly free games for Xbox Live Gold and Game Pass Ultimate subscribers. September's Games with Gold lineup includes Gods Will Fall, Double Kick Heroes, Thrillville, and Portal 2. The latter pair of games are the final Xbox 360 backwards compatible classics that Microsoft is giving away via Games with Gold. Starting in October, the service will only include games from the Xbox One era and up.\n\nSTAMPS\n00:00 - Intro\n00:05 - Big Chungus\n00:55 - Games with Gold", "link": "https://www.youtube.com/watch?v=QkO_ncX-h90", "date_published": "2022-08-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Last of Us Part I: Bill's Town Official Gameplay", "description": "Check out 7 minutes of gameplay from the Last of Us Part I in Bill's Town. You'll get to see various action with Joel and Ellie, including fighting a Bloater.\n\n#thelastofus #playstation #gaming", "link": "https://www.youtube.com/watch?v=1Z-MqA0mUEk", "date_published": "2022-08-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New PS5 Model Spotted In Australia | GameSpot News", "description": "A lighter PS5 has quietly hit the shelves in Australia and Sony announced its plans to buy another studio.\n#GamingNews #GameSpot #PS5 \n\nNew PS5 console models have launched in Australia, and similar to previous PlayStation iterations of the past, they bear new model numbers. These new editions--the CFI-1202B digital console and the CFI-1202A disc console--don't have any  cosmetic changes but are lighter than the previous builds.\n\nIn other Sony news, PlayStation has now acquired yet another big studio. Sony Interactive Entertainment today announced plans to buy Savage Game Studios, a mobile studio based in Finland and Germany, that is currently working on a AAA live-service game for mobile. Whether or not this game will be a PlayStation franchise or a new IP remains to be seen.\n\nAnd while we’re on the subject of mobile games don’t forget we’re hosting our first ever Mobile show, Swipe, on September 8 at 10am PT / 1pm ET.\n\nThe showcase will feature a wide variety of games from different genres, and you can expect exclusive trailers and gameplay videos, game reveals, and new details on upcoming live-service game updates. Some of the major publishers and developers confirmed for the show include: Activision, Apple Arcade, EA, Netflix, Ubisoft and more. \n\nAlongside all of this, you can look forward to in-depth coverage here on GameSpot, providing a further look into all of these exciting games. With improvements to mobile phone hardware and the advent of mobile gaming controllers, there's never been a more exciting time to play games on your phone, whether it's a full-fledged version of what you'd find on consoles in Genshin Impact or a mobile-specific creation like we've seen from franchises such as PUBG, Call of Duty, or Rocket League.\n\nSTAMPS\n00:00 - Intro\n00:06 - New PS5 Model\n01:46 - Sony New Studio\n02:28 - Swipe Mobile Showcase", "link": "https://www.youtube.com/watch?v=rmKEEF7AXls", "date_published": "2022-08-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Complete THE LAST OF US Timeline Explained!", "description": "Within the space of 2 and a bit games, and a tie-in comic, The Last of Us franchise covers quite a lot of ground. From its heartbreaking opening moments all the way through to Part 2’s epic tale of revenge, there’s a huge amount of twists and turns across its extensive timeline that spans well over 25 years. \n\n00:00 - Opening\n00:39 - 2013\n02:13 - 2032\n03:21 - Summer 2033\n06:11 - Late Summer 2033\n07:15 - Fall 2033\n08:48 - Winter 2033\n10:11 - April 28 2034\n12:13 - April 28 2034 (Abby)\n13:17 - Summer 2034\n14:04 - 2035\n15:13 - 2036\n16:08 - December 2037\n16:35 - March 2038\n18:57 - Summer 2038\n20:32 - Summer 2038 (Abby)\n24:03 - Early Summer 2039\n25:17 - Mid-Summer 2039\n26:14 - Late Summer 2039\n26:49 - Ending\n\nWith The Last of Us Part 1 out, alongside a new TV adaptation, what better time to reacquaint yourself with Naughty Dog’s stellar survival series.\n\nTimeline Playlist - https://www.youtube.com/watch?v=0xHZFaybvZE&list=PLpg6WLs8kxGN7aotOq-B5tYZWpvTZ3KRS", "link": "https://www.youtube.com/watch?v=3gaFRoP4RUA", "date_published": "2022-08-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]