[{"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "USA: Policjant strzelił osiem razy do mężczyzny. Nagranie z kontrowersyjnej interwencji", "description": "Amerykańscy policjanci przyjechali na miejsce strzelaniny. Zastali tam ciężko rannego 21-latka oraz przypadkowych gapiów. Od tych ostatnich mundurowi usłyszeli, że stojący obok brat poszkodowanego ma broń. Zażądali więc kilka razy, by Bryan Richardson odrzucił pistolet. Nie zrobił tego, dlatego zastępca szeryfa strzelił osiem razy w stronę młodego mężczyzny. Rodzeństwo zmarło w szpitalu.", "link": "https://www.polsatnews.pl/wiadomosc/2022-08-29/usa-policjant-strzelil-osiem-razy-do-mezczyzny-nagranie-z-kontrowersyjnej-interwencji/", "date_published": "2022-08-29 19:58:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "USA. Wypadek w nowojorskim metrze. Nastolatek stracił rękę", "description": "15-latek stracił rękę w tajemniczym wypadku, do którego doszło w Nowym Jorku. Chłopca przewieziono do szpitala i amputowano mu kończynę po tym, jak jej część została odcięta przez nadjeżdżające metro. Policja bada sprawę.", "link": "https://www.polsatnews.pl/wiadomosc/2022-08-29/usa-wypadek-w-nowojorskim-metrze-nastolatek-stracil-reke/", "date_published": "2022-08-29 19:55:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Włochy: Służby ostrzegają przed oszustami. Naciągają turystów na wynajmowanie mieszkań", "description": "We Włoszech nastąpił gwałtowny wzrost oszustw związanych z wynajmowaniem mieszkań i innych kwater. Oszukiwani są głównie turyści i studenci. Niedawno ofiarą takiego działania zostały dwie polskie studentki.", "link": "https://www.polsatnews.pl/wiadomosc/2022-08-29/wlosi-ostrzegaja-przed-oszustami-naciagaja-turystow-na-wynajmowanie-mieszkan/", "date_published": "2022-08-29 18:53:00+00:00", "persistent": false, "user": null, "language": null}]