[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Life After Desk: Catching Up With 2015 Tiny Desk Contest Winner Fantastic Negrito", "description": "\"I had never really heard of Tiny Desk,\" says our first-ever Tiny Desk Contest winner Fantastic Negrito. \"I realized 'wow, this is about to change my life ... It was going to be like busking on the streets -- on steroids.\"\n \nFantastic Negrito has gone on to headline world tours, win 3 Grammy Awards and release 4 albums. NPR Music recently caught up with him to hear about how his life has changed since winning the Contest.\n \nThe Tiny Desk Contest is supported by @statefarm", "link": "https://www.youtube.com/watch?v=ZwObGflIJyM", "date_published": "2022-08-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Endea Owens and The Cookout: Tiny Desk Concert", "description": "Jazz may not be the first thing that comes to mind when you think of The Juilliard School, but perhaps this series of Tiny Desks will change that. Tiny Desk and Jazz Night in America celebrate the 20th anniversary of Juilliard Jazz with three Tiny Desk concerts featuring performances by current students and alumni of the prestigious institution.\n\nNikki Birch | August 29, 2022\nClad in a fringed, royal blue halter suit, bassist Endea Owens and her band The Cookout were all smiles. Although she’s no stranger to the Tiny Desk (playing with Jon Batiste in 2020) Owens was giddy with excitement to perform her own music with fellow Juilliard alumni. She spoke about the importance of using her music to speak for the voiceless, and to build and enrich communities. She’s not all talk either — during the COVID-19 pandemic, the house bassist for The Late Show with Stephen Colbert has hosted community cookouts, playing music for people in Harlem and handing out hundreds of free meals. \n\nThe first tune “Where the Nubians Grow” is a head-bobbing groove dedicated to her hometown of Detroit. With “Feel Good,” her fierce intro gives way to a catchy bass line that the band joyfully hopscotches over. Owens then dims the proverbial lights with “Love Cynical” a song that gives ballroom jazz with silky horn lines and a sensuous beat. Before we can get too cozy, the band erupts into “Cycles,” a dizzying showcase for horns and drums.\n\nTo close her shows, Owens always asks audiences to participate in affirmations allowing a continuation of the positive vibes. After a brief introduction of “Lift Every Voice and Sing” the band plays “For the People (In dedication to Taleshia Chandler),” another uplifting number. This Tiny Desk energized the whole room, each musician a master of their instrument. Owens joked: “We are all Juilliard alumni, so you can hear it in the sound.” \n\n\nSET LIST\n“Where the Nubians Grow”\n“Feel Good”\n“Love Cynical”\n“Cycles”\n“For the People (In dedication to Taleshia Chandler)”\n\nMUSICIANS\nEndea Owens: bass\nGiveton Gelin: trumpet\nJeffery Miller: trombone\nZoe Obadia: alto saxophone\nLee Pearson: drums\nJonathan Thomas: piano\n\nTINY DESK TEAM\nProducer: Nikki Birch\nAudio Engineer: Josh Rogosin \nDirector: Kara Frame \nCreative Director: Bob Boilen\nSeries Producer: Bobby Carter\nEditor: Kara Frame\nVideographers: Kara Frame, Pierre Kattar, Michael Zamora\nAnimator: Alanté Serene\nAudio Assistant: Natasha Branch\nProduction Assistants: Jill Britton, Alanté Serene\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #endeaowens", "link": "https://www.youtube.com/watch?v=KD3vTmbIZdU", "date_published": "2022-08-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]