[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "New advice on covid vaccination in pregnancy", "description": "JCVI issues new advice on COVID-19 vaccination for pregnant women\n\nhttps://www.gov.uk/government/news/jcvi-issues-new-advice-on-covid-19-vaccination-for-pregnant-women\n\nPregnant women now a priority group for COVID-19 vaccination\n\nhttps://www.npeu.ox.ac.uk/news/2194-pregnant-women-now-a-priority-group-for-covid-19-vaccination\n\nPregnant women are to be considered a 'vulnerable' group, emphasising the urgency of them receiving COVID-19 vaccination and booster doses\n\nVaccine misinformation policy\n\nhttps://support.google.com/youtube/answer/11161123\n\nDon't post content on YouTube if it includes harmful misinformation about currently approved and administered vaccines on any of the following:\n\nVaccine safety: content alleging that vaccines cause chronic side effects, outside of rare side effects that are recognised by health authorities\n\nEfficacy of vaccines: content claiming that vaccines do not reduce transmission or contraction of disease \n\nCOVID-19 medical misinformation policy\n\nhttps://support.google.com/youtube/answer/9891785\n\nClaims about COVID-19 vaccinations that contradict expert consensus from local health authorities or the WHO\n\nClaims that an approved COVID-19 vaccine will cause death, infertility, miscarriage, autism or contraction of other infectious diseases\n\nClaims that COVID-19 vaccines will make people who receive them magnetic\n\nPregnancy, breastfeeding, fertility and coronavirus (COVID-19) vaccination\n\nhttps://www.nhs.uk/conditions/coronavirus-covid-19/coronavirus-vaccination/pregnancy-breastfeeding-fertility-and-coronavirus-covid-19-vaccination/\n\nThere's no evidence COVID-19 vaccination increases the risk of having a miscarriage, pre-term birth or other complications in your pregnancy.\n\nThe COVID-19 vaccines do not contain any live viruses and cannot give you or your baby COVID-19.\n\nCOVID-19 vaccination in pregnancy\n\nhttps://www.england.nhs.uk/coronavirus/documents/covid-19-vaccination-in-pregnancy/\n\nResearch published on 25 July by UKOSS (UK Obstetric Surveillance System national cohort),\n\nsuggests that the Delta variant is associated with an increased risk of severe illness among hospitalised pregnant women, \n\ncompared with the Alpha and ‘wildtype’ variants of previous waves.\n\nCurrent delta prevalence\n\nhttps://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1093275/covid-technical-briefing-44-22-july-2022.pdf\n\n3.4%  BA.2\n\n17.2%  BA.4\n\n78.7%  BA.5\n\n0.7%  classified as other\n\nUS, CDC, Nowcast\n\nhttps://covid.cdc.gov/covid-data-tracker/#variant-proportions\n\n \n\nJCVI issues new advice on COVID-19 vaccination for pregnant women\n\nhttps://www.gov.uk/government/news/jcvi-issues-new-advice-on-covid-19-vaccination-for-pregnant-women\n\nThe JCVI has advised that pregnant women should be offered the COVID-19 vaccine at the same time as the rest of the population, based on their age and clinical risk group.\n\nBased on this (US) data\n\nhttps://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/vsafepregnancyregistry.html\n\nJoint Committee on Vaccination and Immunisation (JCVI)\n\nAdvises that it’s preferable for pregnant women in the UK to be offered the Pfizer-BioNTech or Moderna vaccines where available. \n\nThere is no evidence to suggest that other vaccines are unsafe for pregnant women, but more research is needed.\n\nPublic Health England’s Green Book\n\nhttps://www.gov.uk/government/publications/covid-19-the-green-book-chapter-14a\n\nThe Green Book\n\nhttps://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1098808/Greenbook-chapter-14A-17August2022.pdf\n\nadvises that pregnant women should discuss the risks and benefits of vaccination with their clinician, \n\nincluding the latest evidence on safety and which vaccines they should receive.\n\nProfessor Wei Shen Lim, COVID-19 Chair for JCVI\n\nWe encourage pregnant women to discuss the risks and benefits with their clinician \n\nThere is more real-world safety data from the US in relation to the Pfizer-BioNTech and Moderna vaccines in women who are pregnant – \n\ntherefore, we advise a preference for these to be offered to pregnant women.\n\nDr Edward Morris, President, Royal College of Obstetricians and Gynaecologists\n\nReporting of side effects\n\nhttps://www.gov.uk/government/publications/regulatory-approval-of-pfizer-biontech-vaccine-for-covid-19/information-for-uk-recipients-on-pfizerbiontech-covid-19-vaccine\n\nIf you get any side effects, talk to your doctor, pharmacist or nurse. \n\nThis includes any possible side effects not listed in this leaflet. \n\nIf you are concerned about a side-effect it can be reported directly via the Coronavirus Yellow Card reporting site \n\nhttps://coronavirus-yellowcard.mhra.gov.uk", "link": "https://www.youtube.com/watch?v=po3GMgee-vc", "date_published": "2022-08-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]