[{"source": "https://www.jefftk.com/news.rss", "title": "Masking to Avoid Missing Things", "description": "<p><span>\n\nAbout a year ago I </span>\n\n<a href=\"https://www.jefftk.com/p/personal-response-to-omicron\">wrote</a>\nthat I'd now:\n\n\n\n<p>\n\n</p>\n\n<blockquote>\nfollow official guidance and mask regulations, cheerfully go\nalong with precautions others need, and test+isolate when sick, but\nI'm not going to go above and beyond to attempt to reduce spread the\nway I did for earlier parts of the pandemic.\n</blockquote>\n\n\n\n<p>\n\nAnd yet I'm often wearing an N95 in situations where they're not\nrequired and a large majority of other people aren't masked.  Are\nthese in tension?\n\n</p>\n\n<p>\n\nMy views haven't changed.  I still think that if my region and the\ncommunities I'm part of aren't going to put a serious effort into\nkeeping covid from spreading then it doesn't make sense for me to make\nlarge sacrifices on my own for pro-social reasons.  But if I get\ncovid, or one of the several other things going around, I'll need to\nisolate to avoid getting other people sick.  That means missing things\nI'd be very sad to miss, and I'll take steps to avoid that:\n\n</p>\n\n<p>\n\n</p>\n\n<ul>\n\n<li><p>I masked at the <a href=\"http://metasub.org/2022-agenda/\">MetaSUB</a> conference the\nweekend before Thanksgiving.\n\n</p></li>\n<li><p>I masked at Sunday's <a href=\"https://www.eaboston.org/\">EA dinner</a> and my work's holiday\nparty because I'm running music for a <a href=\"https://www.facebook.com/events/3403227779922411\">secular\nsolstice</a> this Saturday (sort of an atheist church service inspired\nby ideas from the effective altruism and rationalist communities).\n\n</p></li>\n<li><p>I'm planning to mask at the solstice event because it's just\nbefore relatives come to town for Christmas.\n\n</p></li>\n</ul>\n\n\n\n<p>\n\nOn the other hand, I didn't mask at Thanksgiving and I'm not planning\non masking at Christmas because being sick right after that is, while\nnot ideal, basically fine.\n\n</p>\n\n<p>\n\nWhile this does have pro-social effects, slowing down the rate of\ntransmission of airborne diseases, my motivation here is primarily\nselfish: I don't want to miss things.\n\n</p>\n\n<p><i>Comment via: <a href=\"https://www.facebook.com/jefftk/posts/pfbid0btqdK3Wrv9aAFFW6Gfaqhuq7D2tHGuRBQ7wG4ZJriNBaSoxavAMTssiu3mXGxpNCl\">facebook</a>, <a href=\"https://lesswrong.com/posts/SjyDXu36pBFqh2mxM\">lesswrong</a>, <a href=\"https://mastodon.mit.edu/@jefftk/109519692827743907\">mastodon</a></i></p>", "link": "https://www.jefftk.com/p/masking-to-avoid-missing-things", "date_published": "2022-12-15 08:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]