[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Chinese massive spread", "description": "Download free high-res PDFs of the posters, download free copies of my two text books. Any donations using this link help the work of campbell teaching.\nhttps://drjohncampbell.co.uk/\n\nMy personal intake\n\n4,000 iu vitamin D = 100 micrograms\n\n(with K2 100 micrograms per day)\n\nBoth with food\n\n15mg Zinc\n\nThe Role of Zinc in Antiviral Immunity\n\nhttps://pubmed.ncbi.nlm.nih.gov/31305906/\n\nAn abundance of evidence has accumulated over the past 50 y to demonstrate the antiviral activity of zinc against a variety of viruses, and via numerous mechanisms. \n\nVaried, high plant diet\n\nVitamin C, oranges and tomatoes\n\nChina\n\nhttps://www.globaltimes.cn/page/202211/1280588.shtml\n\nhttps://asiatimes.com/2022/12/new-stealth-omicron-variant-spreading-fast-in-china/\n\nOmicron, BF.7, (BA.5.2.1.7)\n\nSub-lineage of omicron variant BA.5\n\nMain variant spreading in Beijing\n\nhttps://www.chinadaily.com.cn/a/202211/29/WS63855959a31057c47eba1912.html\n\nDr. Li, Chief physician, Beijing YouAn Hospital, Department of Infectious Diseases\n\nHow infectious is the Omicron subvariant BF.7?\n\nMuch more contagious than BA.1, BA.2, BA.5\n\nStronger immune evasion potential\n\nShorter incubation period\n\nFaster transmission speed\n\nR0, (basic reproduction number)\n\nDelta strain, 5 to 6\n\nBF.7 10 to 18.6\n\nMost infectious omicron subvariant\n\ncausing larger difficulty in epidemic prevention and control\n\nWhy does the number of new infections keep growing in Beijing?\n\nPeople begin viral shedding one day after contract\n\nSecond-generation cases may appear within two or three days\n\n(may be missed by testing)\n\nTime for infected people to turn negative is still about seven to 10 days.\n\nIn addition\n\nSymptoms are generally mild\n\nMany infections show mild or no symptoms\n\nThat's why it's important to find the infected and cut the transmission chain as soon as possible.\n\nMajor symptoms\n\nFever, coughing, sore throat, decreased sense of smell and taste. \n\nDiarrhea and vomiting (less common)\n\nAsymptomatic cases usually don't need medicine or medical treatment. \n\nHigh-risk groups\n\nElderly\n\nUnderlying diseases or weak immunity\n\nSmokers\n\nObesity \n\nLater stages of pregnancy\n\nSo we will monitor their situations more closely.\n\nBeijing, treats in accordance with symptoms\n\nAntipyretics and painkillers to help patients with fever or coughing. \n\nHigh risk to deteriorate, antiviral drugs\n\nMost asymptomatic cases, quarantined at home\n\nAre ordinary medical surgical masks still effective in preventing infection from the more contagious Omicron variant BF.7?\n\nVirus, mainly reproduces in the upper respiratory tract\n\nAble to spread the virus, coughing, speaking loudly\n\nMedical surgical masks are not as airtight and effective as N95 and KN95 masks\n\nBeijing, continue to make prevention and control measures more \"scientific, rational, targeted and effective\"\n\n\n \n\nhttps://www.who.int/director-general/speeches/detail/who-director-general-s-opening-remarks-at-the-media-briefing---14-december-2022\n\nAs we look to end this emergency, we still need to understand how it began.\n\nWe continue to call on China to share the data and conduct the studies that we have requested, to better understand the origins of this virus.\n\nAs I have said many times, all hypotheses remain on the table.\n\nOne of the most important lessons of the pandemic is that all countries need to strengthen their public health systems to prepare for, prevent, detect and respond rapidly to outbreaks, epidemics and pandemics.\n\nAn advanced medical care system is not the same thing as a strong public health system.\n\nOne of the other key lessons of the pandemic is the need for much stronger cooperation and collaboration, rather than the competition and confusion that marked the global response to COVID-19.\n\nThe global outbreak of mpox\n\n82,000, 110 countries, 65 deaths\n\nWeekly reported cases, declined 90% since July.\n\nEbola outbreak in Uganda\n\nNo new cases in past 2 weeks\n\nGreater Horn of Africa\n\nSevere drought acute health and hunger crisis.\n\n47 million people are now facing hunger,\n\ndisease outbreaks are surging.\n\nCDC data\n\nhttps://covid.cdc.gov/covid-data-tracker/#new-hospital-admissions\n\nUK data\n\nhttps://coronavirus.data.gov.uk", "link": "https://www.youtube.com/watch?v=bmPONj8bjIw", "date_published": "2022-12-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]