[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best Nintendo Switch Games of 2022", "description": "The Nintendo Switch is getting up in years, but the hybrid portable console is still going strong. The platform had a solid year of great new releases, especially from outside the realm of Nintendo's usual top-tier franchises.\nGames like Kirby and Switch Sports were excellent callbacks to some beloved brands that didn't lean hard on bigger names like Mario or Zelda. Xenoblade Chronicles marked another enormous RPG for the platform that has become known as a destination for playing epics on the go. \n\nIn the realm of Nintendo's biggest franchises, this was a year of unusual entries. Mario + Rabbids: Sparks of Hope returned to the bizarre tactical game partnership between Nintendo and Ubisoft, to exceptional results. And Pokemon Legends: Arceus was a big departure from the usual Pokemon formula, helping to chart a new path forward that we saw partly iterated on in Pokemon Scarlet and Violet, which released later in the year. \n\nNintendo was not immune to delays, however, which pushed some games outside of the 2022 release window. The Legend of Zelda: Tears of the Kingdom--previously informally known as Breath of the Wild 2--was pushed to May 2023. And in an unpredictable turn of events, Nintendo made the last-minute decision to indefinitely delay the release of Advance Wars Reboot Camp in light of the ongoing war in Ukraine. Either or both of those games remain among our most anticipated, and could very well have landed on this list. \n\nDespite those hurdles, this was an incredibly strong year for the Nintendo Switch, with a wide array of games that will keep you playing docked and handheld well into the new year.\n\n#gamespot #gaming #nintendo", "link": "https://www.youtube.com/watch?v=5wKIT3DqpsI", "date_published": "2022-12-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite Adds New My Hero Academia Themed Mode | GameSpot News", "description": "My Hero comes to Fortnite, Horizon is getting a multiplayer games, and more Sega Genesis games come to Nintendo Switch.\n\n#Gaming #Fortnite #MyHeroAcademia\n\nTIMESTAMPS:\n00:00 - Fortnite x My Hero Academia\n01:12 - Horizon multiplayer game announced\n02:14 - New Sega Genesis games on Switch Online", "link": "https://www.youtube.com/watch?v=Wl5gs-O4Yao", "date_published": "2022-12-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite x My Hero Academia Bakugo Victory Royale Gameplay", "description": "Check out a match of Fortnite with the new Mythic Item, Deku's Smash. Check out the timestamps below for action points. Go beyond! Plus Ultra!\n\n#fortnite #myheroacademia #gaming \n\nTimestamps\n0:00 Intro \n0:46 First Fight\n2:28 Third Party\n3:13 Stealing a Deku's Smash\n5:28 All Might Supply Drop\n6:18 Deku's Smash Mythic Item\n10:13 Deku's Smash through a tree\n13:55 Final Fight with Deku's Smash", "link": "https://www.youtube.com/watch?v=0GsdBJf2wZw", "date_published": "2022-12-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite x My Hero Academia Official Trailer (Deku, Bakugo, All Might, Ochaco)", "description": "Four mighty Heroes from the world of My Hero Academia make their debut in Fortnite on December 16! \n\nIzuku Midoriya, Katsuki Bakugo, Ochaco Uraraka, and All Might from the world of My Hero Academia have landed in Fortnite along with smashing new gameplay, free rewards, a Hero Training Gym experience, and more.\n\n#fortnite #myheroacademia #gaming", "link": "https://www.youtube.com/watch?v=UthPi43DkjY", "date_published": "2022-12-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "High On Life Review", "description": "Squanch Games' trademark humor mixes with solid shooting and traversal in this goofy space romp.\n#GameSpot #HighOnLife\n\nHigh On Life tells the story of an unnamed protagonist--whom everyone calls \"Bounty Hunter,\" even their own sister--fighting against an alien drug cartel that's invaded Earth. The cartel wishes to round up every human on the planet and sell them as the drug, which other aliens can consume via elaborate machines. Our bounty hunter hero is armed with Gatlians, a race of talking guns, and each Gatlian possesses its own attacks and abilities. The concept is admittedly very weird, but it's a well-told story that kept me guessing until the end.\n\nAt this point, it bears acknowledging that this is 100% a Justin Roiland project, complete with all the hallmarks of his comedic philosophy. Rapid-fire monologues, fart jokes, demolition of the fourth wall, ad-libs, dark comedy--it's all intertwined within the game's narrative and presentation. If things like Rick and Morty, Trover Saves The Universe, or Solar Opposites aren't your cup of tea, this won't be either. That said, I have a very high tolerance for this sort of goofiness and I found myself laughing throughout the 10-hour adventure.", "link": "https://www.youtube.com/watch?v=VND8WpDHoEs", "date_published": "2022-12-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Valve Talks The Next Steam Deck | GameSpot News", "description": "Valve shares details on the future of the Steam Deck, Spider-Man 2 gets a smaller release window, and some new details on Starfield.\n\n#Gaming #SteamDeck #SpiderMan2 #Starfield\n\nTIMESTAMPS:\n00:00 - Steam Deck interview\n02:16 - Spider-Man 2 release window\n03:28 - Starfield factions details", "link": "https://www.youtube.com/watch?v=yYApxI4a5Bg", "date_published": "2022-12-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best Xbox Games Of 2022", "description": "Despite having very few first-party exclusives in 2022, Xbox still had a pretty strong year thanks to some excellent additions to Xbox Game Pass, which grew its catalog with dozens of fantastic games, some of which were third party hits that joined the service on day one. But beyond that there were also a few titles that excelled on Microsoft's home consoles. Here are the five best Xbox games of 2022, as selected by GameSpot, as well as five honorable mentions that you need to check out ASAP.", "link": "https://www.youtube.com/watch?v=xhqevBJhroQ", "date_published": "2022-12-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Diablo 4 Codex of Power, Collectors Edition, Dev Q&A Full Presentation", "description": "We have more invitingly dark details to share about Diablo IV, directly from our developers. Join game director Joe Shely and associate game director Joseph Piepiora on the official Diablo Twitch and YouTube channels as they dive into details around Diablo IV’s production and the new Codex of Power system in their first Developer Update livestream.\n\nGet more insight from the developers of the game and also some details from the questions and answers at the end.\n\nTimestamps\n0:00 Intro\n2:32 Deep Dive on latest Diablo 4 Updates\n5:30 Pre-order Bonus\n11:36 Collectors Edition Reveal\n21:21 Cinematic Trailer\n29:57 Codecs of Power\n37:30 Q&A", "link": "https://www.youtube.com/watch?v=-wsk3Z37USA", "date_published": "2022-12-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]