[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "FKJ: Tiny Desk (Home) Concert", "description": "Nisha Venkat | July 7, 2022\nWatching FKJ build a song is like watching him play a game of musical tetris. One second he's coaxing a rasping rhythm out of a drum set — the next, he's clambering over instruments to get to the mic before the beat kicks in.\n\nThe process might make you want to tape your eyes open. This is not Live Production 101, and FKJ (short for French Kiwi Juice, the stage name of Vincent Fenton) is not here to explain his genius. The French producer and multi-instrumentalist is perhaps best known for his assist on Masego's sultry, rollicking \"Tadow,\" but there's only remnants of that energy here. This is new jazz: a synthy spectacle that's a treat for the ears and the eyes.\n\nYou get the sense – and Fenton confirms it – that he could spend all day tinkering in his studio. There's an ease to his motions when he grabs his guitar adding wah-wah sounds to his bassline on \"IHM,\" and something very relatable about how even the cameraman struggles to keep up with his motions, sending Fenton in and out of focus.\n\nSometimes, he grimaces (with effort or with ecstasy, who knows) when he plucks a string just right. And you might be similarly moved. This has all the shivers of ASMR with all the emotive joy of a warehouse electronic fête. Maybe you'll even feel what I did when the music ended — a silence so large, so full, you'll want to tear down the screen and dance in the jungle with him.\n\nSET LIST\n\"New Life\" \n\"TUI\"\n\"Improvised Jam Sesh\"\n\"IHM\"\n\"Ylang Ylang\"\n\nMUSICIANS\nFKJ: vocals, electronics, guitar, keyboards\n\nCREDITS\nVideo: Terence Ver Angsioco\nAudio: FKJ \n\nTINY DESK TEAM\nProducer: Abby O'Neill \nVideo Editor: Joshua Bryant\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Michael Zamora, Maia Stern, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #FKJ #nprmusic", "link": "https://www.youtube.com/watch?v=PwV1-wZzT1Y", "date_published": "2022-07-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Maylee Todd: Tiny Desk (Home) Concert", "description": "Bob Boilen | July 6, 2022\nMaylee Todd’s (home) concert is filled with electronics, a window into a virtual world, and the first digital avatar to ever perform a Tiny Desk concert. Maylee introduces us to her avatar Maloo, and the songs presented here from Maylee Todd’s debut album Maloo are sung from the avatar's perspective.\n\nWritten during the pandemic, the album is about mental health and filled with multiple science fiction stories, including one about a programmable planet depicted in the “window’” above Maylee Todd’s head. \n\nThe electronic sounds that help tell these sci-fi tales include Maylee’s Tenori-on, a Yamaha instrument comprised of a panel of lights that, when touched, create patterns of sound. An iPhone pointing at Maylee’s face captures her reactions and expressions, which are then reflected in her avatar. Her musical partner Kyvita (Kyle Tan) accompanies her, adding textures from his synthesizers. \n\nIn the song “Dream With You” Maylee explains that as the avatar is living its life, it realizes, “my brain, it’s doing things that I don’t want it to do.”  Maylee Todd explains that Maloo, “wrote a song, a breakup song saying bye bye to certain aspects that aren’t serving it anymore.”\n\nBefore her final song “Absolute Time and Space,” Maylee Todd makes a passionate plea: “Hold the ones you love dear to your heart, will ya! Cause time is passing by — we do not have absolute time and space — as it turns out — in these bodies.”\n\nSET LIST\n“Infinite Program”\n“Grab Your Guts”\n“No Classification”\n“Dream With You”\n“Absolute Time and Space” \n\nMUSICIANS\nMaylee Todd: vocals, synths, iPhone face tracking\nKyvita: bass, keys\nMaloo (avatar): performance\n\nCREDITS\nDirector and Editor: Mason Rothschild\nMix and Master: Jake Viator\nEngineer: Chris Dwyer\nProduction Designer and AD: Leo Johnson\nDP: Elisha Jakob Maltinski\nCam Op: Petra Wurzinger\nCam Op: Roderick Hale, Ron Vasquez\nArt Director: Allison Jensen\nSet Dresser: B Armstrong\nGrip: Josh Brantner\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Editor: Kara Frame\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Joshua Bryant, Michael Zamora, Maia Stern, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #MayleeTodd #nprmusic", "link": "https://www.youtube.com/watch?v=QR7_RDHan3M", "date_published": "2022-07-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]