[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Pandemic failures", "description": "The Lancet Commission on lessons for the future from the \nCOVID-19 pandemic \n\n14th September 2022\n\nhttps://www.thelancet.com/journals/lancet/article/PIIS0140-6736(22)01585-9/fulltext\n\nhttps://covid19commission.org\n\nWHO response\n\nWHO acted too cautiously and too slowly\n\nSeveral important matters\n\nTo warn about human transmissibility of the virus\n\nTo declare a Public Health Emergency of International Concern\n\nTo support international travel protocols designed to slow the spread of the virus\n\n(This delay contributed to the spread of the virus and limited the possibilities for risk mitigation.)\n\nTo endorse the public use of face masks as protective gear\n\nTo recognise the airborne transmission of the virus.\n\n(These delayed and vague recommendations from WHO continued until late April, 2021.) \n\nJust 1 example, after receiving an open letter\n\nFrom 238 scientists in July, 2020,\n\nasking the organisation to address airborne transmission\n\nWHO did not change until April 30, 2021.\n\nMultiple failures of international cooperation\n\nToo many governments have failed to adhere to basic norms of institutional rationality and transparency, \n\nand the world's major powers have failed to collaborate to control the pandemic.\n\nSpecific points\n\nLack of timely notification of the initial outbreak of COVID-19\n\nCostly delays in acknowledging the crucial airborne exposure pathway of SARS-CoV-2, \n\nand in implementing appropriate measures at national and global levels to slow the spread of the virus.\n\nLack of coordination among countries regarding suppression strategies\n\nFailure of governments to examine evidence and adopt best practices for controlling the pandemic,\n\nand managing economic and social spillovers\n\nShortfall of global funding for low-income and middle-income countries (LMICs)\n\nFailure to ensure adequate global supplies and equitable distribution of key commodities,\n\nprotective gear, diagnostics, medicines, medical devices, and vaccines\n\nLack of timely, accurate, systematic data\n\nInfections, deaths, viral variants, health system responses, and indirect health consequences\n\nAgain the report raised lab leak possibility\n\nPoor enforcement of appropriate levels of biosafety regulations in the lead-up to the pandemic, \n\nraising the possibility of a laboratory-related outbreak\n\nFailure to combat systematic disinformation\n\nLack of global and national safety nets to protect populations experiencing vulnerability.\n\nAs of May 31, 2022\n\nThere were 6·9 million reported deaths and 17·2 million estimated deaths from COVID-19\n\nInstitute for Health Metrics and Evaluation\n\nhttps://covid19.healthdata.org/global?view=cumulative-deaths&tab=trend\n\nThis staggering death toll is both a profound tragedy and a massive global failure at multiple levels. \n\nSustainable development process\n\nSet back by several years, \n\nDeep underfinancing, Sustainable Development Goals and,\n\naims of the Paris Climate Agreement. \n\nPrevious publications\n\nLancet 2021\nhttps://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)02833-6/fulltext\n\nLancet Jan 2022\nhttps://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)02871-3/fulltext\n\nhttps://www.thelancet.com/journals/lancet/article/PIIS0140-6736(22)01585-9/fulltext", "link": "https://www.youtube.com/watch?v=9Ty50dhrmaI", "date_published": "2022-09-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Uganda community based health care", "description": "To donate to this community health project,\n\n(Just now our admin percentage is zero)\n\nBuy me a coffee https://www.buymeacoffee.com/awmedicalvideos\n\nPatreon\nhttps://www.patreon.com/awmedicalvideos\n\nTo contact Wefwafwa directly, wefandrew@gmail.com or \n\nWhatsApp+256756320736\n\nDirect link to video on Wefwafwa's channel, https://www.youtube.com/watch?v=6c8sU6C9oGQ", "link": "https://www.youtube.com/watch?v=YCfFLUTENp4", "date_published": "2022-09-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Lab viral origins report", "description": "The Lancet Commission on lessons for the future from the \nCOVID-19 pandemic, 14th September 2022\nhttps://www.thelancet.com/journals/lancet/article/PIIS0140-6736(22)01585-9/fulltext\n\nhttps://covid19commission.org\n\nViral origins\n\nThe proximal origin of SARS-CoV-2 remains unknown. \n\nThere are two leading hypotheses: \n\nthat the virus emerged as a zoonotic spillover from wildlife or a farm animal, \n\npossibly through a wet market, \n\nin a location that is still undetermined; \n\nor that the virus emerged from a research-related incident, \n\nduring the field collection of viruses,\n\nor through a laboratory-associated escape. \n\nNo independent, transparent, and science-based investigation has been carried out regarding the bioengineering of SARS-like viruses that was underway before the outbreak of COVID-19. \n\nThe laboratory notebooks, databases, email records, and samples of institutions involved in such research have not been made available to independent researchers. \n\nIndependent researchers have not yet investigated the US laboratories engaged in the laboratory manipulation of SARS-CoV-like viruses, \n\nnor have they investigated the details of the laboratory research that had been underway in Wuhan.\n\nUS National Institutes of Health (NIH) has resisted disclosing details of the research on SARS-CoV-related viruses that it had been supporting,\n\nproviding extensively redacted information only as required by Freedom of Information Act lawsuits.\n\nIn brief, there are many potential proximal origins of SARS-CoV-2, but there is still a shortfall of independent, scientific, and collaborative work on the issue. \n\nThe search for the origins of the virus requires unbiased, independent, transparent, and rigorous work by international teams in the fields of virology, epidemiology, bioinformatics, \n\nand other related fields, and supported by all governments.\n\nIn the absence of an unbiased, independent, and rigorous search for a natural origin by a multidisciplinary team of experts alongside an unbiased, independent, and rigorous investigation of the research-related hypotheses, \n\nthe public's trust in science will be imperilled, \n\nwith potentially grave long-term repercussions. \n\nIt is therefore crucial to investigate all hypotheses fully, \n\nnot only to ascertain the source of the pandemic and to protect against future emerging infectious diseases, \n\nbut also to ensure the integrity of science itself. \n\nThe perceived lack of transparency to date by leading scientific agencies and laboratories is troubling and needs to be addressed.\n\nStrategies to prevent research-related releases should include stronger international and national oversight of biosafety, \n\nbiosecurity, and biorisk management, \n\nincluding the strict regulation of gain of function research of concern.\n\nWhen investigating the origins of any novel pathogen, \n\npotential hypotheses should not be prematurely rejected to ensure that time-sensitive data—\n\nsuch as early case information and laboratory records—are collected.", "link": "https://www.youtube.com/watch?v=d0hpT00a8xg", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]