[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Belle and Sebastian: Tiny Desk Concert", "description": "Bob Boilen | July 8, 2022\nNow that we're back filming Tiny Desk concerts behind my desk at NPR, I get to witness that nervous energy surrounding most artists who are about to perform in an office, in daylight, with fans just a few feet away. This was surely true of the eight members of Belle and Sebastian when they kicked off their warmup with \"Unnecessary Drama.\" That's the title of a track from the band's fabulous new album A Bit of Previous and not my description of what was about to unfold. Though I can't deny the tension.\n\nYou see, we don't amplify the singer's voice in the room, and we don't use monitor speakers. It all adds to the intimacy of the performance, but it also made it hard for Stuart Murdoch to hear himself sing. In fact, he began to question whether having an ensemble of drums, keyboards, guitars, bass, etc. was right for the Tiny Desk and considered scrapping it all in favor of him and a guitar and maybe another player. But with a little work on the overall volume of the band, some run-throughs and the creature comfort of a handheld microphone, the band from Glasgow was charming and magnificent.\n\nBelle and Sebastian performed three songs from A Bit of Previous, its ninth album excluding two soundtracks. The band ended its delightful set with its classic tune \"Judy and the Dream of Horses\" from If You're Feeling Sinister, an album that's just celebrated its 25th anniversary. With questioning lyrics and youthful imagery, a guest trumpeter and a gallop in the rhythm, Belle and Sebastian gloriously made its dramatic mark at the Tiny Desk.\n\nSET LIST\n\"Unnecessary Drama\"\n\"Working Boy in New York City\"\n\"Reclaim the Night\"\n\"Judy and the Dream of Horses\"\n\nMUSICIANS\nStuart Murdoch: vocals, guitar \nStevie Jackson: guitar, harmonica, vocals \nBob Kildea: guitar, vocals \nRichard Colburn: drums \nSarah Martin: keys, flute, recorder\nChris Geddes: keys\nDave McGowan: bass, vocals\nSarah Wilson: keys, vocals\nJason Covey: trumpet\n\nTINY DESK TEAM\nProducer: Bob Boilen \nAudio Engineer: Josh Rogosin \nDirector: Michael Zamora \nSeries Producer: Bobby Carter \nEditor: Michael Zamora\nVideographers: Kara Frame, Joshua Bryant, Michael Zamora, Pierre Kattar, Alanté Serene \nProduction Assistants: Jill Britton, Joby Tanseco \nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer, Maia Stern \nVP, Visuals and Music: Keith Jenkins \nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #TinyDesk #BelleAndSebastian", "link": "https://www.youtube.com/watch?v=NWEqYj3OOoo", "date_published": "2022-07-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "FKJ: Tiny Desk (Home) Concert", "description": "Nisha Venkat | July 7, 2022\nWatching FKJ build a song is like watching him play a game of musical tetris. One second he's coaxing a rasping rhythm out of a drum set — the next, he's clambering over instruments to get to the mic before the beat kicks in.\n\nThe process might make you want to tape your eyes open. This is not Live Production 101, and FKJ (short for French Kiwi Juice, the stage name of Vincent Fenton) is not here to explain his genius. The French producer and multi-instrumentalist is perhaps best known for his assist on Masego's sultry, rollicking \"Tadow,\" but there's only remnants of that energy here. This is new jazz: a synthy spectacle that's a treat for the ears and the eyes.\n\nYou get the sense – and Fenton confirms it – that he could spend all day tinkering in his studio. There's an ease to his motions when he grabs his guitar adding wah-wah sounds to his bassline on \"IHM,\" and something very relatable about how even the cameraman struggles to keep up with his motions, sending Fenton in and out of focus.\n\nSometimes, he grimaces (with effort or with ecstasy, who knows) when he plucks a string just right. And you might be similarly moved. This has all the shivers of ASMR with all the emotive joy of a warehouse electronic fête. Maybe you'll even feel what I did when the music ended — a silence so large, so full, you'll want to tear down the screen and dance in the jungle with him.\n\nSET LIST\n\"New Life\" \n\"TUI\"\n\"Improvised Jam Sesh\"\n\"IHM\"\n\"Ylang Ylang\"\n\nMUSICIANS\nFKJ: vocals, electronics, guitar, keyboards\n\nCREDITS\nVideo: Terence Ver Angsioco\nAudio: FKJ \n\nTINY DESK TEAM\nProducer: Abby O'Neill \nVideo Editor: Joshua Bryant\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Michael Zamora, Maia Stern, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #FKJ #nprmusic", "link": "https://www.youtube.com/watch?v=PwV1-wZzT1Y", "date_published": "2022-07-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]