[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "Podcast Highlight Weak-ly News: Gavin Newsom Runs Ads In Florida and Tom Cruise Turns 60", "description": "The Babylon Bee's Adam Yenser gives you all the news you need to know from the week like Gavin Newsom’s anti-GOP ad running in Florida, Independence Day celebrations, and the blockbuster star of the summer turning 60 years old.\n\nCheck out the full podcast here: https://youtu.be/phUHPyRxVpM\n\nAlso, be sure to give Adam's Youtube channel a follow: https://www.youtube.com/user/adamyenser\n\nBecome a premium subscriber:  https://babylonbee.com/plans\n\nThe Official The Babylon Bee Store:  https://shop.babylonbee.com/\n\nFollow The Babylon Bee:\nWebsite: https://babylonbee.com/\nTwitter: https://twitter.com/thebabylonbee\nFacebook: https://www.facebook.com/TheBabylonBee\nInstagram: http://instagram.com/thebabylonbee", "link": "https://www.youtube.com/watch?v=JEtVcoLkoLU", "date_published": "2022-07-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "The Bee Weekly: Top Ten Comedy Shows and Bison Attack!", "description": "Kyle, Adam, and Emma from The Babylon Bee talk about what’s in the news this week. Hide yo kids and hide yo wife because the bison are attacking everybody up in here! Also, adoption is creepy now, TikTok banned The Babylon Bee, and it was revealed that Joe Biden financed Hunter’s trysts with Russian-linked escorts. They also do a rundown of their top ten comedy shows of all time and for some reason Kyle really really likes The Big Bang Theory. Really. Then, Emma, even though she isn’t a biologist, claims to be able to tell Kyle and Adam what a woman is.\n\nThis episode is brought to you by Better Help Counseling. Don’t struggle alone! Get help from counselors who share your faith by going to http://www.BetterHelp.com/BABYLONBEE/ \n\nAlso, make sure to get some food stuff to prepare for the economic times we seem to be living in. Check out My Patriot Supply at http://www.PrepareWithBee.Com \n\nWe got a lot of hate mail for our recent amazing and very informative video Frightening But 100% True Facts About Guns. In the full-length podcast available to Babylon Bee subscribers only, there are even more crazy hate mail, a classic article of the week, and a rundown of the top Subscriber Headlines of the Week!", "link": "https://www.youtube.com/watch?v=phUHPyRxVpM", "date_published": "2022-07-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "A Comprehensive List Of All The Countries Where Communism Has Worked", "description": "In a collaboration with The Babylon Bee, Professor Gorb McStevens lists all the countries where communism hasn't turned into a totalitarian hellscape where you have to eat your dog.\n\nBecome a premium subscriber:  https://babylonbee.com/plans\n\nThe Official The Babylon Bee Store:  https://shop.babylonbee.com/\n\nFollow The Babylon Bee:\nWebsite: https://babylonbee.com/\nTwitter: https://twitter.com/thebabylonbee\nFacebook: https://www.facebook.com/TheBabylonBee\nInstagram: http://instagram.com/thebabylonbee", "link": "https://www.youtube.com/watch?v=i8Nz8ytJCy8", "date_published": "2022-07-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]