[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "15 AWESOME KDE Apps: I was WRONG about KDE applications!", "description": "Use code LINUXEXPERIMENT to get 25% off your 2TB cloud storage plan on Internxt: https://internxt.com/pricing\n\nGrad a brand new laptop or desktop running Linux:https://www.tuxedocomputers.com/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMastodon: https://mastodon.social/web/@thelinuxEXP\n\nPixelfed: https://pixelfed.social/TLENick\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\nThis video is distributed under the Creative Commons Share Alike license.\n\n\n00:00 Intro\n00:45 Sponsor: Store your files securely and privately in the cloud with Internxt\n01:53 Productivity\n02:03 Kalendar: tasks and appointments\n03:08 Plan: Project management\n04:27 Calligra Suite: Office Suite\n05:38 Skrooge: Personal Budgeting\n06:43 Media Applications\n06:49 Kdenlive: Video Editing\n07:54 Krita: Digital Painting\n08:43 Kolourpaint: Paint, but for KDE\n09:22 Elisa: Local Music Player\n09:55 Kasts: Podcast Player\n10:48 Utilities\n10:54 KDE Connect: Device integration\n11:44 Subtitle Composer: create subtitles\n12:08 Yakuake: drop down terminal\n12:51 Sweeper: privacy and disk cleaner\n13:12 Krusader: Power File Management\n13:49 Falkon, KDE Itinerary, Marble, Artikulate, KAlgebra...\n14:49 Sponsor: Get a laptop or desktop that runs Linux 100% with Tuxedo\n15:55 If you have too much money...\n\nKalendar is an app to handle your calendars, but also your tasks. It integrates with your online accounts.\n\nPlan is a project management application, that lets you handle tasks and subtasks, but it goes a lot deeper.\n\nCalligra Suite is KDE's Office suite, great if you work on your own documents, and the ODF format.\n\nFor personal budgets, you have Skrooge.\n\nFor video editing, use Kdenlive. It's a full featured non linear video editor that lets you manage video and audio using tracks. It has tons of effects you can apply, transitions, and it can import and export to a TON of formats.\n\nFor artists, there is no better drawing tool on Linux than Krita. It's a digital painting appplication with tons of tools and brushes to let you create what you want. It's not only on Linux but also on Android, so you could even use it there, and it handles graphic tablets and their lovely styluses.\n\nIf, like me, you're no artist, but you still want a simple app to edit screenshots, or draw a few doodles here and there, Kolourpaint is going to be your go-to. It's basically MS Paint for KDE with anti aliasing, which of course you can disable if you like that pixel art look.\n\nIf you have a local music collection, and you're looking for a simple, but nice looking music player, then Elisa is the one for you.\n\nKasts is a small podcast app. You can add your own podcast feeds, or search for a specific podcast in the discover tab, and add it this way. You'll get a list of all episodes that you can then download and play.  \n\nKDE Connect it basically lets you integrate your Android phone, or iPhone, with your desktop. You can send files to and from each device, use the phone as a remote for audio or presentations, or as a trackpad, and more.\n\nSubtitle Composer lets you create subtitles for your videos, or for someone else's videos. You have tons of options to make them look like you want, open an existing file to modify it, select which language you're working on, and export your file.\n\nWith Yakuake, you just press F12, or any other key you prefer, and yo get a nice little terminal that drops down from the top of your screen.\n\nSweeper lets you clean a bunch of stuff that might take up space on your hard drive, like various caches, cookies, web history, recent documents, command history, and more.\n\nKrusader is a file manage that handles archives in the file manager, FTP, has multiple panels to open folders side by side, sync folders, compare file contents, it can batch rename and is completely customizable, on top of having a super powerful search module.", "link": "https://www.youtube.com/watch?v=hlDnOkZFN2g", "date_published": "2022-05-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]