[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "NIH, Wuhan were working on monkeypox", "description": "Wuhan Institute of Virology published on monkeypox research 3 months ago, NIH also have been researching monkeypox treatment\n\nhttps://reporter.nih.gov/search/sLt357_GeUyXtIUvUOY0MQ/project-details/10506292\n\nTotal funding, $9,824,009\n\nThe funding supports a clinical trial to identify effective treatments for monkeypox\n\nA re-emerging pathogen\n\nA disease of epidemic potential\n\nCauses significant morbidity and can result in death\n\nHuman cases have been increasing in sub-Saharan Africa since 2000\n\nSporadic outbreaks outside of Africa have occurred\n\nSimilarity between MPXV and the variola virus, \n\ncoupled with concerns about the potential of the variola virus as a potential bioterrorism agent, \n\nhave placed monkeypox treatments at the forefront of public health and scientific research agendas in many countries.\n\nArticle in Virologica Sinica?\n\nhttps://www.sciencedirect.com/science/article/pii/S1995820X22000414\n\nEfficient assembly of a large fragment of monkeypox virus genome as a qPCR template using dual-selection based transformation-associated recombination (Feb 2022)\n\nSince MPXV infection has never been associated with an outbreak in China, the viral genomic material required for qPCR detection is unavailable. \n\nUsing viral DNA recombinations\n\nTransformation-associated recombination (TAR),\n\nto assemble large DNA constructs\n\nA 55-kb genomic fragment of monkeypox virus in VL6-48B (yeast cells)\n\nWhat is Virologica Sinica?\n\nhttps://www.sciencedirect.com/journal/virologica-sinica/about/aims-and-scope\n\nVirologica Sinica, the official journal of Chinese Society for Microbiology, \n\nwill serve as a platform for the communication and exchange of academic information and ideas in an international context.\n\nDiscussion section\n\nHowever, this DNA assembly tool applied in virological research could also raise potential security concerns, \n\nespecially when the assembled product contains a full set of genetic material that can be recovered into a contagious pathogen. \n\nRecently, a group of scientists was funded by a biotech company to synthesize a full-length horsepox virus genome and recover it into an infectious virus (Noyce et al., 2018). \n\nNot surprisingly, such a controversial achievement has received enormous attention and raised global debate on its biosecurity implications (DiEuliis et al., 2017; Koblentz, 2017, 2018; DiEuliis and Gronvall, 2018). \n\nIn this study, although a full-length viral genome would be the ideal reference template for detecting MPXV by qPCR, we only sought to assemble a 55-kb viral fragment, less than one-third of the MPXV genome. \n\nThis assembly product is fail-safe by virtually eliminating any risk of recovering into an infectious virus while providing multiple qPCR targets for detecting MPXV or other Orthopoxviruses (Li et al., 2010).\n\n\nOur world in data monkeypox\n\nhttps://ourworldindata.org/explorers/monkeypox\n\nSpain and Belgium ‘gay events’\n\nUK\n\nCases, + 11 = 190\n\n20,000 doses of a smallpox vaccine\n\noffered to close contacts of those diagnosed with monkeypox\n\nreduce the risk of symptomatic infection and severe illness\n\nDr Rosamund Lewis, WHO\n\nIt's very important to describe this because it appears to be an increase in a mode of transmission that may have been under-recognised in the past\n\nunfortunate if monkeypox exploit the immunity gap left by smallpox 40 years ago\n\nthere is still a window to close the outbreak", "link": "https://www.youtube.com/watch?v=4E6cD-VWhQY", "date_published": "2022-05-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]