[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "EVERY LINUX DISTRO should have THESE FEATURES!", "description": "Get 100$ credit for your own Linux and gaming server: https://www.linode.com/linuxexperiment \nGrab a brand new laptop or desktop running Linux:https://www.tuxedocomputers.com/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to a weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYouTube: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n📹 MORE VIDEOS FROM ME\nLinux news in Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\nGaming on Linux: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nI'm also on ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n🏆 FOLLOW ME ELSEWHERE:\nTwitter : http://twitter.com/thelinuxEXP\nMastodon: https://mastodon.social/web/@thelinuxEXP\nPixelfed: https://pixelfed.social/TLENick\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\nThis video is distributed under the Creative Commons Share Alike license.\n\n#linux #appstore #distro  \n\n00:00 Intro\n00:44 Sponsor: 100$ free credit for your Linux or Gaming server\n01:43 Multi-desktop installers\n03:14 Recovery partition\n04:34 Restore and sync installed applications\n07:02 Privacy tools and dashboard\n08:37 Update notes framework\n10:13 Graphical error messages\n11:18 Improved graphical app stores\n15:40 Sponsor: Get a device designed to run Linux\n16:53 Support the channel\n\nInstead of asking the user to do research themselves, why not simply have a single installer with all desktops? \nCouple it with a choice screen at install that lets you see a video of how the desktop environment works: you have a video for Kubuntu, a video for Ubuntu, and each demoes how the desktop works!\n\nA restore partition is basically just an ISO of your base system, that you store on a dedicated partition and that you can boot to using GRUB. It occupies almost no space, you can make it optional at install for people who don't want it, and when something goes wrong, having the ability to immediately reboot on that partition and refresh your system is crucial.\n\n\nWith user accounts, we would be able to restore your downloads when you reinstall. This account or system would probably have to be tied to flathub, or be divided into various repos or distros so that it could remember what you've downloaded from each source: flathub, the ubuntu repos, the AUR, fedora's repos, the snap store, whatever.\n\n\nPrivacy might not be the number one reason to use Linux, but it's still an important one. We could take inspiration from what /e/ has been doing: we could have a system wide tracker blocker for all tracking requests for all apps on our system, whether it's a web browser, or a proprietary app we installed and that makes weird requests to a server.\n\nThis privacy center could also serve as a hub for VPNs you might want to use, or it could have its own auto-VPN feature, which just scrambles your geolocation, fake an IP address.\n\n\nAnother thing would be some kind of framework that apps and desktop environments can decide to use, to display release notes, or an inline webview, or a video, or a combination of all 3, after an update.\n\nHave you ever run a program graphically and seen it start and crash, or just not start at all? If so, have you tried running it with the command line? You probably noticed an error displayed there.\nI wish we could have these errors appearing graphically as well when a program doesn't start.\n\nThen, I'd like to see application bundles. As in one click installs for a series of applications that users might find useful. \n\nAnother improvement is putting the most downloaded applications FIRST in their categories in app stires.\n\nAnother small improvement that I've already talked about in another video is marking official apps as official. The Ubuntu Snap Store already does this, and I think Flathub also should have that, although I think they're working on it.\n\nApp stores should also be way more explicit about the package types they offer. If you have a combobox that lets users pick between a deb package, a flatpak, or a snap, you NEED to explain, what these are.\n\nYet another improvement, would be automated assistants that offer you applications related to what you're doing. Connect a new mouse? Offer a graphical utility to configure it. Connect a new printer? Check if it needs something special to work.", "link": "https://www.youtube.com/watch?v=Ju1GV71wQ-c", "date_published": "2022-09-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]