[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Angélique Kidjo: Tiny Desk Concert", "description": "Bob Boilen | September 12, 2022\n\nToday we celebrate the 1,000th concert the Tiny Desk team has captured and published, and I can't imagine a more inspiring spirit to help us celebrate than Angélique Kidjo. Originally from the West African country of Benin, the singer and activist plays a crucial role in spreading the music of Africa and the spirit of love in all that she does.\n\nWhen I started the Tiny Desk series in April 2008, I never imagined its impact. So many artists' voices have been raised and shared with music fans worldwide through these performances. When Angélique was preparing for her Tiny Desk concert, she thought it would be a good idea to watch some past concerts for inspiration. It's then she saw Sampa The Great's home concert from Zambia and immediately reached out in hopes of collaborating. Now here they are, at NPR, brought together by a series that has been blessed with so much talent and a global audience with big ears and open arms.\n\nAngélique Kidjo's band drives the energy and melody as they perform songs from her 2021 album Mother Nature and then dig back a decade to perform the song \"Afirika,\" encouraging strength for the African people. The celebration concludes as Angélique Kidjo pays tribute to her friend and mentor Miriam Makeba by performing her 1967 global hit, \"Pata Pata.\" It was a lovely way to shine a light on how we can impact each other's lives through music.\n\nSET LIST\n\"Mother Nature\"\n\"Free & Equal\" (feat. Sampa The Great)\n\"Afirika\"\n\"Pata Pata\"\n\nMUSICIANS\nAngélique Kidjo: vocals\nSampa The Great: vocals\nCassondra James Kellam: vocals\nStephanie Fisher Alvarenga: vocals\nDominic James: guitar, vocals\nMichael Olatuja: bass, vocals \nEtienne Stadwijk: keyboard \nEdgardo \"Yayo\" Serka: drums\nMagatte Sow: percussion\n\nTINY DESK TEAM\nProducer/Series Creator: Bob Boilen \nAudio Engineer: Josh Rogosin \nDirector/Editor: Kara Frame \nSeries Producer: Bobby Carter \nVideographers: Kara Frame, Michael Zamora, Pierre Kattar, Alanté Serene\nAudio Assistant: Natasha Branch \nProduction Assistants: Jill Britton, Joby Tanseco\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk  #nprmusic #angeliquekidjo", "link": "https://www.youtube.com/watch?v=7rzGNL28Js0", "date_published": "2022-09-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]