[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best Nintendo Direct Mini Trailers (June 2022)", "description": "Nintendo's Mini Direct Partner Showcase for June 2022 has wrapped up, and in this video we're taking a look at the best trailers. \n#Gaming #Nintendo #BestTrailers\n\nTimestamps: \n00:00 - Monster Hunter Rise: Sunbreak\n03:26 - Nier: Automata - The end of Yorha Edition\n04:44 - Mario + Rabbids: Sparks of Hope\n07:29 - Sonic Frontiers\n08:40 - Persona 5 Royal, Persona 4 Golden & Persona 3 Portable", "link": "https://www.youtube.com/watch?v=o0ui5PXPOAM", "date_published": "2022-06-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Every DNF Duel Awakening Finisher Gameplay", "description": "Check out every DNF Duel Awakening from the game. \n\nWatch all 16 classes including: the Launcher, Swift Master, Enchantress, Ghostblade, Hitman, Ranger, Berserker, Vanguard, Trouble Shooter, Dragon Knight, Kunoichi, Inquisitor, Striker, Grappler, Crusader, and Lost Warrior.\n\nDNF Duel brings the iconic classes from the classic Dungeon and Fighter RPG into the fighting game world. Take your favorite class from Dungeon Fighter and try your hand at this brand new fighting game from the makers of Guilty Gear and Blazblue, Arc System Works. DNF Duel arrives on June 28th, 2022 on PlayStation 4, PlayStation 5 and PC.\n\nTimestamps\n0:00 Intro\n0:01 Launcher\n0:10 Swift Master\n0:22 Enchantress\n0:34 Ghostblade\n0:46 Hitman\n0:56 Ranger\n1:08 Berserker\n1:18 Vanguard\n1:27 Trouble Shooter\n1:37 Dragon Knight\n1:49 Kunoichi\n2:01 Inquisitor\n2:14 Striker\n2:24 Grappler\n2:34 Crusader\n2:45 Lost Warrior\n\n#dnfduel #gaming", "link": "https://www.youtube.com/watch?v=Z05YXt9OT2U", "date_published": "2022-06-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Gotham Knights Official Robin Gameplay Trailer", "description": "Learn more about Robin in this latest character trailer for Gotham Knights which is coming out in October 2022. \n\nGotham Knights showcases the Batman Family as you step into the roles of Batgirl, Nightwing, Red Hood and Robin, the new protectors of Gotham City in the wake of Batman’s death. From solving mysteries that connect the darkest chapters in the city’s history to taking on notorious villains, you will confront an array of challenges. \n\n#gothamknights #gaming", "link": "https://www.youtube.com/watch?v=qomsscpcbO4", "date_published": "2022-06-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mario + Rabbids Sparks of Hope Gameplay Breakdown Trailer", "description": "Mario and the Rabbids reunite to save the cosmos from otherworldly attack, when Mario + Rabbids Sparks of Hope rockets your way on October 20th!\n\nThis trailer was shown off during the Nintendo Direct Mini. For more information on the game watch the Mario and Rabbids Sparks of Hope showcase on June 29th, at 9am PDT.\n\n#mariorabbidssparksofhope #gaming", "link": "https://www.youtube.com/watch?v=9RVciDoh1xE", "date_published": "2022-06-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Nintendo Direct Confirmed & Metroid Prime Remastered May Be Coming Soon | GameSpot News", "description": "Nintendo is having a last minute, mini Direct before the end of June, Metroid Prime Remastered may be coming to the Switch this Holiday, PlayStation Plus games for July leak, and Hideo Kojima scrapped a The Boys-like project.\n\nA new Nintendo Direct is imminent, and Metroid Prime might be coming to Switch this year? All this andmore on today’s GameSpot News.\n\nFor the past few weeks, a Nintendo Direct (*Xenoblade Direct footage on screen* No, not that one) has been rumored to be in the works before the end of June. In the eleventh hour, Nintendo confirmed that a Direct is indeed happening *cheering sound effect* buuuuutttttt *record scratch sound effect ends cheering* that it’s going to be one of its mini presentations exclusively dealing with third party titles. So expect to see some news on titles like Mario + Rabbids: Sparks of Hope rather than the sequel to Breath of the Wild.\n\nJeff Grubb of GameSpot’s sister site GiantBomb has stated that he has heard Nintendo plans to spread out its Not-E3 presentations over the course of the summer, so even if this Direct doesn’t speak to you, you might not have to wait much longer for one that does.\n\nSpeaking of Jeff Grubb and waiting, this year is the 20th anniversary of the beloved Metroid Prime, and it seems that Nintendo might finally be ready to put out a remaster of this classic in time for that celebration. Grubb reports that he has been told “pretty definitively” that the remaster will be one of Nintendo’s big holiday 2022 releases. Grubb also notes that rather than a package of the entire trilogy, this release will only be a remaster of the first Metroid Prime, and while there are plans to eventually rerelease two and three, those titles might not get the same level of overhaul.\nBut leaks don’t stop there! Also potentially revealed are July’s PlayStation Plus titles. Via Dealabs, it seems subscribers to the service, on every tier, will be able to get Crash Bandicoot 4: It’s About Time, The Dark Pictures: Man of Medan, and Arcadegeddon when the monthly games refresh on July 5. \n\nNot only is the recently released fourth Crash Bandicoot a great get on its own, but the remastered N. Sane trilogy of the first three games is already available via the PlayStation Plus Collection, so players can complete the entire Bandicoot saga. For those that have checked out Supermassive’s latest horror game The Quarry, and are itching for more, Man of Medan is the first release in the developer’s Dark Picture Anthology series, featuring similar mechanics and spooky delights. The final title, Arcadegeddon, released in early access last summer, and is a multiplayer shooter set in an arcade game with both PvP and PvE elements. While it has flown relatively under the radar since launching, its inclusion in next month’s PS Plus lineup is sure to give it a shot in the arm.\n\nOf course, with new PS Plus games incoming means old PS Plus Games outgoing, so these are the last few days you have to claim 2018’s God of War, Nintendo All-Star Brawl and Norotu to Boruto: Shinobi Strikers before they’re gone.\n\nSomething else that’s gone is a potential Hideo Kojima superhero project. In a tweet thread, the iconic developer mentions how he shelved plans for a “radical hard-boiled action film” that pit a special detective squad against superheroes after the release of Amazon Prime’s The Boys, a TV show with a similar scope. Kojima states that he pictured one of the actors in his latest game Death Stranding, Mads Mikkelsen, in the lead role.\n\nKojima, if you’re watching this, I’m begging you: please bring this project back to life.\n\nWhile you at home too mourn the loss of a hard-boiled detective story helmed by Hideo Kojima, distract yourself with the Overwatch 2 open beta starting on June 28th, now on both PC and console. If that’s not your bag, on the same day, Jane Foster AKA the Mighty Thor will become a playable hero in Marvel’s Avengers with her own unique moves and battle pass separate from the original God of Thunder.", "link": "https://www.youtube.com/watch?v=Hw0v5Q4HUfE", "date_published": "2022-06-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Nintendo Direct Mini Partner Showcase Full Presentation (June 2022)", "description": "Watch the latest edition of Nintendo Direct Mini: Partner Showcase, with information on upcoming Nintendo Switch titles exclusively from our publishing partners.\n\n#gaming #nintendodirectmini \n\nTimestamps\n0:00 Introduction\n0:05 Monster Hunter Rise: Sunbreak\n4:08 NieR: Automata The End of Yorha Edition\n5:37 Lorelei and The Laser Eyes\n6:33 Super Bomberman R 2\n7:05 Mega Man Battle Network Legacy Collection\n7:42 PAC-MAN World Re-PAC\n8:19 Blanc \n9:22 Return to Monkey Island\n11:10 Mario + Rabbid Sparks of Hope\n14:05 Something for Everyone Game Showcase\n15:50 Sonic Frontiers\n17:13 Disney Dreamlight Valley\n18:13 Live A Live\n18:50 Doraemon Story of Seasons: Friends of Great Kingdom\n19:22 Minecraft Legends\n19:53 Dragon Quest Treasures\n21:49 Portal Companion Collection\n22:30 HARVESTELLA\n24:00 Persona Collection", "link": "https://www.youtube.com/watch?v=PZKufzKkFOc", "date_published": "2022-06-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Steam Deck Might Finally Be Getting Easier To Buy | GameSpot News", "description": "Valve is doubling the amount of Steam Decks it's shipping, a bunch of announcements from the latest Nintendo Direct, and Fallout 4 is getting a London makeover.\n\nPraise Gabe! The Steam Deck is about to get a lot easier to buy. Plus, you can play a bunch of new, old games on the Nintendo Switch. This and more on today’s GameSpot News.\n\nWith the end of June approaching, and the arrival of Q3, Steam put out a statement that is going to make a lot of gamers happy. For anyone that has a Steam Deck reserved with a Q3 fulfillment period listed, the first batch of emails for that group will be going out on June 30, before the next quarter has officially even started!\n\nWhat’s more, the company also confirms that they’re increasing production, and will be shipping more than double the amount of Decks it was previously. That means, if you’re in that Q3 bracket, you’re more than twice as likely to receive an email, than say, I was when I had my Q2 order.\n\nI would say I was jealous, but what do I have to be jealous about? I have my Steam Deck already.\n\nTo prepare for your handheld’s arrival, remember that Steam’s Summer Sale is happening until July 7, so make sure to check it out for any games you plan to play on Deck, as well as GameSpot.com for the best deals you can find.\n\nMoving from the portable PC to its distant cousin, the Switch, Nintendo today had a Direct mini, unveiling a slew of games releasing in the coming months. Many of those announced are older titles that are finally making their way to the handheld, such as Portal 1 and 2 as a part of the Companion Collection, out today on Switch, as well as Persona 3 - 5, previously announced for Xbox Game Pass and Steam, with the most recent entry landing on October 21.\n\nTIME STAMPS:\n00:14 - Valve doubling Steam Deck shipments\n01:21 - Nintendo Direct Announcements\n02:37 - Fallout London mod coming 2023", "link": "https://www.youtube.com/watch?v=w-koHHCwbew", "date_published": "2022-06-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Claudio Sanchez Reacts To Music Of DOOM, Metal Hellsinger, Red Dead Redemption And More", "description": "Claudio Sanchez is a singer, songwriter and guitarist for Coheed and Cambria. Today while celebrating the release of their new album Vaxis II, Claudio is checking out some of the music from DOOM 2016, Red Dead Redemption, Metal: Hellsinger, Rock Band and Wolfenstein: The New Order.\n\nBe sure to check out their new album as well as their tour dates here:\nhttps://www.coheedandcambria.com/\n\nGames Featured:\n\nIntro 00:00\nDoom 2016 00:31\nMetal: Hellsinger 02:07\nRock Band 04:29\nWolfenstein: The New Order 06:44\nRed Dead Redemption 08:30", "link": "https://www.youtube.com/watch?v=UGhiJVAsb-k", "date_published": "2022-06-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]