[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Valve says THIS performs like the Steam Deck, let's benchmark!", "description": "Install the Startpage Privacy protection extension for free: https://add.startpage.com/en/protection/?campaign=4&source=aff\n\nGet your MinisForum UM 700: https://bit.ly/3HccRbG\n\nValve developer documentation recommending this PC: https://partner.steamgames.com/doc/steamdeck/testing\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:31 Sponsor: Stay safe and private wit this free extension\n01:38 MinisForum UM700\n04:04 Included Software\n05:16 Benchmarks\n05:35 Portal 2\n06:13 Hades\n06:35 Resident Evil 2\n07:36 Shadow of the Tomb Raider\n08:07 Deep Rock Galactic\n08:45 Cyberpunk 2077\n09:18 Conclusion: can the Steam Deck perform?\n\nThis is the MINISFORUM DeskMini UM700. It's a mini PC that's currently sold for less than 500$ US.\n\nIt uses a Ryzen 7 3750H , 4 Cores/8 Threads, with a Base Clock of 2.3 GHz , up to 4.0 GHz.. It's paired with a Radeon RX Vega 10 graphics chip.\n\nValve says that this little PC is weaker in the GPU department than the deck, but its CPU is slightly more powerful. This results in a device that's just under the Steam Deck in terms of performance, which also means that it's the perfect testbench for developers.\n\nMy test unit has 16GB of RAM, and a 500GB SSD, but it's easy to upgrade that yourself.\n\nIn terms of I/O, it's a real PC, so you have 1 ethernet jack, a USB 3.0 port, 3 USB 3.1, 1 USB C, 1 HDMI, one Displayport, and an audio jack.\n\nSince this is an unofficial testbench, even though Valve clearly recommends it, it doesn't run any pre-release version of Steam OS 3.\n\nInstead, it runs Manjaro KDE, slightly tweaked. It has a little bit of MiniS Forum branding on the wallpaper and the main menu button of KDE, and it embarks CrossOver as well as Steam preinstalled. It even lets you boot directly into a Steam session, which will basically be your Steam big picture mode, out of the box, but you're going to have to login to your steam account first, of course.\n\nLet's begin with Portal 2, one of the games Valve authorized reviewers to give performance numbers for.\n\nAt 720p, at maximum settings, it got 60 FPS, super smooth, no hiccups, it just ran like a dream. \nIt ran super smoothly, no dropped frames, no problems at all, really.\n\nRunning the game at 1080p netted some almost perfect results as well, with the max settings getting 60 FPS as well, although there were a few dips to 55 and 56 FPS when there were lots of physics objects moving around. When using portals, there also were some significant dips to the 40s, but the game felt really playable.\n\nMoving on to Hades, which is the game I'm probably going to play the most once I get my own Steam Deck. At 720p, it got 60 FPS, running through Proton. At 1080p, It also got 60 FPS without a hitch.\n\nI then tried something more demanding: Resident Evil 2. At 720p, at low settings, I could get a very stable 30 FPS, and the game generally ran at around 40. At 1080P low settings, the game was completely unplayable.\n\nWith FSR enabled at 1080p, on low settings, the stutters were gone, and the framerate was more around 25 to 28FPS.\n\nLowering the game down to 720p, but ramping up the settings to medium, with FSR enabled, the game reached 30 to 40 FPS, very rarely lowering down to less than 30.\n\nI also ran the Shadow of the Tomb raider benchmark. At 720p, at mid settings, it only managed 20 to 22 FPS.\nAt low settings and 720p, the benchmark managed to stay at around 30FPS, with occasional dips down to 22.\n\nI also got a look at Deep Rock Galactic. At 720P, mid settings, it hovered around 60FPS, with occasional dips to the 50s. At 1080P mid settings, without FSR, it could manage 30FPS, sometimes going up to 40 or 45.\n\nCyberpunk 2077: At 720p, it only gets around 20 FPS at the lowest settings with FSR enabled in the game's settings. If I try to push it to 1080p, even with FSR, it can barely manage 10 to 15 FPS.", "link": "https://www.youtube.com/watch?v=LJJTBzPpaS8", "date_published": "2022-02-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]