[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Breaks Down Iconic Star Wars Weapons - Loadout Extended Chat", "description": "From Han Solo’s DL-44 pistol to the Stormtrooper’s E-11 Blaster, the Star Wars universe is full of iconic firearms. In this extended chat from our previous Star Wars episode, Keeper of Firearms & Artillery Jonathan Ferguson breaks down some of the franchise’s iconic weapons and details the behind the scenes stories that led to their creations. (Presented by PUBG MOBILE)\n\n00:00 - Opening\n00:55 - Han Solo’s DL-44 Pistol\n03:41 - Boba Fett’s EE-3 Carbine Rifle\n04:54 - The E-11 Blaster Rifle\n\nIn this episode of Loadout, Dave Jewitt visits the Royal Armouries to talk to Keeper of Firearms & Artillery Jonathan Ferguson about the real world weapons that made up some of Star Wars iconic arsenal.\n\nYou can check out more episodes of Loadout right here. - https://www.youtube.com/watch?v=yzSrmGkpWKk&list=PLpg6WLs8kxGMzIemU1gyyLmg5VlKI2UvC\n\nYou can check out our Firearms Expert Reacts series here. - https://www.youtube.com/watch?v=5FVzcoRjoN4&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/", "link": "https://www.youtube.com/watch?v=gzqoNtVOB8o", "date_published": "2022-02-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Horizon Zero Dawn Full Story Recap", "description": "The story of the Horizon franchise is A LOT. There’s dense lore, a multitude of important characters, and plenty of earth-shattering revelations. And while the franchise is only really just getting started, we’ve had more than enough happen across a single game and its DLC expansion to warrant a story refresher. So whether you played Horizon Zero Dawn on release in 2017 or you’re just jumping in for Horizon Forbidden West, let’s break down the story so far.\n\nThe Horizon franchise plays out its grand narrative of tribal politics and robot dino-animal-things in the 31st century in the wake of a cataclysmic robot-apocalypse that has wiped out the majority of humanity. Those that have survived have formed tribes, and are living their lives largely devoid of the technological advancements of their predecessors, who are widely known as the ‘Old Ones’. \n\nHorizon Zero Dawn features four of these tribes: The Nora - deeply religious warrior-hunters from the south, who worship at the altar of ‘All-Mother’ - a mystical mountain; the Carja, who reside in the bustling cities of the central deserts and revere the Sun God; the Oseram - a tribe of practically-minded forgemen and women; and the Banuk, who are a mountain-dwelling tribe of hunters and shaman. The tribes aren’t exactly all on friendly terms either - with the Carja being notorious for raiding their rivals under the leadership of the Mad Sun King, Jiran.\n\nScattered across the stunning post-apocalyptic landscapes are animal and dinosaur-like robots known as ‘machines’, who for the most part peacefully coexist with the tribes. However, as the years pass by, the machines have become increasingly more violent towards humanity as part of a phenomenon known as the ‘Derangement’. So begins Horizon: Zero Dawn. \n\nHorizon Font: https://www.fontspace.com/horizon-font-f26000", "link": "https://www.youtube.com/watch?v=Nopfzl_oIdw", "date_published": "2022-02-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dying Light 2 Best Bugs And Glitches", "description": "Bugs and glitches in games can be annoying, but they can also be hilarious. In this video, we've collected some of the best glitches from Dying Light 2: Stay Human.\n\n#DyingLight2", "link": "https://www.youtube.com/watch?v=RLnpyCBCVsM", "date_published": "2022-02-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To EVEN MORE Battlefield 4 Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Battlefield 4, including the AN94 assault rifle, the Swedish AK 5C, and the PKP Pecheneg.\n\n00:00 - Opening\n00:59 - L115 Long Range Rifle\n03:11 - PP-2000 Submachine Gun\n04:42 - IWI ACE 23 Assault Rifle\n06:29 - AK 5C Assault Rifle\n08:37 - AN-94 Assault Rifle\n11:20 - OTs-14 Groza Bullpup Assault Rifle\n12:49 - PKP Pecheneg Machine Gun\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down more of the guns from Battlefield 4 and compares them to their real-life counterparts.\n\nFirearms Expert Reacts To Battlefield 4’s Guns - https://www.youtube.com/watch?v=aIN7OP63lvs\n\nFirearms Expert Reacts To MORE Battlefield 4 Guns - https://www.youtube.com/watch?v=OolGxrGNXKY\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=lfqoA3WHDNI", "date_published": "2022-02-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "I Played Dark Souls for the First Time In 2022", "description": "If there’s one game series that sets a fire in the hearts of gamers, it’s Dark Souls. The franchise has become synonymous with intense difficulty, it’s lack of desire to be inviting to new players, and it’s polarized reception by gamers. So, to prove her skill in time for Elden Ring, producer Jessie Earl dove headfirst into the world of Lordran for the first time ever... and oh boy was she in for an emotional experience.\n\n0:00 - Prepping My Soul\n2:16 - Day 1\n8:36 - Day 2\n14:31 - Day 3 & 4 (AKA The Days That Broke Me)\n19:48 - Day 5\n24:29 - The Final Boss (or The Redemption of Kurt)\n27:50 - Outro\n\n#DarkSouls #FromSoftware", "link": "https://www.youtube.com/watch?v=ifqh1jJLnUA", "date_published": "2022-02-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]