[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "KDE Plasma 5.25: Colorful, touch friendly, now with floating panels!", "description": "Try OnlyOffice, the best open source office suite for Linux: https://www.onlyoffice.com/desktop.aspx\nGrab a brand new laptop or desktop running Linux:https://www.tuxedocomputers.com/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMastodon: https://mastodon.social/web/@thelinuxEXP\n\nPixelfed: https://pixelfed.social/TLENick\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\nThis video is distributed under the Creative Commons Share Alike license.\n\n00:00 Intro\n00:44 Sponsor: OnlyOffice, the free, compatible and open source office suite\n01:39 Customization and Appearance\n05:36 Plasma Desktop\n10:02 Application Updates\n12:15 KDE Release Model\n13:37 Sponsor: Get a laptop or desktop that runs Linux out of the box\n14:41 Support the channel\n\nWe already had accent colors in the Appearance settings, but these now go a bit further. First, you can pick an accent color from your wallpaper, You can also opt into the breeze classic theme, which will apply the accent color to the window title bars as well. You can choose to tint all colors using your accent color, so you get the same hue everywhere.\n\nThe second big change is the floating panels. Panels on KDE used to be stuck against a screen edge, but no longer! You can now make them float above the screen edge they sit on, in the \"More options\" button when editing the plasma panel.\n\nWhen applying a global theme, you now get to pick which parts you want to change: you don't have to apply the theme in bulk.\n\nAnother good thing for people who like having more consistency, is the integration of GNOME applications: headerbars will have a border radius more consistent with the Breeze look and feel, and the menus look a bit more native as well.\n\nFirst, if you're using a laptop that supports power profiles, you'll get a better looking pop-up in the system tray, with icons to reflect each profile.\n\nThe user switcher applet also has a nicer look, with a picture of the currently logged in user, and the pop-up when clicking that applet now looks nicer as well, with more spacing.\n\nThe pop-up menu for copying the date to the clipboard, in various formats has also been revamped to be more legible.\n\nFirst is touch mode. KDE Plasma has a tablet mode that was toggled automatically when the system detected that you were using a touchscreen only. Now, you can decide to toggle it on and off yourself \n\nStill on that note, you now get the ability to do gestures from the screen's edge, basically like hot corners.\n\nSwiping 4 fingers down on the touchpad will open the Overview, with your open windows, virtual desktops, and a search bar, that was the big new feature for plasma 5.24. Swiping 4 fingers up will bring an overview of all your virtual desktops, basically the desktop grid, and swiping 4 fingers left or right will move to the next or previous workspace.\n\nOther small changes include the ability to select a non native resolution for your display on Wayland , you can now see the frequency your wifi network uses if your network uses both 2.4 and 5Ghz, and the Krunner spell checker action now detects the language you're using and tells you if the spelling is correct.\n\nDiscover now can display the permissions that flatpak apps use. The App Page also has been overhauled, with instant access to the license of an app, the size on disk, or the version, and it can now tell you when an app has been uninstalled but still has some data on disk.\n\nThe sidebar will also show all subcategories that were previously located in the Applications submenu, so space is better used, and you're not wasting clicks.\n\nFinally, proprietary apps will now have a warning you can display by clicking a small icon next to the license name, to warn you that this app might do weird things, or collect data.", "link": "https://www.youtube.com/watch?v=8yeruvis8I0", "date_published": "2022-06-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]