[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Confronting ISIS (full documentary) | FRONTLINE", "description": "In this 2016 documentary, FRONTLINE investigates the successes, failures and challenges in the U.S.-led effort to degrade and destroy ISIS. (Aired 2016)\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nIn “Confronting ISIS,” veteran FRONTLINE correspondent Martin Smith (“The Crown Prince of Saudi Arabia” “Bitter Rivals: Iran and Saudi Arabia”) traveled to five countries with key roles in the anti-ISIS fight — Saudi Arabia, Iraq, Syria, Jordan and Turkey — to report on successes, failures and challenges as ISIS lost ground in the region but conducted attacks abroad. Beginning with the fall of Mosul to ISIS in 2014, this two-hour special deeply examines two years of American-led efforts to defeat ISIS, taking viewers step-by-step through a number of initiatives involving different regional players.\n\nLove FRONTLINE? Find us on the PBS Video App, where there are more than 300 FRONTLINE documentaries available to watch any time: https://to.pbs.org/FLVideoApp​ \n\n#Documentary #ISIS\n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=Tnsa_rII7NM", "date_published": "2022-02-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]