[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War Ragnarok Director Breaks Down Biggest Moments", "description": "Listen to the full uncut interview on the GameSpot After Dark podcast\nApple Podcasts: https://podcasts.apple.com/us/podcast/gamespot-after-dark/id1476085691\nSpotify: https://open.spotify.com/show/5qmuPYfpj7R7yHXEtKBocG\n\nThis video contains heavy spoilers for God of War Ragnarok. \n\nGod of War Ragnarok had a daunting task ahead of it: not only did it have to wrap up a sprawling tale of fate, prophecy, and parenthood in a neat bow, but do it all under the looming presence of the end of the world, at least, in Norse mythology. But succeed it did, with many fans and critics (including GameSpot's own Tamoor Hussain, who awarded the game a 9/10) praising the ending, and the path Kratos and Atreus took to get there.\n\nGod of War Ragnarok's director, Eric Williams, joins Tamoor Hussain and Lucy James to discuss the game's ending at length, and we're not kidding when we tell you that this video contains spoilers. We discuss Tyr's important role in the game, Odin's plans and his relationship with his family, and that all important ending: Ragnarok itself. \n\nWe touch upon many other topics, including the death of a beloved character, Freya's role in the whole saga, and the ups and downs of parenthood. \n\nFor more God of War Ragnarok, make sure to check out some of our other videos, including our review, best tips, and more.\n\n#godofwarragnarok #spoilers #gamespot", "link": "https://www.youtube.com/watch?v=gmXln1nUN4E", "date_published": "2022-11-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "High on Life - 25 Minutes of Gameplay", "description": "Enjoy 25 Minutes of exploration and firefights with lots of foul-mouthed and zany characters in High On Life. A new game from the creators of Rick and Morty.\n#gaming #highonlife #gamespot\n\nStrap in for 25 minutes of bounty hunting in High On Life. New guns, hordes of enemies, and the occasional swear or two await. If you want to know if Dr. Joopy is reunited with his family, be sure to pick up High On Life when it launches on PC and Xbox on December 13th.\n\nTimestamps:\n00:00 The Out-Skirts\n01:33 Little Cutie Town\n03:23 Mac And Cheese Bros. Construction\n04:58 Old Town And Ole' Wet Grundy\n07:20 Entering Dreg Town\n10:18 Firefight In The Mothers For Violence Zone\n11:52 The Goop Guy\n13:31 G3 Orientation \n17:22 Meet Dr. Joopy\n18:59 Final Rounds Of G3 Orientation\n22:57 The Fight To Douglas' HQ", "link": "https://www.youtube.com/watch?v=u5r7IeJcsT0", "date_published": "2022-11-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Need for Speed Unbound Speed Race 4K Gameplay", "description": "Ready to see this custom Mercedes 190 E in action? If not now then when! The most in-depth look at Need for Speed Unbound gameplay is here with a first look at Speed Race events including Meetups and Side Bets. See you on the streets.\n\nStart at the bottom and race to the top in Need for Speed Unbound, coming to PlayStation 5, Xbox Series X|S and PC on December 2, 2022.\n\nRace against time, outsmart the cops, and take on weekly qualifiers to reach The Grand, Lakeshore's ultimate street racing challenge. Pack your garage with precision-tuned, custom rides and light up the streets with your style, exclusive fits, and a vibrant global soundtrack that bumps in every corner of the world.\n\n#needforspeed #ChangeYourLane #NFSUnbound", "link": "https://www.youtube.com/watch?v=N8K-8ufqNvY", "date_published": "2022-11-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Two Glitches in Pokémon Scarlet & Violet You Need To Try | GameSpot News", "description": "A Pokemon Scarlet & Violet glitch lets you run faster, while another lets you climb tricky slopes.\n#GamingNews #PokemonScarlet #PokemonViolet\n\nAs one popular tweet shows, yes, it is true that you can double your character's run speed in Pokemon Scarlet and Violet by pressing forward on two controllers at once. However, your Switch must be undocked, and you have to use a Joy-Con attached to the Switch, along with a wireless controller.\n\nAnother exploration glitch making its way around the internet is one that allows you to get up slopes that are impeding your progress. \n\nZullieTheWitch on Twitter posted a clip of her Scarlet game. The video shows her attempting to jump up a slope and sliding down it. Then, she turns around and leaps up the hill backwards, successfully making it up. Our own attempts have gotten the trick to work. If you are interested in trying it yourself, the key is mashing the jump button as you descend, so that your jump starts before you begin to slide down.\n\nIn other Nintendo related news, the Mario Kart 8 Deluxe Booster Course Pass will soon be halfway to the finish line, as the third of six eight-course waves has been confirmed for a December 7 launch date.\n\nWave 3 of the Booster Course Pass will, like the previous waves, add eight more courses to the Mario Kart 8 roster, with all of them coming from previous games in the franchise. There's Wii Maple Treeway from Mario Kart Wii, DS Peach Gardens from Mario Kart DS and 3DS Rainbow Road from Mario Kart 7 just to name a few.", "link": "https://www.youtube.com/watch?v=YZTqjImeYKg", "date_published": "2022-11-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "How Games Get Sniper Rifles Wrong - Loadout", "description": "Virtual sniping comes in such a spectrum of flavours, from Call of Duty quickscopes, and Counter-Strike: Global Offensive AWP picks, to measuring your range and bullet drop in games like ARMA 3 and Sniper Elite 5. But games don’t always get the humble sniper rifle quite right. With the help of Jonathan Ferguson, Keeper of Firearms & Artillery at the Royal Armouries Museum in the UK, we break down the differences between the virtual sniper rifle and its real counterparts.\n\n0:00 - Intro\n01:07 - History of Sniper Rifles\n04:37 - Range & Bullet Drop\n06:45 - Scope Glint\n08:23 - Quickscoping\n09:19 - Bolt Action vs. Semi-Auto Rifles\n10:26 - Anti-Materiel Rifles\n11:34 - Realistic Gaming Sniper Rifles\n12:48 - Variety of Virtual Sniping Playstyles\n15:10 - Ending\n\nIn this episode of Loadout, Dave Jewitt visits the Royal Armouries to talk to Keeper of Firearms & Artillery Jonathan Ferguson to chat about gaming’s obsession with the humble Sniper Rifle, and how sniper rifles in video games measure up to reality.\n\nYou can check out more episodes of Loadout right here. - https://www.youtube.com/watch?v=yzSrmGkpWKk&list=PLpg6WLs8kxGMzIemU1gyyLmg5VlKI2UvC\nYou can check out our Firearms Expert Reacts series here. - https://www.youtube.com/watch?v=5FVzcoRjoN4&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/", "link": "https://www.youtube.com/watch?v=BxwttKn3fjc", "date_published": "2022-11-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Wild West Expert Reacts to More Of Red Dead Redemption 2", "description": "Danny Michael, associate curator at the Buffalo Bill Center of the West museum, breaks down Rockstar's western epic.\n\nRed Dead Redemption 2 saw Rockstar return to the frontiers of the Wild West for a prequel to the seminal Red Dead Redemption. Rockstar went out of their way to make Red Dead Redemption 2 feel and look authentic. We brought Danny in to see if Rockstar delivered on that promise.\n\nIn this video Danny breaks down old western towns and cities, hunting, train robberies, firearms, and architecture. Part 2 of this series is on the way so make sure to subscribe to GameSpot to see more in the future.\n\n00:00 - Intro\n00:51 - Train Robberies\n03:20 - Plague Town\n04:03 - Catalogues and Shopping\n05:57 - Hunting\n10:54 - The Mauser\n13:05 - House Building\n15:38 - Outro\n\nCenter of the West: https://centerofthewest.org/\nCody Firearms Museum: https://centerofthewest.org/our-museums/firearms/\nCody Firearms Museum Twitter: https://twitter.com/codyfirearms\nCody Firearms Museum Instagram: www.instagram.com/codyfirearmsmuseum\nARMAX: https://www.armaxjournal.org/\nHistory Unloaded: https://historyunloaded.podbean.com/\n\n#reddead2 #reddeadredemption #gaming", "link": "https://www.youtube.com/watch?v=CRhxQpotdCM", "date_published": "2022-11-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]