[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCxt2r57cLastdmrReiQJkEg", "title": "Why Elon Musk Can’t Save Free Speech", "description": "Watch this video ad-free on Nebula: https://nebula.tv/videos/tomnicholas-why-elon-musk-couldnt-save-free-speech\n\nA video about Elon Musk, Twitter, Free Speech, the \"Marketplace of Ideas\" and Content Moderation on Social Media.\n\n*Chapters*\n\n00:00 Introduction: Elon Musk is (Not) Buying Twitter\n06:49 1. The Problem with Free Speech\n19:53 Curiosity Stream & Nebula\n22:17 2. The Origins of the Public Sphere (or, the \"Marketplace of Ideas\")\n33:25 3. When Debate Went Online\n43:42 4. Censorship & Social Media\n58:19 5. Why Elon Would Have Failed\n\n*Bibliography*\nYou can find an annotated bibliography for this video on my website, here: https://tomnicholas.com/2022/07/why-elon-musk-couldnt-save-free-speech\n\n*Some Copy about the Video for the YouTube Algorithm*\n\nIn this month’s video, we’re looking at Elon Musk’s attempted (and now seemingly aborted) purchase of Twitter.\n\nIn April 2022, Elon Musk offered to buy Twitter for $44 billion. His stated goals were two-fold: Firstly, to rid the social media network of bots and other fake accounts. Secondly, to ensure Twitter was doing all it could to protect “free speech” on its service.\n\nOver the past six months, Musk has joined the legions of activists on the political right who bemoan what they see as an overly-stringent approach to content moderation (or what they usually describe as “censorship\") on Twitter. They claim that this is stifling public discourse and taking away users’ rights to freedom of speech and expression.\n\nBut what would a Muskian Twitter actually have looked like? Could he have seen-through his plans for securing “free speech” on the platform? Or is it all a little bit more complicated than that.\n\nJoin me as we take a dive into the ways in which discussions around freedom of speech tend to fail, the history of the so-called “marketplace of ideas” and what all of this might mean for how we look back on the attempt by Elon Musk to buy Twitter.\n\nSupport the channel on Patreon at http://patreon.com/tomnicholas\n\nIf you've enjoyed this video and would like to see more including my What The Theory? series in which I provide some snappy introductions to key theories in the humanities as well as video essays and more then do consider subscribing.\n\nThanks for watching!\n\nTwitter: http://twitter.com/tom_nicholas\nInstagram: http://instagram.com/tomnicholaswtf\nPatreon: http://patreon.com/tomnicholas\nWebsite: http://www.tomnicholas.com\n\nSelect footage courtesy of Getty\n\n#ElonMusk #Twitter #FreeSpeech", "link": "https://www.youtube.com/watch?v=79pS5OXKTkU", "date_published": "2022-07-29 18:30:12+00:00", "persistent": true, "user": "rumpel", "language": "en-US", "tags": ["moderation", "censorship", "free speech"]}]