[{"source": "https://lukesmith.xyz/rss.xml", "title": "'Based' Paganism vs. Christianity", "description": "<p>I&rsquo;ve been meaning to write about Paganism recently. I will frame it as a response to an email I received within the past day or so:</p>\n<blockquote>\n<p>Hey Luke,</p>\n<p>First off, I would like to thank you for all your efforts in making everything\nyou know accessible to everyone. You have exposed me to some of the most\nthought-provoking people on the internet and Varg is one of them. I was\nwondering if you can write an article or make a video on what you think about\nVarg&rsquo;s Paganism in relation to you choosing Orthodox Christianity. I know that\nyou briefly talked about it in one of your livestreams, however, I would like\nto better understand why you don&rsquo;t practice Paganism yourself. My background is\nSerbian and most Serbians follow the Serbian Orthodox Church, but after\nwatching Varg&rsquo;s videos, I&rsquo;m conflicted. I agree with a lot of what Varg says\nabout Christianity, but my father long ago told me to follow the Serbian\nOrthodox Church if I were to become religious. I&rsquo;m sure that many people feel\nthe same way after watching Varg&rsquo;s videos, and your thoughts on it would\ngreatly help people like me make up their minds.</p>\n<p>Best,</p>\n<p><em>redacted</em></p>\n</blockquote>\n<p>I will sum up my answer to this email in bullet points, then explain what I mean.</p>\n<ul>\n<li>Modern &ldquo;paganism&rdquo; is not a real thing and has nothing to do with paganism in history.</li>\n<li>The most direct cultural link between modern man and antiquity is the orthodox Christian Church.</li>\n<li>Truth matters&mdash;&ldquo;Picking&rdquo; a religion on personal preferences is brain-dead and self-refuting.</li>\n</ul>\n<h2 id=\"your-average-pagan\">Your Average Pagan</h2>\n<p>Many people probably don&rsquo;t know who Varg Vikernes is, but since the email brings him up, I will talk about him as an example of where paganism leads.\nModern &ldquo;paganism&rdquo; is not an authentic tradition handed down over the ages.\nIt is an attempt of modern disconnected people to recreate or re-engineer a culture, time and place they have absolutely no contact with.\nThis ultimately makes &ldquo;paganism&rdquo; a modernist Rorschach test where individuals can more-or-less create the religion they want.</p>\n<h3 id=\"paganism-with-modern-goggles\">Paganism with modern goggles</h3>\n<p>Varg&rsquo;s particular &ldquo;paganism&rdquo; is a kind of scientific euhemerism: he doesn&rsquo;t actually believe in gods in the way an ancient pagan would have, but that the concepts of the gods represent scientific or other knowledge.\n(This is where the placenta meme around him comes from after all, when he and his wife related assorted pagan myths and items to the tree-like appearance of a human placenta.)\nHe has also reduced classical abstract spiritual concepts into hormones and other related things.\nIn essence, he has created a pseudo-paganism that is compatible with modern materialism.</p>\n<p>Varg had cited and recommended works such as Frazer&rsquo;s <em>Golden Bough</em> as influential on his thought which is of a similar vein.\nThis book was part of a wider movement in the English-speaking rationalist world to rationalize and explain myth.\nIt goes without saying that I think this all comes from the assumption of modern man that all ancient people underlyingly thought like Neil deGrasse Tyson.</p>\n<h3 id=\"how-long-until-legend-becomes-myth\">How long until legend becomes myth?</h3>\n<p>More plausible is the viewpoint I&rsquo;ve spoken of in works such as <a href=\"https://notrelated.xyz/#02.04\"><em>Hamlet&rsquo;s Mill</em></a>.\nIt alleges that <em>one specific</em> prehistoric civilization used myth to transmit scientific knowledge, but being thousands of years out from that civilization, the descendant stories are distorted, partial and can only be related after extensive study.\nThey allege that &ldquo;Hamlet stories&rdquo; are similar in origin and actually carry astrological information, including the idea of the procession of the equinoxes.</p>\n<p>But Varg&rsquo;s quasi-euhemerism makes a much stronger claim, that all our &ldquo;forebears&rdquo; (as he tends to call them) left an entire encyclopedia of scientific knowledge in stories that have remained unblemished and mostly unchanged over thousands or <em>millions</em> of years since the Neanderthals, who he views as the Trve Europeans.</p>\n<p>This stronger claim should be absurd on its face, as it assumes that over the millennia, there is little to no addition, subtraction or change of folklore.\nThe <em>Hamlet&rsquo;s Mill</em> model admits that this does happen, but Varg is dealing with a much longer scale and often makes very specific claims about some myths.\nWhat I think Varg is truly doing when he looks at a pagan myth and sees a placenta, he is seeing statistical noise and fitting that noise to the many possibilities in his head.\n(I will also say that this is somewhat the modus operandi of many capital-T &ldquo;Traditionalists&rdquo; in the vein of Evola or Guénon.)</p>\n<aside>\nThis is principally a response to the theories that Varg put forth around 2016-2018 when I would occasionally watch his videos. I'm sure it's very possible that he endorses things very different now, since this \"paganism\" is not anything concrete.\n</aside>\n<h2 id=\"is-christianity-a-departure-from-european-tradition\">Is Christianity a departure from European tradition?</h2>\n<p>One thing I&rsquo;ve tried to emphasize <a href=\"https://notrelated.xyz/#02.02\">in some places</a> is the general wrongness of the idea of the cultural &ldquo;quantum leap&rdquo; or &ldquo;discontinuity&rdquo; between Prechristian and Christian Europe.\nThis is a highly important issue for many putative pagans, because they view the &ldquo;change&rdquo; of Europe over to Christianity as perhaps the start of the now constant and perpetual leftist cultural revolution.</p>\n<p>This is the idea, which most people and &ldquo;based&rdquo; pagans have even by osmosis, that the Christianization of Europe was a radical break from history and tradition.</p>\n<p>This is true only on the Christian metric: obviously the salvation of Europe is a quantum leap.\nHowever, melodramatic pagans will lament that this is when Europe have up its &ldquo;European&rdquo; soul and adopted a &ldquo;Jewish&rdquo; or &ldquo;desert&rdquo; religion which put the continent on a totally different and out-of-touch cultural direction.</p>\n<h3 id=\"pagan-philosophy-and-christianity\">Pagan Philosophy and Christianity</h3>\n<p>Christian theology, including Trinitarian theology has direct and undeniable &ldquo;pagan&rdquo; analogues and imitators:\nNeoplatonism expresses a kind of theological trinity as well (the One, the Intellect and the Soul), albeit one more similar to Origen&rsquo;s trinity where a hierarchy of the three persons exist.</p>\n<p>In the cosmogony of the <em>Poemandres</em>, a Hermetic work, shows a pagan creation myth wherein God creates the world via his <em>Logos</em>, as in the first chapter of St. John&rsquo;s gospel, which also has a trinitarian and monotheistic unity with God (differing from Christianity in its panentheism).</p>\n<p>As I mentioned in the linked podcast <a href=\"https://notrelated.xyz/#02.02\">episode above</a>, Stoic philosophy is a component needed to understand the opening of the gospel of John and is part of the philosophical backdrop of early Christian theology.</p>\n<p>Medieval esoteric doctrines and alchemy viewed all of nature as trinitarian, possessing body, mind, and spirit (salt, sulfur and mercury), which was related directly to the Triune nature of God.\nEven specific mystical sects like Mithraism or the many forms of Gnosticism are tied closely to the development of Christianity.</p>\n<p>All of these intellectual strands were intertwined with Christianity since the beginning of the written expression of Christian theology.</p>\n<p>A pagan now has to ask himself: if Hermeticism or Mithraism had taken over as a universal religion of Europe, would they loathe it like they loathe Christianity and view it as a radical departure from &ldquo;paganism?&rdquo;\nNote that Hermeticism had an alleged Egyptian origin, and Mithraism had a orientalist/Iranic origin.</p>\n<p>Note that none of my point here is specifically that Christianity influenced or created these other philosophies or that they influenced (providentially) Christianity.\nWhat is important is that looking at it dispassionately, we cannot deem Christianity as some cultural departure from &ldquo;real&rdquo; European culture without also throwing out this entire philosophical tradition as a whole.</p>\n<p>Medieval Christians would often look at Greek Philosophy as another covenant of God established to prepare mankind intellectually for the revelation of the Trinity.\n(Note also that <a href=\"https://www.youtube.com/watch?v=LCjX0il3wkc\">Dante and others</a> represent Christians who viewed the Roman Empire also as part of a divine plan.)</p>\n<p>Ultimately, the Christian religion is non-cultural and thus universal/catholic. There are cultural aspects associated with it, but there&rsquo;s a difference between essence and accidents.\nOf those cultural aspects, they are nearly all European, not, as some allege, Hebrew or Jewish.\nMost of the New Testament is quite literally an explication of why this religion which accepts the Hebrew Scriptures is markedly non-Jewish and why Jewish practices like circumcision and sacrifice are sacrilegious.</p>\n<p>So the view we should get from this is that Christianization was no cultural leap into an alien worldview, but something whose intellectual side happened slowly over centuries and would only be viewed as spiritual, not culturally distinct from its environment.</p>\n<h3 id=\"which-change-is-good\">Which change is good?</h3>\n<p>Note that even Varg admits that religious interpretation and practice changes with the centuries.\nIn his interpretation and even in his RPG, MYFAROG (which is really just an expression of his paganism and worldview), characters can have one of two &ldquo;Life Stances&rdquo; or religious inclinations: <em>Seiðr</em> or  <em>Âsatrû</em>.\nSeiðr &ldquo;tradition,&rdquo; represents a kind of animism, witchcraft or spell-casting, while Âsatrû represents the worship of pagan gods.\nCharacters can choose either life stance, but one can only change from Seiðr to Âsatrû, which is a representation of the alleged historical shift in early history from animistic to polytheistic practices.</p>\n<p>If we accept this cultural transition as &ldquo;legitimate&rdquo; in terms of cultural continuity, on what grounds could we also mark as verboten a shift from polytheism to monotheism?\nAfter all, the pagan philosophy of Plato and Aristotle even from the earliest was monotheistic at its core, and even today, the world&rsquo;s one remaining &ldquo;polytheistic&rdquo; religion, Hinduism only appears so on the surface, but has at its core its own monad and final cause: Brahman.</p>\n<h2 id=\"tradition-vs-inventing-your-own-religion\">Tradition vs. Inventing your own religion</h2>\n<p>To learn of Christian theology, thus, is to set oneself down a road of millennia of learning with often with no delineation between Christian and Prechristian thought.\nBy the same token, learning of secular philosophy, even as an atheist might lead you to Christianity, as was the case with me.\nThere is no obvious discontinuity, either in thought or practice.</p>\n<p>But modern day &ldquo;paganism&rdquo; does indeed have such a gap.\nTo be a &ldquo;pagan&rdquo; does not involve communing with a centuries-old tradition passed down generation-to-generation from antiquity.</p>\n<p>It is modern people imagining based on T.V. shows, books and their own creativity what Prechristian Europe was like and then putting on their own imitation of it.\nThey might see something they dislike in the world, blame it on Christians and then imagine a world without it.\nThis invariably comes with retrojecting their own modern values and assumptions on the past.</p>\n<p>After all, we Christians can sit down with an Orthodox Priest or grow up in a Orthodox household and have a direct, personal contact with a tradition and understand how people who are part of it think and act.\nWe have no tangible contact with Prechristian European paganism, even out of intellectual interest.\nUnderstanding how Europeans truly thought and acted is an issue of cultural reconstruction and theory.\nTraditional folklore and practices are still very much alive, but they are now decked in a Christian garb.\nWe do celebrate Christmas for Our Lord&rsquo;s birth, but everyone knows that nearly all of the practices of that season of the many nations of Europe predate Christianization.</p>\n<h3 id=\"the-worst-possible-decision\">The Worst Possible Decision.</h3>\n<p>All this said, the absolute worst self-own possible would be someone who has direct and easy access to the Orthodox Church and abandons it or leaves it for a false &ldquo;religion&rdquo; that doesn&rsquo;t even exist off of the internet and has no organic connection to reality, like Neo-Paganism.</p>\n<p>So my recommendation to the emailer above should be obvious.</p>\n<p>Being physically close to the Orthodox Church is a huge asset, but even being able to travel to one occasionally is a massive grace. Everyone should be taking advantage of that as often as possible.</p>\n<h3 id=\"pagan-gurus\">Pagan Gurus</h3>\n<p>Because it is ungrounded and ahistorical, modern &ldquo;paganism&rdquo; thus naturally exists as a kind of extreme Protestant guru-centered feel-goodery where since there is absolutely no tether to a genuine preserved tradition, a man can make up an unfalsifiable claim about what true &ldquo;Paganism&rdquo; is and sell it as legit.</p>\n<p>I mentioned Varg earlier, who has concocted a &ldquo;paganism&rdquo; that consists in claiming that their lore and practice embed scientific information.\nHe doesn&rsquo;t <em>believe</em> in pagan gods, unless we&rsquo;re talking about belief in a very evasive and meaningless Jordan Peterson kind of way.\nIf we could actually transport a prehistoric pagan to our day and speak to him, he would probably either be confused or bemused by this very modern worldview, but we can&rsquo;t even do this.</p>\n<p>Most pagans are not &ldquo;based&rdquo; like Varg anyway (he lives a minimalist and traditional lifestyle in rural France with an ever-growing family).\nMost &ldquo;pagans&rdquo; are leftists who like &ldquo;paganism&rdquo; because they hate God and nature and morality and imagine that pagans were demented sexual perverts like they are.</p>\n<h2 id=\"truth\">Truth</h2>\n<p>Notice that I had specifically avoided the most important issue: Truth.</p>\n<p>I&rsquo;ve done this because when people are asking to convert to something just because it&rsquo;s &ldquo;based,&rdquo; <em>Truth</em> is unfortunately not necessarily their concern, so I&rsquo;ve first addressed issues that do concern them.</p>\n<p>The reality is, thankfully, that truth is the most &ldquo;based&rdquo; thing of all&mdash;And it is entirely cringe to believe in something because it sounds cool to you.\nIf you think you can decide your own truth, you are no different from someone who thinks they can decide their own pronouns, literally.</p>\n<p>Even in the email above, he refers to me &ldquo;choosing&rdquo; orthodox Christianity as if it were an issue of personal taste.\nIf I liked pop music and people rolling on the ground, perhaps I would be just as justified converting to some Pentecostal sect.\nThis is silly.</p>\n<p>The greatest deception is that religion is this separate category about &ldquo;feelings&rdquo; or &ldquo;preference&rdquo; and not truth.\nAtheist and spiritual R*dditor Stephen Jay Gould put this in words in the modern era, calling science and religion &ldquo;non-overlapping magesteria,&rdquo; declaring in a laughable attempt at big-braned centrism that nothing in material reality is relevant to religion and nothing in religion is relevant to material reality.</p>\n<p>This is strange because people can research the philosophies I mentioned earlier, Platonism, Gnosticism, Stoicism, Hermeticism and can analyze and critique them and look at them as models of reality perfectly comparable to modern philosophical assumptions and approaches.\nBut we have been taught to view Christianity as this separate category, that can&rsquo;t possibly be a model of reality, but is a something merely &ldquo;moral&rdquo; or &ldquo;personal&rdquo; or &ldquo;spiritual&rdquo; which are all terms that have been debased to mean nothing at all.</p>\n<p>A Christian believes that Jesus&rsquo;s resurrection was a true historical event, and a prelude of a general resurrection to come and that he established a Church and sacraments which are his vehicles for having man recover from sin within this life to prepare for his roles in the next.\nThe orthodox Christian Church is an unbroken chain since that period, and oft built on yet older philosophical and liturgical practices.</p>\n<p>If you find this alien or God unbelieveable, you can do yourself the favor of prayer and visit a priest and see what happens.</p>\n<h3 id=\"they-dont-even-believe-it\">They don&rsquo;t even believe it.</h3>\n<p>To contrast, pagans do not believe in pagan gods. Their brains are 100% modern and materialistic in mindset, and if they ironically say they believe in gods, it is out of some kind of Petersonian fake metaphorical &ldquo;belief&rdquo; in a concept or that &ldquo;Zeus&rdquo; isn&rsquo;t a person, but is some kind of abstraction symbolizing the weather or something silly.\nThe only thing sillier is for them to claim that people in the ancient world <em>didn&rsquo;t really believe in them either</em>, but practiced entire religions meta-ironically for some social reasons.\nIf they believe in a &ldquo;spiritual&rdquo; nature, it is not one beyond or above matter, but instead derived from it: it is psychological, hormonal, etc.</p>\n<p>Modern paganism is neither a tradition, nor a religion, nor even a belief.\nIt is just a new identity which supposedly flexes some kind of disposition to the world which is not even consistent across pagans because there is no basis for any of it.</p>\n<hr />\n<h3 id=\"real-baste-european-pagans\">Real Baste European Pagans</h3>\n<p>Christians, however, do believe in pagan gods.\nChristians have always admitted the reality of spiritual beings, including the demonic.\nYou can take the Michael Heiser/Divine Council pill on this if you&rsquo;re interested:\nWhile there is only one Creator and Supreme God, he created many among his heavenly host, and originally appointed them to the different races on earth.\nMany rebelled and set themselves up as specific gods of their appointed races.</p>\n<p>One of the purposes of Christ&rsquo;s coming was to vanquish these usurpers, and thus paganism/polytheism, which obviously has been successful.\n(Note that the <a href=\"https://lindypress.net/book?pk=6\">Book of Enoch</a> in Chapter 10 prophecies that these fallen angels would be judged 70 generations after the Enochian period, which cross-referencing with the Gospel of Luke, it is exactly 70 generations until Christ.)\nNow the issues of faith are not so much polytheism, but heresy and then atheism, which is a significant enough change in the cosmic dynamic.</p>", "link": "https://lukesmith.xyz/articles/christianity-based-paganism/", "date_published": "2022-07-29 11:53:20+00:00", "persistent": true, "user": null, "language": "en-US"}]