[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "11 Biggest Game Releases For August 2022", "description": "August is upon us, which means the summer is starting to wind down. But that doesn’t mean that game releases are slowing down! Here is a list of the biggest games releasing in August 2022.\n#Gaming #SaintsRow #MaddenNFL23 \n\nFootball is back and has once again managed to improve on last year’s game.\n\nPerhaps the biggest new feature in Madden NFL 23 is the \"Fieldsense\" system that EA promises will deliver \"more control at all positions in every mode.\" EA said this new system will help deliver \"ultra-realistic gameplay,\" including new animations and player control mechanics.\n\nMadden NFL 23 also updates Face of the Franchise with a new experience called The League. There will be new position-specific mechanics and player-focused cameras. Franchise mode, meanwhile, will offer \"simplified\" team-building mechanics.\n\nIn terms of visuals, Madden NFL 23 aims to offer a \"new level of visual realism\" in all stages of the football experience. There will be new \"player-locked, 4K touchdown cameras\" that aim to match what the latest NFL TV broadcasts offer.\n\nYou can continue to secretly pretend you’re Tom Brady when Madden NFL 23 drops on August 19 for PC and every console except Switch.\n\nSoul Hackers 2 is the follow-up to Demon Summoner: Soul Hackers, itself a sci-fi spin-off in the Shin Megami Tensei franchise.\n\nSet in the same world as Soul Hackers without continuing that tale, you play as Ringo, a character created by a sentient artificial intelligence and dispatched to stop some coming event from ending the world. With Soul Hackers 2, you're dealing with a group of characters who are older, rather than those making their way through high school. But this is also a supernatural sci-fi RPG, so expect some fantastical elements; for instance, there are demons, and you summon them.\n\nAccording to Atlus, while the first Soul Hackers had a pretty hardcore RPG bend that might have turned off some players, the sequel is looking to be a little more welcoming, while also seemingly borrowing a lot of what works from recent successes like Persona 5 to present a new story.\n\nYou can summon some demons when Soul Hackers 2 comes to PC and every console except Switch on August 25.\n\nSo which of these games are you most interested in? Are there any that you can’t wait to play that didn’t make the list? Let us know in the comments and stay tuned to GameSpot for more.\n\nTimestamps:\n00:00 - Intro\n00:11 - Saints Row\n01:01 - Cult of the Lamb\n01:39 - Madden 23\n02:39 - Turbo Golf Racing\n03:18 - Two Point Campus\n03:52 - Rumbleverse\n04:35 - Marvel’s Spider-Man\n05:07 - Rollerdrome\n05:54 - Midnight Fight Express\n06:38 - F1 Manager 2022\n07:05 - Soul Hackers 2", "link": "https://www.youtube.com/watch?v=0jjrwwkFc40", "date_published": "2022-07-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Killing Floor 2’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Killing Floor 2, including the unique ‘Doshinegun’, a ‘Tommy Gun In Space’, and a lever action shotgun combined with a magic axe blade for good measure.\n\n00:00 - Opening\n00:44 - AA-12\n01:24 - HRG Tommy Boom\n02:21 - AF 2011-A1\n03:34 - Dual-wielded AF 2011-A1\n04:29 - Pulverizer\n06:17 - Doomstick\n08:22 - Glock 18C\n10:31 - Frostfang\n12:04 - Mosin Nagant M91/30 with bayonet\n14:50 - Helios Rifle Microwave Gun\n16:03 - Spitfire\n18:20 - Doshinegun\n20:08 - HMTech-501 Grenade Rifle\n22:10 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Killing Floor 2 and compares them to their potential real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nRoyal Armouries' Boarding Axe Carbine Video - https://www.youtube.com/watch?v=s7GnbhiNUbk&t=50s\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=3utFiYkMFJg", "date_published": "2022-07-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Toughest Decisions In Games | GameSpot After Dark Episode 155", "description": "This week on After Dark, the crew welcomes our newest hire Stuart to the team! We also discuss Xenoblade Chronicles 3, Bear and Breakfast, the new Sims 4 update that has broken the game, and some of the toughest decisions we've had to make in a video game.\n\n0:00:00 - Welcome To The Team Stuart!\n0:13:03 - Xenoblade Chronicles 3\n0:22:27 - One Piece\n0:33:23 - Bear and Breakfast\n0:35:24 - Sims 4 Update Breaks The Game\n0:45:50 - The Queen's Ball - A Bridgerton Experience\n0:59:05 - Nanaca Crash\n1:08:51 - The Toughest Decisions In Games For Us\n\n#gaming #masseffect #gamespotafterdark", "link": "https://www.youtube.com/watch?v=X--dM6X2qYU", "date_published": "2022-07-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best PlayStation Plus Games To Play Right Now", "description": "If you’ve got PlayStation Plus but are overwhelmed by the number of games on offer, have no fear. There’s something for everyone, and we’re here to help you get the most from your sub. From Yakuza: Like A Dragon, to Tony Hawk’s Pro Skater 1+2, to more left-field picks like Tokyo Jungle, we’ve got you covered with the best games to play on every PS Plus tier for August 2022. #playstationplus #gamespot #gamingnews \n\nPlayStation Plus has recently changed, going from one plan to three, with each plan offering various benefits including cloud saves, game trials, and, crucially, a bunch of games to download and play. If you have PlayStation Plus Premium, you’ve got hundreds of games at your fingertips, and if you’re suffering from choice paralysis, then have no fear, each month we’ll round up the new additions and guide you on what to play first.\n\nThis month brings RGG’s renowned Yakuza series to PlayStation Plus. Yakuza: Like A Dragon is available for PlayStation Plus Essential subscribers, but if you have Game Catalog, then you’ll get access to all of Kazuma Kiryu’s saga. Also new this month is Marvel’s Avengers and Tony Hawk’s Pro Skater 1+2. We also make recommendations on what to queue up from the Game Catalog and Classics Catalog, because everyone’s got a backlog, right?\n\nPlayStation Plus has three tiers: Essential, Extra, and Premium, and each tier offers different benefits. We have a complete rundown of what you can expect right here on GameSpot, and if you want new recommendations each month, make sure to subscribe. We also have a monthly Xbox Game Pass show where we discuss what’s joining and leaving the rotating catalog on Microsoft's services.", "link": "https://www.youtube.com/watch?v=jwmcueg-VcY", "date_published": "2022-07-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best Xbox Game Pass Games To Play Right Now", "description": "Xbox Game Pass continues to grow each month, with new games like PowerWash Simulator and dramas such as As Dusk Falls. Here's a list of eight great games you can play on the service right now.\n#gaming #gamepass #gamespot \n\nXbox Game Pass, Microsoft's gaming subscription service, is often referred to as the best deal in gaming, and for good reason. Each month, multiple games are added to its rotating catalog of titles, a mix of first-party Xbox games, indies, and other huge games. \n\nIt can be a little overwhelming, but have no fear. In this video, we're going to tell you the best games to play on Xbox Game Pass. There's something for everyone, from simulators such as PowerWash Simulator and House Flipper, to dramatic adventures like  more intense titles like As Dusk Falls and Road 96. \n\nEach month, GameSpot highlights the best games on Xbox Game Pass, so make sure you subscribe to get the best recommendations.\n\nTimestamps:\n\n00:00 - Intro\n00:15 - PowerWash Simulator\n01:04 - House Flipper\n01:58 - Escape Room Academy\n03:00 - As Dusk Falls\n04:14 - Road 96\n05:11 - Torment: Tides of Numenera\n06:06 - MotoGP 22\n06:48 - Yakuza series\n07:41 - Outro", "link": "https://www.youtube.com/watch?v=UF6uBBW416Q", "date_published": "2022-07-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "I Heart Skyrim (ft. ESO, FudgeMuppet, and More!)", "description": "Bethesda's Elder Scrolls series has consistently been one of the most beloved and successful open world RPG's. And, while we eagerly wait for Elder Scrolls VI, here is a loving look back at Elder Scrolls V: Skyrim. This is the story of Skyrim as told by its fans.\n\nJoin Adam Mason, Dave Jewitt, and Kurt Indovina of GameSpot, Cam Robinson, DaveControl, ESO Danny, Super BunnyHop, Lucy James of Giant Bomb, FudgeMuppet, Rycon Roleplays, and Shirley Curry as they discuss the impact Skyrim has had on them and the gaming industry as a whole in this love letter to Elder Scrolls V.\n\nWhile Skyrim wasn't the Elder Scrolls game that established the series as an open-world RPG great, and many will argue over if Morrowind, Oblivion, or Skyrim did it best, its tremendous success and impact can't be denied. The cold, northern region of Tamriel has become the home of many stories, and the epic sweeping soundtrack of Skyrim not only contains incredible tracks to relax to as you explore, but of course, Dovahkiin - the perfect ode to a Dragonborn.\n\nCam Robinson, Adam Mason, and Dave Jewitt discuss the meme of being a stealth archer in Skyrim, while Super BunnyHop, Rycon Roleplays, FudgeMuppet, and Shirley Curry discuss roleplaying in Skyrim. Lucy James and SuperBunnyHop chat about Skyrim Mods, while Kurt and Rycon Roleplays chat about how great the Dark Brotherhood quests are.\n\nEnjoy the 2nd episode of I :heart: Gaming. If you missed it, check out our first episode on Dark Souls, featuring: Adam Mason, Brad Ellis of Easy Allies, Caddicarus, Chris Morris, Dave Jewitt, DaveControl, Gav Murphy and Rory Powers of RKG, Super BunnyHop, HeyZeusHeresToast, Iron Pineapple, Jessie Gender, LobosJR, Lucy James and Tamoor Hussain of Giant Bomb, Marz, Otzdarva, Prod, Quelaag, and Sinclair and Sophie of SinclairLore.\n\nLet us know what future episodes you'd like to see, and what guests you hope to see on!\n\nCheck out the Skyrim anniversary concert here: https://youtu.be/IaskxKfeFno  \n\n#gaming #skyrim #iheartgaming", "link": "https://www.youtube.com/watch?v=gMx_ps3CgPI", "date_published": "2022-07-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sony Won't Rule Out PS5 Price Increase | GameSpot News", "description": "Could the PlayStation 5 be getting more expensive? Plus Steam Deck availability is improving, Genshin Impact teases its 3.0 update, and and the Analogue Pocket is getting some new features.\n#Gaming #PS5 #PlayStation5 \n\nCould a PlayStation 5 price hike actually happen? Plus, exciting Steam Deck news, a Genshin Impact 3.0 tease and new updates to the Analogue Pocket on today’s GameSpot News.\n\nThe PlayStation 5 is flying off store shelves, but--due to supply chain issues and other factors--the system has not been able to match the sales success of the PlayStation 4 thus far.\n\nSony's latest earnings briefing shows that the PS5’s lifetime has reached 21.7 million since launch in November 2020. The PlayStation 4, by comparison, reached 25.4 million units after its first seven quarters on the market.\n\nDuring a call with investors, Sony was asked about a potential PS5 price increase, something the company has done in Japan with other products, including speakers, headphones, and cameras, due to various factors\n\nAccording to VGC's translation of comments made CFO Hiroki Totoki, Sony isn't prepared to comment on the possibility of a PS5 price hike. \"About a potential price increase for the PS5, at this point in time there is nothing specific I can share with you about prices,\" the executive said.\n\nWhile a price increase would be an unprecedented move for a console, we did just see this happen with the Meta Quest 2, which it itself is getting a $100 price hike in August.\n\nIf you’ve been struggling to get your hands on a PlayStation 5, and have been eyeing a Steam Deck, some great news from Valve! The company put out a statement that it will be able to meet demand sooner than estimated, and that anyone with a current reservation will be receiving their handheld by the end of the year.\n\nTIMESTAMPS: \n00:15 - Potential PS5 price increase\n01:24 - Steam Deck supply\n02:16 - Genshin Impact 3.0\n02:53 - Analogue Pocket OS v1.1 update", "link": "https://www.youtube.com/watch?v=isUE-R6Z6aw", "date_published": "2022-07-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]