[{"source": "https://www.dailywire.com/feeds/rss.xml", "title": "NFL Player Allegedly Exposes Himself In Middle East Swimming Pool", "description": "NFL free agent wide receiver Antonio Brown was allegedly caught on video appearing to expose himself to a woman in a swimming poll at a high end hotel in the Middle East. The New York Post reported that Brown, 34, was caught &#8220;shoving his bare buttocks into the face of a stunned woman&#8221; while both were ...", "link": "https://www.dailywire.com/news/nfl-player-allegedly-exposes-himself-in-middle-east-swimming-pool", "date_published": "2022-10-01 23:12:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "John Fetterman Gives Puzzling Response When Answering Question During Interview", "description": "Pennsylvania U.S. Senate candidate John Fetterman (D) raised eyebrows Friday evening with a nonsensical answer that he gave during a cable news interview. The segment comes after Fetterman suffered a stroke several months ago from which he has not fully recovered, and has thus faced lingering doubts on the campaign trail about whether he is ...", "link": "https://www.dailywire.com/news/john-fetterman-gives-puzzling-response-when-answering-question-during-interview", "date_published": "2022-10-01 22:45:25+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Ron DeSantis Cooks Breakfast At Waffle House For Hurricane First Responders", "description": "Florida Governor Ron DeSantis (R) cooked breakfast Saturday morning for first responders who have been on the frontlines dealing with the aftermath of Hurricane Ian. Hurricane Ian made made landfall Wednesday afternoon in Southwest Florida as one of the most powerful Category 4 hurricanes to ever hit the state, with sustained wind speeds reaching up ...", "link": "https://www.dailywire.com/news/ron-desantis-cooks-breakfast-at-waffle-house-for-hurricane-first-responders", "date_published": "2022-10-01 22:33:50+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Over 100 People Killed In Massive Soccer Riot", "description": "Fights between supporters of two rival soccer teams in East Java, Indonesia, led to a massive riot and a stampede, killing at least 129 people. Authorities said most of those killed at Kanjuruhan Stadium in Malong either suffocated or were trampled to death trying to get out of the stadium after chaos erupted and police ...", "link": "https://www.dailywire.com/news/over-100-people-killed-in-massive-soccer-riot", "date_published": "2022-10-01 22:32:58+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Russians On The Run: Putin’s Forces Flee Another Strategic City Day After Annexation", "description": "Russian troops withdrew from another Ukrainian city on the frontline of the war Saturday as Ukraine’s fighters surrounded Lyman in the Donetsk Oblast. The retreat comes just a day after Russian President Vladimir Putin annexed large swaths of Ukraine following what many are calling sham referenda across four eastern and southern Ukrainian regions. Putin claims ...", "link": "https://www.dailywire.com/news/russians-on-the-run-putins-forces-flee-another-strategic-city-day-after-annexation", "date_published": "2022-10-01 22:07:29+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Thousands Of F***ing Dollars You Stole From Everyone’: Outrage At Pro Fishing Tournament After Winners Allegedly Caught Cheating", "description": "Two pro fishermen in Ohio caught some rage along with their fish on Friday. After Chase Cominsky and Jake Runyon were declared winners at the weigh-in at the Lake Erie Walleye Trail Championship (LEWT) in Cleveland, their fellow competitors found some bizarre items stuffed in their catches, TMZ reported. Video of the incident shows someone ...", "link": "https://www.dailywire.com/news/thousands-of-fing-dollars-you-stole-from-everyone-outrage-at-pro-fishing-tournament-after-winners-allegedly-caught-cheating", "date_published": "2022-10-01 20:08:29+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "READ IT: FBI’s Brutal Draft Letter Firing Disgraced Agent Peter Strzok Revealed", "description": "A top FBI official accused Trump-hating former agent Peter Strzok of doing long-term damage to the bureau’s reputation with a “sustained pattern of bad judgment” and “selfishness” in the newly released draft of the 2018 letter firing him. David Bowdich, who was deputy director of the bureau when he penned the brutally harsh draft of ...", "link": "https://www.dailywire.com/news/read-it-fbis-brutal-draft-letter-firing-disgraced-agent-peter-strzok-revealed", "date_published": "2022-10-01 19:27:12+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Michigan Governor’s Race Much Closer Than Previously Suggested, New Poll Shows", "description": "Michigan’s Democratic Governor Gretchen Whitmer continues to lead Republican candidate Tudor Dixon in the polls, but a new survey shows Dixon within striking distance. A poll released Friday by the Trafalgar Group shows Whitmer leading by six points (51% &#8211; 45%), indicating a much closer race than the previous polls from the Detroit News and ...", "link": "https://www.dailywire.com/news/michigan-governors-race-much-closer-than-previously-suggested-new-poll-shows", "date_published": "2022-10-01 18:05:47+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "NSA Agent Arrested After Giving Government Secrets To FBI Agent He Thought Was Foreign Operative, Feds Say", "description": "A 30-year-old former NSA agent was arrested after the feds said that he had been trying to sell government secrets to an undercover FBI agent he thought was a foreign operative. Jareh Sebastian Dalke of Colorado Springs, Colorado, made his first appearance in court on Thursday after he was hit with espionage related charges for ...", "link": "https://www.dailywire.com/news/nsa-agent-arrested-after-giving-government-secrets-to-fbi-agent-he-thought-was-foreign-operative-feds-say", "date_published": "2022-10-01 16:08:06+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Klaus Schwab, The World Economic Forum, And The New Fascism", "description": "The biography of Klaus Schwab, founder and chairman of the World Economic Forum, is murky at best. Several portraits of Schwab emerge in any effort to find out precisely who he is:  The avuncular misunderstood philanthropist and lover of humanity; a secret Nazi avenging his country’s defeat in a war that he can still remember; ...", "link": "https://www.dailywire.com/news/klaus-schwab-the-world-economic-forum-and-the-new-fascism-3", "date_published": "2022-10-01 15:49:50+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Another Women’s Sport Sees Trans Athletes Rise To Top, And Competitors Are Speaking Out", "description": "Biologically male transgender athletes are rising to the top of women&#8217;s professional disc golf, causing some competitors to start speaking up. Male-to-female trans athletes have been allowed to compete in several women&#8217;s sports, including girls&#8217; track and field, women&#8217;s Olympic weight lifting, and female collegiate swimming, and they have had a big impact on those ...", "link": "https://www.dailywire.com/news/another-womens-sport-sees-trans-athletes-rise-to-top-and-competitors-are-speaking-out", "date_published": "2022-10-01 14:59:53+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Get Ready For A Sensitive James Bond As The 007 Franchise ‘Evolves’", "description": "Hollywood can’t stop woke-ifying beloved franchises. Think “Star Wars,” the “Terminator” saga, “Charlie’s Angels,” the Marvel Cinematic Universe, and more. And, in many cases, these franchises have emerged much wobblier. Yet, the family pulling 007’s strings have resisted that progressive siren song. As a result, the James Bond franchise — which began in 1962 with ...", "link": "https://www.dailywire.com/news/get-ready-for-a-sensitive-james-bond-as-the-007-franchise-evolves", "date_published": "2022-10-01 14:23:54+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Dutch Missionary, Known As ‘God’s Smuggler’ For Sneaking Bibles Into Communist Countries, Dead At 94", "description": "Brother Andrew, a Dutch missionary known as “God’s Smuggler” for his work sneaking Bibles into communist countries during the Cold War, died at 94 this week. The missionary, whose real name was Anne van der Bijl, spent a large portion of his life promoting the spread of Christianity into countries where it was unwelcome. He ...", "link": "https://www.dailywire.com/news/dutch-missionary-known-as-gods-smuggler-for-sneaking-bibles-into-communist-countries-dead-at-94", "date_published": "2022-10-01 13:26:16+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "New Details Emerge In Shooting Of 84-Year-Old Pro-Life Volunteer, Michigan Man Charged", "description": "New details continue to emerge in the shooting of an 84-year-old pro-life Michigan canvasser, now identified as retired nurse Joan Jacobson. Richard Harvey, 74, admitted during a news interview last week that he fired off a &#8220;warning shot&#8221; from his .22 caliber rifle when he heard his wife allegedly arguing with the elderly pro-life activist on September 20. ...", "link": "https://www.dailywire.com/news/new-details-emerge-in-shooting-of-84-year-old-pro-life-volunteer-michigan-man-charged", "date_published": "2022-10-01 12:12:17+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Thousands Of Florida Households Facing Financial ‘Ruin’ In Wake Of Hurricane Ian", "description": "Thousands of Floridians without flood insurance could face financial ruin in the wake of Hurricane Ian, which first hit the Gulf Coast as a Category 4 hurricane on Wednesday, according to a new report. Large swaths of Florida’s western coastline, including the Fort Myers area, were battered by Ian as ocean waters slammed the coast ...", "link": "https://www.dailywire.com/news/thousands-of-florida-households-facing-financial-ruin-in-wake-of-hurricane-ian", "date_published": "2022-10-01 11:14:58+00:00", "persistent": false, "user": null, "language": "en-US"}]