[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Game To Save The Human Brain | MindGames", "description": "Sea Hero Quest, in both its mobile and VR forms, tasks you with sailing a small boat, memorizing maps and navigating colorful seascapes. But under the surface, it hopes to provide the data that could help humanity fight an incurable disease that affects hundreds of millions of people.\n\nWe spoke to Hugo Spiers, Professor of Cognitive Neuroscience, and developer Max Scott-Slade of indie developer Glitchers, to find out how Sea Hero Quest revolutionised dementia research around the world, and the breakthroughs the game has led to since release.\n\nTo play a selection of levels from Sea Hero Quest, email seaheroquest@ucl.ac.uk and you'll be provided with an access code for the mobile app.\n\n00:00 Intro\n00:28 What is Sea Hero Quest?\n03:29 Finding the Way\n06:01 Making Waves\n07:35 Game-Changing\n09:00 How to play Sea Hero Quest\n\nThumbnail art by Bruno Di Lucca: https://www.brunodilucca.com/project/seaheroquest\n\nSea Hero Quest: https://www.telekom.com/en/corporate-responsibility/corporate-responsibility/sea-hero-quest-game-for-good-587134\n\nHugo Spiers: https://spierslab.com/\n\nGlitchers: https://glitchers.com/\n\n#gaming #psychology #mentalhealth #dementia #alzheimersawareness #seaheroquest", "link": "https://www.youtube.com/watch?v=vLo59ObMgW8", "date_published": "2022-10-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Biggest Game Releases For October 2022", "description": "Spooky season is officially here! And there is nothing spookier than being haunted by the September games you didn’t finish yet. Here are 10 of the biggest games releasing in October 2022. \n#ModernWarfare2 #Overwatch2 #Gamespot\n\nModern Warfare 2 follows three years after the events of MW 2019, with Captain Price's Task Force 141 now fully formed and operating around the world. Price is joined by the iconic characters of Simon \"Ghost\" Riley, Kyle \"Gaz\" Garrick, and John \"Soap\" MacTavish, but this newly assembled Task Force 141 also includes a new character known as Alejandro Vargas.\n\nOverwatch 2 is the sequel to 2016’s Overwatch and will include some new takes on the combat we saw in the original game. That includes a brand-new game mode called Push, in which two teams fight to escort a robot into enemy territory, as well as the game’s switch to 5v5 matches instead of the original game’s 6v6 model. Team composition is also being adjusted so that teams only contain one tank character so plan accordingly when assembling your friends to play.  \n\nWhile its predecessor saw Mario and company in familiar territory as the Rabbids were transported to the Mushroom Kingdom, that won't be the case in Mario + Rabbids Sparks of Hope. The adventure will take our heroes across multiple planets as they work together to stop an \"evil influence”. Sparks of Hope combines free-roaming exploration with turn-based combat. While wandering each planet, you're free to move as you wish in order to solve puzzles and uncover secrets and collectibles. Once you make contact with an enemy, however, the game switches to a turn-based strategy system. \n\nSTAMPS\n00:00 - Intro\n00:12 - Call of Duty: Modern Warfare 2\n01:47 - Overwatch 2\n03:11 - Mario + Rabbids: Sparks of Hope\n04:23 - Scorn\n05:18 - Gotham Knights\n06:03 - Bayonetta\n07:17 - A Plague Tale: Requiem-\n08:15 - Dragon Ball: The Breakers\n09:05 - NHL 23\n10:09 - RE Village Winter Expansion", "link": "https://www.youtube.com/watch?v=G9_Bi5ldwsc", "date_published": "2022-10-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "FIFA 23 Review", "description": "FIFA 23 makes incremental improvements to last year's game, but the looming presence of Ultimate Team's microtransactions cast a shadow over everything.\n#FIFA23 #gamespot #EASports \n\nFIFA 23 marks the end of an era for the long-running series. After an almost 30-year partnership that began with players like David Platt gracing the cover, EA Sports has parted ways with football's governing body over a licensing disagreement. Future games in the series will now drop the FIFA name in favor of a new EA Sports FC moniker. Not that you'd be able to tell from playing FIFA 23, mind you. Despite being the last game adorned with the household name, it's business as usual both on and off the pitch for EA's latest footballing sim. There are a few new additions spread across its various game modes--and Ultimate Team sees its most significant change in years--but for the most part, FIFA's swansong is a game of minor iterations.", "link": "https://www.youtube.com/watch?v=PyQy6Bs6WUQ", "date_published": "2022-10-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Foxhole’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Foxhole, including the Aalto Storm Rifle, the Neville Anti-Tank Rifle, and a whole squadron of Storm Cannons.\n\n00:00 - Opening\n00:46 - Argenti r.II\n02:20 - Neville Anti-Tank Rifle\n03:54 - Catara mo.II\n05:13 - No.2 Loughcaster\n06:33 - Cremari mortar\n08:01 - Cutler Launcher\n08:54 - Malone MK2\n10:09 - Dusk ce.III\n11:46 - Fiddler SMG Model 868\n12:56 - Lamentum mm.IV\n14:28 - Aalto Storm Rifle\n15:43 - Lionclaw MC VIII\n16:46 - Storm Cannon\n18:23 - Flamethrowers\n19:43 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Foxhole and compares them to their real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=3CdzVU6c5dQ", "date_published": "2022-10-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]