[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "The Lion King: Tiny Desk Concert", "description": "Josh Rogosin | November 11, 2022\nActors and musicians on Broadway have a grueling performance schedule: eight shows a week with only Mondays off. Yet the band and cast of The Lion King were ecstatic to spend their one free day traveling from New York to Washington, D.C. to celebrate 25 years of the iconic musical with a performance at NPR’s Tiny Desk.\n\nMany of the songs written by Elton John and Tim Rice will be familiar — like the Oscar-winning “Can You Feel the Love Tonight” and “Hakuna Matata.” But the cast also treated the enthusiastic Tiny Desk crowd to songs written just for the stage. “They Live In You” wasn’t in the original movie, but is sung in the show by Mufasa (L. Steven Taylor) to his cub Simba (Brandon A. McCall). The young lioness Nala sings “Shadowland'', another gem from the musical sung by Pearl Khwezi (the first South African cast in the role).\n\nInfused throughout the music of The Lion King is spine-tingling African rhythm and language. It’s as captivating as the groundbreaking costume design by director, co-writer and artist Julie Taymor. The team at Disney Theatrical sent the masks of Simba and Nala in time to be prominently displayed on the desk during the concert. Examining their details up close gave me chills — just like the ones I felt watching the show at the New Amsterdam Theatre, way back in 1997 when the musical first debuted.\n\n\nSET LIST\n“Circle of Life”\n“They Live in You”\n“Can You Feel the Love Tonight”\n“Hakuna Matata”\n“Endless Night / Shadowland”\n“Circle of Life” (Reprise)\n\nMUSICIANS\n\nCAST\nL. Steven Taylor\nTshidi Manye\nBrandon A. McCall\nPearl Khwezi\nLindiwe Dlamini\nMduduzi Madela\nS’bu Ngema\n \nMUSICIANS\nJim Abbott: keyboard, guitar\nAnders Bostrom: flutes\nDavid Kuhn: bass\nRolando Morales-Matos: percussion\nJuan Carlito Mendoza: drums\n\nMusic Arrangements\nJim Abbott\n \nThe Lion King Broadway Resident Director\nRufus Bonds Jr.\n\nTINY DESK TEAM\nProducer/Audio Engineer: Josh Rogosin \nDirector/Editor: Kara Frame \nCreative Director: Bob Boilen \nSeries Producer: Bobby Carter\nVideographers: Kara Frame, Maia Stern, Joshua Bryant, Sofia Seidel\nAnimator: Jackie Lay\nAudio Assistant: Natasha Branch\nProduction Assistant: Jill Britton\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #thelionking", "link": "https://www.youtube.com/watch?v=cx67TnQrqcg", "date_published": "2022-11-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Ezra Collective: Tiny Desk Concert", "description": "Suraya Mohamed | November 10, 2022\nThe day before The Ezra Collective’s Tiny Desk concert, the band members practiced for hours at a nearby community music space and the next morning, they walked in the door giddy and ready to go. The warm-up was good, but once we started to record, a crazy intensity and energy spilled out into the room. They were fierce and fun and all of their solos were on fire. \n\nThe band makes amazing jazz music and mixes it with a fusion of other genres like Afrobeat, hip-hop and grime. The London-based band was supposed to play this Tiny Desk concert in 2020, but then, as bandleader and phenom drummer Femi Koleoso put it, “the world collapsed.” Here it is now, rockin’ hard with the highest level of musicianship and technique.\n\nBefore coming to NPR, Koleoso had just finished a world tour with the group Gorillaz. He met up with his bandmates in Washington, D.C., to play this concert and kick off promotion for the band’s newly released sophomore album, Where I’m Meant To Be. He explained on Instagram that he loves the album title because it's vague and specific at the same time, just like his band, a multifaceted complement of contrasting attributes. The first two songs in this set are from that new album while the last, “Chapter 7,” is from the group’s 2016 EP. Throughout the set, watch how keyboard player Joe Armon-Jones barely stays on his seat and hear how the audience couldn’t keep quiet. After the concert, the spirit of the music lingered for a long time and the day ended with pictures, hugs and plenty of smiles. \n\nSET LIST\n“Victory Dance”\n“Welcome To My World”\n“Chapter 7” \n\nMUSICIANS\nFemi Koleoso: drums\nTJ Koleoso: bass\nJoe Armon-Jones: keys\nJames Mollison: saxophone\nIfe Ogunjobi: trumpet\n\nTINY DESK TEAM\nProducer: Suraya Mohamed\nDirector/Editor: Joshua Bryant\nAudio Engineer: Josh Rogosin\nCreative Director: Bob Boilen\nSeries Producer: Bobby Carter\nVideographers: Joshua Bryant, Kara Frame, Maia Stern, Sofia Seidel \nAudio Assistant: Andie Huether\nProduction Assistant: Jill Britton\nTiny Desk Team: Marissa Lorusso, Hazel Cills, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #ezracollective", "link": "https://www.youtube.com/watch?v=eAzClkn3zYw", "date_published": "2022-11-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]