[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best PlayStation Games Of 2022", "description": "It’s the end of the year, so it’s time to take a look back on the best of the best from the last 12 months. Here are the five best PlayStation games of 2022 as selected by GameSpot, as well as five honorable mentions that you can’t afford to miss.", "link": "https://www.youtube.com/watch?v=cnlnmxT2dOA", "date_published": "2022-12-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Hogwarts Legacy Advanced Combat Gameplay in Dark Arts Battle Arena", "description": "Get a glimpse of the Dark Arts Battle Arena in Hogwarts Legacy where we get a taste of what advanced combat looks like in the game. We learned more about the new arena and gameplay mechanics in the latest Hogwarts Legacy Gameplay Showcase II.\n\n#hogwartslegacy #gaming \n\n0:00 Introduction\n0:45 Dark Arts Arena Gameplay\n4:33 Fighting a Mountain Troll", "link": "https://www.youtube.com/watch?v=PZUD7x_KN2Y", "date_published": "2022-12-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Hogwarts Legacy Flying on Broom and Onyx Hippogriff Gameplay", "description": "Check out some flight gameplay on the broom and also on the pre-order bonus Onyx Hippogriff during the latest Hogwarts Legacy Gameplay Showcase II.\n\n#hogwartslegacy #gameplay \n\n0:00 Intro\n0:27 Broom Flight Gameplay\n04:58 Onyx Hippogriff Gameplay", "link": "https://www.youtube.com/watch?v=cGbPpMDBbYc", "date_published": "2022-12-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Hogwarts Legacy Full Gameplay Showcase II", "description": "Join Game Director Alan Tew, Systems Designer Mekenzy Toner, Community Manager Chandler Wood, and special guest Community Host Ben Snow in this all new look at Hogwarts Legacy.  \n\nIn this gameplay showcase, our hosts will take you through a new look at broom flight and traversal, advanced combat, and an introduction to the Room of Requirement.\n\n0:00 Intro\n2:00 Broom Flight Gameplay\n6:28 Dark Onyx Hippogriff Gameplay\n13:47 Advanced Combat Gameplay\n21:31 Room of Requirement Gameplay\n\n\n#hogwartslegacy #gaming", "link": "https://www.youtube.com/watch?v=eOP5VZN9mgQ", "date_published": "2022-12-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Hogwarts Legacy's Pets, Homes, And Player Customization", "description": "The Room of Requirement is where players can customize their home, clothing and appearance, keep pets, brew potions, and discover the properties of new gear.", "link": "https://www.youtube.com/watch?v=IiDjfSTweEg", "date_published": "2022-12-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "How To Fix Witcher 3 Next Gen Launch Issues | GameSpot", "description": "The Witcher 3 launches in a messy state once again, PlayStation announces its December Plus Extra and Premium titles, and Unreal Tournament 3 is back.\n#Gaming #CDProjektRed #TheWitcher \n\nToday, we are all Poe Dameron learning the Emperor is back, because somehow, the Witcher 3’s technical issues have returned.\n\nWhen the game launched in 2015, there were several massive bugs plaguing players at the time that eventually got ironed out with patches and updates. Now that the game’s next gen update is out, it’s like we’re living 2015 all over again, as this new version of the game seems just as problem laden. \n\nFortunately, it seems as if you’re playing the update on console, like myself, you’re for the most part in the clear, although I have had some minor visual bugs like texture pop in and issues around the photo mode. But on PC, it’s a different story, wobbly framerates, strange HUD glitches, and outright crashes, affecting even those with the beefiest of rigs.\n\nFortunately on PC, it’s relatively easy to rollback to the previous version of the game. If you’re on Steam, all you need to do is right click on the game in your library, click on properties, then Betas, and select the classic beta branch. Some redditors suggest turning off some optional settings such as ray-tracing, before rolling back to see if that helps, specifically with framerate hitches.\n\nCD Projekt Red has officially stated that it is aware of the issues, that it is actively looking into them, and will be putting out another update as soon as possible.\n\nLike I said, if you’re playing on a console like the PlayStation 5, you should have a relatively bug free experience, but in case you want to give the game some time in an abundance of caution, new games are being added to PS Plus’ Extra and Premium tiers to keep you busy.\n\nAfter taking a year off, WWE’s 2K franchise returned in 2022 in mostly fighting form, with WWE 2K22, reemerging with a strong foundation and an overhauled gameplay system. However, PlayStation is slightly cheating calling this a December edition, as unlike the rest of the lineup that will be added to the two bonus ties of PS Plus on December 20, WWE 2K22 won’t be available there until January 3 2023.\n\nOn December 20, fans of the Far Cry franchise are in for a treat, as both Far Crys 5, Primal, and New Dawn will be coming to the service, as well as RGG Studios games Yakuza: Likea Dragon, Judgement, and Yakuza 6. \n\nRemember, these games are a part of PlayStation Plus’ Extra and Premium tiers. December games for its base Essential tier, which are available now, include Mass Effect: Legendary Edition, Biomutant, and Divine Knockout. Head to GameSpot dot com for the full list of Extra and Premium titles  \n\nIf you’re looking for something to play on PC, Epic Games has announced that its seminal arena shooter Unreal Tournament 3 is being rebranded as Unreal Tournament 3 X and will be releasing as a free to play shooter on platforms like Steam, the Epic Games Store, and GoG, with crosssave and play.", "link": "https://www.youtube.com/watch?v=GQuAZ_64S8M", "date_published": "2022-12-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Witcher 3: Wild Hunt Next-Gen Review", "description": "The Witcher 3’s latest update brings the modern classic to the PlayStation 5 and Xbox Series X|S with an impressive suite of enhancements.\n\n#gaming#gamespot #witcher3", "link": "https://www.youtube.com/watch?v=cphaOP6S5Qk", "date_published": "2022-12-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Wo Long: Fallen Dynasty Official Gameplay Trailer", "description": "Check out an action packed gameplay trailer for Wo Long: Fallen Dynasty! Wo Long: Fallen Dynasty is scheduled to come out in March 2023.", "link": "https://www.youtube.com/watch?v=9aa6jFsnRfg", "date_published": "2022-12-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fire Emblem Engage Goes Back To The Series' Roots", "description": "Fire Emblem Engage is shaping up to be a more focused entry in the long-running tactical JRPG series.\n\nFire Emblem Engage is Nintendo's storied tactical role playing series. This entry features a handful of returning characters from the franchise including Marth, Lucina, Sigurd, and Ike. These classic characters can fight along side you with the help of Emblem Rings.\n\nFire Emblem Engage hits the Nintendo Switch on January 20, 2023.\n\n#FireEmblemEngage #gaming #GameSpot", "link": "https://www.youtube.com/watch?v=CB4fQQB5xnk", "date_published": "2022-12-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Why Elden Ring Is GameSpot's Game Of The Year 2022", "description": "2022 has been an incredible year for video games, but one title rose above the others and was awarded Game of the Year by GameSpot staff. In this video, Tamoor Hussain, Jake Dekker, and Lucy James discuss why FromSoftware’s Elden Ring won the coveted Game of the Year award for 2022.\n\nIn the last 10 years of gaming, there have been few developers as influential as From Software. From the challenging gameplay of Demon's Souls, to the thoughtfully crafted worlds of Dark Souls, the captivating stories of Bloodborne, or the precise gameplay of Sekiro, each of its games has impacted us in deep and meaningful ways.\n\nElden Ring is a game that builds upon all the previous games and surprises us with new jaw-dropping vistas and stunning architecture, presenting you with hardier challenges and rewarding you with brand new items and gear. Each subsequent playthrough of Elden Ring continues to give, allowing players to experience questlines and find characters that they might have missed, while developing a deeper understanding of the narrative driving the struggle in the Lands Between.\n\nIn Tamoor Hussain’s review, he said Elden Ring was contrariant in almost every way, and its commitment to design by subtraction placed the responsibility of charting their journey in the hands of the player. All these months later, the impact of that has not lessened. He previously said Elden Ring stands head and shoulders above other open-world titles, and as bold as that statement is, he believes it even more strongly today. With Elden Ring, From Software has raised the bar for open-world games by redefining its design-philosophies and it showcases that the studio will continue to remain as influential in the years to come.\n\n#eldenring #gameoftheyear #gamespot", "link": "https://www.youtube.com/watch?v=s39xj7eaJdY", "date_published": "2022-12-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xbox Will Allow Call of Duty on PS Plus To Push Activision Deal Through | GameSpot News", "description": "Microsoft is willing to allow CoD on PS Plus, PlayStation Wrap-Up 2022 is here, and several end of year game deals.\n#Gaming #CallOfDuty #PSPlus \n\nMicrosoft is trying to sweeten the deal with PlayStation to get its Activision-Blizzard Deal through by allowing its competitor to put Call of Duty on PlayStation Plus if the megablockbuster franchise were to fall under its purview.\n\nThis news from Bloomberg comes after the acquisition has hit several major roadblocks, including a lawsuit against the Xbox manufacturer by the Federal Trade Commission itself. So far, Sony’s effort to make it appear that Microsoft would have a monopoly on video games if the deal were to happen seems to be working, telling anyone that will listen.\n\nSeriously, I heard Jim Ryan is just going door to door now in a grassroots campaign.\n\n*phone beeps*\n\nHang on one second. Gotta respond to this,\n\n*receives text message from Devante as Jim Ryan trying to talk to me about Activision Deal*\n\nNevermind. It was just spam. Anyway, Microsoft has made some unprecedented announcements and deals to make it clear that they don’t want Call of Duty to be an exclusive franchise, including offering both PlayStation and Nintendo 10 year deals to put the franchise on their consoles, with the cherry on top now revealed that PlayStation could put the series on its own subscription service.\n\nAs of this recording, reports state that PlayStation has yet to take either offer in its negotiations with Microsoft.\n\nIf you’re wondering how the fallout of this deal will affect you, it might help to know just how much Call of Duty you currently play on PlayStation, and thanks to an end of year stat tracker, you can!\n\nThe PlayStation 2022 Wrap-Up lets anyone on PS4 or PS5 access their highlights from the past year, which includes number of games played, total hours played, number of trophies earned, and number of PlayStation Plus monthly games downloaded. These stats will continue to track through the end of 2022, so whatever figures you see today could change before the start of the new year.\n\nUsers who complete all sections of the Wrap-Up will get a voucher code to redeem an Astro Bot avatar. There are six in all, and they will be themed around your personal stats. Codes can be redeemed by others, so Sony is encouraging users to share with friends. You see that code on your screen that I didn’t blur out? I didn’t have to, cus anyone commenting can use it to claim the Astro Bot x God of War avatar!\n\nSo in total, I spent a grand total of 241 hours playing my PS5 this year, with a whopping 5 of those hours being spent online. And zero hours were spent playing Call of Duty there. Sorry Sony, your double XP incentives were enticing, but I can’t be caught playing CoD on a DualSense when I own an Xbox and an Elite Series 2 controller.", "link": "https://www.youtube.com/watch?v=GSxTgFR4wBI", "date_published": "2022-12-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]