[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Mysterious Arenas Unlocked By Modders | GameSpot News", "description": "Elden Ring might get colosseum based DLC, Halo Infinite Co-Op gets delayed again, and Forspoken delayed to October. \n\nRecently, several modders have finally found their way past the locked doors and explored these restricted locations. Videos like this one from YouTuber Garden of Eyes show that these buildings are far from empty and may not have just been cut content. In fact, each area’s level of detail has led many to speculate about what these colosseums could be used for. Some guesses across social media include: challenges, special boss fights, and a PvP arena.\n\nThe news comes via a new Halo Infinite development update, where developer 343 Industries has broken down current high-priority issues affecting the game, what fans can expect in Season 2, and updates on co-op and Forge. Clever fans did find a way to glitch their way into Halo Infinite co-op shortly after the game's launch, even if doing so risked corrupting the game's save data and it was more than a little buggy.\n\nSquare Enix and Luminous Productions announced that Forspoken has been delayed to October 11. It was originally set to launch on May 25. Forspoken follows a young woman named Frey Holland from New York City who is transported to Athia, a mystical and fantastical world where she must find her way home. Forspoken's original release date of May 25 was revealed during The Game Awards back in December.\n\nSTAMPS\n00:00 - Intro\n00:07 - Elden Ring\n01:10 - Halo Co-op\n02:32 - Forspoken", "link": "https://www.youtube.com/watch?v=D86F_f3vbMY", "date_published": "2022-03-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "GTA V on PS5 & Xbox Series X|S Price Revealed | GameSpot News", "description": "GTA V next-gen prices have been released, PlayStation State of Play is coming March 9, and a Dead Space Remake stream is coming March 11. \n\nPrices of Grand Theft Auto V's PS5 and Xbox Series X|S versions have been revealed and both platforms have discounts that will last until June 14. Unfortunately, existing owners of GTA V will not get a free upgrade when the new versions release on March 15. \n\nSony has revealed the next PlayStation State of Play will take place on March 9. According to the announcement, the event will run for about 20 minutes and will mainly focus on games from Sony's Japanese publishing partners.\n\nThere will also be a stream for the upcoming Dead Space remake on March 11. According to developer Motive Studios, the event will offer fans early looks at development and what goes into the remake of a game.\" The stream’s title is “The Sound Of Fear Reimagined. Audio Developer Livestream”, so it seems like it’ll be heavier on what you’ll hear in the game instead of what you’ll see.   \n\nSTAMPS\n00:00 - Intro\n00:09 - GTA V\n01:20 - State of Play\n02:21 - Dead Space Remake", "link": "https://www.youtube.com/watch?v=fCswHMStfJI", "date_published": "2022-03-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Assassin’s Creed Valhalla: Dawn of Ragnarök - Everything To Know", "description": "The latest from Ubisoft Sofia, Dawn of Ragnarök is Assassin’s Creed Valhalla’s third major piece of story DLC. However, unlike The Siege of Paris or Wrath of the Druids, this features a longer story and new gameplay mechanics. Here’s everything you need to know about Assassin’s Creed Valhalla: Dawn of Ragnarok.\n\nDawn Of Ragnarök is a 35-hour adventure that makes some massive changes and additions to the base game's formula, putting you in full control of a Norse god and their mythical abilities. Controlling Odin throughout your journey into one of the most dangerous areas of Valhalla is meant as endgame content, though newer players can receive a temporary power and equipment boost if they want to play it earlier.\n\nAssassin's Creed Valhalla: Dawn of Ragnarök releases for PS4, PS5, Xbox One, Xbox Series X|C, and PC on March 10.\n\nSTAMPS\n00:00 - Intro\n00:32 - Plot \n02:39 - Setting\n03:22 - Gameplay\n06:03 - Development Team \n06:31 - Platforms\n\n#AssassinsCreedValhalla #DawnofRagnarok", "link": "https://www.youtube.com/watch?v=u0iHKksWXyk", "date_published": "2022-03-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]