[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Patricia Kopatchinskaja: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nTom Huizenga | March 8, 2022\nViolinist Patricia Kopatchinskaja and pianist Joonas Ahonen, like most of us right now, are concerned about the Russian invasion of Ukraine. Kopatchinskaja hails from Moldova, which shares a border with Ukraine and declared independence from the Soviet Union in 1991. Ahonen is from Finland, which borders Russia in the east and was once under the Russian Empire until the 1917 Revolution.     \n \n“We are outraged,” the violinist says. And the music the two have chosen to play, in her Vienna apartment, is appropriate in both its bold surface features and deeper connections. The two movements from Beethoven’s Violin Sonata No. 7 have never sounded more fiercely provocative. No dainty singing line in the scherzo for Kopatchinskaja; her Beethoven cries out with insistence. And the finale finds Ahonen’s piano explosive in its urgency. Beethoven, Kopatchinskaja reminds us, was a supporter of human rights and a defier of despotism. They follow with rarely heard, arresting music by George Antheil, a Trenton, N.J. native and Beethoven devotee, who triumphed in Europe before settling in Hollywood in the 1930s. His Violin Sonata No. 1, with its wailing blocks of sound and mechanical rhythms, defines his 1920s style which has been compared to cubism in painting.\n\nAt age 44, Kopatchinskaja is considered one of today’s most courageous, forward-thinking violinists. Her restless spirit has led her in diverse musical directions ever since she was a youngster. “My first teacher was the rain,” she wrote in a piece for The Strad. “I listened to the drops. They were the first short, round notes in my childhood imagination.” Thankfully, in this Tiny Desk (home) concert, she allows us to eavesdrop on her teeming creativity.\n \nSET LIST\nBeethoven: Violin Sonata No. 7 in C minor: III. Scherzo\nBeethoven: Violin Sonata No. 7 in C minor: IV. Finale. Allegro.\nAntheil: Violin Sonata No. 1: IV. Presto\n\nMUSICIANS\nPatricia Kopatchinskaja: violin\nJoonas Ahonen: piano\n\n\nCREDITS\nVideo: Patricia Kopatchinskaja\nAudio: Joonas Ahonen\n\n\nTINY DESK TEAM\nProducer: Tom Huizenga\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Joshua Bryant, Maia Stern, Ashley Pointer\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #patriciakopatchinskaja", "link": "https://www.youtube.com/watch?v=L1l69tA5oCs", "date_published": "2022-03-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]