[{"source": "https://www.theguardian.com/rss", "title": "Ageing reversal: scientists rejuvenate tissues in middle-aged mice", "description": "<p>Prospect of medical therapies that rewind clock for humans edges a little closer</p><p>The prospect of medical therapies that rewind the clock on the ageing process has edged a little closer after scientists safely rejuvenated tissues in middle-aged mice.</p><p>Researchers in the US treated healthy animals with a form of gene therapy that refreshed older cells, making the animals more youthful according to biological markers that are used to measure the effects of ageing.</p> <a href=\"https://www.theguardian.com/science/2022/mar/07/ageing-reversal-scientists-rejuvenate-tissues-in-middle-aged-mice\">Continue reading...</a>", "link": "https://www.theguardian.com/science/2022/mar/07/ageing-reversal-scientists-rejuvenate-tissues-in-middle-aged-mice", "date_published": "2022-03-07 23:57:02+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "US man jailed for using coronavirus relief loan to buy $57,000 Pokémon card", "description": "<ul><li>Vinath Oudomsine forfeits trading card as part of plea deal</li><li>Oudosmine given three years after pleading guilty to wire fraud</li></ul><p>A Georgia man was sentenced to three years in prison after illegally obtaining a coronavirus relief loan and using more than $57,000 of the money to buy a collectible Pokémon card, authorities said on Monday.</p><p>Vinath Oudomsine of Dublin, Georgia, agreed to forfeit the costly trading card, which featured the Pokémon character Charizard, as part of a plea agreement, said David Estes, the acting US attorney David Estes of the southern district of Georgia, in a news release.</p> <a href=\"https://www.theguardian.com/us-news/2022/mar/07/pokemon-coronavirus-relief-loan-scam-georgia\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/mar/07/pokemon-coronavirus-relief-loan-scam-georgia", "date_published": "2022-03-07 23:55:14+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Canada’s wild pigs threaten ‘absolute destruction’ if left unchecked", "description": "<p>Expert says pigs are ‘worst invasive wild mammal on the planet’, carrying diseases, destroying crops and contaminating water</p><p>The Canadian city of Edmonton may soon be hogtied with a problem that it won’t be able to barbecue its way out of.</p><p>Wild pigs have been spreading across central Alberta’s prairies and if left unchecked, could soon find themselves in the river valley of Edmonton. According to Ryan Brook, a University of Saskatchewan professor studying the pigs, the creatures are an “ecological trainwreck” and would cause “absolute destruction” if they make their way to the river valley, which is abundant in water and forest cover.</p> <a href=\"https://www.theguardian.com/world/2022/mar/07/wild-pigs-feared-absolute-destruction-canada\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/mar/07/wild-pigs-feared-absolute-destruction-canada", "date_published": "2022-03-07 23:49:55+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Just 300 Ukrainian refugees granted visas to come to the UK", "description": "<p>Labour criticises ‘shockingly low’ total as people attempting to flee war complain of technical difficulties with system</p><ul><li><a href=\"https://www.theguardian.com/world/live/2022/mar/06/russia-ukraine-war-biden-and-zelenskiy-discuss-more-support-for-ukraine-as-visa-mastercard-pull-out-of-russia-live\">Russia-Ukraine war: live updates</a></li></ul><p>The number of Ukrainian refugees granted visas to come to the UK under the new family scheme has risen from about 50 to 300, the government has announced, leading Labour to criticise the “shockingly low” figure.</p><p>On Monday, the Home Office said a<strong> </strong>total of 17,700 applications had been started, adding that about 9,000 people had not yet completed the application. Some applicants said it was hard to complete applications because the visa appointment website crashed midway through. </p> <a href=\"https://www.theguardian.com/world/2022/mar/07/ukrainians-hampered-by-bureaucracy-from-reaching-safety-in-uk\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/mar/07/ukrainians-hampered-by-bureaucracy-from-reaching-safety-in-uk", "date_published": "2022-03-07 23:42:24+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Guardian writers win three prizes at 2021 Sports Journalism Awards", "description": "<ul><li>Jonathan Liew is named SJA’s sports columnist of the year</li><li>Sean Ingle and Ali Martin also honoured at award ceremony</li></ul><p>Three Guardian writers have won British Sports Journalism Awards at Monday’s ceremony. <strong>Jonathan Liew</strong> was named sports columnist of the year, <strong>Sean Ingle</strong> won the specialist correspondent of the year award and <strong>Ali Martin</strong> was named cricket journalist of the year.</p><p><strong>Andy Bull</strong> received the silver award and <strong>Donald McRae</strong> the bronze award in the sports feature writer category, with Jonathan Liew also shortlisted. Donald McRae also took home a shared silver medal in the specialist correspondent category. Sean Ingle was also on the shortlist for the live reporting award, while <strong>David Hytner</strong> was shortlisted for football journalist and <strong>Michael Aylwin</strong> for rugby journalist.</p> <a href=\"https://www.theguardian.com/sport/2022/mar/07/the-guardian-sports-journalism-awards\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/mar/07/the-guardian-sports-journalism-awards", "date_published": "2022-03-07 22:53:39+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Whitechapel: 20 fire engines called to blaze in block of flats in east London", "description": "<p>Firefighters from multiple brigades mobilised after blaze broke out on 17th floor of building in Whitechapel</p><p>Twenty fire engines and 125 firefighters were called to a fire at a block of flats on Whitechapel High Street on Monday.</p><p>Crews tackled a fire on the 17th floor of the building. The London fire brigade mobilised its <a href=\"https://www.london-fire.gov.uk/news/2021-news/november/london-fire-brigade-to-bring-in-uk-s-tallest-aerial-ladder-into-operational-use/\" title=\"London Fire Brigade to bring in UK’s tallest aerial ladder into operational use\">64-metre ladder</a> for the incident and said its control officers took more than 50 calls about the blaze.</p> <a href=\"https://www.theguardian.com/uk-news/2022/mar/07/fifteen-fire-engines-called-to-fire-in-block-of-flats-in-east-london\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/mar/07/fifteen-fire-engines-called-to-fire-in-block-of-flats-in-east-london", "date_published": "2022-03-07 22:51:29+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Labour to test Tories with snap vote on national insurance rise", "description": "<p>Opposition move is intended to expose growing unease among Conservatives over cost of living</p><p>Labour will spring a snap vote on cancelling the increase in national insurance contributions (NICs) on Tuesday, warning it will cost the average private sector worker £410 a year, as the opposition tries to exploit Tory divisions.</p><p>In new analysis of sluggish wages and the national insurance rise, planned for April, Labour said private sector employees would face a “double whammy”, with employers also passing on the cost of their increased NICs.</p> <a href=\"https://www.theguardian.com/politics/2022/mar/07/labour-to-test-tories-with-snap-vote-on-national-insurance-rise\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/mar/07/labour-to-test-tories-with-snap-vote-on-national-insurance-rise", "date_published": "2022-03-07 22:30:54+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Police officers should work under ‘licence’ to restore trust – report for England and Wales", "description": "<p>Review contains 56 recommendations urging reforms to culture, training and structure</p><p>Police officers should work under a licence that must be renewed every five years and be subject to strict conditions to boost confidence in policing, an independent review has recommended.</p><p>The Strategic Review of Policing in England and Wales, chaired by Sir Michael Barber and carried out by the Police Foundation thinktank, contains 56 recommendations urging radical reform to police culture, skills and training, and organisational structure.</p> <a href=\"https://www.theguardian.com/uk-news/2022/mar/07/police-officers-should-work-under-licence-to-restore-trust-report-for-england-and-wales\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/mar/07/police-officers-should-work-under-licence-to-restore-trust-report-for-england-and-wales", "date_published": "2022-03-07 22:30:54+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Harry Kane leads Tottenham thrashing of Frank Lampard’s inept Everton", "description": "<p>The game was only a few minutes old when Seamus Coleman lifted the ball into Tottenham’s area. As it dropped Richarlison pulled back his favoured left foot, swung and, to joyful cheers from the home support, missed completely. And that, right there, was the night in a nutshell: glum for one side, glee for the other.</p><p>Frank Lampard’s decisions to bring on first the Ukrainian Vitalii Mykolenko and then the former Tottenham midfielder Dele Alli were greeted with the unique generosity of a crowd that cheered five unanswered home goals, and that was as positive as the evening got for a coach whose three away games at Everton have now been lost by an aggregate score of 10-1. In all they have not won a Premier League away game since August, part of a run of three wins in their first four since revealed to be the falsest of dawns. By the time they get another chance it will be April.</p> <a href=\"https://www.theguardian.com/football/2022/mar/07/tottenham-everton-premier-league-match-report\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/mar/07/tottenham-everton-premier-league-match-report", "date_published": "2022-03-07 22:04:07+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Jones insists Ireland are favourites for Six Nations showdown in England", "description": "<ul><li>Both teams need a victory to remain in hunt for title</li><li>Eddie Jones: ‘They are the most cohesive side in the world’</li></ul><p>Eddie Jones has billed Ireland as favourites for Saturday’s Six Nations showdown at Twickenham, pointing to how they are the most “cohesive” team in the world and highlighting how England’s player release agreement differs from their rivals.</p><p>England go into the match third in the table, a point and a place behind Ireland. Defeat would all but end their hopes of topping the pile, with a final-round trip to Paris to come. England have selection headaches with Alex Dombrandt testing positive for Covid-19 last week and not due to train before Thursday and though Sam Underhill is back in the squad, Jones said he was “a little bit off his best”. Tom Curry was, however, able to train on Monday after he was replaced at half-time against Wales with a head injury.</p> <a href=\"https://www.theguardian.com/sport/2022/mar/07/eddie-jones-insists-ireland-are-favourites-for-six-nations-showdown-against-england\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/mar/07/eddie-jones-insists-ireland-are-favourites-for-six-nations-showdown-against-england", "date_published": "2022-03-07 22:00:53+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Life and Death in the Warehouse review – the terrible true cost of online shopping", "description": "<p>This shocking drama uses the real experience of hundreds of warehouse ‘pickers’ to tell the grim story of those who enable our internet shopping habits</p><p>It may not turn you full communist by the end of its single hour, but it’s hard to imagine that new screenwriter Helen Black’s punchy fact-based drama Life and Death in the Warehouse (BBC Three) won’t help shift every viewer’s individual dial to walk to an independent shop next time they need something. It’s a grim story of the behind-the-scenes work that provides us consumers with a life of unparalleled convenience.</p><p>Our stage is set in an Amazonian warehouse. I use the adjective to mean “massive” only, you understand. Although the online retail giant Amazon has been accused of and <a href=\"https://www.theguardian.com/business/2018/may/31/amazon-accused-of-treating-uk-warehouse-staff-like-robots\">associated with many of the practices</a> depicted in Life and Death’s tale of abused and exploited workers, it has rejected all such claims and its name – heaven forfend! – is never mentioned here. A series of opening captions says only that the recent boom in online shopping has created an invisible army of about 1 million warehouse workers, hundreds of whose experiences at various places have been used as the basis for the drama. “Some of these companies you will know, others you won’t have heard of,” it explains. Between the captions, scenes of a woman miscarrying in a toilet cubicle play out, before we move back in time to where this emblematic catastrophe began.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/mar/07/life-and-death-in-the-warehouse-review-the-terrible-true-cost-of-online-shopping\">Continue reading...</a>", "link": "https://www.theguardian.com/tv-and-radio/2022/mar/07/life-and-death-in-the-warehouse-review-the-terrible-true-cost-of-online-shopping", "date_published": "2022-03-07 22:00:53+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Oligarchs selling UK property to avoid new register may have to declare details", "description": "<p>MPs vow to toughen up economic crime bill rushed through House of Commons on Monday</p><p>Oligarchs or kleptocrats who try to sell off property in order to avoid it being listed in a new public register may be forced to declare their details upon sale, a minister has said, as MPs vowed to toughen up a new bill targeting hidden wealth.</p><p>Ministers have promised sweeping changes to toughen up <a href=\"https://www.theguardian.com/politics/2022/feb/28/russian-oligarchs-in-uk-face-new-laws-tackling-dirty-money\">the economic crime bill</a>, which was rushed through the House of Commons on Monday, as MPs also demanded the closing of loopholes allowing the false reporting of assets.</p> <a href=\"https://www.theguardian.com/uk-news/2022/mar/07/oligarchs-selling-uk-property-to-avoid-new-register-may-have-to-declare-details\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/mar/07/oligarchs-selling-uk-property-to-avoid-new-register-may-have-to-declare-details", "date_published": "2022-03-07 21:54:15+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Wall Street suffers biggest slide in more than a year as oil prices surge", "description": "<ul><li>S&amp;P, Dow Jones and Nasdaq see large one-day drops</li><li>Barrel of US oil leaps to $130 overnight amid Ukraine war</li></ul><p>Wall Street had its biggest drop in more than a year Monday as another leap for oil prices threatened to squeeze inflation’s grip on the global economy.</p><p>The S&amp;P 500 fell 3%, its biggest decline in 16 months, after a barrel of US oil surged to $130 overnight on the possibility the US could bar imports from Russia. Stocks around the world also fell earlier in the day, taking their cue from oil’s movements, though their losses moderated as crude receded toward $120 per barrel.</p> <a href=\"https://www.theguardian.com/business/2022/mar/07/wall-street-slide-stock-market-oil-prices-surge\">Continue reading...</a>", "link": "https://www.theguardian.com/business/2022/mar/07/wall-street-slide-stock-market-oil-prices-surge", "date_published": "2022-03-07 21:48:26+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Ofsted downgrades American School in London over focus on social justice", "description": "<p>Inspectors were sent in after parents complained of ‘woke agenda’ at prestigious day school</p><p>One of London’s leading independent day schools has been downgraded by Ofsted after inspectors criticised some of its teaching for focusing more on social justice than subject knowledge, and a culture where “alternative opinions are not felt welcome”.</p><p>The American School in London (ASL), which charges annual fees of £32,650 for older pupils, was previously rated “outstanding” but slipped two grades to “requires improvement” – just above “inadequate” – after inspection in December.</p> <a href=\"https://www.theguardian.com/education/2022/mar/07/ofsted-downgrades-american-school-in-london-over-focus-on-social-justice\">Continue reading...</a>", "link": "https://www.theguardian.com/education/2022/mar/07/ofsted-downgrades-american-school-in-london-over-focus-on-social-justice", "date_published": "2022-03-07 21:14:34+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Manchester United being bad is now its own self-sustaining media industry | Barney Ronay", "description": "<p>A poor team, poorly run with no direction. Even pundits are struggling to stay fascinated by a club’s perpetual non-success</p><p>“What if some day or night a demon were to steal after you into your loneliest loneliness and say to you: ‘This life as you now live it, you will have to live once more and innumerable times more; and there will be nothing new in it, but every pain and every joy and every thought and sigh and everything unutterably small or great in your life will have to return to you … Would you not throw yourself down and gnash your teeth and curse the demon who spoke thus?”</p><p>Yes, I would. I would probably do that. It becomes easier to say this with certainty, to agree with Friedrich Nietzsche’s theory of eternal recurrence – which might previously have seemed a little lateral, lacking in, say, the directness that makes the Premier League so special – having watched Sky Sports coverage of Sunday’s Manchester derby; and having seen Dave Jones turn to Roy Keane at the final whistle, with a sense even here of basic existence-fatigue and ask: “Roy. How would you sum up that half?”</p> <a href=\"https://www.theguardian.com/football/blog/2022/mar/07/manchester-united-derby-reaction-roy-keane-media\">Continue reading...</a>", "link": "https://www.theguardian.com/football/blog/2022/mar/07/manchester-united-derby-reaction-roy-keane-media", "date_published": "2022-03-07 21:00:52+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Shane Warne died as he lived, leaving a hurricane of emotions and memories | Jonathan Liew", "description": "<p>He achieved greatness but never pretended to be perfect, and perhaps we all loved him a little bit more because of that</p><p>There is a scene in the 2001 Channel 4 documentary Shane Warne’s English Summer in which the Australian leg-spinner is shown in the Hampshire dressing room a few minutes before play is about to begin, wolfing down an enormous plate of chips. The interviewer suggests that perhaps this is not the nutritional regimen normally associated with the world’s top athletes.</p><p>“Well,” Warne replies through a mouthful of ketchup and deep-fried matter, “if I don’t have my chips, I’m not happy. And if I’m not happy, I don’t bowl well. A piece of lettuce or fruit doesn’t make you feel good, does it?”</p> <a href=\"https://www.theguardian.com/sport/blog/2022/mar/07/shane-warne-cricket-tribute-emotions-and-memories\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/blog/2022/mar/07/shane-warne-cricket-tribute-emotions-and-memories", "date_published": "2022-03-07 21:00:52+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Tonight With Andrew Marr review – no F-bombs here! Bland first LBC show fails to ruffle any feathers", "description": "<p>He promised he was leaving the BBC to get his voice back … but this opening night show proves how far Marr has to come if he wants to be a shock jock</p><p>Ten weeks after ending his 16-year BBC One Sunday TV show with the words, “You stay classy, San Diego” – the sign-off of caricature presenter Ron Burgundy in the movie Anchorman – Andrew Marr signed on to his new show on LBC by hailing “a day of horror in Ukraine and growing unease here in Britain.”</p><p>Anchorman fans will recall that Burgundy is fooled into reading a banned profanity from his autocue, and Marr’s publicity interviews might have led us to believe that he planned to deliberately hurl expletives at his LBC audience. The show, he promised, would “ruffle feathers”; he had left the BBC to “get his voice back” and “speak his mind.”</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/mar/07/tonight-with-andrew-marr-review-no-f-bombs-here-bland-first-lbc-show-fails-to-ruffle-any-feathers\">Continue reading...</a>", "link": "https://www.theguardian.com/tv-and-radio/2022/mar/07/tonight-with-andrew-marr-review-no-f-bombs-here-bland-first-lbc-show-fails-to-ruffle-any-feathers", "date_published": "2022-03-07 20:54:35+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "UK government may have bought 3bn PPE gloves made by forced labour", "description": "<p>Department of Health and Social Care looking into allegations over purchases in first year of pandemic</p><p>Ministers may have bought 3bn protective gloves that were manufactured using modern slavery in the first year of the pandemic, MPs have been told. </p><p>On Monday, officials from the Department of Health and Social Care told the public accounts committee they were investigating allegations that the gloves were produced by forced labour.</p> <a href=\"https://www.theguardian.com/world/2022/mar/07/uk-government-may-have-bought-3bn-ppe-gloves-made-by-forced-labour\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/mar/07/uk-government-may-have-bought-3bn-ppe-gloves-made-by-forced-labour", "date_published": "2022-03-07 20:46:02+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘Beyond understanding’: Odesa braced to see if Putin attacks city of such resonance for Russians", "description": "<p>Russian warships have been moving ominously in the sea between Odesa and Crimea. Each morning, Odesa’s remaining residents wake up and check their progress</p><p>The tourist cafes are behind barricades. The grand opera house is surrounded by a wall of sandbags. Tank traps block the approaches to the legendary Potemkin steps. Nobody in Odesa can quite believe that Vladimir Putin would <a href=\"https://www.theguardian.com/world/2022/mar/04/russia-ukraine-mykolaiv-odesa-push-kyiv-fighting\">launch an assault on this city</a>, a place bound to Russia by family, literary and cultural ties, a place of almost mythical resonance for many Russians.</p><p>But then, Putin’s armed forces have done lots of things in recent days that seemed unthinkable just two weeks ago.</p> <a href=\"https://www.theguardian.com/world/2022/mar/07/beyond-understanding-odesa-braced-to-see-if-putin-attacks-city-of-such-resonance-for-russians\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/mar/07/beyond-understanding-odesa-braced-to-see-if-putin-attacks-city-of-such-resonance-for-russians", "date_published": "2022-03-07 20:40:12+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Biden criticized over report of planned Saudi trip to discuss global oil supply", "description": "<p>White House refuses to confirm that top advisers considering spring Saudi Arabia visit to propose increase in oil exports</p><p>Joe Biden attracted criticism from both progressives and Republicans after a report indicated the White House was planning a visit to Saudi Arabia to discuss global oil supply.</p><p>Axios <a href=\"https://www.axios.com/biden-saudi-trip-oil-b7a91070-8045-4155-9120-a35d59fd7603.html\">reported on Sunday</a> that Biden’s senior advisers were considering a spring trip to Saudi Arabia in an effort to improve relations and to propose a potential increase in oil exports.</p> <a href=\"https://www.theguardian.com/us-news/2022/mar/07/joe-biden-saudi-arabia-oil-supply-criticism\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/mar/07/joe-biden-saudi-arabia-oil-supply-criticism", "date_published": "2022-03-07 20:35:38+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Man found guilty of murder after dragging victim under car in Surrey", "description": "<p>Martin Eastwood, 22, used a stolen Ford S Max to kill Liam Dent after confrontation outside pub</p><p>A driver<strong> </strong>has been found guilty of murdering a man by hitting him with a car and dragging him for more than half a mile. Martin Eastwood, 22, used a stolen Ford S Max to kill Liam Dent in the early hours of 26 July 2019 after a confrontation outside a pub in Chessington, Surrey.</p><p>The jury heard Eastwood had convictions for two previous offences involving a car, including an incident in September 2018, when he drove a stolen vehicle at a cyclist, knocking him to the ground and causing him multiple fractures. Then in April 2019, he drove a stolen vehicle at a man, knocking him to the ground and causing him abrasions.</p> <a href=\"https://www.theguardian.com/uk-news/2022/mar/07/man-found-guilty-of-after-dragging-victim-under-car-in-surrey\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/mar/07/man-found-guilty-of-after-dragging-victim-under-car-in-surrey", "date_published": "2022-03-07 20:27:15+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Russia trying to recruit Syrians to fight in Ukraine, says Pentagon", "description": "<p>US defence official says it is ‘noteworthy that Putin believes he needs foreign fighters’</p><p>Russia has been trying to recruit Syrians to fight in Ukraine to bolster <a href=\"https://www.theguardian.com/commentisfree/2022/mar/07/the-guardian-view-on-putins-war-in-ukraine-moscows-on-the-losing-side\">Moscow’s flagging invasion</a>, according to the Pentagon.</p><p>A senior US defence official said it was unclear how many Syrians Vladimir Putin is seeking to recruit, but said “we find it noteworthy that he believes he needs to rely on foreign fighters”. The official added there was no evidence of Syrian fighters having arrived in Ukraine so far.</p> <a href=\"https://www.theguardian.com/world/2022/mar/07/russia-trying-to-recruit-syrians-to-fight-in-ukraine-says-pentagon\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/mar/07/russia-trying-to-recruit-syrians-to-fight-in-ukraine-says-pentagon", "date_published": "2022-03-07 20:16:20+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Volodymyr Zelenskiy to address British MPs via video link on Tuesday", "description": "<p>Ukraine’s president is expected to plead for more arms and repeat call for no-fly zone over Ukraine</p><ul><li><a href=\"https://www.theguardian.com/world/live/2022/mar/06/russia-ukraine-war-biden-and-zelenskiy-discuss-more-support-for-ukraine-as-visa-mastercard-pull-out-of-russia-live\">Russia-Ukraine war: live updates</a></li><li><a href=\"https://www.theguardian.com/world/2022/mar/07/ukraine-war-russia-what-we-know-so-far-day-12-russian-invasion\">Ukraine war: what we know on day 12</a></li></ul><p>Ukraine’s president, Volodymyr Zelenskiy, will address UK MPs via video link from Kyiv on Tuesday afternoon, when he is expected to plead for more arms and to repeat a call for a no-fly zone even though it has been rejected by Nato.</p><p>In a first, the leader’s speech will be broadcast direct into the Commons chamber with formal business suspended so that MPs can listen in with the help of simultaneous translation provided over headsets at 5pm.</p> <a href=\"https://www.theguardian.com/world/2022/mar/07/volodymyr-zelenskiy-to-address-mps-via-video-link-on-tuesday-ukraine\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/mar/07/volodymyr-zelenskiy-to-address-mps-via-video-link-on-tuesday-ukraine", "date_published": "2022-03-07 20:09:25+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘Hero’: Slovakians hail boy, 11, who travelled 700 miles alone from Ukraine", "description": "<p>Yulia Pisetskaya’s son had only a plastic bag, a passport and a phone number on his hand</p><ul><li><a href=\"https://www.theguardian.com/world/live/2022/mar/06/russia-ukraine-war-biden-and-zelenskiy-discuss-more-support-for-ukraine-as-visa-mastercard-pull-out-of-russia-live\">Russia-Ukraine war: live updates</a></li></ul><p>The mother of an 11-year-old boy from Ukraine who travelled for nearly 700 miles to Slovakia with just a plastic bag, a passport and a telephone number written on his hand has spoken of her relief at her son’s safe escape from Russian bombs.</p><p>Yulia Pisetskaya said she had put her son on a train to Slovakia from Zaporizhzhia, close to the nuclear plant that came under attack from Russian forces last week, out of desperation.</p> <a href=\"https://www.theguardian.com/world/2022/mar/07/mother-who-sent-son-11-on-train-out-of-ukraine-alone-thanks-slovaks\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/mar/07/mother-who-sent-son-11-on-train-out-of-ukraine-alone-thanks-slovaks", "date_published": "2022-03-07 20:05:49+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Flo & Joan review – crowd-pleasing merriment as singing sisters return", "description": "<p><strong>Bloomsbury theatre, London<br /></strong>The comic duo offer up another entertaining set as they track their journey through dating apps, heavy drinking and moments of mortification</p><p>Prompted by the <a href=\"https://www.theguardian.com/film/2018/nov/09/bros-after-the-screaming-stops-review\">much-discussed Bros documentary</a>, Flo &amp; Joan’s <a href=\"https://www.theguardian.com/stage/2020/jan/15/flo-joan-review-comedys-soho-theatre-london\">last show</a> fretted at the acrimonious end to which sibling musical partnerships must tend. This one looks through the other end of the telescope, at the prospect of these “singing spinster sisters” doomed to singledom and a 60-year co-dependency. That doesn’t seem such a grim fate given the fun that Flo, Joan (AKA Nicola and Rosie Dempsey) and their audience have across two hours of their touring set Sweet Release. If its new suite of comic songs isn’t quite as big-hitting as the 2019 vintage, this is another entertaining offer from the Dempseys, crowd-pleasing and well woven together.</p><p>The chat between songs feels looser, too. Nicola, on keyboard, is still taciturn. Rosie, on vocals and sometimes drums, is still dotty. But the dynamic feels less engineered to be awkward than in the past. What seems spontaneous may not be always be so, mind you, given how many casual asides are recycled as lyrics and punchlines later in the show. That brings a neat sense of structure to the evening, whose numbers track the duo’s journey through dating apps, moments of mortification, and – reviving <a href=\"https://www.youtube.com/watch?v=tTViy5WK-EY\">a back catalogue hit</a> – nights (and jobs) lost to heavy drinking.</p> <a href=\"https://www.theguardian.com/stage/2022/mar/07/flo-joan-sweet-release-review-bloomsbury-theatre-london\">Continue reading...</a>", "link": "https://www.theguardian.com/stage/2022/mar/07/flo-joan-sweet-release-review-bloomsbury-theatre-london", "date_published": "2022-03-07 20:00:51+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Boris Johnson’s six-point plan for Ukraine turns out to be six vague principles", "description": "<p>PM’s plan – already all but forgotten – resembled something a toddler might come up with for a school assembly</p><p>Over the weekend, we were told that Boris Johnson had a six-point plan with which he would lead the west to victory over Russia in Ukraine. However, on closer inspection – and on contact with reality – that plan didn’t seem to amount to much more than you would expect from a toddler who had been asked to come up with something for a primary school assembly to help other children understand the war. Or something that Gavin Williamson – make that <em>Sir</em> Gavin – might have dreamed up.</p><p>1: Get humanitarian aid to Ukraine and be nice to refugees. 2: Support Ukraine’s efforts to do whatever Ukraine wants to do. 3: Increase sanctions on Moscow – though not on anyone we quite like, even if they owe their billions to Vlad the Invader. 4: Tell Russia to shut up and go away. 5: Tell Russia to shut up and go away a bit louder if Russia hasn’t already shut up and gone away. 6: Try to ensure it never happens again.</p> <a href=\"https://www.theguardian.com/politics/2022/mar/07/boris-johnsons-six-point-plan-for-ukraine-turns-out-to-be-six-vague-principles\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/mar/07/boris-johnsons-six-point-plan-for-ukraine-turns-out-to-be-six-vague-principles", "date_published": "2022-03-07 19:59:16+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Joe Root insists he is ‘right man to take England forward’ before Windies series", "description": "<ul><li>England seek response to Ashes failure in Test series</li><li>Root admits his side have point to prove in Caribbean</li></ul><p>Joe Root admitted his England team have a point to prove in the Caribbean and reiterated his own belief at being the right man to lead in a Test series that could decide his fate as captain.</p><p>Speaking before Tuesday’s first Test against West Indies in Antigua – a match in which Durham’s Alex Lees will make his debut at opener and Jack Leach is likely to get the nod on a bare pitch – Root attempted to outline his vision of England’s so called “reset”.</p> <a href=\"https://www.theguardian.com/sport/2022/mar/07/joe-root-insists-england-have-point-to-prove-in-west-indies-with-captaincy-on-line\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/mar/07/joe-root-insists-england-have-point-to-prove-in-west-indies-with-captaincy-on-line", "date_published": "2022-03-07 19:57:58+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "What is the economic crime bill and how effective will it be?", "description": "<p>Legislation would make it harder for overseas property owners to hide assets – but they have six months’ grace</p><p>The economic crime bill, or to give its formal title, the economic crime (transparency and enforcement) bill, was rushed through the Commons on Monday. Here’s what it is and what it is meant to do.</p> <a href=\"https://www.theguardian.com/business/2022/mar/07/what-is-the-economic-bill-and-how-effective-will-it-be\">Continue reading...</a>", "link": "https://www.theguardian.com/business/2022/mar/07/what-is-the-economic-bill-and-how-effective-will-it-be", "date_published": "2022-03-07 19:47:53+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Hailed as heroes – Scottish gardeners who rescued trio from Ukraine", "description": "<p>Joe McCarthy and Gary Taylor were held at gunpoint by Russians before successfully evacuating Irish woman and Nigerian men</p><p>Two Scottish gardeners have rescued three students – one Irish and two Nigerian – who were trapped in the wartorn city of Sumy in the north-east of Ukraine.</p><p>Along the way, the men were held at gunpoint by Russian soldiers – but were then rescued themselves by locals.</p> <a href=\"https://www.theguardian.com/world/2022/mar/07/hailed-as-heroes-scottish-gardeners-who-rescued-trio-from-ukraine\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/mar/07/hailed-as-heroes-scottish-gardeners-who-rescued-trio-from-ukraine", "date_published": "2022-03-07 19:40:36+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Henny Beaumont on Vladimir Putin v Volodymyr Zelenskiy – cartoon", "description": "<p></p> <a href=\"https://www.theguardian.com/commentisfree/picture/2022/mar/07/henny-beaumont-on-vladimir-putin-v-volodymyr-zelenskiy-cartoon\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/picture/2022/mar/07/henny-beaumont-on-vladimir-putin-v-volodymyr-zelenskiy-cartoon", "date_published": "2022-03-07 19:30:50+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Don’t let high energy prices derail UK green agenda, say climate experts", "description": "<p>Analysis: Ukraine war may increase short-term need for North Sea oil and gas, but fossil fuels no solution to Britain’s energy woes</p><p>Ramping up production from the UK’s oil and gas fields in the North Sea could help ease the pain of high fuel prices in the short term but should not be seen as a long-term solution to <a href=\"https://www.theguardian.com/science/audio/2022/mar/03/what-have-fossil-fuels-got-to-do-with-the-invasion-of-ukraine\">Britain’s energy woes</a>, experts have warned.</p><p>Lord Adair Turner, former CBI chief and former chair of the Committee on Climate Change, now chair of the Energy Transitions Commission thinktank, said the prime minister’s plan to produce more oil and gas now marked a sensible move, but he cautioned against those who saw a continued future in increased production.</p> <a href=\"https://www.theguardian.com/environment/2022/mar/07/dont-let-high-energy-prices-derail-uk-green-agenda-say-climate-experts\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/mar/07/dont-let-high-energy-prices-derail-uk-green-agenda-say-climate-experts", "date_published": "2022-03-07 19:18:17+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The Guardian view on Putin’s war in Ukraine: Moscow’s on the losing side | Editorial", "description": "<p>The mistake was to think Ukrainians were waiting to be liberated by Russian soldiers and that the west was too divided to help</p><p>Vladimir Putin’s illegal war in Ukraine is a turning point in history. But no one knows who will emerge victorious as one era ends and another is born. Before this war, the momentum was with Mr Putin, whose <a href=\"https://www.theguardian.com/world/2018/jul/21/syria-idlib-putin-assad-winners-iran\" title=\"\">military adventurism paid off</a> in the last decade while the United States, humbled by Iraq, turned inward. However, the Russian president’s invasion of Ukraine has been a criminal mistake. Russian soldiers are killing civilians, who share a Slavic identity, and flattening cities in land that gave birth to their country’s culture. Mr Putin’s unprovoked war against a smaller, democratic neighbour has resulted in 1.7 million people fleeing their homes. This is a <a href=\"https://www.theguardian.com/world/2022/mar/07/international-court-of-justice-to-fast-track-ruling-on-russian-invasion-of-ukraine\" title=\"\">humanitarian crisis</a> on the edge of Europe. If war was just a battle for public opinion, Mr Putin would have lost by now.</p><p>Moscow understands this dynamic which might explain why it cynically undermined peace talks by offering humanitarian corridors for trapped populations only to <a href=\"https://www.theguardian.com/world/2022/mar/07/russia-humanitarian-corridors-ukraine-war-mariupol-kyiv\" title=\"\">shell Ukrainians</a> who attempt to use them. This bodes ill for talks later this week between the Russian and Ukrainian foreign ministries in Turkey. Moscow, perhaps for public consumption at home, is seeking to play peacemaker in a war that it started. The Kremlin’s spokesperson told <a href=\"https://www.reuters.com/world/kremlin-says-russian-military-action-will-stop-moment-if-ukraine-meets-2022-03-07/\" title=\"\">Reuters</a> that Russia was ready to halt military operations “in a moment” if Kyiv meets a list of conditions, such as recognising Crimea as Russian territory and giving two Russian-majority regions independence. It is hard to see how any government in Kyiv could survive in power if it signed such a “land-for-peace” deal.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/mar/07/the-guardian-view-on-putins-war-in-ukraine-moscows-on-the-losing-side\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/mar/07/the-guardian-view-on-putins-war-in-ukraine-moscows-on-the-losing-side", "date_published": "2022-03-07 19:09:44+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The Guardian view on how to convict rapists: put experts in charge | Editorial", "description": "<p>A government promise to invest in specialist police and prosecutors would boost confidence in the justice system on International Women’s Day</p><p>Last week’s <a href=\"https://www.theguardian.com/uk-news/2022/mar/03/sarah-everard-sparked-uk-reckoning-with-male-violence-say-charities\" title=\"\">anniversary of the murder of Sarah Everard</a> was a reminder of everything that has gone wrong in the criminal justice system when it comes to violence against women committed by men. The way that this case and the killing of Bibaa Henry and Nicole Smallman were handled by the Metropolitan police was a key reason why Dame Cressida Dick was <a href=\"https://www.theguardian.com/uk-news/2022/feb/11/cressida-dick-could-not-solve-the-mets-problems-she-could-barely-admit-they-existed\" title=\"\">forced out of her job</a> as its chief. Whoever replaces her in the UK’s highest-profile policing job must know that confidence in the police’s approach to female victims of sexual and violent crimes has fallen very low.</p><p>A review of the way that police dealt with several earlier reports about Wayne Couzens exposing himself is ongoing. The home secretary, Priti Patel, has announced that tackling violence against women and girls (VAWG) is to become a <a href=\"https://www.theguardian.com/society/2022/feb/26/khan-and-patel-to-clash-over-campaigns-to-protect-women\" title=\"\">strategic policing requirement</a>, on an equivalent footing with terrorism, organised crime and child sexual abuse. She has also launched a campaign aimed at highlighting the scale of the problem, and encouraging men to change their behaviour. <a href=\"https://www.theguardian.com/society/2021/nov/18/new-police-lead-on-violence-against-women-says-trust-has-been-broken\" title=\"\">Maggie Blyth</a>, the police’s national lead on VAWG, has admitted that one problem is the attraction policing can hold for men who seek opportunities to exert power over women. With this in mind, it is a relief that efforts are now being made to <a href=\"https://www.theguardian.com/commentisfree/2022/feb/03/generation-women-turned-off-career-police\" title=\"\">recruit more women</a>.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/mar/07/the-guardian-view-on-how-to-convict-rapists-put-experts-in-charge\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/mar/07/the-guardian-view-on-how-to-convict-rapists-put-experts-in-charge", "date_published": "2022-03-07 19:07:21+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Looking at new North Sea gas supplies may not be palatable but is pragmatic | Nils Pratley", "description": "<p>If the UK is going to need gas well into the 2030s, it would surely be better to get it close to home</p><p>The first lesson of the gas crisis is old and boring: the UK should get serious about insulating its leaky properties. If all homes that have energy performance certificate band D were upgraded to band C, the UK’s total gas demand would fall by 7%, and imports by 15%, the Energy and Climate Intelligence Unit calculates. Given the UK’s wretched record in insulation versus European peers, that sounds a small but easy win.</p><p>The second part – the supply side – is where the trickier stuff starts. The broad energy direction has been set towards nuclear and renewables, but there’s no getting away from the fact that gas will be in the mix for a long time yet. Virtually all transition scenarios imagine it, and you have to be an extreme optimist to believe UK consumers can quickly be converted to the joys of heat pumps.</p> <a href=\"https://www.theguardian.com/business/nils-pratley-on-finance/2022/mar/07/looking-at-new-north-sea-gas-supplies-may-not-be-palatable-but-is-pragmatic\">Continue reading...</a>", "link": "https://www.theguardian.com/business/nils-pratley-on-finance/2022/mar/07/looking-at-new-north-sea-gas-supplies-may-not-be-palatable-but-is-pragmatic", "date_published": "2022-03-07 19:03:34+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Children and volunteer soldiers: casualties of the war in Ukraine", "description": "<p>UN has recorded 406 deaths and 801 injuries among Ukraine’s civilian population since 24 February</p><ul><li><strong><a href=\"https://www.theguardian.com/world/live/2022/mar/06/russia-ukraine-war-biden-and-zelenskiy-discuss-more-support-for-ukraine-as-visa-mastercard-pull-out-of-russia-live\">Russia-Ukraine war: live updates</a></strong></li></ul><p>As of the 12th day of Russia’s invasion of Ukraine, the UN confirmed in a statement on Monday it had recorded 406 civilian deaths and 801 injuries as a result of the conflict. Here are some of the Ukrainian people who have died.</p><p><strong>Eight unnamed people fleeing Irpin, a town north-west of Kyiv</strong></p> <a href=\"https://www.theguardian.com/world/2022/mar/07/named-ukrainians-killed-since-russia-invaded\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/mar/07/named-ukrainians-killed-since-russia-invaded", "date_published": "2022-03-07 19:02:41+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Shells rain down on Ukraine’s cities despite ‘cynical’ offer of safe passage", "description": "<p>Analysts and political leaders point to Russia’s ‘string of broken ceasefires’ as bombardment continues</p><ul><li><strong><a href=\"https://www.theguardian.com/world/live/2022/mar/06/russia-ukraine-war-biden-and-zelenskiy-discuss-more-support-for-ukraine-as-visa-mastercard-pull-out-of-russia-live\">Russia-Ukraine war: live updates</a></strong></li></ul><p>In the southern port city of Mariupol, police were going from basement shelter to basement shelter. The message to those who have been trapped by days of brutal Russian shelling in the besieged city of 430,000 on the Sea of Azov was simple.</p><p>Do not come out, terrified residents were warned, until you hear a message on the loud speakers. Do not try to evacuate, despite the promises by Russian forces of safe passage.</p> <a href=\"https://www.theguardian.com/world/2022/mar/07/shells-rain-down-on-ukraines-cities-despite-cynical-offer-of-safe-passage\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/mar/07/shells-rain-down-on-ukraines-cities-despite-cynical-offer-of-safe-passage", "date_published": "2022-03-07 18:41:44+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "William Barr: Trump is full of bull – but I’ll vote for him", "description": "<p>Barr’s book reveals he told Trump he was ‘like a bull in a bull ring’ – in return, Trump calls his former attorney general a ‘horse’</p><p>Donald Trump’s second attorney general, William Barr, told the former US president he was “like a bull in a bull ring” and “someone’s going to come and put a sword through your head”.</p><p>In return, Trump called Barr a “horse” who had been “broken” by the radical left.</p> <a href=\"https://www.theguardian.com/us-news/2022/mar/07/barr-trump-exchange-blows-book-electoral-lie\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/mar/07/barr-trump-exchange-blows-book-electoral-lie", "date_published": "2022-03-07 18:39:46+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Manchester viaduct to become an urban ‘sky park’", "description": "<p>National Trust says £1.8m Castlefield project will bring green space to the city centre</p><p>A disused Manchester viaduct will transform into an urban “sky park” this summer, providing much needed green space to one of Britain’s least verdant city centres.</p><p>The National Trust has begun transforming half of the 330-metre long, 56-arch Castlefield Viaduct into a temporary park that is due to open in July and has been compared to New York’s High Line.</p> <a href=\"https://www.theguardian.com/uk-news/2022/mar/07/manchester-viaduct-to-become-an-urban-sky-park\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/mar/07/manchester-viaduct-to-become-an-urban-sky-park", "date_published": "2022-03-07 18:31:20+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "How important is Russian oil and how high could prices go?", "description": "<p>A prolonged war could take prices above the all-time high, adding to inflation and the cost-of-living crisis</p><p>A western embargo on Russian oil and gas is no longer unthinkable after the US secretary of state, Antony Blinken, revealed that the idea was gaining traction in the White House and had been the <a href=\"https://www.theguardian.com/us-news/2022/mar/06/us-allies-discuss-russian-oil-imports-ban\">subject of “very active discussion”</a> with allies.</p><p>The reaction was dramatic, with Brent crude oil hitting levels not seen since 2008, while gas soared to all-time highs as traders considered whether it could be thrown into the mix too.</p> <a href=\"https://www.theguardian.com/business/2022/mar/07/how-important-is-russian-oil-and-how-high-could-prices-go\">Continue reading...</a>", "link": "https://www.theguardian.com/business/2022/mar/07/how-important-is-russian-oil-and-how-high-could-prices-go", "date_published": "2022-03-07 18:29:13+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "West feeling impact of Russia sanctions too as oil and gas prices soar | Larry Elliott", "description": "<p>Europe’s vulnerability to loss of Russian energy supplies helps explain relative caution on sanctions</p><p>One of the ironies of the war in Ukraine is that the Kremlin’s finances benefit every time the crisis deepens. After Saudi Arabia, Russia is the second biggest exporter of crude oil, and it is out on its own as an exporter of natural gas.</p><p>Countries producing more oil and gas than they consume enjoy windfall gains when prices rise – and Russia falls into that category.</p> <a href=\"https://www.theguardian.com/business/2022/mar/07/west-impact-russia-sanctions-oil-gas\">Continue reading...</a>", "link": "https://www.theguardian.com/business/2022/mar/07/west-impact-russia-sanctions-oil-gas", "date_published": "2022-03-07 17:47:22+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Ukraine: why is there dispute over the UK Home Office’s refugee plans?", "description": "<p>Whitehall’s response has been accused of being slow and ‘lacking humanity’ in the face of the biggest movement of people in Europe this century</p><ul><li><a href=\"https://www.theguardian.com/world/series/ukraine-live/latest\">Ukraine - Russia war: latest updates</a></li></ul><p>A row has broken out over Whitehall’s response to the incipient refugee crisis as a result of the war in Ukraine. Ministers have been urged to act swiftly to open Britain up to displaced Ukrainians – but on Monday morning there were mixed messages from the Home Office and No 10 over how far they plan to go. Here is what we know so far.</p> <a href=\"https://www.theguardian.com/politics/2022/mar/07/why-are-home-office-plans-for-ukraine-refugees-criticised\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/mar/07/why-are-home-office-plans-for-ukraine-refugees-criticised", "date_published": "2022-03-07 17:34:29+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Johnson hints UK oil and gas output must rise to cut dependence on Russia", "description": "<p>PM insists move will not undermine push for net zero; critics say it would have little effect on consumer bills</p><p>Boris Johnson has said the UK may have to increase its domestic gas and oil production in order to wean itself off Russian resources, despite the opposition of climate campaigners and some scepticism in the cabinet.</p><p>The prime minister said the UK was looking at increasing North Sea output, although critics say it would take two decades to ramp up significantly and would have little immediate effect on the impending rise in domestic energy bills.</p> <a href=\"https://www.theguardian.com/environment/2022/mar/07/johnson-hints-oil-and-gas-output-must-rise-to-wean-uk-off-russian-supplies\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/mar/07/johnson-hints-oil-and-gas-output-must-rise-to-wean-uk-off-russian-supplies", "date_published": "2022-03-07 17:14:34+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Rare Italian bear famous for bakery break-in captured", "description": "<p>Animal activists criticise removal of bear known as Juan Carrito, taken to an enclosure for ‘problem’ animals</p><p>A rare brown bear who became famous after breaking into a bakery and feasting on the biscuits has been captured in the central Italian region of Abruzzo, sparking criticism from animal activists.</p><p>The marsican bear, affectionately known as Juan Carrito by residents in the mountain town of Roccaraso, has been taken to an enclosure for “problem” animals.</p> <a href=\"https://www.theguardian.com/world/2022/mar/07/rare-italian-bear-famous-for-bakery-break-in-captured\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/mar/07/rare-italian-bear-famous-for-bakery-break-in-captured", "date_published": "2022-03-07 17:12:24+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Open All Hours actor Lynda Baron dies aged 82", "description": "<p>Baron appeared in numerous TV and stage shows, but was best known for her role in the BBC sitcom</p><p>Actor Lynda Baron has died at the age of 82. In a career spanning multiple decades, the Bafta-nominated star was best known for playing Nurse Gladys Emmanuel in Open All Hours alongside Sir David Jason and Ronnie Barker.</p><p>A statement to PA from her agent of nearly 30 years, Donna French, said: “It is with great sadness that we announce the passing of our beloved client Lynda Baron … we have lost a leading light of our world. We extend our deepest condolences to her daughter Sarah, her son Morgan and all her family.”</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/mar/07/open-all-hours-actor-lynda-baron-dies-aged-82\">Continue reading...</a>", "link": "https://www.theguardian.com/tv-and-radio/2022/mar/07/open-all-hours-actor-lynda-baron-dies-aged-82", "date_published": "2022-03-07 17:10:44+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Syria, Afghanistan, Ukraine: how many refugee crises can the world cope with? | Anushka Asthana", "description": "<p>On the borders of Turkey, a six-metre high wall in the snow is holding back a tide of people desperate to find a haven from tyranny</p><p>The province of Van, in the east of Turkey, is a place of unbelievable beauty, where snow-covered mountains sweep out of the country and into Iran. Turkey is building a six-metre high wall across its border there, and as we reached it, we sank knee-deep into fluffy snow, shivering as the temperature fell to -20C and a bitterly cold wind whipped against our cheeks. In every direction, the view was stunning, mesmerising.</p><p>But the beauty masks a grim and stomach-turning reality. For many, this landscape is a death trap, part of a terrible and desperate journey that can only be completed by foot.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/mar/07/syria-afghanistan-ukraine-refugees-crisis-turkey\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/mar/07/syria-afghanistan-ukraine-refugees-crisis-turkey", "date_published": "2022-03-07 17:05:24+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Apathy to tackle grim levels of UK poverty runs deep | Letters", "description": "<p><strong>Peter Riddle </strong>says we should join Gordon Brown in a voluble condemnation of povertygate, while<strong> Mike Stein </strong>thinks he should reflect on Labour’s failure to present an alternative. Plus letters from <strong>Colin Burk </strong>and <strong>Les Bright </strong></p><p>Gordon Brown is right to shift the focus from partygate to povertygate (<a href=\"https://www.theguardian.com/commentisfree/2022/mar/01/food-banks-bedding-banks-worst-poverty-gordon-brown\" title=\"\">First food banks, now bed banks: in my time in politics, this is the worst poverty I’ve seen, 1 March</a>). The recent circus of political dishonesty and deceit has rightly evoked condemnation, but the furore has distracted us from the cruel assault this government has made on our poorest citizens.</p><p><a href=\"https://www.theguardian.com/politics/gordon-brown\" title=\"\">Brown</a> reminds us that access to food, warmth and a reasonable baseline income is the minimum that any government should provide for its citizens. Not only has this government failed to do this, but it has added to people’s despair by increasing taxes, allowing hikes in food and <a href=\"https://www.theguardian.com/money/2022/mar/06/soaring-gas-prices-are-a-cost-of-this-war-and-britain-cant-avoid-them\" title=\"\">energy prices</a>, cutting <a href=\"https://www.theguardian.com/business/2022/feb/07/extra-13m-workers-on-universal-credit-since-pandemic-began-research-finds\" title=\"\">universal credit</a>, and taking away much of the safety net of support for those families struggling the most. Politicians never seem to recognise the pain they cause or to hear the voices of those who really suffer from their policies. We should all join Brown in a voluble condemnation of povertygate.<br /><strong>Peter Riddle</strong><br /><em>Wirksworth, Derbyshire</em></p> <a href=\"https://www.theguardian.com/society/2022/mar/07/apathy-to-tackle-grim-levels-of-uk-poverty-runs-deep\">Continue reading...</a>", "link": "https://www.theguardian.com/society/2022/mar/07/apathy-to-tackle-grim-levels-of-uk-poverty-runs-deep", "date_published": "2022-03-07 17:04:56+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Why girls will not always be game for sport | Letters", "description": "<p><strong>Emily Taylor </strong>says intense menstrual cycles and emotional exhaustion can shape teenagers’ approach to sport. <strong>Jane Lawson</strong> thinks a change of focus may be needed</p><p>Re your article (<a href=\"https://www.theguardian.com/education/2022/mar/07/uk-girls-lose-interest-in-sport-as-teenagers-women-in-sport-survey\" title=\"\">More than 1 million girls in the UK lose interest in sport as teenagers, 7 March</a>), it is common for teenagers to have irregular and intense menstrual cycles. No one should be made to feel that they should push past that, or not listen to their bodies at that time.</p><p>I dropped out of sport as a teenager because I couldn’t be as good as I wanted to be and because (with hindsight) I was emotionally exhausted by school. After only a couple of years, I started being active again on my own terms, without coaching or persuasion, and I have been a non-competitive multisporter for 20 years. </p> <a href=\"https://www.theguardian.com/education/2022/mar/07/why-girls-will-not-always-be-game-for-sport\">Continue reading...</a>", "link": "https://www.theguardian.com/education/2022/mar/07/why-girls-will-not-always-be-game-for-sport", "date_published": "2022-03-07 17:04:14+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Why has the letter Z become the symbol of war for Russia?", "description": "<p>The origins of the symbol, sported by athletes and popping up on social media, are a mystery, but several theories have been proposed</p><ul><li><a href=\"https://www.theguardian.com/world/live/2022/mar/06/russia-ukraine-war-biden-and-zelenskiy-discuss-more-support-for-ukraine-as-visa-mastercard-pull-out-of-russia-live\">Russia-Ukraine war: live updates</a></li></ul><p>Open source analysts and military experts first spotted the mysterious Z-shaped letter hand-painted on Russian tanks and military trucks massed on the Ukrainian border on 19 February, leading to widespread speculation among western experts as to what the letter meant.</p> <a href=\"https://www.theguardian.com/world/2022/mar/07/why-has-the-letter-z-become-the-symbol-of-war-for-russia\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/mar/07/why-has-the-letter-z-become-the-symbol-of-war-for-russia", "date_published": "2022-03-07 16:50:58+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The world leaders pushing for peace in Ukraine, and their motives", "description": "<p>They claim to be honest brokers, but is that just a fig leaf to cover their moral bankruptcy?</p><ul><li><a href=\"https://www.theguardian.com/world/live/2022/mar/06/russia-ukraine-war-biden-and-zelenskiy-discuss-more-support-for-ukraine-as-visa-mastercard-pull-out-of-russia-live\">Russia-Ukraine war: live updates</a></li></ul><p>How blessed are the peacemakers? After the first wave of intermediaries led by Emmanuel Macron and Olaf Scholz, a new group have beaten their way to Vladimir Putin’s long table since Russia’s invasion of Ukraine, or at least sought to intervene by phone.</p><p>The current crop includes Israeli prime minister Naftali Bennett, Recep Tayyip Erdoğan, president of Turkey, the crown prince of Abu Dhabi, Mohamed bin Zayed of the UAE and now the Indian prime minister, Narendra Modi.</p> <a href=\"https://www.theguardian.com/world/2022/mar/07/the-world-leaders-pushing-for-peace-in-ukraine-and-their-motives\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/mar/07/the-world-leaders-pushing-for-peace-in-ukraine-and-their-motives", "date_published": "2022-03-07 16:33:08+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Picking up slack: how to repair broken elastic", "description": "<p>Fixing elastic that has lost its stretch can be relatively straightforward for some garments – or it can be a chance to completely refashion a piece</p><ul><li><a href=\"https://www.theguardian.com/lifeandstyle/series/closet-clinic\">Get more expert advice on caring for your clothes in our closet clinic series</a></li></ul><p>Any mention of elastic reminds me of being a child. The snap of a rubber band sling-shot across a classroom. Playing dress-ups in tutus with white elastic running inside the waistband. The wide strap across a pair of jiffies.</p><p>As an adult, I only ever notice elastic when it has stopped working and the slack material left behind is starting to annoy me.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/mar/08/picking-up-slack-how-to-repair-broken-elastic\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/mar/08/picking-up-slack-how-to-repair-broken-elastic", "date_published": "2022-03-07 16:30:48+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Dizzee Rascal smashes photographer’s camera after court’s guilty verdict", "description": "<p>Musician, 37, snatches device from PA man after being found guilty of assault of ex-fiancee</p><p>Musician Dizzee Rascal, whose real name is Dylan Mills, smashed a photographer’s camera outside court on Monday after he was found guilty of assaulting his ex-fiancee.</p><p>Mills hurled the camera across the road outside Wimbledon magistrates court, just moments after a verdict of guilty was returned for a charge of assault against Cassandra Jones, the mother of his two children.</p> <a href=\"https://www.theguardian.com/music/2022/mar/07/dizzee-rascal-found-guilty-of-assaulting-ex-fiancee\">Continue reading...</a>", "link": "https://www.theguardian.com/music/2022/mar/07/dizzee-rascal-found-guilty-of-assaulting-ex-fiancee", "date_published": "2022-03-07 16:30:32+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Ukrainian refugees, meet Britain’s ‘hostile environment’. We should be ashamed | Simon Jenkins", "description": "<p>You could hardly imagine a frostier welcome for these desperate people. The comparison with Europe tells you everything</p><p>One and a half million desperate Ukrainian refugees. Fifty British visas. It beggars belief.</p><p>In time of war we should keep emotional responses in proportion, but sometimes the hypocrisy is intolerable. Boris Johnson is frantically – and blatantly – traipsing his Churchill act through the capitals of Europe. He hurls abuse at Vladimir Putin and promises Ukraine guns and missiles, aid and sanctions, persecution of oligarchs, anything short of soldiers. But when asked to do the one concrete thing that might directly relieve that country’s agony, he reverts to type. For god’s sake keep these Ukrainians away from our shores. Remember the ark of the Brexit covenant.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/mar/07/ukrainian-refugees-britain-hostile-environment-europe\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/mar/07/ukrainian-refugees-britain-hostile-environment-europe", "date_published": "2022-03-07 16:10:46+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Covid can shrink brain and damage its tissue, finds research", "description": "<p>Worst effect on region linked to smell, while infected people typically scored lower on mental skills test</p><p>The first major study to compare brain scans of people before and after they catch Covid has revealed shrinkage and tissue damage in regions linked to smell and mental capacities months after subjects tested positive.</p><p>It comes as the largest study to date of the genetics of Covid-19 identified 16 new genetic variants associated with severe illness, and named a number of existing drugs that could be repurposed to prevent patients from getting severely ill, some of which are already in clinical trials.</p> <a href=\"https://www.theguardian.com/world/2022/mar/07/covid-can-shrink-brain-and-damage-its-tissue-finds-research\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/mar/07/covid-can-shrink-brain-and-damage-its-tissue-finds-research", "date_published": "2022-03-07 16:05:19+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Boris Johnson denies overruling spies’ concerns over Evgeny Lebedev peerage", "description": "<p>PM says he did not intervene to get Russian-British newspaper owner into Lords after security risk warning</p><p>Boris Johnson has denied that he intervened to secure a peerage for Evgeny Lebedev after intelligence services warned it would be a security risk, arguing that such suggestions could be motivated by anti-Russian prejudice.</p><p>Answering questions during a brief TV clip on Monday, the prime minister did not, however, deny meeting the Russian-British newspaper owner at the start of the Covid pandemic in March 2020, shortly before the peerage was formalised.</p> <a href=\"https://www.theguardian.com/politics/2022/mar/07/boris-johnson-denies-overruling-spies-concerns-over-evgeny-lebedev-peerage\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/mar/07/boris-johnson-denies-overruling-spies-concerns-over-evgeny-lebedev-peerage", "date_published": "2022-03-07 16:00:55+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Climate crisis: Amazon rainforest tipping point is looming, data shows", "description": "<p>Analysis of satellite observations show forest is losing stability with ‘profound’ global implications</p><p>The Amazon is approaching a tipping point, data shows, after which the rainforest would be lost with “profound” implications for the global climate and biodiversity.</p><p>Computer models have previously indicated a mass dieback of the Amazon is possible but the new analysis is based on real-world satellite observations over the past three decades.</p> <a href=\"https://www.theguardian.com/environment/2022/mar/07/climate-crisis-amazon-rainforest-tipping-point\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/mar/07/climate-crisis-amazon-rainforest-tipping-point", "date_published": "2022-03-07 16:00:46+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Margrete: Queen of the North review – piercing portrait of a tormented queen", "description": "<p>Trine Dyrholm elevates this painterly period drama with a masterfully understated performance as Denmark’s Queen Margrete </p><p>Blending the grand visuals of a sweeping epic with the psychological unease of a chamber piece, Charlotte Sieling’s feature probes the legacy of <a href=\"https://en.wikipedia.org/wiki/Margaret_I_of_Denmark\">Denmark’s Queen Margrete</a>, a visionary ruler who brokered the historic Kalmar Union that – for the first time – united Norway, Sweden and Denmark against the threat of a German invasion.</p><p>But her reign also saw a bizarre mystery in the Scandinavian region, which forms the emotional beating heart of this stately film. On the eve of the engagement between Margrete’s adopted son Erik (Morten Hee Andersen), and Princess Philippa (Diana Martinová), daughter of England’s Henry IV, news broke that the Queen’s biological son King Olaf (Jakob Oftebro) had returned from the dead. This sudden arrival not only unsettled political coalitions but also sent the usually stoic Margrete into a state of distress. Since she was not at his side when Olaf died, her maternal grief encouraged her to believe that Olaf had survived. On the other hand, her monarchical rationality questioned if he was merely an impostor sent to her doorsteps to disrupt a sought-after alliance with England.</p> <a href=\"https://www.theguardian.com/film/2022/mar/07/margrete-queen-of-the-north-review\">Continue reading...</a>", "link": "https://www.theguardian.com/film/2022/mar/07/margrete-queen-of-the-north-review", "date_published": "2022-03-07 16:00:46+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Interviews for Ofcom chair due to begin as search is ‘exhausted’", "description": "<p>Government will not say how many applications were received or how many candidates are in running</p><p>Interviews to select the new chair of Ofcom are due to start next week after the government admitted it had finally “exhausted” the hunt for potential candidates, almost two years after the process began.</p><p>The search to replace Terry Burns at the telecoms, media and postal regulator started in early 2020 when Lord Burns announced he was to stand down, and a successor was expected to be found by the end of that year, after the appointment of <a href=\"https://www.theguardian.com/media/2019/nov/06/ofcom-selects-melanie-dawes-as-chief-executive\">Melanie Dawes</a> as Ofcom’s new chief executive.</p> <a href=\"https://www.theguardian.com/media/2022/mar/07/interviews-for-ofcom-chair-due-to-begin-as-search-is-exhausted\">Continue reading...</a>", "link": "https://www.theguardian.com/media/2022/mar/07/interviews-for-ofcom-chair-due-to-begin-as-search-is-exhausted", "date_published": "2022-03-07 15:58:42+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Bandcamp sells to Epic: can a video game company save independent music?", "description": "<p>A hero site generating better revenue for creators has sold out, say some musicians, while others hail the potential to reach new audiences</p><p>Musos and gamers were left <a href=\"https://pitchfork.com/thepitch/bandcamp-epic-games-acquisition/\">scratching their heads</a> last Wednesday as Bandcamp, the online record store hailed by independent artists as a bankable alternative to the razor-thin royalties of streaming, announced its acquisition by Epic Games, makers of the online gaming phenomenon Fortnite.</p><p>Bandcamp CEO Ethan Diamond framed the deal as a boon for artists, saying that the two US companies shared a vision of building “the most open, artist-friendly ecosystem in the world”. A blogpost from Epic underlined the need for “fair and open platforms” to enable “creators to keep the majority of their hard-earned money”.</p> <a href=\"https://www.theguardian.com/music/2022/mar/07/bandcamp-sells-to-epic-can-a-video-game-company-save-independent-music\">Continue reading...</a>", "link": "https://www.theguardian.com/music/2022/mar/07/bandcamp-sells-to-epic-can-a-video-game-company-save-independent-music", "date_published": "2022-03-07 15:15:49+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Madonna bootcamp: singing, acting and 11-hour dance sessions – is anyone tough enough to take on the material girl?", "description": "<p>Contenders in the running to play the star in a new biopic are facing gruelling training to land the part</p><p><strong>Age:</strong> It’s been going on for months.</p><p><strong>Appearance:</strong> Immersive course in singing like Madonna, dancing like Madonna and acting like Madonna.</p> <a href=\"https://www.theguardian.com/music/2022/mar/07/madonna-bootcamp-singing-acting-and-11-hour-dance-sessions-is-anyone-tough-enough-to-take-on-the-material-girl\">Continue reading...</a>", "link": "https://www.theguardian.com/music/2022/mar/07/madonna-bootcamp-singing-acting-and-11-hour-dance-sessions-is-anyone-tough-enough-to-take-on-the-material-girl", "date_published": "2022-03-07 15:00:18+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Russia’s war in Ukraine: complete guide in maps, video and pictures", "description": "<p>Where is fighting happening and how did we get here?</p><ul><li><a href=\"https://www.theguardian.com/world/series/ukraine-live/latest\">Russia-Ukraine crisis: latest updates</a></li></ul><p>Russian forces are continuing to pound Ukrainian cities, including residential areas, with missile strikes and artillery fire, and Ukraine <a href=\"https://www.theguardian.com/world/2022/mar/07/russia-humanitarian-corridors-ukraine-war-mariupol-kyiv\">has dismissed as immoral and unacceptable</a> Russian proposals to evacuate civilians along routes into Russia or Belarus.</p> <a href=\"https://www.theguardian.com/world/2022/mar/07/russia-war-ukraine-complete-guide-maps-video-and-pictures\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/mar/07/russia-war-ukraine-complete-guide-maps-video-and-pictures", "date_published": "2022-03-07 14:54:30+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘Anne Boleyn’s tiara was from Claire’s Accessories’ – how we made Six: the musical", "description": "<p>What if Henry VIII’s wives were a pop group? The makers of the smash hit recall how Catherine of Aragon was very much Beyoncé, Anne Boleyn had Lily Allen vibes – while Jane Seymour was a sort of Adele</p><p>In 2017, Cambridge University’s musical theatre society invited applications for an original show that it could take to the Edinburgh fringe. Toby Marlow and I were third years at the university, and had talked about doing a musical together for ages, so he applied, saying he would write a show with pop music and lots of women at its centre. Representation of women on stage was in the cultural conversation – later that year #MeToo happened.</p> <a href=\"https://www.theguardian.com/stage/2022/mar/07/anne-boleyn-tiara-claires-accessories-how-we-made-six-musical-beyonce-lily-allen-adele\">Continue reading...</a>", "link": "https://www.theguardian.com/stage/2022/mar/07/anne-boleyn-tiara-claires-accessories-how-we-made-six-musical-beyonce-lily-allen-adele", "date_published": "2022-03-07 14:50:45+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Stella McCartney dissects work of artist Frank Stella for Paris collection", "description": "<p>Collaboration drew from monochrome and straight lines of artist’s early work as well as more ‘explosive, feminine side’</p><p>The American artist Frank Stella once said that he “could tell a story with shapes”. Paris fashion week has done this too, all the way from <a href=\"https://www.theguardian.com/fashion/2022/mar/02/dior-and-saint-laurent-an-elevated-discussion-between-past-and-future\">Christian Dior’s triumphant postwar</a> new look to the more recent apocalypse-luxe of Vetements’ oversized streetwear.</p><p>Stella McCartney, whose clothes tend to be about cool silhouettes rather than embroidery or ruffles, has long felt an affinity with Stella that goes beyond their sharing a name. Stella by Stella, presented on the rooftop of the Pompidou Centre, was both a fashion collection and a celebration of the artist.<br /><br />Stella’s 1988 collage piece Ahab was transposed “pure and direct from the canvas” on to fluid stretch viscose dresses, McCartney said. Other prints were dissected, with elements taken out “to extract something more palatable and wearable” that would be appealing rather than overwhelming on a blouse or dress.</p> <a href=\"https://www.theguardian.com/fashion/2022/mar/07/stella-mccartney-dissects-work-of-artist-frank-stella-for-paris-collection\">Continue reading...</a>", "link": "https://www.theguardian.com/fashion/2022/mar/07/stella-mccartney-dissects-work-of-artist-frank-stella-for-paris-collection", "date_published": "2022-03-07 14:32:10+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "How the tech community has rallied to Ukraine’s cyber-defence | Joyce Hakmeh and Esther Naylor", "description": "<p>From an army of volunteers to EU and Nato teams, the variety of online actors working for the cause is unprecedented</p><p>As the conflict in Ukraine escalates, expert cyber-watchers have been speculating about the kind of cyber-attacks that Russia might conduct. Will the Kremlin turn off <a href=\"https://www.reuters.com/business/energy/europe-ukraines-plan-link-power-grids-2022-03-01/\">Ukraine’s power grid</a>, dismantle Ukraine’s transport system, cut off the water supply or target the health system? Or would cybercriminals operating from Russia, who could act as proxies for the Russian regime, conduct these activities? </p><p>Over the past decade, Ukraine has experienced many major cyber-attacks, most of which have been attributed to Russia. From <a href=\"https://linkprotect.cudasvc.com/url?a=https%3a%2f%2fcyberlaw.ccdcoe.org%2fwiki%2fUkrainian_parliamentary_election_interference_%282014%29&amp;c=E,1,StFwZXhMSXzdK2NgHCrbogdwEYXd6dIdKN5BH-f3wuA7mffVqIDMPfbPWbTJbhEacHM5SReQdAN3zF-pjszSXGWoQgM4t_Bxxc9XRtU9&amp;typo=1\">election interference</a> in 2014, which compromised the central electoral system and jeopardised the integrity of the democratic process; to a hack and blackout attack in a <a href=\"https://www.wired.com/2016/03/inside-cunning-unprecedented-hack-ukraines-power-grid/\">first-of-its-kind</a> fully remote cyber-attack on a power grid in 2015, resulting in countrywide power outages; to one of the costliest malicious software attacks, <a href=\"https://linkprotect.cudasvc.com/url?a=https%3a%2f%2fwww.ncsc.gov.uk%2fnews%2frussian-military-almost-certainly-responsible-destructive-2017-cyber-attack&amp;c=E,1,gQLKhCcnObHis4f6gqLD00huETA5SLHSA6vM57B2i0hlo_CzpXPoOOnDzw3C1ARe_RcNzqmDaELiubRPns7WMfAOVBY3hWo30W0RSqTXbF0TlSLy5Q,,&amp;typo=1\">NotPetya</a>, in 2017, which significantly disrupted access to banking and government services in Ukraine and, subsequently, spilled over to France, Germany, Italy, Poland, Russia, the UK, the US and Australia.</p><p>Joyce Hakmeh is a senior research fellow for the International Security Programme at Chatham House. Esther Naylor is a research analyst at the International Security Programme </p> <a href=\"https://www.theguardian.com/commentisfree/2022/mar/07/tech-community-rallied-ukraine-cyber-defence-eu-nato\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/mar/07/tech-community-rallied-ukraine-cyber-defence-eu-nato", "date_published": "2022-03-07 13:52:52+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘We need bread’: fears in Middle East as Ukraine war hits wheat imports", "description": "<p>Aid agencies warn of ‘ripple effect’ as soaring wheat prices hit countries already facing inflation, food insecurity and conflict</p><p>Concerns are growing across the Middle East and north Africa that the war in Ukraine will send prices of staple foods soaring as wheat supplies are hit, potentially fuelling unrest. Russia and Ukraine <a href=\"https://www.aljazeera.com/news/2022/2/17/infographic-russia-ukraine-and-the-global-wheat-supply-interactive\">supply a quarter of the world’s wheat exports</a>, while Egypt is the world’s biggest importer of wheat. </p><p>In Tunisia, like many people queueing for bread in Tunis’s sprawling <em>medina, </em>or old town, Khmaes Ammani, a day labourer, said the rising cost of living was leaving him squeezed. “There’s never any money at the end of the month,” he said. “I even have to borrow some. Everything is getting more expensive.”</p> <a href=\"https://www.theguardian.com/global-development/2022/mar/07/we-need-bread-fears-in-middle-east-as-ukraine-russia-war-hits-wheat-imports\">Continue reading...</a>", "link": "https://www.theguardian.com/global-development/2022/mar/07/we-need-bread-fears-in-middle-east-as-ukraine-russia-war-hits-wheat-imports", "date_published": "2022-03-07 13:38:50+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Beijing Winter Paralympics 2022: day three – in pictures", "description": "<p>The best images from the second day’s action, including curling and the snowboard cross finals</p> <a href=\"https://www.theguardian.com/sport/gallery/2022/mar/07/beijing-winter-paralympics-2022-day-three-in-pictures\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/gallery/2022/mar/07/beijing-winter-paralympics-2022-day-three-in-pictures", "date_published": "2022-03-07 13:19:07+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Experts raise doubts over plan for Royal Navy to control Channel crossings", "description": "<p>Exclusive: Critical defence select committee report to come amid growing Tory unease over No 10’s plan</p><p>The credibility of the government’s plan to put the Royal Navy in charge of coordinating efforts to control small boats in the Channel is expected to be questioned by an influential parliamentary committee.</p><p>A report by the defence select committee, to be delivered shortly, will raise doubts over whether plans to put the Royal Navy in charge have been rigorously tested.</p> <a href=\"https://www.theguardian.com/uk-news/2022/mar/07/experts-raise-doubts-over-plan-for-royal-navy-to-control-channel-crossings\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/mar/07/experts-raise-doubts-over-plan-for-royal-navy-to-control-channel-crossings", "date_published": "2022-03-07 13:10:25+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Thomasina Miers’ recipe for pork, thyme and manchego burgers | The new flexitarian", "description": "<p>Choose the best fatty mince you can get for these pork burgers with a Mexican-inspired relish</p><p>There’s nothing quite like a burger night. I love trying different minces from butchers (they freeze well if you don’t use them immediately), with a good ratio of fat for flavour and texture, and I love a good veggie burger, too. With meat, I am led by the mantra “less, but better quality” (save our rivers from factory farms!), so the patties aren’t huge, but I like to go wild on the trimmings: a smorgasbord of slaws and salads, beans, crisp potato wedges or fries, tomatoes, pickles, lettuce, mayos and hot sauces. </p><p>UK readers: <a href=\"https://www.ocado.com/search?entry=10000098760&amp;utm_source=guardian-feast&amp;utm_medium=referral&amp;utm_campaign=guardian-feast-recipe\">click to buy these ingredients</a> from Ocado</p> <a href=\"https://www.theguardian.com/food/2022/mar/07/pork-thyme-manchego-burgers-chipotle-relish-recipe-thomasina-miers\">Continue reading...</a>", "link": "https://www.theguardian.com/food/2022/mar/07/pork-thyme-manchego-burgers-chipotle-relish-recipe-thomasina-miers", "date_published": "2022-03-07 13:00:37+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Russian gymnast with ‘Z’ symbol on podium next to Ukrainian faces long ban", "description": "<ul><li>Gymnastics’ governing body condemns Ivan Kuliak’s conduct</li><li><a href=\"https://www.theguardian.com/world/2022/mar/07/why-has-the-letter-z-become-the-symbol-of-war-for-russia\">Letter seen to symbolise support for the invasion of Ukraine</a></li></ul><p>Gymnastics’ governing body has condemned the “shocking behaviour” of the Russian gymnast Ivan Kuliak, who now faces a lengthy ban for wearing a symbol in support of the invasion of Ukraine on the medal podium of a World Cup event.</p><p>After winning bronze in the parallel bars final at the Apparatus World Cup in Doha, Kuliak taped the letter “Z” to the front of his outfit before standing next to the gold medallist, Illia Kovtun of Ukraine, for the national anthems.</p> <a href=\"https://www.theguardian.com/sport/2022/mar/07/shocking-behaviour-russian-gymnast-shows-z-symbol-on-podium-next-to-ukrainian-winner\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/mar/07/shocking-behaviour-russian-gymnast-shows-z-symbol-on-podium-next-to-ukrainian-winner", "date_published": "2022-03-07 12:54:49+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "A Beatle mural and a triceratops: Monday’s best photos", "description": "<p>The Guardian’s picture editors select photo highlights from around the world</p> <a href=\"https://www.theguardian.com/news/gallery/2022/mar/07/beatle-mural-triceratops-mondays-best-photos\">Continue reading...</a>", "link": "https://www.theguardian.com/news/gallery/2022/mar/07/beatle-mural-triceratops-mondays-best-photos", "date_published": "2022-03-07 12:53:08+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The big idea: is tourism bad for us?", "description": "<p>Wanderlust may be surging once more – but will travel really help us find what we’re looking for?</p><p>In 2019, the United Nations World Tourism Organization reported that international travel had increased to a record <a href=\"https://www.unwto.org/global/press-release/2019-01-21/international-tourist-arrivals-reach-14-billion-two-years-ahead-forecasts\" title=\"\">1.4 billion</a> tourist arrivals. It predicted a 3% to 4% annual increase in coming years. That didn’t happen, of course. At the end of 2021, international tourist arrivals were 72% below pre-pandemic levels with 1 billion fewer arrivals than two years earlier.</p><p>This is despite airlines’ ingenuity. During Australian lockdown, Qantas organised flights to nowhere: one left Sydney for a fly-by tour of Byron Bay and the Gold Coast, the Great Barrier Reef and Uluru; another in May last year took passengers to 43,000ft to see the blood-red supermoon.</p> <a href=\"https://www.theguardian.com/books/2022/mar/07/the-big-idea-is-tourism-bad-for-us-globalisation-flight-holiday\">Continue reading...</a>", "link": "https://www.theguardian.com/books/2022/mar/07/the-big-idea-is-tourism-bad-for-us-globalisation-flight-holiday", "date_published": "2022-03-07 12:30:36+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Our climate solutions are failing - and Big Oil’s fingerprints are all over them | Amy Westervelt", "description": "<p>For the first time, a IPCC report has acknowledged the role of misinformation. But it still doesn’t name the culprits</p><p>People who do not spend their days reading climate reports or scouring the archives of oil companies are often surprised to hear that the fossil-fuel industry has been part of the Intergovernmental Panel on Climate Change (IPCC) since its inception. And it’s not just the IPCC. Oil companies have been involved in the entire international effort on climate change since it began in the late 1980s – and here’s a pro tip: they’re there for a reason, and it’s not decarbonisation.</p><p>The second part of the IPCC’s most recent report was <a href=\"https://www.ipcc.ch/assessment-report/ar6/\">published last week</a>, and it finally acknowledged the oil industry’s biggest contribution to the climate space thus far: misinformation. This was followed closely by another new-to-the-IPCC topic: maladaptation, which refers to measures ostensibly geared towards warding off climate change, but which “may lead to increased risk of adverse climate-related outcomes, including via increased greenhouse gas emissions, increased or shifted vulnerability to climate change, more inequitable outcomes, or diminished welfare”, according to the IPCC.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/mar/07/climate-solutions-big-oil-ipcc-report\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/mar/07/climate-solutions-big-oil-ipcc-report", "date_published": "2022-03-07 12:00:36+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "My dear Russians – the Ukrainians are fighting Putin’s army for their freedom, and ours | Mikhail Shishkin", "description": "<p>The real Russia is a country of literature and music, not the bombardment of children. Putin’s war brings disgrace on us all</p><ul><li>Mikhail Shishkin is a Russian novelist</li></ul><p>I’m a Russian. Vladimir Putin is committing monstrous crimes in the name of my people, my country, and me. Putin is not Russia. Russia is hurt and ashamed. In the name of my Russia and my people I beg the Ukrainians’ forgiveness. Yet I realise that nothing being done there can be forgiven.</p><p>This war did not begin just now but in 2014, <a href=\"https://www.theguardian.com/world/2014/mar/18/putin-confirms-annexation-crimea-ukrainian-soldier-casualty\">with Putin’s seizure of Crimea</a>. The western world refused to understand<strong> </strong>the gravity of this and pretended nothing terrible was going on. All these years I’ve been trying in <a href=\"https://www.theguardian.com/commentisfree/2014/mar/18/russia-ukraine-crimea-betrayed-leaders-brother-nations\">my statements and publications</a> to explain to people just who Putin is. It hasn’t worked. And now <a href=\"https://www.theguardian.com/world/2022/feb/24/putin-russian-president-ukraine-invasion-mental-fitness\">Putin himself</a> has explained it to everyone.</p><p>Mikhail Shishkin is a novelist, and the only author to have won the Russian Booker Prize, the Russian National Bestseller, and Big Book Prize</p> <a href=\"https://www.theguardian.com/commentisfree/2022/mar/07/russians-ukrainians-putin-army-freedom-mikhail-shishkin\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/mar/07/russians-ukrainians-putin-army-freedom-mikhail-shishkin", "date_published": "2022-03-07 11:57:07+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "UK man, 75, trapped in Qatar for more than seven years after legal dispute", "description": "<p>Ranald Crook, now back in Britain, was forbidden to fly home for his father’s funeral under travel ban</p><p>A 75-year-old British man was trapped in Qatar for more than seven years when he was refused permission to leave after a business dispute.</p><p>Ranald Crook, who is back in Gloucestershire, was even forbidden to fly home for his father’s funeral as a result of the travel ban, imposed after two influential Qatari brothers took legal action against him.</p> <a href=\"https://www.theguardian.com/world/2022/mar/07/uk-man-ranald-crook-trapped-in-qatar-seven-years\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/mar/07/uk-man-ranald-crook-trapped-in-qatar-seven-years", "date_published": "2022-03-07 11:56:42+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Georgia speeds up EU application in policy U-turn", "description": "<p>Move comes amid public alarm over Russia’s invasion of Ukraine, as Moldova also applies to join bloc</p><ul><li><strong><a href=\"https://www.theguardian.com/world/live/2022/mar/06/russia-ukraine-war-biden-and-zelenskiy-discuss-more-support-for-ukraine-as-visa-mastercard-pull-out-of-russia-live\">Russia-Ukraine war: live updates</a></strong></li></ul><p>In a surprise U-turn, the government of Georgia has applied for EU membership just days after declaring it would not accelerate its application, as fears grow among the Georgian public that the <a href=\"https://www.theguardian.com/world/2022/mar/01/ukraine-neighbours-nato-lithuania-poland-slovakia-latvia-estonia-romania\">Russian invasion might not stop with Ukraine.</a></p><p>A day after <a href=\"https://www.theguardian.com/world/2022/mar/02/ukraine-bid-fast-track-membership-eu-likely-end-disappointment-zelenskiy\">Ukraine made its formal application for EU membership</a> on Wednesday, Georgia responded to the pressure of overwhelming public protests and made its own request, along with Moldova.</p> <a href=\"https://www.theguardian.com/world/2022/mar/07/georgia-expedites-eu-application-in-policy-u-turn-russia-ukraine\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/mar/07/georgia-expedites-eu-application-in-policy-u-turn-russia-ukraine", "date_published": "2022-03-07 11:31:37+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "How we met: ‘I told him he had to get rid of his girlfriends before I’d go out with him’", "description": "<p>Bronwyn, 60, met Sean, 57, after he wrote to the radio station where she had a show. They have been married since 1991 </p><p>In September 1988, Bronwyn was living in Brooklyn, New York, presenting a popular show on WFMU, an independent community radio station. “I played a lot of different music and wrote my own material, which included an obituary section called News of the Dead,” she says. </p><p>One day, after Bronwyn finished recording, the station manager showed her a comic strip submitted for the station’s programme guide. “When I glanced at the comic I thought the art looked great.” When she read the strip, she realised it was about her. “It included all these drawings of women, trying to guess what kind of woman I was. The final panel was a picture of the artist walking across a desert, asking if I’d marry him,” she laughs. “If he’d sent fan mail, I might have thought he was nuts, but I knew it was a flattering joke because it was sent to the programme guide, not me.”</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/mar/07/how-we-met-comic-strip-marry-him-bronwyn-sean-radio-show\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/mar/07/how-we-met-comic-strip-marry-him-bronwyn-sean-radio-show", "date_published": "2022-03-07 11:30:35+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "There is a heavy burden of being black in white spaces | Elijah Anderson", "description": "<p>White gatekeepers repeatedly approach Black people with a disingenuous ‘can I help you?’ It never stops</p><p>When an anonymous Black person enters the white space, often the people there immediately try to make sense of him or her – to determine “who that is”, or to figure out the nature of the person’s business and whether they need to be concerned. When the Black person is unknown, stereotypes can rule perceptions, creating a situation that can estrange the Black person. In these circumstances, almost any Black person can experience distance, especially a young Black male – not as a measure of his merit as a person but because of his Black skin and its indication of “outsider” status in the white space. Thus, such a Black person is burdened with a deficit of credibility, especially in comparison with their white counterparts.</p><p>Strikingly, a Black person’s deficit may be minimized or tentatively overcome by a performance, a negotiation, or what some Blacks refer to derisively as a “dance”, through which individual Blacks may be inclined to show white people and others that ghetto stereotypes do not apply to them personally; in effect, they perform for credibility or for acceptance. This performance can be as deliberate as dressing well and speaking in an educated way or as simple as producing an ID or a driver’s license in situations in which this would never be demanded of whites.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/mar/07/being-black-in-white-spaces-racism\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/mar/07/being-black-in-white-spaces-racism", "date_published": "2022-03-07 11:24:35+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Jazz ‘genius’ Cécile McLorin Salvant: ‘In periods of loneliness and fear, it’s instinctual to want to talk about love’", "description": "<p>Fresh from receiving a MacArthur Foundation grant – and releasing an album inspired by Kate Bush and ghostly folk – the daring singer is already absorbed in the next challenge</p><p>In 2020, Cécile McLorin Salvant kept getting calls from an unknown number. Like any self-respecting millennial, she ignored them. “They called me so many times and I didn’t answer because no one answers a number that they don’t know,” she says, speaking by Zoom from her New York apartment.</p><p>When she finally picked up the phone, she “freaked out”. It was the MacArthur Foundation calling to tell her she had been chosen as one of its fellows, an honour that comes with a grant of $625,000 (£475,000) paid over five years. Given that Covid-19 meant her tour had been cancelled, it couldn’t have come at a better time. “It felt like a validation that went beyond music,” says the 32-year-old musician. “It felt like a validation of the way that I think. That’s a huge compliment. It’s the greatest honour.”</p> <a href=\"https://www.theguardian.com/music/2022/mar/07/jazz-genius-cecile-mclorin-salvant-in-periods-of-loneliness-and-fear-its-instinctual-to-want-to-talk-about-love\">Continue reading...</a>", "link": "https://www.theguardian.com/music/2022/mar/07/jazz-genius-cecile-mclorin-salvant-in-periods-of-loneliness-and-fear-its-instinctual-to-want-to-talk-about-love", "date_published": "2022-03-07 11:23:37+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "US beef industry emerges from Biden’s climate pledges ‘relatively unscathed’", "description": "<p>Leaders are relieved the approach is to incentivize rather than giving ranchers and feedlots tougher methane curbs</p><p>The US beef industry has escaped “relatively unscathed” from Joe Biden’s attempts to curb greenhouse gas emissions, according to leaders at the industry’s recent CattleCon convention.</p><p>Biden and the EU unveiled a global pledge to <a href=\"https://www.theguardian.com/environment/2021/nov/02/joe-biden-plan-cut-global-methane-emissions-30-percent\">cut methane gas 30% by 2030</a> at November’s <a href=\"https://www.theguardian.com/environment/cop26-glasgow-climate-change-conference-2021\">Cop26</a> climate summit – and there is evidence that methane created by cattle production is a significant contributor to climate change.</p> <a href=\"https://www.theguardian.com/environment/2022/mar/07/us-beef-industry-cop26-methane-gas\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/mar/07/us-beef-industry-cop26-methane-gas", "date_published": "2022-03-07 11:05:35+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Rachel Roddy’s recipe for linguine with white fish and citrus juice | A kitchen in Rome", "description": "<p>A simple pasta supper of linguine with white fish in lemony, garlicky oil – just remember to start slowly …</p><p>Driving, jogging, dancing, convincing … Starting from cold is rarely a good idea. Except in some cooking, and especially olive oil in a pan. And especially for someone like me, who for years often began cooking by plonking a frying pan on a flame, pouring in olive oil, adding chopped garlic or <em>soffritto</em>, then marvelling as the little bits seized like cotton in a flame and turned into bitter crisps. Even when I tried to be cautious, lowering the flame and my eyes, there was still a good chance of burned edges. And it always felt like a race.</p><p>The solution arrived like an airdrop; two words, from the cook and teacher <a href=\"https://terroirtalk.org/fabrizia-lanza\">Fabrizia Lanza</a>.<em> Start cold.</em> That is, put the oil, garlic, chilli and zest in the pan away from the heat, away from the stove, on the other side of the room, if need be. Because, of course, it isn’t really cold, but room and hand temperature – ideal for getting things started, a pre-warm-up warm-up, if you like. Only when all the elements are ready, and you have put a pan of water on for the pasta, does the pan go on a low flame. In the case of today’s recipe for linguine with white fish and citrus, a <em>really</em> low flame. The lowest of the low, so the volatile oils and scents in a clove of garlic (peeled and crushed gently with the flat of a knife), a small dried red chilli or pinch of dried red chilli flakes and the freshly grated zest of an unwaxed lemon and an orange can infuse six tablespoons of extra-virgin olive oil and the room.</p><p>UK readers: <a href=\"https://www.ocado.com/search?entry=10000098761&amp;utm_source=guardian-feast&amp;utm_medium=referral&amp;utm_campaign=guardian-feast-recipe\">click to buy these ingredients</a> from Ocado</p> <a href=\"https://www.theguardian.com/food/2022/mar/07/rachel-roddys-recipe-for-linguine-with-white-fish-and-citrus-juice\">Continue reading...</a>", "link": "https://www.theguardian.com/food/2022/mar/07/rachel-roddys-recipe-for-linguine-with-white-fish-and-citrus-juice", "date_published": "2022-03-07 11:00:35+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Every day Ukrainians beg me to save their children. Violence and terror are raining down on them | Nikolai Kuleba", "description": "<p>I am trying to protect young ones in this war but the odds are against us. There is no military purpose to attacking primary schools, only savagery.<br /></p><ul><li>Nikolai Kuleba is the ombudsman for children with the office of the president of Ukraine</li></ul><p>For the past seven years, I have been the ombudsman for children in Ukraine. This is the work of my lifetime. With the support of the president, the first lady and my determined staff, we work to end violence and exploitation of children in every form, and return those harmed to health in body and mind. Today, <a href=\"https://www.theguardian.com/world/2022/feb/27/children-caught-up-in-ukraine-war\">every child in Ukraine</a> is my charge because violence and terror rain upon them all.</p><p>Childhood cannot coexist with war. And, for humanity, childhood must exist.</p><p>Nikolai Kuleba is the ombudsman for children with the office of the president of Ukraine</p> <a href=\"https://www.theguardian.com/commentisfree/2022/mar/07/ukrainian-children-violence-terror-military\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/mar/07/ukrainian-children-violence-terror-military", "date_published": "2022-03-07 10:00:34+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Next stop, Sylvia Plath! Why it is time to redraw the London Underground map", "description": "<p>The official London tube map has only three stops named after women. Together with the actor Emma Watson and the author Rebecca Solnit, I’ve been working on a feminist alternative. Here’s the story behind our contribution to International Women’s Day</p><p>When I was a baby feminist, I would argue with friends that public space was political. I had been radicalised by my teenage years, sick to the back teeth of street harassment from men who seemed to think that the streets were theirs to roam freely, while women were relegated to decoration. It wasn’t a regular occurrence, but it happened enough times to enrage me. Walking home from school in London, in uniform, I had been followed, had my arm snatched and had been approached at least once by a man who displayed stalking tendencies. As I grew older, I understood these actions as displays of dominance and I was disgusted. Alongside my indignation, I was crushingly disappointed. I had been raised in this city and hated that this kind of behaviour was an impediment to my teenage desire for autonomy and freedom.</p><p>I had been navigating public transport by myself for years at that point, and it took me everywhere I wanted to go. Once I had exhausted my immediate surroundings on foot, I’d take the Piccadilly line to gigs at the now bulldozed Astoria on Charing Cross Road. I’d jump on the Hammersmith and City line, a portal to dancing all day at Notting Hill carnival. The Circle line made me feel like an intellectual in the museums of South Kensington. There was no option back then to outsource travel plans to a clever little app, so in order to go anywhere I, like everyone else, would have to study the tube map to find out how to get to my destination. If I was feeling brave, I’d sometimes jump on the tube at Turnpike Lane and work it out as I went along, peering at the mini maps inside the train carriage and looming awkwardly over whoever was sitting in the seat beneath. I didn’t need a car. The map in my pocket opened up my city.</p> <a href=\"https://www.theguardian.com/world/2022/mar/07/next-stop-sylvia-plath-why-it-is-time-to-redraw-the-london-underground-map\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/mar/07/next-stop-sylvia-plath-why-it-is-time-to-redraw-the-london-underground-map", "date_published": "2022-03-07 10:00:33+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘Part of the performance no one gets to see’: stars warm up backstage – in pictures", "description": "<p>To mark the nominations for the Olivier awards on 8 March, photographer David Levene went behind the scenes at London’s top theatres</p><p></p> <a href=\"https://www.theguardian.com/stage/gallery/2022/mar/07/stars-warm-up-backstage-in-pictures\">Continue reading...</a>", "link": "https://www.theguardian.com/stage/gallery/2022/mar/07/stars-warm-up-backstage-in-pictures", "date_published": "2022-03-07 09:33:28+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘I just wanted to play Duck Hunt with my kids’: the man on a mission to bring back the light gun", "description": "<p>No one believed he could make a light gun that worked on modern TVs. But Andrew Sinden persevered with his dream to revive a dying game genre</p><p>Almost every console and computer, from the Sega Dreamcast to the humble Amstrad CPC, once had its very own light gun. Whether you were shooting ducks with the NES Zapper or downing baddies in Time Crisis on the PlayStation, they were ubiquitous – yet now they are all but extinct. Andrew Sinden aims to change that: he’s on a crusade to make light-gun games mainstream again. “I’d consider the project has failed if I don’t manage to do that,” he says.</p><p>It all began around four years ago, when Sinden’s parents were cleaning out their loft. They came across his old NES, and asked him whether he still wanted it. “Of course, the answer was yes,” recalls Sinden. “And what I really wanted to do was play Duck Hunt with my kids.” But after hooking up the console to his television, he was dismayed to find that nothing happened when he pulled the Zapper’s trigger. “I completely forgot that light guns didn’t work on modern TVs,” he admits. “It was a real disappointment, because I thought Duck Hunt on a 50-inch TV would be amazing. I used to play it on a 14-inch TV!”</p> <a href=\"https://www.theguardian.com/games/2022/mar/07/duck-hunt-light-gun\">Continue reading...</a>", "link": "https://www.theguardian.com/games/2022/mar/07/duck-hunt-light-gun", "date_published": "2022-03-07 09:00:40+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Oil spill at sea: who will pay for Peru’s worst environmental disaster?", "description": "<p>As the state, the refinery and tanker owners play the blame game, damage to the region’s ecosystems continues to spread</p><p>More than a month after Peru’s worst ever environmental disaster on its coastline there are few signs of reckoning for Repsol, the Spanish energy company that manages the refinery where more than 10,000 barrels of crude oil spewed into the Pacific Ocean after a routine tanker discharge went awry.</p><p>The black slick, pushed north by wind and currents, tarred 25 beaches, polluted three protected marine reserves, and <a href=\"https://www.reuters.com/world/americas/peru-oil-spill-affected-area-size-paris-repsol-says-2022-02-18/\">covers an area of about 106 sq km</a> (40 sq miles) – the size of Paris.</p> <a href=\"https://www.theguardian.com/environment/2022/mar/07/oil-spill-at-sea-who-will-pay-peru-worst-environmental-disaster\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/mar/07/oil-spill-at-sea-who-will-pay-peru-worst-environmental-disaster", "date_published": "2022-03-07 08:45:39+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Why have some people never caught Covid? The answers could help protect us all | Zania Stamataki", "description": "<p>I’m a Covid researcher, but I’ve never tested positive. Studying variations in immune systems could lead to better vaccines</p><p>I’m one of the fortunate people who is yet to test positive for Covid. This is despite the fact that I work with live replicating Sars-CoV-2 (the virus that causes Covid) for my research, teach face-to-face at university, and have school-age children.</p><p>My fully vaccinated healthy friends of the same age were not so lucky, and some have suffered from more than one case of Covid in the past couple of years. What does this reveal about my immune system?</p><p>Dr Zania Stamataki is a senior lecturer and researcher in viral immunology at the University of Birmingham</p> <a href=\"https://www.theguardian.com/commentisfree/2022/mar/07/never-caught-covid-immune-systems-vaccines\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/mar/07/never-caught-covid-immune-systems-vaccines", "date_published": "2022-03-07 08:00:39+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "No sound but the wind: winter in Ohio by photographer Vanessa Winship", "description": "<p>Snow, the new monograph by Vanessa Winship, is a body of work made in rural Ohio. Winship found something special in the area that drew her back on repeated trips to a particular landscape and, notably, a particular season. We present an extract from the book in which her pictures are accompanied by a story by Jem Poster of a fictional encounter between a photographer and her subject.</p><p>An exhibition of Winship’s work opens at <a href=\"https://huxleyparlour.com/exhibitions/the-season/\">Huxley Parlour</a> in London on 16 March</p><p><em>The following piece of fiction by the poet and novelist Jem Poster is taken from Snow, and tells of a female portrait photographer and her recalcitrant subject. But this character is not Vanessa Winship, and the sitter is not someone in a Winship photograph ...</em></p><p>As I drive out of town the wind is rising, whipping the powdery snow from the roadside shrubs and sending it whirling across the blacktop. I know what I’m looking for but I see the sign a moment too late. The surface is treacherous. I let the car slow to walking pace before I brake.</p> <a href=\"https://www.theguardian.com/artanddesign/2022/mar/07/no-sound-but-the-wind-winter-in-ohio-by-photographer-vanessa-winship\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/2022/mar/07/no-sound-but-the-wind-winter-in-ohio-by-photographer-vanessa-winship", "date_published": "2022-03-07 07:00:38+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Six promises you can make to help reduce carbon emissions", "description": "<p>From using smartphones for longer to ending car ownership, research shows ‘less stuff and more joy’ is the way forward</p><ul><li><a href=\"https://www.theguardian.com/environment/2022/mar/07/six-key-lifestyle-changes-can-help-avert-the-climate-crisis-study-finds\">Six key lifestyle changes can help avert the climate crisis, study finds</a></li></ul><p>Research shows that people in wealthier, high-consuming countries can help avert climate breakdown by making six relatively straightforward lifestyle changes, creating a society of “less stuff and more joy”.</p><p>Experts say if enacted these “shifts” would account for a quarter of the required emissions reductions needed to keep the global heating down to 1.5C and increase pressure on government and the private sector to make the necessary far-reaching systemic change.</p> <a href=\"https://www.theguardian.com/environment/2022/mar/07/six-promises-you-can-make-to-help-reduce-carbon-emissions\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/mar/07/six-promises-you-can-make-to-help-reduce-carbon-emissions", "date_published": "2022-03-07 07:00:38+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Samsung Galaxy S22+ review: a good phone playing it safe", "description": "<p>Premium Android has good screen and camera, longer updates and recycled materials – but lacks wow factor</p><p>The Galaxy S22+ is Samsung’s big-screen premium phone for 2022, offering top specs and good quality hardware, but little in the way of novel or exciting features. It’s a safe, solid device.</p><p>With an RRP of £949 ($999/A$1,549) that doesn’t mean low cost, but it is £200 cheaper than the all-singing, all-dancing £1,149 S22 Ultra superphone with its <a href=\"https://www.theguardian.com/technology/2020/aug/18/samsung-galaxy-note-20-ultra-review-super-priced-superphone-camera\">Galaxy Note-like design</a>. Shop around, though, and you should soon be able to find it for less.</p><p><strong>Main screen:</strong> 6.6in FHD+ Dynamic Amoled 2X (393ppi) 120Hz</p><p><strong>Processor:</strong> Samsung Exynos 2200 (EU) or Qualcomm Snapdragon 8 Gen 1 (US)</p><p><strong>RAM:</strong> 8GB of RAM</p><p><strong>Storage:</strong> 128 or 256GB</p><p><strong>Operating system:</strong> One UI 4.1 based on Android 12</p><p><strong>Camera:</strong> Triple rear camera: 50MP wide, 12MP ultra-wide, 10MP 3x telephoto; 10MP front-facing</p><p><strong>Connectivity:</strong> 5G, dual nano sim, USB-C, wifi 6E, NFC, Bluetooth 5.2, UWB and GNSS</p><p><strong>Water resistance:</strong> IP68 (1.5m for 30 mins)</p><p><strong>Dimensions:</strong> 157.4 x 75.8 x 7.6mm</p><p><strong>Weight:</strong> 195g</p> <a href=\"https://www.theguardian.com/technology/2022/mar/07/samsung-galaxy-s22-review-a-good-phone-playing-it-safe-screen-camera\">Continue reading...</a>", "link": "https://www.theguardian.com/technology/2022/mar/07/samsung-galaxy-s22-review-a-good-phone-playing-it-safe-screen-camera", "date_published": "2022-03-07 07:00:37+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Six key lifestyle changes can help avert the climate crisis, study finds", "description": "<p>Research shows that governments and individuals making small changes can have a huge impact in reducing emissions</p><ul><li><a href=\"https://www.theguardian.com/environment/2022/mar/07/six-promises-you-can-make-to-help-reduce-carbon-emissions\">Six promises you can make to help reduce carbon emissions</a></li></ul><p>People in well-off countries can help avert climate breakdown by making six relatively straightforward lifestyle changes, according to research from three leading institutions.</p><p>The study found that sticking to six specific commitments – from flying no more than once every three years to only buying three new items of clothing a year – could rein in the runaway consumption that is partially driving the climate crisis.</p> <a href=\"https://www.theguardian.com/environment/2022/mar/07/six-key-lifestyle-changes-can-help-avert-the-climate-crisis-study-finds\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/mar/07/six-key-lifestyle-changes-can-help-avert-the-climate-crisis-study-finds", "date_published": "2022-03-07 07:00:37+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "How to stop wasting food and save money", "description": "<p>We throw out £2.1bn-worth of fresh fruit and veg each year because it’s mouldy, gone soft or is out of date</p><p>About £2.1bn-worth of fresh fruit and vegetables is thrown away in UK homes each year because it has gone soft, mouldy or is out of date.</p> <a href=\"https://www.theguardian.com/money/2022/mar/07/how-to-stop-wasting-food-and-save-money\">Continue reading...</a>", "link": "https://www.theguardian.com/money/2022/mar/07/how-to-stop-wasting-food-and-save-money", "date_published": "2022-03-07 07:00:36+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Now we know: Russia’s horrific past could become our future under Putin | Dmitry Glukhovsky", "description": "<p>My generation never suffered Soviet-era repression, but now we face the dilemma of previous generations: to acquiesce or fight back</p><ul><li>Dmitry Glukhovsky is a Russian novelist and journalist</li></ul><p>My generation didn’t experience the mass repressions and purges; didn’t experience the show trials in which the wrathful public demanded the executions of traitors to the Motherland; didn’t live in an atmosphere of universal horror; didn’t learn how to change our worldview from one day to the next, to believe in the insidiousness of yesterday’s allies and the good intentions of yesterday’s enemies at the drop of a hat, to justify fratricidal wars.</p><p>The <a href=\"https://www.theguardian.com/world/2021/dec/27/dignified-but-bitter-farewell-to-soviet-union-1991\">Soviet Union that we experienced</a> was already quite the herbivore: it no longer executed people for not believing in its core, binding lie, allowing them to question things quietly to themselves in the comfort of their kitchens; neither did it demand applause when the heads of those designated as “enemies of the people” rolled.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/mar/07/russias-past-future-under-putin-soviet-repression\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/mar/07/russias-past-future-under-putin-soviet-repression", "date_published": "2022-03-07 06:00:37+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Surreal: art’s weirdest worldview bounces back a century after its birth", "description": "<p>Literary and artistic movement enjoying another golden age, with international events and exhibitions</p><p><a href=\"https://media.gutools.co.uk/search?query=%23surrealism-paris\"><br /></a>A century ago in the ateliers of Montparnasse in Paris, surrealism was born from the gloom of the first world war that had engulfed and devastated Europe.</p><p>The cultural movement led by the French writer and poet André Breton would give rise to artists of international renown including Max Ernst, <a href=\"https://www.theguardian.com/artanddesign/2011/mar/20/joan-miro-life-ladder-escape-tate\">Joan Miró</a>, René Magritte, Yves Tanguy, and Salvador Dalí.</p> <a href=\"https://www.theguardian.com/artanddesign/2022/mar/07/surreal-arts-weirdest-worldview-bounces-back-a-century-after-its-birth\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/2022/mar/07/surreal-arts-weirdest-worldview-bounces-back-a-century-after-its-birth", "date_published": "2022-03-07 05:30:35+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Ukraine’s pro-Russian monasteries draw local suspicion", "description": "<p>War has sharpened the split between Ukraine and Russia’s Orthodox churches, with some historic sites in Ukraine still loyal to Moscow</p><p>As war kicked off in Ukraine, soldiers at a military airstrip in the west of the country went hunting for the origin of a laser pointer they feared was marking out targets on their base.</p><p>They found it in a nearby church. Behind the thick walls of the building in Kolomyia, run by monks loyal to Moscow, they also discovered a large stockpile of food and alcohol, and three guns.</p> <a href=\"https://www.theguardian.com/world/2022/mar/07/ukraines-pro-russian-monasteries-draw-local-suspicion\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/mar/07/ukraines-pro-russian-monasteries-draw-local-suspicion", "date_published": "2022-03-07 05:00:35+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Kicking the habit: footballing nuns’ goal is to pass on word of God", "description": "<p>The nuns, based in Italy, have heeded the advice of Pope Francis to get out more and avoid becoming ‘old maids’</p><p>The women huddled in the centre of the pitch, to briefly strategise, to pray for Ukraine. Then the whistle blew, and to cries of “Forza, sisters!” from their fans, they prepared for kick-off.</p><p>The youngest player is 27, the eldest 52, and they are among the 18 brought together from congregations across Italy to form the first national football team for nuns in the world.</p> <a href=\"https://www.theguardian.com/football/2022/mar/07/no-novices-footballing-nuns-italy-kick-habit\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/mar/07/no-novices-footballing-nuns-italy-kick-habit", "date_published": "2022-03-07 05:00:34+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Ukrainian reservists marry in military fatigues at Kyiv checkpoint", "description": "<p>On day 11 of Russia's invasion of Ukraine, long-term partners Lesia Ivashchenko and Valerii Filimonov married at a checkpoint in Kyiv on 6 March. The couple, both members of Ukraine's territorial defence unit, decided to forgo formal wear and don their uniforms instead</p><ul><li><a href=\"https://www.theguardian.com/world/series/ukraine-live/latest\">Russia-Ukraine war live</a></li></ul> <a href=\"https://www.theguardian.com/world/video/2022/mar/07/in-military-fatigues-ukrainian-reservists-marry-at-kyiv-checkpoint-video\">Continue reading...</a>", "link": "https://www.theguardian.com/world/video/2022/mar/07/in-military-fatigues-ukrainian-reservists-marry-at-kyiv-checkpoint-video", "date_published": "2022-03-07 04:21:01+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The scandal of Britain’s ‘ghost’ flights", "description": "<p>At least 15,000 flights have taken off from UK airports since March 2020 at less than 10% capacity or even with no passengers at all. The Guardian’s environment editor, Damian Carrington, attempts to find out why</p><p>When the Covid pandemic struck in 2020, one of the hardest-hit industries was aviation. Passengers, either confined to their homes under lockdown or fearful of getting stuck abroad, simply stopped flying. But as the Guardian’s environment editor, <strong>Damian Carrington</strong>, tells <strong>Michael Safi, </strong>something strange was going on: just because planes didn’t have any passengers, that didn’t necessarily mean they didn’t keep flying. These flights, with few or no passengers, are known as ‘ghost flights’.</p><p>According to newly revealed official figures, almost 15,000 ghost flights have departed from UK airports in March 2020 and September 2021. Flying is one of the most polluting and carbon-intensive activities people can undertake and ghost flights have angered those campaigning for action on the climate crisis. Carrington explains that some of these flights are a result of the long-established system forcing airlines to maintain flights in their airport ‘slots’ or risk losing their position to rivals. But this doesn’t explain those flights in the pandemic period when the slot system was paused. So why did airlines continue to fly heavily polluting empty flights?</p> <a href=\"https://www.theguardian.com/news/audio/2022/mar/07/the-scandal-of-britains-ghost-flights-podcast\">Continue reading...</a>", "link": "https://www.theguardian.com/news/audio/2022/mar/07/the-scandal-of-britains-ghost-flights-podcast", "date_published": "2022-03-07 03:00:32+00:00", "persistent": false, "user": null, "language": "en-UK"}]