[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Newtown Divided (full documentary) | FRONTLINE", "description": "In the wake of the May 24, 2022, school shooting in Uvalde, Texas, that killed 21 people, 19 of them children, attention has again turned to America's gun debate. Revisit the divide that split Newtown, Connecticut, after the 2012 Sandy Hook school shooting. (Aired 2013)\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nIn the aftermath of the Sandy Hook tragedy, Newtown residents engaged in a debate over guns that could have taken place almost anywhere in America. The issue: Should amateur shooting ranges be subject to inspection and approval by the police chief? On one side were residents concerned about noise and unregulated shooting. On the other, those who see gun rights as an essential American freedom.\n\nFind FRONTLINE on the PBS Video App, where there are more than 300 FRONTLINE documentaries available to watch any time: https://to.pbs.org/FLVideoApp​ \n\n#Documentary #FRONTLINE #SchoolShooting #Uvalde #RobbElementary\n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nFRONTLINE is produced at GBH in Boston and is broadcast nationwide on PBS. Funding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; the Heising-Simons Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.\n\nCHAPTERS:\nThe Sandy Hook Parents - 00:00\nGun Owners & Gun Lobby - 04:56\nThe Gun Debate - 13:25\nCredits - 18:24", "link": "https://www.youtube.com/watch?v=qfh0ligFOX4", "date_published": "2022-06-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]