[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Season 1 Hands-on Preview: Addition By Subtraction", "description": "Developer DICE adds a new map, a new specialist, new vehicles, and new weapons in Battlefield 2042's first season, along with adjustments in approach.\n\nZero Hour launches for all players on June 9, but GameSpot got a chance to spend a couple of hours playing with some of its new content additions during a preview event this week. That session put us on Exposure, the new map coming to Battlefield 2042 available to all players. Exposure feels like it sets a different tone from some of BF 2042's other maps, with a host of differing locations and a focus on verticality that goes beyond what we've previously seen in the game.\n\nWe played both Breakthrough and Conquest on Exposure, with the former mode using a smaller portion of the map and confining its player count to 64. The smaller Breakthrough approach is reflective of one of BF 2042's biggest changes going forward. DICE is \"unshackling\" its All-Out Warfare modes from its previous 128-player count, and will instead be focusing on somewhat smaller maps with more cover and density with seasonal releases going forward. You'll still find 128-player modes on original launch maps and Exposure offers 128-player Conquest, but starting in Season 2, new maps will stop supporting 128-player modes and top out at 64 players.\n\nDICE is adding a new specialist character in Season 1: anti-vehicle engineer Lis. The character is especially good at taking down airborn threats, it seems, with Lis sporting a tele-guided missile launcher--which means you control the missile and fly it into your target. Helicopters might sport radar-breaking stealth, but if you're using Lis, you can use her launcher to bypass the need for any smart tracking and do the aiming yourself.\n\nAdding some new variety for the rest of Season 1 are two new weapons and a new gadget to help spice up some loadouts. DICE is adding a new designated marksman rifle called the BSV-M, which is like having a sniper rifle that can also handle close combat. The gun comes with an integrated suppressor, to keep the noise down and make you tougher for enemies to find as you fight, along with single-fire and fully automatic firing modes. Even more fun than the BSV-M, though, is the new Ghostmaker Crossbow. The single-firing bow has a surprisingly long range, keeping it effective at a variety of distances, and it's nearly silent. At closer ranges, it'll generally earn you a one-hit kill--provided you actually hit what you're shooting at. Miss, and you'll suffer through a painfully long reload animation that leaves you extremely open to getting blasted by any faster-firing weapon. But if you land the hit, the crossbow is incredibly satisfying, and can even be effective at longer ranges, even though you'll have to land two or three shots to win a fight.\n\n#BF2042 #battlefield2042", "link": "https://www.youtube.com/watch?v=xeaZf2ew-bM", "date_published": "2022-06-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Zero Hour Season 1 Gameplay Trailer", "description": "Check out Battlefield 2042's first season Zero Hour in this latest gameplay trailer. Get a glimpse of what to expect!\n\nBattlefield 2042 is a first-person shooter made up of three distinct multiplayer experiences. All-Out Warfare features the next generation of fan-favorite modes Conquest and Breakthrough; Battlefield Portal allowing players to discover battles from the past, present, and future as well as to create and change the rules of war, while Battlefield Hazard Zone brings a tense, squad-focused survival experience. Adapt and overcome on dynamically-changing battlegrounds with the help of your squad and a cutting-edge arsenal, and prepare for unprecedented scale with up to 128 players*.\n\n#battlefield2042 #bf2042", "link": "https://www.youtube.com/watch?v=qUbOK2IJHak", "date_published": "2022-06-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Hollow Knight Fans React To Silksong Speculation | GameSpot News", "description": "Hollow Knight fans react to new Silksong speculation, Geoff Keighley reveals more about Summer Game Fest, Microsoft announces Xbox Showcase Extended and Goldeneye 007 Remastered achievements leak again. \n#GamingNews #Silksong #summergamefest \n\nDuring a recent Twitter Spaces discussion, Keighly confirmed the show will have \"a couple\" new game announcements, but it will be more focused on games that have already been announced. \n\nKeighley said people can expect to see games like The Callisto Protocol, Call of Duty: Modern Warfare 2, Gotham Knights, and Cuphead: The Delicious Last Course during the event, while Dwayne \"The Rock\" Johnson will be there as well for some kind of announcement.\n\nHollow Knight fans have their fingers crossed tight following a couple tweets today. It all began when Geoff Keighly tweeted, “There’s nothing like the feeling of seeing a good world premiere arrive in your inbox.\" Matthew Griffin, a member of Team Cherry's marketing and publishing team, replied to the tweet, saying \"I approve of the tease =P\".\n\n20 Questions With Geoff Keighley - https://www.youtube.com/watch?v=zNsWYBuQWmg\n\nVGC first reported that Wario64, who frequently tweets video game sales and bargains, spotted achievements for Goldeneye 007 on Xbox servers this past Sunday. This is not the first time that a potential Goldeneye remaster's achievements have leaked, nor Wario64's first time leaking its existence. Back in January, they leaked the exact same achievements, which can still be found on TrueAchievements.\n\nSTAMPS\n00:00 - INTRO\n00:06 - Summer Game Fest Info\n00:45 - Silksong Speculation\n01:38 - Xbox Showcase Extended\n02:27 - Goldeneye 007 achievements", "link": "https://www.youtube.com/watch?v=T2-xi21UjGs", "date_published": "2022-06-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Most Memorable E3 Moments", "description": "The eve of Summer Game Fest is upon us. Yet there is one former gaming event giant that won’t be part of the festivities this year… E3. The Electronic Gaming Expo sadly announced it was canceling its 2022 event, leaving us with only our memories. Yet, E3 has given us numerous memorable moments and memes from its two decades of history, so today we’re shouting out some of our favorites, from the breathtaking Keanu Reeves to the cringiest PlayStation moments.\n\nTimecodes\n0:00 - Intro\n0:37 - PlayStation 3 Price Announcement\n1:54 - Sony Dunks on Microsoft\n3:11 - Keanu Reeves's Breathtaking Moment\n4:08 - Peter Moore's GTAIV Tattoo\n4:57 - Unisoft's Battle Tag Cringe\n5:55 - Konami's Embarrassing Conference\n7:15 - Wii Music Performance\n8:12 - Zelda Skyward Sword Fail\n9:16 - Miyamoto Makes a Developer Cry\n10:10 - Outro\n\n#E3 #SGF2022", "link": "https://www.youtube.com/watch?v=a1EGyHI12nY", "date_published": "2022-06-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Netflix Geeked Week - Day 2 Livestream | Film Showcase, The Gray Man & The School for Good & Evil", "description": "It's Netflix's Geeked Week, a celebration and showcase of all things geeked coming from Netflix. Day 2 includes the Film Showcase, The Gray Man, The School for Good & Evil, and more.", "link": "https://www.youtube.com/watch?v=7QNt8Z-dYb8", "date_published": "2022-06-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sonic Central Full Presentation (June 2022)", "description": "Check out the latest Sonic Central that aired on June 7th showcasing Knuckles for the first time in Sonic Frontiers. Also hear from the voice of Sonic as they tease the Blue Ray release for the latest Sonic movie. Additionally get a look at Sonic Origins as well before the release later this month.\n\n#Sonic #sonicthehedgehog #Gaming", "link": "https://www.youtube.com/watch?v=oQYIycgGFu8", "date_published": "2022-06-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sonic Central Livestream Summer 2022", "description": "Tune in on June 7th at 9am PDT for a sneak peek at some of the upcoming projects, partnerships, and events happening in 2022 for the blue hedgehog in this latest Sonic Central Summer Showcase.\n\nWill we learn more about Sonic Frontiers, Sonic Origins, and other news? \n\n#Sonic #sonicthehedgehog #gaming", "link": "https://www.youtube.com/watch?v=1v8PR2MfiHQ", "date_published": "2022-06-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Limited Run Games LRG3 Showcase (ft. Mega64)", "description": "Limited Run Games is teaming up with Mega64 for the LRG3 Showcase, featuring over 30 trailers and physicals release reveals.\n\n#Summergamefest #SGF2022", "link": "https://www.youtube.com/watch?v=yw5v27xUx3Q", "date_published": "2022-06-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mario Strikers: Battle League | Everything To Know", "description": "Mario Strikers: Battle League is coming to Nintendo Switch letting you watch some of your favorite Mario characters duke it out on the soccer pitch. Here's everything you need to know about Mario's latest adventure\n\nMario Strikers: Battle League isn’t exactly the newest FIFA game. Instead, it takes the iconic plumber, and many of his most popular friends and rivals and has them duke it out on the soccer pitch. This video breaks down everything you need to know ahead of the upcoming release of Mario Strikers: Battle League on June 10th.\n\nThe game adds a fun arcadey twist to the game of soccer by eliminating all fouls. This means characters will violently and hilariously tackle each other, all in the name of sportsmanship. Don’t worry if you get beat up since getting tackled is one way you will receive items similar to those you might find in a Mario Party or Mario Kart game, letting you even the odds a bit.\n\nLastly, you can take an awesome final smash style shot where the game will add really cool animations as your character levels an unblockable shot if you time the shot perfectly. Don’t worry if you miss the window, though, as you’ll still have a good chance at making a goal, although if you’re unlucky, the ball might land in the goalie’s hands. Mario Strikers: Battle League comes out exclusively on Nintendo Switch. See you on the pitch!\n\n#MarioStrikers #battleleague", "link": "https://www.youtube.com/watch?v=vbpV3qAKE-4", "date_published": "2022-06-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Netflix Geeked Week - Day 1 Livestream | Series Showcase, The Sandman & The Umbrella Academy", "description": "It's Netflix's Geeked Week, a celebration and showcase of all things geeked coming from Netflix. Day 1 includes the Series Showcase, The Sandman, & The Umbrella Academy, and more.\n\n#GeekedWeek #Netflix", "link": "https://www.youtube.com/watch?v=UQEyzdaS4Qk", "date_published": "2022-06-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]