[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Gameplay Overview Trailer", "description": "Learn more about the various mechanics, and more in this official gameplay trailer for Elden Ring.\n\nMuch has changed in The Lands Between since the days of your banishment, Tarnished. Come learn what awaits you on the path of grace.\n\nELDEN RING releases on February 25, 2022.\n\n#EldenRing", "link": "https://www.youtube.com/watch?v=pDUZNP52obY", "date_published": "2022-02-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Destiny 2’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Destiny 2, including the Gjallarhorn rocket launcher, the bizarre Cerberus +1 shotgun, and the iconic The Last Word revolver.\n\n00:00 - Opening\n00:42 - Ace of Spades\n02:40 - Dead Man’s Tale \n05:33 - Duality \n08:14 - Cerberus +1\n10:46 - Gjallarhorn\n12:59 - The Last Word \n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down more of the guns from Destiny 2 and compares them to their potential real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=CtGSHgdLy3M", "date_published": "2022-02-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Playing Uncharted: Drake’s Fortune For The First Time in 2022", "description": "Uncharted is an iconic franchise, a game that is firmly cemented to a whole family of consoles and a series that helped shape a studio’s development and storytelling, but our Dave Jewitt has never played it!\nDoes the game stand the test of time? Is it worth exploiting for new players? Do enemies ever run out of grenades? Dave has to answer all these questions and more.\n\n#Uncharted", "link": "https://www.youtube.com/watch?v=Y9D1gx9yxBg", "date_published": "2022-02-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Uncharted Movie Post-Credits & Game References Explained", "description": "While the Uncharted movie largely charts its own path with an original story different to Naughty Dog’s game series, there are a handful of easter eggs and game references for eagle-eyed fans to keep a lookout for. And not only that, but it ends with a post-credits sting that teases a sequel that might actually follow the games a lot more closely.\n\n00:00 - Opening\n00:22 - Sam Drake\n01:11 - Post-credits scene\n03:06 - Game  References & Easter Eggs\n05:31 - Character Origins\n06:42 - Big Cameo\n07:16 - Ending\n\nIn the post-credits scene we see Nathan Drake and Sully meet with a shady-looking, eyepatch-sporting Pilou Asbaek, and they’re discussing their potential next big job, which Sully says could be the big one. There’s mention of a Nazi treasure map and another character simply called Roman - both of which are pretty solid references to the very first game in the franchise, Uncharted: Drake’s Fortune. \n\nIn that game, Nate, Sully and Elena Fisher - Nate’s future wife - search for the lost treasure of El Dorado, and encounter - among other things - a Nazi U-boat in the jungle, as well as a German U-boat station in a race against rival treasure hunter, Gabriel Roman - potentially the Roman who’s namechecked in this scene.\n\nThe Complete Uncharted Timeline Explained - https://www.youtube.com/watch?v=0xHZFaybvZE&t=1s", "link": "https://www.youtube.com/watch?v=f3wpmFERaSQ", "date_published": "2022-02-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Size & Preload Details | GameSpot News", "description": "Elden Ring file size and preloading are confirmed on Xbox consoles, Activision gives an update on Call of Duty anti-cheat, and EA responds to reports that Halo Infinite hurt Battlefield 2042. \n\nIn this video, DeVante talks about Elden Ring’s file size and preloading, which is currently live for Xbox players. A preload date hasn't been announced yet for PlayStation consoles or PC. Elden Ring releases on February 25, 2022 for PlayStation, Xbox and PC. \n\nDeVante also talks about reports that said the launch of Halo Infinite might have contributed to the lower-than-expected results. Fans may recall that Microsoft surprise-launched Halo Infinite's multiplayer on November 15, just days before Battlefield 2042. \n\nLater in the video, he explains a new blog post from Activision that said cheating within Warzone reached an \"all-time low\" during the holidays, speaking to the success of the Ricochet tools.\n\nSTAMPS\n00:00 - Intro \n00:10 - Elden Ring\n01:06 - Battlefield\n02:36 - Call of Duty\n\n#GameSpotNews #EldenRing #Battlefield2042", "link": "https://www.youtube.com/watch?v=89xIXegs_KA", "date_published": "2022-02-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Is Cyberpunk 2077 Finally In The State It Should Be?", "description": "Cyberpunk 2077 launches on next-gen PS5 and Xbox Series X/S with patch 1.5. Lucy and Jean-Luc dive into if the game is finally in the bug-free and fully playable state it should have been at launch, as well as touch on added features like new apartments and weapons.\n\nThe next-gen versions of Cyberpunk 2077 come with both a performance and ray tracing mode, giving players the option for 60fps or 30fps with ray-traced shadows. It also features another round of bug fixes. While the game still isn't perfect, the game's current state feels more than acceptable, and we feel confident in saying that Cyberpunk is finally in a good playable state for players to enjoy. Patch 1.5 also features some more dramatic gameplay changes like new skills, a rebalanced economy, the option to change your appearance after the start, and even new apartments for V to rent. Only time will tell where Cyberpunk will go from here but for now it's nice to just sit back and experience the game for what it is.\n\nTimestamps:\n00:00 - Intro\n01:02 - PlayStation 5 Version\n05:38 - PC Version\n06:39 - Quality of Life Improvements\n09:27 - Are There Still Bugs?\n10:24 - Skills & Apartments\n11:19 - What's The Future For Cyberpunk?", "link": "https://www.youtube.com/watch?v=5eeZiVJP33k", "date_published": "2022-02-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Rainbow Six Extraction - Spillover Crisis Event Gameplay", "description": "Rainbow Six Extraction is having it's first post-launch, limited time event- Spillover. Check out our gameplay as we defend and decontaminate hot zones throughout the San Francisco map. \n\nRainbow Six Extraction is dropping their first post-launch update with \"Spillover\". Ubisoft announced \"Crisis Events\" prior to the launch of Extraction with updates including new operators, REACT-Tech and more. Ubisoft invited GameSpot to an early access event where we got to check out the latest update before release. In between in-game assignments, Crisis modes will only last for three weeks, so be sure to squad up and unlock all the limited-timed goodness. \n\nSpillover is the first Crisis Event available for Tom Clancy's Rainbow Six Extraction. Spillover introduces Zofia as a brand new playable operator as well as new gadgets, cosmetics, and lore.\n\nWith more Crisis events Rainbow Six Extraction coming soon, stay tuned to GameSpot for all the latest. Rainbow Six Extraction is available on PS4, PS5, Xbox One, Xbox Series X/S and PC. with the Spillover event coming soon.", "link": "https://www.youtube.com/watch?v=xHkeOrOUtmY", "date_published": "2022-02-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]