[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Please send to politicians", "description": "Germany’s vaccination board STIKO ständige Impfkomission, Standing commission for vaccination \n\nhttps://www.rki.de/DE/Content/Infekt/EpidBull/Archiv/2022/Ausgaben/07_22.pdf?__blob=publicationFile\n\nNow recommends aspiration\n\nThe vaccine is to be injected only intramuscular (i.m.), \n\nand in no case intradermal, subcutaneous, or intravenous.\n\nIn animal models, direct intravenous injection of an mRNA vaccine has led to Myopericarditis (both clinically and histopathologically).\n \nAlthough inadvertent intravenous injections are rare during application of intramuscular vaccines, \n\naspiration of the needle is a sensible precaution when vaccinating against COVID-19 and can lead to increased safety.\n\nFerdinand, thank you\n\nDenmark\n\nhttps://en.ssi.dk/news/epi-news/2021/no-19-21---2021\n\nBasically, we need to change the vaccine administration guidelines to include precautionary aspiration, prior to pushing in the vaccine. This will prevent cases of inadvertent intravascular administration of vaccine.\n\nHere is some discussion to suggest inadvertent intravascular vaccine administration is a variable in the aetiology of complications after adenoviral vector vaccine administration and after mRNA vaccines.\n\nThese adverse events, although rare have reduced public confidence in covid vaccination, especially amongst the young, where vaccine rates are lowest.\n\nIt has long been known that intravenous injection of adenovirus leads to TTS in mice\n\nhttps://ashpublications.org/blood/article/109/7/2832/125650/Adenovirus-induced-thrombocytopenia-the-role-of\n\nNow, new covid vaccine specific work agrees with this previous work\n\nThrombocytopenia and splenic platelet directed immune responses after intravenous ChAdOx1 nCov-19 administration (29th June 2021)\n\nhttps://www.biorxiv.org/content/10.1101/2021.06.29.450356v1\n\nThe authors conclude, ‘Our work contributes to the understanding of TTS and highlights accidental intravenous injection as potential mechanism for post-vaccination TTS.’ \n\n‘We show that intravenous but not intramuscular injection of ChAdOx1 triggers platelet-adenovirus aggregate formation and platelet activation.’ \n\n‘Hence, safe intramuscular injection, with aspiration prior to injection, could be a potential preventive measure when administering adenovirus-based vaccines.’\n\nAlso after giving mRNA vaccines\n\nA new study finds that giving mice intravenous mRNA vaccine also causes heart inflammation in mice. \n\nIntravenous Injection of Coronavirus Disease 2019 (COVID-19) mRNA Vaccine Can Induce Acute Myopericarditis in Mouse Model (August 2021)\n\nhttps://academic.oup.com/cid/advance-article/doi/10.1093/cid/ciab707/6353927\n\n‘Our study indicates that IV injection of vaccines might partially contribute to this clinical phenotype, thus warranting a reconsideration of the practice of IM injection without aspiration, which carries the risk of inadvertent IV injection.’ \n\nAgreement from ‘fact check’ from Leo Nicolai, Cardiology Fellow, Ludwig Maximilian University of Munich:\n\n(German Centre for Cardiovascular Research)\n\nhttps://healthfeedback.org/claimreview/incorrect-vaccine-administration-is-a-potential-cause-of-post-vaccine-adverse-effects-but-more-research-is-still-needed-to-confirm-or-reject-this-hypothesis/?fbclid=IwAR0nBbM6v0V2WPFn4LxIdfR4FNAvIzLGKhzFPdQPG8mu_FR1InB8OzYQgMc\n\n‘Indeed, there is peer-reviewed work showing in mice that possibly intravenous injection of mRNA vaccine leads to myocardial inflammation.’\n\n‘that intravenous injection of adenoviral vector based vaccine (AZ1222, ChAdOx1) leads to thrombocytopenia and platelet-directed immune responses, offering a possible explanation for vaccine-induced thrombosis/thrombocytopenia’\n\n‘these data might indicate a simple measure to lower the incidence of vaccine-induced side effects,’\n\n‘There is a lack of data on frequency and effects of IV injection in humans.’\n\nDenmark has changed their national guidelines\n\nhttps://en.ssi.dk/news/epi-news/2021/no-19-21---2021\n\nBased on a precautionary principle, we recommend aspiration before injection.\n\nhttps://www.youtube.com/watch?v=H7inaTiDKaU\n\nEvidence from Dr. Peter Gaillard (microparticulate pharmacologist)\n\nhttps://www.linkedin.com/pulse/astrazeneca-vaccine-pull-back-push-through-pieter-j-gaillard/?trk=pulse-article_more-articles_related-content-card \n\nCase study evidence\n\nMetallic taste in the mouth seconds after ‘intramuscular’ mRNA vaccine administration, (in the absence of an allergic reaction)\n\nhttps://www.youtube.com/watch?v=hbjuWs99CrE\n\nOther video-based discussions\n\n26th September 2021\n\nhttps://www.youtube.com/watch?v=nBaIRm4610o\n\n30th September 2021\n\nhttps://www.youtube.com/watch?v=KgVsd6qoyU4", "link": "https://www.youtube.com/watch?v=NVXA9posslo", "date_published": "2022-02-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Adam", "description": "Adam became unwell, 2 weeks after his first Pfizer vaccine. Thank you so much Adam for this interview and your permission to use it.", "link": "https://www.youtube.com/watch?v=NAyQds9DAHw", "date_published": "2022-02-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Prevalence remains high", "description": "California, SMARTER Plan\nhttps://files.covid19.ca.gov/pdf/smarterplan.pdf\n\nThe release of the California SMARTER Plan: The Next Phase of California’s COVID-19 Response\n\nIt is clear the virus will remain with us for some time, if not forever. \n\nHowever, we know what works, and have built the necessary tools over the last two years that allows us to learn and hone our defenses to this virus as it evolves.\n \nAs we enter the next phase with COVID-19, which may include future surges and new variants, \n\nIn our approach to this next phase, we will be smarter than ever before, using the lessons of the last two years to approach mitigation and adaptation measures\n\nThis includes vaccines, masks, tests, quarantine, improving ventilation, and new therapeutics. \n\nBut California’s path forward will also be predicated on our individual, smarter actions, that will collectively yield better outcomes for our neighborhoods, communities, and state. \n\n Shots- Vaccines are the most powerful weapon against hospitalization and serious illness. \nMasks- Properly worn masks with good filtration help slow the spread of COVID-19 or other respiratory viruses. \nAwareness- We will continue to stay aware of how COVID-19 is spreading, evolving variants, communicate clearly how people should protect themselves, and coordinate our state and local government response. \nReadiness- COVID-19 isn’t going away and we need to be ready with the tools, resources and supplies we will need to quickly respond and keep public health and the health care system well prepared. \nTesting- Getting the right type of tests - PCR or antigen - to where they are needed most. Testing will help California minimize the spread of COVID-19. \nEducation- California will continue to work to keep schools open and children safely in classrooms for in-person instruction. \nRx- Evolving and improving treatments will become increasingly available and critical as a tool to save lives. \n\nZoe data\n\nhttps://covid.joinzoe.com\n\nUK R = 0.9\n\nEngland, 0.9\nWales, 1.0\nScotland, 1.1\n\nPrevalence\n\nUK,1 in 25 have symptomatic COVID\n\nONS, 1 in 20 in England\n\nAt least 36.7% of cold-like symptoms are likely to have symptomatic COVID-19\n\nProfessor Tim Spector\n\ncases remain historically high with one in 25 people currently having COVID,\n\nand numbers still increasing in Scotland and Northern Ireland. \n\nhospital and ICU admissions are very low, \n\nthe ZOE data doesn’t yet suggest that we’ve entered a stable or endemic phase. \n\ndéjà vu\n\nmy advice is we should all still be self isolating for five days from first new symptoms, when infectiousness is high\n\nNSW Government update to COVID-19 settings\n\nhttps://www.nsw.gov.au/media-releases/nsw-government-update-to-covid-19-settings\n\nEasing of restrictions, 18th and 25th February\n\nHospitalisation and ICU rates easing\n\nBooster uptake now above 50%\n\nStaged return of non-urgent elective surgery across all NSW public hospitals\n\nMinister for Health Brad Hazzard\n\nAs we are moving more into the endemic stage of the COVID-19 pandemic,\n\nThe best outcome is still to avoid getting the virus by protecting yourself, your family, and the broader community\n\nNovavax – first protein vaccine now available\n\nhttps://www.health.gov.au/ministers/the-hon-greg-hunt-mp/media/novavax-first-protein-vaccine-now-available\n\nhttps://www.health.gov.au/news/atagi-statement-on-the-use-of-novavax-covid-19-vaccine-nuvaxovid\n\nAustralian Technical Advisory Group on Immunisation\n\nATAGI recommends that Novavax COVID-19 vaccine can be used for the primary course of COVID-19 vaccination in people aged 18 or older.\n\nNovavax COVID-19 vaccine can be administered to pregnant and breastfeeding women. \n\nPeople with severe immunocompromise are recommended to receive 3 primary doses of COVID-19 vaccine, and Novavax COVID-19 vaccine can be used\n\nHeterologous use\n\nnot currently recommended for use as a booster vaccine\n\ncan be co-administered with other vaccines if required.\n\nMyocarditis\n\nit is not possible to determine if there is a causal relationship or to estimate the risk of myocarditis associated with this vaccine. \n\nIt is recommended that all COVID-19 vaccine recipients should be aware of the potential signs and symptoms of myocarditis or pericarditis, and should be counselled about when to seek medical attention.", "link": "https://www.youtube.com/watch?v=qfcSGoTUu7Y", "date_published": "2022-02-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]