[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCjr2bPAyPV7t35MvcgT3W8Q", "title": "Become Anonymous & Untraceable | How To Securely Install & Use Tails | Tor Tutorial", "description": "Tails - The Amnesic Incognito Live System, is the most anonymous operating system in the world. Edward Snowden used to leak the NSA documents. Here's how you can get it too.\nSupport me through Patreon: https://www.patreon.com/thehatedone \n- or donate anonymously:\nMonero:\n84DYxU8rPzQ88SxQqBF6VBNfPU9c5sjDXfTC1wXkgzWJfVMQ9zjAULL6rd11ASRGpxD1w6jQrMtqAGkkqiid5ef7QDroTPp\n\nBitcoin: \n1FuKzwa5LWR2xn49HqEPzS4PhTMxiRq689\n\nEthereum:\n0x6aD936198f8758279C2C153f84C379a35865FE0F\n\nOnline anonymity sometimes demands much more than just obfuscating your location and IP address. Some threat models require that you leave no trace of your activity on the device you are using. The problem is that regular operating systems are designed to store troves of sensitive data in the hardware of your machine. Even with full-device encryption, memory logs can often be easily recovered by an adversary with physical access to your device. Not everyone has the luxury of physical security and they have to assume that their computer will likely fall into the wrong hands.  \n\nThis is why security experts with a strong sense for protecting human rights in the digital world have been working on creating a system that doesn’t remember anything about itself. A system that forensically wipes all evidence of its use immediately after a user ends their session. A system that looks exactly the same no matter who uses it or for whatever purpose. And now such a system has a name. Tails. The Amnesic Incognito Live System.\n\nLive system, because it’s an operating system designed to run off of a USB flash drive, instead of being permanently installed on an internal drive. Incognito, because its entire traffic is routed through Tor and   the default fingerprint of each Tails installation matches perfectly with every other Tails users on the planet. Amnesic means every time you reboot, plug out your USB, or shut down, all information about your session activity is wiped from the USB flash drive as well as from the host memory. This forensic erasure leaves no files on the host system whatsoever. \n\nSources\nThe Official Tails Website: https://tails.boum.org/\nLinux Installation (followed in this video): https://tails.boum.org/install/linux/usb-overview/index.en.html\nLinux Installation (command line): https://tails.boum.org/install/expert/usb/index.en.html\nOfficial Tails Documentation: https://tails.boum.org/doc/index.en.html\nHow Snowden Used Tails: https://www.wired.com/2014/04/tails/ \n\nCredits\nMusic By Cuki Beats https://www.youtube.com/channel/UCSyBSyLk4ZvXd2Fj-tLojag\n\nFollow me:\nhttps://twitter.com/The_HatedOne_\nhttps://www.bitchute.com/TheHatedOne/\nhttps://www.reddit.com/r/thehatedone/\nhttps://www.minds.com/The_HatedOne\n\nThe footage and images featured in the video were for critical analysis, commentary and parody, which are protected under the Fair Use laws of the United States Copyright act of 1976.", "link": "https://www.youtube.com/watch?v=XwJpf5kICeg", "date_published": "2022-02-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]