[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Big Thief: Tiny Desk (Home) Concert", "description": "Bob Boilen | July 20, 2022\nI love seeing friends playing comfortably at home, especially when those friends are members of my favorite band. What we see in this Tiny Desk (home) concert is playfulness substituting for the intensity that I normally find in Big Thief on a big stage. This band has made many of my best-loved albums in the past few years, beginning with its 2016 debut Masterpiece and including its 2022 double-album Dragon New Warm Mountain I Believe in You. The first three songs in this set all come from that album and were written by singer Adrianne Lenker, with \"Certainty\" co-written with guitarist Buck Meek.\n\nBig Thief songs are often filled with tender tales and poetic and playful words. I can say the same for Adrianne Lenker's many solo albums and for Buck Meek's 2021 solo album, Two Saviors. Drummer James Krivchenia produced Big Thief's recent album and also a 2020 ambient album of his own, A New Found Relaxation. Max Oleartchik plays upright bass for this intimate acoustic set on the top floor of a house in \"windy Connecticut.\"\n\nThere's a bit of a \"hold on to your hat\" feel here, with players watching each other for a possible surprise. Maybe it's James Krivchenia's banjo percussion, the galloping rhythm on \"Certainty\" or how the four musicians sing aloud on a chorus; it is so much fun to see it all unfold. The final song was the biggest surprise; it's an unreleased song Big Thief has been performing, appropriately called \"Happiness.\"\n\nSET LIST\n\"Change\"\n\"Dried Roses\"\n\"Certainty\"\n\"Happiness\"\n\nMUSICIANS\nAdrianne Lenker: vocals, guitar\nBuck Meek: guitar, vocals\nMax Oleartchik: bass, vocals\nJames Krivchenia: percussion, vocals\n\nCREDITS\nVideo by Adam Gundersheimer & Vanessa Haddad\nAudio by Alice Wilder \n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Editor: Michael Zamora\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Kara Frame, Joshua Bryant, Maia Stern, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=TCsFgJsJ5Uc", "date_published": "2022-07-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Mivos Quartet: Tiny Desk Concert", "description": "Tom Huizenga | July 19, 2022\nAs the members of the Mivos Quartet began their sound check behind Bob Boilen's desk, I couldn't help but think of old violins — which need to be played regularly in order to keep sounding good. For me, that's what our Tiny Desk space is like; it needs to cradle musicians and their music. After almost 1000 performances here, the pandemic shuttered our doors and this Mivos concert marks just the second time since March 2020 that music has rung out from this space. Hearing it was enough to make me tear up.\n\nOf course, it helps to have extraordinary music, especially performed by these fine players who are devoted to contemporary music. They begin with \"Midnight Sun,\" a short movement from Robert Honstein's Arctic, written for Mivos in 2013. Its shimmering bright light and pulsating energy is inspired by photos taken above the Alaskan Arctic Circle in summer, when the sun never sets.\n\nHenry Threadgill's Sixfivetwo, from 2018, is something altogether different. You won't go away humming the music, but that's not the point. An open mind is what the composer is looking for. The textures here are translucent and colorful, with room for individual solos and duets – some are improvised, others are written out. \"We get to where we are because of exploration,\" Threadgill once said. \"That's why improvisation is so important.\"\n\nThe string quartet might be a 400-year-old recipe for music, but the Mivos Quartet proves that two violins, a viola and a cello are still a vibrant force, and a satisfying way to break in a unique space, relishing its music once again.\n\nSET LIST\nRobert Honstein: \"Midnight Sun\" (from Arctic)\nHenry Threadgill: Sixfivetwo\n\nMUSICIANS\nOlivia De Prato: violin\nMaya Bennardo: violin\nVictor Lowrie Tafoya: viola\nTyler J. Borden: cello\n\nTINY DESK TEAM\nProducer: Tom Huizenga\nAudio Recording & Mix Engineer: Josh Rogosin\nDirector: Kara Frame\nCreative Director: Bob Boilen\nSeries Producer: Bobby Carter\nEditor: Joshua Bryant\nVideographers: Kara Frame, Joshua Bryant, Pierre Kattar\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Jill Britton, Ashley Pointer, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #mivosquartet", "link": "https://www.youtube.com/watch?v=va8ZaKj27Xk", "date_published": "2022-07-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]