[{"source": "https://www.theguardian.com/rss", "title": "UK pay falls at fastest rate on record as inflation bites – business live", "description": "<p>Jobs data from the Office for National Statistics shows real terms pay, which accounts for inflation, fell 2.8% between March and May</p><p>The Financial Times’ retail correspondent highlights how the debate around public sector pay and strikes seems to ignore the salary hikes so far enjoyed by private sector staff: </p><p><strong>Despite<a href=\"https://www.theguardian.com/business/live/2022/jul/19/inflation-jobs-ons-uk-pay-business-live?page=with:block-62d65be48f082dc50bc2b47f#block-62d65be48f082dc50bc2b47f\"> employers like Santander UK </a>attempting to combat the cost of living crisis for staff by raising salaries, there is a growing divide between public and private sector pay. </strong></p><p>Growth in total pay, including bonuses, was 6.2% on average across the entire UK workforce. But there is a stark comparison between private sector wages, which rose by 7.2%, and public sector pay, which went up just 1.5%.</p><p>It seems the government is exercising pay restraint in the face of runaway inflation, but the private sector is not. </p><p>Against such a backdrop it’s no wonder businesses are willing to cough up more to get new staff and keep existing employees on the books. </p><p>The number of vacancies fell very slightly on the last reading, which means we may have just crested off the back of the peak and could start to see some normalisation of the labour market. </p> <a href=\"https://www.theguardian.com/business/live/2022/jul/19/inflation-jobs-ons-uk-pay-business-live\">Continue reading...</a>", "link": "https://www.theguardian.com/business/live/2022/jul/19/inflation-jobs-ons-uk-pay-business-live", "date_published": "2022-07-19 08:07:30+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Extreme UK weather live: hottest night ever as temperatures could reach record 41C on Tuesday", "description": "<p>Met Office says UK provisionally had its warmest night on record as UK braces for hottest day ever</p><ul><li><a href=\"https://www.theguardian.com/uk-news/2022/jul/18/uk-weather-heatwave-boris-johnson-checked-out-airport-runways-closed\">Warnings on water use, transport and risk to health as UK could see 41C</a></li></ul><p>Met Office chief meteorologist Neil Armstrong has a helpful explanation of <strong tabindex=\"-1\">what the chances are of the UK reaching 40C today a</strong>nd what this would represent:<br tabindex=\"-1\" /></p><p><em>Even higher maximum temperatures will develop tomorrow with a 70% chance of somewhere in England exceeding 40°C. A value of this level would exceed the current UK record by 1.3°C or more. This is akin to a marathon runner shaving 20 minutes off of the current record.</em></p><p><em> Weather forecast models are run numerous times to help us quantify the likelihood of a particular event occurring and estimate the uncertainty which is always present in weather forecasting to some degree. Some models are now producing a 70% chance of maximum temperatures in excess of 40°C in isolated parts of the UK for the start of next week. Mid- to high-30s Celsius will be seen more widely with a 95% chance we will exceed the current record.</em><br /></p><p> <em>Climate change has already influenced the likelihood of temperature extremes in the UK. The chances of seeing 40°C days in the UK could be as much as 10 times more likely in the current climate than under a natural climate unaffected by human influence. The likelihood of exceeding 40°C anywhere in the UK in a given year has also been rapidly increasing, and, even with current pledges on emissions reductions, such extremes could be taking place every 15 years in the climate of 2100.</em></p> <a href=\"https://www.theguardian.com/world/live/2022/jul/19/uk-weather-extreme-heatwave-forecast-temperature-today-latest-live\">Continue reading...</a>", "link": "https://www.theguardian.com/world/live/2022/jul/19/uk-weather-extreme-heatwave-forecast-temperature-today-latest-live", "date_published": "2022-07-19 08:06:25+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Russia-Ukraine war live news: Putin and Erdoğan to meet; US weaponry ‘stabilising’ frontlines, Ukraine military chief says", "description": "<p>Putin to discuss <a href=\"https://www.theguardian.com/world/live/2022/jul/19/russia-ukraine-war-live-news-putin-and-erdogan-to-meet-us-weaponry-stabilising-frontlines-ukraine-military-chief-says?page=with:block-62d622b18f083a0fe85d357c#block-62d622b18f083a0fe85d357c\">Ukrainian grain exports</a> with Turkish officials in Tehran; Ukraine general lauds the <a href=\"https://www.theguardian.com/world/live/2022/jul/19/russia-ukraine-war-live-news-putin-and-erdogan-to-meet-us-weaponry-stabilising-frontlines-ukraine-military-chief-says?page=with:block-62d619c48f082dc50bc2b307#block-62d619c48f082dc50bc2b307\">‘timely arrival’ </a>of US medium-range Himars rocket systems</p><ul><li><a href=\"https://www.theguardian.com/world/2022/jul/18/ukrainian-spy-chiefs-dismissal-renews-questions-over-russian-infiltration\">Volodymyr Zelenskiy appoints new spy chief</a></li><li><a href=\"https://www.theguardian.com/world/2022/jul/18/costs-of-ukraine-war-pose-tests-for-european-leaders-and-it-may-get-worse\">Costs of Ukraine war pose tests for European leaders</a></li><li><a href=\"https://www.theguardian.com/world/2022/jul/19/russia-ukraine-war-at-a-glance-what-we-know-on-day-146-of-the-invasion\">At a glance: what we know on day 146 of the invasion</a></li></ul><p>The self-proclaimed <strong>Donetsk People’s Republic</strong> in occupied Ukraine, which is only recognised as a legitimate authority by Russia, Syria and North Korea, has stated that as a result of shelling by Ukrainian forces, “one resident of <strong>Verkhnotoretske</strong> was killed, and three people were injured. Twenty-two residential buildings and seven civil infrastructure facilities were damaged.”</p><p>The claims have not been independently verified.</p> <a href=\"https://www.theguardian.com/world/live/2022/jul/19/russia-ukraine-war-live-news-putin-and-erdogan-to-meet-us-weaponry-stabilising-frontlines-ukraine-military-chief-says\">Continue reading...</a>", "link": "https://www.theguardian.com/world/live/2022/jul/19/russia-ukraine-war-live-news-putin-and-erdogan-to-meet-us-weaponry-stabilising-frontlines-ukraine-military-chief-says", "date_published": "2022-07-19 08:04:17+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Robust review – Depardieu in cantankerous comfort zone in odd-couple comedy", "description": "<p>Gérard Depardieu plays a veteran movie star with a stalker, while Déborah Lukumuena steals the show as his minder</p><p>Here’s an odd-couple comedy drama about a grumpy, cantankerous old movie star called Georges (Gérard Depardieu), who is assigned a tough “minder” called Aïssa (Déborah Lukumuena) to look after him. Why does he need a security guard? Apparently, there’s a stalker issue (a pretty harmless-looking woman camps outside his apartment building) and he also seems to be the target of environmental activists.</p><p>Frankly, the premise for Aïssa’s presence in Georges’ life is a bit thin, and this looks as if it’s going to be a sentimental status-disparity movie like the <a href=\"https://www.theguardian.com/film/2012/sep/23/untouchable-intouchables-review-francois-cluzet\">French hit Untouchable</a>, in which Omar Sy played a black caregiver for grumpy white paraplegic François Cluzet (<a href=\"https://www.theguardian.com/film/2019/jan/10/upside-review-horrific-odd-couple-disability-drama-kevin-hart-bryan-cranston\">recently remade with Kevin Hart and Bryan Cranston</a>). Actually, Robust is a bit more interesting than that and Depardieu and Lukumuena are both pretty robust in their various ways.</p> <a href=\"https://www.theguardian.com/film/2022/jul/19/robust-review-comedy-drama-gerard-depardieu-french\">Continue reading...</a>", "link": "https://www.theguardian.com/film/2022/jul/19/robust-review-comedy-drama-gerard-depardieu-french", "date_published": "2022-07-19 08:00:35+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "As Dusk Falls review – superior storytelling elevates this interactive thriller", "description": "<p><strong>PC, Xbox; Interior Night/Microsoft<br /></strong>A branching interactive thriller played out from different perspectives, including characters’ histories, is clever though at times repetitive</p><p>A family is on a tense road trip from Sacramento, California to St Louis, Missouri. The kid is tired; the dad seems conflicted; there’s clearly some unspoken tension between the mother and the grandfather. You get the impression that not everybody is keen on this cross-country move, but you don’t yet know why. I was just getting interested in this small-scale domestic drama when things kicked off properly: stopping at a roadside motel for the night, the little family gets caught up in an escalating stand-off when they are taken hostage by three brothers who have just robbed a sheriff.</p><p>As Dusk Falls is a branching thriller that you play out from both perspectives: the antagonists, and the victims. Your choices – what you say, what you do, how long you take to press a button to open a window or make a grab for someone’s gun – affect what happens to everyone, both immediately and hours later, at the end of the story. This develops empathy for every character, particularly when you start delving backwards and forwards through their lives after the tense set-piece of the motel stand-off. It also puts you in some horrible situations, because the interests of the people you’re playing are often at odds with each other.</p><p><a href=\"https://www.asduskfalls.com/\">As Dusk Falls</a> is released on 19 July; £24.99.</p> <a href=\"https://www.theguardian.com/games/2022/jul/19/as-dusk-falls-review-superior-storytelling-elevates-this-interactive-thriller\">Continue reading...</a>", "link": "https://www.theguardian.com/games/2022/jul/19/as-dusk-falls-review-superior-storytelling-elevates-this-interactive-thriller", "date_published": "2022-07-19 08:00:34+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "In My Grandfather’s Shadow by Angela Findlay review – in search of the ‘macho bully’ she never knew", "description": "<p>The artist goes on the trail of her mother’s father, a German second world war general, in this unsettling memoir of transgenerational guilt</p><p>A week after she was born to an English father and German mother, <a href=\"https://www.angelafindlaytalks.com/\">Angela Findlay</a>’s maternal grandfather died. Yet “like a relay racer passing on a baton”, she writes, “he handed me something… just as we might inherit the physical or character traits of our forebears, we can inherit their unresolved emotions, traumas or crimes”.</p><p>Much of this strange, powerful but rather unsatisfactory memoir explores Findlay’s relationship with her difficult mother, Jutta. Glamorous, energetic and sociable, she was also a woman for whom “any allusion to weakness or failure always seemed to evoke the opposite of sympathy or compassion”. She often made remarks about her daughters’ weight and imagined futures for them involving “a sensible job with a vibrant social life, puffed up like a meringue in silk taffeta dresses, charming husband in tow”. The family learned to “tread warily” and “collude in protecting [her] inner vulnerability”.</p> <a href=\"https://www.theguardian.com/books/2022/jul/19/in-my-grandfathers-shadow-by-angela-findlay-review-a-story-of-war-trauma-and-the-legacy-of-silence\">Continue reading...</a>", "link": "https://www.theguardian.com/books/2022/jul/19/in-my-grandfathers-shadow-by-angela-findlay-review-a-story-of-war-trauma-and-the-legacy-of-silence", "date_published": "2022-07-19 08:00:34+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Tory leadership race: who’s still standing, what are they promising and who’s backing them?", "description": "<p>And then there were four: latest figures suggests Truss, Mordaunt and Badenoch are vying to face Sunak in final round</p><p>If your head is reeling after the breathless psychodrama of the last few days, you are not alone. Yet, even before the black door of Downing Street had shut behind Boris Johnson, the contest for his successor was well under way.</p><p>By Monday night, the field had been narrowed down to four candidates. Let’s take a look at the remaining runners and riders: </p> <a href=\"https://www.theguardian.com/politics/2022/jul/19/tory-leadership-race-candidates-contenders-vote\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/jul/19/tory-leadership-race-candidates-contenders-vote", "date_published": "2022-07-19 07:43:28+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "SoftBank ‘halts plans’ for Arm’s London listing amid political instability", "description": "<p>Loss of UK chip designer’s flotation would jeopardise capital’s attempt to prove it can compete against US</p><p>SoftBank has reportedly halted plans to explore a London listing of Cambridge-based chip designer Arm, because of the political upheaval in the UK government.</p><p>Boris Johnson, ministers and executives from the London Stock Exchange have been involved in an 11th hour bid to persuade Japanese owner SoftBank to at least consider a partial listing of Arm in the UK. Higher valuations have made New York the financial centre of choice for most of the world’s largest tech flotations.</p> <a href=\"https://www.theguardian.com/business/2022/jul/19/softbank-arm-london-listing-uk-chip-designer-us\">Continue reading...</a>", "link": "https://www.theguardian.com/business/2022/jul/19/softbank-arm-london-listing-uk-chip-designer-us", "date_published": "2022-07-19 07:37:25+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Rebel LIV golf tour ‘talking’ to Open winner Cameron Smith, says Ian Baker-Finch", "description": "<ul><li>Former Open winner warns new champion against any move</li><li>Baker-Finch says defection would damage Smith’s legacy</li></ul><p>Cameron Smith, the newly crowned Open champion, is in talks over a switch to the LIV Golf Invitational Series, according to his fellow Australian and former Open winner Ian Baker-Finch.</p><p>In the 48 hours since hoisting the Claret Jug at St Andrews, Smith has been linked with the multi-million-dollar Saudi-backed tour.</p> <a href=\"https://www.theguardian.com/sport/2022/jul/19/rebel-liv-golf-tour-talking-to-open-winner-cameron-smith-says-ian-baker-finch\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/jul/19/rebel-liv-golf-tour-talking-to-open-winner-cameron-smith-says-ian-baker-finch", "date_published": "2022-07-19 07:31:05+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Britain’s Laura Muir emerges from 1500m slugfest with world bronze", "description": "<ul><li>Kenya’s Faith Kipyegon claims gold and fourth world title</li><li>Gudaf Tsegay rounds out podium after extraordinary race </li></ul><p>Moments after a world 1500m final so brutal it could have carried an 18 certificate, Laura Muir flopped to the track, closed her eyes and began swallowing vast gulps of oxygen. She was still on the floor five minutes later – longer than the race itself – waiting for the fire in her lungs and legs to extinguish, when a kindly official slipped a bronze medal around her neck. Then she began to smile.</p><p>The toughest race of her life, she called it. But in truth it was less a race, more of a slugfest between three of the greatest female middle distance runners in history. There was no room for in-race subtleties, or tactical niceties. Instead it became an all-out war from tape to gun: the 1500m equivalent of Marvin Hagler v Tommy Hearns with Ken Buchanan also wading in.</p> <a href=\"https://www.theguardian.com/sport/2022/jul/19/britains-laura-muir-emerges-from-1500m-slugfest-with-world-championships-bronze\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/jul/19/britains-laura-muir-emerges-from-1500m-slugfest-with-world-championships-bronze", "date_published": "2022-07-19 07:10:53+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Loyle Carner: ‘There’s a whole other side to me that’s darker’", "description": "<p>UK hip-hop’s Mr Nice Guy is getting angry – digging into racism, his mixed-race heritage and his relationship with his estranged father</p><p>Ben Coyle-Larner is wrestling with himself. Literally, in the video for his new single, Hate, a song that sees him shelve his languid, confessional flow and nice guy persona in order to deliver lines such as “I tell you what I hate though / The same fellas getting bodied by the plainclothes” with genuine venom. The video sees a camera trained on Coyle-Larner’s snarling face as he drives down a largely empty stretch of motorway, while being jostled and harangued by alternative versions of himself in the back seat. It might be a rather heavy-handed metaphor but it’s true to the tone of the song and his new direction, one he doesn’t yet seem entirely confident in.</p><p>“The song was written in such a hateful place,” says the 27-year-old rapper, better known as Loyle Carner. The video, which he co-directed, “had to reflect that feeling of getting in your own way when you’re full of rage. You’ve got all these other people, all these other voices in your head, leading you astray or trying to push you to do the wrong things. It’s that internal battle.”</p> <a href=\"https://www.theguardian.com/music/2022/jul/19/loyle-carner-coyle-larner-hate-hip-hop\">Continue reading...</a>", "link": "https://www.theguardian.com/music/2022/jul/19/loyle-carner-coyle-larner-hate-hip-hop", "date_published": "2022-07-19 07:00:34+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Spain’s Laia Aleixandri: ‘We’re seeing how best to hurt England’", "description": "<p>Midfielder who likes to paint made her age-group debut against England and is ready for the step up to the Euro 2022 quarter-final</p><p>“It was here,” Laia Aleixandri says. “<em>Right</em> here.” The Spain midfielder stands on the grass, boats floating gently by on the Thames, St George’s cross fluttering from the roof of the 13th-century manor house across the lawn, and smiles. It is the perfect place to paint and, a lover of art, Aleixandri has brought her canvases with her, an escape from it all. It is also the perfect place to play and, it turns out, where it all began. “On this actual pitch,” she says.</p><p>It was a revelation to her, too. The last time England hosted a European Championship, they were based at Bisham Abbey, just as they had been when they won the 1966 World Cup. The traditional home of the national team, this time it is their quarter-final opponents Spain who are there. Aleixandri, 22 next month, did not know its history, and did not remember that it was part of her own history too, the field where she played her first game for Spain – until things fell into place a fortnight ago.</p> <a href=\"https://www.theguardian.com/football/2022/jul/19/spain-laia-aleixandri-england-euro-2022-interview\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/jul/19/spain-laia-aleixandri-england-euro-2022-interview", "date_published": "2022-07-19 07:00:34+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "I take off my flight crew uniform now when I finish work – I don’t feel safe in it | Meryl Love", "description": "<p>Airline staff shortages and travel chaos have cranked up encounters with furious customers</p><p>Warm, wet vomit is trickling down my leg. It looks like the contents of an airline kids’ meal. Bits of pasta, chicken nuggets, and what appears to be the dribbly remnants of a chocolate bar. I’ve already taken my seat for landing, so there’s nowhere for me to go when the child next to me starts to empty the contents of his stomach as the plane makes its final descent. When the wheels touch down, vomit is running down the aisle like that chocolate river in Charlie and the Chocolate Factory<em>.</em></p><p>The flight had already been delayed<strong> </strong>before takeoff, leaving us stewing in the blistering heat of the runway for over an hour, so the smell of half-digested bolognese really adds insult to injury. “Are you going to do anything about that?” a passenger asks me in disgust.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/jul/19/airline-flight-crew-travel-chaos-furious-customers-travel-chaos\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/jul/19/airline-flight-crew-travel-chaos-furious-customers-travel-chaos", "date_published": "2022-07-19 07:00:33+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "It might be a cliche but I am feeling the urge to steal | Zoe Williams", "description": "<p>The old trope about middle-aged women shoplifting has (almost) turned into a reality for me. And there is something I really want</p><p>I distinctly remember, when I was young, that there was this cliche about middle-aged women: they loved <a href=\"https://www.theguardian.com/global/2018/may/20/nation-of-shoplifters-supermarket-self-checkout\">shoplifting</a>. Not regular shoplifting, where you need a thing and can’t afford it, but <a href=\"https://www.theguardian.com/society/menopause\">menopause</a> shoplifting, where you don’t need the thing at all and you take it anyway. It was a staple of radio comedy and layperson psychobabble, and academics undertook genuine inquiries about what could possibly be causing it. Was it general depression or something more specific? A philosophical response to the loss of fertility and how unjust that was, perhaps? I always found that explanation rather unconvincing, but what did I know? This stuff was years off.</p><p>Then in 2001, <a href=\"https://www.theguardian.com/film/winona-ryder\">Winona Ryder</a> ruined it for everyone by pulling off a heist so spectacular (aged only 30!) that she single-handedly broke the cliche, and it passed out of usage. Before I got a chance to see whether shoplifting was fun or not, the social imperative had disappeared and the urge never took me, although my friend did once steal a wedding card, and if you want to know how authentically menopausal that was, she didn’t even know anyone who was getting married.</p><p>Zoe Williams is a Guardian columnist</p><p><em><strong>Do you have an opinion on the issues raised in this article? If you would like to submit a letter of up to 300 words to be considered for publication, email it to us at <a href=\"mailto:guardian.letters@theguardian.com\">guardian.letters@theguardian.com</a></strong></em></p> <a href=\"https://www.theguardian.com/commentisfree/2022/jul/19/it-might-well-be-a-cliche-but-i-am-feeling-the-urge-to-steal\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/jul/19/it-might-well-be-a-cliche-but-i-am-feeling-the-urge-to-steal", "date_published": "2022-07-19 07:00:33+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Standing up for asylum seekers: refugees learn the art of comedy", "description": "<p>A Greek project is teaching participants the art of standup in order to shine a new light on stories about migration</p><p>In Athens, a handful of novice standups are at the mic after taking part in a series of comedy workshops. One of the organisers, Vasileia Vaxevani, compares the experience to the first time you have sex. “It ends quickly. It hurts a little. But you definitely know that you want to do it again.”</p><p>Migration is the uncharacteristically hilarious topic at the heart of this show which is produced by <a href=\"https://counterpointsarts.org.uk/about/\">Counterpoint Arts</a> and performed by refugees and asylum seekers as part of <a href=\"https://refugeeweek.org.uk/\">Refugee Week</a> whose theme this year was “healing”. In an audience as diverse as this gig’s, and in a country that has seen its communities divide as a result of polarised responses to migration, the versatility of that theme is manifest.</p> <a href=\"https://www.theguardian.com/stage/2022/jul/19/asylum-seekers-refugees-comedy\">Continue reading...</a>", "link": "https://www.theguardian.com/stage/2022/jul/19/asylum-seekers-refugees-comedy", "date_published": "2022-07-19 07:00:33+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Welcome roam: wild bison return to UK – in pictures", "description": "<p>Photographer Alexander Turner captured the moment the <a href=\"https://www.theguardian.com/environment/2022/jul/18/wild-bison-return-to-uk-for-first-time-in-thousands-of-years\">first bison to be released into the wild in the UK</a> took their initial steps in Blean Woods, Kent</p> <a href=\"https://www.theguardian.com/environment/gallery/2022/jul/19/welcome-roam-wild-bison-return-to-uk-in-pictures-aoe\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/gallery/2022/jul/19/welcome-roam-wild-bison-return-to-uk-in-pictures-aoe", "date_published": "2022-07-19 07:00:33+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Hunt for wild monkey in Japan after 10 attacks in a fortnight", "description": "<p>Traps set and residents warned to keep windows shut after infant grabbed in most serious incident</p><p>Police in <a href=\"https://www.theguardian.com/world/japan\">Japan</a> are searching for a wild monkey that has attacked 10 people in the space of a fortnight.</p><p>The attacks began on 8 July in the Ogori district of Yamaguchi prefecture in the country’s south-west. In the most serious incident, it badly scratched an infant after invading a family home.</p> <a href=\"https://www.theguardian.com/world/2022/jul/19/hunt-for-wild-monkey-in-japan-after-10-attacks-in-a-fortnight\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/jul/19/hunt-for-wild-monkey-in-japan-after-10-attacks-in-a-fortnight", "date_published": "2022-07-19 06:35:46+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘I said, Don, it’s time for you to reveal’: 50 years later, the truth behind American Pie", "description": "<p>In an expansive new documentary, Don McLean talks about the much-discussed meaning of his enduring hit song</p><p>A long, long time ago – five decades to be exact – America was roiled by wrenching generational showdowns, massive street protests, and a blazing array of social justice movements. Now, half a century later, similar events and dynamics dominate the public conversation. So, perhaps, it’s poetic that precisely five decades have elapsed since a song that captured all that cultural turmoil, American Pie, became a smash hit. “It’s a song that spoke to its time,” said Spencer Proffer, who has produced a comprehensive new documentary about the song, titled The Day the Music Died. “But it’s just as applicable now.”</p><p>In fact, American Pie has only gained in fans and expanded in meaning as it has hit successive generations and generated fresh covers. Over the years, it has been interpreted by artists from Madonna (who created a commercially triumphant, if aesthetically limp, take in 2000) to Garth Brooks to Jon Bon Jovi to John Mayer. Throughout the years, journalists have subjected the song to a Talmudic level of scrutiny, while its songwriter, Don McLean, has doled out dribs and drabs of insight into his intent. By contrast, the new documentary offers the first line-by-line deconstruction of the song’s lyrics, as well as the most detailed analysis to date of its musical evolution. “I told Don, ‘It’s time for you to reveal what 50 years of journalists have wanted to know,’” Proffer said. “This film was a concerted effort to raise the curtain.”</p> <a href=\"https://www.theguardian.com/music/2022/jul/19/don-mclean-american-pie-documentary-the-day-the-music-died\">Continue reading...</a>", "link": "https://www.theguardian.com/music/2022/jul/19/don-mclean-american-pie-documentary-the-day-the-music-died", "date_published": "2022-07-19 06:08:32+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Sri Lanka opposition leader quits presidential run in bid to stymie Wickremesinghe", "description": "<p>Sajith Premadasa instead pledges support for splinter faction of ruling party that could upset PM’s bid to become president</p><p>Sri Lanka’s main opposition leader, Sajith Premadasa, has withdrawn from the presidential race and thrown his support behind a rival candidate, presenting a significant challenge to prime minister Ranil Wickremesinghe’s bid for the executive role.</p><p>In an announcement made on Tuesday morning, Premadasa said that “for the greater good of my country that I love and the people I cherish, I hereby withdraw my candidacy for the position of president”.</p> <a href=\"https://www.theguardian.com/world/2022/jul/19/sri-lanka-opposition-leader-quits-presidential-run-in-bid-to-stymie-wickremesinghe\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/jul/19/sri-lanka-opposition-leader-quits-presidential-run-in-bid-to-stymie-wickremesinghe", "date_published": "2022-07-19 06:04:32+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Charging my electric car is a pain as I can’t use BP Pulse credit", "description": "<p>At the public charging point my balance is always shown as zero and when it should be £175</p><p><strong>I have a Polestar 2 electric car. Shortly after its launch, </strong><strong>because of a number of software glitches, the company gave owners a £450 credit for use on BP Pulse public chargers.</strong></p><p><strong>BP operates a membership scheme where you pay a monthly fee and obtain a lower charging cost. Alternatively, non-members can use chargers on a pay-as-you-go (PAYG) basis, at a higher cost. The Polestar offer also gave 12 months’ free membership.</strong></p> <a href=\"https://www.theguardian.com/money/2022/jul/19/charging-my-electric-car-is-a-pain-as-i-cant-use-bp-pulse-credit\">Continue reading...</a>", "link": "https://www.theguardian.com/money/2022/jul/19/charging-my-electric-car-is-a-pain-as-i-cant-use-bp-pulse-credit", "date_published": "2022-07-19 06:00:33+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "From dusk till dusk: tricks of the twilight – in pictures", "description": "<p>Joel Meyerowitz’s acclaimed photo series captures diving boards and motels in Florida and Cape Cod at that mysterious moment when the sun goes down </p> <a href=\"https://www.theguardian.com/artanddesign/gallery/2022/jul/19/twilight-in-pictures-joel-meyerowitz-photo-series-\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/gallery/2022/jul/19/twilight-in-pictures-joel-meyerowitz-photo-series-", "date_published": "2022-07-19 06:00:33+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Pro-Israel hardliners spend millions to transform Democratic primaries", "description": "<p>Critics say Aipac and its allies are seeking to influence Democratic politics with money from Republican billionaires</p><p>Pro-Israel lobby groups have poured millions of dollars into a Democratic primary for a Maryland congressional seat on Tuesday, in the latest attempt to block an establishment candidate who expressed support for the Palestinians.</p><p>A surge in political spending by organisations funded by hardline supporters of Israel, led by the American Israel Public Affairs Committee (Aipac), has reshaped Democratic primaries over recent months even though debate about the country rarely figures as a major issue in the elections.</p> <a href=\"https://www.theguardian.com/us-news/2022/jul/18/democratic-primaries-aipac-israel-hardline\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/jul/18/democratic-primaries-aipac-israel-hardline", "date_published": "2022-07-19 06:00:33+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Scaling the peaks of Mingulay: great Scot! – a photo essay", "description": "<p>Taking in the rugged plains, sheer cliffs and remarkable wildlife of the Outer Hebridean island, with the first Briton to conquer Everest without bottled oxygen</p><p>I thought the sun had blinked, but we had been caught in the shadow of a golden eagle passing low overhead. There were five of them over the hill, Cnoc Mhic-a-Phi, two of them tumbling out of the blue sky, lost in a playful, taloned dogfight.</p><p>Golden eagles</p> <a href=\"https://www.theguardian.com/artanddesign/2022/jul/19/scaling-the-peaks-of-mingulay-scotland-stephen-venables\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/2022/jul/19/scaling-the-peaks-of-mingulay-scotland-stephen-venables", "date_published": "2022-07-19 06:00:33+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Cookbook puts pigeon pea on Malawi’s plates to combat food insecurity", "description": "<p>Book aims to change attitudes to nutritious pulse the country produces in  abundance for export but rarely eats at home</p><p>As recipes go, the ideas sound tempting if not particularly groundbreaking: one is for dal, another for meatballs, and a third for “six food-group porridge” (with an optional egg).</p><p>The suggestions in a new Malawian cookery book are also, in their own way, quietly revolutionary, as they are all made with an ingredient that the country produces in abundance but has often been overlooked: the pigeon pea.</p> <a href=\"https://www.theguardian.com/global-development/2022/jul/19/cookbook-puts-pigeon-pea-on-malawi-plates-to-combat-food-insecurity\">Continue reading...</a>", "link": "https://www.theguardian.com/global-development/2022/jul/19/cookbook-puts-pigeon-pea-on-malawi-plates-to-combat-food-insecurity", "date_published": "2022-07-19 06:00:32+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "How to save on going out for meals and shows", "description": "<p>From a trip to the cinema, pub or restaurant to a family day out, there are lots of ways to cut costs</p><p>Going out doesn’t have to be prohibitively expensive. Whether you fancy the cinema, theatre, a meal, a few drinks at the pub or are planning a day out with the family, there is usually a way to enjoy it without having to break the bank. Here are some of the best ways to save.</p> <a href=\"https://www.theguardian.com/money/2022/jul/19/how-to-save-on-going-out-meals-shows-cut-costs\">Continue reading...</a>", "link": "https://www.theguardian.com/money/2022/jul/19/how-to-save-on-going-out-meals-shows-cut-costs", "date_published": "2022-07-19 06:00:32+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Questions raised about Lords standards rules after Tory peer cleared of lobbying", "description": "<p>Peter Selwyn Gummer, Lord Chadlington, had stake in company awarded £50m Covid contracts via government VIP lane</p><p>Labour has called for a review of the Lords conduct rules after the Conservative peer Lord Chadlington was cleared of lobbying for £50m Covid contracts awarded to a company in which he had a financial interest.</p><p>The Lords commissioner for standards Akbar Khan ruled that Peter Selwyn Gummer, who sits as Lord Chadlington in the upper house, had not broken any rules. </p> <a href=\"https://www.theguardian.com/uk-news/2022/jul/19/questions-raised-about-lords-standards-rules-after-tory-peer-cleared-of-lobbying\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/jul/19/questions-raised-about-lords-standards-rules-after-tory-peer-cleared-of-lobbying", "date_published": "2022-07-19 06:00:32+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Is Armie Hammer really selling timeshares in the Cayman Islands?", "description": "<p>First the actor was working as a concierge, which turned out to be a fake story – but then he was maybe selling timeshares. So what is actually (allegedly) going on in Hollywood’s weirdest story?</p><p><strong>Armie Hammer is back in my feed. What has he done now?</strong></p><p>Ahh Armie Hammer. Star of Call Me By Your Name and The Man from UNCLE. He once had such broad cross appeal, between those who like extremely large men, people who enjoy OK action films, and those who like that a celebrity was named <a href=\"https://slate.com/culture/2011/11/armie-hammer-the-origin-of-his-name.html\">after a millionaire oil tycoon who got </a><em><a href=\"https://slate.com/culture/2011/11/armie-hammer-the-origin-of-his-name.html\">his </a></em><a href=\"https://slate.com/culture/2011/11/armie-hammer-the-origin-of-his-name.html\">name from the phrase “arm and hammer”</a>.</p> <a href=\"https://www.theguardian.com/film/2022/jul/19/is-armie-hammer-really-selling-timeshares-in-the-cayman-islands\">Continue reading...</a>", "link": "https://www.theguardian.com/film/2022/jul/19/is-armie-hammer-really-selling-timeshares-in-the-cayman-islands", "date_published": "2022-07-19 05:40:50+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Glassdoor ordered to reveal identity of negative reviewers to New Zealand toymaker", "description": "<p>Court says workplace review platform must identify anonymous users who made Zuru ‘sound like a horrible place to work’</p><p>A California court has ordered employer-rating site Glassdoor to hand over the identities of users who claimed they had negative experiences working for New Zealand toy giant Zuru.</p><p>In a decision that could prompt unease for online platforms that rely on anonymity to attract candid reviews, Glassdoor was ordered to provide the information so Zuru could undertake defamation proceedings against the reviewers in New Zealand.</p> <a href=\"https://www.theguardian.com/world/2022/jul/19/glassdoor-ordered-to-reveal-identity-of-negative-reviewers-to-new-zealand-toymaker\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/jul/19/glassdoor-ordered-to-reveal-identity-of-negative-reviewers-to-new-zealand-toymaker", "date_published": "2022-07-19 05:26:59+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "TV tonight: on the trail of Tourette’s – why the sudden rise in tic attacks?", "description": "<p>Scarlett Moffatt asks if social media – and the pandemic – are behind a surge of symptoms in young people. Plus a monster baking challenge. Here’s what to watch this evening</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/jul/19/tv-tonight-on-the-trail-of-tourettes-why-the-sudden-rise-in-tic-attacks\">Continue reading...</a>", "link": "https://www.theguardian.com/tv-and-radio/2022/jul/19/tv-tonight-on-the-trail-of-tourettes-why-the-sudden-rise-in-tic-attacks", "date_published": "2022-07-19 05:20:31+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "North Korean labour could be sent to rebuild Donbas, Russian ambassador says", "description": "<p>Alexander Matsegora tells Russian newspaper there are ‘a lot of opportunities’ for economic cooperation, despite UN sanctions</p><ul><li><a href=\"https://www.theguardian.com/world/live/2022/jul/19/russia-ukraine-war-live-news-putin-and-erdogan-to-meet-us-weaponry-stabilising-frontlines-ukraine-military-chief-says\">Russia-Ukraine war – latest updates</a></li></ul><p>North Korea could send workers to two Russian-controlled territories in eastern <a href=\"https://www.theguardian.com/world/ukraine\">Ukraine</a>, according to Russia’s ambassador in Pyongyang – a move that would pose a challenge to international sanctions against the North’s nuclear weapons programme.</p><p>According to <a href=\"https://www.nknews.org/2022/07/russian-envoy-says-north-korea-could-send-workers-to-breakaway-ukrainian-states/\">NK News</a>, a Seoul-based website, ambassador Alexander Matsegora said North Korean workers could help rebuild the war-shattered infrastructure in the self-proclaimed people’s republics in Donetsk and Luhansk.</p> <a href=\"https://www.theguardian.com/world/2022/jul/19/north-korean-workers-could-help-rebuild-donbas-region-russian-ambassador-says\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/jul/19/north-korean-workers-could-help-rebuild-donbas-region-russian-ambassador-says", "date_published": "2022-07-19 05:12:52+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘A lot of challenges’: can housing industry build homes habitable in high temperatures?", "description": "<p>The UK’s housing stock must be resilient to rising heat levels, experts warn, with retrofitting of older properties also needed</p><p>As anyone sweltering in the current UK heatwave can attest, the country’s housing stock is woefully unsuited to heat.</p><p>Much of it is antiquated, dating from a time when the priorities were protecting from the cold and rain. Yet most new-build properties are similarly unready for experts’ predictions that, by the middle of the century, there will be temperatures on the level of summer 2018’s highs every other year.</p> <a href=\"https://www.theguardian.com/business/2022/jul/19/a-lot-of-challenges-can-housing-industry-build-homes-habitable-in-high-temperatures\">Continue reading...</a>", "link": "https://www.theguardian.com/business/2022/jul/19/a-lot-of-challenges-can-housing-industry-build-homes-habitable-in-high-temperatures", "date_published": "2022-07-19 05:00:33+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "How ‘living with Covid’ is helping keep England’s infections stubbornly high", "description": "<p>A year on from ‘freedom day’, government messaging promoting a sense of the pandemic being over is having the opposite effect, experts say</p><p>When Boris Johnson trailed plans for what many called “freedom day” in England – exactly one year ago - he urged the public not “<a href=\"https://www.theguardian.com/world/2021/jul/05/boris-johnson-says-most-covid-rules-likely-to-end-in-england-on-19-july\">to get demob happy</a>”. His decision to drop the remaining Covid restrictions came as infections were on the rise but the firebreak of summer holidays was imminent. “If we can’t reopen our society in the next few weeks,” he told a Downing Street briefing, “when will we be able to return to normal?”</p><p>In the event, there was no rush back to “normal” life. After 16 months of pandemic pain, the public was cautious. On the whole, people made only tentative moves back towards old patterns of behaviour. They became <a href=\"https://www.ons.gov.uk/peoplepopulationandcommunity/wellbeing/datasets/publicopinionsandsocialtrendsgreatbritaincoronaviruscovid19andotherillnesses\">more relaxed about social distancing</a> and “<a href=\"https://www.nature.com/articles/s41598-022-14431-3\">risky social mixing</a>”, but that trend had begun after the brutal Alpha wave and the start of mass vaccinations six months earlier.</p> <a href=\"https://www.theguardian.com/world/2022/jul/19/how-living-with-covid-is-helping-keep-englands-infections-stubbornly-high\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/jul/19/how-living-with-covid-is-helping-keep-englands-infections-stubbornly-high", "date_published": "2022-07-19 05:00:32+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Mortgage strikes threaten China’s economic and political stability", "description": "<p>Analysis: worsening meltdown in the country’s debt-laden property market is at the heart of a problem that comes at a precarious time for the Communist party</p><p>The alarm bells are ringing louder. Last week, <a href=\"https://www.theguardian.com/world/2022/jul/11/china-violent-clashes-at-protest-over-frozen-rural-bank-accounts\">hundreds of depositors gathered </a>in front of the Zhengzhou branch of the People’s Bank of China in the provincial capital of Henan, demanding their frozen life savings held in rural banks. A day later, <a href=\"https://www.theguardian.com/world/2022/jul/18/china-banks-told-to-bail-out-property-developers-as-mortgage-boycotts-threaten-economy\">tens of thousands of homeowners threatened to stop paying mortgages </a>on scores of unfinished housing projects they had purchased. All of this happened in a week where the officials reported <a href=\"https://www.theguardian.com/business/2022/jul/15/chinas-quarterly-economic-growth-slumps-sharply-after-covid-lockdowns\">lacklustre second-quarter economic performance</a>.</p><p>China’s economy is facing a dangerous cocktail of stalling growth, high unemployment, spreading mortgage payment strikes and continued Covid shutdowns that threaten to explode with serious social and political consequences.</p> <a href=\"https://www.theguardian.com/world/2022/jul/19/mortgage-strikes-threaten-chinas-economic-and-political-stability\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/jul/19/mortgage-strikes-threaten-chinas-economic-and-political-stability", "date_published": "2022-07-19 05:00:32+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "NHS could face bill of more than £1bn to fund upcoming pay rise", "description": "<p>Senior figures expect increase of between 4% and 5% but fear they will have to cover costs of anything over the previously agreed 3%</p><p>NHS staff look set to get a pay rise of barely half the rate of inflation, a move that will force the health service to make more than £1bn of cuts and could trigger a wave of strikes.</p><p>Senior NHS figures expect ministers to award staff an increase of between 4% and 5% when they announce on Tuesday how much the public sector workers will receive in 2022-23.</p> <a href=\"https://www.theguardian.com/society/2022/jul/19/nhs-could-face-bill-of-more-than-1bn-to-fund-upcoming-pay-rise\">Continue reading...</a>", "link": "https://www.theguardian.com/society/2022/jul/19/nhs-could-face-bill-of-more-than-1bn-to-fund-upcoming-pay-rise", "date_published": "2022-07-19 05:00:32+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Siestas for cows: UK farmers seek new ways for cattle to beat the heat", "description": "<p>Livestock owners are trialling the idea of bringing herds indoors to the shade to protect milk production and animals’ welfare</p><p>A growing number of UK farmers are considering adapting their farms to protect animals against heat stress, and among the new measures is the idea of indoor “siestas” for cows that may normally be grazing outdoors in summer.</p><p><a href=\"https://www.theguardian.com/animals-farmed/2021/apr/14/animals-farmed-heat-stress-happy-cows-and-foie-gras-bans\">Heat stress is a major issue for cattle</a>, especially modern dairy cows, which can produce 10-15% less milk in hotter temperatures. It can also effect their fertility and increase the chances of early pregnancy losses.</p> <a href=\"https://www.theguardian.com/environment/2022/jul/19/siestas-for-cows-uk-farmers-seek-new-ways-for-cattle-to-beat-the-heat\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/jul/19/siestas-for-cows-uk-farmers-seek-new-ways-for-cattle-to-beat-the-heat", "date_published": "2022-07-19 05:00:32+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘A bigger paycheck? I’d rather watch the sunset!’: is this the end of ambition?", "description": "<p>From high-flyers quitting their jobs to Beyoncé singing about work-life balance, people are recalibrating their lives and relationships to their jobs. What’s changed?</p><p>Until 2020, I lived by five-year plans. I had set my <a href=\"https://www.theguardian.com/money/work-and-careers\">career</a> track when I was still a child, racing through school to get to university, then university to get to work. I was often described as “driven” – approvingly by teachers and bosses, and pejoratively by ex-boyfriends, who perhaps felt they had got the raw end of the deal.</p><p>When I was 28 years old, I started seeing a therapist to find out how to work more and better. She and I discussed my career more than we did my childhood, or my mental health, or my love life. I didn’t want a partner, I told her, because they would just be a distraction.</p> <a href=\"https://www.theguardian.com/money/2022/jul/19/a-bigger-paycheck-id-rather-watch-the-sunset-is-this-the-end-of-ambition\">Continue reading...</a>", "link": "https://www.theguardian.com/money/2022/jul/19/a-bigger-paycheck-id-rather-watch-the-sunset-is-this-the-end-of-ambition", "date_published": "2022-07-19 05:00:32+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Tory candidates'  tax cuts: a boost for the wealthy, and a drag for the rest of us | Carys Roberts", "description": "<p>Inconveniently, there’s little evidence that the only thing standing between the UK and a thriving economic future is slashing taxes on corporate profits</p><ul><li>Carys Roberts is executive director of the Institute for Public Policy Research</li></ul><p>An outsider listening to the debate between Tory leadership contenders might think that the only problem the country is facing is overly burdensome taxes. Never mind the soaring temperatures, a symptom of the climate emergency, or average ambulance waits <a href=\"https://www.theguardian.com/society/2022/jun/12/paramedics-are-leaving-in-droves-as-ambulance-callouts-almost-double\">in England of 51 minutes</a> compared with an 18-minute target. On these topics, those vying to be our next prime minister have had much less to say.</p><p>Pledged policies have included cancelling the planned rise in corporation tax or reducing the rate even further; raising income tax thresholds; and more rapid cuts to the basic rate of income tax. With the exception of <a href=\"https://www.theguardian.com/politics/2022/jul/14/rishi-sunak-warns-tory-rivals-against-unsustainable-tax-cuts\">Rishi Sunak</a>, who has said he would wait before cutting taxes further, the mood music is cutting taxes from day one. We are told this is the best way to get the UK’s economy growing strongly again, therefore putting the country’s finances on a sustainable footing. Tax cuts are also put forward as a way to put money in people’s pockets to help with the cost of living crisis.</p><p>Carys Roberts is executive director of the Institute for Public Policy Research</p> <a href=\"https://www.theguardian.com/commentisfree/2022/jul/19/tory-candidates-tax-cuts-economic-future\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/jul/19/tory-candidates-tax-cuts-economic-future", "date_published": "2022-07-19 05:00:31+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘My neighbour said: Do you want to be in The Empire Strikes Back?’ – Julian Glover on his amazing breaks", "description": "<p>From Bond to Indiana Jones to Game of Thrones, Julian Glover has starred in some of the biggest franchises ever. As he appears with Russell Crowe in Prizefighter, the great actor spills his secrets</p><p>‘OK,” says Julian Glover. “We talk to each other for an hour. And you extract what you want, as long as it’s nice.” We’re sitting in a cafe in Barnes, London, and it is all a little surreal. Glover, now 87, is so vividly recognisable from The Empire Strikes Back, in which he played villainous General Veers, that it’s like teleporting back to the 1980s. In fact, to look at, he seems to have altered almost not at all between starring in 1967 film Quatermass and the Pit and, say, playing the baddie in Indiana Jones and the Last Crusade two decades later. What’s more, you would have easily picked him out as Grand Maester Pycelle in Game of Thrones. Basically, in the flesh, this man reminds you of every important moment on the large and small screen, from even before you were born.</p><p>Glover is a legend. How could he possibly think anyone would not be nice? Who has hurt him? He has to think back to the 1950s, to a Royal Shakespeare Company production of Julius Caesar. “One reviewer said, ‘Julian Glover’s Cassius is about as lean and hungry as Kenneth Clark.’ I didn’t care. I was damn good.” That was seven decades ago, and Clark was a famous art critic. Glover had gone angling for acting work after school, give or take a year at Rada and some national service.</p> <a href=\"https://www.theguardian.com/film/2022/jul/19/julian-glover-empire-strikes-back-bond-indiana-jones-game-of-thrones-russell-crowe-prizefighter\">Continue reading...</a>", "link": "https://www.theguardian.com/film/2022/jul/19/julian-glover-empire-strikes-back-bond-indiana-jones-game-of-thrones-russell-crowe-prizefighter", "date_published": "2022-07-19 05:00:31+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Charity criticises lack of UK summer childcare as cost rises to nearly £900", "description": "<p>Average place at a holiday club now costs £148 a week, up 5%, and availability is patchy, survey finds</p><p>Families will have to fork out almost £900 for six weeks of holiday childcare for each school-age child, according to a survey – a 5% increase on last year’s prices.</p><p>The average place at a holiday club now costs £148 a week, which is more than double what parents pay for an after-school club during term time, according to the charity Coram Family and Childcare.</p> <a href=\"https://www.theguardian.com/money/2022/jul/19/charity-criticises-lack-of-uk-summer-childcare-as-cost-rises-to-nearly-900\">Continue reading...</a>", "link": "https://www.theguardian.com/money/2022/jul/19/charity-criticises-lack-of-uk-summer-childcare-as-cost-rises-to-nearly-900", "date_published": "2022-07-19 04:00:30+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "With the tourists gone, what now for Lopburi’s famous monkeys?", "description": "<p>Deprived by the pandemic of their steady diet of treats, the city’s omnipresent macaques are turning to outright banditry</p><p>Food vendors in the Thai city of Lopburi can never let down their guard. Thieves are everywhere, and they are both nimble and brazen. “It’s almost every day that they take my mango and santol,” says Pan Pookyoo, who has sold fruit on the streets of Lopburi for more than three decades. “Sometimes they come and stash the peanuts,” she adds, gesturing to the vendor opposite, whose buckets of nuts and beans are subjected to frequent raids.</p><p>“They take anything they can,” agrees Somsaksri Janhon, another seller. Even his stall of hair accessories is not spared. “The comb, the mirror,” he says. “If I leave the food unattended they steal the food as well.”</p><p>A monkey enjoys a drinkable yogurt in Lopburi. Photograph: Lauren DeCicca</p> <a href=\"https://www.theguardian.com/world/2022/jul/19/with-the-tourists-gone-what-now-for-lopburis-famous-monkeys\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/jul/19/with-the-tourists-gone-what-now-for-lopburis-famous-monkeys", "date_published": "2022-07-19 04:00:30+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘Falling from the sky in distress’: the deadly bird flu outbreak sweeping the world – podcast", "description": "<p>The H5N1 strain of avian influenza is sweeping across the world, killing millions of birds. In the UK, it’s causing disastrous losses of seabirds – populations that were already being hit by a number of threats, including habitat loss, overfishing and global heating. Biodiversity reporter Phoebe Weston tells Madeleine Finlay about how the virus made it into wild birds, why it’s having such a devastating impact, and the long-term impact bird flu could have on some of our most vulnerable species</p> <a href=\"https://www.theguardian.com/science/audio/2022/jul/19/falling-from-the-sky-in-distress-the-deadly-bird-flu-outbreak-sweeping-the-world\">Continue reading...</a>", "link": "https://www.theguardian.com/science/audio/2022/jul/19/falling-from-the-sky-in-distress-the-deadly-bird-flu-outbreak-sweeping-the-world", "date_published": "2022-07-19 04:00:30+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘Earth sends a warning’: how the papers covered the UK’s scorching heat", "description": "<p>A Buckingham Palace guard suffering in the sun gets the picture editors’ attention, along with the prospect of more such heatwaves in the future</p><p>A picture of a Queen’s Guard sentry being given a sip of water outside Buckingham Palace is the defining image on Tuesday’s front pages, as the heatwave put the climate crisis in fresh focus.</p><p>All but a couple of the front pages feature the picture of the guardsman in his bearskin hat taking much-needed relief from the heat <a href=\"https://twitter.com/metoffice/status/1549087856634736640\">which on Monday topped 37.4 degrees in west London</a> and a nationwide high of 38.1C in Santon Downham in Suffolk.</p> <a href=\"https://www.theguardian.com/media/2022/jul/19/earth-sends-a-warning-how-the-papers-covered-the-uks-scorching-heat\">Continue reading...</a>", "link": "https://www.theguardian.com/media/2022/jul/19/earth-sends-a-warning-how-the-papers-covered-the-uks-scorching-heat", "date_published": "2022-07-19 02:22:24+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Towering waves in Hawaii crash into homes, barrel through wedding venue", "description": "<p>A strong winter storm in the South Pacific produced the swell which headed for the islands, bringing waves more than 20ft high</p><p>Towering waves on Hawaii’s south shores crashed into homes and businesses, spilled across highways and upended weddings over the weekend.</p><p>The large waves, some more than 20ft (6m) high, came from a combination of a strong south swell that peaked Saturday evening, particularly high tides and rising sea levels associated with climate change, the National Weather Service said Monday.</p> <a href=\"https://www.theguardian.com/us-news/2022/jul/18/hawaii-waves-swell-south-pacific\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/jul/18/hawaii-waves-swell-south-pacific", "date_published": "2022-07-19 02:01:33+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "What will it take for the UK adapt to extreme heat?", "description": "<p>The UK is experiencing its hottest recorded temperatures this week with much of the country’s infrastructure struggling to cope. What will it take to adapt to far more regular heatwaves?</p><p>Britain has been sweltering under exceptionally high temperatures this week as workplaces issue stay-at-home advice, trains are cancelled and schools shut their gates. The extreme weather is “entirely consistent” with the climate crisis, the chief meteorologist at the <a href=\"https://www.theguardian.com/uk/met-office\">Met Office</a> has said, warning that such heat could become a regular feature by the end of the century.</p><p>The Guardian’s environment editor, <strong>Damian Carrington</strong>,<strong> </strong>tells <strong>Hannah Moore </strong>that this heatwave will be a wake-up call to many in the UK to what future summers will regularly feel like unless the world as a whole can drastically reduce its reliance on burning fossil fuels. It’s not just the UK experiencing record highs, its everywhere from the Middle East to the Arctic.</p> <a href=\"https://www.theguardian.com/news/audio/2022/jul/19/what-will-it-take-for-the-uk-to-adapt-to-extreme-heat-podcast\">Continue reading...</a>", "link": "https://www.theguardian.com/news/audio/2022/jul/19/what-will-it-take-for-the-uk-to-adapt-to-extreme-heat-podcast", "date_published": "2022-07-19 02:00:27+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Jewelry worth millions stolen from security truck at California rest stop", "description": "<p>The heist took place after armed guards walked away from a Brinks vehicle that had been traveling to Los Angeles for a jewelry show</p><p>Thieves in California stole millions of dollars’ worth of jewelry and gemstones after breaking into an unattended security vehicle on its way back from a jewelry show, police said.</p><p>The robbery took place in a remote rest stop in southern California last week, authorities said on Monday, after the vehicle’s two armed guards walked away.</p> <a href=\"https://www.theguardian.com/us-news/2022/jul/18/jewelry-stolen-security-truck-california-rest-stop\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/jul/18/jewelry-stolen-security-truck-california-rest-stop", "date_published": "2022-07-19 01:11:18+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Uvalde body camera video shows some police knew they needed to act quickly", "description": "<p>However nearly 400 officers waited 73 minutes before breaching the classroom as newly released footage shows chaotic scene</p><p>Newly released body camera footage from the school shooting in Uvalde, Texas, shows that within moments of arriving at Robb elementary school, some police officers knew they needed to move swiftly to save lives.</p><p>“Dude, we gotta get in there,” said staff sergeant Eduardo Canales, according to body camera footage released late on Sunday by the small south Texas city, adding: “He’s still shooting. We gotta get in there.”</p> <a href=\"https://www.theguardian.com/us-news/2022/jul/18/uvalde-school-shooting-body-camera-video\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/jul/18/uvalde-school-shooting-body-camera-video", "date_published": "2022-07-19 00:52:31+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Russia-Ukraine war at a glance: what we know on day 146 of the invasion", "description": "<p>Russian shelling leaves six dead in the eastern Ukrainian town of Toretsk, officials say; Zelenskiy appoints new spy chief after firing two top officials</p><ul><li><a href=\"https://www.theguardian.com/world/russia+ukraine\">See all our Russia-Ukraine war coverage</a></li></ul> <a href=\"https://www.theguardian.com/world/2022/jul/19/russia-ukraine-war-at-a-glance-what-we-know-on-day-146-of-the-invasion\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/jul/19/russia-ukraine-war-at-a-glance-what-we-know-on-day-146-of-the-invasion", "date_published": "2022-07-19 00:12:42+00:00", "persistent": false, "user": null, "language": "en-UK"}]