[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Exclusive: Former MPD Lieutenant Reported Another Cop. He Says He Paid a Price. | “Police on Trial”", "description": "Speaking out for the first time, former Minneapolis police lieutenant Rich Jackson said that when he reported misconduct, he faced blowback. \n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate. \n\nAn excerpt from the new FRONTLINE documentary with the Star Tribune, “Police on Trial.” Watch the full documentary: https://bit.ly/3m1FKyj\n\n“Police on Trial” is part of FRONTLINE’s Local Journalism Initiative, an innovative effort to support and strengthen investigative reporting in communities around the country funded by the John S. and James L. Knight Foundation and the Corporation for Public Broadcasting. It was produced in association with the Center for Asian American Media and is supported by The WNET Group’s Exploring Hate initiative.\n\n“Police on Trial” is a FRONTLINE production with Five O’Clock Films in association with Mike Shum Productions and the Center for Asian American Media (CAAM). The director and producer is Mike Shum. The producer and reporter is Marcia Robiou. The narrator/reporter is Libor Jany, along with reporters Andy Mannix, Liz Navratil, Liz Sawyer, Chao Xiong. The senior producers are Frank Koughan and Callie Wiser. The executive producer of FRONTLINE is Raney Aronson-Rath.\n\n#MinneapolisPolice #DocumentaryExcerpt #Police\n\nFind FRONTLINE on the PBS Video App, where more than 300 of our documentaries available to watch any time: https://to.pbs.org/FLVideoApp   \n\nSubscribe on YouTube: http://bit.ly/1BycsJW \nInstagram: https://www.instagram.com/frontlinepbs \nTwitter: https://twitter.com/frontlinepbs \nFacebook: https://www.facebook.com/frontline \n\nFRONTLINE is produced at GBH in Boston and is broadcast nationwide on PBS. Funding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Additional support for FRONTLINE is provided by the Abrams Foundation, the John D. and Catherine T. MacArthur Foundation, Park Foundation, the Heising-Simons Foundation; and the FRONTLINE Journalism Fund, with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation. FRONTLINE’s filmmaker-in-residence program is funded by the Hollyhock Foundation. FRONTLINE’s Local Journalism Initiative is funded with support from the John S. and James L. Knight Foundation and the Corporation for Public Broadcasting. Additional support for Police on Trial is provided by The WNET Group’s Exploring Hate Initiative, with principal support by Sylvia A. and Simon B. Poyta Programming Endowment to Fight Antisemitism, and additional major funding from Sue and Edgar Wachenheim III, Charlotte and David Ackert, The Peter G. Peterson and Joan Ganz Cooney Fund, and Patti Askwith Kenner. For a complete list of funders, please visit pbs.org/exploringhate.", "link": "https://www.youtube.com/watch?v=b0Nlzsthp3g", "date_published": "2022-06-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]