[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCHnyfMqiRRG1u-2MsSQLbXA", "title": "The Absurd Search For Dark Matter", "description": "This video is sponsored by Brilliant. The first 200 people to sign up via https://brilliant.org/veritasium get 20% off a yearly subscription. Astronomers think there should be 5 times as much dark matter as ordinary matter – a shadow universe that makes up most of the mass in the universe. But after decades of trying, no experiments have found any trace of dark matter – except one.\n\nA massive thanks to the wonderful people at the ARC Centre of Excellence for Dark Matter Physics  https://www.centredarkmatter.org for showing us around and being on camera – Fleur Morrison, A/Prof Phillip Urquijo, Prof Elisabetta Barberio, Madeleine Zurowski and Grace Lawrence. \nThanks to Leo Fincher-Johnson and everyone at the Stawell gold mine for having us.\nMassive thanks to Prof. Geraint Lewis – Geraint has been Veritasium’s go-to expert for anything astrophysics and cosmology related. Please check out his website, and buy his books, they’re great –  https://www.geraintflewis.com\nThanks to Prof. Timothy Tait for the help to make sure we got the science right.\nThanks to Ingo Berg for illustrating the effect of dark matter on the rotation of a galaxy https://beltoforion.de/en/spiral_galaxy_renderer/spiral-galaxy-renderer.html\n\n▀▀▀\nGalaxy cluster simulation from IllustrisTNG – https://www.tng-project.org\nVenn Diagram of Dark Matter from Tim Tait –  https://ve42.co/venn\nThe Bullet Cluster Image from Magellan, Hubble and Chandra telescopes – https://ve42.co/BC2\nBullet cluster animation from  Andrew Robertson / Institute for Computational Cosmology / Durham University – https://ve42.co/BC3\n\n▀▀▀\nBernabei, R., Belli, P., Cappella, F., Cerulli, R., Dai, C. J., d’Angelo, A., ... & Ye, Z. P. (2008). First results from DAMA/LIBRA and the combined results with DAMA/NaI. The European Physical Journal C, 56(3), 333-355. – https://ve42.co/DAMA2008\n\nZwicky, F. (1933). Die rotverschiebung von extragalaktischen nebeln. Helvetica physica acta, 6, 110-127. – https://ve42.co/Zwicky1\n\nZwicky, F. (1937). On the Masses of Nebulae and of Clusters of Nebulae. The Astrophysical Journal, 86, 217. – https://ve42.co/Zwicky2\n\nRubin, V. C., & Ford Jr, W. K. (1970). Rotation of the Andromeda nebula from a spectroscopic survey of emission regions. The Astrophysical Journal, 159, 379. – https://ve42.co/Rubin1\n\nBosma, A., & Van der Kruit, P. C. (1979). The local mass-to-light ratio in spiral galaxies. Astronomy and Astrophysics, 79, 281-286. – https://ve42.co/Bosma1\n\nMilgrom, M. (1983). A modification of the Newtonian dynamics as a possible alternative to the hidden mass hypothesis. The Astrophysical Journal, 270, 365-370. – https://ve42.co/mond1\n\nSanders, R. H., & McGaugh, S. S. (2002). Modified Newtonian dynamics as an alternative to dark matter. Annual Review of Astronomy and Astrophysics, 40(1), 263-317. – https://ve42.co/Mond2\n\nM. Markevitch; A. H. Gonzalez; D. Clowe; A. Vikhlinin; L. David; W. Forman; C. Jones; S. Murray & W. Tucker (2004). \"Direct constraints on the dark matter self-interaction cross-section from the merging galaxy cluster 1E0657-56\". Astrophys. J. 606 (2): 819–824. – https://ve42.co/BC1\n\nGreat website about the CMB – http://background.uchicago.edu/~whu/intermediate/driving2.html\n\nGalli, S., Iocco, F., Bertone, G., & Melchiorri, A. (2009). CMB constraints on dark matter models with large annihilation cross section. Physical Review D, 80(2), 023505. – https://ve42.co/CMB1\n\nAntonello, M., Barberio, E., Baroncelli, T., Benziger, J., Bignell, L. J., Bolognino, I., ... & Xu, J. (2019). The SABRE project and the SABRE Proof-of-Principle. The European Physical Journal C, 79(4), 1-8. – https://ve42.co/SABRE1\n\n\n▀▀▀\nSpecial thanks to Patreon supporters: Inconcision, Kelly Snook, TTST, Ross McCawley, Balkrishna Heroor, Chris LaClair, Avi Yashchin, John H. Austin, Jr., OnlineBookClub.org, Dmitry Kuzmichev, Matthew Gonzalez, Eric Sexton, john kiehl, Anton Ragin, Diffbot, Micah Mangione, MJP, Gnare, Dave Kircher, Burt Humburg, Blake Byers, Dumky, Evgeny Skvortsov, Meekay, Bill Linder, Paul Peijzel, Josh Hibschman, Mac Malkawi, Michael Schneider, jim buckmaster, Juan Benet, Ruslan Khroma, Robert Blum, Richard Sundvall, Lee Redden, Vincent, Stephen Wilcox, Marinus Kuivenhoven, Clayton Greenwell, Michael Krugman, Cy 'kkm' K'Nelson, Sam Lutfi, Ron Neal\n\n▀▀▀\nWritten by Derek Muller and Petr Lebedev\nEdited by Trenton Oliver\nAnimation by Ivy Tello and Mike Radjabov\nFilmed by Derek Muller and Petr Lebedev\nAdditional video/photos supplied by Getty Image\nB-roll supplied by Stawell Gold Mine\nMusic from Epidemic Sound\nProduced by Derek Muller, Petr Lebedev, and Emily Zhang", "link": "https://www.youtube.com/watch?v=6etTERFUlUI", "date_published": "2022-06-02 12:06:02+00:00", "persistent": false, "user": null, "language": null}]