[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "7 Worlds We Want in Kingdom Hearts 4", "description": "With the 20th Anniversary of Kingdom Hearts, Square Enix has just unveiled the exciting news that Kingdom Hearts IV is in development, and we even saw a Kingdom Hearts IV trailer. Kingdom Heart's 4th installment already has some interesting changes - notably Sora's more realistic look, and what many speculate to be a Star Wars tease at the beginning of the trailer. So, with that tease, here are 7 Worlds we hope to see in the upcoming Kingdom Hearts IV.\n\nCan you believe it’s been 20 years of Kingdom Hearts? Me neither, and yet here we are, with developer Square Enix using the anniversary to announce that Kingdom Hearts 4 is in the works. The series has taken us all over the Disney-Pixar-Final Fantasy verse over the years, but here are 7 worlds that we’d love to visit that aren’t Agrabah or Olympus Coliseum.\n\n0:00 - Intro\n0:29 - Star Wars\n1:33 - The Avengers\n3:01 - Wreck-It Ralph\n3:50 - The Simpsons\n4:38 - Finding Nemo\n5:21 - Inside Out\n6:00 - Final Fantasy VII Remake", "link": "https://www.youtube.com/watch?v=-ZyoE7CXofM", "date_published": "2022-04-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "No Man’s Sky Update Adding A Criminal Underworld… Hello Han Solo Fantasies | GameSpot News", "description": "No Man’s Sky is getting a big update titled Outlaws, Battlefield 2042 will receive its 4.0 update next week and PS5 gets a new firmware update. \n#GamingNews #NoMansSky #Battlefield2042\n\nNo Man’s Sky developer Hello Games has announced the next update for the game, called Outlaws. Launching on April 14, Outlaws will focus on the game's underworld and also includes a number of significant upgrades throughout No Man's Sky. You'll be able to visit outlaw space stations and star systems that have been overtaken by criminal elements, which creates an opportunity for you to earn some extra credits.\n\nBattlefield 2042’s 4.0 is coming next week and has 400+ changes, including bug fixes and quality-of-life improvements, among other things, according to a Twitter thread shared by DICE's Kevin Johnson. The full patch notes are coming early next week ahead of the patch's release. An official release date for the patch hasn't been revealed just yet.\n\nSTAMPS\n00:00 - Intro\n00:06 - No Man’s Sky\n01:41 - PS5 Firmware\n02:06 - Battlefield 2042", "link": "https://www.youtube.com/watch?v=2vwQ5grfgug", "date_published": "2022-04-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 Sojourn Origin Story Trailer", "description": "Learn more about Sojourn the newest character to join the Overwatch roster. A fierce former Captain of Overwatch equipped with cybernetic abilities.\n\nComing soon to #Overwatch2 PVP Beta.", "link": "https://www.youtube.com/watch?v=JoP0K9Wzau4", "date_published": "2022-04-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "12 Best Games Like Elden Ring", "description": "If you’re finishing up your time in Elden Ring and want another huge, challenging game to tackle afterwards, then this is the video for you. Here are 12… ish games to check out if you want to scratch that Elden Ring itch.\n\nElden Ring is one of the most acclaimed games of all time, with critics and fans praising everything from its combat system to its open-world design, and it just might be another From Software masterpiece. The game is enormous and seeing everything will take you dozens of hours, but it's hard to put down, so some of you may already have blitzed through it. In which case you may now be wondering if there are other games like Elden Ring out there to scratch the itch.\n\nWell good news, because there are quite a few that may take your fancy. We've compiled a list of games that, for one reason or another, could appeal to Elden Ring fans. Some are Souls or Souls-like games (yes, we mention specifically which From Software games will appeal to Elden Ring fans and why!) while others are similar for a reason like the combat design or the emergent world. It’s not just Breath of the Wild and From Software games though, we’ve provided a big selection of almost twenty games to choose from, coming from developers including CD Projekt Red, Respawn Entertainment and Bethesda. Almost all of the games on the list are massive in their own right, as well, so you should have plenty to play for months.\n\nIn our Elden Ring review, we awarded the game a 10/10, and for good reason. Coverage isn’t slowing down any time soon either, so for more on From Software’s masterpiece, check out gamespot.com.\n\nSTAMPS\n00:00 - Intro\n00:15 - Souls-Borne & Seirko \n01:54 - Breath of the Wild\n02:49 - The Surge 2\n03:39 - Nioh 2\n04:28 - Remnant From the Ashes\n05:10 - Star Wars Jedi: Fallen Order\n05:51 - AC Odyssey\n06:34 - Code Vein\n07:09 - Ashen\n07:42 - The Witcher 3\n08:21 - Horizon Forbidden West\n08:51 - Skyrim", "link": "https://www.youtube.com/watch?v=dZ9l0bbRkcg", "date_published": "2022-04-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 Expansion Reconfirmed, More Fixes On The Way | GameSpot News", "description": "Cyberpunk 2077’s quest director opens up about the game’s future content, Elden Ring fans find a feature that was cut from the final release and Steam Deck is able to run games using an external graphics card.\n#GamingNews #Cyberpunk2077 #EldenRing\n\nLance McDonald: https://youtu.be/2IT-DPhIxX8\nETA Prime: https://youtu.be/8WEGY6aY8lM\n\nReddit user KamilCesaro posted a Twitch clip from from Cyberpunk 2077 quest director Paweł Sasko, in which the developer opened up about the team currently working on various aspects of the game.\n\nYouTubers Sekiro Dubi and Lance McDonald, managed to find one of the most exciting discoveries from Elden Ring network test build. This involves a NPC character that was cut from the final release named Monk Jinko. This NPC would have occupied the Scavenger's Shack near the approach to Stormveil Castle and would offer to brew the player an alcoholic beverage once forbidden to mortals, Dreambrew. \n\nIn a 10 minute video, YouTuber ETA Prime walks viewers through the steps of opening the Steam Deck, replacing the SSD with the GPU that's connected via an adapter, held in place with tape and attached to an external power supply.\n\nSTAMPS\n00:00 - Intro\n00:08 - Cyberpunk 2077\n01:21 - Elden Ring\n02:38 - Steam Deck", "link": "https://www.youtube.com/watch?v=Rr8soJOeGjc", "date_published": "2022-04-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]