[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Crisis Core Final Fantasy 7 Reunion Official Announcement Trailer", "description": "Final Fantasy VII Crisis Core REUNION will be released on PlayStation 5, PlayStation 4, Nintendo Switch, Xbox Series X|S, Xbox One and Steam this winter.\n\nSince its original release in 2007, CRISIS CORE –FINAL FANTASY VII– has received wide acclaim for its deep and emotional story.\n\nThe popular Final Fantasy VII spin-off, the once PSP exclusive, is being remade for modern audience as Final Fantasy Crisis Core Reunion.\n\nThis new version enhances the graphics to HD and updates all of the 3D models in the game. Full voiceovers and new music arrangements present this epic tale of strife and heroism, presenting FINAL FANTASY VII in a brand-new light. Enjoy a more beautiful and accessible CRISIS CORE, going way beyond just a simple HD remaster.\n\n#finalfantasy7 #ff7 #gaming", "link": "https://www.youtube.com/watch?v=aNHlQfoP4Rs", "date_published": "2022-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dragon's Dogma 10th Anniversary and Dragon's Dogma 2 Announcement Teaser - Full Presentation", "description": "Hideaki Itsuno, director of Dragon's Dogma, shares a message for the 10th anniversary of Dragon's Dogma.\n\nHideaki Itsuno even announced that Dragon's Dogma 2 is in production as a special announcement!\n\n#dragonsdogma #gaming", "link": "https://www.youtube.com/watch?v=8Eck6Ee5zNk", "date_published": "2022-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "FINAL FANTASY 7 25th Anniversary Celebration Full Presentation", "description": "Check out the full presentation celebrating 25 years of Final Fantasy VII. We get a look at upcoming content for Final Fantasy VII First Soldier, as well as a look a Final Fantasy VII Ever Crisis. \n\nAfter that we got to see two game reveals, including: Crisis Core Final Fantasy 7 Reunion and the other is the sequel to Final Fantasy 7 Remake, Final Fantasy 7 Rebirth.\n\n#finalfantasy7 #ff7 #gaming \n\nTimestamps\n0:00 Intro\n1:25 Final Fantasy VII Intergrade PC Trailer\n4:07 FF7 Merchandise and Music\n5:38 Final Fantasy 7 First Soldier Update\n6:47 Final Fantasy 7 Ever Crisis \n9:27 Crisis Core Final Fantasy 7 Reunion\n12:11 Final Fantasy 7 Rebirth", "link": "https://www.youtube.com/watch?v=2WE07pLjsyc", "date_published": "2022-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "FINAL FANTASY 7 REBIRTH Official Reveal Trailer", "description": "Here’s a first look at FINAL FANTASY VII REBIRTH, the sequel to 2020’s critically-acclaimed FINAL FANTASY VII REMAKE.\n\nThe long awaited follow up to Final Fantasy VII Remake is Final Fantasy VII Rebirth. In the trailer we got a glimpse of returning characters like Cloud, Sephiroth, and a surprise reveal of Zack. The next FINAL FANTASY VII standalone chapter is expected to be released in winter 2023. \n\n#finalfantasy7 #ff7 #gaming", "link": "https://www.youtube.com/watch?v=N2aNzos4qi4", "date_published": "2022-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "FINAL FANTASY VII 25th Anniversary Celebration Livestream", "description": "Tune in for the latest information relating to FINAL FANTASY 7 during the 25th anniversary celebration livestream. The event itself will run for approximately 10 times, but Square Enix promises it will be packed with information.\n\n#FinalFantasy #FFVII25th #FF7R #gaming", "link": "https://www.youtube.com/watch?v=dP-MphZmg50", "date_published": "2022-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "FINAL FANTASY VII EVER CRISIS Official Reveal Trailer", "description": "Spanning the entire FINAL FANTASY VII timeline, here's another look at FFVII EVER CRISIS.\n\nClosed Beta Test coming in 2022 for iOS and Android.\n*Limited to specific regions and platforms", "link": "https://www.youtube.com/watch?v=FCACixN2SyE", "date_published": "2022-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Elden Ring Mod Makes All Enemies Malenia | GameSpot News", "description": "Elden Ring gets a new mod for Malenia fans, new Overwatch 2 details are revealed and Call of Duty: Season 4 gets additional information. \n#GamingNews #EldenRing #overwatch2 \n\nWhat if every enemy in Elden Ring was Malenia? That's something youtuber Bushy must’ve asked before using the fifth matt’s enemy randomiser mod to turn every boss, normal enemy and even wildlife into the game’s toughest boss. Bushy documented the whole experience on YouTube and somehow still managed to beat the game in around 8 hours despite the constant appearance of Malenia. At times Bushy faced 3 to 5 of them at a time, yet still persevered. \n\nBushy’s Video - https://www.youtube.com/watch?v=WDRfdfempJw\n\nAs previously announced, the PvP component of Overwatch 2 releases on October 4, 2022 as a free-to-play game. This will kick off Season 1, which will feature all of the previously confirmed content--the switch to 5v5, new characters Sojourn and Junker Queen, the new Push game mode, major balance changes--but also other new additions. One of these is an as-yet-unrevealed Support character, as well as a new, customizable rarity of skin--Mythic--and a battle pass.\n\nSTAMPS\n00:00 - Intro\n00:07 - Elden Ring\n00:41 - Overwatch 2\n02:06 - Call of Duty", "link": "https://www.youtube.com/watch?v=zF53DtJPt8o", "date_published": "2022-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 Junker Queen Cinematic Trailer - “The Wastelander”", "description": "Learn more about the Junker Queen, her back story, and how she rose to power by taking the throne from the Junker King in this latest animated short \"The Wastelander\" which was revealed during the Overwatch 2 reveal event.\n\nOverwatch 2 arrives October 4 free to play on Windows PC and Xbox Series X and S, Xbox One, PlayStation 5, PlayStation 4, and Nintendo Switch consoles. \n\n#overwatch #gaming #4k", "link": "https://www.youtube.com/watch?v=Mb3_hvPGH3g", "date_published": "2022-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 Junker Queen Origin Story Trailer", "description": "Learn more about the newest Overwatch 2 character, Junker Queen through this Origin Story. \n\nOverwatch 2 arrives October 4 free to play on Windows® PC and Xbox Series X and S, Xbox One, PlayStation5, PlayStation4, and Nintendo Switch consoles. \n\nCan’t wait that long? Get a chance to play as Junker Queen in Overwatch 2 during the upcoming beta beginning June 28 on PC and select consoles. \n\n#overwatch2 #junkerqueen #gaming", "link": "https://www.youtube.com/watch?v=DTYpe5Bl90E", "date_published": "2022-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 Reveal Event Full Presentation (June 2022)", "description": "Check out the latest Overwatch 2 reveal event, which showcased more about whats to come in PvP, the battlepass, PvE content, a display of Junker Queen's movesets, as well as her origin story and cinematic trailer!\n\n#overwatch2 #gaming \n\n0:09 Intro Trailer\n2:09 Intro with Zoe\n3:33 Overwatch2 Game Overview Aaron Keller and Paul Haile\n9:42 PvP Reimagined\n16:23 Seasonal Content Overview\n22:11 PvE and Expanding the Story\n24:24 Junker Queen Origin Story\n28:16 Junker Queen Breakdown\n33:27 Junker Queen Cinematic Trailer", "link": "https://www.youtube.com/watch?v=wrFYTJIGf18", "date_published": "2022-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 Reveal Event Livestream", "description": "Tune in to the Overwatch 2 reveal event for new details on what's coming in the months ahead for Overwatch 2, including the next PvP Beta, and more on June 16th, at 10 PDT. Will we get more information and a look at Overwatch 2's newest hero the Junker Queen who was revealed at the Xbox & Bethesda Showcase?\n\n#Overwatch2 #gaming", "link": "https://www.youtube.com/watch?v=3L2lWH_nyGg", "date_published": "2022-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2: 7 Ways Everything Is Changing", "description": "Overwatch 2 is going free-to-play, and Blizzard promise a lot more new content a lot more regularly. We spoke to the game’s director Aaron Keller about how it’s all going to work.\n\n#ow2 #overwatch2 #gamespot \n\nOverwatch 2 is officially going free-to-play, but that's not the biggest change coming to the game. Ahead of the next Overwatch 2 beta, where the new hero Junker Queen and new map Paraiso will officially debut in the game, we went to Blizzard HQ to speak with the game's director Aaron Keller about what we can expect from Overwatch 2 when it launches on October 4, 2022.\n\nNot only is the game going free-to-play, but Overwatch 2 is losing its loot boxes, instead opting for an in-game store and a Battle Pass to deal out unlockables, which now include weapon charms and Mythic Skins. Aaron also discusses what happened to Overwatch 2's PvE content: earlier in 2022, Blizzard announced that it was being \"decoupled\" from the PvP, but in this video, he goes into detail on how we'll be able to play the new mode next year. He also details the game's newest tank hero, Junker Queen, and we get a look at two new maps, Paraiso in Rio, and Portugal. \n\nOverwatch 2 will have cross-platform play and cross-progression when it launches on October 4th for PC, Xbox One, Xbox Series X/S, PlayStation 4, PlayStation 5, and Nintendo Switch. The next beta will start on June 28, and while progress won't carry over to the final game, it's a chance to play the new hero, Junker Queen for the first time. \n\nActivision Blizzard continues to address allegations from a state of California lawsuit accusing parent company Activision Blizzard of fostering a \"frat boy culture\" of harassment and discrimination against women. For the latest on what's happening with regard to the ongoing legal action, take a look at our timeline of events: https://www.gamespot.com/articles/act...\n\n\nTime stamps:\n\n00:00 Intro\n00:18 Why Overwatch 2 is going free-to-play\n01:32 How Overwatch 2 seasons will work\n02:23 Overwatch 2 roadmap\n02:59 Loot boxes, weapon charms, Mythic Skins\n04:06 Overwatch 2 PvE\n06:19 New hero: Junker Queen\n08:03 New maps: Paraiso and Portugal", "link": "https://www.youtube.com/watch?v=7I0IAblZr4s", "date_published": "2022-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Making A Batman Game Without Batman - Gotham Knights Interview", "description": "Tamoor Hussain sat down with Gotham Knight's Executive Producer and Game Director to get the scoop on the latest Gotham adventure. The developers break down Nightwing's playstyle and touch on how they wrote a Batman game without Batman.\n\nIn this Summer Game Fest interview, Tamoor chatted with Fleur Marty, the Executive Producer, and Geoff Ellenor, the Game Director. They talked about the challenges of creating a cooperative narrative, how Nightwing plays in Gotham Knights, and how he fits into the story.\n\nGotham Knights releases on PlayStation 5, Xbox Series X | S, and PC on October 25, 2022. The cooperative DC game was also supposed to hit PS4 and Xbox One, but those versions were cancelled. For more Summer Game Fest coverage, stay tuned to GameSpot.\n\n#summergamefest #gothamknights", "link": "https://www.youtube.com/watch?v=8f0WSZZMocI", "date_published": "2022-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New PS5 Pro Controller May Be Revealed Soon | GameSpot News", "description": "PS5 might be getting a new pro controller, Fallout 5 is coming after Elder Scroll 6 and the Overwatch 2 beta begins June 16.\n#GamingNews #PS5 #fallout5 \n\nAccording to a new report, Sony is releasing a PlayStation 5 pro controller with removable analog sticks and rear paddle triggers, similar to the Xbox Elite controller. The report also claims Sony will reveal new hardware--but not a new console--at the end of June, though it's unclear if this rumored new controller may be part of that. \n\nBethesda's Todd Howard has confirmed that the studio plans to work on Fallout 5 following the completion of The Elder Scrolls VI. During a new interview Howard spoke about what the studio has planned after Starfield, and he touched on the progress of The Elder Scrolls VI by stating that the project was still in pre-production.\n\nSTAMPS\n00:00 - INTRO\n00:06 - PS5 Pro Controller\n00:58 - Fallout 5\n02:06 - Overwatch 2\n02:19 - FF7 Anniversary", "link": "https://www.youtube.com/watch?v=s6-lWpxa3a8", "date_published": "2022-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "TMNT: Shredder's Revenge Casey Jones Gameplay", "description": "Fan favorite character Casey Jones was recently revealed as a playable character in the most recent DotEmu beat 'em up Teenage Mutant Ninja Turtles: Shredder's Revenge and we have the first 11 minutes of gameplay for you to check out!\n\nThe Teenage Mutant Ninja Turtles are no strangers to being put into great arcade beat 'em ups and the latest one from DotEmu is no exception. This time not only are Leonardo, Donatello, Michelangelo, and Rafael all coming back but they brought some friends with them as well! Aside from the turtles players can finally play as their wise teacher and father figure Master Splinter, their best friend and occasional pizza supplier April O'Niel, and also fan favorite Casey Jones who brings his all of his favorite, even iconic sports equipment along with him to keep back any villains who are unfortunate enough to find themselves on the business end of his hockey stick. All of these characters return with classing moves and throws and even have some new ones to make sure the beat downs stay fresh.\n\nCasey Jones himself is a character you can't use at the beginning of the game. To unlock Casey Jones you have to finish story mode once, which shouldn't be too difficult of a task. Once you lay the smack down on the last boss you'll get a notification that you have unlocked the hockey mask wearing hero to play in all of the games modes!\n\nTeenage Mutant Ninja Turtles: Shredder's Revenge is available on June 16th, 2022 on Windows, Steam, Linux, Nintendo Switch, Playstation 4, and Xbox One.\n\n#tmnt #gaming #gamespot", "link": "https://www.youtube.com/watch?v=u9Sb9WnPzYg", "date_published": "2022-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Teenage Mutant Ninja Turtles: Shredder's Revenge Review", "description": "Teenage Mutant Ninja Turtles: Shredder's Revenge is a love letter to Turtles in Time that modernizes the classic beat-'em-up while retaining its 16-bit essence.", "link": "https://www.youtube.com/watch?v=ldA-sap8RBc", "date_published": "2022-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]