[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "21 Ways To Windbomb In Breath of the Wild", "description": "Bomb Impact Launches, or Windbombs, are one of the most useful tricks in The Legend of Zelda: Breath of the Wild. Here are 21 ways to do them, and propel yourself around the map.\n\nSince its discovery by Satougashi back in September 2019, Windbombing has only gotten more complex over time. As people keep finding new ways to do this trick, the roster of windbomb types keeps expanding. Such as simple Fronthop Windbombs and Turn Windbombs, to Daruk's Vertical Windbomb which requires precise timing, the discoveries seem endless.\n\n0:00 Intro\n0:22 Windbomb Explanation\n0:52 Fronthop Windbomb\n1:09 Daruk's Fronthop Windbomb\n1:34 Vertical Windbomb\n1:44 Daruk's Vertical Windbomb\n2:00 Turn Windbomb\n2:13 Aiming Windbomb\n2:30 Delayed Windbomb\n2:45 Midair Windbomb\n2:54 Midair Linear Windbomb\n3:03 Spider Windbomb\n3:13 Bomb Arrow Windbomb\n3:20 Bomb Arrow SBR Windbomb\n3:27 Backflip Windbomb\n3:41 Horse/Cycle Windbomb\n3:48 Running Windbomb\n3:53 Walking Windbomb\n3:59 Cryonis Windbomb\n4:13 Updraft Windbomb\n4:18 Jelly Bounce Windbomb\n4:22 Shield Block Reset Windbomb\n4:29 Shield Jump Cancel Windbomb\n4:40 Outro", "link": "https://www.youtube.com/watch?v=05wj07NFdXA", "date_published": "2022-03-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring - 10 MORE Things You Didn't Know", "description": "Discover invisible platforms by firing arrows in this illusory themed episode.\n\nOur Soulsborne expert Dave Klein is here with another ten things about Elden Ring. This week's episode is an illusory theme episode. Dave explains how to find invisible platforms by using arrows and rainbow stones, organizing your items quickly and efficiently, keeping your runes after death, and the Abductor Virgin.\n\n00:12 - Invisible Platforms #1\n01:34 - Rainbow Stones\n02:17 - Arrows for platforms\n02:48 - Invisible Platforms #2\n04:05 - Item Categories\n04:30 - Item organization\n04:52 - Not Losing Runes upon Death\n06:00 - Pumpkin Head’s Helmet\n06:14 - The Ultimate Finger Maiden Husk\n07:39 - The Abductor Virgin", "link": "https://www.youtube.com/watch?v=YDzGJi43lcE", "date_published": "2022-03-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Would You Play Rainbow Six Siege Mobile? | GameSpot News", "description": "Rainbow Six, Assassin's Creed, and The Division Mobile Games are coming, the next Battlefield is reportedly in pre-production, and Warzone’s original map may never come back. \n#GamingNews #Warzone\n\nAccording to a report from The Exputer, Rainbow Six Siege mobile game will be revealed on April 6. The project is developed by Ubisoft in collaboration with Tencent's WeGame and Mobile games based on Assassin's Creed and The Division are also reportedly in the works. \n\nPre-production has reportedly begun on the next Battlefield game, and will see the series revert to its familiar roots after changes introduced in Battlefield 2042 weren't well-received. As for Battlefield 2042's future, EA and DICE are still required to release new specialists, modes, weapons, vehicles, and maps as part of its battle pass obligations\n\nAccording to Raven Software developer Josh Bridge,  Call of Duty: Warzone's original map, Verdansk, will not come back due to a technical issue preventing this from being possible. Instead, Activision is putting more effort into technical optimizations for Warzone to allow for big updates without such massive downloads.\n\nSTAMPS\n00:00 - Intro\n00:07 - Rainbow Six Seige\n01:06 - Battlefield\n02:37 - Call of Duty Warzone", "link": "https://www.youtube.com/watch?v=x79GxFCFVwg", "date_published": "2022-03-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Kirby and the Forgotten Land Review", "description": "Kirby and the Forgotten Land is the biggest and best entry in the long-running franchise.\n\nHAL Laboratory & Nintendo's Kirby and the Forgotten Land will be available on Nintendo Switch on March 25, 2022. You can read the full written Kirby and the Forgotten Land review by Steven Petite on GameSpot: https://www.gamespot.com/reviews/kirby-and-the-forgotten-land-review-the-best-kirby-yet/1900-6417850/", "link": "https://www.youtube.com/watch?v=pwPe7ntbDBM", "date_published": "2022-03-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New PS5 Features Added In Free Update, VRR Coming Soon | GameSpot News", "description": "PlayStation 4 and 5 get an update that adds new features, Elden Ring fixes more bugs affecting players, and Call of Duty launches Season 2 Reloaded.\n#GamingNews #PS5 #EldenRing   \n\nThe latest firmware update has gone live for PS4 and PS5 consoles, adding several new features and tweaking the user interface. Enhancements to Game Base and Trophy cards, as well as accessibility features like mono audio for headphones, have all been added. In a blog post, Sony also teased that variable refresh rate support will be coming to PS5 soon.\n\nFrom Software has released a new update for Elden Ring in the form of patch 1.03.2. The developer confirmed that this is an extension to the recently released patch 1.03-and will resolve several bugs that were found when it was pushed live.\n\nIn the new season of Vanguard multiplayer, players can look forward to a new 12v12 mode called Arms Race. This mode is set on a new large-scale map and calls on players to capture and hold bases.\n\nSTAMPS\n00:00 - Intro\n00:06 - PS5 Update\n01:41 - Elden Ring Update\n02:14 - Call of Duty Update", "link": "https://www.youtube.com/watch?v=BF3j5A-Nx4g", "date_published": "2022-03-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Tiny Tina's Wonderlands Dual Wielding Magic Gameplay", "description": "We catch up with Brick, now the Punchfather, from Borderlands 2 and test our dual-magic-wielding glass cannon Spellshot and Clawbringer build. Many mushroom enemies were harmed in the making of this video.\n\nTiny Tina's Wonderlands recasts the Borderlands series with a fantasy theme. The game builds off of ideas from Tiny Tina's Assault on Dragon Keep: A Wonderlands One-Shot adventure, which originally released as DLC for Borderlands 2. In Wonderlands, players are still inside a tabletop campaign called Bunkers and Badasses with Tina as the Bunkermaster. In this part of the campaign, The Tangledrift area, a familiar Borderlands 2 character Brick, shows up to take on the role of the Punchfather, basically a fairy that punches things. The rest of the section is very Jack, and the Beanstalk inspired combined with Borderlands loud and brash humor.\n\nIn this gameplay clip, we’re showing off the character class Spellshot. This class is a gun wizard who focuses on damage output and dual-wielding magic. Since this section takes part in a later portion of the game, you’ll get to see the multiclass system in action. We’ve combined the Spellshot with the Clawbringer skill trees, which adds a Wyvern Companion. This multiclass combination creates a glass cannon build where the Spellshot does extra damage but only regenerates shields when casting magic or making kills. In order to kill more quickly, you’ll see us dual-wield wands and rapid-fire lightning blasts with our Wyvern Companion flying around, setting enemies on fire.\n\nTiny Tina's Wonderlands releases on March 25th, with the Season One pass starting April 21st. The game will launch for PC, PS4, PlayStation 5, Xbox One, and Xbox Series X|S, although you should be aware that only the two more expensive editions of the game have new-gen optimizations.\n\n#TinyTinasWonderland", "link": "https://www.youtube.com/watch?v=SRoY6VFfPNE", "date_published": "2022-03-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Tiny Tina's Wonderlands Review", "description": "Tiny Tina's Wonderlands is an easily digestible adventure with fantasy flavor, but this Borderlands spin-off struggles to find its own identity.", "link": "https://www.youtube.com/watch?v=xsiXTrgeBf8", "date_published": "2022-03-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]