[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "What will happen to Linux in 2022? A few predictions!", "description": "Download Safing's Portmaster for FREE or subscribe to the SPN: https://safing.io/portmaster\n\nGet 300€ off the Slimbook TITAN with offer code titan-laptop-nickfan: https://slimbook.es/en/store/titan/titan-comprar\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nI also do a Gaming Podcast: https://www.youtube.com/channel/UCbRPZ11S1quJ4ESoj42A3ug\n\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:36 Sponsor: Reclaim your internet connection\n01:27 What will happen to Linux DEs?\n06:31 What about Linux hardware?\n08:24 Will Linux gaming take off?\n11:04 Will 2022 be a good year for Linux?\n\n\nLet's begin with the stuff we use everyday: the desktop environments.\nIn 2022, I'm expecting some shakeup in the desktop environment. The arrival of Libadwaita is probably going to have a strong impact on most GNOME using distros, and GTK based desktops.\n\nWe'll probably also see the first builds of the new rust-based Cosmic shell from System76, although I don't think it will be shipped by default, and we won't see a stable implementation of it before 2023.\n\nI'd expect Solus and Budgie to have a long hiatus period, while they focus work on their new EFL based experience.\n\nOn the KDE front, I think the end of 2022 will see KDE finally reach a polish level that makes it comfortable for most people.\n\nI'd expect the elementary team to release OS 7 during 2022.\n\nOther DEs, I expect to keep getting small updates here and there, without a major revamp. CInnamon, though, might have a shot, in 2023, at becoming the default for a few distros that got burned by libadwaita\n\nOn the hardware front, I think we might see a few interesting things.\n\n I think 2022 might be the year where we finally see stuff like 2 in 1s, or at least touchscreens, running Linux out of the box. I still don't think we'll see a lot of them in retail stores.\n\nThe Pine64 will continue to update their now considerable list of devices, and push ARM computing forwards. Their devices should still be limited to mostly developers and enthusiasts, although I'd be surprised if we didn't see some new version of the pinebook pro, with a more powerful ARM CPU.\n\nI also think 2022 will be the year where Linux is fully functional on M1 Macs.\n\nTo go back on the Pine64, I think 2022 will also see a fully functional Linux phone.\n\nLet's move on to Gaming in 2022.\n\nThe main thing will be the release of the Steam Deck, and I think it won't receive particularly favorable reviews. I think the hardware will be praised, but that most \"general gaming outlets\" will be quick to point out that a lot of very important games just don't run on the device.\n\nThis will also lead to these people thinking the Steam Deck is a \"bad\" device, because running it on Windows probably won't offer as good an experience as using Steam OS, apart from compatibility with specific games.\n\nStill, in the long run, the Steam Deck WILL be a positive force for Linux. I think it will sell well, if only because it's basically alone in that category, with a trusted brand behind it. Valve won't report numbers of people using Windows on it, only sales Number, and game developers might take notice and update their games to run well, and support anti cheat solutions on Linux for their specific games. The Steam Deck release in 2022 will DEFINITELY help with that compatibility, and I think a lot of developers are just waiting for the device to come out before they roll out support.\n\nThe Deck will push Linux gaming forwards a LOT, as more games will get day one support and Proton and DXVK get even more capable.\n\nI'm expecting more than 80% of games on ProtonDB to be rated Gold or Platinum at the end of the year.", "link": "https://www.youtube.com/watch?v=y928TA-8ACY", "date_published": "2022-01-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]