[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "\"A Hell Of A Job On This One!\" - Firearms Expert Reacts to Fallout 4’s MOD Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down some of the mod guns from Fallout 4, including the .45 Handmade Revolver, a piratical-themed Widow Shotgun, and the unique Shoemacuzi-9.\n\n00:00 - Opening\n00:49 - Recoil Compensated Mk41 Gyrojet HMG\n03:57 - Marksman’s Handmade Anti Material Rifle Sniper Rifle\n07:20 - Hardened Widow Shotgun\n09:09 - Shoemacuzi-9\n10:51 - Rifle No.9 Mk1 EM 2\n14:22 - Marksman’s Advanced M2045 Magnum Revolver\n15:46 - .45 Handmade Revolver\n19:42 - Suppressed Powerful Mauser Auto Pistol\n20:58 - Calibrated Powerful M2216\n22:40 - Compensated Powerful Automatic MG69 Machine Gun\n24:06 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down some of the mod guns from Fallout 4 and compares them to their real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/\n\nMods Used\n\nMk 41 Gyrojet Heavy Machine Gun - https://www.nexusmods.com/fallout4/mods/38257\nHandmade Anti-Materiel Rifle - https://www.nexusmods.com/fallout4/mods/32036\nThe Widow Shotgun - https://www.nexusmods.com/fallout4/mods/19619\nTomacuzi: America's Worst - https://www.nexusmods.com/fallout4/mods/32713\nEM 2 Rifle No.9 Mk1 - https://www.nexusmods.com/fallout4/mods/43474\nM2045 Magnum Revolver Rifle - https://www.nexusmods.com/fallout4/mods/17170\nHandmade Revolver - https://www.nexusmods.com/fallout4/mods/18457\nMauser Pistol - https://www.nexusmods.com/fallout4/mods/14141\nM2216 - https://www.nexusmods.com/fallout4/mods/8807\nMG69 - https://www.nexusmods.com/fallout4/mods/56254", "link": "https://www.youtube.com/watch?v=q-vZYpNkd00", "date_published": "2022-05-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "8 Great Sniping Games You Can Play Now", "description": "Deck:\nWith another Sniper Elite game releasing, it's time to take a look at the best sniping experiences you can find, including games like Escape From Tarkov, Squad, and even Hitman. \n\nTimecode:\n00:00 - Intro\n00:15 - Sniper Elite\n02:05 - Sniper Ghost Warrior\n03:59 - Hitman 2 Sniper Assassin\n05:05 - Escape From Tarkov\n07:20 - Battlefield\n09 - 36 Arma\n10:49 - Squad\n12:13 - Sniper Elite VR\n\nVideo Notes: \nThe upcoming release of Sniper Elite 5 provides a good opportunity to look at games with the best sniping mechanics that you can play right now. In this video, we cover a wide range of first-person shooters, including single-player, combined arms multiplayer games, and some pretty hardcore military sim titles. This list includes something for everyone, from casual to competitive and hardcore gamers. \n\nGames that get sniping right are actually a bit rare because creating good sniping experiences in video games is complicated. Sniping or even long-range shooting isn’t easy for developers to model and balance in video games. Real-world distance shooting involves so many factors like range, windage, and drag, which requires a decent amount of math to do correctly. Video games also aren’t that great at simulating the mindset snipers experience, like the stress and pressure they go through taking the perfect shot. Developers compromise in different ways for different audiences to make sniping in video games fun. \n\nWe'll take a look at a variety of approaches to sniping, including games for more casual players, such as Sniper Elite, Sniper Ghost Warrior, and Hitman 2 Sniper Assassin. After that, we'll dial in on games with great sniping and bullet physics for competitive multiplayer fans, including Escape From Tarkov and Battlefield. Next, we'll hit the games for the hardcore crowd that give the most realistic experience possible, with toward Arma and Squad. Finally, we’ll give some thought to the pros and cons of sniping in virtual reality.\n\nThis video covers a host of games out now on PC, PS4, PlayStation 5, Xbox Series X|S, and Xbox One. Let us know what you’re favorite game is or if there’s one that we missed, and we’ll include it in future videos!", "link": "https://www.youtube.com/watch?v=aJ7VrxD1GcU", "date_published": "2022-05-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite Playable On iPhone, But Not The Way You Think | GameSpot News", "description": "Fortnite Is Playable On iOS Again With Xbox Cloud Gaming, Summer Game Fest 2022 Date Revealed For June 9 and more! \n#GamingNews #Fortnite #SummerGameFest\n\nFortnite becomes the first free-to-play game to hit Xbox Cloud Gaming. You can play Fortnite via the cloud right now through the Xbox website for iOS, Android, Windows PC via browser, or a tablet. This is particularly noteworthy for iOS players, since Epic famously removed Fortnite from iOS amid its battle with Apple.\n\nSummer Game Fest Live 2022 will take place Thursday, June 9, starting at 11 AM PT / 2 PM ET.\n\nSTAMPS\n00:00 - Intro\n00:07 - Fortnite\n01:13 - Summer Game Fest\n2:39 - Warzone & Dying Light", "link": "https://www.youtube.com/watch?v=lu0GlMmC7LA", "date_published": "2022-05-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Modern Warfare 2 Reveal Date Leaks… It's Sooner Than You Think | GameSpot News", "description": "Call of Duty: Modern Warfare 2 will reportedly be revealed in June, Halo Infinite devs react to Season 2 issues and The Queen's golden Wii is up for auction again. \n#GamingNews #CallofDuty #HaloInfinite\n\nAccording to a report from Exputer, Modern Warfare 2’s reveal trailer could air \"at an event when E3 was meant to be,\" and will focus on the campaign. Modern Warfare 2's multiplayer will be revealed in August. Whether or not there will be a tie-in Warzone event as part of the expected announcement is unknown.\n\nHalo Infinite developer 343 Industries has acknowledged that the Season 2: Lone Wolves launch this week \"has been bumpy,\" with players reporting a number of issues with the latest update. On Twitter, Microsoft's Joseph Staten said, “We are indeed taking your feedback to heart, especially regarding map jumps and speedrunning. We're reviewing options and will have more news to come.\"\n\nTHQ commissioned a gold-plated Nintendo Wii to be delivered to Buckingham Palace and presented to the Queen of England as part of a marketing stunt to promote Big Family Games. The previous auction started the bidding at $300,000, although this new auction's highest bid at the time of writing is currently $2,000 on the Goldin website.\n\nSTAMPS\n00:00 - Intro\n00:09 - Modern Warfare 2\n01:37 - Halo Infinite\n02:53 - Golden Wii", "link": "https://www.youtube.com/watch?v=iGqfCnWCCgQ", "date_published": "2022-05-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]