[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Tiny Tina's Wonderlands Hands-On Impressions", "description": "So far, Tiny Tina's Wonderlands feels like Borderlands 3 channeling tabletop roleplaying culture on a surface level only. After spending time with the Stabbomancer and Graveborn classes, and fostering a goblin rebellion, we were left remembering what made Assault on Dragon Keep so special.", "link": "https://www.youtube.com/watch?v=gU8-SlwlAxo", "date_published": "2022-02-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Breaks Down The Minigun - Loadout Extended Chat", "description": "The Minigun is a pop culture cannon of carnage, appearing in hundreds of games and movies. Whether it’s mounted to helicopters in Battlefield, in the arms of Grand Theft Auto V’s bank robbers or churning up the jungle in Predator, developers and filmmakers love to harness the Minigun’s power, but how exactly does it work? (Presented by PUBG MOBILE)\n\nIn this episode of Loadout, Dave Jewitt visits the Royal Armouries to talk to Keeper of Firearms & Artillery Jonathan Ferguson to discover the surprising origins of the M134 Minigun, and see why it’s one of the least well-represented guns in pop culture history.\n\nYou can check out more episodes of Loadout right here. - https://www.youtube.com/watch?v=yzSrmGkpWKk&list=PLpg6WLs8kxGMzIemU1gyyLmg5VlKI2UvC\n\nYou can check out our Firearms Expert Reacts series here. - https://www.youtube.com/watch?v=5FVzcoRjoN4&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/", "link": "https://www.youtube.com/watch?v=nIgmm0_88ts", "date_published": "2022-02-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PlayStation Vita 10 Years Later", "description": "The PS Vita is a beloved handheld with a diehard cult following. But how does the failed Sony handheld hold up 10 years later to someone using it for the first time?\n\nFor many, Vita means life. It means to be a part of a cult following that believed in the handheld more than its makers did. Sony launched the PS Vita with the intention of bringing the AAA game experience to the handheld market, with big flagship IPs like Uncharted: Golden Abyss and Killzone: Mercenary. But in actuality, the console would see its success from indie games and visual novels like Persona 4 Golden, Hotline Miami, and Virtue's Last Reward. \n\nKurt Indovina missed the boat to Vita Island when it was first released in the states back in 2012, but now 10 years later, he's picking up the console up for the first time to see what the fuss is about. Join Kurt in a rather unexpected journey to understanding what it means to be a Vita Islander. \n\n#PlayStationVITA #PSVITA", "link": "https://www.youtube.com/watch?v=wxDms6kLw7s", "date_published": "2022-02-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Presents Full Presentation (2.27.2022)", "description": "Check out the full Pokemon Presents for February 27, 2022 to celebrate Pokémon day. We got updates on Pokémon Go, Pokémon Masters EX, Pokémon Cafe Remix, Pokémon Unite, Pokémon Brilliant Diamond & Shining Pearl, Pokémon Legends Arceus, and even an brand new game announcement for Pokémon Scarlet and Violet.\n\nTimestamps\n0:00 Intro\n1:03 Pokémon Go Alola Update\n1:56 Pokémon EX Masters Update\n3:33 Pokémon Cafe Remix Update\n5:12 Pokémon Unite Update\n7:00 Pokémon Brilliant Diamond and Shining Pearl Update\n7:58 Pokémon Legends Arceus\n10:45 Pokémon Scarlet and Pokémon Violet Reveal Trailer\n\n\n#PokémonDay #Pokémon", "link": "https://www.youtube.com/watch?v=FHrDDICyH0w", "date_published": "2022-02-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Scarlet and Pokémon Violet Announcement Trailer", "description": "Check out a brand new game announcement for Pokémon from Game Freak to celebrate Pokémon Day. Pokémon Scarlet and Violet was announced during the Pokémon Presents, and is expected to come late 2022.\n\n#Pokémon #PokémonScarletViolet", "link": "https://www.youtube.com/watch?v=SxwOJi2dd4c", "date_published": "2022-02-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]