[{"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Londyn: Gangi atakują sklepy, biją i zabijają ludzi. Łupem padają też cenne zegarki", "description": "Mamy coraz większą falę przestępczości - przyznaje londyńska policja, która notuje kolejne zabójstwa, kradzieże w biały dzień i pobicia przypadkowych osób - także nastolatków. Gangi potrafią napaść na sklep i wynieść z niego asortyment, zerwać Rolexa z ręki klienta restauracji czy rozbijać młotkiem szyby samochodów, by zgarnąć czekający wewnątrz łup.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-01/londyn-gangi-atakuja-sklepy-bija-i-zabijaja-ludzi-lupem-padaja-tez-cenne-zegarki/", "date_published": "2022-09-01 20:02:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Argentyna. Tajemnicze zapalenie płuc w Argentynie. Zmarły trzy osoby. To nie COVID-19", "description": "Trzy osoby zmarły z powodu tajemniczego zapalenia płuc w Argentynie. Kolejne sześć osób jest zakażonych. Wykluczono COVID-19, grypę i hantawirusy. Wzbudziło to jednak obawy przed epidemią nowego wirusa.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-01/argentyna-tajemnicze-zapalenie-pluc-w-argentynie-zmarly-trzy-osoby-to-nie-covid-19/", "date_published": "2022-09-01 20:00:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "USA: Trener aligatorów zaatakowany przez gada. Stracił dłoń", "description": "Stracił dłoń, ale lekarzom udało się uratować rękę Grega Graziani, dyrektora ośrodka Florida Gator Gardens i trenera aligatorów. Zwierzę zaatakowało go podczas rutynowych ćwiczeń.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-01/usa-trener-aligatorow-zaatakowany-przez-gada-stracil-dlon/", "date_published": "2022-09-01 19:58:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Indie: Siostry chciały zrobić sobie zdjęcie w wodzie. Utonęło sześć osób", "description": "Pozowanie do selfie przy wodospadzie zakończyło się wielką tragedią. Dwie siostry z Indii, które chciały zrobić sobie zdjęcie, mimo zakazu weszły do wody. Jedna z nich straciła równowagę i zaczęła się topić.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-01/indie-siostry-chcialy-zrobic-sobie-zdjecie-w-wodzie-utonelo-szesc-osob/", "date_published": "2022-09-01 19:20:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "USA: Cztery ciała na polu pszenicy. \"Absolutny koszmar\"", "description": "Absolutny koszmar - tak bliscy opisują tragedię, do jakiej doszło na jednej z farm w Północnej Dakocie (USA). Na polu pszenicy znaleziono ciała czterech mężczyzn, członków jednej rodziny. Wszyscy mieli rany postrzałowe.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-01/usa-cztery-ciala-na-polu-pszenicy-absolutny-koszmar/", "date_published": "2022-09-01 18:22:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Wielka Brytania. Mąż zaatakował niewidomą żonę tasakiem do mięsa. Bo przewróciła mu Xboxa", "description": "42-letni mężczyzny zaatakował swoją niewidomą żonę tasakiem do mięsa. Zrobił to po tym, jak pijany wrócił do domu i zobaczył, że jego Xbox leży przewrócony na podłodze. Miał też powiedzieć do ofiary: Jedno nas umrze i to nie będę ja - przekazał portal Daily Mail. Właśnie zapadł wyrok w sprawie napaści.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-01/w-brytania-maz-zaatakowal-niewidoma-zone-tasakiem-do-miesa-w-sprawie-zapadl-wyrok/", "date_published": "2022-09-01 16:29:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Holandia: Złamany maszt na łodzi zabił nieletnią dziewczynę. Zginęła podczas szkolnej wycieczki", "description": "Nastolatka zginęła po tym, jak została uderzona przez zerwany maszt. Do wypadku doszło na żaglowcu w Holandii, na którym wraz z poszkodowaną płynęło 15 innych osób, w tym jej koledzy ze szkoły w Hadze.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-01/holandia-zerwany-maszt-na-lodzi-zabil-nieletnia-dziewczyne-zginela-podczas-szkolnej-wycieczki/", "date_published": "2022-09-01 15:38:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Brazylia: Matka oskarżona o zabicie dzieci. Miała mieszkać z ich zwłokami", "description": "Eliara Paz Nardes z Brazylii jest oskarżona o podwójne zabójstwo. Ofiarami miały paść jej dzieci: dziewięcioletnia córka Alice i trzyletni syn Joaquim. Kobieta miała również mieszkać z ich rozkładającymi się ciałami w mieszkaniu w miejscowości Guarapuava.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-01/brazylia-matka-oskarzona-o-zabicie-dwojki-dzieci-miala-mieszkac-z-ich-zwlokami/", "date_published": "2022-09-01 15:12:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Raport o reparacjach za II wojnę światową. MSZ Niemiec: Sprawa jest zamknięta, Polska się zrzekła", "description": "- Polska już dawno, bo w 1953 roku, zrzekła się dalszych reparacji wojennych - stwierdził rzecznik MSZ Niemiec, zapytany o przedstawiony w czwartek raport o stratach poniesionych przez RP podczas niemieckiej agresji. Jak dodał, sprawa ewentualnych odszkodowań dla Polski jest zakończona.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-01/raport-o-reparacjach-za-ii-wojne-swiatowa-msz-niemiec-sprawa-jest-zamknieta-polska-sie-zrzekla/", "date_published": "2022-09-01 15:08:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Niemcy: Wycofano 20 rodzajów chipsów. Były w nich toksyczne substancje", "description": "Wycofano 20 rodzajów chipsów z dwóch sieciach supermarketów oraz w krajach, do których je eksportowano. Służby sanitarne ustaliły, że chipsy zawierały toksyczną substancję, która wywoływała zaburzenie rytmu serca, nudności i problemy w układzie nerwowym. Ich spożycie było szczególnie groźne dla dzieci.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-01/niemcy-wycofali-20-rodzajow-chipsow-z-dwoch-sieci-sklepow/", "date_published": "2022-09-01 14:15:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Nowy Orlean: 26-latka zginęła, bo jej włosy wciągnęła taśma bagażowa na lotnisku", "description": "Jermani Thompson zajmowała się rozładunkiem i transportem walizek na lotnisku w Nowym Orleanie (USA). We wtorek 26-latka straciła życie, bo jej włosy wplątały się w taśmę bagażową. Kobieta zmarła, chociaż chwilę po wypadku trafiła do szpitala. - Wszyscy ją kochali. Po prostu brakuje mi słów - przekazała matka zmarłej, dodając, że pasją Jermani była koszykówka.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-01/nowy-orlean-26-latka-zginela-bo-jej-wlosy-wciagnela-tasma-bagazowa-na-lotnisku/", "date_published": "2022-09-01 13:48:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Rosja. Pogrzeb Michaiła Gorbaczowa. Władimir Putin nie pojawi na uroczystościach", "description": "Prezydent Rosji Władimir Putin nie weźmie udziału w pogrzebie ostatniego przywódcy Związku Radzieckiego Michaiła Gorbaczowa - poinformował Kreml. Jego rzecznik Dymitr Pieskow przekazał, że Putin złożył w czwartek wieniec przy otwartej trumnie w moskiewskim Centralnym Szpitalu Klinicznym. Uroczystości pogrzebowe zaplanowane są na sobotę w Moskwie.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-01/rosja-pogrzeb-michaila-gorbaczowa-wladimir-putin-sie-nie-pojawi/", "date_published": "2022-09-01 13:27:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Włochy. Na Sardynii zajęto 11 willi rosyjskiego oligarchy. To miliarder ze otoczenia Putina", "description": "Państwo włoskie skonfiskowało 11 wilii rosyjskiego oligarchy Wiaczesława Mosze Kantora, które znajdują się na Sardynii. Miliarder jest zwolennikiem Władimira Putina. Na arenie międzynarodowej Kantor określany jest jako przedsiębiorca i filantrop.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-01/wlochy-na-sardynii-zajeto-11-willi-rosyjskiego-oligarchy-to-miliarder-ze-otoczenia-putina/", "date_published": "2022-09-01 12:12:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "USA: Rzucił się na niego potężny rój pszczół. Miał na ciele ponad 20 tys. ukąszeń", "description": "20-latek z amerykańskiego stanu Ohio został zaatakowany przez rój pszczół afrykańskich. Młody mężczyzna został ukąszony ponad 20 tysięcy razy i połknął 30 owadów. Jego stan był bardzo ciężki, jednak dzięki natychmiastowej reakcji lekarzy udało się go uratować.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-01/usa-rzucil-sie-na-niego-potezny-roj-pszczol-mial-ponad-20-tys-ukaszen/", "date_published": "2022-09-01 10:21:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Katarzyna Pełczyńska-Nałęcz: Wizyta Putina w Kaliningradzie ma uspokoić obawy wewnątrz elit", "description": "- To gest, który ma pokazać, że prezydent Rosji nadal panuje nad sytuacją - powiedziała w Polsat News była ambasador Polski w Moskwie Katarzyna Pełczyńska-Nałęcz, komentując czwartkową wizytę Władimira Putina w obwodzie kaliningradzkim.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-01/katarzyna-pelczynska-nalecz-wizyta-putina-w-kaliningradzie-ma-uspokoic-niepokoje-wewnatrz-elit/", "date_published": "2022-09-01 10:06:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Rosja. Nie żyje szef rady dyrektorów koncernu Łukoil. Rawil Maganow wypadł z okna", "description": "Rawil Maganow wypadł z okna Centralnego Szpitala Klinicznego w Moskwie - podała w czwartek rano agencja ITAR-TASS. Szef rady dyrektorów koncernu naftowego Łukoil zmarł w wyniku odniesionych obrażeń.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-01/rosja-nie-zyje-prezes-koncernu-naftowego-lukoil-ravil-maganov-wypadl-z-okna/", "date_published": "2022-09-01 09:27:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Atak na prezydenta Brazylii. Przechodzień rzucił niezidentyfikowanym przedmiotem", "description": "Ubiegający się o reelekcję prezydent Brazylii Jair Bolsonaro został zaatakowany w czasie kampanii wyborczej. Podczas przejazdu przez miasto na motocyklu stojąca na chodniku osoba rzuciła w stronę głowy państwa niezidentyfikowanym przedmiotem.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-01/atak-na-prezydenta-brazylii-przechodzien-rzucil-niezidentyfikowanym-przedmiotem/", "date_published": "2022-09-01 08:30:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Nigeria: Tragedia na weselu. Nie żyje pan młody i pięcioro gości. Policja wszczęła śledztwo", "description": "33-letni Obinna Dieke i jego ukochana Nebechi w miniony piątek postanowili ukoronować swoją miłość i powiedzieli sobie tak. Dzień po uroczystości, nowożeńcy i goście ślubni zostali odnalezieni nieprzytomni w jednym z domów koło miasta Enugu w południowej Nigerii. Niestety, pana młodego i pięciu innych osób nie udało się uratować. Policja prowadzi śledztwo w sprawie ich śmierci.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-01/nigeria-tragedia-na-weselu-nie-zyje-pan-mlody-i-piecioro-gosci-14-osob-trafilo-do-szpitala/", "date_published": "2022-09-01 07:57:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Indie. Próbował przemycić ponad pół kilograma złota. Nie uwierzysz, gdzie je ukrył", "description": "Na lotnisku w Indiach zatrzymano podróżnego, który próbował przemycić ponad pół kilograma niemal czystego złota. Nie byłoby w tym nic nadzwyczajnego, gdyby nie fakt, że mężczyzna przemycał cenny kruszec w... odbycie.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-01/indie-probowal-przemycic-ponad-pol-kilograma-zlota-nie-uwierzysz-gdzie-je-ukryl/", "date_published": "2022-09-01 07:09:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Ukraina: Rosjanie tuszują zbrodnię w Mariupolu. \"Każą nam milczeć i po cichu betonować zwłoki\"", "description": "Rosjanie odbudowują zbombardowany Teatr Dramatyczny w Mariupolu. Z informacji przekazanych przez pracujących na miejscu robotników wynika, że okupacyjne władze poleciły im nie wydobywać zwłok ofiar, tylko jak najszybciej zalewać je betonem.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-01/ukraina-rosjanie-tuszuja-zbrodnie-w-mariupolu-kaza-nam-milczec-i-po-cichu-betonowac-zwloki/", "date_published": "2022-09-01 06:16:00+00:00", "persistent": false, "user": null, "language": null}]