[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC9lKBRxxsDIarUmNaPe0h0Q", "title": "The dirty \"Net Zero\" carbon myth (that everyone believes)", "description": "✉️ OUR NEWSLETTER: https://www.abundantia.co/\n📚 OUR COURSE/MEMBERSHIP: http://jointheorder.co/\n🎫 JOIN OUR CHANNEL (get perks): https://bit.ly/3e1Mhso\n\nThis is why Net Zero is a scam. One that is not only basically believed by the whole world, but one that is running our nations, and being bought and paid for by your tax dollars.\n\nYou've definitely heard of \"Net Zero\" before. It was first popularised during the Paris Climate Agreement in 2016, hosted by the United Nations. And while they likely have the best interests of our planet at heart, there are of course massive entities (especially the world's oil companies) who are taking advantage of Net Zero. Mostly, so they can make lots and lots of money.\n\nThe worst thing is, one of the solutions being heralded as our best choice for achieving these goals is carbon capture and storage. Which isn't basically doing anything at all. And is being use to make billions in extra dollars for oil companies.\n\nLet me know your thoughts below.\n\n0:00 - Why Net Zero\n1:02 - Where \"Net Zero\" actually came for\n2:16 - How oil companies lie about Net Zero\n3:38 - Carbon capture isn't what we were promised\n6:38 - Why oil companies really like CCS technology\n8:28 - Net Zero is just misdirection\n10:23 - Some final thoughts\n\n► IMPORTANT LINKS:\nEnter your email below for free weekly lessons and insights into becoming financially free, investing, global tax and corporate structures, passports, residencies, and more.\n\nhttps://www.abundantia.co/\n\n► SOCIAL MEDIA:\n• Abundantia Instagram: @abundantia.co https://www.instagram.com/abundantia.co/\n• Sorelle's Instagram: @sorelleamore  https://instagram.com/sorelleamore\n• Leon's Instagram: @leonhill  https://instagram.com/leonhill\n• Abundantia Twitter: https://twitter.com/abundantiaco\n• Abundantia Facebook: http://facebook.com/abundantiafinance\n\nSorelle and Leon.\nFounders, Abundantia\n\nLiability Disclaimer: https://www.abundantia.co/disclaimer\n*We may earn a commission if you buy any products or services via the links in this video's description. This video is not investment, financial, or legal advice. It may be incorrect, outdated, inaccurate, or reflect personal opinions. This video is for entertainment purposes only.\n\n#NetZero #Carbon #CarbonCapture", "link": "https://www.youtube.com/watch?v=WaLGsZseL3w", "date_published": "2022-09-01 15:02:17+00:00", "persistent": true, "user": "rumpel", "language": "en-US", "tags": ["corporatocracy", "net zero", "climate change"]}]