[{"source": "https://www.theguardian.com/rss", "title": "Putting a price on it: how much should a good bottle of wine really cost?", "description": "<p>Can you ever buy a decent wine for a fiver? And how much is too much to spend on a bottle? A wine industry pro shares his advice on how to get the best value for your money</p><p>There’s a lot of hyperbole surrounding the “proper” cost of wine. Some people insist that procuring quality wine means spending money hand over fist, while others are wedded to ordering the second-least expensive bottle on the menu. And once you take into account production costs and tax, the maths behind how much of your hard-earned money is actually going towards the wine you’re drinking can feel quite murky.</p><p>But what do the experts say? Here, Julian Dyer, UK chief operating officer for Australia’s McGuigan Wines, clears away some of the myths attached to buying a delicious drop that won’t break the bank.</p> <a href=\"https://www.theguardian.com/on-my-terms/2022/sep/01/putting-a-price-on-it-how-much-should-a-good-bottle-of-wine-really-cost\">Continue reading...</a>", "link": "https://www.theguardian.com/on-my-terms/2022/sep/01/putting-a-price-on-it-how-much-should-a-good-bottle-of-wine-really-cost", "date_published": "2022-09-01 09:21:54+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Prize draw: win a £100 bundle of quality Australian wine from McGuigan", "description": "<p>Enter this prize draw to win a selection of palate-pleasing wines from across the McGuigan range</p><p>Based in Australia’s Hunter Valley, the McGuigan family have been making wines for more than a century. With each generation ensuring that their name is synonymous with quality, they’ve dedicated their lives to bringing Australia – and the world – some outstanding drops.</p><p>Now you could enjoy a special selection of bottles from McGuigan, with a bundle of wine up to the value of £100 on offer each month for the next six months. Included will be styles and varietals from across the whole McGuigan range, such as a McGuigan Black Label Chardonnay – perfect for when you want to put your feet up after a long day, stream a movie and indulge in a lovely glass or two (ideally with some crisps and olives on the side). You might also get your hands on a McGuigan Reserve Shiraz, the ideal partner for a winter Sunday roast with friends. And, for when you’re looking to moderate things in the lead up to a busy period, a bottle from the non-alcoholic McGuigan Zero range should see you through.</p> <a href=\"https://www.theguardian.com/on-my-terms/2022/sep/01/prize-draw-win-a-100-bundle-of-quality-australian-wine-from-mcguigan\">Continue reading...</a>", "link": "https://www.theguardian.com/on-my-terms/2022/sep/01/prize-draw-win-a-100-bundle-of-quality-australian-wine-from-mcguigan", "date_published": "2022-09-01 09:16:50+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Russia-Ukraine war: Russia shelling pre-agreed UN route to Zaporizhzhia nuclear plant, says mayor – live", "description": "<p>UN mission to inspect the Russian-held nuclear plant ‘cannot continue’ <a href=\"https://www.theguardian.com/world/live/2022/sep/01/russia-ukraine-war-no-quick-wins-in-kherson-zelenskiy-adviser-says-nuclear-inspectors-due-at-zaporizhzhia-plant-live?page=with:block-6310426b8f08a2989bf54530#block-6310426b8f08a2989bf54530\">due to renewed attacks </a>in the region, Zaporizhzhia regional chief says; IAEA chief wants <a href=\"https://www.theguardian.com/world/live/2022/sep/01/russia-ukraine-war-no-quick-wins-in-kherson-zelenskiy-adviser-says-nuclear-inspectors-due-at-zaporizhzhia-plant-live?filterKeyEvents=false&amp;page=with:block-6310322f8f08148b073a8bfe#block-6310322f8f08148b073a8bfe\">permanent presence</a> at power station</p><ul><li><a href=\"https://www.theguardian.com/world/2022/sep/01/russia-ukraine-war-latest-what-we-know-on-day-190-of-the-invasion\">At a glance: what we know on day 190 of the invasion</a></li></ul> <a href=\"https://www.theguardian.com/world/live/2022/sep/01/russia-ukraine-war-no-quick-wins-in-kherson-zelenskiy-adviser-says-nuclear-inspectors-due-at-zaporizhzhia-plant-live\">Continue reading...</a>", "link": "https://www.theguardian.com/world/live/2022/sep/01/russia-ukraine-war-no-quick-wins-in-kherson-zelenskiy-adviser-says-nuclear-inspectors-due-at-zaporizhzhia-plant-live", "date_published": "2022-09-01 06:13:30+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "All back to the Black Ark! A lifetime of Lee ‘Scratch’ Perry – in pictures", "description": "<p>When music photographer Dennis Morris met the late reggae legend, <a href=\"https://www.theguardian.com/music/2021/aug/29/lee-scratch-perry-visionary-master-of-reggae-dies-aged-85\">who died in December 2021</a>, it was the start of a 40-year friendship involving songs, Sex Pistols … and sorcery</p><p>• <a href=\"https://www.theguardian.com/music/2021/dec/12/obituaries-2021-lee-scratch-perry-remembered-by-neil-mad-professor-fraser\">Lee ‘Scratch’ Perry remembered by Neil ‘Mad Professor’ Fraser</a></p> <a href=\"https://www.theguardian.com/artanddesign/gallery/2022/sep/01/all-back-to-the-black-ark-a-lifetime-of-lee-scratch-perry-in-pictures\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/gallery/2022/sep/01/all-back-to-the-black-ark-a-lifetime-of-lee-scratch-perry-in-pictures", "date_published": "2022-09-01 06:00:47+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Eating meat isn’t a crime against the planet – if it’s done right | Thomasina Miers", "description": "<p>George Monbiot criticised ‘chefs and foodies’ like me for focusing on regenerative grazing. But alternative, lab-grown foods, could have terrible consequences</p><p>I have huge admiration for George Monbiot, a columnist of this newspaper. His work has highlighted the urgent need to reduce our CO2 emissions and switch to greener energy. He has also shown intensive farming’s role in the dramatic levels of species decline and biodiversity loss. Much of what he writes I wholeheartedly agree with – but when it comes to the solutions we need to change our farming and food systems, we have radically different takes.</p><p>It is indisputable that the farming “revolution” of the 1950s, with its widespread use of ammonia fertilisers and herbicides, pesticides and fungicides, has waged war on nature. These intensive, monocultural ways of producing food are not only contaminating our land and waterways, but are heating up our planet and contributing to a crisis in human health (more people die of diet-related disease globally than smoking, <a href=\"https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(19)30041-8/fulltext\">according to a study</a> published in the Lancet). The animals in factory farms don’t have a great time either. The <a href=\"https://www.worldwildlife.org/press-releases/68-average-decline-in-species-population-sizes-since-1970-says-new-wwf-report\">decline</a> of insect life is incredibly worrying: without the earthworm, beetle and bee, life as we know it could cease. Topsoils, which we use to grow <a href=\"https://www.theguardian.com/us-news/2019/may/30/topsoil-farming-agriculture-food-toxic-america\">95% of the world’s food,</a> are depleting <a href=\"https://news.un.org/en/story/2019/12/1052831\">at an astonishing rate</a>. We need to change the way we eat and produce food, and we need to do it quickly.</p><p>Thomasina Miers is a cook, writer and restaurateur</p> <a href=\"https://www.theguardian.com/commentisfree/2022/sep/01/eating-meat-planet-george-monbiot-regenerative-grazing\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/sep/01/eating-meat-planet-george-monbiot-regenerative-grazing", "date_published": "2022-09-01 06:00:47+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Like a ski resort for bikes: downhill mountain biking in Wales", "description": "<p>BikePark Wales offers the UK’s longest beginner trail – 5km – and a great introduction to downhill mountain biking. Our writer and her family try it out</p><p></p><p>The Vicious Valley trail starts with a terrifying half-metre drop off a wooden boardwalk. Like all the advanced runs at BikePark Wales in the Brecon Beacons national park, it begins with a qualifier, that is a tricky opening feature where you can check whether you’re good enough for the trail and, if not, bale out in favour of an easier alternative.</p><p>At the urging of my sons, who are nine and 11, Harry Lewis, one of our two guides, executes a perfect demonstration of how to ride the drop. Namely by jumping off as high as he can. The kids whoop; my husband raises an eyebrow. Then to our great relief, Harry leads us to the new Kermit trail, designed to provide an altogether less intimidating introduction to downhill mountain biking (though at 5km it’s the UK’s longest beginner trail).</p> <a href=\"https://www.theguardian.com/travel/2022/sep/01/mountain-bike-trail-bikepark-wales-brecon-beacons\">Continue reading...</a>", "link": "https://www.theguardian.com/travel/2022/sep/01/mountain-bike-trail-bikepark-wales-brecon-beacons", "date_published": "2022-09-01 06:00:47+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "When did everything become ‘awesome’ and ‘amazing’? I blame the Americans", "description": "<p>A simple ‘thanks’ doesn’t cut it any more, even if you’ve just been given a tin of cat food</p><p><br /></p><p>“Amazing!” she said, as I handed her a tin of cat food. This was the young woman who looks after my neighbour’s cat when he’s away. I was running an errand. It’s nice to be appreciated, but the routine handing over of a tin of cat food is not, in anyone’s book, amazing. What if I’d bought half a dozen tins of cat food? How much more amazing would that have been? Or a dozen tins, a cat bed, a scratching post, and £500 in cash? “Amazing!” wouldn’t cut it; I suppose an “absolutely” would have had to go in front of it. If I threw in some high-end cat treats, I suppose that would necessitate doubling up the adverbs, with a “completely” or some such.</p><p>Where is language going? Once upon a time there would have been a “thanks” or “thank you” for the cat food. Bigger gestures might elicit a “thank you very much” and, on special occasions, a “thank you very much indeed” might have been wheeled out. Now the game’s gone, I tell you. We go straight to “amazing”. Or “awesome”. In both cases, as usual, I think we’re on safe ground blaming the Americans. They too, surely, are behind “thank you <em>so </em>much”. It’s now used so often that the “so much” adds nothing; it’s just a standard thank you.</p><p>Adrian Chiles is a broadcaster, writer and Guardian columnist</p> <a href=\"https://www.theguardian.com/commentisfree/2022/sep/01/when-did-everything-become-awesome-and-amazing-i-blame-the-americans\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/sep/01/when-did-everything-become-awesome-and-amazing-i-blame-the-americans", "date_published": "2022-09-01 06:00:47+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "How could my NatWest current account disappear from the app?", "description": "<p>Cards, cheques and direct debits are lost and fees are mounting</p><p><strong>Four weeks ago, all traces of our joint NatWest current account disappeared from our app, and the balance transferred to our savings account. Our cards, cheques and direct debits were invalidated. We alerted the bank, but all we’ve received since are reprimands for defaulting on payments from the lost account. Late and returned payment fees are mounting up. After visits to our branch, and several letters, we still have no information on reinstatement. We are both 85 and becoming stressed.<br /></strong><em><strong>PG, Bury, Lancashire</strong></em></p><p>This is a bizarre situation and the bank’s apparent indifference to the emergency is troubling. Your credit record could be trashed by a succession of missed payments. And I – and you – are still in the dark about what happened, and why. It appears to have been a bank error rather than fraud. However, within a day of my intervention, you were contacted by the chief executive’s office and your account was reinstated. You now face the hassle of reinstating your direct debits and BACS payees, which have apparently been wiped. NatWest is investigating and has not responded to requests for a comment. But it confirmed it has offered £500 in goodwill, which you generously plan to donate to charity.</p> <a href=\"https://www.theguardian.com/money/2022/sep/01/how-could-my-natwest-current-account-disappear-from-the-app\">Continue reading...</a>", "link": "https://www.theguardian.com/money/2022/sep/01/how-could-my-natwest-current-account-disappear-from-the-app", "date_published": "2022-09-01 06:00:46+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Monkees’ Micky Dolenz sues FBI over ‘secret dossier’ on band", "description": "<p>FBI holds redacted file on 1960s quartet but documents provide few clues as to why band was of interest to federal agents</p><p>The last surviving member of <a href=\"https://www.theguardian.com/music/musicblog/2012/mar/01/the-monkees-believer-davy-jones\">the Monkees</a> is suing the FBI over a “secret dossier” he believes the agency holds on him and his former bandmates.</p><p>Micky Dolenz, 77, the former frontman for the popular British-American 1960s combo, filed the lawsuit through his attorney, Mark Zaid, a freedom of information specialist and music fan who <a href=\"https://www.rollingstone.com/music/music-news/the-monkees-micky-dolenz-fbi-1234584299/\">told Rolling Stone</a> magazine it would be “fun”.</p> <a href=\"https://www.theguardian.com/us-news/2022/sep/01/monkees-micky-dolenz-fbi-secret-dossier-lawsuit\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/sep/01/monkees-micky-dolenz-fbi-secret-dossier-lawsuit", "date_published": "2022-09-01 06:00:46+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The lethal rise of ‘subway surfing’: ‘If someone slips, it’s game over’", "description": "<p>The past year has seen a resurgence in a century-old trend: trying to ride on top of New York trains, with horrific results</p><p>The video quickly went viral in June: a group of people dashing across the roof of a moving New York City J train. Captured from far off, the train can be seen about to cross the Williamsburg Bridge, with its 135-foot drop to the East River – yet the daredevils, dressed in black, leap from car to car.</p><p>A similar stunt resulted in a far more horrifying clip days less than two weeks later, when a 15-year-old boy suffered a <a href=\"https://nypost.com/2022/06/24/teen-in-critical-condition-after-striking-head-while-subway-surfing-atop-nyc-7-train/\">severe head injury</a> while riding on top of a 7 train in Queens. Footage reviewed by the Guardian showed first responders hoisting the profusely bleeding teen off the roof and laying him on the floor with part of his skull separated.</p> <a href=\"https://www.theguardian.com/us-news/2022/aug/31/subway-surfing-new-york-deaths-injuries\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/aug/31/subway-surfing-new-york-deaths-injuries", "date_published": "2022-09-01 06:00:46+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Jam today: Nigerians turn a profit from the choked traffic of Lagos", "description": "<p>The city’s 24 million people can sit in gridlocked streets for more than 30 hours a week. For some, that represents a good way to make a living</p><p>Just after 6am, Omowumi Adekanmbi leaves the one-room flat where she lives with her four children. An hour later, she is at work in the gridlocked morning traffic – her customers the frustrated car commuters of Lagos.</p><p>From a bowl balanced on her head, Adekanmbi deftly hands over cans of fizzy drinks with one hand and collects naira banknotes with the other. When the bowl is empty, she buys more and returns to lines of cars that have barely moved in the meantime.</p><p>Omowumi Adekanmbi with the cold drinks she will sell to a captive audience of stationary motorists</p> <a href=\"https://www.theguardian.com/global-development/2022/sep/01/jam-today-nigerians-turn-a-profit-from-choked-traffic-congestion-of-lagos\">Continue reading...</a>", "link": "https://www.theguardian.com/global-development/2022/sep/01/jam-today-nigerians-turn-a-profit-from-choked-traffic-congestion-of-lagos", "date_published": "2022-09-01 05:30:46+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "TV tonight: Rachel Parris is in the hot seat on Late Night Mash", "description": "<p>A new series of the reliably funny satirical news show sees regular guest Parris taking the reins from Nish Kumar. Plus, Ambulance. Here’s what to watch this evening</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/sep/01/tv-tonight-rachel-parris-is-in-the-hot-seat-on-late-night-mash\">Continue reading...</a>", "link": "https://www.theguardian.com/tv-and-radio/2022/sep/01/tv-tonight-rachel-parris-is-in-the-hot-seat-on-late-night-mash", "date_published": "2022-09-01 05:20:45+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Why Japan’s war on disks could prove to be another flop", "description": "<p>Digital minister Taro Kono wants to follow up his bid to phase out faxes by getting rid of floppy disks – but he faces opposition from bureaucrats</p><p>Japan’s digital minister has declared war on floppy disks, decades after the technology became largely obsolete, but could encounter opposition from analogue devotees inside the country’s vast bureaucracy.</p><p>Taro Kono said he would expand his quest to rid the bureaucracy of outdated tools by phasing out disks and moving administrative procedures online.</p> <a href=\"https://www.theguardian.com/world/2022/sep/01/japan-digital-minister-declares-war-on-floppy-discs\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/sep/01/japan-digital-minister-declares-war-on-floppy-discs", "date_published": "2022-09-01 05:01:13+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Brace yourself for Daisy: Met Office reveals list of storm names for 2022-23", "description": "<p>Weather forecasters say naming storms helps raise public awareness and enables people to stay safe</p><p>The Met Office has revealed the storm names for the 2022-23 season.</p><p>The annual list, first launched in 2015, generally runs from early September until late August, coinciding with the beginning of autumn. Storms are named when they have the potential to cause an amber or red warning.</p> <a href=\"https://www.theguardian.com/uk-news/2022/sep/01/met-office-reveals-list-storm-names-2022-23-weather-forecasters\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/sep/01/met-office-reveals-list-storm-names-2022-23-weather-forecasters", "date_published": "2022-09-01 05:00:47+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘Every time I write, it’s like the first time’: Joyce Carol Oates on her 61 novels, Twitter storms and widowhood", "description": "<p>At 84, Oates still knows how to strike a nerve. She talks about Babysitter – her new book inspired by a Detroit serial killer – loneliness and her controversial tweet about white male writers</p><p>Joyce Carol Oates is on her feet in her study, looking out over woodland in rural Princeton, New Jersey, while her maine coon, Zanche, sprawls atop a swanky white cat tower. We are speaking on video and Oates pans around the room – large, book-lined – to show me it. She lets the camera linger on Zanche, who is amply provided for – she also has her own “catio” garden. “She hopes we won’t interfere with her nap,” Oates says, in a voice that sounds mildly warning. She is friendly, but not in a way that makes her less forbidding.</p><p>We are speaking before the publication of her novel Babysitter, inspired by a serial killer who murdered children in the 1970s in the suburbs of Detroit, where Oates lived at the time. She is 84, but her work remains exceptionally relevant. The film adaptation of her 2000 novel Blonde, a fictionalised account of the life of Marilyn Monroe and “the most difficult novel” she has written, is <a href=\"https://www.theguardian.com/film/2022/may/13/marilyn-monroe-abiding-obsession-biopic-blonde\">to be released on Netflix next month</a>, while Babysitter is unflinching in its detailing of sexual assault before the #MeToo era. According to her publisher, it is Oates’ 61st novel, although no one seems certain, least of all Oates. She waves away the question as if counting is for people who have nothing better to do.</p> <a href=\"https://www.theguardian.com/books/2022/sep/01/every-time-i-write-its-like-the-first-time-joyce-carol-oates-on-her-61-novels-twitter-storms-and-widowhood\">Continue reading...</a>", "link": "https://www.theguardian.com/books/2022/sep/01/every-time-i-write-its-like-the-first-time-joyce-carol-oates-on-her-61-novels-twitter-storms-and-widowhood", "date_published": "2022-09-01 05:00:47+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘Train bragging’: Swedish service joins glorious resurgence of sleeper travel", "description": "<p>Overnight carriages are coming out of mothballs for the Hamburg to Stockholm service as the flight-free movement gathers pace</p><p>On one hand, who wouldn’t love to shower on a train? On the other, if the shower cubicle is so small that you can’t get up again when you’ve dropped the soap maybe it is not such a wonderful idea.</p><p>This year is seeing the glorious resurgence of the sleeper train around Europe, with new routes including Brussels to Prague and Graz, in Austria, to Warsaw. This month a particularly significant overnight train – from Hamburg to Stockholm – starts running. It will be a “gamechanger”, according to the rail travel expert Mark Smith.</p> <a href=\"https://www.theguardian.com/travel/2022/sep/01/train-bragging-swedish-service-joins-glorious-resurgence-of-sleeper-travel\">Continue reading...</a>", "link": "https://www.theguardian.com/travel/2022/sep/01/train-bragging-swedish-service-joins-glorious-resurgence-of-sleeper-travel", "date_published": "2022-09-01 05:00:47+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The sludge king: how one man turned an industrial wasteland into his own El Dorado", "description": "<p>When a Romanian businessman returned to his hometown and found a city blighted by mining waste, he hatched a plan to restore it to its former glory. He became a local hero, but now prosecutors accuse of him a running a multimillion dollar fraud</p><p>The first time I heard the name Daniel Boldor, I was in Bucharest in a room full of police officers. A discussion about wealthy countries shipping their waste to poorer countries had turned to what Romania – one of the <a href=\"https://www.dw.com/en/romania-the-billion-dollar-illegal-trash-industry/av-61692495\" title=\"\">major recipients</a> of Europe’s trash – was doing to fight back. Strict surveillance was being conducted at ports, the officers affirmed, and cargo trucks were undergoing checks. And then one of the policemen asked if I had ever heard the story of Daniel Boldor. For a moment, his colleagues awkwardly scanned the floor<strong> </strong>with their eyes, as if the officer had made some kind of gaffe. Yes, they seemed to eventually nod in agreement, a sense of enthusiasm overtaking the table. It was an extraordinary story.</p><p>It sounded like a fairytale. Some years earlier, hundreds of miles north of Bucharest, deep in the mountains of Transylvania, a Roma man claimed to have discovered a great lost treasure: thousands of tonnes of gold and copper that had been dug up decades earlier, then forgotten. His name was Daniel Boldor, and he had a plan. He found investors across the world. He paid his fellow Roma to gather the metal for him. Then he began selling his treasure. Buyers from South Africa to South Korea proved willing to pay tremendous sums of money for it.</p> <a href=\"https://www.theguardian.com/news/2022/sep/01/sludge-king-industrial-wasteland-el-dorado-romania-baia-mare-cuprom\">Continue reading...</a>", "link": "https://www.theguardian.com/news/2022/sep/01/sludge-king-industrial-wasteland-el-dorado-romania-baia-mare-cuprom", "date_published": "2022-09-01 05:00:46+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Wildlife photographer of the year 2022 – highly commended pictures", "description": "<p>Highly commended images from the<strong> </strong><a href=\"https://www.nhm.ac.uk/wpy/\">wildlife photographer of the year</a> contest. Winners will be announced on 11 October and an exhibition of the 100 award-winning shots will open at the Natural History Museum on 14 October</p> <a href=\"https://www.theguardian.com/environment/gallery/2022/sep/01/wildlife-photographer-of-the-year-2022-highly-commended-pictures\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/gallery/2022/sep/01/wildlife-photographer-of-the-year-2022-highly-commended-pictures", "date_published": "2022-09-01 05:00:46+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Carbon capture is not a solution to net zero emissions plans, report says", "description": "<p>The technology, put forward as part of the UK’s net zero strategy, could extend the life of fossil fuel infrastructure</p><p>Carbon capture and storage schemes, a key plank of many governments’ net zero plans, “is not a climate solution”, the author of a major new report on the technology has said.</p><p>Researchers for the Institute for Energy Economics and Financial Analysis (IEEFA) found underperforming carbon capture projects considerably outnumbered successful ones by large margins.</p> <a href=\"https://www.theguardian.com/environment/2022/sep/01/carbon-capture-is-not-a-solution-to-net-zero-emissions-plans-report-says\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/sep/01/carbon-capture-is-not-a-solution-to-net-zero-emissions-plans-report-says", "date_published": "2022-09-01 05:00:45+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "US blocks sales of some AI chips to China as tech crackdown intensifies", "description": "<p>Ban on Nvidia and AMD sales marks a major escalation of US efforts to restrict China’s military technology capabilities as tensions bubble over Taiwan<br /></p><p>Chip designer Nvidia said that US officials told it to stop exporting two top computing chips for artificial intelligence work to China, a move that could cripple Chinese firms’ ability to carry out advanced work like image recognition.<br /></p><p>The company on Wednesday said the ban, which affects its A100 and H100 chips designed to speed up machine learning tasks, could interfere with completion of developing the H100, the flagship chip Nvidia announced this year.</p> <a href=\"https://www.theguardian.com/world/2022/sep/01/us-blocks-sales-of-some-ai-chips-to-china-as-tech-crackdown-intensifies\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/sep/01/us-blocks-sales-of-some-ai-chips-to-china-as-tech-crackdown-intensifies", "date_published": "2022-09-01 04:46:47+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "100 days until Cop15: what next to save nature?", "description": "<p>It is now less than 100 days until Cop15, the UN convention on biological diversity. At these talks, which are taking place in Montreal, Canada in December, governments from around the world will come together to agree targets aimed at halting the destruction of the natural world and protecting biodiversity. With the Earth experiencing the largest loss of life since the extinction of the dinosaurs, what is decided at this meeting could shape the future of the planet and humanity.</p><p>Madeleine Finlay speaks to biodiversity reporter Phoebe Weston about how negotiations have been going so far, and what’s next on the road to Cop15</p><p><em>Archive: BBC News, Sky News</em></p> <a href=\"https://www.theguardian.com/science/audio/2022/sep/01/100-days-until-cop15-what-next-to-save-nature\">Continue reading...</a>", "link": "https://www.theguardian.com/science/audio/2022/sep/01/100-days-until-cop15-what-next-to-save-nature", "date_published": "2022-09-01 04:00:44+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Libyans have lost faith in political class, US diplomat says after Tripoli clashes", "description": "<p>UN security council hears bleak assessment of country’s prospects after violence between militia in capital</p><p>Libyans have lost faith that the political class and its allied militias and mercenaries are willing to end their robbery of the nation’s wealth, a senior US diplomat has warned, after some of the worst violence in Tripoli in years.</p><p>More than 32 people were killed and 150 wounded in clashes in the capital last week between militia allied to the rival prime ministers Abdul Hamid Dbeibah and Fathi Bashagha.</p> <a href=\"https://www.theguardian.com/world/2022/sep/01/libyans-have-lost-faith-in-political-class-us-diplomat-says-after-tripoli-clashes\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/sep/01/libyans-have-lost-faith-in-political-class-us-diplomat-says-after-tripoli-clashes", "date_published": "2022-09-01 04:00:44+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Russian parents and teachers urged to boycott ‘propaganda classes’", "description": "<p>Activists say ‘conversations about important things’ classes will seek to indoctrinate children as young as six</p><p>When Russian schools open on Thursday, students will have a new lesson on their schedule: “conversations about important things”, a mysterious class that critics believe will be used to deliver propaganda about Russia’s invasion of Ukraine.</p><p>Russian activists are calling for parents and teachers to boycott required “patriotic” lessons in Russian schools that many fear will seek to indoctrinate students as young as six.</p> <a href=\"https://www.theguardian.com/world/2022/sep/01/russian-parents-and-teachers-urged-to-boycott-propaganda-classes\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/sep/01/russian-parents-and-teachers-urged-to-boycott-propaganda-classes", "date_published": "2022-09-01 04:00:44+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Jack Draper topples Félix Auger-Aliassime to crash US Open third round", "description": "<ul><li>Fast-rising Briton scores upset of No 6 seed Auger-Aliassime</li><li>Draper, 20, faces 27th seed Karen Khachanov in third round</li></ul><p>Jack Draper launched himself into the big time by upsetting sixth seed Félix Auger-Aliassime in the second round of the US Open.</p><p>The 20-year-old Londoner has established himself as one of the game’s most exciting young talents this year and he went into Wednesday night’s match against Auger-Aliassime fully believing he could win.</p> <a href=\"https://www.theguardian.com/sport/2022/aug/31/jack-draper-upset-felix-auger-aliassime-us-open\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/aug/31/jack-draper-upset-felix-auger-aliassime-us-open", "date_published": "2022-09-01 03:52:07+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Three things I have learned about end-of-life care from treating elderly couples with cancer | Ranjana Srivastava", "description": "<p>Experience provides fortitude, equanimity and perspective. Not everyone wants to live forever</p><p>“We are happy and sad to see you again. You looked after Dad years ago.”</p><p>I kick myself for not registering the connection, although I only met him during a brief and disastrous stint in hospital.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/sep/01/three-things-i-have-learned-about-end-of-life-care-from-treating-elderly-couples-with-cancer\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/sep/01/three-things-i-have-learned-about-end-of-life-care-from-treating-elderly-couples-with-cancer", "date_published": "2022-09-01 03:50:59+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Two Trump lawyers could be witnesses or targets in FBI investigation", "description": "<p>Christina Bobb and Evan Corcoran face scrutiny over their communications with the justice department, legal experts say</p><p>Two lawyers for <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> could become witnesses or targets in the obstruction investigation connected to the criminal probe of the former president’s unauthorized retention of highly-sensitive government documents at his Mar-a-Lago resort in Florida, according to legal experts.</p><p>The lawyers – Christina Bobb and Evan Corcoran – face becoming ensnared in the investigation because they liaised with the justice department during the government’s months-long effort to retrieve boxes of presidential records and classified documents from Trump’s Florida home.</p> <a href=\"https://www.theguardian.com/us-news/2022/aug/31/donald-trump-lawyers-christina-bobb-evan-corcoran\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/aug/31/donald-trump-lawyers-christina-bobb-evan-corcoran", "date_published": "2022-09-01 03:25:30+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Culture this autumn: what to watch, read and listen to – podcast", "description": "<p>Guardian critics Laura Snapes, Lucy Knight and Kate Abbott on their recommendations from the worlds of music, books and TV</p><p>As the summer draws to a close, we look forward to the music, books and TV shows coming up this autumn. <strong>Hannah Moore</strong> speaks to music editor <strong>Laura Snapes</strong>, the Guardian commissioning editor for books <strong>Lucy Knight</strong>, and its TV editor, <strong>Kate Abbott</strong>.</p><p>The recommendations referenced in this episode:</p> <a href=\"https://www.theguardian.com/news/audio/2022/sep/01/culture-this-autumn-what-to-watch-read-and-listen-to-podcast\">Continue reading...</a>", "link": "https://www.theguardian.com/news/audio/2022/sep/01/culture-this-autumn-what-to-watch-read-and-listen-to-podcast", "date_published": "2022-09-01 02:00:41+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Serena Williams rolls back the years at US Open to beat No 2 seed Kontaveit", "description": "<ul><li>23-time major champion seals 7-6, 2-6, 6-2  victory</li><li><a href=\"https://www.theguardian.com/sport/live/2022/aug/31/serena-williams-v-anett-kontaveit-us-open-tennis-2022-live\">As it happened: Beau Dure’s game-by-game report</a></li></ul><p>Serena Williams is improbably through to the third round of the US Open after a 7-6 (4), 2-6, 6-2 win over the second-seeded Anett Kontaveit on Wednesday night, extending what she’s strongly hinted will be the final event of her storied career for at least two more days.</p><p>The 23-time major singles champion, who entered the tournament ranked 605th with only one match win in 450 days, won a tense opening set in a tiebreaker before Kontaveit, the world No 2 from Estonia, broke immediately to open the second then twice more to force a decider.</p> <a href=\"https://www.theguardian.com/sport/2022/aug/31/serena-williams-beats-anett-kontaveit-us-open-tennis-third-round\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/aug/31/serena-williams-beats-anett-kontaveit-us-open-tennis-third-round", "date_published": "2022-09-01 01:47:10+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Suez Canal briefly blocked again after another ship, Affinity V, becomes stuck", "description": "<p>Tanker blocked canal for hours, close to where Ever Given container ship became stuck, disrupting supply chains for a week</p><p>A tanker getting stuck used to be more the domain of niche business news, but that was before the Ever Given, so all eyes were soon on the Affinity V tanker’s plight in the Suez Canal. </p><p>On Wednesday, the 250-metre long Affinity V tanker was bound for Saudi Arabia when it ran aground close to the same spot in the narrow southern section of the canal in Egypt <a href=\"https://www.theguardian.com/world/2021/mar/29/suez-canal-attempt-re-float-ever-given-delay-salvage-tugboats\">where the Ever Given container ship caused a week-long halt to traffic </a>in March 2021, dominating global headlines and paralysing supply chains.</p> <a href=\"https://www.theguardian.com/world/2022/sep/01/suez-canal-ship-stuck-blocked-again-affinity-v\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/sep/01/suez-canal-ship-stuck-blocked-again-affinity-v", "date_published": "2022-09-01 01:17:40+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Russia-Ukraine war latest: what we know on day 190 of the invasion", "description": "<p>Ukraine’s Kherson counteroffensive has not stalled or failed, Zelenskiy adviser says; uncertainty around UN nuclear watchdog visit to Zaporizhzhia</p><ul><li><strong><a href=\"https://www.theguardian.com/world/ukraine\">See all our Ukraine war coverage</a></strong></li></ul> <a href=\"https://www.theguardian.com/world/2022/sep/01/russia-ukraine-war-latest-what-we-know-on-day-190-of-the-invasion\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/sep/01/russia-ukraine-war-latest-what-we-know-on-day-190-of-the-invasion", "date_published": "2022-09-01 01:00:02+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Shamima Begum: Justin Trudeau to ‘follow up’ Canadian spy claim", "description": "<p>Canada’s PM defends need for ‘flexible and creative’ intelligence work by CSIS after claim operative delivered 15-year-old to Islamic State </p><p>Justin Trudeau has pledged to “follow up” on allegations that a spy working for Canadian intelligence trafficked British schoolgirls into Syria where at least one married an Islamic State fighter.</p><p>Shamima Begum was smuggled into the hands of Islamic State at the age of 15, and the work of the people smuggler for the Canadian Security Intelligence Service (CSIS) was covered up by the police and Britain’s security services, it has been claimed in a book out this week.</p> <a href=\"https://www.theguardian.com/uk-news/2022/sep/01/shamima-begum-justin-trudeau-to-follow-up-canadian-spy-claim\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/sep/01/shamima-begum-justin-trudeau-to-follow-up-canadian-spy-claim", "date_published": "2022-09-01 00:50:06+00:00", "persistent": false, "user": null, "language": "en-UK"}]