[{"source": "https://www.dailywire.com/feeds/rss.xml", "title": "New Orleans Nun In Her 80s Found Alive After Gunmen In West Africa Kidnapped Her 5 Months Ago", "description": "A New Orleans Archbishop announced Wednesday that an 83-year-old Louisiana nun captured by a group of gunmen five months ago while living and working in a West African country had been found. Sister Suellen Theresa Tennyson, a member of the Marianites of Holy Cross in Lousiana, was kidnapped from her bed at a mission site ...", "link": "https://www.dailywire.com/news/new-orleans-nun-in-her-80s-found-alive-after-gunmen-in-west-africa-kidnapped-her-5-months-ago", "date_published": "2022-09-01 23:08:06+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Video: Man Points Gun Inches From Argentine Vice President’s Face In Alleged Assassination Attempt", "description": "Argentine Vice President Cristina Fernandez was threatened Thursday night by a man in a crowd who pointed a gun inches away from her face. The alleged assassination attempt happened in front of the vice president’s home in Buenos Aires. Video of the incident shows Fernandez ducking down in shock after the weapon is pointed at ...", "link": "https://www.dailywire.com/news/video-man-points-gun-inches-from-argentine-vice-presidents-face-in-alleged-assassination-attempt", "date_published": "2022-09-01 22:44:50+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Biden Slammed Across Political Spectrum For Optics Of Divisive Speech: ‘Satanic Ghoul’", "description": "Democrat President Joe Biden faced backlash over the speech that he delivered Thursday evening for its dark and divisive tone, as well as its optics. Biden repeatedly demonized millions of Americans for their political views, calling them &#8220;extremists&#8221; who present a threat to the U.S., while simultaneously claiming that he wanted to unite the country. ...", "link": "https://www.dailywire.com/news/biden-slammed-across-political-spectrum-for-optics-of-divisive-speech-satanic-ghoul", "date_published": "2022-09-01 22:09:48+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "The ‘Soul’ Of Joe Biden’s America Is Dark As Hell", "description": "Thursday evening, President Joe Biden delivered a supposedly non-political speech in which he demonized half the country as &#8220;threats&#8221; who represent &#8220;a clear and present danger&#8221; to our nation. The entire speech was evidence that the &#8220;soul&#8221; of Biden&#8217;s America is dark as hell. Biden, standing before Independence Hall in Philadelphia, made it clear that ...", "link": "https://www.dailywire.com/news/the-soul-of-joe-bidens-america-is-dark-as-hell", "date_published": "2022-09-01 21:55:22+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Kevin McCarthy Lambasts Biden Over Decision To ‘Divide, Demean, And Disparage’ Americans", "description": "House Minority Leader Kevin McCarthy (R-CA) slammed Democrat President Joe Biden Thursday afternoon for pitting Americans against each other while also ignoring the crises that have erupted during his first two years in office. McCarthy made the remarks ahead of Biden&#8217;s speech Thursday evening in Philadelphia, which was widely condemned by many as being dark ...", "link": "https://www.dailywire.com/news/kevin-mccarthy-lambasts-biden-over-decision-to-divide-demean-and-disparage-americans", "date_published": "2022-09-01 21:45:21+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "WATCH: Taliban Parades In Front Of U.S. Embassy To Celebrate Withdrawal Anniversary", "description": "The Taliban celebrated the anniversary of the withdrawal of American forces from Afghanistan on Wednesday with a parade in front of the U.S. Embassy in Kabul and in front of Bagram Air Base. The withdrawal followed a 20-year-long insurgency against a U.S.-led NATO force and the rapid collapse of the U.S.-backed government, which fell almost ...", "link": "https://www.dailywire.com/news/watch-taliban-parades-in-front-of-u-s-embassy-to-celebrate-withdrawal-anniversary", "date_published": "2022-09-01 21:19:09+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘F*** Joe Biden!’: Biden Heckled During Dark And Divisive Speech", "description": "Democrat President Joe Biden was interrupted during his dark and divisive speech Thursday night by a heckler who repeatedly chanted obscenities at the beleaguered president. The disruptions came as Biden repeatedly demonized millions of Americans as &#8220;extremists&#8221; who present a threat to the country. &#8220;F*** Joe Biden,&#8221; the heckler chanted. &#8220;F*** Joe Biden.&#8221; WATCH: Biden ...", "link": "https://www.dailywire.com/news/f-joe-biden-biden-heckled-during-dark-and-divisive-speech", "date_published": "2022-09-01 21:05:49+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Biden Demonizes Millions Of Americans While Calling For Unity", "description": "Democrat President Joe Biden demonized millions of Americans during a primetime speech Thursday evening where he claimed that he wanted the country to unite. Biden repeatedly had to clear his throat and coughed throughout the speech as he claimed that people who challenged the results of the 2020 presidential election were &#8220;extremists.&#8221; &#8220;Too much of ...", "link": "https://www.dailywire.com/news/biden-demonizes-millions-of-americans-while-calling-for-unity", "date_published": "2022-09-01 20:53:22+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Chicago Hospital Works Hand-In-Glove With Schools To Push Gender Transition, Radical Gender Theory On Students: Report", "description": "The Children&#8217;s Hospital of Chicago is working hand-in-glove with Chicago schools to push radical gender theory and gender transition on students. Documents obtained by writer and activist Christopher Rufo show that the Ann and Robert H. Lurie Children&#8217;s Hospital of Chicago is collaborating with schools to push radical gender theory, providing school administrators with training ...", "link": "https://www.dailywire.com/news/chicago-hospital-works-hand-in-glove-with-schools-to-push-gender-transition-radical-gender-theory-on-students-report", "date_published": "2022-09-01 20:03:39+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Nickelodeon Actress Says ‘Sexualized’ Scene With Pickle Not Cut From Show, Talks Revealing Outfits", "description": "&#8220;Victorious&#8221; actress Daniella Monet says she previously asked Nickelodeon to cut what she felt was a &#8220;sexualized&#8221; scene of her, but had her request denied. Monet, who played Trina Vega on the hit show, told Insider that in one scene, she was told to eat a pickle and apply lip gloss, which the actress felt was ...", "link": "https://www.dailywire.com/news/nickelodeon-actress-says-sexualized-scene-with-pickle-not-cut-from-show-talks-revealing-outfits", "date_published": "2022-09-01 19:52:29+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Alligator Bites Florida Wildlife Park Director’s Hand Resulting In Amputation; Second Alligator Attack In Ten Years", "description": "Almost 10 years after an alligator ripped most of a Florida wildlife park director&#8217;s right arm off, the reptile expert completely lost his left hand after enduring another alligator attack earlier this month. Greg Graziani, wildlife director of Florida Gator Gardens in Venus, Florida, was &#8220;seriously injured during a routine interaction&#8221; with a large alligator ...", "link": "https://www.dailywire.com/news/alligator-bites-florida-wildlife-park-directors-hand-resulting-in-amputation-second-alligator-attack-in-ten-years", "date_published": "2022-09-01 19:40:48+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "California Passes $54 Billion In Climate Spending, Votes To Keep Nuclear Plant Open, But Infringes On Oil And Gas Wells", "description": "The California legislature passed massive climate spending on Wednesday, and voted to keep the state’s last remaining nuclear power plant open another five years. In a final push during the legislative session, California lawmakers greenlit a record $54 billion in climate spending, and passed new regulations for oil and gras drilling. They also passed a ...", "link": "https://www.dailywire.com/news/california-passes-54-billion-in-climate-spending-votes-to-keep-nuclear-plant-open-but-infringes-on-oil-and-gas-wells", "date_published": "2022-09-01 19:29:55+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Matt Walsh Blasts Time Magazine For Using Made-Up Pronouns, Promoting Sexually Explicit Children’s Literature", "description": "Bestselling children’s author and Daily Wire host Matt Walsh ripped into Time Magazine after the news site published an article featuring LGBTQ children’s cartoonist and writer Maia Kobabe. Time’s interview piece with Kobabe, the writer of the sexually explicit children’s book “Gender Queer,” referred to the biological woman by made-up pronouns “e/em/eir.” During Thursday’s episode ...", "link": "https://www.dailywire.com/news/matt-walsh-blasts-time-magazine-for-using-made-up-pronouns-promoting-sexually-explicit-childrens-literature", "date_published": "2022-09-01 19:25:07+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Madonna Shares Regrets About Both Marriages, Talks About ‘Sex’ Obsession", "description": "Madonna opened up about both of her marriages and admitted she shouldn&#8217;t have gone down the aisle not once but twice. The 64-year-old pop singer shared a video on YouTube recently, titled “Finally Enough Talk: 50 Questions With Madonna,” as she answered a series of rapid fire questions about everything from her thoughts regarding her ...", "link": "https://www.dailywire.com/news/madonna-shares-regrets-about-both-marriages-talks-about-sex-obsession", "date_published": "2022-09-01 18:54:19+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "White House Asked Meta To Remove Fauci Parody Account. Meta Responded In Less Than 60 Seconds.", "description": "When the Biden administration wanted an Instagram account mocking Dr. Anthony Fauci taken down last year, an official reached out to parent company Meta and got action literally within seconds. The July 20, 2021 incident, revealed in a newly surfaced email exchange, underscores the close communication between the Democrat White House and solicitous social media ...", "link": "https://www.dailywire.com/news/white-house-asked-meta-to-remove-fauci-parody-account-meta-responded-in-less-than-60-seconds", "date_published": "2022-09-01 18:10:21+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "China Committed ‘Serious Human Rights Violations’ In Uyghur Concentration Camps: UN Report", "description": "The UN Commission on Human Rights released a stunning report on Wednesday alleging that human rights abuses China has committed against the Uyghur minority population may constitute “crimes against humanity.” The 48-page report outlines allegations leveled against the Chinese Communist Party for years by numerous journalists, governments, and international organizations. The Uyghurs, an Islamic, Turkic-speaking ...", "link": "https://www.dailywire.com/news/china-committed-serious-human-rights-violations-in-uyghur-concentration-camps-un-report", "date_published": "2022-09-01 17:57:33+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "New Report May Reveal Reason Behind Tom Brady’s Mysterious Two-Week ‘Personal’ Absence", "description": "A new report Thursday may potentially shed some light on Tom Brady&#8217;s mysterious 11-day &#8220;personal&#8221; absence from football. Several sources informed the New York Post&#8217;s Page Six website that Brady and his wife, Gisele Bündchen, have been feuding over the future Hall-of-Fame quarterback&#8217;s decision to un-retire from football. Bündchen has reportedly left the Brady family&#8217;s home ...", "link": "https://www.dailywire.com/news/new-report-may-reveal-reason-behind-tom-bradys-mysterious-two-week-personal-absence", "date_published": "2022-09-01 17:46:28+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Colorado Residents Find Thermostats Locked At 78 Degrees Due To ‘Energy Emergency’", "description": "Thousands of Colorado residents were unable to change the temperatures in their own homes on Tuesday when a smart thermostat company locked its devices at a balmy 78 degrees Fahrenheit due to a local “energy emergency.” Xcel Energy offers a one-time $100 bill credit and a $25 annual incentive for Colorado customers who enroll in ...", "link": "https://www.dailywire.com/news/colorado-residents-find-thermostats-locked-at-78-degrees-due-to-energy-emergency", "date_published": "2022-09-01 17:27:05+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Rising Hockey Star Collapses And Dies After Game At Age 20", "description": "Rising ice hockey star Eli Palfreyman collapsed after playing a game with his team in Ontario, and was later pronounced dead after being transported to the hospital. He was 20 years-old. The 2nd year player with the Ayr Centennials of the Greater Ontario Junior Hockey League took to the ice Tuesday with his team at ...", "link": "https://www.dailywire.com/news/rising-hockey-star-collapses-and-dies-after-game-at-age-20", "date_published": "2022-09-01 17:18:35+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "State Becomes First To Shut Down All Its Coal Power Plants", "description": "The last coal power plant in Hawaii ceased operations this week, meaning that the Aloha State is the first in the nation to execute a ban on the fossil fuel. AES Corporation’s coal plant on the island of Oahu, which supplied one-fifth of residents’ electricity, closed on Thursday after 30 years of operation. Hawaii was ...", "link": "https://www.dailywire.com/news/state-becomes-first-to-shut-down-all-its-coal-power-plants", "date_published": "2022-09-01 17:16:28+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Senator And Husband Who Spent Career In Government Have Net Worth Of Up To To $7 Million", "description": "During her 2016 Senate campaign, USA Today reported that Nevada&#8217;s next senator would not be a millionaire: It would be a choice between Republican Joe Heck, who had a net worth between negative $350,000 and positive $350,000, and Catherine Cortez Masto. But Masto&#8217;s net worth rose quickly while she was in office.But Sen. Masto&#8217;s net worth rose quickly while she was in office", "link": "https://www.dailywire.com/news/senator-and-husband-who-spent-career-in-government-have-net-worth-of-up-to-to-7-million", "date_published": "2022-09-01 17:13:41+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘I’m The Last One Who’ll Ever Retreat’: Sarah Palin Condemns Ranked Choice Voting System Following Election", "description": "Former 2008 vice presidential candidate Sarah Palin, who ran for Alaska&#8217;s lone U.S. House seat, condemned the special election results Thursday, which used ranked-choice voting to declare her Democrat opponent Mary Peltola the victor. &#8220;Ranked-choice voting was sold as the way to make elections better reflect the will of the people,&#8221; Palin said in a ...", "link": "https://www.dailywire.com/news/im-the-last-one-wholl-ever-retreat-sarah-palin-condemns-ranked-choice-voting-system-following-election", "date_published": "2022-09-01 17:12:52+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "The Latin Mass, Cast Aside By the Vatican, Finds An Unexpected Ally", "description": "Those who have been to a Catholic mass in the extraordinary form usually have a decided love or distaste for the Latin Mass. Incense swirls around the altar, where red and white clad altar boys kneel, heads bowed in reverence, and the priest intones the mass in Latin facing an ornate gold tabernacle. Latin Mass ...", "link": "https://www.dailywire.com/news/the-latin-mass-cast-aside-by-the-vatican-finds-an-unexpected-ally", "date_published": "2022-09-01 17:10:35+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Lindsey Graham Once Choked Up Talking About Biden. Now The White House Says He’s A Threat To The Country.", "description": "The old saying goes, &#8220;If you need a friend in Washington, buy a dog.&#8221; It seems Senator Lindsey Graham (R-SC) is learning that lesson the hard way when it comes to his friendship with President Joe Biden. For the apparent sin of not condemning the MAGA movement, Graham has gone from being one of Biden&#8217;s ...", "link": "https://www.dailywire.com/news/lindsey-graham-once-choked-up-talking-about-biden-now-the-white-house-says-hes-a-threat-to-the-country", "date_published": "2022-09-01 17:06:10+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Historic Numbers Of Cuban Migrants Are Coming To The U.S.", "description": "Cubans are migrating to the United States at the highest rate since Fidel Castro was in power in 1959. Migrants are escaping political repression under the communist regime and the economic crisis plaguing the island nation. The numbers are staggering. Over 175,000 Cuban migrants have been apprehended in the country between October of last year ...", "link": "https://www.dailywire.com/news/historic-numbers-of-cuban-migrants-are-coming-to-the-u-s", "date_published": "2022-09-01 16:20:35+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Alec Baldwin Takes Swipe At ‘Saturday Night Live’ Star Rob Schneider After Comedian Says Show’s ‘Over’", "description": "Alec Baldwin took a swipe at fellow “Saturday Night Live” star Rob Schneider after the comedian said the show was “over” the day it reacted to Hillary Clinton&#8217;s presidential loss with no punch line. Baldwin, 64, took to Instagram Wednesday to share a video of himself reacting to Schneider&#8217;s comments, then criticized the comedian for ...", "link": "https://www.dailywire.com/news/alec-baldwin-takes-swipe-at-saturday-night-live-star-rob-schneider-after-comedian-says-shows-over", "date_published": "2022-09-01 16:18:45+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Putin To Skip Gorbachev’s Funeral", "description": "Russian President Vladimir Putin will skip the funeral of the late Soviet leader Mikhail Gorbachev, a Kremlin spokesperson said Thursday.  Gorbachev, who oversaw the demise of the Soviet Union, died Tuesday at the age of 91. The funeral will be held on Saturday and open to the public, but the Kremlin has said that scheduling ...", "link": "https://www.dailywire.com/news/putin-to-skip-gorbachevs-funeral", "date_published": "2022-09-01 15:37:34+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "WATCH: Amazing New Footage Of Titanic On Ocean Floor", "description": "New footage taken by a diving excursion company shows, for the first time, the submerged 200-pound anchor chain, giant portside anchor and single-ended boiler of the doomed 1912 ship the Titanic. On April 14, 1912, the Titanic sank over 12,000 feet to the seafloor after breaking in two pieces from hitting an iceberg. Of the ...", "link": "https://www.dailywire.com/news/watch-amazing-new-footage-of-titanic-on-ocean-floor", "date_published": "2022-09-01 15:28:41+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Sure Sounds Higher Than 5%’: Elon Musk Quips As Report Says That 80% Of Twitter Accounts Are Fake", "description": "Elon Musk, who filed to cancel his agreement to buy Twitter in July after saying Twitter minimized the number of fake accounts on its platform, reacted to a report from a former CIA and FBI cyber security specialist who said the number of fake accounts on Twitter is far larger than the company admits. Dan ...", "link": "https://www.dailywire.com/news/sure-sounds-higher-than-5-elon-musk-quips-as-report-says-that-80-of-twitter-accounts-are-fake", "date_published": "2022-09-01 15:24:28+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Get Woke, Go Broke: Amazon Installed Solar Panels In An Attempt To Go Net Zero. They Kept Catching Fire And Were Turned Off.", "description": "Amazon powered off the solar roofs helping to supply electricity at its fulfillment centers after multiple fires and electrical explosions, according to a report from CNBC. Internal documents viewed by the outlet revealed that six out of 47 sites in North America with solar installations experienced “critical fire or arc flash events” between April 2020 ...", "link": "https://www.dailywire.com/news/get-woke-go-broke-amazon-installed-solar-panels-in-an-attempt-to-go-net-zero-they-kept-catching-fire-and-were-turned-off", "date_published": "2022-09-01 15:15:51+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Top Russian Oil Executive Dies Under Mysterious Circumstances After Criticizing Putin’s War", "description": "A top Russian oil executive died under mysterious circumstances this week after criticizing Russian President Vladimir Putin&#8217;s war in Ukraine. Ravil Maganov, the chairman of Russia&#8217;s second-largest oil producer Lukoil, died Thursday after he fell from a hospital window in Moscow. Sources close to Maganov told Reuters they believed it was highly unlikely he killed ...", "link": "https://www.dailywire.com/news/top-russian-oil-executive-dies-under-mysterious-circumstances-after-criticizing-putins-war", "date_published": "2022-09-01 15:13:24+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "What The Bible Really Says About Gender", "description": "What the Bible says about gender is what most of us always took for granted — namely, that there are only two genders, male and female, and those two genders are directly related to our biological sex. It’s as simple as that. In the beginning, God created the human race as male and female, starting ...", "link": "https://www.dailywire.com/news/what-the-bible-really-says-about-gender", "date_published": "2022-09-01 14:58:11+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "MIDTERM EXAM: All The Latest On The 2022 Elections (Part Two)", "description": "This week, we have another two-part exam for Daily Wire readers. There’s a lot going on in this election cycle, and we’ll hit all the top news once or twice a week so you don’t miss a thing as we approach Election Day 2022. Read part one here. Biden&#8217;s Big Ol&#8217; Gaffe In Wilkes-Barre President ...", "link": "https://www.dailywire.com/news/midterm-exam-all-the-latest-on-the-2022-elections-part-two-3", "date_published": "2022-09-01 14:48:53+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "SEE IT: Biggest Cruise Ship Ever Built Could Be Scuttled Before It Ever Sails", "description": "The biggest cruise ship ever built could be scuttled before its maiden voyage after its German builder went kaput. Global Dream II, a 1,122-foot vessel that features an outdoor waterpark and a cinema and was designed to carry up to 9,000 passengers, cost $1.8 billion to build. But now it could be sold for scrap ...", "link": "https://www.dailywire.com/news/see-it-biggest-cruise-ship-ever-built-could-be-scuttled-before-it-ever-sails", "date_published": "2022-09-01 14:27:22+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "South Pacific Nation Pausing Naval Port Visits After U.S. Coast Guard Ship Blocked", "description": "A strategically located South Pacific nation has announced a temporary ban on all U.S. and foreign military ships docking in its ports after a U.S. Coast Guard ship was denied entry last week. Solomon Islands Prime Minister Manasseh Sogavare announced this week that he was implementing a moratorium on foreign military forces docking at its ...", "link": "https://www.dailywire.com/news/south-pacific-nation-pausing-naval-port-visits-after-u-s-coast-guard-ship-blocked", "date_published": "2022-09-01 14:18:54+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "FDA Authorizes Pfizer and Moderna’s Updated COVID Boosters", "description": "The Food and Drug Administration (FDA) authorized updated COVID booster shots on Wednesday created to specifically target subvariants of Omicron. The FDA shared the approval in a Wednesday announcement that amended the emergency use authorizations for both Pfizer/BioNTech and Moderna&#8217;s boosters. “The COVID-19 vaccines, including boosters, continue to save countless lives and prevent the most ...", "link": "https://www.dailywire.com/news/fda-authorizes-pfizer-and-modernas-updated-covid-boosters", "date_published": "2022-09-01 14:10:09+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘House Of The Dragon’ Showrunner Quits Just 2 Weeks After Big Series Premiere", "description": "“House of the Dragon” is a huge success for HBO Max, but that wasn’t enough to keep the co-showrunner Miguel Sapochnik on staff. Sapochnik announced Wednesday that he was leaving the popular “Game of Thrones” prequel spinoff just a few days after the second episode dropped. He had previously worked on “Thrones” before scoring the ...", "link": "https://www.dailywire.com/news/house-of-the-dragon-showrunner-quits-just-2-weeks-after-big-series-premiere", "date_published": "2022-09-01 14:02:37+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘A Scam’: GOP Senator Blasts Ranked-Choice Voting After Alaska Democrat Wins House Seat", "description": "Republican Senator Tom Cotton referred to ranked-choice voting as &#8220;a scam&#8221; after an Alaska Democrat won the state&#8217;s House special election with only 40% of first place votes in the initial count. Cotton made the comment in a Twitter post following the announcement that Democrat Mary Peltola won Alaska&#8217;s only House seat despite Republican candidates ...", "link": "https://www.dailywire.com/news/a-scam-gop-senator-blasts-ranked-choice-voting-after-alaska-democrat-wins-house-seat", "date_published": "2022-09-01 13:47:41+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘We’re Just Getting Started’: GOP Attorneys General Demand DOJ Reveal Federal Gov’t’s Communications With Social Media Giants", "description": "The man who may become Missouri’s next GOP senator has targeted President Biden’s Department of Justice, asking a court to force the DOJ to reveal communications between high-ranking Biden Administration officials and major social media companies. Missouri Attorney General Eric Schmitt, the GOP senatorial candidate, joined Louisiana Attorney General Jeff Landry to file a Joint ...", "link": "https://www.dailywire.com/news/were-just-getting-started-gop-attorneys-general-demand-doj-reveal-federal-govts-communications-with-social-media-giants", "date_published": "2022-09-01 13:41:50+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Biden Says His Spending Agenda ‘Took America From An Economic Crisis To An Economic Recovery’", "description": "President Joe Biden claimed on Wednesday that the American Rescue Plan was responsible for an apparent economic rebound in the United States. The economy met the rule-of-thumb definition of a recession — two consecutive quarters of negative growth — two months ago as the economy shrank at a 1.5% annualized rate in the first quarter ...", "link": "https://www.dailywire.com/news/biden-says-his-spending-agenda-took-america-from-an-economic-crisis-to-an-economic-recovery", "date_published": "2022-09-01 13:38:38+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘All Of NY A Gun Free Zone’: Controversial Anti-Gun Legislation Takes Effect In New York", "description": "Democrat New York Governor Kathy Hochul is championing the Concealed Carry Improvement Act (CCIA), which critics say is burdensome and an infringement on numerous constitutional rights. Following a Supreme Court decision in June striking down New York&#8217;s concealed carry restrictions as unconstitutional, state Democrats and Hochul moved to crack down further on gun rights, seemingly ...", "link": "https://www.dailywire.com/news/all-of-ny-a-gun-free-zone-controversial-anti-gun-legislation-takes-effect-in-new-york", "date_published": "2022-09-01 13:24:34+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "GOP Reps Demand Biden’s Sec Def Revoke Vaccine Mandate For National Guard", "description": "House Republicans, angry that tens of thousands of National Guardsmen have reputedly been kept inactive because they have not complied with the Pentagon’s vaccine mandate, fired off a letter to Defense Secretary Lloyd Austin demanding he repeal the mandate. Rep. Michael Waltz (R-FL), the first Green Beret elected to Congress, wrote the letter, which was ...", "link": "https://www.dailywire.com/news/gop-reps-demand-bidens-sec-def-revoke-vaccine-mandate-for-national-guard", "date_published": "2022-09-01 13:13:30+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Man Stung By 20,000 Killer Bees Awakens From Coma", "description": "An Ohio man who landed in a coma after being stung by thousands of killer bees when he accidentally sawed their hive in half has awakened, according to a report. Austin Bellamy, 20, of Ripley, nearly died after getting stung up to 20,000 times Friday. He was put on a ventilator and into a medically ...", "link": "https://www.dailywire.com/news/man-stung-by-20000-killer-bees-awakens-from-coma", "date_published": "2022-09-01 12:51:17+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Kansas Teacher Receives $95K Settlement After Suspension For Refusing To Use Student’s Preferred Pronouns", "description": "A Kansas teacher suspended for refusing to use a student&#8217;s preferred pronouns and who said she was forced to hide the student&#8217;s social transition from their parents has been awarded $95,000 in a settlement, according to her legal representatives. Alliance Defending Freedom (ADF) shared the news regarding the agreement, declaring it a victory for free ...", "link": "https://www.dailywire.com/news/kansas-teacher-receives-95k-settlement-after-suspension-for-refusing-to-use-students-preferred-pronouns", "date_published": "2022-09-01 12:28:17+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Four Found Dead On North Dakota Farm In Apparent Murder-Suicide", "description": "Tragedy and mystery surround the grisly discovery of four bodies in a wheat field in North Dakota, which police have described as a “murder-suicide.” On August 29, Towner County Sheriff’s Office (TCSO) deputies were called out to a farm just outside Cando, North Dakota, on a report that four people had been found unresponsive. Police ...", "link": "https://www.dailywire.com/news/four-found-dead-on-north-dakota-farm-in-apparent-murder-suicide", "date_published": "2022-09-01 12:05:28+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "California’s Never-Ending War On The Working Class", "description": "California’s new utopian dream of banning new, gas-powered cars is symptomatic of a brand of progressive politics that is good for messianic rhetoric but dreadful for the lives and pocketbooks of everyday citizens. Progressives are oratorically concerned about income inequality, yet they aggressively implement policies whose consequences make it far worse.  Last week, the state ...", "link": "https://www.dailywire.com/news/californias-never-ending-war-on-the-working-class", "date_published": "2022-09-01 11:51:17+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Poland Demands Reparations From Germany On Anniversary Of Nazi Invasion", "description": "Poland officially demanded $1.3 trillion in reparations from Germany on Thursday over the nation’s role in World War II. The announcement from Law and Justice Party leader Jaroslaw Kaczynski occurred on the anniversary of Nazi forces’ September 1, 1939 invasion of Poland, which led the United Kingdom and France to declare war on Germany two ...", "link": "https://www.dailywire.com/news/poland-demands-reparations-from-germany-on-anniversary-of-nazi-invasion", "date_published": "2022-09-01 11:20:34+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Nation’s Report Card’ Indicates Worst Decline In Math And Reading Scores In Decades", "description": "Scores in math and reading declined at the worst level in decades for students during the pandemic, according to a new assessment. The National Assessment of Educational Progress (NAEP), also referred to as the “Nation’s Report Card,&#8221; released the report on tests administered to nine-year-old students nationwide this week. &#8220;Average scores for age 9 students ...", "link": "https://www.dailywire.com/news/nations-report-card-indicates-worst-decline-in-math-and-reading-scores-in-decades", "date_published": "2022-09-01 11:19:30+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "NASA Strikes $1.4 Billion Deal With Elon Musk’s SpaceX For Five More Missions", "description": "NASA has agreed to a $1.4 billion deal with Elon Musk&#8217;s SpaceX for five additional astronaut missions to the International Space Station (ISS). The newly extended agreement will add to past expeditions by SpaceX. &#8220;NASA has awarded five additional missions to Space Exploration Technologies Corporation (SpaceX) of Hawthorne, California, for crew transportation services to the ...", "link": "https://www.dailywire.com/news/nasa-strikes-1-4-billion-deal-with-elon-musks-spacex-for-five-more-missions", "date_published": "2022-09-01 11:05:21+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Kate Moss Defends Hugh Hefner, Says Playboy Mansion Had ‘Family Vibes’ And Wasn’t ‘Seedy Or Gross’", "description": "Even as multiple women accuse the late Playboy founder Hugh Hefner of sexual depravity, at least one person is coming to his defense. Kate Moss claims she saw no examples of bad behavior during her visit to Hefner’s famous Southern California mansion. The 48-year-old supermodel made her assertions during a recent interview with British Vogue.  ...", "link": "https://www.dailywire.com/news/kate-moss-defends-hugh-hefner-says-playboy-mansion-had-family-vibes-and-wasnt-seedy-or-gross", "date_published": "2022-09-01 10:58:40+00:00", "persistent": false, "user": null, "language": null}]