[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "UK confusing vaccination guidelines", "description": "Green book, JCVI advises that breastfeeding women should be offered any suitable COVID-19 vaccine.\n\nhttps://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1098808/Greenbook-chapter-14A-17August2022.pdf\n\n\n(Updated, 17th August, 2022)\n\nSummary of the Public Assessment Report. For covid-19 vaccine, Pfizer/BioNTec\n\nhttps://www.gov.uk/government/publications/regulatory-approval-of-pfizer-biontech-vaccine-for-covid-19/summary-public-assessment-report-for-pfizerbiontech-covid-19-vaccine\n\nWomen who are breastfeeding should also not be vaccinated. \n\n(Updated, 16th August, 2022)\n\n\n\nSummary of the Public Assessment Report\n\nAuthorisation for Temporary Supply, COVID-19 mRNA Vaccine BNT162b2 (BNT162b2 RNA) concentrate for solution for injection\n\nDepartment of Health and Social Care (DHSC), Pfizer Limited & BioNTech Manufacturing, GmbH\n\nhttps://www.gov.uk/government/publications/regulatory-approval-of-pfizer-biontech-vaccine-for-covid-19/summary-public-assessment-report-for-pfizerbiontech-covid-19-vaccine\n\nUpdated, 16th August, 2022\n\nReproductive and developmental toxicity\n\nFertility and early embryonic development and embryofoetal development\n\nA combined fertility and developmental study (including teratogenicity and postnatal investigations) in rats is ongoing.\n\nPrenatal and postnatal development, including maternal function\n\nNo such studies have been done.\n\nStudies in which the offspring (juvenile animals) are dosed and/or further evaluated\n\nNo such studies have been done.\n\nLocal tolerance\n\nNo such studies have been done. \n\nThe assessments made as part of the general toxicity study should suffice and a separate study is not needed.\n\nOther toxicity studies\n\nNo such studies have been done.\n\nToxicity conclusions\n\nThe absence of reproductive toxicity data is a reflection of the speed of development to first identify and select COVID-19 mRNA Vaccine BNT162b2 for clinical testing and its rapid development to meet the ongoing urgent health need. \n\nIn principle, a decision on licensing a vaccine could be taken in these circumstances without data from reproductive toxicity studies animals, \n\nbut there are studies ongoing and these will be provided when available. \n\nIn the context of supply under Regulation 174, \n\nit is considered that sufficient reassurance of safe use of the vaccine in pregnant women cannot be provided at the present time: \n\nhowever, use in women of childbearing potential could be supported,\n\nprovided healthcare professionals are advised to rule out known or suspected pregnancy prior to vaccination. \n\nWomen who are breastfeeding should also not be vaccinated. \n\nGreen book, updated 17th August 2022\n\nSpecific population groups \n\nhttps://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1098808/Greenbook-chapter-14A-17August2022.pdf\n\nPregnancy \n\nThere is no known risk associated with giving inactivated, recombinant viral or bacterial vaccines or toxoids during pregnancy or whilst breastfeeding (Kroger et al, 2013). \n\nDevelopmental and reproductivity testing of the Pfizer BioNTech, Moderna and AstraZeneca vaccines in animals have not raised any concerns. \n\nJCVI has therefore advised that women who are pregnant should be recommended to receive primary immunisation, \n\nand that pregnancy is considered a clinical risk group for the autumn booster programme. \n\nRoutine questioning about last menstrual period and/or pregnancy testing is not required before offering the vaccine. \n\nSurveillance of the inadvertent administration of COVID-19 vaccines in early pregnancy is being conducted for the UK by the UK Health Security Agency Immunisation and Vaccine Preventable Diseases Division, to whom such cases should be reported.1 \n\nThis surveillance is being undertaken to document safety in women who unknowingly receive a vaccine in early pregnancy\n\nBreastfeeding \n\nThere is no known risk associated with being given a non-live vaccine whilst breastfeeding. \n\nJCVI advises that breastfeeding women should be offered any suitable COVID-19 vaccine.", "link": "https://www.youtube.com/watch?v=7gLIay852jM", "date_published": "2022-09-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Natural immunity in Portugal", "description": "Rise of natural acquired immunity\n\nGet additional scientific background from John’s free text books,\n\nhttp://159.69.48.3/\n\n(you will need to cut and paste this link into your browser)\n\nRisk of BA.5 Infection among Persons Exposed to Previous SARS-CoV-2 Variants\n\nhttps://www.nejm.org/doi/full/10.1056/NEJMc2209479?query=TOC&cid=NEJM%20eToc,%20September%201,%202022%20DM1402792_NEJM_Non_Subscriber&bid=1141953912\n\nhttps://www.nejm.org/doi/suppl/10.1056/NEJMc2209479/suppl_file/nejmc2209479_appendix.pdf\n\nOmicron subvariants, BA.1 and BA.2, displaced by BA.5 in many countries\n\nGreater transmissibility\n\nPartial evasion of BA.1- and BA.2-induced immunity\n\nPortugal, one of the first countries affected by a BA.5 predominance\n\nN = 9,307,996\n\nAll Portuguese residents aged 12 years and older, (National Census 2021) \n\nUninfected people in June 1st 2022 was 5, 328, 287, (57% of the Portuguese population over 12)\n \n(PCR tests and rapid antigen tests to diagnose cases) \n\nPresence of undocumented infections among the “uninfected” group of individuals \n\n29.2% of infections were not notified\n\n(based on the seroprevalence of SARS-CoV-2 anti-N IgG in the population) \n\nNational coronavirus disease 2019 registry (SINAVE)\n\n(all reported cases in the country, regardless of clinical presentation)\n\nTo calculate the risk of BA.5 infection after documented infection with past variants, \n\nincluding BA.1 and BA.2\n\nTimes when different variants represented more than 90% of the isolates\n\nTo calculate their infection risk during the period of BA.5 dominance\n\nPooled BA.1 and BA.2 (slow transition between the two subvariants)\n\nComparator group\n\nPopulation that did not have any documented infection before BA.5 dominance (June 1, 2022)\n\nResults\n\nWuhan-Hu-1  55.7%\n\nAlpha   58.8%\n\nDelta   64.5%\n\nBA.1 / BA.2 7 6.8%\n\nWe found that previous SARS-CoV-2 infection had a protective effect against BA.5 infection\n\nProtection was maximal for previous infection with BA.1 or BA.2 (not suprising)\n\nContext\n\nPortugal more than 98% of the study population completed the primary vaccination series before 2022\n\nThere is a perception that the protection afforded by previous BA.1 or BA.2 infection is very low, given the high number of BA.5 infections among persons with previous BA.1 or BA.2 infection. \n\nOur data indicate that this perception is probably a consequence of the larger pool of persons with BA.1 or BA.2 infection than with infection by other subvariants, and it is not supported by the data.\n\nBreakthrough infections with the BA.5 subvariant were less likely among persons with a previous SARS-CoV-2 infection history … especially for previous BA.1 or BA.2 infection, than among uninfected persons.", "link": "https://www.youtube.com/watch?v=SN7cX_linEA", "date_published": "2022-09-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]