[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Juilliard Jazz Ensemble: Tiny Desk Concert", "description": "Nikki Birch | Sept. 2, 2022\nJazz may not be the first thing that comes to mind when you think of The Juilliard School, but perhaps this series of Tiny Desks will change that. Tiny Desk and Jazz Night in America celebrate the 20th anniversary of Juilliard Jazz with three Tiny Desk concerts featuring performances by current students and alumni of the prestigious institution.\n\nWhen the starry-eyed students of the Juilliard Jazz Ensemble first saw the Tiny Desk, they stopped short, exuding awe and wonderment. After all, several of their favorite artists had performed in this very space — and now here they were, ready to prove themselves and carry on the legacy of both the Tiny Desk and jazz.\n\nThe Juilliard Jazz Ensemble performed at the Tiny Desk in celebration of the jazz studies program's 20th anniversary. Made up of current students, the ensemble embodies the spirit of community and collaboration that is an essential part of the students' learning experience.\n\nThe ensemble opens with \"June\" a hypnotic composition by alto saxophonist Coby Petricone-Berg. We understand immediately despite the members' relative youth, this ensemble is not to be trifled with. A shout-out to the rhythm section is absolutely necessary, as drummer John Sturino, bassist Nico Martinez and pianist Esteban Castro lay back in the cut while ensuring the path ahead for the horns, with Jasim Perales giving us soulful trombone, is smooth like whipped shea butter. This is grade-A musicianship — everyone listening and unselfishly supporting each other.\n\nFor the final selection, Ekep Nkwelle presents her arrangement of Geri Allen's \"Timeless Portraits and Dreams.\" Her voice soars in this contemplative ballad, a perfect closer that allows each member of the ensemble to shine as they share the hope that, \"In tomorrow's world, let joy and love run free / Let's hold on to our dreams.\"\n\nSET LIST\n\"June\" (Coby Petricone-Berg)\n\"Timeless Portraits and Dreams\" (Geri Allen, arr. Ekep Nkwelle)\n\nMUSICIANS\nEkep Nkwelle: vocals\nCoby Petricone-Berg: alto saxophone\nJasim Perales: trombone\nEsteban Castro: piano\nNico Martinez: bass\nJohn Sturino: drums\n\nTINY DESK TEAM\nProducer: Nikki Birch\nAudio Engineer: Josh Rogosin \nDirector: Kara Frame \nCreative Director: Bob Boilen\nSeries Producer: Bobby Carter\nEditor: Michael Zamora\nVideographers: Kara Frame, Pierre Kattar, Michael Zamora\nAudio Assistant: Jospehine Nyounai \nProduction Assistants: Jill Britton, Joby Tanseco, Alanté Serene\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#TinyDesk #NPRMusic #JuilliardJazz", "link": "https://www.youtube.com/watch?v=McpF_s2wXcY", "date_published": "2022-09-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "SIX The Musical: Tiny Desk Concert", "description": "Josh Rogosin | Sept. 1, 2022\nAs soon as the Queens saw the Tiny Desk, their excitement was palpable. After the initial flurry of selfies were snapped, the actors and band completely owned the room — enrapturing the audience of NPR staffers assembled.\n\nSIX The Musical imagines the six wives of Henry VIII reuniting on stage as real-life popstars. Their \"queenspirations\" include Beyoncé (for Catherine of Aragon, as played by Khaila Wilcoxon), Miley Cyrus (Anne Boleyn played by Storm Lever), Adele (Jane Seymour played by Jasmine Forsberg), Lizzo (Anna of Cleves played by Olivia Donalson), Britney Spears (Katherine Howard played by Didi Romero) and Celine Dion (Catherine Parr played by Gabriela Carrillo).\n\nSIX premiered in 2017 at the famed Edinburgh Fringe Festival and was written by Toby Marlow and Lucy Moss while students at the University of Cambridge. Since then, the show has become a global sensation — with six productions running concurrently. It won this year's Tony Awards for best original score and best costume design of a musical.\n\nOpening night on Broadway was set for March 12, 2020. Just 90 minutes before curtain, New York theaters were ordered to close due to the pandemic. As the resident theater geek on the team, I pitched SIX for a Tiny Desk (home) concert once the show finally opened in the fall of 2021. Then it was announced that the musical would be at The National Theatre just a few miles from NPR HQ. Luckily, we were all finally back at Bob's diminutive desk recording bands, ready to welcome them. The rest, as they say, is herstory.\n\nSET LIST\n\"Ex-Wives (Reprise)\" \n\"Heart of Stone\"\n\"Get Down\"\n\"Six\"\n\nMUSICIANS\nKhaila Wilcoxon: vocals, as Catherine of Aragon\nStorm Lever: vocals, as Anne Boleyn\nJasmine Forsberg: vocals, as Jane Seymour\nOlivia Donalson: vocals, as Anna of Cleves\nDidi Romero: vocals, as Katherine Howard\nGabriela Carrillo: vocals, as Catherine Parr\nJo Ann Daugherty: conductor, keyboard\nValerie Maze: melodica, percussion\nJanetta Goines: bass\nRose Laguaña: electric, acoustic guitar\nPaige Durr: drums\n\nTINY DESK TEAM\nProducer/Audio Engineer: Josh Rogosin\nDirector: Kara Frame \nSeries Creator: Bob Boilen\nSeries Producer: Bobby Carter \nEditor: Michael Zamora \nVideographers: Kara Frame, Michael Zamora, Pierre Kattar, Joshua Bryant\nProduction Assistants: Jill Britton, Alanté Serene, Joby Tanseco\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=vkzlU2fDLs8", "date_published": "2022-09-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]