[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Things You Didn't Know About The Last Of Us", "description": "The Last of Us is a series that revels in creating tiny “ah-ha'' moments throughout its journey. If you didn’t get a chance to experience these fun homages and legendary tales, here’s 10 things you didn’t know about The Last of Us.\n\nWarning these can be pretty spoiler heavy, so proceed with caution.\n#gaming #thelastofus #gamespot #naughtydog \n\nStu here to spot the references and hidden details throughout the world of The Last of Us. Although known for crafting some of the most immersive worlds through their storytelling and stunning (as well as horrifying) visuals; Naughty Dog has spared no expense when it comes to their secrets. Spanning both games, Naughty Dog has sneakily hidden a ton of in-references, along with other fun connections to the greater world outside of Joel and Ellie's zombie stricken landscape. These secrets don’t necessarily jump out at you to take you away from the moment to moment action, but rather they fill in the gaps and make the world immensely rich and layered experience. From Hotline Miami to AC/DC to legends of the outbreak, stick around to see how deep these secrets go. \n\n00:00 Intro\n00:24 Music To My Ears\n03:21 Get Your Eyes Checked, Kid\n03:38 Well Read\n04:46 The Naughty Dog - Verse\n06:19 Don't Stop Me Now\n06:33 Not Today Capitalism\n06:55 The Legend Of Ish\n08:29 Movie Magic\n09:39 The 0451 Code\n10:13 The Last of Us: Vice\n10:33 Outro", "link": "https://www.youtube.com/watch?v=2Cp99e07mPo", "date_published": "2022-09-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 Reveal Planned Amid Expansion Rumors | GameSpot News", "description": "In this episode of GameSpot News, DeVante refreshes your memory on the Cyberpunk 2077 expansion rumors before the future of the game is officially revealed next week.\n#GamingNews #Cyberpunk2077 #GamePass \n\nCD Projekt Red says that it will reveal \"what's next\" for Cyberpunk 2077 in a livestream next week. Alongside its game, the company will also share some new information on the Cyberpunk Edgerunners series coming to Netflix soon that had a very NSFW trailer recently. \n\nThis new Night City episode will be streamed at 8 AM PT / 11 AM ET on September 6, but while we wait for that, let’s go over the story details for the upcoming expansion that appeared to have leaked online back in May 2022. \n\nAccording to VGC, which saw the leaked files and first reported on them, hundreds of lines of dialogue spelling out most of the events and characters of the expansion have appeared online. The dialogue points to a character named Songbird, who was datamined in Cyberpunk 2077, being the focus of the DLC. The expansion will reportedly take players to the Combat Zone and Sports Dome, which were both previously inaccessible spots across Cyberpunk 2077's setting Night City.\n\nWhile the side missions seem to mostly contain placeholder text, enough of the dialogue throughout shows that Johnny Silverhand, an AI of a rockstar played by Keanu Reeves, may have a more diminished presence in the expansion, though it's unknown exactly why that may be the case. That may come as a disappointment and shocker to many fans of Cyberpunk 2077, since Reeves' involvement was a major selling point for the game and a significant part of the title's marketing efforts once it re-emerged in 2019.\n\nSTAMPS\n00:00 - Intro\n00:09 - Cyberpunk 2077\n01:53 - Xbox Game Pass", "link": "https://www.youtube.com/watch?v=URLcYgZgynE", "date_published": "2022-09-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "GameSpot Swipe Mobile Showcase - What to Expect", "description": "Tune in for Swipe, GameSpot’s first ever mobile games showcase. Coming this September 8 at 10am PT, we'll be hosting a livestreamed event that puts the spotlight on the latest and greatest games for iOS and Android devices. We'll learn more about titles from Activision, EA, Ubisoft, Apple Arcade, Netflix, and much more. GameSpot Swipe will be broadcast on GameSpot, YouTube, and Twitch.\n\n#swipe #gamespot #gaming", "link": "https://www.youtube.com/watch?v=kwM7IEeiyz8", "date_published": "2022-09-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Gearbox PAX West 2022 Panel Livestream", "description": "Tune in for Gearbox Entertainment's PAX West 2022 Showcase, live from the main theater!\r\n\r\n#paxwest #gearbox #borderlands", "link": "https://www.youtube.com/watch?v=c7CCYrL3aZk", "date_published": "2022-09-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Hogwarts Legacy Touring The Common Rooms Gameplay (Gryffindor, Ravenclaw, Hufflepuff, Slytherin)", "description": "Get a quick tour of all 4 houses in Hogwarts Legacy. \n\nEnjoy a return to the familiar Gryffindor common room, nested inside one of the tallest towers at Hogwarts.\n\nHere’s a new look at the Ravenclaw common room, a brightly lit haven for knowledge and creativity.\n\nThe Hufflepuff Common Room, where cozy natural sunlight and an array of plants await.\n\nTake a tour of the Slytherin common room, located deep within the dungeons of Hogwarts Castle.\n\nTimestamps:\n0:00 Intro\n0:02 Gryffindor Common Room\n1:13 Ravenclaw Common Room\n2:22 Hufflepuff Common Room\n3:33 Slytherin Common Room", "link": "https://www.youtube.com/watch?v=dngETLI-888", "date_published": "2022-09-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "I Heart Dark Souls Extended", "description": "An extended episode of I Heart Dark Souls!\n#darksouls #gaming #iheartgaming #gamespot \n\nWhile Dark Souls isn't the first game in FromSoftware's now massively successful Soulsborne series, it was one of the most influential, spawning an entire genre of games influenced by its mechanics dubbed Souls-likes. Dark Souls has also gained passionate fans all around the globe. This is the story of Dark Souls, as told by those fans.\n\nJoin Adam Mason, Brad Ellis of Easy Allies, Caddicarus, Chris Morris, Dave Jewitt, DaveControl, Gav Murphy and Rory Powers of RKG, Super BunnyHop, HeyZeusHeresToast, Iron Pineapple, Jessie Gender, LobosJR, Lucy James and Tamoor Hussain of Giant Bomb, Marz, Otzdarva, Prod, Quelaag, and Sinclair and Sophie of SinclairLore as they tell the story of Dark Souls, and discuss the impact it had on both them and gaming.\n\nThe story of Dark Souls is told through though simple moments like finding shortcuts back to a bonfire in Undead Burg or Firelink Shrine, to the stunning moment when players first reach Anor Londo, to one of Dark Souls steepest challenges in the fight with Ornstein & Smough. The low moments like getting cursed in The Depths, to traversing the treacherous terrain of Blighttown are highlighted, all while leading to that rewarding feeling of overcoming an obstacle that at first felt insurmountable.\n\nLobosJR sings one of his favorite tracks of the game with the Asylum Demon fight, while Marz, Super Bunnyhop, and Sophie sing the famous \"pling pling plong\" of Gwyn's theme. Meanwhile, some curse every moment they spent in PvP, while others share their favorite moments of low-level PvP runs with evil glee.\n\nEnjoy an extended episode of I ❤️ Gaming with I ❤️ Dark Souls, and please consider watching our other episodes on Skyrim, Final Fantasy VII, Metal Gear Solid, Resident Evil 4, and Red Dead Redemption 2!", "link": "https://www.youtube.com/watch?v=y1sPUkYrj00", "date_published": "2022-09-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Tales from the Borderlands Official 18 Minute Gameplay Demo", "description": "Check out an extended gameplay look at the New Tales from the Borderlands that was showcased during Gearbox's Pax West showcase. \n\nIn this reveal, our three lovable losers must travel through the sewers of Promethea, racing against Tediore to open a dormant Vault. As they figure out a way past the Tediore guards, they must also battle for honor and glory in a Vaultlanders duel, with QTEs deciding the winner of glorious plastic combat!\n\n#borderlands #gearbox #gaming", "link": "https://www.youtube.com/watch?v=13tRse1fnG0", "date_published": "2022-09-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Tales from the Borderlands Official Character Trailer", "description": "In the New Tales from the Borderlands three nobodies band together to change their circumstances. \n \nWithin the perpetually war-torn metropolis of Promethea, you'll control Anu, Octavio, and Fran on the worst day of their lives.\n \nFran Miscowicz: A hard-working woman running her family's Frogurt shop, Fran answers to no one. Attacked out of spite during the Maliwan invasion, Fran's trying to put the pieces back together but life has other plans for her. \n \nOctavio Wallace-Dhar: As Meridian City's most popular citizen - at least in his own mind - Octavio is looking to be a Somebody. His big break is on the way and then comes the big payday!\n \nDr. Anuradha Dhar: The socially awkward genius who stumbles into an invention that could change the fabric of society itself. Anu dreams of a world where no one has to kill to get ahead.\n \n#borderlands #gaming", "link": "https://www.youtube.com/watch?v=h9mcEox6070", "date_published": "2022-09-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sonic Frontiers Official Overview Trailer", "description": "Get an overview of Sonic Frontiers in this latest trailer.\n\nWelcome to the Starfall Islands, a playground of speed with diverse platforming challenges, fearsome mechanized enemies, and ancient secrets to uncover. In search of his captured friends, Sonic must accelerate to new heights, unlock Cyber Space portals, unleash newly upgraded abilities, and explore this untamed land on his path to solving the mysteries of the Starfall Islands.\n\n#sonicfrontiers #sonic #gaming", "link": "https://www.youtube.com/watch?v=w8CeYK67vIw", "date_published": "2022-09-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Assassin’s Creed Mirage Confirmed - Trailer At Ubisoft Forward? | GameSpot News", "description": "Assassin’s Creed Mirage has been confirmed, Zelda remake rumors have surfaced again and a Halo Infinite’s couch co-op has been canceled.\n#GamingNews #AssassinsCreed #HaloInfinite \n\nFollowing a handful of leaks, Ubisoft has officially announced the next game in the Assassin’s Creed series:Mirage. Unfortunately, that confirmation is all we’re getting today and the company has said more details will be shared during the September 10th Ubisoft Forward. For the time being we can look to the leaked information for a decent picture of what to expect. \n\nMirage will reportedly star Basim, a character from Assassin's Creed Valhalla, in his youth, leading up to when he arrived at the Hidden Ones. The game will do away with dialogue choices and the ability to select a gender. The game will reportedly take place in Baghdad in late '800s and will also be a \"return to basics\" for the series with no leveling.This back-to-basics approach is inspired by 2007’s original Assassin's Creed; a game that Ubisoft is allegedly working on a remake for. This alleged remake will be part of Mirage's season pass, and there will also be Constantinople DLC. According to reports, Mirage will launch in Spring 2023. \n\nAnd if you’re a Nintendo fan then you’ll want to pay attention to the week of September 12. A source told Jeff Grubb of our sister site Giant Bomb that the next Nintendo Direct may be held in that week. Grubb discussed the possibilities with Mike Minotti of GamesBeat and Mike said the rumored event will include the announcement of Wind Waker and Twilight Princess ports for Nintendo Switch. Both games were already updated on Wii U, but they haven't been re-released on Switch yet. Whether or not this is a general Nintendo Direct that includes details on franchises outside of Zelda remains to be seen. Grubb went on to say that a Metroid Prime remaster is also in the works and could be announced at an upcoming Nintendo Direct.\n\nSTAMPS\n00:00 - Intro\n00:08 - Assassin’s Creed Mirage\n01:33 - September Nintendo Direct\n02:29 - Halo Infinite", "link": "https://www.youtube.com/watch?v=DRhlfTTUabI", "date_published": "2022-09-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Flintlock: The Siege of Dawn Mashes Up Sekiro And God of War Combat", "description": "Sekiro meets God of War in A44's Flintlock: The Siege of Dawn, the developer's follow up to their previous game, Ashen.\n#gaming #flintlock #gamespot\n\nMechanically, Flintlock's combat sort of looks like how you fight in Sekiro: Shadows Die Twice, with an armor system that works in a similar manner to Sekiro's posture.\n\nIn Flintlock, enemies have two different meters that you have to worry about while in combat. The red bar is an enemy's health, while the yellow bar above that is their armor. The yellow bar fills as you damage an enemy's armor while the red bar empties as you damage the enemy themselves.\n\nAttacks deal damage, while both attacks and parries chip away at an enemy's armor. When the armor bar is filled, protagonist Nor is able to land a devastating execution attack against her foe. In most cases against normal enemies, it looks like these executions kill her targets outright. \n\nHowever, stronger enemies and bosses can seemingly withstand multiple versions of these attacks. They're still worth doing though, because when it comes to these more powerful targets, Nor can use this execution attack to rip away an enemy's literal armor, like a shield or breastplate, that makes them more vulnerable to your attacks.\n\nIn Flintlock, an enemy's armor meter begins to deplete if you back off, encouraging you to be aggressive in combat and rely on parries and dodges instead of blocks. In combat, you can combat Nor's companion, Enki, to stun enemies and stop their armor meter from depleting, but it looks like you can only do this to one enemy at a time.\n\nNor has armor too. Powerful attacks, like unblockable attacks that are symbolized by a red aura, can cut into that armor and damage it. Once it's broken, Nor takes increased damage from enemy attacks. Thankfully, there's a way to replenish Nor's armor, which leads us into our next point.", "link": "https://www.youtube.com/watch?v=tDzWHqDFZPc", "date_published": "2022-09-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Scarlet & Pokémon Violet | Introducing Grafaiai Trailer", "description": "Let’s meet a newly-discovered Pokémon: Grafaiai. This Toxic Monkey Pokémon uses its poisonous saliva – which changes color depending on what the Pokémon eats – to attack foes by spitting at them.\n\nGrafaiai is a moody Pokémon with a fastidious disposition. It doesn’t form packs, preferring to roam alone, and it is constantly caught up in territorial struggles with other Pokémon. Grafaiai specializes in using its poisonous saliva—which changes color depending on what the Pokémon eats—to attack foes by spitting at them or by slashing at them after coating its claws with the saliva.\n \nGrafaiai is nocturnal and once the sun sets it licks its hands and fingers to cover them in poison and uses them to draw patterns on the trees in its territory. The poisonous saliva it uses to paint paralyzes Bug Pokémon, which are drawn to the saliva’s sweet, fragrant scent.\n\n#PokemonScarletViolet #NintendoSwitch", "link": "https://www.youtube.com/watch?v=tBvl3ql_ZGQ", "date_published": "2022-09-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Last Of Us PS5 - Is It Worth It?", "description": "The Last of Us is an excellent game, but is the $70 dollar remake worth you time and money? Jake Dekker breaks down out all the new additions and shares his thoughts on Naughty Dog's controversial remake.\n\nIn this video Jake breaks down everything from the improved visuals to the new extra features. There's a lot here, but if you've already played The Last of Us, and the story didn't do much for you, then maybe you should wait.\n\nFans will really appreciate all the new improvements though. The sound design in particular is really great. The clickers are more terrifying, the gunshots ring in your ears, and the combat sounds more impactful.\n\nThe Last of Us Part I comes to PlayStation 5 on September 2nd. If you want to check out raw 4K gameplay of the opening scene, stop by our YouTube channel and let us know what you think.", "link": "https://www.youtube.com/watch?v=Yr0eBFpx5qM", "date_published": "2022-09-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Last Of Us PS5 vs PS3", "description": "In this video we take a look at the graphical differences between The Last of Us on PS3 versus The Last of Us Part I remake on PS5.\n\n#thelastofus #gaming #playstation", "link": "https://www.youtube.com/watch?v=7mzeDC6RDr0", "date_published": "2022-09-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]