[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "El DeBarge: Tiny Desk (Home) Concert", "description": "NPR Music's Tiny Desk series will celebrate Black History Month with Tiny Desk (home) concerts featuring legends in the world of R&B, jazz, gospel, and hip hop. Each artist in this legacy lineup has helped to define Black music as we know it and will be performing a Tiny Desk concert for the first time.\n\nBobby Carter | February 4, 2022\nAround this time last year, singer-songwriter and R&B royalty El DeBarge took to Instagram to take some requests and play a few hits. \"I'd never done anything like that before, and the nerves were showing,\" he told me. That 23-minute live performance ignited a comeback of sorts, and the greats of today, many of whom he's influenced, wanted to be near him. That video reminded us of his greatness, and stars like Alicia Keys, Fat Joe, and Questlove helped make 2021 a busy year for the torchbearer of the DeBarge moniker. For his Tiny Desk (home) concert, he didn't want to veer far away from what he did on IG, and I quickly concurred. He got together with guitarist, Bennett Walker to play this intimate set of DeBarge classics.\n\nIn terms of sheer talent alone, the DeBarge family was arguably on par with the Jacksons at one point. That talent propelled them to the stars in the 1970s and '80s, cranking out hit records and cookout classics. Switch, featuring siblings Bobby and Tommy DeBarge, came first. A couple of years later, the group DeBarge arrived, consisting of siblings James, Bunny, Mark, Randy, and El. Their five albums and El's solo work were a massive part of Motown's success and helped sustain the label in the '80s.\n\nDespite the well-documented odds he's faced over the years, this set feels like a triumph. His voice has aged with grace, and that signature falsetto we've all attempted while singing these songs is perfection here. From his cozy home studio, the Michigan native breezes through a few of his R&B standards, including \"All This Love,\" \"Time Will Reveal,\" \"Love Me In A Special Way,\" and in honor of Black History Month, he reworks \"A Dream\" as a dedication to the Rev. Dr. Martin Luther King Jr.\n\nSET LIST\nAll This Love\nTime Will Reveal\nA Dream (Dedication to Dr. Martin Luther King Jr.)\nLove Me In A Special Way\n\nMUSICIANS\nEl DeBarge: vocals, keys\nBennett Walker: guitar\n\nCREDITS\nVideo: Stephen Clay and Declan Osborne\nAudio: Bennett Walker\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Joshua Bryant\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Kara Frame, Maia Stern, Sofie Hernandez-Simeonidis, Ashley Pointer\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#eldebarge #nprmusic #tinydesk #bhmxnprmusic", "link": "https://www.youtube.com/watch?v=M9UMzNFJxhY", "date_published": "2022-02-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "NPR Music Listening Party: Saba, 'Few Good Things'", "description": "Join an online listening party for Saba’s 'Few Good Things.' Rodney Carmichael, host for Louder Than A Riot, will be joined by Saba alongside producers Daoud and daedaePIVOT.\n\nIt’s been a few years since Saba’s 'Care for Me,' which made NPR Music’s 50 Best Albums of 2018, but the Chicago rapper has been busy with Pivot Gang and J. Cole’s Dreamville compilations. Saba calls 'Few Good Things' “the realization of self after a search for exterior fulfillment.” Featuring Mereba, Black Thought, G Herbo, Smino and others, it's a lush-yet-bangin’ album about finding your fullness in a world of empty.\n\nRSVP for future Listening Party events https://listeningparty.nprpresents.org/ \n\nWatch Saba's Tiny Desk concert https://www.youtube.com/watch?v=LTzmjU8aOR4", "link": "https://www.youtube.com/watch?v=Xg-vPVOyceM", "date_published": "2022-02-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]