[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends Judgment Trailer - Stories from the Outlands", "description": "It’s time for Mad Maggie to face justice for her crimes. But when you can’t be innocent and you won’t be guilty, what fate lies in store?\n\nApex Legends™ is a free-to-play hero shooter game where legendary characters battle for glory, fame, and fortune on the fringes of the Frontier. Play for free now on PlayStation 4, PlayStation 5, Xbox One, Xbox Series X|S, Nintendo Switch, and PC via Origin and Steam.\n\n#ApexLegendsDefiance  #ApexDefiance #ApexLegends", "link": "https://www.youtube.com/watch?v=QP_N4dRt3EM", "date_published": "2022-01-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "ELDEN RING – Taipei Game Show 2022 Full Presentation (Japanese)", "description": "Check out the full presentation from the Taipei Game Show 2022 on Elden Ring! This Elden Ring presentation is in Japanese and has some Q&A + breakdowns covering George RR Martin, level design, and PS5 specific features.", "link": "https://www.youtube.com/watch?v=1zRWNVmdBi0", "date_published": "2022-01-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Legends: Arceus - Official Gameplay Overview Trailer", "description": "Explore the Sinnoh region of old in Pokémon Legends: Arceus! As a member of the Galaxy Expedition Team, you can study Pokémon to complete the Hisui region’s first Pokédex. Find newly discovered Pokémon, embark on survey missions, explore natural expanses, and uncover the mystery surrounding the Mythical Pokémon, Arceus.\n\n#PokemonLegendsArceus #NintendoSwitch", "link": "https://www.youtube.com/watch?v=r4yMIFAAo7g", "date_published": "2022-01-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Desert Eagle: The Pop Culture Icon Nobody Uses - Loadout", "description": "A heavy duty hand cannon with an imposing title and a big bang to match, the Desert Eagle is one of the most famous handguns in history. It appears in hundreds of movies and games, from The Matrix to Call of Duty, Max Payne to Austin Powers, but despite its prominence in our favorite media, it is seldom seen in the real world. So how did a gun that sees almost no serious use get so much pop culture attention? \n\nIn this episode of Loadout, Dave Jewitt visits the Royal Armouries to talk to Keeper of Firearms & Artillery Jonathan Ferguson to find out why the Desert Eagle might not be the all-conquering weapon that games and movies would have you believe. \n\nYou can check out more episodes of Loadout right here. - https://www.youtube.com/watch?v=yzSrmGkpWKk&list=PLpg6WLs8kxGMzIemU1gyyLmg5VlKI2UvC\n\nYou can check out our Firearms Expert Reacts series here. - https://www.youtube.com/watch?v=5FVzcoRjoN4&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/", "link": "https://www.youtube.com/watch?v=6eqWe_wFcxE", "date_published": "2022-01-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]