[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Florida changes vaccine advice for young men", "description": "Florida, Guidance for mRNA COVID-19 Vaccines \n\nOctober 7, 2022 \n\nhttps://floridahealthcovid19.gov/wp-content/uploads/2022/10/20221007-guidance-mrna-covid19-vaccines-doc.pdf\n\nFlorida continues to emphasize that health care providers review all data to evaluate risks and benefits unique to each patient when determining any health care services to provide, \n\nincluding the administration of COVID-19 vaccines containing Messenger RNA (mRNA) which both the Pfizer- BioNTech and the Moderna vaccines utilize. \n\nThe Florida Department of Health (Department) conducted an analysis through a self-controlled case series, \n\nhttps://www.bmj.com/content/354/bmj.i4515\n\na technique originally developed to evaluate vaccine safety. \n\nThis studied mortality risk following mRNA COVID-19 vaccination. \n\nThis analysis found there is an 84% increase in the relative incidence of cardiac-related death among males 18-39 years old within 28 days following mRNA vaccination. \n\nIndividuals with preexisting cardiac conditions, such as myocarditis and pericarditis, \n\nshould take particular caution when considering vaccination and discuss with their health care provider. \n\nFlorida Department of Health has issued the following guidance: \n\nBased on currently available data, \n\npatients should be informed of the possible cardiac complications that can arise after receiving a mRNA COVID-19 vaccine. \n\nWith a high level of global immunity to COVID-19, \n\nthe benefit of vaccination is likely outweighed by this abnormally high risk of cardiac- related death among men in this age group. \n\nThe State Surgeon General now recommends against the COVID-19 mRNA vaccines for males ages 18-39 years old. \n\nMales over the age of 60 had a 10% increased risk of cardiac-related death within 28 days of mRNA vaccination. \n\nNon-mRNA vaccines were not found to have these increased risks among any population. \n\nFloridians are encouraged to discuss all the potential benefits and risks of receiving mRNA COVID-19 vaccines with their health care provider. \n\nThe risk associated with mRNA vaccination should be weighed against the risk associated with COVID-19 infection. \n\nThe Department continues to stand by its Guidance for Pediatric COVID-19 Vaccines \n\nhttp://ww11.doh.state.fl.us/comm/_partners/covid19_report_archive/press-release-assets/g2-jtr_QWBT4hJpqr_20220308-1923.pdf\n\n(issued March 2022), \n\nwhich recommends against use in healthy children and adolescents 5 years old to 17 years old. \n\nThis now includes recommendations against COVID-19 vaccination among infants and children under 5 years old, \n\nwhich has since been issued under Emergency Use Authorization. \n\nYT Guidelines\n\nCOVID-19 medical misinformation policy\n\nhttps://support.google.com/youtube/answer/9891785\n\nClaims about COVID-19 vaccinations that contradict expert consensus from local health authorities or the WHO\n\nhttps://support.google.com/youtube/answer/11161123\n\nVaccine safety: content alleging that vaccines cause chronic side effects, outside of rare side effects that are recognised by health authorities\n\nEfficacy of vaccines: content claiming that vaccines do not reduce transmission or contraction of disease \n\nIngredients in vaccines: content misrepresenting the substances contained in vaccines", "link": "https://www.youtube.com/watch?v=JRPkfGKI5ao", "date_published": "2022-10-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Vaccine RNA in breast milk", "description": "Detection of Messenger RNA COVID-19 Vaccines in Human Breast Milk\n\nhttps://jamanetwork.com/journals/jamapediatrics/fullarticle/2796427?guestAccessKey=1c13d17c-1c25-4828-b261-9f321e5126a1&utm_source=twitter&utm_medium=social_jamapeds&utm_term=7701881843&utm_campaign=article_alert&linkId=183092079\n\nJAMA Pediatrics\n\n(September 26, 2022)\n\nInitial messenger RNA (mRNA) vaccine clinical trials excluded several vulnerable groups, \n\nyoung children and lactating individuals\n\nCurrent FDA website, re children over 6 months\n\nhttps://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-authorizes-moderna-and-pfizer-biontech-covid-19-vaccines-children\n\nToday, the U.S. Food and Drug Administration authorized emergency use of the Moderna COVID-19 Vaccine,\n\nand the Pfizer-BioNTech COVID-19 Vaccine,\n\nfor the prevention of COVID-19 to include use in children down to 6 months of age. \nFrom the JAMA paper\n\nThe US Food and Drug Administration deferred the decision to authorize COVID-19 mRNA vaccines for infants younger than 6 months,\n\nuntil more data are available,\n\nbecause of the potential priming of the children’s immune responses that may alter their immunity\n\nThe Centers for Disease Control and Prevention, re breast feeding mothers\n\nhttps://www.cdc.gov/coronavirus/2019-ncov/vaccines/recommendations/pregnancy.html\n\nCOVID-19 vaccination is recommended for all people 6 months and older. This includes people who are pregnant, breastfeeding, trying to get pregnant now, or might become pregnant in the future. \n\nBack to the JAMA study\n\nThe Centers for Disease Control and Prevention recommends offering the COVID-19 mRNA vaccines to breastfeeding individuals\n\nalthough the possible passage of vaccine mRNAs in breast milk resulting in infants’ exposure at younger than 6 months was not investigated. \n\nThis study investigated whether the COVID-19 vaccine mRNA can be detected in the expressed breast milk (EBM) of lactating individuals\n\nreceiving the vaccination within 6 months after delivery.\n\nN =11\n\nModerna mRNA-1273 vaccine (n = 5)\n\nPfizer BNT162b2 vaccine (n = 6)\n\nSamples of EBM were collected before vaccination (control),\n\nand for 5 days postvaccination. \n\n131 EBM samples were collected\n\n(1 hour to 5 days after vaccine administration)\n\nThe presence of COVID-19 vaccine mRNA in different milk fractions\n\nassayed using 2-step quantitative reverse transcriptase–polymerase chain reaction. \n\nResults\n\nTrace amounts of BNT162b2 and mRNA-1273 COVID-19 mRNA vaccines were detected in 7 samples from 5 different participants,\n\nat various times up to 45 hours postvaccination\n\nNo vaccine mRNA was detected in prevaccination\n\nDiscussion\n\nThe sporadic presence and trace quantities of COVID-19 vaccine mRNA detected in EBM suggest that breastfeeding after COVID-19 mRNA vaccination is safe,\n\nparticularly beyond 48 hours after vaccination. \n\nThese data demonstrate for the first time the biodistribution of COVID-19 vaccine mRNA to mammary cells,\n\nand the potential ability of tissue EVs to package the vaccine mRNA that can be transported to distant cells. \n\nIn rats\n\nhttps://www.sciencedirect.com/science/article/abs/pii/S0168365915300535?via%3Dihub\n\nUp to 3 days following intramuscular administration, \n\nlow vaccine mRNA levels were detected in the heart, lung, testis, and brain tissues, indicating tissue biodistribution\n\nVaccine administration ---- lipid nanoparticles containing the vaccine mRNA ----- mammary glands (hematogenous and/or lymphatic routes)\n\nVaccine mRNA released into mammary cell cytosol ---- recruited into developing EVs ------ secreted in EBM\n\nCaution is warranted about breastfeeding children younger than 6 months in the first 48 hours after maternal vaccination until more safety studies are conducted. \n\n\nCOVID-19 medical misinformation policy\n\nhttps://support.google.com/youtube/answer/9891785\n\nClaims about COVID-19 vaccinations that contradict expert consensus from local health authorities or the WHO\nClaims that an approved COVID-19 vaccine will cause death, infertility, miscarriage, autism or contraction of other infectious diseases\nhttps://support.google.com/youtube/answer/11161123\n\nVaccine safety: content alleging that vaccines cause chronic side effects, outside of rare side effects that are recognised by health authorities\nEfficacy of vaccines: content claiming that vaccines do not reduce transmission or contraction of disease \nIngredients in vaccines: content misrepresenting the substances contained in vaccines", "link": "https://www.youtube.com/watch?v=1uF1oPyh8OY", "date_published": "2022-10-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]