[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "20 Minutes of Warhammer 40,000: Chaos Gate - Daemonhunters Gameplay", "description": "Warhammer 40,000 Chaos Gate - Daemonhunters blends the gameplay of strategy classics like XCOM, with the massive world of Warhammer 40k.\n\nWe get to see how these worlds collide as the Grey Knights take on the forces of Nurgle in this 20 minutes of gameplay.\n\nThe reboot of the 1998 game Warhammer 40,000: Chaos Gate is set to be released 5 May 2022.", "link": "https://www.youtube.com/watch?v=-ABW0a8AT4o", "date_published": "2022-04-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Chrono Cross Original vs Remaster Graphics Comparison", "description": "How does the recent Chrono Cross: The Radical Dreamers Edition stack up to the original PlayStation release? Spoilers, a lot.\n\n#ChronoCross", "link": "https://www.youtube.com/watch?v=JUr2NcJZnwM", "date_published": "2022-04-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Elder Scrolls Online: High Isle Preview Livestream", "description": "Tune in for a preview of the next chapter in the Elder Scrolls Online, High Isle.", "link": "https://www.youtube.com/watch?v=FSUCwoLCJ0o", "date_published": "2022-04-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "When Cyberpunk 2077's Expansion Releases | GameSpot News", "description": "Cyberpunk 2077’s expansion release window is revealed during a CD Projeckt earnings call, Call of Duty Warzone teases monsters coming to season 3, could be Godzilla,  and XCOM 2 is free on the Epic Games Store. \n\nAs part of CD Projeckt’s latest earnings call, the studio revealed that Cyberpunk 2077's highly anticipated expansion will not arrive until sometime in 2023. An official tweet concluded by saying “Please stay tuned for more details coming later this year.” The company also revealed a whole list of what it's working on for the rest of 2022 that include the recently delayed updated version of Witcher 3 and the next Witcher game in Unreal 5. \n\nActivision released the first Call of Duty Season 3 teaser that introduced new operators and the \"Classified Arms\" seasonal theme for Vanguard and Warzone. The trailer ended with the roar of an unknown creature potentially teasing a season of monsters. Call of Duty's monstrous Season 3 is scheduled to start on April 27.\n\nFrom now until April 21 at 8 AM PT / 11 AM ET, you can claim XCOM 2 and Insurmountable on the Epic Games Store.\n\nSTAMPS\n00:00 - Intro\n00:08 - Cyberpunk 2077 Expansion\n00:31 - CDPR 2022 Production Plans\n01:23 - CDPR Sales\n01:50 - Warzone Monsters\n03:03 - Free On Epic Games Store", "link": "https://www.youtube.com/watch?v=lmE7PbWJosA", "date_published": "2022-04-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "7 Worlds We Want in Kingdom Hearts 4", "description": "With the 20th Anniversary of Kingdom Hearts, Square Enix has just unveiled the exciting news that Kingdom Hearts IV is in development, and we even saw a Kingdom Hearts IV trailer. Kingdom Heart's 4th installment already has some interesting changes - notably Sora's more realistic look, and what many speculate to be a Star Wars tease at the beginning of the trailer. So, with that tease, here are 7 Worlds we hope to see in the upcoming Kingdom Hearts IV.\n\nCan you believe it’s been 20 years of Kingdom Hearts? Me neither, and yet here we are, with developer Square Enix using the anniversary to announce that Kingdom Hearts 4 is in the works. The series has taken us all over the Disney-Pixar-Final Fantasy verse over the years, but here are 7 worlds that we’d love to visit that aren’t Agrabah or Olympus Coliseum.\n\n0:00 - Intro\n0:29 - Star Wars\n1:33 - The Avengers\n3:01 - Wreck-It Ralph\n3:50 - The Simpsons\n4:38 - Finding Nemo\n5:21 - Inside Out\n6:00 - Final Fantasy VII Remake", "link": "https://www.youtube.com/watch?v=-ZyoE7CXofM", "date_published": "2022-04-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "No Man’s Sky Update Adding A Criminal Underworld… Hello Han Solo Fantasies | GameSpot News", "description": "No Man’s Sky is getting a big update titled Outlaws, Battlefield 2042 will receive its 4.0 update next week and PS5 gets a new firmware update. \n#GamingNews #NoMansSky #Battlefield2042\n\nNo Man’s Sky developer Hello Games has announced the next update for the game, called Outlaws. Launching on April 14, Outlaws will focus on the game's underworld and also includes a number of significant upgrades throughout No Man's Sky. You'll be able to visit outlaw space stations and star systems that have been overtaken by criminal elements, which creates an opportunity for you to earn some extra credits.\n\nBattlefield 2042’s 4.0 is coming next week and has 400+ changes, including bug fixes and quality-of-life improvements, among other things, according to a Twitter thread shared by DICE's Kevin Johnson. The full patch notes are coming early next week ahead of the patch's release. An official release date for the patch hasn't been revealed just yet.\n\nSTAMPS\n00:00 - Intro\n00:06 - No Man’s Sky\n01:41 - PS5 Firmware\n02:06 - Battlefield 2042", "link": "https://www.youtube.com/watch?v=2vwQ5grfgug", "date_published": "2022-04-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 Sojourn Origin Story Trailer", "description": "Learn more about Sojourn the newest character to join the Overwatch roster. A fierce former Captain of Overwatch equipped with cybernetic abilities.\n\nComing soon to #Overwatch2 PVP Beta.", "link": "https://www.youtube.com/watch?v=JoP0K9Wzau4", "date_published": "2022-04-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]