[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "It's Time You Played Resident Evil: Code Veronica", "description": "Resident Evil Code: Veronica is an overlooked gem of the series and we simply don't know why. Join Richie as he explains why you should play one of the series last classic-style titles.\n\nResident Evil Code: Veronica was the last of the fixed-camera classic titles with the emphasis on survival via strict item management and strategic save points. Years later, Resident Evil 4 began using the now popular third-person, over-the-shoulder style before eventually transitioning into a first-person series with Resident Evil VII and Village. \n\nCode Veronica is loved by many, so Richie Bracamonte is here to reflect on why Code Veronica is so special and how there possibly won't ever be another game like it.  Fortunately, if you're interested in checking out this classic, it's available on everything from the original Sega Dreamcast Version, all the way to the Xbox Series X and PS5.", "link": "https://www.youtube.com/watch?v=sZhiQCO-_y4", "date_published": "2022-01-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "M1 Garand: A Gaming & Historical Legend - Loadout", "description": "A must have for any World War 2 video game, the M1 Garand is a huge part of military history, and the arsenal of pop culture weapons. It was a tool that helped the allies fight in the Second World War, and has since been seen in plenty of games, from Call of Duty and Battlefield through to Fallout: New Vegas. But what about the rest of the Garand's history, the myths behind it, and its impact it has had on gaming over 80 years after it's invention?\n\nIn this episode of Loadout, Dave Jewitt visits the Royal Armouries to talk to Keeper of Firearms & Artillery Jonathan Ferguson about the history and impact of one of WW2’s most iconic weapons, the M1 Garand.\n\nYou can check out more episodes of Loadout right here. - https://www.youtube.com/watch?v=yzSrmGkpWKk&list=PLpg6WLs8kxGMzIemU1gyyLmg5VlKI2UvC\n\nYou can check out our Firearms Expert Reacts series here. - https://www.youtube.com/watch?v=5FVzcoRjoN4&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/", "link": "https://www.youtube.com/watch?v=iNK1KteoWf8", "date_published": "2022-01-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042’s Rush Mode Disappears Despite Fan Outcry | GameSpot News", "description": "In this episode of GameSpot News, we talk about Rush mode being taken out of Battlefield 2042’s featured playlist, Mario Kart 9 reportedly being in development, and E3 2022 opting for being online only instead of in-person. \n\nIn this video, DeVante talks about Battlefield 2042’s Rush mode being taken from featured playlists in Portal. DICE had always said Rush would only be in the game temporarily, and the studio extended its duration before it was finally removed.\n\nLater in the video, DeVante talks about Mario Kart 9 reportedly being in development. As well as E3 2022 continuing online-only events.\n\nTIME STAMPS\n00:00 - Intro\n00:08 - Battlefield 2042\n01:04 - Mario Kart 9\n02:54 - E3 2022\n03:39 - Outro", "link": "https://www.youtube.com/watch?v=guzqRCtNlYA", "date_published": "2022-01-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Apex Legends’ Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Apex Legends, including the VK 47 Flatline, the Wingman Revolver, and the Triple Take 3 Barrel Marksman Rifle.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Apex Legends and compares them to their potential real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=y4T78VQoWUs", "date_published": "2022-01-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Why We're Excited for Gaming in 2022", "description": "In this video, Persia goes over a few big reasons why 2022 is going to be an exciting year for gaming. From a year packed full of new releases, the rise of indie games, and more - there's a lot to look forward to soon.\n\nTo kick things off, it's clear that 2021 had a lot of heartbreaking, but necessary delays. That only means 2022 is going to be full of releases such as Elden Ring, Horizon Forbidden West, God Of War: Ragnarok, and more.\n\nPersia also goes on the highlight the rise of indie games with many amazing ones surfacing in 2021 including Kena: Bridge Of Spirits, Chicory: A Colorful Tale, and Before Your Eyes rivaling some AAA games. \n\nMovie and TV adaptations, streaming services with massive libraries, and even our own high expectations are also among the list of reasons why 2022 has some exciting possibilities. \n\nFor more information on the biggest games coming in 2022, be sure to visit gamespot.com.", "link": "https://www.youtube.com/watch?v=oZwlb3dwvZ4", "date_published": "2022-01-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]