[{"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Kanada: Seria ataków nożowników. Nie żyje co najmniej 10 osób. Trwa obława", "description": "W trzech prowincjach Kanady - Saskatchwan, Manitoba i Alberta - trwa obława za dwoma nożownikami, którzy w niedzielę zaatakowali w 13 różnych lokalizacjach - podała Kanadyjska Królewska Policja Konna (RCMP). Co najmniej 10 osób nie żyje, a 15 zostało rannych.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-05/kanada-seria-atakow-nozownikow-nie-zyje-co-najmniej-10-osob/", "date_published": "2022-09-04 23:04:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Indie: Karuzela runęła z ludźmi w Mohali. \"Sporo dzieci\" wśród rannych", "description": "Kilkanaście osób jest poszkodowanych po tym, jak podczas festynu w Indiach zerwał się element karuzeli - talerz obracający się 15 metrów nad ziemią. Tamtejsze media przekazały, że wśród rannych są dzieci. Moment katastrofy nagrali jej świadkowie.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-04/indie-karuzela-runela-z-ludzmi-w-mohali-sporo-dzieci-wsrod-rannych/", "date_published": "2022-09-04 20:48:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Prywatny odrzutowiec rozbił się w Bałtyku. Kontrolerzy stracili kontakt z pilotem", "description": "Cessna 551, zamiast planowo wylądować w niemieckiej Kolonii, nieoczekiwanie zaczęła lecieć na wprost. Pilot nie reagował na pytania kontrolerów lotów, dlatego Niemcy i Duńczycy poderwali myśliwce. Załogi wojskowych maszyn nie widzieli nikogo w kokpicie. W niedzielny wieczór maszyna rozbiła się na Morzu Bałtyckim, nieopodal Łotwy. Na pokładzie prawdopodobnie było małżeństwo i ich córka.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-04/prywatny-odrzutowiec-rozbil-sie-w-baltyku-kontrolerzy-stracili-kontakt-z-pilotem/", "date_published": "2022-09-04 19:40:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Ohio: 19-latek zamknął syna w aucie, aby \"nie przeszkadzał\". Dziecko nie żyje", "description": "Młody ojciec z amerykańskiego stanu Ohio uznał, że będzie miał spokój, jeśli zamknie swojego syna w samochodzie. Roczne dziecko tkwiło w rozgrzanym aucie, a następnie zmarło. Mężczyzna początkowo nie przyznał się do winy i kłamał podczas policyjnych zeznań. O tym, jak było naprawdę, powiedział dopiero, gdy mundurowi skonfrontowali kilka jego wersji zdarzeń.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-04/ohio-19-latek-zamknal-syna-w-aucie-aby-nie-przeszkadzal-dziecko-nie-zyje/", "date_published": "2022-09-04 18:12:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Słowacja: Obława na tygrysa. Uciekł z ukraińskiego zoo", "description": "Pojawienie się tygrysa na wschodzie Słowacji postawiło tamtejsze służby na nogi. Zwierzę wymknęło się pracownikom jednego z ogrodów zoologicznych w Ukrainie i przekroczyło granicę państwa. Służby i lokalne władze apelują do mieszkańców, by nie próbowali samodzielnie łapać drapieżnika i - jeśli tylko mogą - zostali w domach.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-04/slowacja-oblawa-na-tygrysa-uciekl-z-ukrainskiego-zoo/", "date_published": "2022-09-04 16:06:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Irlandia. Dramat w Dublinie. Nie żyją trzy siostry, matka i brat są ranni", "description": "W jednym z domów w stolicy Irlandii, Dublinie, odnaleziono ciała trzech sióstr - ośmioletnich bliźniaczek i 18-latki. Ranny został także ich 14-letni brat. W związku z tą sprawą policja zatrzymała 20-letniego mężczyznę.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-04/irlandia-dramat-w-dublinie-media-brutalny-incydent-nie-zyja-trzy-siostry/", "date_published": "2022-09-04 15:30:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Rosja. Sześć osób nie żyje. Wspinali się na wulkan na półwyspie kamczackim", "description": "Sześć osób zginęło podczas wspinaczki na Kluczewską Sopkę we wschodniej Rosji. Ratownicy nie są w stanie dotrzeć do kolejnych sześciu członków wyprawy z powodu złej pogody - przekazały media. Kluczewska Sopka to największy i najbardziej aktywny wulkan w Eurazji.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-04/rosja-szesc-osob-nie-zyje-wspinali-sie-na-wulkan-na-polwyspie-kamczackim/", "date_published": "2022-09-04 10:46:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Czechy. Antyrządowe protesty przeciwko drożyźnie. Szacunki mówią nawet o 100 tys. ludzi", "description": "W centrum Pragi zgromadziło się od 70 do nawet 100 tys. osób przeciwnych polityce czeskiego rządu. Protestujący wezwali rządzącą koalicję do podjęcia działań w celu kontroli gwałtownie rosnących cen energii. Na demonstracji pojawiły się także hasła antyeuropejskie. Premier Czech Petr Fiala stwierdził, że protestującym nie leży na sercu dobro kraju.", "link": "https://www.polsatnews.pl/wiadomosc/2022-09-04/czechy-antyrzadowe-protesty-przeciwko-drozyznie-zgromadzilo-sie-okolo-70-tys-ludzi/", "date_published": "2022-09-04 07:24:00+00:00", "persistent": false, "user": null, "language": null}]