[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Splatoon 3 - Everything To Know", "description": "Splatoon has been one of Nintendo's most surprising franchises in years - a wild combination of shooter and zone control in a stylish multiplayer package. Here's everything you need to know about the latest game in the franchise, Splatoon 3.\n\nWith the Nintendo Switch well established and extremely successful, Splatoon 3 looks to bring back the inky magic. Here's everything we know about Splatoon 3 so far including the release date, multiplayer details, and what to expect from the single player campaign mode. Splatoon 3 launches for Nintendo Switch on the 9th September 2022.\n\n00:00 - Intro\n00:28 - Plot & Setting\n02:12 - Gameplay\n04:56 - Multiplayer\n06:09 - DLC\n06:53 - Platforms\n07:48 - Release Date", "link": "https://www.youtube.com/watch?v=sgGDkBTzuuA", "date_published": "2022-09-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Best Open World Shooters To Play Right Now", "description": "Open-world shooters have the potential to deliver player vs. player, co-op, and single-player experiences at a scale no other video game genre can match. Seriously, one game on this list is set on a world-record-setting half-scale map of Europe. Let's find an open-world game that fits you.\n\nOpen-world shooters are the holy grail of games when done right. They can combine the scale of fantastic worlds or even galaxies with memorable characters, extensive gun customization, and combined arms warfare. They can also just be great places to mess around with friends for hundreds of hours. In this list, we're going to find a unique list of open-world shooters for players who like massive battles and PvP, players who want to survive the apocalypse with friends, and players that enjoy getting pulled into a vast single-player world. This list covers games on consoles including Xbox Series X/S, Xbox One, PlayStation 4, PS5, PC, and even game streaming platforms such as Xbox Cloud Gaming. \n\nOur first stop will be the competitive scene, where we'll look at the reigning king of massive battles and combined arms: PlanetSide 2. We'll then have a look at a game that holds several Guinness World Records and is recognized as one of the first MMOFPS titles with WWII Online. We'll look at a game for the mil-sim crowd with Arma Reforger, a testbed for Arma 4. Then we'll check in on the game forever in development that is Star Citizen, which has been slowly adding ground combat at a galactic scale. For the cooperative crowd, we're examining the wild and dangerous Far Cry 6, pure Ubisoft formula Ghost Recon Wildlands, and the often overlooked but excellent zombie survival game State Of Decay 2. For the crowd that loves single-player experiences, we have worlds you can lose yourself in, like Metro Exodus, Cyberpunk 2077, and Red Dead Redemption 2. Let's go. \n\n00:00 - 00:19 Intro\n00:19 - 02:10 PlanetSide 2\n02:10 - 03:33 Arma Reforger\n03:33 - 04:45 World War II Online\n04:45 - 05:58 Star Citizen\n06:00 - 07:51 Far Cry 6\n07:51 - 09:00 Ghost Recond Wildlands\n09:00 - 10:06 State Of Decay 2\n10:06 - 11:37 Metro Exodus\n11:37 - 13:32  Cyberpunk 2077\n13:32 - 14:59 Red Dead Redemption 2\n\n#gamespot #gaming #openworld", "link": "https://www.youtube.com/watch?v=Z3mYz1I5PMM", "date_published": "2022-09-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "NBA 2K23 Everything To Know", "description": "Like clockwork, NBA 2K launches every September and reignites the age-old debate of who's overrated, who's underrated, and how the series' latest iteration feels according to the passionate fandom.\n#gaming #nba2k #gamespot \n\nThis year, NBA 2K23 muddies those waters in an interesting way. Not only will players take the court with modern superstars like Steph Curry and Kevin Durant, they'll be able to travel back to the '80s, '90s, and early 2000s and play as legends like Bird, Duncan, and Iverson. For more on these new features, as well as details on the NBA 2K23 release date, preorder details, and more, here's everything you need to know about NBA 2K23.\n\nWhile annual sports sims typically have few innovations outside of updated rosters year to year, it appears NBA 2K23 is poised to add several new features to its suite of modes.\n\nNBA 2K’s most popular mode, MyPlayer, is back. Every year, the team does a great job of making your custom character the star of the game, and a new storyline in this year’s game will do that once more. This time, the story starts with you actually getting to choose your own landing spot via the NBA Draft. While that may sound great… there’s a catch. The team’s fanbase wanted a different player, so you’ll be tasked with winning over your new fanbase when they’ve got wandering eyes for your rival, Shep Owens. From being booed on stage at the draft to exploring The City and seeing fans wearing Owens’ jersey rather than yours, the environment will be hostile at first. But winning solves everything, doesn’t it? Throughout the storyline, you’ll work to gain the fans’ admiration and prove over the course of your career that you were the right pick all along. The team at Visual Concepts says this year’s MyPlayer is the biggest the team has ever done, and the story will include cameos, as it often does, including rapper Bas and music producer Elite, both of whom work under J. Cole’s label Dreamville Records.\n\nNBA2K23 releases on PlayStation, Xbox, Switch, and PC on September 9th.", "link": "https://www.youtube.com/watch?v=MAMMGxZaMcs", "date_published": "2022-09-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]