[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCO2x-p9gg9TLKneXlibGR7w", "title": "I would have done this sponsored video for free...", "description": "Robot vacuums have sucked (get it?) at mopping—until now.\nBuy the X1 OMNI from ECOVACS - https://www.ecovacs.com/us/deebot-robotic-vacuum-cleaner/DEEBOT-X1-OMNI-BLACK?utm_source=X1KOL&utm_medium=USDTC&utm_campaign=X1LAUNCH&utm_term=SnazzyLabs&utm_content=OMNIBLACK\nBuy the X1 OMNI from Amazon - https://www.amazon.com/dp/B09NPKWDRX?ref=myi_title_dp\nBuy the X1 OMNI from BestBuy - https://www.bestbuy.com/site/ecovacs-robotics-deebot-x1-omni-black-silver/6497860.p?skuId=6497860\nX1 OMNI - Memorial Day Promo:\nMay 23 – May 29\nExclusively at Best Buy and BestBuy.com: $150 OFF  \n\nIn the last few years, robotic vacuum cleaners have gotten immensely more useful thanks to camera vision obstacle avoidance and auto-empty stations. Because, what good is a \"do it all\" robot if you have to maintain it every day or two? But even as robot vacuums have gotten more maintenance free, they've never been able to tackle a big part of floor cleanup: mopping. Dragging a slightly damp pad behind the robot's path is hardly a pathway to a clean floor and vibrating pads aren't much of an improvement. Not only does the new ECOVACS X1 OMNI actively SCRUB the floor, but it even has a station that periodically cleans the pads, fills up the robot's water reservoir, and even dries the pads after a cycle allowing for truly maintenance-free operation. This video is sponsored, yes, but this vacuum is unreasonably cool and I love it (they can't pay me to say that)!\n\nSee Vacuum Wars awesome video on the first robotic vacuum - https://www.youtube.com/watch?v=V9u0f6jVxw0\n\nSubscribe to my podcast Flashback! - http://relay.fm/flashback\nFollow me on Twitter - http://twitter.com/snazzyq\nFollow me on Instagram - http://instagram.com/snazzyq\n\n#MeetDEEBOTX1 #SpringCleaningisCancelled #X1OMNI", "link": "https://www.youtube.com/watch?v=Nt9XjjR5N1U", "date_published": "2022-03-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]