[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Meets SXSW: KAINA", "description": "Every year, NPR Music participates in the SXSW music festival, whether it's curating a stage or simply attending hundreds of shows at the annual event in Austin, Texas. In 2020, the festival was canceled due to the pandemic, but it returned last March as an online festival. We programmed a virtual \"stage\" of Tiny Desk (home) concerts in 2021 in a series called Tiny Desk Meets SXSW. This year we return again, virtually, with another round of Tiny Desk Meets SXSW: four videos filmed in various locations, all of them full of surprises.\n\nAnamaria Sayre | March 22, 2022\nSetting the scene with a winding tour of the jam-packed gathering of musicians in a mystical recreation of her childhood casita, Chicago-based singer KAINA offers her Tiny Desk (home) concert viewer a temporally unhinged invitation to come over to her house after school.\n\nIt doesn't take much to imagine what it was like in the vocalist's childhood home: salsa bouncing off the walls, arepas flowing from the kitchen, no one allowed to go home unfed (thanks in part to her Venezuelan and Guatemalan parents). KAINA is channeling that same casita-born energy into her performance here. She opens the performance with the title track to her new album, \"It Was a Home,\" a twinkly piece complete with nostalgic riffs and soft percussion. She mentions that she was featured in Saba's 2018 Tiny Desk, but this is her first time owning the performance herself — and she hardly takes a beat after the song is over to bask in the glory of her center-stage experience before she takes her time naming every person on stage – and off – who built the 15-minute performance. Moving on to her upbeat, zanier number, \"Apple,\" she brings more \"friends\" (instrumentalists, vocalists and puppets included) on screen for the performance. Closing with a full-bodied, chorally-backed performance of \"Casita,\" she once again takes the time to give the voices around her equal space alongside her own.\n\nBut her community – these featured musicians, the city of Chicago, Latinas across the country – aren't the only people she's elevating here. She's using this space, her casita and this moment in her career to speak to her inner child, as she describes in \"It Was a Home.\" She's assuring her that when she's all grown up she'll use her voice to shine a light on her casita, beseeching the entire world to marvel at its beauty.\n\nSET LIST\n\"It Was a Home\"\n\"Apple\"\n\"Casita\"\n\nMUSICIANS\nKAINA: vocals\nMichael Hilger: keyboards  \nSen Morimoto: keyboard, vocals \nRyan Person: drums \nBrian Sanborn: guitar \nQuinn Cochran: guitar, vocals \nMichael Cantella: bass \nBackground Vocalists: NNAMDÏ, Paige Pohlad, Kara Jackson\n\nCREDITS\nDirected & Produced by: Bitchcraft Collective \nCinematographer: Matt Hatleberg\nEdited by: Jack Cronin\nAudio: Brok Mende\nPuppeteers: Frances Farlee, Ashley De La Torre, Quinn Regan, Izzi Vasquez\nProducer: Kaleb Eisenmann \nExecutive Producers: Saró & Matt Hatleberg \nCo-Directors: Kaden Maloney & Rachel Cole \nUPM: Alexis Vergara\n1st Assistant Director: Erica Martens\nSet Designers: Kaden Maloney, Rachel Cole & Alexis Vergara \nSteadicam Operator: Brian Delisi\nB Cam Operator: Luciana Salinas\n1st Assistant Camera: Doug Birch\nGaffer: Ted Holmwood\nKey Grip: Chris \"Skoach\" Owsiany\nColorist/DIT: Spencer Hagerman\nFriends of Friends Recording\n\nSpecial Thanks:\nBryan Casallo\nPogi Studios \nCamera Ambassador \nAtlas Lighting \nMagnanimous Media \nJosh Jones\n\nTINY DESK TEAM\nProducer: Bob Boilen \nVideo Producer: Joshua Bryant\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Kara Frame, Maia Stern, Ashley Pointer\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #kaina", "link": "https://www.youtube.com/watch?v=jSK5fJpqs5I", "date_published": "2022-03-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Meets SXSW: Yard Act", "description": "Every year, NPR Music participates in the SXSW music festival, whether it's curating a stage or simply attending hundreds of shows at the annual event in Austin, Texas. In 2020, the festival was canceled due to the pandemic, but it returned last March as an online festival. We programmed a virtual \"stage\" of Tiny Desk (home) concerts in 2021 in a series called Tiny Desk Meets SXSW. This year we return again, virtually, with another round of Tiny Desk Meets SXSW: four videos filmed in various locations, all of them full of surprises.\n\nBob Boilen | March 21, 2022\nBefore the English band Yard Act set foot on stage at the Trades Club in Hebden Bridge, England, the band set up its instruments in the green room and performed this Tiny Desk (home) concert. It’s a fitting location for the band from Leeds, which has around 70 shows lined up to celebrate its debut album The Overload including the SXSW music festival in Austin, Texas. Yard Act’s music is filled with brash sounds aimed at capitalism, equality, or lack thereof, and all done with both venom and humor.\n  \nJay Russell’s drum machine sits on a tiny table and kicks off the song, with Ryan Needham’s simple bassline and Sam Shjipstone’s guitar tones setting the backdrop for James Smith’s narrations. “Rich” is our opener, a song that James Smith wrote imagining a world where one might actually make music for a living. James Smith told me that it was a kind of “hypothetical exercise in what I’d do if all of a sudden I had a lot of money, as someone who’s never had money and never expected to.” The lyrics humorously imagine the song being used in Hollywood films where the protagonist gets rich, and in turn making James rich. It’s a searing, tongue-in-cheek look at capitalism and our money-obsessed culture, a theme that takes different forms through different characters in this wry and compelling five-song set. \n\nSET LIST\n“Rich”\n“Payday”\n“Land Of The Blind”\n“Fixer Upper”\n“100% Endurance”\n\nMUSICIANS\nJames Smith: vocals\nSamuel Shjipstone: guitar\nRyan Needham: bass\nJay Russell: drum machine\n\nCREDITS\nVideo: Jonny Ridout\nAudio: Pete Flinton, Jay Russell\nRecorded at the Trades Club green room, Hebden Bridge\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Joshua Bryant\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Kara Frame, Maia Stern, Ashley Pointer\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #yardact", "link": "https://www.youtube.com/watch?v=Id-t3IVNREo", "date_published": "2022-03-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]