[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Black Voices in Gaming", "description": "Black Voices in Gaming highlights Black voices in the gaming industry, dedicated exclusively to presenting games created by Black developers, titles featuring Black protagonists, and conversations with these creators.\r\n\r\nAhmed / Khahil Abdullah, Swimsanity\r\nYata Andersen, Elderand\r\nSalim Larochelle, Hiboka\r\nDes Gayle, The Hellbrand\r\nChris, Spirit Swap\r\nJohn Davis, BitSummit\r\nKhalief Adams, Spawn on Me", "link": "https://www.youtube.com/watch?v=Qj1gXGhJwTw", "date_published": "2022-03-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 Patch Details & Xbox Reveals Fuzzy Controllers | GameSpot News", "description": "Cyberpunk 2077 gets a new patch, Fuzzy Xbox Controllers revealed for Sonic The Hedgehog 2 sweepstakes, Cyberpunk’s expansion is not switching engines and a Witcher dev promises no crunch while working on the new game.\n\nCyberpunk 2077 has received a new update, 1.52, that fixes issues related to missing loot, broken animations, and teleporting wrecked cars. Other fixes include clearing bugs in quests like Automatic Love and Path of Glory as well as your vehicle spawning closer to V when it's summoned.\n\nXbox revealed custom controllers that are not being offered for sale commercially, but fans can enter a sweepstakes to win them. The controllers come in Sonic Blue and Knuckles Red and feature coatings meant to represent real-world hedgehogs.\n \nOn March 22, CD Projekt Red announced a new Witcher game is in development that will be built using Unreal Engine 5. Despite the studio’s partnership with Epic, it will not disown REDengine anytime soon. CD Projekt said in a statement that the upcoming expansion for Cyberpunk 2077 will be developed using REDengine instead of Unreal 5.\n\nSTAMPS\n00:00 - Intro\n00:08 - Cyberpunk 2077 Patch\n01:22 - Sonic & Knuckles Controllers\n01:57 - Cyberpunk 2077 Expansion\n03:04 - Witcher Dev On Crunch", "link": "https://www.youtube.com/watch?v=FGIwsZMqlGE", "date_published": "2022-03-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Kirby and the Forgotten Land - Everything To Know", "description": "Kirby the Super Tuff Pink Puff is back for an all new 3D adventure, and with its March 25, 2022 release date right around the corner, here’s everything to know about Kirby and the Forgotten Land.\n\nKirby and the Forgotten Land is a 3D platforming adventure game developed by HAL Laboratory, the company that’s been making Kirby games since the very beginning. It’s not an open world game however, it's still split up into linear levels like previous platforming Kirby adventures. Each stage is a 3D environment with hidden Waddle Dees to discover and optional hidden objects, and some of those stages include boss fights like the two characters I mentioned before, Gorimondo and Clawroline. You’ll also collect Capsule Toys and Star Coins, Capsule Toys are just fun collectibles, and Star Coins can be used in Waddle Dee Town.\n\nTo get from level to level there is an overworld map where you can use the Warp Star to fly around, and on top of main levels there are also Treasure Road levels, a sort of race to the finish style mini-game where you’re given a specific copy ability or mouthful mode and have to try and beat the level as fast as possible. Each level has a target time as well that rewards you with more star coins if you hit it. Beating these levels mainly rewards you with rare stones you can also use in Waddle Dee Town.\n\nOne of the brand new features in Forgotten Land is Mouthful Mode where you can suck up objects and take advantage of their abilities. Some of the Mouthful Mode abilities we know about are Car Mouth, which turns Kirby into a car for faster traversal and to ram into enemies. Vending Mouth which turns Kirby into a vending machine and gives Kirby the ability to shoot cans at enemies. Cone Mouth which lets Kirby slam into objects using the pointy side of the cone. Scissor-Lift Mouth which gives Kirby a way to reach high places. Ring Mouth which, unlike the doorbell, shoots out gusts of wind which can help push boats across water or spin fans. Lightbulb Mouth can illuminate dark areas. Arch Mouth turns Kirby into a paraglider and allows him to fly. And there’s even Water-Balloon Mouth which fills up Kirby with water that can be used to spray enemies or clean up goo. \n\n#Kirby #ForgottenLand", "link": "https://www.youtube.com/watch?v=suG3-SozEQs", "date_published": "2022-03-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The MIX 10th Anniversary Showcase", "description": "Tune in to the MIX’s 10th anniversary showcase, featuring announcements, trailers, new gameplay and more, bringing together some of the hottest developers and publishers around the world.", "link": "https://www.youtube.com/watch?v=5wksmDMGa4g", "date_published": "2022-03-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Ghostwire: Tokyo Review", "description": "Ghostwire: Tokyo doesn't reinvent the wheel when it comes to open-world games, but its unique setting, tremendous attention to detail, and singular combat make it stand out amongst its contemporaries.\n\n#GhostWireTokyo", "link": "https://www.youtube.com/watch?v=oxCh-Y3gEBM", "date_published": "2022-03-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "LEGO Star Wars: The Skywalker Saga - The Final Preview", "description": "Before its full release on April 5, we had the chance to check out a preview of LEGO Star Wars: The Skywalker Saga. TT Games' new LEGO Star Wars game adds character skill trees, a cover-based shooting mechanics, and a melee combo system.\n\nThe Skywalker Saga is not a collection of Lego Star Wars: The Video Game, Lego Star Wars II: The Original Trilogy, and Lego Star Wars: The Force Awakens--this entirely new entry in developer TT Games' series features brand-new and original levels, cutscenes, voice acting, hub areas, and gameplay mechanics. Each of the nine episodes can be played in any order, and the storylines of each episode have been tweaked to incorporate details from beyond the nine mainline movies.", "link": "https://www.youtube.com/watch?v=ie-Fb-DnPKo", "date_published": "2022-03-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Witcher Game Announced, Won't Be Epic Games Store Exclusive | GameSpot News", "description": "A New Witcher game is announced, PlayStation buys Haven Studios, and Steam Deck gets support for Xbox cloud gaming. \n#GamingNews #Witcher #PlayStation\n\nCD Projekt Red has finally announced that a new game in The Witcher series is in development. While CDPR isn't ready to share any details on the next Witcher game just yet, the company did briefly touch on the company shifting to Unreal Engine 5 as part of a multi-year strategic partnership with Epic Games.\n\nSony Interactive Entertainment is buying gaming veteran Jade Raymond's new studio, Haven, in a move that comes after the two companies announced plans to work together on a new IP, a AAA multiplayer experience for PlayStation 5.\n\nSteam Deck now supports Xbox's cloud gaming service. Microsoft says it worked closely with Valve to enable support, which is now available through Microsoft's Edge browser.\n\nSTAMPS\n00:00 - Intro\n00:08 - New Witcher\n02:25 - Sony & Haven Studios\n03:35 - Xbox Cloud Gaming On Steam Deck", "link": "https://www.youtube.com/watch?v=QIMl_KOMmTs", "date_published": "2022-03-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PUBG MOBILE’s 4th Anniversary Top Four Favorites", "description": "(Presented by PUBG MOBILE ) It’s hard to believe we’ve been playing PUBG MOBILE for four years already, but it’s true. At this point, there’s just so much PUBG MOBILE to love that just going through our favorite outfits didn’t feel like it would be enough. So in honor of the 4th anniversary, we’re gonna share our top 4 things in four different categories, from our favorite maps to the best guns to the most exciting drop spots.\n\n#PUBGMOBILE #PUBGMOBILETURNS4", "link": "https://www.youtube.com/watch?v=2w-KJv9Qouk", "date_published": "2022-03-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]