[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best Scary Games To Play On Game Pass Right Now", "description": "It’s Halloween season, so here's a list of the scariest games on Microsoft Game Pass to get yourself into the holiday spirit with. \n\nFrom Amnesia to The Evil Within, there's plenty of spooky games on Game Pass to celebrate the Halloween season. So in this video we're going over some of the scariest games to play right now, including some new ones like Signalis, to classic horror romps such as Dead Space.\n\n00:00 - Intro\n00:12 - Signalis\n01:21 - Dead Space\n03:04 - Amnesia Collection\n04:31 - Soma\n05:29 - Scorn\n06:37 - The Evil Within\n07:47 - Outro", "link": "https://www.youtube.com/watch?v=H1YdP6YkPjQ", "date_published": "2022-10-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Modern Warfare 2 - Full Campaign Cutscenes & Post-Credit Scene", "description": "Spoiler warning! Here's every cinematic and in-game cutscene from the latest Call of Duty game, Modern Warfare 2. \nVideo Notes:\nTimestamps: \n0:00 Strike\n5:23 - Kill Or Capture\n9:26 - Wetwork\n11:53 - Tradecraft\n13:42 - Borderline\n17:14 - Cartel Protection\n21:44 - Close Air\n27:47 - Recon By Fire\n31:02 - Violence And Timing\n34:30 - El Sin Nombre\n41:21 - Dark Water\n44:29 - Alone\n49:17 - Prison Break\n53:54 - Hindsight\n57:36 - Ghost Team\n1:06:50 - Countdown\n1:12:35 - Post Credit Scene", "link": "https://www.youtube.com/watch?v=j0vEXQjUEiM", "date_published": "2022-10-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Modern Warfare 2’s Cross-Play Problem, Most Hated Map & More | GameSpot News", "description": "Call of Duty: Modern Warfare 2 on PC and Xbox doesn’t have a cross-play toggle, players don’t Santa Sena Border Crossing and Burger King and Activision team up for an exclusive skin. \n#GamingNews #CallofDuty #ModernWarfare2\n\nGames with cross-play support generally offer the ability to toggle it off, since some console players might not want to play with PC players using mouse and keyboard, while some PC players prefer not to play with console players that have aim-assist. For some unknown reason, this option in Modern Warfare 2 is only available to PS5 and PS4 players, meaning Xbox and PC players are stuck being lumped into cross-play lobbies unless developer Infinity Ward makes a change.\n\nXbox players do have the ability to circumvent this omission at a system level, toggling off support for cross-play that will apply to all games on the system. If you want to disable cross-play at a system level on Xbox, you can follow these steps:\n\nGo to the Settings menu on the Xbox console\nGo to the General tab and choose ‘Online safety & family’\nChoose ‘Privacy & online safety’ then ‘Xbox Live privacy’\nChoose ‘View details & customise’, then ‘Communication & multiplayer’\nOn the tab that says “You can play with people outside Xbox Live’, choose ‘Block’\n\nSanta Sena Border Crossing places players on a highway packed with an unthinkable number of cars. Most maps feature a square or rectangle layout, but Santa Sena Border Crossing is a very narrow and linear map with little escape from the cars.\n\nSome players took to social media to call it the Picadilly of Modern Warfare 2, as Picadilly was a Modern Warfare 2019 map that also received a lot of talk and negative attention over its design.", "link": "https://www.youtube.com/watch?v=jD_PSTx7U_U", "date_published": "2022-10-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Outlast Trials' TERRIFYING Opening Gameplay", "description": "The closed beta for The Outlast Trials kicked off on Halloween weekend, and it is not for the faint of heart. In this video we'll show you the opening cutscene, character creator, and the chilling tutorial.\n\n#outlast #gamespot #gaming", "link": "https://www.youtube.com/watch?v=Mm7A3iY3b5M", "date_published": "2022-10-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War Ragnarök | Official 4K Launch Trailer", "description": "Join Kratos and Atreus on a mythic journey for answers before the prophesied battle that will end the world.   \nAll the while, the eyes of Asgard watch their every move… \n\nGod of War Ragnarök is coming to PS4 and PS5 on November 9th!\n\n#GodOfWar #GodOfWarRagnarok", "link": "https://www.youtube.com/watch?v=rUBt1BRtTww", "date_published": "2022-10-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mix Next Showcase & Black Voices in Gaming", "description": "Tune in for MIX Next, featuring new game reveals, announcements, gameplay and more. Then comes an inside look at Akupara Games, Assemble Entertainment, Raw Fury and tinyBuild. Finally, Black voices in gaming is dedicated exclusively to presenting games from Black developers, featuring Black protagonists, and conversations with these creators.\r\n\r\n#gaming", "link": "https://www.youtube.com/watch?v=J6Tk9NQAPec", "date_published": "2022-10-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Callisto Protocol Canceled In Japan, Here's Why | GameSpot News", "description": "The Callisto Protocol gets canceled in Japan, Gotham Knights is getting lots of fixes and Modern Warfare 2 isn’t what you think it is.\n#GamingNews #TheCallistoProtocol #PS5\n\nThe Callisto Protocol will not be released in Japan due to the game failing to receive a rating there, presumably due to its violence and gore. The studio said via its Japanese Twitter account that the localized version for Japan will be discontinued and that anyone who preordered will get a refund.\n\nThe Callisto Protocol takes place in a prison on one of Jupiter's moons, Callisto. The game promises to be extremely violent and gory. In fact, Striking Dance boss Glen Schofield said the development team looked at grisly car crash scenes for inspiration.\n\nThe Callisto Protocol launches on December 2 for PS5, Xbox Series X|S, and PC. The game could spawn a sequel, as Schofield has said he has ideas for additional entries in the series.\n\nIn less scary news, Gotham Knights developer Warner Bros. Montreal has released a new update for the game that aims to improve performance issues on PC, with a PS5 and Xbox Series X|S patch coming soon. This is a small patch, but a more substantial update will follow it as the studio looks to add a \"mix of needed fixes that have popped up since launch\" for the game, specifically frame rate stability on consoles.\nSTAMPS\n00:00 - Intro\n00:10 - The Callisto Protocol\n01:20 - Gotham Knights\n02:06 - Modern Warfare 2", "link": "https://www.youtube.com/watch?v=BfJpxlsh_ks", "date_published": "2022-10-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]