[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "9 Things We Want From Pokémon Scarlet & Violet", "description": "Pokémon Scarlet & Violet are sure to bring a bunch of new changes to the classic Pokémon formula. Here are 9 things we would love to see in the upcoming Gen 9 games.\n\nPokémon Scarlet & Violet is officially revealed. We know very little about the games except for the three new starters. That won’t stop us from speculating and breaking down all the things we’d like to see in a new Pokémon game. In this video, we’ve got 9 big things we want to see, some of them pretty plausible while others may be a bit of a reach. That won’t stop us from dreaming! \n\nPokémon Legends: Arceus has an excellent blueprint that Scarlet & Violet will hopefully pull from, but significant improvements should be made, especially on a visual level. Beyond that, we go into a desire for references to older Gen games, a content-packed end game with plenty of depth and more quality of life improvements, such as the return of Secret Bases!\n\nPokémon Scarlet & Violet doesn’t have a release date yet but is slated to come out late in 2022. If you have anything you want to see from Gen 9, leave your thoughts in the comments below. Check out our guides and videos on our channel or GameSpot.com for all else Pokémon.\n\nTime Stamps: \n0:28:27 - Red & Blue Throwbacks\n0:58:00 - A Rich Endgame\n2:30:00 - The Return Of PvP\n3:20 - Gym Battles With A Twist\n4:26 - Secret Bases (Gen 3 Style)\n5:24 - More Open World\n6:18 - Good Optimization\n6:52 - Voice Acting\n7:32 - Evolutions For Older Pokemon", "link": "https://www.youtube.com/watch?v=PvL98NS9q5Y", "date_published": "2022-03-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "How Games Get Weapon Attachments Wrong - Loadout", "description": "Whether it’s Call of Duty: Vanguard or Escape From Tarkov, modern shooters love to let you customise your weapons with a whole range of attachments, sights, grips, and suppressors. From Rainbow Six through to Battlefield, it’s a phenomenon that has spanned the shooter genre for longer than we think, so why then do many developers still miss the mark in their portrayal of weapon attachments?\n\nIn this episode of Loadout, Dave Jewitt visits the Royal Armouries to talk to Keeper of Firearms & Artillery Jonathan Ferguson to chat about gaming’s obsession with modular firearm attachments, from scopes and suppressors to foregrips and drum magazines.\n\nYou can check out more episodes of Loadout right here. - https://www.youtube.com/watch?v=yzSrmGkpWKk&list=PLpg6WLs8kxGMzIemU1gyyLmg5VlKI2UvC\n\nYou can check out our Firearms Expert Reacts series here. - https://www.youtube.com/watch?v=5FVzcoRjoN4&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/", "link": "https://www.youtube.com/watch?v=AiRMLtLbY5E", "date_published": "2022-03-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Liurnia Best Path To Take | Beginner's Guide", "description": "So you finished Elden Ring's Limgrave section and have made it into Liurinia of the Lakes - whether that be by defeating Godrick the Golden or by skipping Stormveil entirely. Here's our recommended route to take through this huge new area, and how to find the ones beyond. #EldenRing\n\nThe Lands Between is a huge sprawl of various locations, and Elden Ring starts you off in the vast area of Limgrave. While it can take you many hours to examine every nook and cranny and defeat each of its bosses, you should brace yourself for more huge areas to come. You can either defeat Godrick the Golden or skip Stormveil completely, but either way, the next area, Liurnia of the Lakes is ready to present you with another challenge.\n\nIt's easy to get lost, so in this video, our very own Souls expert Dave Klein (aka Dave Control) walks you through the recommended path to get through Liurnia of the Lakes and the surrounding area. He also points out key NPCs and their locations, like Sorceror Thops, as well as where to find Sacred Tears in the area. The path quickly forks, so Dave guides you through Liurnia Highway, Academy of Raya Lycaria, and to the Church of Vows where you'll find another important NPC for those using sorceries and incantations: Miriel, Pastor of Vows. He also advises you on when to tackle Caria Manor, and the Siofra River, both tough areas in the game. This is a very in-depth guide, and there's much more to dig into, so make sure you watch along or use the timestamps if you get stuck. \n\nIf you want to know more about the game, check out Tamoor Hussain's Elden Ring review in progress. He gave it a 10/10 saying, \"From Software's latest is a masterpiece of open-world design that places exploration and player agency at the heart of the experience.\" \n\n#EldenRing", "link": "https://www.youtube.com/watch?v=FpGR8JLE4c8", "date_published": "2022-03-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To MORE Cyberpunk 2077 Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Cyberpunk 2077, including Johnny Silverhand’s Malorian Arms, the Palica Smart Shotgun, and, of course, the talking gun, SKIPPY.\n\n00:00 - Opening\n00:44 - Johnny Silverhand's Malorian Arms\n02:21 - HJSH-18 Masamune\n03:57 - DB-4 Palica Smart Shotgun\n05:13 - DR5 Nova\n06:45 - Kongou\n08:52 - DA8 Umbra\n10:10 - Guillotine SMG\n12:19 - DR-12 Quasar\n14:46 - SKIPPY\n17:50 - Achilles\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down more of the guns from Cyberpunk 20772 and compares them to their potential real-life counterparts.\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=N-oKcfS3dvc", "date_published": "2022-03-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Triangle Strategy Review In Progress", "description": "Triangle Strategy strips away some of Final Fantasy Tactics' systems while adding extra nuances of its own to make a unique homage.", "link": "https://www.youtube.com/watch?v=O-to4o-FA30", "date_published": "2022-03-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]