[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "GOOD Console, LIMITED PC - Steam Deck Review", "description": "Get 100$ credit for your own Linux and gaming server: https://www.linode.com/linuxexperiment \n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n00:00 Intro\n00:45 Sponsor: 100$ credit for your Linux or Gaming server\n01:37 Hardware\n03:55 Display\n04:35 Software\n07:13 Performance\n09:13 Battery Life\n10:45 Compatibility\n13:39 As a Linux Computer?\n18:14 Final Thoughts\n18:52 Sponsor: Get your Linux Laptop or Desktop\n19:21 Support the Channel\n\nAs a console, the Deck delivers. The Deck is amazingly built and surprisingly lightweight.\n\nThe feel in hand is really great, and even after a few hours, your hands won't cramp, and your fingers lie comfortably on the controls. The sticks are really nice and responsive, the D-Pad is serviceable. The triggers feel really good, and the shoulder buttons are clicky, and quick to press.\n\nThe touch surfaces feel like it should have been more soft touch plastic, and the Steam and Quick settings buttons are mushy. The back paddles, though, are amazing. \n\nThe screen is OK. It's a bit washed out, colors don't really pop, it's not super vibrant, but it's responsive, and the 800p resolution doesn't matter at all here.\n\nThe settings are plentiful, with a fortunate way to disable the UI sounds that are the bane of my existence on consoles, the ability to disable steam haptics, the rumble, changing the keyboard theme, and much more.\n\nGenerally, all the games I tested got their 60fps at medium settings, which, I don't think you really need to go past in most games, on that small a screen. Only The Witcher 3, even on Low, and Cyberpunk couldn't hit that target reliably, but you can get a nice 45 FPS on medium on The Witcher.\n\nGames will use control layouts that have been created either by the developers, or by the community, but you can switch between various layouts and inputs. You can tweak and get any layout you want, whether you prefer sticks, or the touch surfaces,or even the gyro\n\nNow, about battery life, it's just Ok. If you limit don't play titles with insanely intensive graphics details, you're up for 4 or 5 hours easy, which is more than what I would play on a handheld device in a single sitting.\n\nThere is some noticeable fan noise as well, even just when downloading titles.\n\nIn terms of the game library, for games that are certified, or playable, I don't think the general gaming enthusiast will ever notice they're not running Windows.\n\nThe Deck runs SteamOS 3, based on Arch Linux, and while the default interface is an appliance, specifically tailored for gaming, you can access a KDE plasma desktop.\n\nBut before that, you also have access to a plethora of options for just your gaming. I talked about the framerate limiter, which lets you lock everything at 30fps, but there's a lot more. You can set a thermal limit for the CPU, to use less power, you can manually control the GPU clock, you can change the scaling filter for dynamic resolution tools, like FSR.\n\nOf course, you get access to all the graphical options in game, just like on a PC, but you also get access to MangoHUD.\n\nYou can definitely just set the deck on your desk and plug it into a monitor and other input devices, and use that. As a matter of fact, a dock is also planned to do just that. And through that, you could also use that Steam Deck as a complete Linux PC.\n\nIt uses Plasma 5.23.5, and X11, with the Linux kernel; 5.13. Once you're inside, you can do a lot, as long as it's using Flatpak.\n\nSo you can't access the whole filesystem, and you can't just install anything you'd like. It's going to be a more locked down experience than most of you might expect: while it IS Linux underneath, it's not a general purpose distro.", "link": "https://www.youtube.com/watch?v=y4N0b3NJfhU", "date_published": "2022-03-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]