[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "A Special Bee Weekly: Kirk Cameron At The Babylon Bee", "description": "Check out the podcast at the new The Babylon Bee Podcast channel: http://www.youtube.com/thebabylonbeepodcast\n\nIt’s another Bee Weekly, but this time Kirk Cameron joins the crew at The Babylon Bee! Kyle, Brandon, and Jarret talk about what it was like growing up in the cozy and quirky milieu that was 90s Christian pop culture and how that experience shaped them for better or worse. Then Kyle and Jarret sit down with Tribulation Force himself, Kirk Cameron, to talk about faith, the Christian movie industry, his relationship with evangelist Ray Comfort, and how America may be ripe for a revival!\n\nKirk Cameron famously walked away from Hollywood after becoming a Christian at 17 when Jesus changed his life. He is known for acting in the sitcom Growing Pains and for portraying Cameron “Buck” Williams in the Left Behind film series. He has a new movie coming out called LIFEMARK. He also wrote the foreword to The American Covenant: The Untold Story, a book by his good friend Marshall Foster.\n\nIn the full-length episode, available to subscribers to The Babylon Bee, Kirk answers questions from listeners and subscribers, reacts to times The Babylon Bee made fun of him, and answers The Ten Questions.", "link": "https://www.youtube.com/watch?v=ulsDFl61pVU", "date_published": "2022-08-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "Is Your Starbucks Barista Conservative? Know The Warning Signs!", "description": "Starbucks: a safe haven for the marginalized and uncaffeinated. But every once in a while that safe space is infiltrated by evil right-wing Nazi conservatives. Here are a few signs you can use to tell if your Starbucks has been compromised with Republicans.\n\nFollow Chandler's Youtube: https://www.youtube.com/chandlerjuliet\n\nBecome a premium subscriber:  https://babylonbee.com/plans\n\nThe Official The Babylon Bee Store:  https://shop.babylonbee.com/\n\nFollow The Babylon Bee:\nWebsite: https://babylonbee.com/\nTwitter: https://twitter.com/thebabylonbee\nFacebook: https://www.facebook.com/TheBabylonBee\nInstagram: http://instagram.com/thebabylonbee", "link": "https://www.youtube.com/watch?v=EmM-owvWAdc", "date_published": "2022-08-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]