[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Destiny 2’s Exotic Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the Exotic guns from Destiny 2, including the universe-harnessing Graviton Lance, the Fighting Lion grenade launcher, and the infamous Rat King sidearm.\n\n00:00 - Opening\n00:49 - Arbalest\n02:15 - The Wardcliff Coil\n03:45 - Rat King\n05:31 - Devil’s Ruin\n06:32 - Fighting Lion\n08:46 - Bad Juju\n10:13 - Cloudstrike\n11:52 - Grand Overture\n13:33 - No Time To Explain\n14:48 - Crimson\n17:17 - Graviton Lance\n20:29 - Osteo Striga\n22:27 - Monte Carlo\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the Exotic guns from Destiny 2 and compares them to their potential real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=e1h3OcLOzKY", "date_published": "2022-08-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "I Heart Red Dead Redemption 2 (ft. Jake Baldino, Brandon Jones, and More!)", "description": "Red Dead Redemption 2, the prequel to Rockstar's beloved Red Dead Redemption, features a number of brand new faces - like Arthur Morgan, and plenty of familiar ones - like fan favorite John Marston. Red Dead 2 has become notable for its compelling characters and incredible story it weaves.\n#iheartgaming #reddeadredemption2 #rdr2 #reddead2 \n\nJoin Jake Baldino of gameranx, Brandon Jones of Easy Allies, Jared Petty of Kinda Funny, Gav Murphy of RKG, Lucy James of Giant Bomb, Cade Onder of ComicBook.com, DaveControl, plus Kurt Indovina and Jake Dekker of GameSpot as they discuss their love for Red Dead Redemption 2, and just how much the story and characters meant to them.\n\nJared Petty and Gav Murphy discuss how much they loved their horses, while Jake Baldino and Jared Petty talk about the leadership and eventual downfall of Dutch van der Linde. DaveControl, Gav Murphy, and Jake Dekker gush about their love for Arthur Morgan, while Lucy James and Kurt Indovina shudder in disgust at the thought of Micah, as Kurt revels in Arther and Micah's fight.\n\nMeanwhile, Brandon Jones and Jared Petty talk about how great it was to play as John Marston again during the game's epilogue. They all go over some of their favorite moments, including stumbling across a UFO in the game, getting drunk with Lenny, and the incredible plantation scene when the whole gang heads out to rescue Jack Marston.\n\nLet us know what future episodes you'd like to see, and what guests you hope to see on! And consider checking out our previous episodes on Dark Souls, Skyrim, Final Fantasy VII, Metal Gear Solid, and Resident Evil 4!", "link": "https://www.youtube.com/watch?v=_id8oiVPy74", "date_published": "2022-08-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Nintendo Won't Raise the Price of the Switch | GameSpot News", "description": "Sony's increasing the price of the PS5 in some regions, but Nintendo is firm it won't do the same for the Switch. Despite a rumor, Amazon is reportedly not buying EA; and Wo Long: Fallen Dynasty gets an all new trailer.\n\nSpeaking to Eurogamer, Nintendo's president said in a statement: \"we will determine our future pricing strategies through careful and continued deliberations,\" and do not have any plans to \"increase the trade price of its hardware.\" Instead, Nintendo is decreasing the size of Switch packaging to help with shipping issues, by making the cardboard box it comes in 20% smaller, which in turn will help the company's bottom line by using fewer materials. \n\nEarly this morning a report suggested that Amazon was set to announce an acquisition of Electronic Arts later today. However, it didn't take long for the report to be denied. After all, EA is reportedly pursuing a sale or merger, and is said to have had talks with Disney, Apple, Comcast, and, of course, Amazon. But as of now, there is no official news to report on of the behemoth developer/publisher being purchased at this time. \n\nSouls-like fans have been eating well recently, because today we got a trailer for Wo Long: Fallen Dynasty, a new Souls-like action game from Ninja Gaiden, Nioh, and Stranger of Paradise developer Team Ninja. The trailer is filled with sword fighting, Chinese martial arts, and otherworldly enemies and environments players will be exploring. \n\nHere's your friendly reminder that Destiny 2 and all its expansions are free to play until August 30. So if you've always been curious, now's a good time to dip your toes in.\n\nSTAMPS\n00:00 Intro\n00:16 Nintendon't Raise the Praise\n01:38 Amazon Isn't Buying EA\n03:16 Wo Lo: Fallen Dynasty Gameplay\n03:50 Destiny 2 is Free / Outro", "link": "https://www.youtube.com/watch?v=XTB6YUQlWZk", "date_published": "2022-08-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Saints Row Reboot is a Mess | GameSpot After Dark Ep 159", "description": "This week Jordan and Jake talk about the unfortunate state of the Saints Row reboot, Jean-Luc has been playing indie souls-like Thymesia and laundromat/arcade simulator Arcade Paradise, and we talk about the biggest announcements from gamescom.\n\n#gaming #saintsrow #gamescom #gamespotafterdark", "link": "https://www.youtube.com/watch?v=Cfy6cUPvYgA", "date_published": "2022-08-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Playstation 5 Gets a Price Increase | GameSpot News", "description": "The Playstation 5 gets a price increase, Lies of P gets a new gameplay trailer, and Battlefield 2042 gets a Season 2 update.\n\nSony Interactive Entertainment is increasing the price of the PlayStation 5 across various regions, citing global economic challenges and adverse currency trends as the primary reason. Sony Interactive Entertainment’s CEO Jim Ryan stated in a blog post that the price increase is going to affect all of Europe, the UK, the Middle East, Africa, Asia, and parts of North America. Due to the current strength of the dollar, The United States will not be affected by the change.\n\nLies of P, the newest entry in the Soulsborne genre got a 6 minute gameplay trailer today after being shown off at Opening Night Live. The gameplay looks to emulate that feeling directly with attacks and parries that also incorporate Pinocchio’s mechanical arm to shock or grapple enemies. Swords, hammers, and shields are your primary tools for bashing baddies. Developer Neowiz has not set a hard and fast release date yet, but expect to explore the desolate world of Lies of P in early 2023.\n\nEA and DICE have announced the first details on Battlefield 2042 Season 2. The sophomore season is called Master of Arms, and it's set for release on August 30 on all platforms. The new map, Stranded, players will fight for control of the ship, and can go inside it for close-quarters combat. We're also seeing the addition of a healer and support specialist who can revive and refill their gadgets. He also has a minigun. Additionally, Battlefield 2042 introduces a new feature called Assignments, which are progression tracks that allow players to unlock more weapons that were previously available only in Battlefield Portal.\n\nSTAMPS\n00:00 Intro\n00:10 PS5 Price Increase In Many Regions Outside the US\n01:10 I'm A Real SoulsBorne Game!\n02:17 Battlefield 2042 Season 2 Revealed \n03:04 Outro", "link": "https://www.youtube.com/watch?v=S2-AkVd-rgw", "date_published": "2022-08-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Warframe Styanax Official Anime Short", "description": "Warframe reveals the 50th Warframe Styanax, coming in the Veilbreaker Update in September. Revealed in this animated trailer “Ascension Day”, Styanax is inspired by the heroic warriors of ancient myth, a paragon of justice and the Lotus’ deadly spear. \n\nPrepare to command the battlefield with Styanax when he launches alongside our Veilbreaker update in September. Coming Soon to PC, Xbox, PlayStation, and Nintendo Switch!\n\n#warframe #gaming", "link": "https://www.youtube.com/watch?v=bSVwtO5i2UM", "date_published": "2022-08-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Wo Long: Fallen Dynasty Official Gameplay Trailer", "description": "Prepare yourself for the dark Three Kingdoms filled with demons and get a glimpse of some of the sword-based action rooted in Chinese martial arts, where actions flow gracefully between offensive and defensive maneuvers. \n\nCurrently in development for the Xbox Series X|S, Xbox One, PlayStation5, PlayStation4, and on PC via Windows and Steam®️. The game is scheduled to release in early 2023.", "link": "https://www.youtube.com/watch?v=b1E64Zt4CwU", "date_published": "2022-08-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]