[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Callisto Protocol Live Action TV Spot Trailer (Red Band)", "description": "Fear takes no prisoners in The Callisto Protocol’s live-action tv spot starring Josh Duhamel. Learn what it takes to survive Black Iron Prison when The Callisto Protocol launches December 2nd, 2022, on PlayStation, Xbox, and PC platforms.\n\n#callistoprotocol #gaming", "link": "https://www.youtube.com/watch?v=dUFpOpkTvqU", "date_published": "2022-11-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Warhammer 40,000: Darktide - Everything To Know", "description": "Warhammer 40K: Darktide is a first-person co-op shooter with gameplay similar to that of Warhammer Vermintide 2, developer Fatshark’s previous game.\n\nAt launch, you’ll have your pick of one of four classes. These include: \nThe Verteran Sharpshooter, a class that specializes in ranged combat. Sharpshooters start the game with a Kantrael Mk VII Lasgun as well as a standard-issue munitorum sapper shovel in case they need to get up close and personal. This class is a good choice against Elites and special enemies, has increased ammo capacity and can slow their movement for increased weak spot damage, accuracy and handling. \n\nThe Psyker Psykinetic, a class that can manipulate empyrean forces with their mind and use it to pop enemy skulls like balloons. Killing with this power, simply called Brain Burst, stores a Warp Charge that can be used to knock enemies away from them. However, Psykers are not just limited to their minds; they also get a Stub Revolver and a combat sword.  \nThe Zealot Preacher, a class that specializes in high-damage melee attacks: damage that increases based on their missing health. The Preacher is effective against armored enemies, has high melee attack speed, and can dash forward for the upper hand in combat. This class starts out with a combat axe as well as an autopistol. \n\nLastly, there's The Ogryn Skullbreaker, another melee focused class with increased damage in that category. They’re good against hordes, effective at staggering and suppression, and can revive teammates faster. The Skullbreaker starts the game with a pipe club and a Thumper.\n\nWarhammer 40,000: Darktide will release on PC via Steam and the Microsoft Store on November 30, 2022. The Xbox Series X|S version of the game does not have a release date at the time of this recording, however developer Fatshark stated the Xbox version “will launch shortly after PC.”\n\n#warhammer40k #gaming #gamespot", "link": "https://www.youtube.com/watch?v=0Hfi58Lpiq8", "date_published": "2022-11-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "14 MORE Things You STILL Didn't Know In Zelda Breath Of The Wild", "description": "This time in Breath of the Wild, we show some secret NPC interactions when fighting powerful enemies, what happens when you hit the armor limit, and how climbing stamina actually works.\n\nShield Jump Cancels in the Combat Glossary-\nhttps://docs.google.com/document/d/1qtYT06sxweRW3tRnovcCc-f4xIOGFNsD02pG1TzloHc/edit#bookmark=id.vgu1dn9i34s4\n\nVIDEO NOTES: In the video above, we cover 14 facts, tips and tricks that aren’t quite as well known, ranging from secrets to glitches, so  me that are pretty simple and others that are fairly complex. The Legend of Zelda: Breath of the Wild has been out for four years at this point, and players have found some amazing things, intended or not, that keep the game and its sense of discovery feeling fresh.\n\n#botw #breathofthewild #gaming \n\n0:00 Intro\n0:12 Breaking Ball Chains\n0:34 Frozen and Raw Skin\n0:54 ChuChu Shock Damage Tricks\n1:27 Shield Jump Cancel Tricks\n2:09 Hard Level 3 NPC Interactions\n2:54 Hateno Village Kids\n3:18 Kula The Korok\n3:36 Compendium Korok\n4:06 Armor Limit Interactions\n4:41 Vilia With Armor Limit\n5:04 Climbing Stamina Bug\n5:35 Equipment Development\n6:34 Weapon Elemental Pommels\n7:05 Zelda Error QA System", "link": "https://www.youtube.com/watch?v=0La8WLv28qI", "date_published": "2022-11-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "19 Things I Wish I Knew About DMZ In Call Of Duty: Modern Warfare 2", "description": "How to succeed at COD: M2 2’s  DMZ, including faction missions, collecting blueprints, strongholds, secrets, and best starting weapons. \n\nCall of Duty: Modern Warfare 2 has a sandbox mode called DMZ, where you can find many of the game's challenges and rare blueprints. The mode is different from the battle royale-focused Warzone 2.0 in that players can but aren’t forced to fight one another. You drop in, complete faction missions, chase rare blueprints and secrets or a weapon case, and collect gear to extract with. Leveling up faction missions opens up new protected weapon slots; otherwise, you lose all of your gear when you die. \n\nUltimately there’s a lot to learn in this mode and plenty of tips, tricks, and lesser-known techniques to escape, like a contract-based extraction option. So far, players have found ways to get a few high-value items like the M13 B from killing The Chemist in radiation zones, as well as the seven rewards for extracting the Weapon Case, including the Caution Tape RPK Weapon and Biohazard operator skin. \n\nIn this video, we’re going to give you 18 rapid-fire tips to succeed, which include what to pursue when starting off, how to extract, and when, how to ask more players to join you if your squad leaves, and how to be a team player by grabbing items like the medical pistol, 2-3 plate armor, and an ammo crate to give to your squad. We’ll cover the lesser-known extraction option with hostage rescue missions and what to pursue when starting off, like collecting junk and selling it at buy stations to purchase Stronghold key cards. If you die and suffer the two-hour cooldown on your protected weapon slot, we’ll show you how to reduce that time, such as extracting with expensive loot or finding dumpsters to deposit cash into. \n\nWe’ll cover some tips on how to find other players if you want to PvP and how to give yourself a better chance of not getting jumped. We’ll also cover some more obscure tips like reviving squadmates underwater, refueling vehicles while moving with gas cans, some good controller settings, and even how to attempt stealth. \n\nInfinity Ward’s Call of Duty: Modern Warfare 2 is out now on Xbox Series X|S, Xbox One, PlayStation 5, PS4, and PC. It includes Battle Maps, core and competitive multiplayer, Warzone 2.0, Spec Ops, and DMZ, with Raids still coming at a later date.\n\nTimestamps:\n00:00 - Intro\n00:22 - Know What You Want\n01:15 - You’re Not Stuck Being Alone\n01:33 - How To Be A Buddy!\n01:51 - There’s A Secret Extraction Option\n02:17 - First Things To Do (Junk and Armor)\n02:59 - The Bigger Rewards\n04:09- Exit Strategy\n04:30 - Best Gun On The Ground - RPK\n04:53 - Pack Extra Ammo\n05:06 - Dumpster Dive\n05:29 - You Can Interrogate In DMZ\n05:52 - You Can Refuel While Moving\n06:19 - Gun Farmer\n06:58 - Die Underwater Like A Champ\n07:24 - Don’t Wait For It\n07:57 - How To Tell Other Players Apart\n08:42 - Settings\n09:39 - Stealth\n10:09 - Protect The Extract\n\n#dmz #warzone2 #gaming", "link": "https://www.youtube.com/watch?v=Rg3m6JFfE34", "date_published": "2022-11-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Evil West Review", "description": "Evil West's kinetic combat thrills as you dismember vampires by the bucket load, but it's dragged down by level design that's both formulaic and repetitive. \n\nRichard Wakeling takes us through his thoughts on Evil West, the new game from developer Flying Wild Hog. Dive deep into the Wild West to fight vampires, werewolves, and other creatures of the occult. Does Evil West's robust and satisfying combat hold up enough to keep the fun going throughout the whole experience? Check out our video review to find out. Evil West is out on Xbox, Playstation, and PC.\n\nTimestamps:\n00:00 Intro\n00:19 Overview\n01:00 Story Breakdown\n02:07 Gameplay Breakdown\n04:13 Creatures of the Night\n05:43 Setbacks in Design\n06:31 Outro\n\n#gaming #evilwest #gamespot", "link": "https://www.youtube.com/watch?v=9IXAyBUH_Zs", "date_published": "2022-11-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "How To Get Shiny Pokemon In Scarlet and Violet", "description": "In this video Jake Dekker runs through some of the best strategies to find and catch shiny Pokemon in Scarlet and Violet.\n\nGetting Shiny Pokemon has never been easier in a mainline Pokemon game. Here are a few strategies that will significantly increase your odds of running into a shiny Pokemon in Scarlet and Violet.\n\nThere are multiple strategies that can help you find a shiny Pokemon and some strategies can be mixed and matched to further improve your odds. Most of these strategies revolve around Pokemon Outbreaks which can be found on the map.\n\nUsing these methods we managed to catch a few shiny Pokemon in under an hour.\n\nFor more on Pokemon Scarlet and Violet for the Nintendo Switch stayed to GameSpot.\n\n#gaming #gamespot #pokemon", "link": "https://www.youtube.com/watch?v=5fYTCzEaA1o", "date_published": "2022-11-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]