[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "How to contribute to open source software without coding skills!", "description": "Download Safing's Portmaster, or subscribe to the SPN, and take control of your network traffic: https://safing.io/portmaster \nGrab a brand new laptop or desktop running Linux:https://www.tuxedocomputers.com/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMastodon: https://mastodon.social/web/@thelinuxEXP\n\nPixelfed: https://pixelfed.social/TLENick\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\nThis video is distributed under the Creative Commons Share Alike license.\n\n\n00:00 Intro\n00:50 Sponsor: Monitor and secure your internet connection with Safing\n01:44 Just talk about it\n03:39 Writing documentation and tutorials\n05:30 Testing and reporting bugs\n08:03 Translations\n09:33 Providing Support\n11:14 Triage and project management\n12:26 Design, events, and more!\n14:00 Sponsor: Get a device with Linux preinstalled from Tuxedo\n\nOne of the first things you can do to help a project, is to talk about it.\n\nThat might seem dumb, but it's true: a lot of FOSS projects, Linux desktop included, lack notoriety. \n\nAnother way you can help a project more directly, is by writing documentation. A lot of projects are spearheaded by developers, understandably. And developers, while they're amazing a writing code, and developing features, and fixing bugs, do tend to not spend as much time actually explaining how things work. A lot of FOSS projects lack further documentation than a simple github readme file, and documentation is important.\n\nAnother great way of making sure your favorite app stays great is by testing and writing bug reports. The more you use an app, the more you're bound to find issues, small or big, that make your favorite project less usable, or detract from the experience.\n\nWriting a good bug report also requires a bunch of information on how you've encounter it, to let the developer reproduce it, and fix it.\n\nWhat you'll actually want to do is give as much information on the steps you took to encounter that issue, your specific system, any tweaks you might have made to the app, the expected behavior, and the actual behavior that seems bugged.\n\n\nTesting beta software is also super useful. The more configurations something is tested on, the less chance there is to have a big problem down the track. Most big projects, like KDE, GNOME, distributions, OBS, and others, have a beta track that you can follow.\n\nIf you speak more than one language, you can also help translate projects. Most FOSS project are in constant need of translations, for the new stuff they add, the stuff they change and tweak, or they just lack a translation in your language completely.\n\nIf all of that looks too time consuming, or too scary, you can also provide support for other users online.\n\nIf you have experience with a project or an app, your knowledge is invaluable: you know what the options are, where they are, you know how to use the thing, configure it, install it, and maybe fix a bunch of problems you've already encountered.\n\nBig projects receive a TON of bug fixes, feature requests, and general demands. And triaging this, making sure that the most urgent bugs are fixed first, and the most interesting features are done first, can be a pain when you have 300 issues open.\n\nA project manager can definitely help with that, to sort things into what's critical, what's easy to fix for beginner coders, what's really an edge use case, or even what's a desirable feature or not.\n\nAnd there are a ton of other ways to help. You could help design marketing material for events, like flyers posters, you could help redesign icons for a project, or even make mockups for new features you'd like to see.\n\nYou can also organize events, like Linux install parties, or help organize these. You can give talks to various events, help others install software on their devices, you can join the various telegram groups or servers to discuss new features,and give your input...", "link": "https://www.youtube.com/watch?v=FccdqCucVSI", "date_published": "2022-06-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]