[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Mivos Quartet: Tiny Desk Concert", "description": "Tom Huizenga | July 19, 2022\nAs the members of the Mivos Quartet began their sound check behind Bob Boilen's desk, I couldn't help but think of old violins — which need to be played regularly in order to keep sounding good. For me, that's what our Tiny Desk space is like; it needs to cradle musicians and their music. After almost 1000 performances here, the pandemic shuttered our doors and this Mivos concert marks just the second time since March 2020 that music has rung out from this space. Hearing it was enough to make me tear up.\n\nOf course, it helps to have extraordinary music, especially performed by these fine players who are devoted to contemporary music. They begin with \"Midnight Sun,\" a short movement from Robert Honstein's Arctic, written for Mivos in 2013. Its shimmering bright light and pulsating energy is inspired by photos taken above the Alaskan Arctic Circle in summer, when the sun never sets.\n\nHenry Threadgill's Sixfivetwo, from 2018, is something altogether different. You won't go away humming the music, but that's not the point. An open mind is what the composer is looking for. The textures here are translucent and colorful, with room for individual solos and duets – some are improvised, others are written out. \"We get to where we are because of exploration,\" Threadgill once said. \"That's why improvisation is so important.\"\n\nThe string quartet might be a 400-year-old recipe for music, but the Mivos Quartet proves that two violins, a viola and a cello are still a vibrant force, and a satisfying way to break in a unique space, relishing its music once again.\n\nSET LIST\nRobert Honstein: \"Midnight Sun\" (from Arctic)\nHenry Threadgill: Sixfivetwo\n\nMUSICIANS\nOlivia De Prato: violin\nMaya Bennardo: violin\nVictor Lowrie Tafoya: viola\nTyler J. Borden: cello\n\nTINY DESK TEAM\nProducer: Tom Huizenga\nAudio Recording & Mix Engineer: Josh Rogosin\nDirector: Kara Frame\nCreative Director: Bob Boilen\nSeries Producer: Bobby Carter\nEditor: Joshua Bryant\nVideographers: Kara Frame, Joshua Bryant, Pierre Kattar\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Jill Britton, Ashley Pointer, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #mivosquartet", "link": "https://www.youtube.com/watch?v=va8ZaKj27Xk", "date_published": "2022-07-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Inside Soccer Mommy's Widescreen World", "description": "Private, isolating thoughts have always been central in Sophie Allison's songs, but 'Sometimes, Forever' breaks new ground, using the studio to blow those feelings up to arresting scale. WNXP editorial director Jewly Hight speaks with Soccer Mommy's Sophie Allison at the Sonic Cathedral in Nashville, Tenn. \n\nMORE FROM NPR MUSIC\n\nRead Jewly Hight's profile on Soccer Mommy:\nhttps://www.npr.org/2022/07/18/1111768220/soccer-mommy-sometimes-forever-profile\n\nWatch Soccer Mommy's Tiny Desk concert: \nhttps://www.youtube.com/watch?v=KZk3eoAb6Ck\n\nCREDITS\n\nHost:\nJewly Hight\n\nProducers:\nLars Gotrich\nEmily Young\n\nEditor:\nDana Fretty\n\nVideographer:\nPreston Evans\n\nAudio Recording Engineer:\nGuy Fell\n\nVP, NPR Music:\nKeith Jenkins\n\nSenior VP, Programming:\nAnya Grundmann", "link": "https://www.youtube.com/watch?v=LBgpREkkfXY", "date_published": "2022-07-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]