[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "PopOS is SPECIAL, and I'm moving to it, here's why!", "description": "Download Safing's Portmaster, or subscribe to the SPN, and take control of your network traffic: https://safing.io/portmaster \nGrab a brand new laptop or desktop running Linux:https://www.tuxedocomputers.com/\n\n👏 SUPPORT THE CHANNEL:\nGet access to a weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYouTube: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n📹 MORE VIDEOS FROM ME\nLinux news in Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\nGaming on Linux: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nI'm also on ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n🏆 FOLLOW ME ELSEWHERE:\nTwitter : http://twitter.com/thelinuxEXP\nMastodon: https://mastodon.social/web/@thelinuxEXP\nPixelfed: https://pixelfed.social/TLENick\nDiscord: https://discord.gg/xK7ukavWmQ\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\nThis video is distributed under the Creative Commons Share Alike license.\n\n#linux #popos #review  \n\n00:00 Intro\n00:53 Secure your internet connection with Safing\n01:47 Installation: smoother, and simpler\n04:16 Cosmic: more than just a GNOME reskin\n06:19 Apps grid: a better implementation than GNOME's\n07:12 Launcher: good, but could be easier\n08:39 Workspaces: I prefer them on GNOME\n08:59 Gestures: it's not there yet\n11:37 Auto-tiling: made me love tiling my windows\n13:18 Software: it has EVERYTHING\n16:22 PopOS is awesome, and I'm keeping it\n17:58 Grab a laptop or desktop with Linux out of the box\n18:58 Support the channel\n\nWhat sets PopOS apart is the desktop experience. What they've done with the desktop is bring most features that GNOME packs into the Activities overview, into their own modules. By default, you have a dock, that can extend to the screen edges or not, you get a big applications launcher that opens as a window, not in full screen, and a dedicated WOrkspaces view, plus a launcher.\n\nThat's the good thing: YOU decide. All these tools definitely fill parts of the same function, and so you can pick which ones you want to keep, and which ones you don't.\n\nSame goes with the applications grid: you can open it with the Applications button in the top left, or the dock icon, or set the super key to open it. It opens in a window, so it doesn't block out your whole screen, and it's got a very nice folder implementation: instead of having folders inline with the rest of the apps, each folder you create has its own tab in the bottom, so it's way easier to navigate to one, although you do lose the drag and drop reorganization of apps, or folder creation. You need to click the create folder icon to create one.\n\nYou also get a launcher, which is probably the less accomplished tool implemented here .It can also search through files, recent documents, browse the filesystem, run a terminal command, perform calculations, do a web search, or even run an sh command.\n\nGestures on PopOS are a mixed bag. First, apart from the virtual desktop switching, they're not 1:1 gestures. Second, the gestures can't be configured.\n\nThere's also a very handy restore partition being created automatically, and you can update it straight from the settings.\n\nPopOS has a great system wide feature: it lets you switch from a regular window manager, with floating windows, to a tiling window manager that can be operated from the keyboard entirely. It's right there, up top in the panel.\n\nJust press SUper + Y, and all your windows automatically tile themselves in a sensible way. There, you can either the mouse to resize them, stack them on top of another to create tabs, or move them to a different position. Or use the keyboard to do the same, all shortcuts are explained right in the indicator panel.\n\nPopOS uses the PopSHOP, a graphical app based on the elementary OS appCenter, instead of GNOME Software.PopOS adds their own repos with a bunch of applications that aren't in ubuntu's repos, or are available as snap packages on Ubuntu, and they ship with flathub out of the box.\n\nPopOS also generally has more up to date internals, with more recent kernels than Ubuntu, more up to date mesa drivers, they don't limit themselves to just security updates, they do pull in the latest stable versions of a lot of the software stack.\n\nIt's also the only distro I used that has a good way of switching between integrated graphics and dedicated GPus on hybrid laptops.", "link": "https://www.youtube.com/watch?v=Cs4QRBm0C_8", "date_published": "2022-07-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]