[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New God of War: Ragnarok Story Details Revealed | GameSpot News", "description": "New story details for God of War: Ragnarok have been revealed, Rockstar opens 70+ new positions at various studio locations and Nintendo reveals the first free DLC for Mario Strikers: Battle League.\n#GamingNews #GodofWar #GTA \n\nThe official PlayStation Store page for God of War: Ragnarok has been updated, and it includes what appear to be new story details. The story description reveals that Kratos and Atreus will visit all Nine Realms as they seek out clues about a battle that could end the world. Further down on the page Sony shared a few more story details as well as a very brief tease of weapons and abilities. God of War: Ragnarok releases on November 9 for PS4 and PS5.\n\nRockstar currently has a huge list of job openings at its different studio locations. Rockstar New York is looking for a marketing manager for GTA Plus, the subscription service that launched for GTA Online back in March. Meanwhile Rockstar San Diego is looking for an associate designer for open world events. The rest of the list consists of all types of positions from animation to physics, mission design and more. So if you’ve ever dreamed of working for the dev, this might be the time to shoot your shot. \n\nToday Nintendo revealed the game’s first free update and confirmed two more are headed to the game before the end of 2022. This first update arrives July 21 and features Daisy, a technique type whose super strike move involves her summoning flowers and launching the other team into the air. And Shy Guy, an all-rounder whose super strike can turn him into a spinning projectile. But that's not all, this free update also features a new knight themed gear set and the Desert Ruin stadium. \n\nSTAMPS\n00:00 - Intro\n00:06 - God of War: Ragnarok\n01:07 - Rockstar Games\n02:00 - Mario Strikers: Battle League", "link": "https://www.youtube.com/watch?v=3U-2DbhzhVo", "date_published": "2022-07-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Stray - The First 20 Minutes 4K Gameplay", "description": "Watch the opening gameplay for Stray to find out how this poor cat has wound up lost and alone. Check out some of the cute things you can do with other cats including: playful high fives, meows, and more! You'll even get a glimpse at the beautiful opening cinematic of the game. In order to progress through the story you'll have to solve various puzzles to make your way through the city, and even run away from swarms in narrow dark alleys. \n\nYou will play as a stray cat who falls into a world fully inhabited by robots, machines and viruses. You're tasked with helping this cat find his way back home. You'll meet many robots along the way, some of which will help you along your journey so keep an eye out for them. This stray cat will be joined by a drone named B12, who will help you translate the language of the robots, store your personal items, give directions, assist you in battle, and helps light the way.\n\nStray is an adventure game developed by BlueTwelve Studio and being published by Annapurna Interactive.\nThe game is releases on July 19th, 2022 for PlayStation 4, PlayStation 5, and Windows. Stray will be available for PlayStation Plus Extra and Premium members on release.\n\n#gaming #stray #gamespot", "link": "https://www.youtube.com/watch?v=r9hvgj-LOQs", "date_published": "2022-07-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Stray Review", "description": "Stray expertly embodies the abilities of its feline protagonist to create a captivating puzzle adventure in an engrossing post-apocalyptic world.\n\n#stray #gaming #review", "link": "https://www.youtube.com/watch?v=pZTQliao_oo", "date_published": "2022-07-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "As Dusk Falls Review", "description": "Due to its strong script and pitch-perfect performances, Interior Night's debut stands among the very best games of its kind.\n\nA dusty motel in the middle of nowhere doesn't sound like a typical video game setting, but debut studio Interior Night, composed of industry veterans, uses this peculiar place to create a game unlike anything else you'll play this year. As Dusk Falls deftly explores themes of inherited hardship through the lens of two families who cross paths on one pivotal night. By way of incredible voice acting, a compelling and expertly written script, and a bounty of pause-worthy choices along the game's elaborate branching paths, it establishes itself as an instant classic in the narrative adventure genre.", "link": "https://www.youtube.com/watch?v=5DbNMJiNU7g", "date_published": "2022-07-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Warframe Devs Reveal New Game & Duviri Paradox Gameplay", "description": "Warframe devs announce a brand new game, Xbox & Activision Blizzard’s deal is getting closer to wrapping up and Xbox Game Pass gets new games for the remainder of July.\n\nWarframe developer Digital Extremes has announced a new game called Soulframe, a free-to-play action \"hybrid-MMORPG\" that is now in early development. Development on Warframe will continue as other members of the team switch to Soulframe. At TennoCon, Digital Extremes shared more footage of the open-world story expansion, The Duviri Paradox, and announced a new story expansion called Veilbreaker. It's still very early days for Soulframe, and there is no word yet on platforms or a release date.\n\nJuly 19, aka tomorrow, sees the arrival of three more games, beginning with the day-one new release As Dusk Falls for console, cloud, and PC. This is an interactive drama and the debut title from developer Interior Night, a team founded by Quantic Dream veterans. Also arriving on July 19 is Sins of a Solar Empire: Rebellion, along with Ubisoft's Watch Dogs 2 for console, cloud, and PC. On July 21, Xbox Game Pass will add the racing game MotoGP 22 for console, cloud and PC and the RPG Torment: Tides of Numenera for console and PC.\n\nIn March, the FTC asked for more information from Activision Blizzard and Microsoft to further review their acquisition deal. After the additional information is reviewed, the FTC will have 30 days to challenge the acquisition. If not, the deal can continue as planned.\n\nWe now know, thanks to VGC, that Microsoft has provided the FTC with the information it was looking for. However it's unclear if Activision Blizzard has yet provided the FTC with the proper information, if not, then the 30 days to challenge the acquisition will be put on hold until Activision Blizzard shares the requested information. Once the FTC closes the investigation, the deal will be one step closer to being finalized.\n\nSTAMPS:\n00:00 - Intro\n00:10 - Soulframe & Warframe\n01:05 - Game Pass\n01:30 - Microsoft & Activision\n02:18 - Star Wars: Hunters", "link": "https://www.youtube.com/watch?v=dE7yoRVSf7c", "date_published": "2022-07-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]