[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Desks of the 2022 Tiny Desk Contest", "description": "The first rule of the Tiny Desk Contest is simple: All entry videos must include a desk. If they didn’t, how would we know artists are up to the task of performing behind the Tiny Desk if they win?\n\nWe watched each and every one of the thousands of entries to this year’s Contest. We saw big desks, small desks, crafty desks, desks in unexpected places and desks that tested the limits of what exactly a desk is. Here are the best of those desks in one supercut video.\n\nWatch all the entries and learn more about the Tiny Desk Contest: https://npr.org/tinydeskcontest. \n\nSong: “Ain't No Need to Wonder” by Speak Easy\n\n#tinydesk #tinydeskcontest", "link": "https://www.youtube.com/watch?v=EzaF16C8WPw", "date_published": "2022-04-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "The Linda Lindas: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nMarissa Lorusso | April 11, 2022\nA library might not be the first place that comes to mind when you picture a suitable venue for a punk band — unless, of course, you're thinking about The Linda Lindas, who shot to viral stardom after a performance in the Los Angeles Public Library's Cypress Park Branch last year. For the band's Tiny Desk (home) concert, the teen punks returned to the library — this time, playing at the Los Angeles Central Library — with several members even sporting buttons that pledge love to the LA library system. \"We're playing the library once more,\" guitarist Lucia de la Garza says with a smile, in awe of the \"cool space.\" (It feels fitting — after all, having artists perform an intimate, powerful set under daytime office lights is kind of the Tiny Desk's whole thing.)\n\nThe four members of The Linda Lindas – sisters Mila de la Garza and Lucia de la Garza, their cousin Eloise Wong and their family friend Bela Salazar – first played together in 2018, as members of a new-wave cover band put together by Kristin Kontrol of Dum Dum Girls. Soon after that, they formed their own punk group, going on to open for artists like Bikini Kill, Alice Bag and Best Coast.\n\nIn the band's Tiny Desk (home) concert, each of the members — all between 11 and 17 — take turns singing, starting with \"Growing Up,\" the title track to the band's debut album, sung by guitarist Lucia. After a couple upbeat tracks sung by drummer Mila and bassist Wong about friendship and frustration, the band is joined by an additional percussionist. \"We put an advertisement in the library a few days ago,\" Lucia jokes, before introducing Spencer Lere of the band Bleached (who is also, Mila points out, her drum teacher) for a surfy track sung in Spanish by guitarist Salazar. The band ends its set with the scorching \"Racist, Sexist Boy.\" Co-written by Mila and her cousin, it's the song that first caught the internet's attention with its powerfully righteous anger about a racist incident Mila experienced in the early days of the pandemic. \"Here we go — let's blow the roof off,\" Lucia says dryly just before the final song — but given how hard these four rock, you'd be forgiven for thinking she's not joking at all.\n\nSET LIST\n\"Growing Up\"\n\"Talking to Myself\"\n\"Why\"\n\"Cuántas Veces\"\n\"Racist, Sexist Boy\"\n\nMUSICIANS\nLucia de la Garza: vocals, guitar\nMila de la Garza: vocals, drums\nBela Salazar: vocals, guitar\nEloise Wong: vocals, bass\nSpencer Lere: percussionist\n\nCREDITS\nVideo: Ryan Baxley, Mario Framingheddu\nAudio: Carlos de la Garza, Scott Cornish, Harriet Tam\nCamera: Ryan Baxley, Mario Framingheddu\nEditor: Ryan Baxley\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Joshua Bryant\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Kara Frame, Maia Stern, Michael Zamora, Ashley Pointer\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #thelindalindas", "link": "https://www.youtube.com/watch?v=USdiumz1ZFM", "date_published": "2022-04-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]