[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Mythbusting: Linux apps SUCK and they SLOW Linux growth", "description": "Get 100$ credit for your own Linux and gaming server: https://www.linode.com/linuxexperiment \n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\nYou can also protect your privacy by using this extension from Startpage, each install helps the channel with a small commission: https://add.startpage.com/en/protection/?campaign=4&source=aff \n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:33 Sponsor: Get 100$ off your Linux or gaming server\n01:25 Bad UI or Bad UX?\n05:59 Webapps are king\n07:48 Apps don't matter\n10:09 Things aren't perfect\n12:05 Parting Thoughts\n13:53 Sponsor: Get your Linux laptop or desktop\n14:33 Support the channel\n\nUser Interface is the visual part of the application. User Experience is the user-friendlyness of the application.\n\nWhat people mean when they say that Linux apps have bad UX, generally when talking about alternatives to popular programs, like LibreOffice, Gimp, or Inkscape, what they mean is generally \"I couldn't use it after a few minutes\".\n\nOf course you're not going to be proficient with a completely different application after a few minutes.\n\nTake a look at LibreOffice. The first launch offers tips to help you use it. They offer you a choice of user interface, to let you get something close to what you know. That's good user experience: you cater to the user. Inkscape has a nice guided wizard everytime you open it, to help you create a new project. That's also good user experience.\n\nIn terms of User interface, it's more subjective, but I don't think anyone would say that LibreOffice chose a terrible way to place their buttons and controls: either it's a menubar and toolbars, or a ribbon. In both cases, the most used features are front and center, use standard icons that people are used to. Same goes for GIMP, or Inkscape. These applications don't have bad UI, or bad UX. They're just not familiar to people.\n\nTHE most used app on any OS is the web browser, by the vast majority of people. And Linux HAS all the web browsers you might want, whether it's Chrome, Blue Chrome, Orange Chrome, Red Chrome, Microsoft Chrome, or Firefox.\n\nEven if all the Linux apps were terrible, you still have the exact same web browsers that people are used to, and that's the only app that matters in most cases. Native apps are less and less relevant, and as such, the quality of Linux apps really doesn't have any impact on the popularity of Linux.\n\nI'd also argue that the applications themselves don't matter, not just because most people work in a browser, but also because we have way bigger blockers to Linux adoption than the quality of our applications.\n\nLinux has a notoriety problem, not a quality problem. The vast majority of people don't know that Linux exists, or only know about it on servers, or as a weird name linked to Android. They don't know, and don't care that it exists, because that's not what shipped on their computer, and they often don't even know they could REPLACE what shipped on their computer.\n\nThe biggest blocker for Linux adoption is hardware availability.\n\nOf course, things aren't perfect. I'm not going to stand there and tell you that we have apps for every niche, or that every single one of our apps is great. Or even that our good apps are perfect for everyone. That's not the case.", "link": "https://www.youtube.com/watch?v=0fJQ-EoQauE", "date_published": "2022-04-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]