[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Farruko: Tiny Desk Concert", "description": "From Sept. 15 through Oct. 15, Tiny Desk is celebrating Latinx Heritage Month with an El Tiny takeover, featuring Jessie Reyez, Susana Baca and more musicians from all corners of Latinidad.\n\nFi O'Reilly | October 14, 2022\nLast year, Farruko's song \"Pepas\" felt almost omnipresent. The bacchanalian party anthem for getting trashed at the club seemed to blast out from every passing car and bodega I walked by. But since releasing the song, Carlos Reyes aka Farruko, has undergone a spiritual transformation, even renouncing the song's message and taking the time to focus on his family and his developing relationship with God.\n\nHis Tiny Desk reflects this new perspective. At NPR HQ, Farruko adapted his quintessential flow to a much more intimate setting, one that highlights the striking pivot from the party-filled lifestyle described in so much of his earlier catalog. Instead of musings on drugs, perreo and excess, he opens his set with \"En La Mía (Remix)\" — an introspection on the healing power of music and faith — before moving onto a (revised) rendition of \"Pepas,\" that concentrates on the limitations of fame and staying true to yourself.\n\nHe emphasizes the importance of counting your blessings in \"No Entienden,\" reflecting on past mistakes in \"My Lova\" and the new track \"Viaje\" and spreading positivity in \"Gracias (Remix).\" It's an ideal send-off for this year's Latinx Heritage Month — blessings por nuestras herencias and hope for the future.\n\nSET LIST\n\"En La Mía (Remix)\"\n\"Pepas\"\n\"No Entienden\"\n\"My Lova\"\n\"Viaje\"\n\"Gracias (Remix)\"\n\nMUSICIANS\nCarlos Reyes aka Farruko: vocals\nArmando Sanchez: guitar\nKeriel Quiroz: keys\nJuan Diaz: drums, percussion\nFranie Laracuente: vocals\nAaron Gonzalez: vocals\n\nTINY DESK TEAM\nProducers: Anamaria Sayre, Bobby Carter\nDirector: Kara Frame\nEditors: Maia Stern, Joshua Bryant\nAudio Engineer: Andie Huether\nAudio Mix: Josh Rogosin\nCreative Director: Bob Boilen\nVideographers: Kara Frame, Joshua Bryant, Michael Zamora\nProduction Assistant: Jill Britton\nAudio Assistant: Hannah Copeland\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer, Fi O'Reilly\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#eltiny #tinydesk #nprmusic #farruko", "link": "https://www.youtube.com/watch?v=xNm2JuN2WLQ", "date_published": "2022-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]