[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Minutes of Dead Space Remake Gameplay", "description": "Dead Space Remake looks as spooky as ever, and now with a fresh coat of paint in this remake. Check out 10 minutes of gameplay from the 2nd and 3rd chapter of the campaign!\n\n#deadspace #gaming", "link": "https://www.youtube.com/watch?v=pVcE0EIjJL0", "date_published": "2022-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "11 Minutes Of Warhammer 40,000 Darktide Psyker Gameplay (Closed Beta)", "description": "The Warhammer 40,000: Darktide closed beta is showing off new classes including Psyker, Ogryn, and Sharpshooter. In this gameplay clip we're showcasing an early run with the Psyker Class who are magic-users specializing in crowd control. \n\n#gaming #warhammer40k  #gamespot", "link": "https://www.youtube.com/watch?v=nHH-FMyRJTI", "date_published": "2022-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dead Space 14th Anniversary Livestream", "description": "Get an extensive look at Dead Space Remake with Creative Director Roman Campos-Oriola and Senior Producer Philippe Ducharme as they celebrate this important 14th anniversary.\r\n\r\n#deadspace #gaming", "link": "https://www.youtube.com/watch?v=eAP5t5JH61c", "date_published": "2022-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dead Space Remake vs Original Comparison", "description": "The Dead Space remake is looking to overhaul and change the original 2008 horror classic. From graphical improvements, rewritten dialogue, and new gameplay mechanics. This video highlights some of the biggest changes we found in chapters 2 and 3. Please keep in mind the game is still in development and anything we show here is subject to change.\n\n #deadspaceremake #gamespot #gaming", "link": "https://www.youtube.com/watch?v=f4AxFohd0c8", "date_published": "2022-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Good News For Modern Warfare 2 Players On Console | GameSpot News", "description": "Activision clears up the Call of Duty: Modern Warfare 2 phone number requirement and Gotham Knights confirms a 4-Player mode.\n#GamingNews #CallofDuty #ModernWarfare2  \n\nActivision has clarified the SMS requirement for Call of Duty: Modern Warfare II, confirming that a phone number is required for PC players but not on console. This confirmation comes not long after another Activision Blizzard game, Overwatch 2, made headlines for its own controversial SMS policy.\n\nIn a blog post, Activision said a \"text-enabled mobile phone number\" is required for Modern Warfare 2 on PC. This is the same requirement that has been in place for Warzone players on PC since May 2020. Anyone who previously played Warzone on PC won't have to do anything else to get started with Modern Warfare II and Warzone 2.0. Additionally, people on Steam must link a phone number to play Modern Warfare II, so this requirement is not limited to Battle.net alone.\n\nActivision also provided an update on the efforts it's taking to fight cheating in Modern Warfare II and Warzone 2.0. Activision's Ricochet anti-cheat system will be available at launch for Modern Warfare II and Warzone 2.0, and it will be beefed up with \"better detection capabilities, additional access to develop and deploy new mitigation techniques, and expanded freedom to update our security more frequently than ever before.\"\n\nAnd lastly, let's talk about Gotham Knights. The upcoming brawler set in the Batman universe will get a proper four-player co-op mode in late November, a little over a month after the game's October 21 release. Called Heroic Assault, the mode will be added to Gotham Knights as a free update on November 29 and is entirely separate from the main story campaign.", "link": "https://www.youtube.com/watch?v=U9vVW2yUoxU", "date_published": "2022-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Scarlet and Pokémon Violet | Meet Bellibolt!", "description": "Iono’s partner Pokémon is Bellibolt, the EleFrog Pokémon! \n\nBellibolt expands and contracts its body to generate electricity in an organ that looks like a belly button. Electricity is then discharged from the two bumps on either side of its head that resemble eyeballs.\n\n#PokemonScarletAndViolet #Pokemon #Bellibolt #Frog", "link": "https://www.youtube.com/watch?v=IG0PhvqWNdA", "date_published": "2022-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Scorn Review", "description": "Scorn, a game with notable visual influences from H.R. Giger and Zdzisław Beksiński is finally out after around 8 years of since its first kickstarter. But, was this creepy bio-horror filled world worth the wait?\n#scorn #scorngame #gamespot\n\nScorn is primarily an exploration puzzle game, with most of its gameplay revolving around searching the game's grotesque environment for clues, all while witnessing a number of horrors and disgusting visuals. Your nameless character is on a quest with no forward-facing explanation, so it's up to you to interpret the meaning of your quest and the world around you.\n\nWhile Scorn mostly focuses on exploration and puzzle solving, with the environments themselves often times lending themselves to the puzzles, there are also FPS elements, with your character finding multiple weapons they can use to hold enemies at bay. Of course, like most horror games, ammo is limited, and the enemies are overpowered, meaning you'll want to avoid these encounters at all costs.\n\nWhat is there to discover in Scorn, and how is the game? Check out Alessandro Barbosa's review here to see if it's worth your time to take a trip into the world of Scorn.", "link": "https://www.youtube.com/watch?v=I81ZTVPHFl8", "date_published": "2022-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "We Played 3 Hours of The Dead Space Remake", "description": "We got hands-on with the first three chapters of the Dead Space remake, and there is a lot to talk about.\n\nThis has been a long time coming. We’ve known about the Dead Space remake for a while now, but outside of dev live streams showing early footage and the recent trailer, we haven’t seen all that much. Until now. A few weeks ago press got hands-on with the first 3 chapters of the game, equating to about 3 hours and boy is there a lot to talk about.\n\n#deadspaceremake #gamespot #gaming #deadspace", "link": "https://www.youtube.com/watch?v=IE_bmSwxoV4", "date_published": "2022-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "8 Horror Games To Play on Steam Deck", "description": "We’re going to go over some of the best horror games to play right now on your Steam Deck. Here are the conditions: the game has to run well on Deck and it has to be a good fit for the handheld/on-the-go experience.\n#Gaming #SteamDeck #PCGaming\n\nSpooky season is in full swing and what better way to celebrate than to play some scary games. It's also a great time to visit pumpkin patches or haunted houses, so while you travel, why not take those games with you. The Steam Deck is the perfect way to play all those scream inducing experiences while on-the-go. \n\nThis list consists of games like Dead Space, a survival-horror game in which you play as Isaac Clarke, an engineer sent to repair a ship’s communication system after it mysteriously goes offline. Unfortunately for him, that repair job quickly turns into a battle for survival when he finds the ship is a floating human slaughterhouse. \n\nDying Light 2: Stay Human which takes place 15 years after the events of the first game. In it you play as Aiden Caldwell, a member of a group of freelance runners and you’re on a quest to find your sister Mia.\n\nAnd Let’s be honest, there are a lot of Resident Evil games out there and at this point in the series they could have a Steam Deck video all to themselves. So for this list we’re just going to focus on the latest release, Resident Evil Village. The game picks up 3 years after the story of Resident Evil 7 and continues to focus on Ethan Winters. After rescuing his wife Mia from the Baker house–spoilers–and subsequently getting saved by Resident Evil franchise mainstay Chris Redfield–extra spoilers–the couple try to restart their lives in Europe. One thing leads to another and you, aka Ethan, find yourself drowning in another crazy trauma inducing situation.\n\nTimestamps\n0:00 Intro\n0:15 Dead Space\n2:10 Dying Light 2: Stay Human\n3:15 Bioshock\n4:10 The Quarry\n4:59 Alien Isolation\n5:49 Resident Evil Village\n6:44 The Evil Within\n7:33 The Little Nightmares 1 & 2", "link": "https://www.youtube.com/watch?v=YjAxqbzRnYE", "date_published": "2022-10-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Bayonetta 3 The Witching Hour Official Trailer", "description": "Fight your way through the streets of Tokyo, the mountains of China, and many other locales! Along the way you’ll meet a virtual coven of Bayonettas, each more fabulous than the last. You’ll also slash and slay as Viola, a feisty witch in training who fights with a sword and a capricious companion, the demon Cheshire. Find out what fate awaits Bayonetta, and if this arcane alliance can really save reality!\n\nBayonetta 3 is coming on 10/28!\n\n#bayonetta3 #nintendo #gaming", "link": "https://www.youtube.com/watch?v=ViAmnhbfaXk", "date_published": "2022-10-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War Ragnarök Official Next Gen Immersion Trailer", "description": "Experience next gen immersion in God of War Ragnarok on PS5 and journey through the nine realms in stunning 4K. Feel your journey in the palms of your hands with the haptic feedback and adaptive triggers of the DualSense wireless controller and pinpoint every sound with 3D Audio.\n\n#godofwarragnarok #godofwar #gaming", "link": "https://www.youtube.com/watch?v=XwP1L10zVrQ", "date_published": "2022-10-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Elden Ring Maps Teased In Latest Update? | GameSpot News", "description": "Elden Ring may be getting new locations and ray tracing according to a new report, Plus, Steam’s mobile app gets a major update.\n#GamingNews #EldenRing #Steam \n\nElden Ring was the loudest game in early 2022, but in the past couple of months From Software have been fairly quiet. However now the game has a new patch available that rebalances PvP, lays the groundwork for a wider PvP reshuffle and has added hidden references to new maps. If the back to back use of ‘player vs player’ didn’t give it away, Patch 1.07 is almost exclusively multiplayer-focused. The biggest change is the addition of separate damage scaling for PvP battles, a change that the game's community has lobbied for since its release. As for the tease of new locations, prolific Souls hacker Lance McDonald claims this patch also adds references to maps that aren't in the game yet on a raw code level. It also adds some code that appears to be related to ray-tracing options that don't exist yet in the options menu, either.\n\nThe Steam Mobile App has gotten a complete aesthetic overhaul and a bunch of new features to boot, including new login options and remote downloads. As in previous releases, the Steam Mobile App enables two-factor authentication on Steam. However, more login options are now available, including scanning a QR code with your phone in the app or sign in confirmation. You can now also customize notifications, enabling you to receive notice whenever a game on your wishlist goes on sale or you get a friend request.", "link": "https://www.youtube.com/watch?v=-RcKcQnKBC8", "date_published": "2022-10-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 Review", "description": "Overwatch 2 improves upon the core gameplay and characters fans love, but loses some of its predecessor's spirit in the process.\n\n#overwatch2 #gamespot #gaming", "link": "https://www.youtube.com/watch?v=jqQF7f7YE5c", "date_published": "2022-10-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sonic Frontiers | Official 4K Combat & Upgrades Overview", "description": "Check out the brand-new combat and upgrade systems in Sonic Frontiers - available for pre-order today!\n\nIn Sonic Frontiers, you'll need every tool at your disposal to defeat the powerful enemies that await you on the Starfall islands. Luckily Sonic came prepared! With new, upgradeable combat abilities, you have more options than ever before to approach battles YOUR way. Use all of these skills and more to become the most formidable force on the frontier!\n\n#Sonic #SonicFrontiers", "link": "https://www.youtube.com/watch?v=HmaBXzBIgAs", "date_published": "2022-10-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Starfield Q&A with Todd Howard", "description": "We know you have questions about Starfield. What is the character traits system like? Is Starfield hard sci-fi? In this video, Game Director Todd Howard responds to some of the community’s questions, including questions about games that inspired him while creating Starfield, customization, Starfield’s persuasion system and more.\n\nStarfield arrives exclusively on Xbox Series X|S and PC in 2023. Play it day one with Xbox Game Pass.\n\nFOR CURRENT CONSTELLATION MEMBERS:\nGo to starfieldgame.com to get access to an exclusive Constellation Questions channel on the Bethesda Game Studios Discord (https://discord.gg/BethesdaStudios). Submit your own questions for a chance to have them answered by Starfield’s development team in future installments of Constellation Questions.\n\nFOR NON-CONSTELLATION MEMBERS:\nJoin Constellation at JoinConstellation.com today to get access to an exclusive Constellation Questions channel on the Bethesda Game Studios Discord (https://discord.gg/BethesdaStudios) where you can submit your own questions to Starfield’s development team. You can also ask on social media using #starfieldquestions, and you may see them answered in future videos.", "link": "https://www.youtube.com/watch?v=V2CNxilbX1o", "date_published": "2022-10-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]