{"entries": [{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC9lKBRxxsDIarUmNaPe0h0Q", "link": "https://www.youtube.com/watch?v=EiJxEsGE7Mk", "title": "The new world reserve currency (will KILL the US dollar) - BRICS", "date_published": "2022-10-13 15:01:16+00:00", "description": "✉️ OUR NEWSLETTER: https://www.abundantia.co/\n📚 OUR COURSE/MEMBERSHIP: http://jointheorder.co/\n\nThis will be the world's new reserve currency, and probably end the U.S. dollar forever. Have you heard about BRICS? Well if not, you'll likely be hearing a lot more about them in the near future.\n\nBRICS stands for Brazil, Russia, India, China, and South Africa, and is an economic alliance of nations designed to be a direct competitor to the G7. Comprising the world's most powerful developing economies, BRICS is currently making some big moves to create a new form of money, which is likely designed to topple the US dollar from its spot.\n\nEconomics and finance are complicated subjects. However, it's clear to see from these early pros and cons just how powerful a BRICS currency would be. And how likely, it could easily remove the economic superiority of the United States, and the West as a whole.\n\nI'd love to hear your thoughts down below.\n\n0:00 - The US dollar is over\n0:34 - The G7 rules the world's money\n1:43 - BRICS and its new money\n4:50 - How BRICS money would work\n6:53 - When Libya threatened the Euro\n9:01 - Some final thoughts\n\n► IMPORTANT LINKS:\nEnter your email via the link below for free weekly lessons and insights into becoming financially free, investing, global tax and corporate structures, passports, residencies, and more.\nJOIN: https://www.abundantia.co/\n\n► SOCIAL MEDIA:\n• Abundantia Instagram: @abundantia.co https://www.instagram.com/abundantia.co/\n• Sorelle's Instagram: @sorelleamore  https://instagram.com/sorelleamore\n• Leon's Instagram: @leonhill  https://instagram.com/leonhill\n• Abundantia Twitter: https://twitter.com/abundantiaco\n• Abundantia Facebook: http://facebook.com/abundantiafinance\n\nSorelle and Leon.\nFounders, Abundantia\n\nLiability Disclaimer: https://www.abundantia.co/disclaimer\n*We may earn a commission if you buy any products or services via the links in this video's description. This video is not investment, financial, or legal advice. It may be incorrect, outdated, inaccurate, or reflect personal opinions. This video is for entertainment purposes only.\n\nPresented by Sorelle Amore.\nWritten by Leon Hill.\n\n#BRICS #ReserveCurrency #Putin", "persistent": false}], "source url": "https://www.youtube.com/feeds/videos.xml?channel_id=UC9lKBRxxsDIarUmNaPe0h0Q", "source title": "Sorelle Amore Finance"}