[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New PS5 Model Spotted In Australia | GameSpot News", "description": "A lighter PS5 has quietly hit the shelves in Australia and Sony announced its plans to buy another studio.\n#GamingNews #GameSpot #PS5 \n\nNew PS5 console models have launched in Australia, and similar to previous PlayStation iterations of the past, they bear new model numbers. These new editions--the CFI-1202B digital console and the CFI-1202A disc console--don't have any  cosmetic changes but are lighter than the previous builds.\n\nIn other Sony news, PlayStation has now acquired yet another big studio. Sony Interactive Entertainment today announced plans to buy Savage Game Studios, a mobile studio based in Finland and Germany, that is currently working on a AAA live-service game for mobile. Whether or not this game will be a PlayStation franchise or a new IP remains to be seen.\n\nAnd while we’re on the subject of mobile games don’t forget we’re hosting our first ever Mobile show, Swipe, on September 8 at 10am PT / 1pm ET.\n\nThe showcase will feature a wide variety of games from different genres, and you can expect exclusive trailers and gameplay videos, game reveals, and new details on upcoming live-service game updates. Some of the major publishers and developers confirmed for the show include: Activision, Apple Arcade, EA, Netflix, Ubisoft and more. \n\nAlongside all of this, you can look forward to in-depth coverage here on GameSpot, providing a further look into all of these exciting games. With improvements to mobile phone hardware and the advent of mobile gaming controllers, there's never been a more exciting time to play games on your phone, whether it's a full-fledged version of what you'd find on consoles in Genshin Impact or a mobile-specific creation like we've seen from franchises such as PUBG, Call of Duty, or Rocket League.\n\nSTAMPS\n00:00 - Intro\n00:06 - New PS5 Model\n01:46 - Sony New Studio\n02:28 - Swipe Mobile Showcase", "link": "https://www.youtube.com/watch?v=rmKEEF7AXls", "date_published": "2022-08-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Complete THE LAST OF US Timeline Explained!", "description": "Within the space of 2 and a bit games, and a tie-in comic, The Last of Us franchise covers quite a lot of ground. From its heartbreaking opening moments all the way through to Part 2’s epic tale of revenge, there’s a huge amount of twists and turns across its extensive timeline that spans well over 25 years. \n\n00:00 - Opening\n00:39 - 2013\n02:13 - 2032\n03:21 - Summer 2033\n06:11 - Late Summer 2033\n07:15 - Fall 2033\n08:48 - Winter 2033\n10:11 - April 28 2034\n12:13 - April 28 2034 (Abby)\n13:17 - Summer 2034\n14:04 - 2035\n15:13 - 2036\n16:08 - December 2037\n16:35 - March 2038\n18:57 - Summer 2038\n20:32 - Summer 2038 (Abby)\n24:03 - Early Summer 2039\n25:17 - Mid-Summer 2039\n26:14 - Late Summer 2039\n26:49 - Ending\n\nWith The Last of Us Part 1 out, alongside a new TV adaptation, what better time to reacquaint yourself with Naughty Dog’s stellar survival series.\n\nTimeline Playlist - https://www.youtube.com/watch?v=0xHZFaybvZE&list=PLpg6WLs8kxGN7aotOq-B5tYZWpvTZ3KRS", "link": "https://www.youtube.com/watch?v=3gaFRoP4RUA", "date_published": "2022-08-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "SAS Soldier Breaks Down Clean House Mission in Call of Duty: Modern Warfare - Expert Reacts", "description": "Mark \"Billy\" Billingham served in the British SAS for over 17 years. He was responsible for planning and executing strategic operations across the world, and has led countless hostage rescues.\n\nSince leaving the military he has worked as both a celebrity bodyguard,  appears on Channel 4's \"SAS: Who Dares Wins\", \"SAS Australia\", and has just released his latest book \"Survive To Fight\".\n\nToday he's joining us to break down and react to Modern Warfare 2019's iconic SAS Clean House mission.\n\nYou can find more of Billy Billingham as well as his book here:\n\nFacebook: www.facebook.com/MarkBillinghamSAS\nTwitter:  https://twitter.com/billingham229b\nInstagram: https://www.instagram.com/billingham22b\nTikTok: https://www.tiktok.com/@billy_billingham\nWebsite: https://www.markbillybillingham.com/\n\nBilly's new book (UK): https://cnet.co/3ANEl6O\nBilly's new book (US): https://cnet.co/3R8rdOT\n\nIntro: 00:00\nScenario: 00:41\nGate breach: 01:45\nHouse Entry: 03:12\nMoving to first floor: 04:42\nMoving to second floor: 06:41\nBreaching and clearing room: 08:32\nMoving to third floor with hostage: 09:51\nTop floor of house: 12:01\nFinal breakdown: 14:20", "link": "https://www.youtube.com/watch?v=IRR_ohGXTEg", "date_published": "2022-08-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]