[{"source": "https://www.jefftk.com/news.rss", "title": "Historical Notes on Charitable Funds", "description": "<p><span>\n\nIn the EA movement people will sometimes talk about charitable funds\nas if they are a new idea.  For example, the recent </span>\n\n<a href=\"https://www.givingwhatwecan.org/\">Giving What We Can</a> post\n\"\n\n<a href=\"https://www.givingwhatwecan.org/why-we-recommend-funds\">why\nwe recommend using expert-led charitable funds</a>\" (\n\n<a href=\"https://forum.effectivealtruism.org/posts/wHyvkwpwCA4nm46rp/why-giving-what-we-can-recommends-using-expert-led\">forum\ndiscussion</a>) opens with:\n\n\n\n<p>\n\n</p>\n\n<blockquote>\nFunds are a relatively new way for donors to coordinate their giving\nto maximise their impact.\n</blockquote>\n\n\n\n<p>\n\nThere's a bit of a cute response that would be fun to write, except\nthat it isn't quite true:\n\n</p>\n\n<p>\n\n</p>\n\n<blockquote>\n\nDonating through a fund that is able to put more time and effort into\nevaluating charitable options is not a new idea, and is very natural\nif you're thinking along EA lines. In fact, the idea goes back at\nto the last time people tried to invent effective altruism, <a href=\"https://www.jefftk.com/p/scientific-charity-movement\">150 years ago</a>. While that\neffort has been through a few names over time, at this point you know\nit as the <a href=\"https://en.wikipedia.org/wiki/United_Way\">United\nWay</a>.\n\n</blockquote>\n\n\n\n<p>\n\nWhile this does have elements of truth, it implies historical\nmotivations were more similar to current ones than they really were.\nAs usual, history is much more nuanced.\n\n</p>\n\n<p>\n\nThe United Way is not a single grantmaker which will direct your money\nto wherever they think it will do the most good.  Instead, it's a\ncollection of local organizations, each responsible for their\nimmediate community.  This organizational structure reflects one of\nthe larger differences between the <a href=\"https://www.jefftk.com/p/scientific-charity-movement\">Scientific Charity Movement</a>\nand effective altruism: the former had a strong local focus, while EAs\npush for spending money wherever the impact is largest.  This\nstructure also comes from how the United Way grew out of the <a href=\"https://en.wikipedia.org/wiki/Community_Chest_(organization)\">Community\nChest</a> movement, where each city had their own Community Chest fund.\n\n</p>\n\n<p>\n\nComing from a modern EA perspective you might guess that the\nmotivation was to improve the allocation of money within a city, even\nif not between cities: instead of individuals needing to assess\ncompeting community charities, a central fund could weigh their needs\nand make informed tradeoffs.  But reading about the development of\nCommunity Chests (ex: <a href=\"https://www.jstor.org/stable/3004812\">Burleson 1926</a>, <a href=\"https://www.jstor.org/stable/2569895\">Todd 1932</a> and <a href=\"https://www.jstor.org/stable/2569896\">discussion</a>, <a href=\"https://www.google.com/books/edition/_/7pyFuWNyuyQC\">Seeley\n1957</a>) the core problem Community Chests were solving was\nduplicative fundraising.\n\n</p>\n\n<p>\n\nFor example, Todd (1932) writes about a \"federation of givers who were\ntired of miscellaneous appeals, and banded together for common\ndefense\" and \"this motive of protection against miscellaneous\nsolicitation on the one hand, and against serving in a constant\nsuccession of philanthropic 'drives' on the other, is still dominant\".\nInstead of competing, charities could band together and more\nefficiently (and less annoyingly!) fundraise jointly.  This also let\nthese campaigns fill a role similar to the war effort fundraising of\nthe 1910s, where they were widely seen as legitimate and democratic, a\nsafe way for wealthy residents and business owners to contribute.\n\n</p>\n\n<p>\n\nI do see a small amount of discussion on how centralized funding might\nimprove allocation, but it's pretty minor compared to fundraising\nscale, and it's mostly seen as a potential opportunity, not something\ncurrently done well:\n\n</p>\n\n<p>\n\n</p>\n\n<blockquote>\n\nOne of the arguments frequently offered for organizing a community\nchest is that it would give the directors of social agencies time to\nconsider the proper spending of their resources instead of having to\nput in all their time in raising money. That is to say, the\ncompetition would be shifted from finance to standards of performance.\nNot all communities have by any means reached such an ideal\nlevel. ... The process of accommodation frequently takes the form of\ncompromise.  In order to secure, as large a constituent membership as\npossible, the promoters of the community chest will admit agencies\nwhose standards may not measure up to the best levels of social work\nin the community. (Todd, 1932)\n\n</blockquote>\n\n\n\n<p>\n\nAnd:\n\n</p>\n\n<p>\n\n</p>\n\n<blockquote>\n\nThe Community Chest with its centralization of finance has a unique\nopportunity to set up machinery for gathering the information\nconcerning the community and concerning the work of the agencies,\nwhich would provide a more adequate basis for the social work of the\ncommunity.  I am quite aware that this is no new idea. A number of the\nchests have already made some excellent beginnings in setting up these\nresearch bureaus, under one form or another. And there is rather\ngeneral lip service to the importance of fact-finding. Perhaps the\nthirteen or fourteen years which represent the period of development\nof the Community Chest movement, is too short a time in which to\nexpect the creation of elaborate research departments. (North, 1932)\n\n</blockquote>\n\n\n\n<p>\n\nOther places where we see a similar kind of centralized allocation are\nlarge multi-focal charities (<a href=\"https://en.wikipedia.org/wiki/Catholic_Charities_USA\">Catholic\nCharities</a>, <a href=\"https://en.wikipedia.org/wiki/Oxfam\">Oxfam</a>, <a href=\"https://en.wikipedia.org/wiki/International_Rescue_Committee\">IRC</a>,\n<a href=\"https://en.wikipedia.org/wiki/American_Red_Cross\">Red\nCross</a>, etc).  These are different in structure in that a lot of\ntheir funding goes to running their own programs instead of\nregranting, though they do some of both.\n\n</p>\n\n<p>\n\nThe history of charitable funding is complex, and I've only touched on\nit here.  But I do think EAs should be cautious about talking about\ncharitable funds as if they're something we invented.  Instead, I\nthink they're better viewed as another iteration in a long history of\nfundraising and allocation.\n\n  </p>\n\n<p><i>Comment via: <a href=\"https://www.facebook.com/jefftk/posts/pfbid02JUdzorMzK7g1dXMQQ9azsJMCyqGCGESRuTHPkgyQaNmuVWnr1ADqbRYVvQo6LaZDl\">facebook</a>, <a href=\"https://lesswrong.com/posts/J2vBCAiDcfNe4vyX3\">lesswrong</a>, <a href=\"https://forum.effectivealtruism.org/posts/9Axdtzusq9wSKixEZ\">the EA Forum</a>, <a href=\"https://mastodon.mit.edu/@jefftk/109457991954861854\">mastodon</a></i></p>", "link": "https://www.jefftk.com/p/historical-notes-on-charitable-funds", "date_published": "2022-12-04 08:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]