[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Breaks Down Different AK Variants - Loadout", "description": "From the classic AK-47 and AKM rifles through to reproductions like the Chinese Type-56, our favourite shooters have featured plenty of the iconic Russian firearm. In this bonus episode of Loadout, Keeper of Firearms & Artillery Jonathan Ferguson breaks down and compares a variety of different AK rifles.\n\nIn this episode of Loadout, Dave Jewitt visits the Royal Armouries to talk to Keeper of Firearms & Artillery Jonathan Ferguson about the iconic AK-47 and its different variants.\n\nYou can check out more episodes of Loadout right here. - https://www.youtube.com/watch?v=yzSrmGkpWKk&list=PLpg6WLs8kxGMzIemU1gyyLmg5VlKI2UvC\n\nYou can check out our Firearms Expert Reacts series here. - https://www.youtube.com/watch?v=5FVzcoRjoN4&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/", "link": "https://www.youtube.com/watch?v=mrKoaValItk", "date_published": "2022-12-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Star Wars Jedi: Survivor Release Date Revealed Early? | GameSpot News", "description": "According to a Steam page that has since been changed, Star Wars Jedi: Survivor will be released in March 2023.\n#GamingNews #StarWarsJediSurvivor #TheGameAwards\n\nAccording to a previous report, Jedi: Survivor's release date is scheduled to be officially announced during The Game Awards this week. A new trailer for the game will also be shown at the event. \n\nAnd the potential release date isn’t the only thing that the Steam page revealed, there were also images that showcased the pre-order bonuses for different versions of the game. These items include some new looks for Cal and BD-1, new Lightsabers and possibly the most exciting addition: different Blaster sets. In Jedi: Fallen Order, Cal didn’t have a gun in his loadout, however it looks like this time around that will change. \n\nGuess we’re just going to have to wait for the Game Awards for confirmation. Lucky for us, Thursday is right around the corner so we won’t have to wait long. On top of that, we won’t have to watch it for very long either as Geoff Keighley has confirmed that The Game Awards 2022 will be much shorter than last year's showcase.\n\nDuring a recent Twitter Spaces talk, Keighley discussed the upcoming ceremony and answered some questions about what to expect. The Game Awards is usually filled with not only award presentations, but interviews with developers and trailers for brand-new games. Last year's pre-show lasted around 30 minutes while the main event went on for 3 hours. During the Spaces talk Geoff said, \"I won't say anything officially until we're through our rehearsals but we think it's going to be significantly shorter.\"", "link": "https://www.youtube.com/watch?v=r1aJJyopODs", "date_published": "2022-12-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Witcher 3 PS4 vs PS5 Next Gen Update", "description": "Here's side-by-side gameplay of The Witcher 3: Wild Hunt running on the PlayStation 4 and PlayStation 5 with ray tracing.", "link": "https://www.youtube.com/watch?v=ieLbOS0ExQU", "date_published": "2022-12-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Witcher 3's Next Gen Upgrade Looks Incredible", "description": "The Witcher 3 is back with a fresh coat of paint. We had a chance to check it out, and it looks and plays better than ever. Jake and DeVante talk through their thoughts after an extended preview.\n\nThe Witcher 3: Wild Hunt originally came to PC, Xbox One, and PS4 back in 2015. It is widely considering one of the best games of that generation, and now it's getting a next-gen update for PS5 and Xbox Series S|X.\n\nThis version adds two modes: Performance and Ray Tracing. Both settings look great, but the Ray Tracing mode utilizes some subtle ray tracing techniques to enhance the visuals even more.\n\nThe Witcher 3: Wild Hunt - Complete Edition is out on December 14 as a free upgrade.\n\n#witcher #gamespot #gaming", "link": "https://www.youtube.com/watch?v=7pWykIsXp6k", "date_published": "2022-12-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "AK-47: Pop Culture's \"Bad Guy\" Gun - Loadout", "description": "The AK-47 is easily both the most famous and infamous firearm in all of the world’s history. With over 100 million made, its appearance in over half a century of cinema, and its place within the hands of players in hundreds of video games, the Avtomat Kalashnikova model of 1947 is undeniably the most recognisable weapon ever made.\n\nWith the help of Jonathan Ferguson, Keeper of Firearms & Artillery at the Royal Armouries Museum in the UK, we chart the AK-47’s journey, from its post-WW2 creation through to its huge pop culture footprint as the quintessential Hollywood “bad guy gun”.\n\n0:00 - Intro\n01:02 - Origins of the AK-47\n02:30 - Misnaming the AK\n04:02 - Different Variants\n06:11 - AK-47 In Pop Culture\n09:18 - AK-47 In Gaming\n16:04 - Ending\n\nIn this episode of Loadout, Dave Jewitt visits the Royal Armouries to talk to Keeper of Firearms & Artillery Jonathan Ferguson to chat about the legendary AK-47 rifle, its history and production, and its mammoth pop culture footprint.\n\nYou can check out more episodes of Loadout right here. - https://www.youtube.com/watch?v=yzSrmGkpWKk&list=PLpg6WLs8kxGMzIemU1gyyLmg5VlKI2UvC\n\nYou can check out our Firearms Expert Reacts series here. - https://www.youtube.com/watch?v=5FVzcoRjoN4&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/", "link": "https://www.youtube.com/watch?v=l42zG5H7QPw", "date_published": "2022-12-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dragon Age: DreadWolf Official In-Game Cinematic Trailer", "description": "To celebrate Dragon Age Day, we get an in game cinematic trailer. The in-game cinematic is a work in progress and not actual gameplay. Dragon Age: Dreadwolf is releasing on PlayStation 4, PlayStation 5, Xbox One, Xbox Series S|X, and PC.\n\n#dragonage #ea #gaming", "link": "https://www.youtube.com/watch?v=zLESu_aChMU", "date_published": "2022-12-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite Chapter 4 Season 1 Official Launch Gameplay Trailer", "description": "We finally get to see some gameplay from Fortnite Chapter 4 Season 1. In it we see the Doom Slayer in action, as well as Geralt of Rivia, and even Midoriya from My Hero Academia. Find out what's to come in the latest chapter of Fortnite tomorrow on December 4th!\n\n#fortnite #geralt #myheroacademia #doom", "link": "https://www.youtube.com/watch?v=Daf1uUXE3-M", "date_published": "2022-12-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]