[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "STOP RECOMMENDING DISTROS, recommend DESKTOPS instead!", "description": "Download Safing's Portmaster for FREE, or try their SPN, and take control of your network traffic: https://safing.io/portmaster\n\n150€ off the Slimbook Executive ultrabook with code executive-laptop-nick-friends: https://slimbook.es/en/executive-en\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:37 Sponsor: Monitor and secure your internet access with Safing\n01:19 Desktop Environments\n02:57 Distros are NOT their desktop\n05:01 The DE creates the first impression\n06:40 The distro still matters\n09:33 Sponsor: 150€ off your Slimbook Executive Ultrabook\n10:00 Support the channel\n\n\n\nLet's begin with a quick refresher: a desktop environment is the compilation of all programs that are going to make your graphical desktop.\n\nLinux has plenty of these desktops environments, and the choice of that desktop environment is what is going to make or break your first experience with Linux.\n\nOk, so desktop environments are important. But why are they more important than the distribution?\n\nWell, the first thing is most people conflate a distribution and its default desktop environment. This only works for one distro, and that's elementary OS, because their desktop environment and the experience they provide isn't really available in other distros.\n\nIn some cases, I'd say the changes that have been added are enough to turn these customizations into another desktop entirely. Other changes are really not that important, like what Ubuntu adds on top of GNOME, or the Manjaro GNOME version. So, virtually any desktop implementation from a distro, can be replicated onto any other distro. Which means that the distro itself doesn't really matter for the graphical experience.\n\nWhat makes the experience good, or bad, is the desktop environment. We could argue that the implementation of it, or the stability of the distro's base could play a role, but it's really minor compared to the experience with the desktop, and its default programs.\n\nOn top of that, you can install almost all desktops on almost all distributions, whatever the default desktop you picked.\n\nFor someone who's already familiar with Linux, distros DO matter, quite a lot, just as the philosophy of the distro itself, the personal preferences, the experience we had with various other distros... It's all important.\n\nFor a beginner, these elements do not matter at all. Someone starting with Linux won't care about BTRFS or ext4, about systemd or not systemd, about using flatpaks, snaps, or legacy packaging formats, like RPMs and DEBS.\n\nBeginners will rarely, or at least SHOULDN't HAVE TO interact with these elements of their system. They should use graphical solutions that abstract all of these differences for them, and make them basically irrelevant.\n\nWhat we should recommend to beginners is a desktop environment first: do they prefer the look and feel of KDE? GNOME, Pantheon, Cinnamon, or something else? Once they've decided on that, then they can be guided towards a distribution, even though they could pick any that uses that desktop, and they would probably be fine.", "link": "https://www.youtube.com/watch?v=DJ_4hfuidG0", "date_published": "2022-02-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]