[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Omicron reducing intensive care admissions", "description": "Big time, (at least in the UK, not so much in the US)\n\nCases down, but not necessarily infections\n\nConfirmed government case data is missing thousands of LFT results, leading to massive under-reporting. \n\nThis subtle but important change in behaviour, highlights the importance of having multiple methods to track COVID in the population,\n\nWe saw a similar rebound and second peak during the Delta wave as people relaxed more and children went back to school. \n\nhttps://www.icnarc.org/Our-Audit/Audits\n\nhttps://www.icnarc.org/our-audit/audits/cmp/reports\n\nCDC data\n\nhttps://www.cdc.gov/mmwr/volumes/71/wr/mm7104e3.htm\n\nThree dose protection against omicron\n\nED and urgent care encounters, 82% compared to unvaccinated\n\nCovid associated hospital admission, 90%\n\nTim Spector\n\nhttps://www.youtube.com/watch?v=MUfjJ1z-a6s\n\nReinfection\n\n7 to 8 % of cases had delta or alpha\n\nAssociation Between 3 Doses of mRNA COVID-19 Vaccine and Symptomatic Infection Caused by the SARS-CoV-2 Omicron and Delta Variants (21 Jan 2022 JAMA)\n\nhttps://jamanetwork.com/journals/jama/fullarticle/2788485\n\nPrior receipt of 3 mRNA vaccine doses was reported for 18.6% (n = 2441) of Omicron cases, \n\napproaching  200,000 new cases a day, \n\nhospitalisations, ICU cases and deaths are still coming down,\n\nas Omicron is less severe in a vaccinated population. \n\nIt seems many are, again, preempting the end of the COVID-19 pandemic. \n\nIt’s much too early for this.\n\nHigh case rates will likely be with us until late spring before the warmer weather and the summer holidays help reduce infections again. \n\nand shows the power of the citizen scientists that log with ZOE every day. \n\nhttps://covid.joinzoe.com/post/uk-back-to-200-000-a-day\n\nhttps://coronavirus.data.gov.uk/details/healthcare\n\nNorthern\n\nI am a retired RN. Over the last several weeks I have had many friends and family come down with Covid, including myself. \n\nWe all weathered it fine except for one, 61 y/o female relative. \n\nShe developed pneumonia and ended up in hospital for 3 days. \n\nThankfully, she is home now with oxygen PRN. \n\nBut....she is the only one who is morbidly obese, type 2 diabetic with poorly controlled blood sugar. \n\nTo me, that says a lot about risk.\n\nPitchfork\n\nAs a kid in grade school in Boston during the 1970s and 1980s, I remember that there were always about 3 or 4 kids who had weight problems in my class. \n\nWhen I was a substitute teacher from about 2000-2008, more than half of the students in any given class had weight problems. \n\nThis problem has been trending in the wrong direction for decades in the US. \n\nExacerbated by cheap, unhealthy fast food, and sedentary lifestyles.", "link": "https://www.youtube.com/watch?v=n3SBrVWL1dw", "date_published": "2022-02-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Denmark ends pandemic", "description": "A tale of two countries New Zealand and Denmark\n\nhttps://www.ft.com/content/83084cfd-61f0-4d12-8292-1ad4d06fa211\n\nGradually reopen borders to citizens, workers and international travellers\n\nThousands of New Zealanders remain stranded abroad\n\nFull reopening to non-citizens in October.\n\nDenmark\n\nhttps://www.telegraph.co.uk/global-health/science-and-disease/land-covid-now-no-worse-cold/?WT.mc_id=e_DM1543364&WT.tsrc=email&etype=Edi_GHS_New_Daily&utmsource=email&utm_medium=Edi_GHS_New_Daily20220202&utm_campaign=DM1543364\n\nPut an end to all coronavirus-related laws. \n\nDanish government\n\nVirus, no longer deemed a critical threat to society\n\nNo longer a legal obligation to self-isolate if positive\n\nBA.2 omicron now dominates infections in Denmark\n\nTyra Grove Krause, director of infection preparedness, (infectious diseases agency SSI)\n\nThere was nothing for it but to let omicron run through the population\n\nWith omicron, it is impossible to stop the spread of infection, even with severe restrictions\n\nNatural immunity and vaccinations,\n\nsend cases down by middle of February\n\nAs far as community health is concerned, \n\nCovid is now on a par with the common cold.\n\nMichael Bang Petersen, professor political science and government advisor\n\nThroughout the pandemic, our data shows that the key worry of Danes is not their own health, but overwhelmed hospitals\nEpidemiology in Denmark has not been politicised.\n\nSocial consensus and trust in government have been Denmark’s hallmarks. \n\nIf you have a strategy based on trust and solidarity, then you can actually open up with a relatively broad agreement, \n\nwhere the vulnerable and the elderly are accepting of the risks\ntaking on a personal responsibility, \n\nallow younger groups to live life as normal again.\n\na trade-off based on data\n\nYou could say that a lot of young people have been showing solidarity with the elderly throughout the pandemic, \nand now the elderly are showing some solidarity with the younger generations\n\nSøren Brostrøm, Danish Health Authority\n\nI’m keeping my sights on the seriously ill, \n\nand looking at figures for inpatients in intensive care units\n\nwhich, by the way, have just kept falling and falling and are now incredibly low\n\nWe have sky-high immunity in the population, \n\npartly due to our large vaccine acceptance, but also from the wide spread of omicron\n\nThis also means that we will start to see the back end of this\nProf Lone Simonsen, epidemiologist, Roskilde University\n\nI think that this is the last sort of lockdown-crazy pandemic wave\n\nHaving gone through two, three, four pandemic waves,\n\nwhich is normal for recent historical pandemics,\n\nI imagine Covid control will soon be similar to that of seasonal flu\n\nDear John,\nOne of the factors you might not fully appreciate from outside the states is how really poor our “health care system” (or lack thereof) in United States is.\n\nWe are well known for some fantastic institutions, but only the very well off and very well insured are sure of good care.  \n\nMany people have insufficient or no health insurance.  Many of our hospitals are run like businesses, by cutting staff and costs with no consideration for quality of patient care.  \n\nMany people with comorbidities don’t get them controlled because they can’t afford the doctor visit, or the tests, or the time off work, or the actual medications.\n\nI’m sure you’ll agree that a covid patient with controlled hypertension or diabetes will have better chances of a good outcome than a patient with uncontrolled comorbidities.\n\nOur unfortunate political priorities, I believe, created many bad outcomes.\n\nRN, MA\n\nDMN\n\nMy family knows a lot of people who've died from Covid. A lot. \n\nAt least 12 people. Varying ages from 30-70's and the one thing they all had in common was either/and obesity and high blood pressure. \n\nThe US is incredibly unhealthy, particularly in the South and in poorer areas. \n\nIt seems almost no one is mentioning this as not only a pandemic but an epidemic of very, very bad health. You can go into a Walmart or Target in east texas and I am not exaggerating as much as 75% of the people you see are obese. \n\nNot thin. Not normal. \n\nNot overweight. \n\nObese.\n\n\nhttps://www.medrxiv.org/content/10.1101/2022.01.28.22270044v1\n\n\nA LITERATURE REVIEW AND META-ANALYSIS OF THE EFFECTS OF LOCKDOWNS ON COVID-19 MORTALITY", "link": "https://www.youtube.com/watch?v=B2qSrcq-Jz0", "date_published": "2022-02-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]