[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite New Maps Catalyst & Breaker Are Very Different | GameSpot News", "description": "Halo Infinite’s new season 2 maps have been revealed, Kingdom Hearts 4 director explains Sora’s realistic design, and Hideo Kojima Reacts To Sony Acquisition Rumors. \n#GamingNews #Halo #KingdomHearts\n\nHalo Infinite Season 2: Lone Wolves will be here in just a few weeks, and 343 Industries has revealed the two new maps Spartans will be murdering each other on. Named Catalyst and Breaker. Halo Infinite Season 2 kicks off on May 3 and also comes with two new armor cores and a new battle pass.\n\nKingdom Hearts IV looks set to introduce a few graphical changes to the long-running series, which includes a more mature look for protagonist Sora and other updated visual tweaks. In a new interview with Famitsu that was translated by VGC, series creator Tetsuya Nomura spoke about these changes and the world of Quadratum, which serves as an afterlife of sorts.\n\nPlayStation Studios recently updated its first-party studios banner to include Sam Bridges, the protagonist of Death Stranding, a PlayStation console exclusive. Kojima posted the banner himself onto his Twitter account without providing any further context, fueling rumors that Sony may have acquired Kojima Productions.\n\nSTAMPS\n00:00 - Intro\n00:07 - Halo Infinite Maps\n01:33 - Kingdom Hearts 4\n02:56 - Kojima Reacts", "link": "https://www.youtube.com/watch?v=qLiZh-6R_6s", "date_published": "2022-04-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 Sojourn Official Gameplay Reveal Trailer", "description": "Check out how Overwatch 2's latest hero Sojourn plays in this brand new trailer. She is a damage hero that uses a Railgun with a primary and alt fire, has a power slide, and her Ultimate Overclock. Check out her moveset in this trailer. \n\n#Overwatch2", "link": "https://www.youtube.com/watch?v=Ag8Fiwz3-9I", "date_published": "2022-04-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Aiming System That Broke Weird West", "description": "Weird West is a game built on giving the player as much control as possible, and a lot of that is thanks to its innovative aiming system. An aiming system that also derailed the game's development.\n\nWeird West is a game about giving the player full control over how they tackle any situation so they can craft their own story. That also means giving the player the freedom to shoot absolutely everything. For the game's director Raphaël Colantonio (co-director of Dishonored and director of Prey), freedom and control are the core principles of designing an immersive sim. However, one year into the game's development, developer WolfEye Studios realized that the aiming system they had intended for the game contradicted Raphaël's design philosophy. What was meant to be a few weeks of development, turned into a six-month nightmare. \n\nThis is the story of the aiming system that broke Weird West, and how it eventually led to a shift in 3D twin-stick-shooters.\n\n#WeirdWest", "link": "https://www.youtube.com/watch?v=mf2gyaXd4LA", "date_published": "2022-04-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "20 Minutes of Warhammer 40,000: Chaos Gate - Daemonhunters Gameplay", "description": "Warhammer 40,000 Chaos Gate - Daemonhunters blends the gameplay of strategy classics like XCOM, with the massive world of Warhammer 40k.\n\nWe get to see how these worlds collide as the Grey Knights take on the forces of Nurgle in this 20 minutes of gameplay.\n\nThe reboot of the 1998 game Warhammer 40,000: Chaos Gate is set to be released 5 May 2022.", "link": "https://www.youtube.com/watch?v=-ABW0a8AT4o", "date_published": "2022-04-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Chrono Cross Original vs Remaster Graphics Comparison", "description": "How does the recent Chrono Cross: The Radical Dreamers Edition stack up to the original PlayStation release? Spoilers, a lot.\n\n#ChronoCross", "link": "https://www.youtube.com/watch?v=JUr2NcJZnwM", "date_published": "2022-04-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Elder Scrolls Online: High Isle Preview Livestream", "description": "Tune in for a preview of the next chapter in the Elder Scrolls Online, High Isle.", "link": "https://www.youtube.com/watch?v=FSUCwoLCJ0o", "date_published": "2022-04-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "When Cyberpunk 2077's Expansion Releases | GameSpot News", "description": "Cyberpunk 2077’s expansion release window is revealed during a CD Projeckt earnings call, Call of Duty Warzone teases monsters coming to season 3, could be Godzilla,  and XCOM 2 is free on the Epic Games Store. \n\nAs part of CD Projeckt’s latest earnings call, the studio revealed that Cyberpunk 2077's highly anticipated expansion will not arrive until sometime in 2023. An official tweet concluded by saying “Please stay tuned for more details coming later this year.” The company also revealed a whole list of what it's working on for the rest of 2022 that include the recently delayed updated version of Witcher 3 and the next Witcher game in Unreal 5. \n\nActivision released the first Call of Duty Season 3 teaser that introduced new operators and the \"Classified Arms\" seasonal theme for Vanguard and Warzone. The trailer ended with the roar of an unknown creature potentially teasing a season of monsters. Call of Duty's monstrous Season 3 is scheduled to start on April 27.\n\nFrom now until April 21 at 8 AM PT / 11 AM ET, you can claim XCOM 2 and Insurmountable on the Epic Games Store.\n\nSTAMPS\n00:00 - Intro\n00:08 - Cyberpunk 2077 Expansion\n00:31 - CDPR 2022 Production Plans\n01:23 - CDPR Sales\n01:50 - Warzone Monsters\n03:03 - Free On Epic Games Store", "link": "https://www.youtube.com/watch?v=lmE7PbWJosA", "date_published": "2022-04-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]