[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "A Plague Tale: Requiem Feels Very Familiar", "description": "A Plague Tale: Requiem's story and characters have a lot of potential, but the gameplay feels a bit lacking so far.\n\nRequiem takes place shortly after the first game and is set in 14th century France during the Bubonic Plague, at the outset of the Hundred Years' War. Although both games are set in a realistic depiction of France, the story often flirts with gothic supernatural elements. This is easily one of the coolest things about Innocence and Requiem, and what sets it apart from most third-person adventure games. The world is so wonderfully detailed and everything has a macabre sheen to it.\n\nA Plague Tale: Requiem comes to PC, PlayStation 5, and Xbox Series S and X on October 13. Be sure to keep an eye out for our review in the coming weeks.", "link": "https://www.youtube.com/watch?v=amcWrQGUwMg", "date_published": "2022-09-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Avatar Reckoning Dev Update Trailer | Disney & Marvel Games Showcase", "description": "Avatar Reckoning is an action packed MMO RPG shooter. You'll customize your own Avatar warrior, and set out through single player missions on Pandora. Additionally, there's PVE and PVP modes, either fighting against other forces, or each other.\n\n#avatar #d23expo #gaming", "link": "https://www.youtube.com/watch?v=NrfYpK5IpGo", "date_published": "2022-09-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 - What Does Redemption Look Like?", "description": "Battlefield 2042 is looking for redemption starting with new maps and guns and eventually getting to a specialist rework. Let’s see where Battlefield 2042 could be in its redemption story. \n#gaming #gamename #gamespot #battlefield #bf2042 #2042 #specialists #DICE #redemption #season2 #stranded #newmap #exodus #conquest #battlefieldportal \n\nRedemption in Video Games has sadly become a more common story in the modern era with live-service models allowing unfinished games to ship broken or with questionable business practices. But with that model also comes patches, and support for games post-launch that can eventually get games into a state where we no longer regret having spent our money. With enough time and support, like No Man’s Sky, Diablo 3, Destiny, and countless others did eventually turn it around. \n\nFor Battlefield 2042 to redeem itself, it needs to embrace its positives and double down on them while cutting its losses on things that are too far gone to completely rework within a reasonable time. Before all of that, a clean-up phase is necessary to tackle bugs, and some soul-searching is needed to see just what the identity of Battlefield 2042 should be. Does it strive to reach its original ambitions, or does it chart a new path with a potentially new audience. Be sure to drop a like and pop into the comments if there are other games you think have a shot at redemption, or if you’re interested in hearing about the redemption stories of other games.", "link": "https://www.youtube.com/watch?v=DVyyO7zqE1E", "date_published": "2022-09-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Disney & Marvel Games Showcase Livestream", "description": "Tune in to the Disney & Marvel GAMES SHOWCASE for announcements, trailers, and reveals for new and upcoming games from Marvel Games, Disney, Pixar, Lucasfilm, and 20th Century Studio.\r\n\r\n#gaming #marvel #disney", "link": "https://www.youtube.com/watch?v=R25VBJemceY", "date_published": "2022-09-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Disney & Marvel Showcase Full Presentation", "description": "Check out the full presentation for the Disney & Marvel showcase. We got glimpses at a Disney Dreamlight Valley, Disney Speedstorm, Disney Mirrorverse, Marvel Midnight's Sun, Avatar Reckoning, a new look at Disney Illusion Island, Marvel Snap and a brand new look at an unannounced title coming from Sky Dance Media that has Captain America and Black Panther.\n\n0:00 Introduction\n0:20 Tron Identity Reveal Teaser\n1:22 Disney Illusion Island\n2:56 Marvel Midnight Suns\n6:09 Strike Force\n7:01 Marvel Snap\n8:41 Aliens Dark Descent\n9:34 Lego Star War The Skywalker Saga\n10:28 Monkey Island\n11:41 Disney Classic Games Collection\n12:08 Disney Mirrorverse\n13:27 Disney Speedstorm\n15:50 Disney Dreamlight Valley\n17:41 Avatar Reckoning\n18:48 Unannounced Marvel Title from Skydance Media\n20:17 Marvel World of Heroes", "link": "https://www.youtube.com/watch?v=KQb48JB0ODg", "date_published": "2022-09-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Disney Dreamlight Valley Toy Story Trailer | Disney & Marvel Games Showcase", "description": "Disney Dreamlight Valley sees Toy Story coming its way into the game coming out this life sim game this upcoming Fall.\n\n#disney #dreamlightvalley #gaming", "link": "https://www.youtube.com/watch?v=Ijpy1RK1n4k", "date_published": "2022-09-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Disney Mirrorverse Villains Trailer | Disney & Marvel Games Showcase", "description": "Oogie Boogie is seen wrecking havoc until the villain Ursula shows up... as a hero? More villains were also shown in this trailer for the upcoming villains of Disney Mirrorverse coming in October.\n\n#disney #mirrorverse #gaming", "link": "https://www.youtube.com/watch?v=PC3QVTY6QmM", "date_published": "2022-09-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Disney Speedstorm Trailer | Disney & Marvel Games Showcase", "description": "Disney characters strap-in to race against one another in Disney Speedstorm. In this all new trailer, a Monsters Inc. track was shown off, featuring signature characters like Sullivan and Wazowski. \n\n#speedstorm #disney #gaming", "link": "https://www.youtube.com/watch?v=FKJaZV3up4w", "date_published": "2022-09-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "I Forced Myself To Play Only Mobile Games", "description": "Mobile games are a prominent market in the video game space, filled with millions upon million of players, but Kurt Indovina isn't one of them. However, that's about to change.\n#gaming #gamespot #mobilegaming  \n\nIn an effort to learn about the vast mobile game market, Kurt locked his consoles up (to eliminate all temptations to play the games he knows and loves) and forced himself to only play mobile games for a week. \n\nFor seven days, Kurt went without his Xbox Series S, PlayStation 5, Nintendo Switch, and 3DS, and relied on his iPhone as his sole game console. With no context where to start, he threw himself in the deep end in an attempt to understand the appeal of mobile games, and, quite possibly, find his next favorite game. \n\nKurt was familiar with the big games like PUBG, Genshin Impact, Call of Duty, and Diablo Immortal, but he was on a mission to find hidden gems; the games that take advantage of the phone in creative and unconventional ways. And, to his surprise, he found more than just a few games he loved, but formed an entirely new perspective on mobile gaming.\n\nGames featured in the video (and Kurt's personal recommendations):\nFlorence\nBury Me My Love\nDevice 6\nSongs of Bloom\nPry\nPatterned", "link": "https://www.youtube.com/watch?v=Eu6eT2V1wIA", "date_published": "2022-09-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Marvel's Midnight Suns Full Presentation | Disney & Marvel Games Showcase", "description": "Marvel's Midnight Suns got an all new gameplay trailer during the Disney & Marvel Games Showcase showing off its bewildering amount of characters and its high stakes battles. Marvel's Midnight Suns is expected to release December 2, 2022.\n\nDoctor Strange, Wolverine, Blade, Ghost Rider, Nico, Magik, Iron Man, Captain America, Captain Marvel, Spider-Man, Scarlet Witch, and Hunter were showcased in the Prequel Shorts to Marvel's Midnight Suns.\n\n#marvel #disney #gaming", "link": "https://www.youtube.com/watch?v=_dsRsEAHmfw", "date_published": "2022-09-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Massive Call of Duty And Warzone Leaks Before Next Showcase | GameSpot News", "description": "Warzone is sticking around after the release of Warzone 2, Call of Duty 2024 reportedly has its setting, and Overwatch 2 backlash over battle pass.\n#GameSpot #CallOfDuty #Warzone #Overwatch2 \n\nLeaked details on Call of Duty’s future ahead of the franchise’s upcoming Next event, plus uncertainty of Overwatch 2’s battle pass mere weeks before its launch. All this on today’s GameSpot News.\n\nWith more information about the standalone Warzone 2 on the horizon as part of the upcoming Call of Duty Next, some fans have wondered what exactly will be happening with the original version of Warzone. Reporter Tom Henderson on Twitter claims the game will be undergoing a name change on November 28, and that \"it looks like original Warzone will continue to receive updates/DLC.\"\n\nIt seems the original Warzone going forward will focus primarily on the Caldera map set in the Pacific, which was introduced as part of what Activision Blizzard called \"Warzone Pacific\" alongside Call of Duty: Vanguard Season 1 in November 2021.\n\nLike its predecessor, Warzone 2 will be launching some time after the October 25 release Modern Warfare 2, and will feature many of that game's mechanics, vehicles, and weapons.\n\nHaving Warzone and Warzone 2 coexist does line up with what Activision has said previously about the two battle royales, namely that Warzone will \"continue on as a separate experience that will include a continuation of player progression and inventories within that Warzone experience.\" That means skins, weapons, and unlocks in the original Warzone will not carry over to Warzone 2.\n\nLooking further into the future for Call of Duty, 2024's installment might tell a story about the war in Iraq. Twitter user TheGhostOfHope, who has accurately reported on unannounced Call of Duty details in the past, said the campaign for 2024's Call of Duty game will cover what the US government calls Operation Iraqi Freedom and Operation Enduring Freedom, as well as the Battle of Mogadishu, which took place years earlier during the Gulf War of the nineties, the event later adapted and dramatized in 2001's Black Hawk Down.\n\nTheGhostOfHope said it will be Raven Software developing the campaign for Call of Duty 2024. Raven also developed the campaign for Black Ops Cold War.\n\nIf Call of Duty 2024 is indeed about the Iraq war, the game will likely be contentious. Around 200,000 civilians died as a result of the war, and another game, Six Days in Fallujah, has generated a good amount of debate and discussion for its themes and elements. One could only imagine that the size and popularity of a franchise like Call of Duty addressing those horrific, real life events would result in an even larger discourse.\n\nTIMESTAMPS: \n00:13 - Warzone \n01:21 - Call of Duty 2024\n02:24 - Overwatch 2", "link": "https://www.youtube.com/watch?v=NJlsvDZkez0", "date_published": "2022-09-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Splatoon 3 is Familiar But Great! | GameSpot After Dark Ep 161", "description": "This week the crew talks Splatoon 3, our hands-on with A Plague Tale: Requiem, and The Rings of Power show.\n\nTimestamps:\n0:00:00 - Intro\n0:03:01 - A Plague Tale: Requiem\n0:21:28 - Splatoon 3\n0:40:25 - Streets of Rage 4 Mobile\n0:41:41 - Swipe Mobile Showcase\n0:48:14 - House of the Dragon & The Rings of Power\n1:08:51 - Jojo Stone Ocean\n1:13:24 - Dark\n1:14:44 - Question of the Week\n1:32:38 - Outro\n\n#gaming #splatoon3 #plaguetale", "link": "https://www.youtube.com/watch?v=hW0cZd9vNbg", "date_published": "2022-09-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Untitled Black Panther and Captain America Game Reveal Trailer | Disney & Marvel Games Showcase", "description": "From Marvel and Skydance New Media comes this take on Hydra, Captain America, and Black Panther. The game promises Four heroes, two worlds, and one war - perhaps spanning time from WW2 to Wakanda. We saw glimpses of Captain America and Black Panther.\n\n#marvel #gaming #d23expo", "link": "https://www.youtube.com/watch?v=fAKakVheYXA", "date_published": "2022-09-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Untitled Captain America and Black Panther Game Official 4K Teaser Trailer", "description": "Four Heroes. Two Worlds. One War. In collaboration with Marvel Games, Skydance New Media is proud to share the first look at our new AAA game with an ensemble cast and original story set in our unique Marvel Universe.\n\nThis is an original story that will take players to the WWII-era adventure with four playable heroes at different points in the story. Play as a young Steve Rogers aka Captain America, T'Challa's grandfather and the WWII-era Black Panther, Gabriel Jones, a U.S. soldier and a member of the Howling Commandos; and Nanali, leader of the fledgling Wakandan Spy Network. \n\n#marvel #d23expo #gaming", "link": "https://www.youtube.com/watch?v=fumWqujR-Fc", "date_published": "2022-09-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty Warzone Mobile Revealed and the Future of COD Mobile | Swipe Mobile Showcase", "description": "During GameSpot's new mobile show, Swipe, Chris Plummer VP of Mobile unveils Call of Duty's new Warzone mobile game and revealed what's next for Call of Duty Mobile.\n#gaming #cod #gamespot #swipe \n\nCall of Duty Warzone Mobile is the official name of the game formerly known as Project Aurora. It's a new game from Activision's Solid State Studios, and today Activision announced the official title and revealed the first teaser. We'll also learn more at Call of Duty's Next which is coming in just one weeks time. Here we'll learn about the future of Call of Duty Warzone Mobile, and more of the Call of Duty franchise.\n\nCall of Duty Warzone Mobile will be, as its name suggests, a mobile version of Call of Duty Warzone. The existing Call of Duty Mobile already has a battle royale element, in addition to standard multiplayer, but Call of Duty Warzone Mobile is exclusively a battle royale game.", "link": "https://www.youtube.com/watch?v=u-gE10oIK1U", "date_published": "2022-09-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "GameSpot Swipe Mobile Showcase", "description": "Swipe GameSpot's Mobile Showcase will be streaming live on September 8th at 10am PT/1pm ET. You can expect a ton of announcements and looks at newly revealed games for iOS and Android devices. We'll be featuring everything from Call of Duty to Lord of the Rings to what's next from Netflix and more. We've got a great show planned with host Greg Miller of Kinda Funny and cohosts Tamoor Hussain and Kurt Indovina.\r\n\r\nWe're looking to pack a lot in for Swipe, and we're excited to tease some of what you can expect. We'll be revealing the winner of our ongoing reader poll to determine the best mobile game of all time. Here are some of the developers and publishers who will be getting the spotlight: exciting news from the Call of Duty team, plus updates on NBA 2K Mobile, Lord of the Rings: Heroes of Middle-earth, PUBG Mobile, Tower of Fantasy, Iron Marines Invasion, Dead Cells, Streets of Rage 4, Lucky Luna, Desta, The Division Resurgence, Railbound, and more.\r\n\r\n#gaming #swipe #mobile #gamespot", "link": "https://www.youtube.com/watch?v=o8BXWNUmZM4", "date_published": "2022-09-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Little Nightmares Mobile Official Announcement Trailer | Swipe Mobile Showcase", "description": "Little Nightmares makes it way to mobile devices in the winter on the Apple App Store and the Google Play Store. This announcement was made during GameSpot's Swipe Mobile Showcase.\n\n#littlenightmares #swipe #gaming", "link": "https://www.youtube.com/watch?v=S4fbHZR7UVA", "date_published": "2022-09-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Lord Of The Rings: Heroes Of Middle-Earth Gameplay Revealed | Swipe Mobile Showcase", "description": "Take a look at EA's upcoming fantasy game for mobile with the game's art director, Chris Salazar.\n#gaming #lotr #gamespot \n\nWe got a chance to speak with EA to learn more details on its upcoming Lord of the Rings mobile game, Heroes of Middle-earth.\n\nYou'll get to play as famous Middle-earth characters to battle in a fight between good and evil. A new ring has been discovered, and it grants you the power to rewrite history. Of course there will be a fight over this powerful ring, and players can use the ring for good or evil.\n\nLord of the Rings: Heroes of Middle-earth is a turn-based strategy game, where you will command units on the battlefield, including Aragorn, Gandalf, Arwen, Sauron and more.\n\nThe game is currently in testing, but will launch everywhere on iOS and Android soon. For more mobile gaming news, be sure to check out GameSpot's Mobile Show: Swipe, which highlights the latest and greatest games for iOS and Android devices.", "link": "https://www.youtube.com/watch?v=gnH2IZhwULQ", "date_published": "2022-09-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Lucky Luna Official Gameplay Trailer | Swipe Mobile Showcase", "description": "Take a look at this new trailer for Lucky Luna which premiered at Gamespot's Swipe Mobile Showcase 2022! Lucky Luna is out today, so go and download the game to try it for yourself!\n\n#luckyluna #swipe #gaming", "link": "https://www.youtube.com/watch?v=FDx4d5YF3ZA", "date_published": "2022-09-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PUBG Mobile NUSA Official Reveal Trailer | Swipe Mobile Showcase", "description": "Check out the first official look at Nusa gameplay in PUBG Mobile. Nusa is a new map coming to PUBG Mobile's Version 2.2 update that will be available soon.\n\nThe map includes Bulan Bay, Shipyard, Regal Resort, Pink Beach, Flame Village, Sunset Street, Crystal Bay, Telepak Town, Science Center, Love Island and much more!\n\n#pubgmobile #swipe #gaming", "link": "https://www.youtube.com/watch?v=J5yJ0sXNIB8", "date_published": "2022-09-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PlayStation Unhappy With Xbox's Call of Duty Offer | GameSpot News", "description": "Sony thinks Microsoft's commitment to COD on PlayStation is \"inadequate,\" the Xbox is getting a UI overhaul, a new Battlefield game is in development, and the Witcher 3 will be coming to current gen this year.\n#GameSpot #CallOfDuty #PlayStation \n\nPlayStation fires back at Microsoft’s claims regarding Call of Duty exclusivity, the Xbox UI is getting an overhaul, new Battlefield games, and more on today’s GameSpot news.\n\nMom and Dad are fighting! PlayStation boss Jim Ryan has responded to Microsoft Gaming CEO Phil Spencer saying his company would go above and beyond industry standards and keep Call of Duty on PlayStation for years to come if the Xbox company's acquisition of Activision Blizzard goes through. \n\nRyan told GI.biz that Microsoft offered to keep Call of Duty on PlayStation for specifically three years after the existing deal between Activision and Sony finishes. Ryan said this was \"inadequate on many levels.\"\n\n\"Microsoft has only offered for Call of Duty to remain on PlayStation for three years after the current agreement between Activision and Sony ends,\" Ryan said. \"After almost 20 years of Call of Duty on PlayStation, their proposal was inadequate on many levels and failed to take account of the impact on our gamers. We want to guarantee PlayStation gamers continue to have the highest quality Call of Duty experience, and Microsoft's proposal undermines this principle.\"\n\nWe don't know, however, what the duration of the previously agreed-upon deal between Sony and Activision for Call of Duty was. But whatever that is, it'll be extended by three years, apparently, but what happens after that is unclear. Microsoft's deal to buy Activision Blizzard is currently being reviewed by regulatory bodies around the world. New Zealand will be among the next countries to weigh in, with a decision due by September 9.\n\nSpeaking of Microsoft, the company is looking to give the Xbox UI a makeover, with a number of changes planned that will roll out as experiments for Xbox Insiders over the next few months.\n\nA key new feature is a planned \"jump back in\" row, which is designed to give players quick access to their most-recently-played games and apps. System apps like Settings, Store, Search and My Games & Apps will be easier to access as they will have their own tiles on Xbox Home. Microsoft notes that the rollout will be slow to start, and that Xbox will be iterating throughout the process, but a full launch of the new UI is planned for sometime in 2023. \n\nWhile Xbox and PlayStation bicker over Call of Duty, Battlefield has been making some moves. Marcus Lehto, who designed Master Chief and co-created the Halo universe, is heading up a brand-new Battlefield studio in Seattle. Electronic Arts announced that the studio is called Ridgeline Games, and it will develop a \"narrative campaign\" for Battlefield. Very little is known right now, but EA said this campaign will \"engage fans in new and exciting ways while remaining true to the classic elements of the series.\"\n\nAnother big announcement was that Battlefield creative director Lars Gustavsson, who has worked on the Battlefield series since it started in 2002, is departing the team. \nDespite hiccups at launch, the series’ latest entry Battlefield 2042 was the fifth best-selling game of 2021 in the US. With these announcements, EA reiterated that it wants fans to know that EA is \"all-in on Battlefield.\" The company has DICE continuing to work on Battlefield's \"multiplayer suite,\" EA said, while another studio Ripple Effect will create an \"entirely new Battlefield experience that will complement and build upon the series' foundations.\"", "link": "https://www.youtube.com/watch?v=AW5NCZPboZY", "date_published": "2022-09-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Division Resurgence: What’s Coming To The Mobile Game | Swipe Mobile Showcase", "description": "Tom Clancy's The Division Resurgence is a mobile MMO that brings open-world exploration and shooting to your pocket. \n#gaming #thedivision #gamespot \n\nWe got a chance to speak to Fabrice Navrez, executive producer on The Division Resurgence, about how the game will bring the same Division experience to your mobile game.\n\nThe Division Resurgence will open with a scene set before the events of the first game, but then transition to its main storyline, which sits between the first and second game on the timeline. Players will return to New York City and visit iconic locations like Liberty Island and Times Square. \n\nThe game recently completed its first closed alpha test, and there was positive feedback received thus far with the MMO aspects, including the ability to meet players out in the streets of New York as opposed to only in safe zones, resulting in what Navrez called interesting encounters.\n\nThe video also details two of the six classes available in the closed alpha: the Demolitionist, who carries a heavy gun that inflicts explosive area-of-effect damage, and the Bulwark, which is a melee tank class designed to draw enemy fire and deal massive damage up-close. \n\nThe Division Resurgence will release on iOS and Android at launch, though a specific timeframe has not yet been announced. More information will be provided during the Ubisoft Forward on September 10 at 12 PM PT / 3 PM ET.", "link": "https://www.youtube.com/watch?v=ZzaJMXKnosU", "date_published": "2022-09-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Tom Clancy's Rainbow Six Mobile Official Trailer | Swipe Mobile Showcase", "description": "Learn more about Rainbow Six Mobile in this latest trailer showcased during GameSpot's Swipe Mobile Showcase. Beta is soon approaching and Clubhouse is making its way to the game.\n\nTom Clancy’s Rainbow Six is coming to mobile! Explore a diverse roster of Operators and destructible environments in classic maps like Bank and Border. Experience Rainbow Six Mobile: a competitive multiplayer, first-person tactical shooter. Play as an Attacker or Defender in PvP matches and face intense close-quarter combat while making timely tactical decisions.\n\n#rainbowsix #swipe #gaming", "link": "https://www.youtube.com/watch?v=Sr7uL8bHnqA", "date_published": "2022-09-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]