[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCO2x-p9gg9TLKneXlibGR7w", "title": "Apple’s iPhone 14 Event “Surprised” Me", "description": "Apple wrapped up their annual September Event yesterday. At long last, the 6.1” iPhone 14 gained a bigger sibling, the 6.7” iPhone 14 Plus. Leaks surrounding the pro phones were validated, but only from a hardware standpoint. The software—as many postulated—was a far cry from a simple “dot-and-pill” that had been rumored. The “dynamic island” (l-o-frickin’-l) cleverly places UI elements around the floating “notch” with amazingly elastic animations to boot. The Watch Series 8 had a fairly boring year, but some women may benefit from improved ovulation tracking for better family planning. The Apple Watch SE 2 brought a new processor and lower price to the entry-level model, and the titanium Series Watch disappeared in favor of the new Apple Watch Ultra. The Watch Ultra packs a bunch of adventure-focused hardware and software features like a dive sensor, siren, dual speakers, three microphone array, a larger 49mm display wrapped in sapphire, a huge crown with surrounding crown guard, a new Action Button, and a whole lot more. We’ll talk about everything—from crash detection, to dive features, to the new health sensor, and more. Concerning the iPhone, we’ll talk about our happy surprises and cautious… optimism? Don’t miss this one! Oh, and let us take a bit of a victory lap concerning the AirPods Pro 2 rumors we were skeptical of!\n\nFollow me on Twitter - http://twitter.com/snazzyq\nFollow me on Instagram - http://instagram.com/snazzyq\n\n00:00 GoOd mOrNInG!!!\n00:20 Apple Watch Series 8\n00:34 Temperature Sensor\n1:20 Health Data Encryption\n1:38 BUMPER CARS!\n2:05 Buy Apple Watch—or DIE!\n2:30 Compass Backtrack\n3:20 Apple Watch SE\n4:10 Watch Ultra\n4:45 How Frickin' Big Is It?\n5:58 External Design and Hardware\n7:46 Inside Bits\n8:42 Compass Backtrack pt. 2\n9:23 Dive Computer Functionality\n10:20 Let's Talk Price...\n11:28 AirPods Pro 2\n13:35 AirPods 3 \"Update\"\n13:51 iPhone 14/14 Plus\n14:37 New Cameras & Action Mode\n15:34 eSIM (U.S. Only)\n16:32 Satellite Connectivity\n18:04 iPhone 14 Pro/14 Pro Max\n18:27 Dynamic Island\n19:51 Display Improvements\n21:17 New Camera System\n24:23 A16\n25:51 NRBs", "link": "https://www.youtube.com/watch?v=g-YPMBX29dA", "date_published": "2022-09-08 14:00:31+00:00", "persistent": false, "user": null, "language": "en-US"}]