[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Alisa Amador, 2022 Tiny Desk Contest Winner: Tiny Desk Concert", "description": "Bob Boilen | May 31, 2022\nIt surely was a day of joyful tears. And those joyful tears for Alisa Amador, the winner of the 2022 Tiny Desk Contest, came at a time when she had been considering putting her music career on hold. For the staff of NPR and the Tiny Desk crew, it was our first Tiny Desk concert with an audience in over 800 days, and Alisa’s captivating music surely intensified our spinning emotions.\n\nAlisa Amador opened with her Contest-winning entry “Milonga accidental,” a song about embracing your contradictions. It’s a song that our judges — iLe, Big Krit, Michelle Zauner (of Japanese Breakfast), Raveena, Nate Chinen (of member station WBGO), Tiny Desk producer Bobby Carter and I — all found to be so filled with passion. I often fall for a song because of the lyrics, and this is the first Tiny Desk Contest winner whose winning song is in Spanish. Despite the fact that I don’t speak Spanish, I felt the conflict, the yearning and the song's questioning. \n\nAlisa grew up in Boston, Maine, Puerto Rico and Argentina, and was raised by Rosi and Brian Amador, her Latin-folk musician parents who play in the band Sol y Canto; they were also in attendance. She’s been singing since she was four, and has been entering the Tiny Desk Contest every year since 2018. In fact, the song “Together,” which closes this concert, was an astonishing entry from 2020. For COVID safety, we limited the audience to a small group of masked NPR employees, yet the sing-along for the closing track was still powerful. \n\nAlisa also set her winning song to a lovely string arrangement performed by a Washington D.C. quartet and rehearsed for the first time just hours before the performance. The arrangements were originally done by Jamie Oshima after a recording session a few years back, and then Alisa’s friend Noah Fishman transcribed the arrangement. For the next three songs, she’s joined by Jamie Oshima (guitar, keys), Noah Harrington (bass) and Jacob Thompson (drums, keys).\n \n“When will I know how to decipher my purpose? / When will I feel at home in my voice?” As Alisa sings those words to her winning entry in Spanish at the Tiny Desk, I’m thinking: Perhaps that moment is now. \n\nSET LIST\n“Milonga accidental”\n“Timing”\n“Slow Down”\n“Together”\n\nMUSICIANS\nAlisa Amador: vocals, guitar\nJamie Oshima: guitar, keys\nNoah Harrington: bass\nJacob Thompson: drums, keys\nKristin Bakkegard: violin\nNick Montopoli: violin\nPaul Bagley: viola\nCarol Anne Bosco: cello\n\nTINY DESK TEAM\nProducers: Bob Boilen, Kara Frame, Lia Crockett, Elle Mannion\nAudio Recording & Mix Engineer: Josh Rogosin\nSeries Producer: Bobby Carter\nEditor: Joshua Bryant\nVideographers: Kara Frame, Joshua Bryant, Alanté Serene, Estefania Mitre\nProduction Assistant: Jill Britton\nTiny Desk Team: Michael Zamora, Ashley Pointer, Dwi Partowardojo, Bill Wright, Stacey Foxwell, Maia Stern, Suraya Mohamed\nTiny Desk Contest Team: Jessica Goldstein, Devon Williams\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #tinydeskcontest #alisaamador", "link": "https://www.youtube.com/watch?v=sN58k8tSFXg", "date_published": "2022-05-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]