[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "CDC, natural immunity not mentioned", "description": "This covid winter should be better than last\n\nDr. Anthony S. Fauci, President Biden’s chief medical adviser\n\nhttps://www.nytimes.com/2022/11/22/us/politics/fauci-covid-winter-surge.html\n\nhttps://www.washingtonpost.com/health/2022/11/22/covid-bivalent-booster/?utm_campaign=wp_to_your_health&utm_medium=email&utm_source=newsletter&wpisrc=nl_tyh\n\nCombination of infections and vaccinations,\n\nenough community protection that we’re not going to see a repeat of what we saw last year at this time\n\nRe bivalent effectiveness\n\nIt is clear now, despite an initial bit of confusion\n\nUnited States\n\nNearly $5 billion to buy 171 million bivalent boosters\n\n(Pfizer BioNTech, Moderna)\n\nHobson’s choice\n\nDr. Ashish K. Jha, White House’s Covid-19 response coordinator\n\nStill heavily promoting vaccination\n\nNothing I have seen in the subvariants makes me believe that we can’t manage our way through it effectively, especially if people step up and get their vaccine\n\nSo far, 35 million people, (11% of over 5s) one bivalent shot\n\nhttps://www.cdc.gov/mmwr/volumes/71/wr/mm7148e1.htm?s_cid=mm7148e1_w\n\nEffectiveness of Bivalent mRNA Vaccines in Preventing Symptomatic SARS-CoV-2 Infection — Increasing Community Access to Testing Program, United States, September–November 2022 \n\nThis is the clinical trial, previous work had only been based on antibodies\n\nBenefits are mentioned, adverse reactions are not\n\nAny adverse reactions not reported\n\nv-safe\n\nhttps://www.cdc.gov/mmwr/volumes/71/wr/mm7144a3.htm?s_cid=mm7144a3_w\n\nSystemic symptoms\n\nFatigue (30.0%–53.1%)\n\nHeadache (19.7%–42.8%)\n\nMyalgia (20.3%–41.3%)\n\nFever (10.2%–26.3%)\n\nReported inability to complete normal daily activities\n\n10.6% among aged over 65 years\n\n19.8% among aged 18–49 years\n\nBivalent boosters provided significant additional protection against symptomatic SARS-CoV-2 infection\n\nRelative vaccine effectiveness (rVE) of a bivalent booster dose,\n\ncompared with that of more than 2 monovalent vaccine doses,\n\n30% and 56% aged 18–49\n\nwith relative benefits increasing with time since receipt of the most recent monovalent vaccine dose. \n\nStaying up to date with COVID-19 vaccination, including getting a bivalent booster dose when eligible, is critical to maximizing protection against COVID-19\n\n350,000 tests at almost 10,000 retail pharmacies between Sept. 14 and Nov. 11\n\nRelative risk given\n\nAbsolute risk not given\n\nWhat about protection from severe disease?\n\nPaul Offit, director of the vaccine education center, professor of pediatrics, Children’s Hospital of Philadelphia\n\nThe only reasonable goal is to prevent serious illness,\n\nWe are still waiting for one shred of evidence that this bivalent vaccine or any bivalent is better than what we had\n\nVirus continues to evolve\n\nThis should be a cautionary tale for what happens when you try to chase these variants\n\n\nCeline Gounder, infectious-disease specialist, Kaiser Family Foundation\n\nIt doesn’t show the bivalents are better than the original boosters\n\n(but still advocated the bivalent shot)\n\nPei-Yong Shi, virologist, University of Texas Medical Branch\n\ndifficult to measure how well the updated boosters were working because so many people now had some immunity from earlier infections, \n\nincluding people who were never vaccinated or boosted. \n\nJohn P. Moore, virologist, Weill Cornell Medicine\n\nAre the boosters working better than the original shots?\n\nPersonally, I doubt there would have been much, if any, difference, but we may never know\n\nDr. Roby Bhattacharyya, infectious disease physician, Massachusetts General Hospital\n\nThis winter should be better than last\n\nwe’re a more immune population\n\nChina\n\nhttps://www.reuters.com/world/china/chinas-daily-covid-cases-hit-record-high-2022-11-24/?utm_source=Sailthru&utm_medium=newsletter&utm_campaign=daily-briefing&utm_term=11-24-2022\n\nhttps://www.telegraph.co.uk/world-news/2022/11/24/iphone-factory-staff-offered-1400-leave-immediately-desperate/\n\nRecord high COVID-19 infections\n\nRigid zero-COVID policy\n\nCities nationwide imposing localised lockdowns\n\nMass testing, masks\n\nNo furlough scheme", "link": "https://www.youtube.com/watch?v=0hXESCSRyvY", "date_published": "2022-11-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]