[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "There is only ONE way in which Linux should copy Windows", "description": "Get 100$ credit for your own Linux server: https://www.linode.com/linuxexperiment \n\nGet 300€ off the Slimbook TITAN with offer code titan-laptop-nickfan: https://slimbook.es/en/store/titan/titan-comprar\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nI also do a Gaming Podcast: https://www.youtube.com/channel/UCbRPZ11S1quJ4ESoj42A3ug\n\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:40 Sponsor: 100$ free credit on your own Linux server!\n01:52 Let's not copy the architecture\n03:29 User Interface does NOT have to be a Windows copy\n05:43 Being more user friendly doesn't make less choice\n07:53 We can't copy how Microsoft works on software either\n10:54 We should copy Windows in THIS, though\n\n\nLinux, as an operating system, is fundamentally different from Windows, no question about it, from its look to its architecture.\n\nThis can be confusing to people, as they'd expect another OS to be structured exactly like another one. For example, the filesystem on Linux doesn't use C or D or E drives.\n\nThe most visible difference between Linux desktops and Windows is in the user interface. Whatever desktop you choose to use, it can only partially emulate what Windows looks like, and how it works, even if you try your hardest to make it into a carbon copy.\n\nFamiliarity in user interface is a good thing, it helps people get their bearings, and find what they're looking for more easily. But there is a difference between being familiar, and being a copy.\n\nEach feature, button and option doesn't need to be in the same place as its windows equivalent, to be intuitive.\n\nOf course we need to keep some conventions and not reinvent the wheel on every little detail. But we also don't have to stick to the exact way windows does things, to have a usable, user friendly system.\n\nLet's talk about choice. Windows doesn't offer their users choice. You can't really refuse telemetry, you can't change the position of the taskbar anymore, you can't change anything but an accent color, it's not a really customizable system.\n\nLinux desktops, traditionally, offer a lot more choice. It's not something that's inherently part of Linux, it's not a core value, it's just something that we've gotten used to.\n\nThis is something that's generally called fragmentation by detractors of the Linux desktop, but I personally think that this choice is a strength.\n\nDoes it mean we should be like Windows, and not offer any choice? One distro, one desktop, 10 colors, and that's it? Of course not.\n\nLinux desktops have a very different philosophy compared to Windows. We're using an open source system, with free software, developed by volunteers, or people being paid by companies working on open source software.\n\nMicrosoft is a monolothic corporation than employs their own developers, doesn't open the source code to Windows, and sells the OS to hardware partners.\n\nThis means that the direction our OS and theirs are moving towards might be similar, but the way to get there isn't, and shouldn't be.\n\nBoth Microsoft and Linux desktops have a vision that they follow, but they don't reach it in the same way. Linux desktops shouldn't try to have the same organization as Microsoft.\n\nLast but not least, let's talk about the ways of getting Windows, versus how you'd get a Linux desktop.\n\nWindows is generally preinstalled on a computer you buy. Not many people decide to buy a Windows installer, or DVD, and install it themselves.\n\nLinux doesn't have that luxury, and comes as a download that you have to install yourself.\n\nAnd this is a spot where we should DEFINITELY try to be like Windows. Yep. There's ONE area where we NEED to copy Windows, and that's having computers in retail stores.", "link": "https://www.youtube.com/watch?v=5wT2inbwtVs", "date_published": "2022-01-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]