[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "11 Stupidly Hard Bosses in Video Games", "description": "Who designed these, and why do I enjoy the suffering so much? From Mike Tyson of Punch-Out!! to Absolute Radiance of Hollow Knight, and delving into FromSoftware games like Sekiro and Bloodborne, here are some of the most challenging and difficult bosses... ever. Time to Git Gud!\n\nTime Stamps:\n0:52 - Mike Tyson's Punch-Out!!\n1:50 - Sekiro\n4:10 - Bloodborne\n5:42 - Ninja Gaiden\n7:40 - Undertale\n8:48 - Hollow Knight\n11:16 - Enter the Gungeon\n13:06 - Final Fantasy VII\n15:08 - Castlevania 3\n16:20 - Prinny: Can I Really Be the Hero?\n17:19 - Mushihimesama Futari", "link": "https://www.youtube.com/watch?v=0FOtmUyX7LA", "date_published": "2022-01-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dying Light 2 - 500 Hours To 100%? | GameSpot News", "description": "In today’s episode of GameSpot News, Persia talks about Dying Light 2 taking up to 500 hours for a 100% run, Take-Two acquiring Zynga for $12.7 billion, and more.\n\nPlayers will need to spend about 500 hours to \"fully complete\" Dying Light 2, developer Techland has confirmed, while also acknowledging that this is the projected run time for a 100% run. A \"focused\" playthrough of the game's main story can be finished in about 20 hours depending on your playstyle. That playtime gets bumped to about 80 hours including all side quests and then, 500 hours including “every collectible, listen to every dialogue, fetch every Easter egg, finish every possible ending, and visit every corner of the world,\"\n\nPersia also talks about Grand Theft Auto company Take-Two acquiring FarmVille company Zynga for $12.7 billion, which the company announced on Monday morning. In a slide deck, Take-Two said it sees a \"clear path\" for bringing Take-Two's console and PC games to mobile, thanks in part to the Zynga deal. It did not, however, name any specific titles.\n\nLastly, Persia talks about a video uploaded by ER-SA that shows off the incomplete character creation in Elden Ring. While Elden Ring's character creation menu is by no means in a finished state, it does provide a good look at the game's improved character models. A majority of the basic options look decently realistic, sporting impressively rendered hair.\n\nLink to full ER-SA video here: https://www.youtube.com/watch?v=vh_G4ARUSDw \n\nFor more information on all of our topics today, please visit gamespot.com.", "link": "https://www.youtube.com/watch?v=mng7FPteljE", "date_published": "2022-01-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Monster Hunter Rise - PC vs. Switch Graphics Comparison", "description": "With Monster Hunter Rise coming to PC, we put the original Switch version head-to-head with the new PC port to see the graphics differences.\n\nLast year’s Nintendo Switch exclusive Monster Hunter Rise is making its way to PC. We got early access to the game so we’ve put together a side by side comparison. The PC version is running at 1440p on max settings, although I kept motion blur and depth of field off. Don’t expect any drastic improvements when it comes to visuals, it really just looks like a sharper, cleaner version of what we have on Switch. Although one major annoyance is the prominent shadow dithering on the Switch version is still here on PC and its way more bothersome here. Maybe that can be fixed in the future. If you enjoy this video, why not give us a like and sub if you already haven’t, and thanks for watching.\n\n#MonsterHunterRise", "link": "https://www.youtube.com/watch?v=Q30_iQkAVIs", "date_published": "2022-01-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]