[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCL9PlYkRD3Q-RZca6CCnPKw", "title": "Military Documents about Gain of Function contradict Fauci testimony under oath #ExposeFauci", "description": "TWEET THIS VIDEO RIGHT NOW: https://ctt.ac/TYeIu\n\n• Military documents state that EcoHealth Alliance approached DARPA in March 2018 seeking funding to conduct gain of function research of bat borne coronaviruses. The proposal, named Project Defuse, was rejected by DARPA over safety concerns and the notion that it violates the gain of function research moratorium.\n\n• The main report regarding the EcoHealth Alliance proposal leaked on the internet a couple of months ago, it has remained unverified until now. Project Veritas has obtained a separate report to the Inspector General of the Department of Defense, written by U.S. Marine Corp Major, Joseph Murphy, a former DARPA Fellow.\n\n• “The proposal does not mention or assess potential risks of Gain of Function (GoF) research,” a direct quote from the DARPA rejection letter.\n• Project Veritas reached out to DARPA for comment regarding the hidden documents and spoke with the Chief of Communications, Jared Adams, who said, “It doesn’t sound normal to me,” when asked about the way the documents were buried.\n\n[WASHINGTON, D.C. – Jan. 10, 2022] Project Veritas has obtained startling never-before-seen documents regarding the origins of COVID-19, gain of function research, vaccines, potential treatments which have been suppressed, and the government’s effort to conceal all of this.\n\nThe documents in question stem from a report at the Defense Advanced Research Projects Agency, better known as DARPA, which were hidden in a top secret shared drive.\n \nDARPA is an agency under the U.S. Department of Defense in charge of facilitating research in technology with potential military applications.\n \nProject Veritas has obtained a separate report to the Inspector General of the Department of Defense written by U.S. Marine Corp Major, Joseph Murphy, a former DARPA Fellow.\n\nThe report states that EcoHealth Alliance approached DARPA in March 2018, seeking funding to conduct gain of function research of bat borne coronaviruses. The proposal, named Project Defuse, was rejected by DARPA over safety concerns and the notion that it violates the basis gain of function research moratorium.\n \nAccording to the documents, NIAID, under the direction of Dr. Fauci, went ahead with the research in Wuhan, China and at several sites across the U.S.\n \nDr. Fauci has repeatedly maintained, under oath, that the NIH and NIAID have not been involved in gain of function research with the EcoHealth Alliance program. But according to the documents obtained by Project Veritas which outline why EcoHealth Alliance’s proposal was rejected, DARPA certainly classified the research as gain of function. \n\n“The proposal does not mention or assess potential risks of Gain of Function (GoF) research,” a direct quote from the DARPA rejection letter.\n\nMajor Murphy’s report goes on to detail great concern over the COVID-19 gain of function program, the concealment of documents, the suppression of potential curatives, like Ivermectin and Hydroxychloroquine, and the mRNA vaccines.\n \nProject Veritas reached out to DARPA for comment regarding the hidden documents and spoke with the Chief of Communications, Jared Adams, who said, “It doesn’t sound normal to me,” when asked about the way the documents were shrouded in secrecy. “If something resides in a classified setting, then it should be appropriately marked,” Adams said. “I’m not at all familiar with unmarked documents that reside in a classified space, no.”\n\nIn a video breaking this story published on Monday night, Project Veritas CEO, James O’Keefe, asked a foundational question to DARPA:\n\n“Who at DARPA made the decision to bury the original report? They could have raised red flags to the Pentagon, the White House, or Congress, which may have prevented this entire pandemic that has led to the deaths of 5.4 million people worldwide and caused much pain and suffering to many millions more.”\n\nDr. Anthony Fauci has not yet responded to a request for comment on this story.\n\nAbout Project Veritas\nJames O'Keefe established Project Veritas in 2010 as a non-profit journalism enterprise to continue his undercover reporting work. Today, Project Veritas investigates and exposes corruption, dishonesty, self-dealing, waste, fraud, and other misconduct in both public and private institutions to achieve a more ethical and transparent society and to engage in litigation to: protect, defend and expand human and civil rights secured by law, specifically First Amendment rights including promoting the free exchange of ideas in a digital world; combat and defeat censorship of any ideology; promote truthful reporting; and defend freedom of speech and association issues including the right to anonymity. O'Keefe serves as the CEO and Chairman of the Board so that he can continue to lead and teach his fellow journalists, as well as protect and nurture the Project Veritas culture.", "link": "https://www.youtube.com/watch?v=_zgoENmeddA", "date_published": "2022-01-11 00:00:00+00:00", "persistent": true, "user": "rumpel", "language": "en", "tags": ["covid", "fauci"]}]