[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Mr Bill Gates is sad", "description": "But why?\nNatural immunity discussed by Mr. Bill Gates\n\nhttps://twitter.com/disclosetv/status/1494810193175195652\n\nSadly the virus itself \n\nparticularly the variant called Omicron\n\nis a type of vaccine, creates both B cell and T cell immunity\n\nand it's done a better job of getting out to the world population than we have with vaccines.\n\nSerosurvey in African countries, 80% positive\n\nChance of severe disease, dramatically reduced because of that infection exposure.\n\nWe didn’t do a great job on therapeutics\n\nUK\n\nCases down dramatically, infections down slightly\n\nhttps://coronavirus.data.gov.uk/details/cases\n\nhttps://covid.joinzoe.com/data#levels-over-time\n\nONS tracks omicron BA.2", "link": "https://www.youtube.com/watch?v=tlygUb9RVgA", "date_published": "2022-02-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Please send to politicians", "description": "Germany’s vaccination board STIKO ständige Impfkomission, Standing commission for vaccination \n\nhttps://www.rki.de/DE/Content/Infekt/EpidBull/Archiv/2022/Ausgaben/07_22.pdf?__blob=publicationFile\n\nNow recommends aspiration\n\nThe vaccine is to be injected only intramuscular (i.m.), \n\nand in no case intradermal, subcutaneous, or intravenous.\n\nIn animal models, direct intravenous injection of an mRNA vaccine has led to Myopericarditis (both clinically and histopathologically).\n \nAlthough inadvertent intravenous injections are rare during application of intramuscular vaccines, \n\naspiration of the needle is a sensible precaution when vaccinating against COVID-19 and can lead to increased safety.\n\nFerdinand, thank you\n\nDenmark\n\nhttps://en.ssi.dk/news/epi-news/2021/no-19-21---2021\n\nBasically, we need to change the vaccine administration guidelines to include precautionary aspiration, prior to pushing in the vaccine. This will prevent cases of inadvertent intravascular administration of vaccine.\n\nHere is some discussion to suggest inadvertent intravascular vaccine administration is a variable in the aetiology of complications after adenoviral vector vaccine administration and after mRNA vaccines.\n\nThese adverse events, although rare have reduced public confidence in covid vaccination, especially amongst the young, where vaccine rates are lowest.\n\nIt has long been known that intravenous injection of adenovirus leads to TTS in mice\n\nhttps://ashpublications.org/blood/article/109/7/2832/125650/Adenovirus-induced-thrombocytopenia-the-role-of\n\nNow, new covid vaccine specific work agrees with this previous work\n\nThrombocytopenia and splenic platelet directed immune responses after intravenous ChAdOx1 nCov-19 administration (29th June 2021)\n\nhttps://www.biorxiv.org/content/10.1101/2021.06.29.450356v1\n\nThe authors conclude, ‘Our work contributes to the understanding of TTS and highlights accidental intravenous injection as potential mechanism for post-vaccination TTS.’ \n\n‘We show that intravenous but not intramuscular injection of ChAdOx1 triggers platelet-adenovirus aggregate formation and platelet activation.’ \n\n‘Hence, safe intramuscular injection, with aspiration prior to injection, could be a potential preventive measure when administering adenovirus-based vaccines.’\n\nAlso after giving mRNA vaccines\n\nA new study finds that giving mice intravenous mRNA vaccine also causes heart inflammation in mice. \n\nIntravenous Injection of Coronavirus Disease 2019 (COVID-19) mRNA Vaccine Can Induce Acute Myopericarditis in Mouse Model (August 2021)\n\nhttps://academic.oup.com/cid/advance-article/doi/10.1093/cid/ciab707/6353927\n\n‘Our study indicates that IV injection of vaccines might partially contribute to this clinical phenotype, thus warranting a reconsideration of the practice of IM injection without aspiration, which carries the risk of inadvertent IV injection.’ \n\nAgreement from ‘fact check’ from Leo Nicolai, Cardiology Fellow, Ludwig Maximilian University of Munich:\n\n(German Centre for Cardiovascular Research)\n\nhttps://healthfeedback.org/claimreview/incorrect-vaccine-administration-is-a-potential-cause-of-post-vaccine-adverse-effects-but-more-research-is-still-needed-to-confirm-or-reject-this-hypothesis/?fbclid=IwAR0nBbM6v0V2WPFn4LxIdfR4FNAvIzLGKhzFPdQPG8mu_FR1InB8OzYQgMc\n\n‘Indeed, there is peer-reviewed work showing in mice that possibly intravenous injection of mRNA vaccine leads to myocardial inflammation.’\n\n‘that intravenous injection of adenoviral vector based vaccine (AZ1222, ChAdOx1) leads to thrombocytopenia and platelet-directed immune responses, offering a possible explanation for vaccine-induced thrombosis/thrombocytopenia’\n\n‘these data might indicate a simple measure to lower the incidence of vaccine-induced side effects,’\n\n‘There is a lack of data on frequency and effects of IV injection in humans.’\n\nDenmark has changed their national guidelines\n\nhttps://en.ssi.dk/news/epi-news/2021/no-19-21---2021\n\nBased on a precautionary principle, we recommend aspiration before injection.\n\nhttps://www.youtube.com/watch?v=H7inaTiDKaU\n\nEvidence from Dr. Peter Gaillard (microparticulate pharmacologist)\n\nhttps://www.linkedin.com/pulse/astrazeneca-vaccine-pull-back-push-through-pieter-j-gaillard/?trk=pulse-article_more-articles_related-content-card \n\nCase study evidence\n\nMetallic taste in the mouth seconds after ‘intramuscular’ mRNA vaccine administration, (in the absence of an allergic reaction)\n\nhttps://www.youtube.com/watch?v=hbjuWs99CrE\n\nOther video-based discussions\n\n26th September 2021\n\nhttps://www.youtube.com/watch?v=nBaIRm4610o\n\n30th September 2021\n\nhttps://www.youtube.com/watch?v=KgVsd6qoyU4", "link": "https://www.youtube.com/watch?v=NVXA9posslo", "date_published": "2022-02-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]