[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Mon Laferte: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nFelix Contreras | January 12, 2022\nIt’s fair to say Mon Laferte is a musical chameleon. The Chilean vocalist’s output of late has covered a vast swath of musical styles from Latin America, from big-band mambo to electronic dance club jams with a hint of reggaeton, and a few stops in between. The secret to the successes of these stylistic changes is the level of imagination and creativity she infuses in each turn.\n\nSo, it didn’t surprise me that her contribution to our Tiny Desk (home) concert series is a visual treat as much as it is a musical one. The opening strains of “Tu Falta de Querer” introduce a cabaret-styled small orchestra and a character who appears to be left at the altar of a small intimate colonial church. She’s in torch-singer mode throughout the four-song performance; take these lyrics from the first cut: “Ahora domiré /  Muy profundamente para olvidar / Quisiera hasta la muerte, para no pensar / Me forro pa’ quitarme esta amarguara” (“Now I'll sleep very deeply to forget I would like, until death, not to think. I erase you to take away this bitterness”)\n\nThe 10-piece small orchestra is a combination of Mexican folkloric music and European chamber music, mixing the ukulele-like jarana, an oboe, a tuba, and the violins often used in mariachi. The arrangements are the perfect vehicle for Laferte’s impassioned combination of blues and ranchera vocals.\n\nThere is much to appreciate in Laferte’s celebration of the spiritual (the church setting) and the passions of everyday life (her torch singing). In fact, I can’t think of many other vocalists who would be able to pull this off with as much grace, style and artistic vision as Mon Laferte does.\n\nSET LIST\n\"Tu Falta de Querer\"\n\"Por Qué Me Fui A Enamorar de Ti\"\n\"Se Me Va A Quemar El Corazón\"\n\"Placer Hollywood\"\n\nMUSICIANS\nMon Laferte: vocals\nSebastián Aracena: guitar, docerola\nTonatiuh Mejía: piano\nDiana Gaby: tuba\nObed Calixto: guitar, docerola, jarana\nSantiago Ortiz: percussion\nAlonso Sánchez: flute\nIsmael Fernandez: clarinet\nArielle Amezcua: oboe\nBraulio Hernandez: bassoon\nObed Vazques: horns, spoons\nAlex Soto: vocals Auro: vocals\nCancamusa: vocals\nCarmen Ruíz: vocals\nDaniel Quién: vocals\nEle Huex: vocals\nEli Moya: vocals\nGrtsch: vocals\nIrina Índigo: vocals\nLa Morra De La Vihuela: vocals\nLorena Gutiérrez: vocals\nMati Santos: vocals\nMaxulyses: vocals\nMica Schlieper: vocals\nRulo: vocals\nVivir Quintana: vocals\n\nCREDITS\nDirector and Editor: Camila Grandi\nProduction Manager: Fernanda Casillas\nProducer: Florencia Quinteros\nProduction Assistants: Pamela Diaz, Jimena Garate\nAssistant Director: David Castañón\nColor: Sergio Bejarez\nDirector of Photography: Sebastián Cantillo\nCamera 1 AC: Sofía Ramos\nCamera 2 AC: Javier Silvestre González\nCamera Op: Pablo Bernst\nPhotographer: Fija Mayra Ortiz\nGaffer: Gustavo Calderón Rodriguez\nSteadicam: Enrique Moncada\nCamera Manager: Guillermo Vidal\nDigital Imaging Tech: Juan José Olivares\nArt Direction: Josechu Garrido\nSwings: Julio Santos, Eric Jasso\nMusical Production and Direction: Manu Jalil\nMixing Engineer: Abelardo Rivera\nMastering Engineer: Chalo González\nMusical Arrangement: Manú Jalil, Marco Uriel Jiménez\nRecording Engineer: Manú Jalil, Juan José León\nLocation: Bajo La Montaña\n\nTINY DESK TEAM\nProducer: Anamaria Sayre\nVideo Producer: Kara Frame\nAudio Mastering: Andy Huether\nTiny Production Team: Bob Boilen, Bobby Carter, Maia Stern, Josh Rogosin, Joshua Bryant, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #monlaferte", "link": "https://www.youtube.com/watch?v=Dy4pEFFbFsA", "date_published": "2022-01-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]