[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Andrew Bird and Iron & Wine: Tiny Desk Concert", "description": "Bob Boilen | August 12, 2022\nI'd been entertained and enchanted by the many of the 150 or so small concerts Andrew Bird performed on Instagram during the pandemic. Then I heard his new album, Inside Problems, and invited him to the desk. It had been six years since his first Tiny Desk performance, which was with a band; this time, I wanted an intimate solo performance. He and Iron & Wine's Sam Beam were becoming friends and touring together, and Andrew's idea was to have Sam perform on the final tune. But as they played together night after night on tour, that one song turned into four, and an Andrew Bird and Iron & Wine Tiny Desk was born.\n\nSam Beam is no stranger to the desk either. His first concert was a solo show in 2011, when the series was just a few years old. He returned with Calexico in 2019.\n\nThe two of them together are playful, poking fun at one another. \"We started learning each other's songs,\" Andrew says, \"I love Sam's writing\" — to which Sam retorts, \"I love your handwriting.\" The silly smiles launch them into the Iron & Wine song \"Flightless Bird, American Mouth\" from 2007.\n\nAn absolute favorite moment is when they perform Andrew Bird's \"Left Handed Kisses,\" performed originally as a duet with Fiona Apple and remade here with serious fun by our dynamic duo.\n\nThis concert occurred near the end of a nearly 30-city tour postponed by COVID. The two met in the waters of Yosemite in 2021, and I wouldn't be surprised to see more from this musical friendship in the years to come.\n\nSET LIST\n\"Make a Picture\"\n\"Flightless Bird, American Mouth\"\n\"Left Handed Kisses\"\n\"Orpheo Looks Back\"\n\nMUSICIANS\nAndrew Bird: vocals, violin, guitar, loop pedals\nSam Beam: guitar, vocals\n\nTINY DESK TEAM\nProducer/Series Creator: Bob Boilen \nAudio Engineer: Josh Rogosin \nDirector: Kara Frame \nSeries Producer: Bobby Carter \nEditor: Michael Zamora \nVideographers: Kara Frame, Michael Zamora, Pierre Kattar \nProduction Assistants: Jill Britton, Alanté Serene, Joby Tanseco\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #AndrewBird #IronAndWine", "link": "https://www.youtube.com/watch?v=WVfbIWC7wmE", "date_published": "2022-08-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "SFJAZZ Collective: Tiny Desk (Home) Concert", "description": "Suraya Mohamed | August 10, 2022\nHow exciting to see so many all-star jazz greats performing together. The SFJAZZ Collective is a talented cohort of artists who perform arrangements of works by modern composers and also newly commissioned pieces by each member of the band.\n\nIn 2020, the Collective was scheduled to perform an in-person Tiny Desk concert, but it was canceled due to the pandemic. We are still working to make that happen — but in the meantime, let’s enjoy this uplifting Tiny Desk (home) concert, recorded in The Joe Henderson Lab at SFJAZZ, a large, sunny venue that serves as both a live performance space and as the Collective’s rehearsal space.\n \nEarlier this year, the ensemble released New Works Reflecting the Moment (Live from the SFJAZZ Center 2021), an album addressing racial injustices, the ongoing pandemic and political polarization. In this concert, the musicians perform three songs from that project. “Ay Bendito” was written by tenor saxophonist David Sánchez, and its title is slang for “oh my God'' or “aw man”; it’s also subtitled “The Struggle Continues.”\n \nWritten to reflect the present moment, especially the isolation and social upheaval many of us continue to endure, “Mutuality” by tenor saxophonist Chris Potter was inspired by a Dr. Martin Luther King Jr. quote that reads, “Injustice anywhere is a threat to justice everywhere. We are caught in an inescapable network of mutuality, tied in a single garment of destiny. Whatever affects one directly affects all indirectly.” \n \nVocalist Gretchen Parlato’s “All There Inside '' was written with fellow SFJAZZ Collective vocalist Martin Luther McCoy in mind. Their voices fit together beautifully, and both the warm harmonies and the charming melody are the perfect foundation for Parlato’s inspiring message of hope and positive change: “Because it’s all there inside, all there inside of you.”\n \nSET LIST\n“Ay Bendito”\n“Mutuality”\n“All There Inside”\n\nMUSICIANS\nChris Potter: music director, tenor saxophone, winds\nDavid Sánchez: tenor saxophone\nEtienne Charles: trumpet\nWarren Wolf: vibraphone\nEdward Simon: piano\nMatt Brewer: bass\nKendrick Scott: drums\nGretchen Parlato: vocals\nMartin Luther McCoy: vocals\n\nCREDITS\nVideo: Robert Bambey, Diego Munguia\nAudio: Jeff Cressman, Josh Badura\n\nTINY DESK TEAM\nProducer: Suraya Mohamed\nVideo Editor: Joshua Bryant\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Michael Zamora, Maia Stern, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#TinyDesk #NPRMusic #SFJAZZCollective", "link": "https://www.youtube.com/watch?v=0VvdSqp69Lc", "date_published": "2022-08-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]