[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "MARVEL SNAP Official Cinematic Announcement Trailer and Gameplay Reveal", "description": "Learn more about Marvel Snap a new card battler from ex Hearthstone developers. Assemble your MARVEL dream team in this action-packed 1v1 multiplayer collectible card game. Coming to Mobile and PC.\n\nVisit https://marvelsnap.com to sign-up for the limited closed beta on Android or to get the latest news on when MARVEL SNAP will be available in your region. \n\n#MarvelSnap #Gaming\n\n00:00 - Animated Teaser\n01:12 - Fastest CCG in the Multiverse!\n02:16 - Deck Building\n02:35 - Cosmic Cubes, Modes, and SNAPs\n03:22 - Cards, Variants, and Live Ops\n05:19 - Card Art, Special Effects, Music and Sound Design\n06:25 - Sign-up for Closed Beta", "link": "https://www.youtube.com/watch?v=50AhqUGthEs", "date_published": "2022-05-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "MultiVersus Preview: More Than Just A Smash Bros. Clone", "description": "Warner Bros. and Player First Games' take on Smash Bros. packs action and personality into a F2P package.\n\nThe premise seems totally absurd when you read it: the all-powerful Superman teaming with cowardly and perpetually hungry teenager Shaggy to throw down against a shape-shifting dog Jake and a face-stealing assassin Arya Stark. This is real, however, and it's MultiVersus, the upcoming Warner Bros. platform fighter and the latest game to challenge Smash Bros. for its platform fighter throne. We got an early look at the upcoming closed alpha test, and so far MultiVersus is not only a viable challenger to Nintendo's all-star smasher, but it could be a glimpse at the future of fighting games in general.\n\nOn the surface, MultiVersus looks very similar to other platform fighting games, as the combatants zip around a stage with multiple ledges, throwing out attacks and trying to knock each other off of the screen. The names on the marquee may be different--Superman, Wonder Woman, and Batman from DC Comics, Bugs Bunny and Taz from Looney Tunes, Shaggy from Scooby-Doo, etc.--but the action at a glance stays with the tried-and-true Smash Bros. formula. \n\nIt's not entirely the same, however, and nowhere is that more apparent than in 2v2 team battles. Teams are split into red and blue teams, and the first team to score four knockouts wins. This is a slightly different approach to the stock battles of Smash Bros., as knockouts act as a scored point rather than one player losing a life. This scoring format allows both players to stay in the match the entire time, rather than one remaining player being at a disadvantage. Even with this change in scoring, the team battle mode sounds similar to other games that offer it, but there's a deeper level of strategy to consider here that sets MultiVersus apart, elevating it from potential Smash Bros. clone to a game that can stand on its own two feet. #Gaming #GameSpot #Multiversus", "link": "https://www.youtube.com/watch?v=AIfoVDDMhKY", "date_published": "2022-05-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Multiversus Closed Alpha Gameplay Livestream", "description": "David dives into Multiversus to try out the new closed alpha gameplay. He'll get time to play with characters like Shaggy, Bugs Bunny, Wonder Woman, Jake, Tom and Jerry and much more.\n\nIn the Multiversus closed alpha we get a look at the tutorial, advanced tutorial and various modes including 1 vs 1, teams 2 vs 2, co-op vs the AI, and 4 player Free For All. Additionally, you'll get a feel for the battle pass in the game as well as character progression. As each character levels they get access to more and more perks to enhance their characters play style. Learn more about the game in this gameplay livestream.\n\n#Multiversus #Gaming #GameSpot", "link": "https://www.youtube.com/watch?v=ruP6fiwahSs", "date_published": "2022-05-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Saints Row Preview: It Looks Okay", "description": "We got a hands off look at a Saints Row preview demo. Instead of following the over-the-top ending of Saints Row 4, developer Volition is rebooting the action-adventure franchise with a brand-new gang in Saints Row. \n\nDeveloper Volition showed off 40 minutes of new Saints Row gameplay at a recent hands-off preview. This game is a reboot of the open-world franchise that hasn't released a mainline entry since 2013's Saints Row IV. The game takes place in a brand-new setting: the southwest United States-Inspired Santo lleso. You play as a former member of a private military corporation organization called Marshall Defense Industries. In a familiar fashion to the series you and a group of characters--including a talented driver and a wannabe business entrepreneur--form your own crew called the Saints in order to fight your way to the top. \n\nThis Saint's Row steps back from outlandish sci-fi settings and focuses on a more grounded story. Unfortunately, that has seemingly translated into a by-the-numbers open-world crime game with a series of predictable loops. You go to your gang's hideout, figure out what you want to do next, jump in your car, drive to a point on your map, complete the mission, and return to base to pick the next mission. The world doesn't seem to react to you--beyond the cops attacking you if you draw too much heat--and the game features the same handful of missions that the Saints Row games have always had like \"cause a certain amount of damage in a limited time\" or \"fly to the bad guys' base and blow it up\" or \"save your friend before time runs out.\" You never actually need to understand the lay of the land or take note of the scenery because the world is one of destinations to go to and boxes to check. If it wasn't for the graphics, this new Saints Row would seem like a game I had played almost 10 years ago.\n\nCombat seems like it could be pretty fun, as it mixes in unorthodox weapons alongside more traditional firearms. There's nothing quite as extravagant as what was seen in Saints Row: The Third and Saints Row IV, but there are a few cool toys like a device that allows you to shoot through walls and a football that latches onto enemies and sends them flying into the air. But I'm worried that combat could get stale after a while. I watched what combat looked like against both the Los Panteros and the Idols and it seemed like the same run-and-gun strategy worked for both gangs, despite their members being quite visually different. \n\n Saints Row is now scheduled to release later this year, launching for Xbox Series X|S, Xbox One, PS5, PS4, and PC on August 23. #Gaming #GameSpot #SaintsRow", "link": "https://www.youtube.com/watch?v=aCPNqZygZI8", "date_published": "2022-05-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "V Rising Beginner's Guide: 7 Early Game Tips", "description": "V Rising, the survival-crafting game from Stunlock Studios is rocketing up the Steam charts. If you picked it up and are looking for some early game tips, then here is our beginner's guide to get you started. \n\nStunlock Studios' newest title is V Rising, a survival-crafting game that puts players in the shoes of a vampire who's looking to rebuild a lost empire. The gameplay is polished and the early access build seems to be fairly stable by all accounts. However, as with any new game, players are somewhat confused as to how to progress in the game. Whether this is through finding a specific material in the world or surviving the elements as a vampire, many players could benefit from a few tips and tricks.\n\nWe've compiled our top seven tips to navigate the early game of V Rising, from where to find whetstones, how to change blood type, how to make leather, and how to avoid the sun, we've got you covered. \n\nFor more on V Rising, make sure to subscribe to GameSpot on YouTube, or check GameSpot.com, we're frequently updating the site with new V Rising guides and walkthroughs. \n\n#VRising #Guide #Gaming", "link": "https://www.youtube.com/watch?v=XrlTVwpzBGI", "date_published": "2022-05-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Witcher 3 For PS5 & Xbox Series X|S Consoles Release Window Confirmed | GameSpot News", "description": "Witcher 3 for PS5 and Xbox and Series X|S Release window confirmed by CD Projekt Red, The Last of Us Remake is reportedly set to launch this holiday, and Warzone players are farming one part of Kong’s body for easy XP. \n#GamingNews #TheWitcher #TheLastofUs\n\nToday CD Projekt Red confirmed The Witcher 3's PlayStation 5 and Xbox Series X|S version will be released in Q4 2022. That means it'll launch in the October-December period… unless the dev decided to push it again.\n\nWe're still getting reports that a remake for 2013's The Last of Us is in the works, and it seems like it's scheduled to launch sometime this year. The remake will supposedly launch in the holiday season, which is currently fairly empty following Starfield's delay.\n\nCall of Duty: Warzone is currently home to a rematch between Kong and Godzilla in Operation Monarch and as discovered on Reddit's r/CODWarzone, it is possible to hop into a helicopter and attack the ape wonder of the world's upper thigh section.\n\nSTAMPS\n00:00 - Intro\n00:06 - Witcher 3\n01:08 - The Last of Us\n02:14 - Warzone", "link": "https://www.youtube.com/watch?v=YPCyNwro7fg", "date_published": "2022-05-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "23 Best Steam Deck Games You Should Play", "description": "If you just bought a Steam Deck and are wondering what to boot up first, we've rounded up a few of the best games to play on it, including major AAA hits like Elden Ring, under-the-radar indies such as Spiritfarer, and everything in between.\n\n0:00 - Intro\n0:38 - Elden Ring\n1:37 - Spiritfarer\n2:17 - Hitman 3\n2:45 - Disco Elysium\n3:19 - Final Fantasy Pixel Remasters\n4:00 - God of War (2018)\n4:36 - Left 4 Dead 2\n5:10 - Monster Train\n5:49 - Children of Morta\n6:14 - Rogue Legacy 2\n6:48 - Sable\n7:28 - Sea of Thieves\n8:13 - Unpacking\n8:38 - Valheim\n9:07 - Vampire Survivors\n9:41 - The Witcher 3\n10:14 - The Banner Saga Trilogy\n10:47 - Into the Breach\n11:20 - Ori and the Blind Forest\n11:57 - Rez Infinite\n12:39 - Totally Accurate Battle Simulator\n13:11 - Soma\n13:42 - Half-Life 2\n14:44 - Outro\n\n#SteamDeck #Gaming", "link": "https://www.youtube.com/watch?v=ikJ2AHADJVo", "date_published": "2022-05-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Final Fantasy 7 & 16 Info Coming | GameSpot News", "description": "Final Fantasy VII Remake part 2 news coming in June, Battlefield 2042 Season 1 launch targeting early June and Call Of Duty: Vanguard starts a free week of multiplayer.\n#GamingNews #FinalFantasy #Battlefield2042\n\nDuring a stream for the Final Fantasy VII: The First Soldier mobile battle royale game, director Tetsuya Nomura said that there will be some announcements surrounding Final Fantasy VII in June. This could be a sign that Square Enix will release information about Part 2 of the Final Fantasy VII Remake, as it suggested that the game would be revealed sometime during its anniversary year.\n\nDeveloper DICE confirmed today that the first season is expected to launch in \"early June.\" Season 1 will be the first of four seasons coming to the game in the span of 12 months. Players can expect four new Specialists, new maps, and \"more completely new content\" throughout the four seasons. DICE said it will share a \"full overview\" and the patch notes for Season 1 as its release draws closer.\n\nBattlefield 2042 4.1 Patch Notes: \nhttps://www.gamespot.com/articles/battlefield-2042-4-1-update-patch-notes-breakthrough-128-is-being-removed/1100-6503587/\n\nCall of Duty: Vanguard’s multiplayer mode is having a free access week starting today, May 18 until May 24. The event will include all maps and modes, including Season 3's new Mayhem map, Vanguard's large-scale Arms Race objective mode, the popular Ship Haus playlist, and more.\n\nSTAMPS\n00:00 - Intro\n00:08 - Final Fantasy 7 and Final Fantasy 16\n01:16 - Battlefield 2042\n02:25 - Call of Duty", "link": "https://www.youtube.com/watch?v=u5x1-_tNqiE", "date_published": "2022-05-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]