[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "IDK: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nSuraya Mohamed | May 18, 2022\nI first saw IDK perform in 2017. An infectious ball of energy, he captivated the audience with every vigorous bar and step; his personality filled the large stage that he only shared with a DJ.\n\nThere's a similar vibe at his (home) concert, actually recorded at his house, with a live audience of neighbors and friends and a palpable feeling of genuine hospitality and gratitude. Look at the deep blue paint on the walls IDK carefully selected, along with other adornments in his lovely Los Angeles home. Visually, the room is vivid yet calm, and sonically, his music has that same kind of feeling.\n\nHe starts with a lovely, slow version of \"Puerto Rico,\" from his 2021 album USEE4YOURSELF. Its lush harmonies and dynamic swells get you ready to dance for his next song, \"Taco,\" a house-influenced, gritty song from his new album produced by DJ prodigy Kaytranada. The album's title, Simple., references Simple City, a neighborhood in Southeast Washington, D.C. He wants the world to know that the fix to helping disadvantaged Black communities isn't as \"simple\" as you think.\n\nMore songs from the new record keep the cool vibe going. Though a lyrical rapper, IDK shows his singing acumen on \"Zaza Tree\" and \"Breathe,\" a musical adventure with the catchiest hook — \"let me catch my breath\" — and a stellar guitar solo from producer Mike Dean. \"'Breathe' is the most ME song I've ever made,\" IDK wrote on Twitter earlier this month, \"and for me It's proof that I'm still continuing to grow.\"\n\nThe set ends strong with \"The Code,\" a continuation of his new signature sound of alluring jazz harmonies, hard bass and driving rhythms.\n\nSET LIST\n\"Puerto Rico\"\n\"Taco\"\n\"Zaza Tree\"\n\"Breathe\"\n\"The Code\"\n\nMUSICIANS\nIDK: vocals\nDeshaun Allen: drums, percussion\nRon Allen: bass\nDerek Gamlam: keys\nKyla Moscovich: trumpet, flugelhorn, percussion, background vocals \nBrooke Brewer: background vocals \nChelsea Miller: background vocals \nMike Dean: guitar \nObi Nwadije: percussion\n\nCREDITS\nVideo: David Clair, Joe McGarry, Jason Arambulo\nAP: Mara Schele, Derek Griesbach\nDirector of Photography: Matthias Schubert \nCamera Operator: Austin Harris\nGaffer: Chris Walters\nColor: Emi Eck\nVideo Production: Special Order\nMusic Director: Brian London\nRecording Engineer: David Avetisian\nVocal Coach: Collin Boyd\nEngineer (Post Production): Eden Nagar\n\nTINY DESK TEAM\nProducer: Abby O'Neill\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Joshua Bryant, Michael Zamora, Maia Stern, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#NPRMusic #TinyDesk #IDK", "link": "https://www.youtube.com/watch?v=o63dR6rEs70", "date_published": "2022-05-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]