[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Everything We Want In The New Witcher Game", "description": "With novels, games, comics and now a television show, the Witcher is arguably bigger than ever. On March 21, 2022, CD Projekt Red announced the next game in the Witcher series has begun development and would be using the Unreal 5 Engine instead of REDengine. However, following the rough launch of the studio’s last game, Cyberpunk 2077, is it safe to be excited for another Witcher game? Well DeVante has enough hope for everyone and in this video he walks through everything he wants from the new Witcher.\n\n#Witcher #Lynx", "link": "https://www.youtube.com/watch?v=8NVuYLGjQf8", "date_published": "2022-03-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PlayStation’s Game Pass Could Reveal Next Week | GameSpot News", "description": "PlayStation’s service to compete with Xbox Game Pass could be revealed next week, GTA Online is adding a subscription service and Last of Us cast images leak. \n#GamingNews #PS5 #GTAV\n\nPlayStation is reportedly going to reveal its Xbox Game Pass competitor, codenamed \"Spartacus, as soon as next week. The subscription service will combine PlayStation Now and PlayStation Plus and consist of three tiers reportedly priced at $10, $13, and $16. \n\nRockstar Games has announced GTA+, a new membership program launching March 29 on PS5 and Xbox Series X|S that provides members with access to various extras and bonuses for $6 per month.\n\nNew images and video from the Last of Us set offer fans a closer look at Joel and Ellie as well as a first look at supporting characters Sam and Henry. In the games, the characters are sibling survivors who cross paths with Joel and Ellie. However, their meeting has a profound effect on Ellie throughout both games.\n\nSTAMPS\n00:00 - Intro\n00:10 - PlayStation\n01:28 - GTA Online\n02:25 - Last of Us", "link": "https://www.youtube.com/watch?v=d9hMbY0rs-g", "date_published": "2022-03-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "21 Ways To Windbomb In Breath of the Wild", "description": "Bomb Impact Launches, or Windbombs, are one of the most useful tricks in The Legend of Zelda: Breath of the Wild. Here are 21 ways to do them, and propel yourself around the map.\n\nSince its discovery by Satougashi back in September 2019, Windbombing has only gotten more complex over time. As people keep finding new ways to do this trick, the roster of windbomb types keeps expanding. Such as simple Fronthop Windbombs and Turn Windbombs, to Daruk's Vertical Windbomb which requires precise timing, the discoveries seem endless.\n\n0:00 Intro\n0:22 Windbomb Explanation\n0:52 Fronthop Windbomb\n1:09 Daruk's Fronthop Windbomb\n1:34 Vertical Windbomb\n1:44 Daruk's Vertical Windbomb\n2:00 Turn Windbomb\n2:13 Aiming Windbomb\n2:30 Delayed Windbomb\n2:45 Midair Windbomb\n2:54 Midair Linear Windbomb\n3:03 Spider Windbomb\n3:13 Bomb Arrow Windbomb\n3:20 Bomb Arrow SBR Windbomb\n3:27 Backflip Windbomb\n3:41 Horse/Cycle Windbomb\n3:48 Running Windbomb\n3:53 Walking Windbomb\n3:59 Cryonis Windbomb\n4:13 Updraft Windbomb\n4:18 Jelly Bounce Windbomb\n4:22 Shield Block Reset Windbomb\n4:29 Shield Jump Cancel Windbomb\n4:40 Outro", "link": "https://www.youtube.com/watch?v=05wj07NFdXA", "date_published": "2022-03-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring - 10 MORE Things You Didn't Know", "description": "Discover invisible platforms by firing arrows in this illusory themed episode.\n\nOur Soulsborne expert Dave Klein is here with another ten things about Elden Ring. This week's episode is an illusory theme episode. Dave explains how to find invisible platforms by using arrows and rainbow stones, organizing your items quickly and efficiently, keeping your runes after death, and the Abductor Virgin.\n\n00:12 - Invisible Platforms #1\n01:34 - Rainbow Stones\n02:17 - Arrows for platforms\n02:48 - Invisible Platforms #2\n04:05 - Item Categories\n04:30 - Item organization\n04:52 - Not Losing Runes upon Death\n06:00 - Pumpkin Head’s Helmet\n06:14 - The Ultimate Finger Maiden Husk\n07:39 - The Abductor Virgin", "link": "https://www.youtube.com/watch?v=YDzGJi43lcE", "date_published": "2022-03-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Would You Play Rainbow Six Siege Mobile? | GameSpot News", "description": "Rainbow Six, Assassin's Creed, and The Division Mobile Games are coming, the next Battlefield is reportedly in pre-production, and Warzone’s original map may never come back. \n#GamingNews #Warzone\n\nAccording to a report from The Exputer, Rainbow Six Siege mobile game will be revealed on April 6. The project is developed by Ubisoft in collaboration with Tencent's WeGame and Mobile games based on Assassin's Creed and The Division are also reportedly in the works. \n\nPre-production has reportedly begun on the next Battlefield game, and will see the series revert to its familiar roots after changes introduced in Battlefield 2042 weren't well-received. As for Battlefield 2042's future, EA and DICE are still required to release new specialists, modes, weapons, vehicles, and maps as part of its battle pass obligations\n\nAccording to Raven Software developer Josh Bridge,  Call of Duty: Warzone's original map, Verdansk, will not come back due to a technical issue preventing this from being possible. Instead, Activision is putting more effort into technical optimizations for Warzone to allow for big updates without such massive downloads.\n\nSTAMPS\n00:00 - Intro\n00:07 - Rainbow Six Seige\n01:06 - Battlefield\n02:37 - Call of Duty Warzone", "link": "https://www.youtube.com/watch?v=x79GxFCFVwg", "date_published": "2022-03-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]