[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "FIRST LOOK: \"Police on Trial,\" a Documentary Examining the Aftermath of George Floyd's Murder", "description": "In the new documentary “Police on Trial,” FRONTLINE and Pulitzer Prize-winning reporters from Minneapolis’ Star Tribune examine the aftermath of George Floyd’s murder.\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate. \n\n“You realize that … there’s far more to this case than they initially let on,” reporter Libor Jany says in the above excerpt from the film. “It raised a lot of doubts or questions in a lot of people’s minds of how many other incidents in the past had been, you know, shaped or sanitized by the cops.”\n\nThe documentary draws on unique on-the-ground reporting and filming, from the earliest days after George Floyd’s death, to documenting the trial and murder conviction of former police officer Derek Chauvin, to ongoing struggles for police accountability and reform in Minneapolis.\n\nThe full documentary \"Police on Trial\" premieres Tuesday, May 31 on PBS and online: https://www.pbs.org/wgbh/frontline/film/police-on-trial/\n\n“Police on Trial” is part of FRONTLINE’s Local Journalism Initiative, an innovative effort to support and strengthen investigative reporting in communities around the country funded by the John S. and James L. Knight Foundation and the Corporation for Public Broadcasting. The documentary is supported by The WNET Group’s Exploring Hate initiative and is a FRONTLINE production with Five O’Clock Films in association with Mike Shum Productions and the Center for Asian American Media (CAAM). The director and producer is Mike Shum. The producer and reporter is Marcia Robiou. The narrator/reporter is Libor Jany, along with reporters Andy Mannix, Liz Navratil, Liz Sawyer, Chao Xiong. The senior producers are Frank Koughan and Callie Wiser. The executive producer of FRONTLINE is Raney Aronson-Rath.\n\n#FRONTLINE #PoliceOnTrial #GeorgeFloyd\n\nFind FRONTLINE on the PBS Video App, where there are more than 300 FRONTLINE documentaries available to watch any time: https://to.pbs.org/FLVideoApp   \n\nSubscribe on YouTube: http://bit.ly/1BycsJW \nInstagram: https://www.instagram.com/frontlinepbs \nTwitter: https://twitter.com/frontlinepbs \nFacebook: https://www.facebook.com/frontline \n\nFRONTLINE is produced at GBH in Boston and is broadcast nationwide on PBS. Funding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Additional support for FRONTLINE is provided by the Abrams Foundation, the John D. and Catherine T. MacArthur Foundation, Park Foundation, the Heising-Simons Foundation; and the FRONTLINE Journalism Fund, with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation. FRONTLINE’s filmmaker-in-residence program is funded by the Hollyhock Foundation. FRONTLINE’s Local Journalism Initiative is funded with support from the John S. and James L. Knight Foundation and the Corporation for Public Broadcasting. Additional support for Police on Trial is provided by The WNET Group’s Exploring Hate Initiative, with principal support by Sylvia A. and Simon B. Poyta Programming Endowment to Fight Antisemitism, and additional major funding from Sue and Edgar Wachenheim III, Charlotte and David Ackert, The Peter G. Peterson and Joan Ganz Cooney Fund, and Patti Askwith Kenner. For a complete list of funders, please visit pbs.org/exploringhate", "link": "https://www.youtube.com/watch?v=tqyfgp7PUh0", "date_published": "2022-05-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "UN(RE)SOLVED: A Behind the Scenes Look at the Making of the Award-winning AR Exhibit | FRONTLINE", "description": "For the past year, the art installation portion of the Un(re)solved initiative has been traveling to cities across the United States. Visit https://www.pbs.org/wgbh/frontline/unresolved/installation to learn more and to see if the exhibit is coming to a town near you so you can have the experience yourself. \n\n“Anyone can read about something tragic that happened to somebody, but you automatically become this much closer to them when you have to say their name out loud. They become a much more real person to you; their experience becomes rooted in your own reality.”\n\nUn(re)solved is a major initiative that draws upon more than two years of reporting, thousands of documents and dozens of first-hand interviews. The multiplatform investigation tells the stories of lives cut short, and examines a federal effort to grapple with America’s legacy of racist killings through the Emmett Till Unsolved Civil Rights Crime Act.\n\n#AmericanHistory #BlackHistory #AugmentedReality #Art\n\nThe “Un(re)solved” project is an unprecedented, multiplatform investigation of civil rights era cold case killings that includes a web interactive experience; podcast mini-series; augmented-reality installation that can tour schools, libraries, and museums; a companion educational curriculum; and events.\n\nTo lead the creative vision for the interactive and installation, FRONTLINE partnered with Ado Ato Pictures, a premier mixed reality studio founded by artist, filmmaker and technologist Tamara Shogaolu. Shogaolu rooted the visuals of Un(re)solved in the powerful symbolism of trees. “I was really inspired by looking at the role of the tree as a symbol in American history,” Shogaolu said. “It’s been looked at as a symbol of freedom, we look at it as a connector between generations, and also there’s the association of trees with racial terror.” By turning the forests depicted throughout Un(re)solved into beautiful spaces, the artists sought to reclaim them for African Americans and to honor the victims.\nShogaolu was also inspired by the African American tradition of quilting. Among enslaved African Americans forbidden to read or write, quilts provided an important space to document family stories. Today, quilting remains a creative outlet rich with story and tradition. The artwork in Un(re)solved weaves in textures, motifs and patterns to create a quilt that the stories live within.\nIn the interactive, the stories are brought to life in part through impressionistic animations rooted in archival source materials. Shogaolu says this is a technique she uses in her artwork to help audiences remember that both the people and events in her stories are real. For Un(re)solved, the archival photos are transformed into colorful illustrations, given texture and layered with other imagery. For black and white images when colors were known, the artists tried to fairly represent them.\nSubscribe on YouTube:\nhttp://bit.ly/1BycsJW\nInstagram: \nhttps://www.instagram.com/frontlinepbs\nhttps://www.instagram.com/un_re_solved/\nTwitter:\nhttps://twitter.com/frontlinepbs\nFacebook: \nhttps://www.facebook.com/frontline\n\nFRONTLINE is produced at GBH in Boston and is broadcast nationwide on PBS. Funding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen. Support for Un(re)solved is provided by PBS; the Corporation for Public Broadcasting; the Abrams Foundation; the Jonathan Logan Family Foundation; The WNET Group’s Chasing the Dream, a public media initiative that examines poverty, justice, and economic opportunity in America, with major funding by The JPB Foundation and additional funding from The Peter G. Peterson and Joan Ganz Cooney Fund; the GBH Catalyst Fund; the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation; the Lisa and Douglas Goldman Fund; the Massachusetts General Hospital Cancer Center; The Barbra Streisand Foundation and Unity Software, Inc. through its Unity Charitable Fund, a fund of the Tides Foundation.", "link": "https://www.youtube.com/watch?v=C35xyMUYxv8", "date_published": "2022-05-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]