[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Modern Warfare 2 Release Date Confirmed, More Info Coming | GameSpot News", "description": "Call of Duty: Modern Warfare 2 gets an official release date, Battlefield 2042 winding down Hazard Zone mode, and Apex Legends players on Xbox suffer from cheaters. \n#GamingNews #ModernWarfare2 #Battlefield2042 \n\nActivision has revealed the release date of October 28, 2022 for Call of Duty: Modern Warfare 2 in a new trailer. The trailer teased appearances from Simon “Ghost” Riley,  Captain John Price, John \"Soap\" MacTavish, Kyle \"Gaz\" Garrick, and a new character, Mexican Special Forces Colonel Alejandro Vargas.\n\nDICE has announced that support for Battlefield 2042's Escape from Tarkov-inspired mode, Hazard Zone, is \"winding down.\" This news comes as DICE outlined what the team has learned since Battlefield 2042's rocky launch and what the teams are currently focusing on ahead of the launch of Season 1, set to release in June.\n\nFollowing Season 13's update on May 10, a few bugs popped up, but none of them seemed particularly serious--that is, until several reports emerged claiming that freshly killed squads were using some sort of exploit to crash servers.\n\nSTAMPS\n00:00 - Intro\n00:06 - Modern Warfare 2\n01:08 - Battlefield 2042\n02:09 - Apex Legends", "link": "https://www.youtube.com/watch?v=PzUEFJDpmZ4", "date_published": "2022-05-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PS5 Pro & New Xbox Coming In 2023? | GameSpot News", "description": "TCL thinks PS5 Pro and a new Xbox is coming in 2023 or 2024, fans create Starfield in Unreal Engine 5, and No Man’s Sky releases its Leviathan update. \n#GamingNews #PS5 #XboxSeriesX\n\nTCL claims that these consoles will provide 60-120 FPS at 4K resolution, as well as have the ability to display 8K. They will also apparently utilize AMD Radeon RX 7700 XT technology and release sometime between 2023 and 2024 according to the company. \n\nA group of talented artists have created its own interpretation of what Starfield may look like if it were to use Unreal Engine 5. Starfield won't run on Unreal Engine 5 but rather Bethesda's Creation Engine 2, an evolution of the game engine the studio has previously used for games like Fallout 4 and The Elder Scrolls V: Skyrim.\n\nNo Man’s Sky has a new update in which time is slightly broken. Out today, this update features a roguelike-style Leviathan expedition that gives players a single life to use when they attempt to break the loop, with each death resetting the timeline and sending them back to square one.\n\nSTAMPS\n00:00 - Intro\n00:08 - PS5 Pro & New Xbox \n01:35 - Starfield fan creation\n02:18 - No Man’s Sky update\n02:57 - Marvel MMO canceled", "link": "https://www.youtube.com/watch?v=6h3zpldah80", "date_published": "2022-05-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Modern Warfare 2 Official Release Date and Artwork Reveal Trailer", "description": "Get a glimpse of some of the artwork for Call of Duty: Modern Warfare II including the release date reveal for the game.\n\nIn Call of Duty: Modern Warfare II, Task Force 141 makes its massive return with a global squad of iconic veterans, these Operators include Captain John Price,  Simon “Ghost” Riley, John “Soap” MacTavish, Kyle 'Gaz' Garrick and introducing Mexican Special Forces Colonel Alejandro Vargas. \n\nCall of Duty: Modern Warfare II releases October 28, 2022.\n\n#CallOfDuty #ModernWarfare2 #COD", "link": "https://www.youtube.com/watch?v=IreHwba6FFk", "date_published": "2022-05-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Destiny 2: The Witch Queen - Season of the Haunted Official Trailer", "description": "Driven by an insatiable lust for power, Calus seeks the approval of a new master. His once-opulent ship, now derelict and corrupted, has returned to our galaxy—its sights set on the power promised by the Pyramid ship lying dormant on the Moon. \n\nAs the Leviathan forms a connection with the Pyramid, Nightmares of humanity’s past awaken and threaten to torment any who dare intervene. Stare into the abyss and find bravery within the mantle of the reaper and the steel of the scythe.\n\n#Destiny2 #SeasonoftheHaunted #Levithan #Gaming", "link": "https://www.youtube.com/watch?v=Xlp_Q6kV5gQ", "date_published": "2022-05-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Lord of the Rings: Gollum 7 Things We Learned", "description": "The Lord of the Rings: Gollum is an upcoming stealth-action game from Daedalic Entertainment, so Lord of the Rings expert Lucy James checked out what it's all about. #Gaming #GameSpot #Gollum\n\nGollum: a miserable, wretched creature from the works of J.R.R. Tolkien who’s easy to hate, and just as easy to pity. After playing bit parts in Bilbo and Frodo’s journeys and all the adaptations of them, he’s now going to be the main character in his own game: The Lord of the Rings: Gollum. \n\nGameSpot's Lord of the Rings expert Lucy James recently attended a hands-off presentation featuring Gollum gameplay and a Q and A session with the game's developers, Daedalic. In the video above, she describes what she saw from the game, including its stealth gameplay, other recognizable characters, like Gandalf and Thranduil, as well as famous Middle-earth locations like Cirith Ungol and Mirkwood.\n\nThe Lord of the Rings: Gollum launches on September 1, 2022, for PlayStation 4, PlayStation 5, Xbox One, Xbox Series X and S, and PC. It is confirmed to be coming to Nintendo Switch later this year, but there’s no release date just yet. That's the day before the upcoming Lord of the Rings TV series, The Rings of Power, launches on Amazon Prime Video.", "link": "https://www.youtube.com/watch?v=bxU3IEO56Is", "date_published": "2022-05-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]