[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Aurora - studio session, 2019 (audio only)", "description": "Norwegian singer-songwriter Aurora Aksnes — known professionally as Aurora — had first imagined the songs she was working on would comprise three albums, then one, before she firmly decided on two. \"I realized that with time, with a lot of thinking, I did realize that I have been writing about two very different parts, but of the same process I would say,\" she says. \"So it makes very much sense spiritually and musically to split it into two parts, so it makes sense now.\"\n\nThat first part, Infections of a Different Kind - step 1, released in September 2018. The second part was released in June 2019. While in town for a show in the First Avenue Mainroom, Aurora — along with bandmates Silja Sol, Fredrik Vogsborg and Magnus Skylstad — stopped at The Current for a session hosted by Mac Wilson.\n\nAurora is based in Bergen, a city on Norway's west coast that Aurora says is home to a thriving artistic community. \"It is a very good place to become a musician or a producer or artist,\" she explains. \"We're all very close; we all know each other and support each other. … There's a lot of indie music coming out from Bergen. It's a very good community; we're very lucky.\"\n\nBeyond Norway, Aurora is gaining a following worldwide, and after March 29, that reach may expand even further. Aurora was asked to contribute \"a very tender version\" of the song \"Baby Mine\" for Disney's upcoming Dumbo release. \"I kind of rediscovered the beauty of the song when I was asked very secretively to make a demo of it whilst being on tour in Brazil,\" Aurora says. \"I had to rent a studio over there and record it with some guy in the studio. … [It was] very secretive. It always is. But Disney is kind of magical, isn't it?\"\n\nUse the audio player above to listen to the complete session with Aurora as well as more of her interview with Mac Wilson, including their shared fondness for the TV series \"Arrested Development.\"\n\nSongs Played:\n00:00 \"Animal\"\n03:39 Interview segment 1 with host Mac Wilson\n07:26 \"Churchyard\"\n11:20 Interview segment 2 with host Mac Wilson\n17:20 \"It Happened Quiet\"\n\nFind more:\nAurora performs in The Current studio 2019:\nhttps://www.thecurrent.org/feature/2019/03/01/aurora-performs-in-the-current-studio\nAurora performs at Iceland Airwaves 2018:\nhttps://www.thecurrent.org/feature/2018/11/09/aurora-performs-at-iceland-airwaves\n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent?sub_confirmation=1\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/\nhttps://twitter.com/TheCurrent\nhttps://www.instagram.com/thecurrent/\n\n#aurora #auroraaksnes #auroramusic", "link": "https://www.youtube.com/watch?v=8ORo6ZyLnWU", "date_published": "2022-05-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]