[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Google is DESTROYING ITS BRAND", "description": "Try OnlyOffice, the best open source office suite for Linux: https://bit.ly/3IQRWfY\nGrab a brand new laptop or desktop running Linux:https://www.tuxedocomputers.com/en#\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to a weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYouTube: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n📹 MORE VIDEOS FROM ME\nLinux news in Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\nGaming on Linux: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nI'm also on ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\nAnd on PEERTUBE: https://tilvids.com/c/thelinuxexperiment_channel/videos\n\n🏆 FOLLOW ME ELSEWHERE:\nTwitter : http://twitter.com/thelinuxEXP\nInstagram: https://www.instagram.com/nick_thelinuxexp/\nMastodon: https://mastodon.social/web/@thelinuxEXP\nPixelfed: https://pixelfed.social/TLENick\n\nThis video is distributed under the Creative Commons Share Alike license.\n\n#Google #linux #cloud \n\n00:00 Intro\n00:43 Sponsor: OnlyOffice, the open source office suite for Linux, Windows, and macOS\n01:46 Google kills services if they're not quickly profitable\n06:10 The not super profitable exceptions: Pixel and Youtube\n09:02 Is this service killing frenzy really a problem, though?\n11:05 Should you still use new Google Services?\n12:48 Sponsor: Get a device that runs Linux perfectly, from Tuxedo\n14:02 Support the channel\n\nList of projects Google killed: https://killedbygoogle.com/\n\nLet's start with the biggest ones. Google+ for example. Google+ was Google's answer to Facebook, in the form of a big social network. it started with a ton of advantages. And it failed. Mostly because it wasn't different enough that people wanted to rebuild their whole communities there.\n\nThen, we have Google Reader. This service was basically what made RSS feeds useful. Again, a service that wasn't marketed or explained, even though it had the potential to turn into a very good business.\n\nNext, and more recently, Stadia. Stadia was Google's game streaming service, and it has the best tech available.\n\nAnd there are tons of others: the dozens of messaging services like hangouts, Allo, or wave, the Google magazines kiosk, the google play TV and movies app, Inbox, Google cloud print, google cardboard, Picasa, and a lot of others, a lot of which had great tech, and good potential.\n\nBut that's not true of every service, there are exceptions. Like the Nexus programme, that then turned into the Pixel range of devices. \n\nPixel doesn't bring in much revenue for Google. In 2021, it was estimated to be about 8 billion dollars. That's no small change, but compare that to the total 260 billion they made in 2021, it's nothing. Youtube is also a small business for Google.\n\nSo, yes, Google CAN stick with services or products that aren't big money makers, or aren't profitable at all. But that's only IF these things are contributing so much to Google's other businesses that closing them down would hurt ad revenue in the long run.\n\nAnd so, unless Google's latest service or app is something that helps them collect more data or sell more ads, its longevity is about 3 years.\n\nhttps://www.theverge.com/2022/2/1/22912196/google-alphabet-200-billion-annual-revenue-youtube-pixel-search\n\nBut is that really an issue?\n\nWell there are multiple problems. First, as a user, it's never fun to have something you use and rely upon being shuttered. Second, you can lose money you invested.\n\nAnd also, there's an image problem: when you like a service or product, you tend to recommend it to other people. You praise it, and you tell others to try it. When that service crashes down, you're left looking like an idiot for wasting your friend's time and money.\n\nAnd the last big problem is consumer confidence: with Google killing services left and right, no one is actually confident that anything new will last long enough that it's worth it to learn how to use it or invest money in it.\n\nSo, it actually IS an issue that google kills services too fast, or launches them without ever thinking about their business plan. Just because their image as a company is severely damaged with each service's death, and also because it puts users in a bad position.", "link": "https://www.youtube.com/watch?v=7vwiaBcesaE", "date_published": "2022-11-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]