[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "WHO, YouTube and funding", "description": "WHO and YT\n\nhttps://www.who.int/teams/digital-health-and-innovation/digital-channels/combatting-misinformation-online\n\nWHO works with social media policy departments to ensure company policy and guidelines for content providers are fit for purpose.\n\nJohn’s e mail\n\nenquiries@drjohncampbell.co.uk\n\nhttps://www.who.int/campaigns/connecting-the-world-to-combat-coronavirus/how-to-report-misinformation-online\n\nWHO provide a helpful guide on how to report misinformation online\n\nInaccurate information spreads widely and at speed, \n\nmaking it more difficult for the public to identify verified facts and advice from trusted sources, such as their local health authority or WHO.\n\nhttps://support.google.com/youtube/answer/9795167?hl=en\n\nAs a starting point in the UK, only NHS organisations are being invited to self-certify against the NHS Standard for Creating Health Content. \n\nBy completing the self-certification process, an NHS organisation channel will be eligible for information panels indicating NHS credibility. \n\nFrom FDA to MHRA: are drug regulators for hire?\n\nhttps://www.bmj.com/content/377/bmj.o1538.full\n\nRegulatory agencies, large proportions of their budgets,\n\nfunded by the industry they are sworn to regulate\n\nUS Food and Drug Administration (FDA)\n\n1992, Prescription Drug User Fee Act, allowing industry to fund the US Food and Drug Administration (FDA) directly through “user fees” \n\nNet PDUFA fees collected\n\n$29m in 1993\n\n$884m in 2016 (65% of budget)\n\nFDA, 9 out of 10 of its past commissioners between 2006 and 2019 went on to secure roles linked with pharmaceutical companies\n\nEuropean Medicines Agency (EMA)\n\nIndustry fees funded 20% European Medicines Agency (EMA), in 1995\n\nBy 2010, 75%\n\nToday, 89%\n\nMedicines and Healthcare Products Regulatory Agency (MHRA)\n\n86% of funding from Pharmaceutical Industry\n\nAustralia\n\nhttps://www.tga.gov.au\n\nProportion of TGA budget derived from industry, 96%\n\nWHO funding\n\nhttps://app.powerbi.com/view?r=eyJrIjoiNzNmNTRkMWEtNmZjMS00NzdjLWEyMDYtYWExYzA4NzVhZGQwIiwidCI6ImY2MTBjMGI3LWJkMjQtNGIzOS04MTBiLTNkYzI4MGFmYjU5MCIsImMiOjh9\n\nhttps://www.weforum.org/agenda/2020/04/who-funds-world-health-organization-un-coronavirus-pandemic-covid-trump/\n\nThe second-largest funder is the Bill and Melinda Gates Foundation, which provides 9.8% of the WHO's funds\n\nAppendix\n\nhttps://genius.com/George-orwell-nineteen-eighty-four-appendix-the-principles-of-newspeak-annotated\n\nhttps://www.orwell.ru/library/novels/1984/english/en_app\n\nIt was expected that Newspeak would have finally superseded Oldspeak (or Standard English, as we should call it) by about the year 2050\n\nThe purpose of Newspeak was not only to provide a medium of expression for the world-view and mental habits proper to the devotees of Ingsoc, but to make all other modes of thought impossible.\n\nThe C vocabulary was supplementary to the others and consisted entirely of scientific and technical terms. These resembled the scientific terms in use today, and were constructed from the same roots, but the usual care was taken to define them rigidly and strip them of undesirable meanings.\n\nWar is peace, freedom is slavery, ignorance is strength\n\nNext Monday, 14th November, evidence based medicine confrence\n\nhttps://www.eventbrite.co.uk/e/has-big-pharma-hijacked-evidence-based-medicine-tickets-444525075467", "link": "https://www.youtube.com/watch?v=05GGaCBk9Mo", "date_published": "2022-11-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]