[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 Just Got Better, Again! | GameSpot News", "description": "Cyberpunk 2077 has already received some substantial upgrades this year and now patch 1.61 has been announced for PC, console, and Stadia (rest in peace). Several fixes for multiple missions will be added, as a number of these \"Gigs\" had issues where elements weren't being properly triggered inside of the game. Visually, you'll see Night City residents carrying umbrellas, various floating items will rediscover the pull of gravity, and a bug related to missing collisions won't make you fall through the map. As for gameplay, it'll be possible to craft a legendary variant of the Amnesty Iconic revolver, clothing bonuses related to Quickhack cooldowns and crit damage will start working, and weapons will be able to deal more explosive damage. \n\nPatch Notes: https://www.gamespot.com/articles/new-cyberpunk-2077-patch-gives-everyone-in-night-city-an-umbrella/1100-6508989/\n\nGod of War Ragnarok  is almost here and it goes without saying that this is one patch that you'll definitely want to install before booting up the game, as it seems to fix a wide variety of bugs, crashes, and other technical issues that would otherwise mar your experience.\n\nPatch Notes: \nhttps://www.gamespot.com/articles/god-of-war-ragnarok-day-one-patch-notes-crucial-bug-fixes/1100-6508994/\n\nHalo Infinite Winter Update weapon changes: \nhttps://www.gamespot.com/articles/halo-infinites-winter-update-is-bringing-heaps-of-weapon-balance-changes/1100-6508857/\n\nSTAMPS\n00:00 - Cyberpunk 2077\n01:20 - God of War Ragnarok\n02:10 - Halo Infinite", "link": "https://www.youtube.com/watch?v=wYeasGyLUiU", "date_published": "2022-11-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War Ragnarok - 4K PS5 Gameplay", "description": "Ragnarok is here! Take a look at the first 30 minutes of God of War Ragnarok running on the PS5 in glorious 4K. This was captured with the \"Favor Resolution\" graphics setting which prioritizes visual fidelity over framerate.\n\n#godofwarragnarok #gaming #gamespot", "link": "https://www.youtube.com/watch?v=ebF_DC7PhPo", "date_published": "2022-11-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War Ragnarok Early Game Tips", "description": "We’ve put together our best spoiler-free tips for God of War Ragnarok in this beginner's guide.\n\nVideo Notes:\n00:00 - Intro\n00:17 - Keep an eye out for loot in the water\n00:49 - Listen for ravens\n01:30 - Train in Niflheim\n02:04 - Make use of Atreus’ arrows during combat\n02:51 - Check the lost items chest frequently\n03:14 - Don’t fret over skills too much\n03:57 - Don’t skimp on upgrades\n04:36 - Nornir chests are always worth the hassle\n05:09 - Sell your artifacts\n05:32 - Compete in Muspelheim challenges\n06:04 - Look over the accessibility features", "link": "https://www.youtube.com/watch?v=5dIppH68Syc", "date_published": "2022-11-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Need for Speed Unbound Takeover Event Gameplay Trailer (ft. A$AP Rocky)", "description": "Get a glimpse of the Takeover Event Gameplay in this latest Need for Speed Unbound trailer. Take over sections of the city by pulling huge drifts, smashing collectibles, and proving your skills to Lakeshore’s most stylish street racers. This is all about steez over speed, but don’t be afraid to go fast too. Now you got it, go make Rocky proud.\n\nStart at the bottom and race to the top in Need for Speed Unbound, coming to PlayStation 5, Xbox Series X|S and PC on December 2, 2022.\n\n#needforspeed #needforspeedunbound #gaming", "link": "https://www.youtube.com/watch?v=jvFIwzAAx_Q", "date_published": "2022-11-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Scarlet and Pokémon Violet | Ed Sheeran \"Celestial\" Official HD Pre-Order Trailer", "description": "Join forces with other Trainers from around the world to battle the mightiest Pokémon in Paldea!\n\nPreorder Pokémon Scarlet and Pokémon Violet today and get ready for an exciting adventure in Paldea! \n\nBackground Music: \"Celestial\" - Ed Sheeran", "link": "https://www.youtube.com/watch?v=7vzgCFtgV0o", "date_published": "2022-11-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Beware: Pokémon Scarlet And Violet Leaks Early | GameSpot News", "description": "Pokemon Scarlet and Violet spoilers have begun to pop up online, 2 weeks ahead of release.\n#GamingNews #Pokemon #Nintendo\n\nA copy of Pokémon Scarlet and Violet has worked its way into the hands of a leaker, with several posts from that person appearing in the Pokémon Scarlet and Violet subreddit.\n\nThe posts show off a couple new monsters alongside the evolutionary forms for starter Pokémon Fuecoco and olive Pokémon, Smoliv. So if you’re sensitive to that type of spoilers then you'll want to start looking at muting keywords on social media.\n\nWhen it comes to new Pokemon that haven’t leaked, Gimmeghoul was revealed over the weekend and the official Pokemon Twitter account has announced a new trailer for Pokemon Scarlet and Violet will air tomorrow November 8 at 6 AM PT / 9 AM ET.\n\nBut let’s say you’ve seen enough Pokemon trailers and you want something new to get excited for, then you might want to pay attention to Wednesday November 9th. \n\nThere is a Nintendo Indie World Showcase scheduled to take place Wednesday, November 9 at 9am PT / 12pm ET and it will run for about 25 minutes. There have not been any specific games mentioned, but for comparison sake, the last Indie world features games like Ooblets, Silt and Gunbrella, a game that I recently played a demo for on Steam Deck and I’m very excited for the full release. \n\nAnother game I’m waiting for is Final Fantasy XVI, a game that you’ll need a PS5 for if you’re not willing to be patient. We’ve already known for some time that the game would be an exclusive, but now a new Playstation commercial has confirmed–at around the 14 second mark–that FF16 will be a PS5 exclusive for only 6 months. This timeframe pales in comparison to another upcoming Square Enix release, Forspoken, which launches January 24 and will be a PlayStation console exclusive for two years\n\nSTAMPS\n00:00 - Pokémon Leaks\n01:13 - Indie World\n01:37 - Final Fantasy XVI\n02:20 - Ubisoft on Steam?", "link": "https://www.youtube.com/watch?v=9Sp5MmAw8Us", "date_published": "2022-11-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sonic Frontiers First 20 Minutes of Gameplay", "description": "Sonic is back with Sonic Frontiers, and here are the first 20 minutes of Kronos Island, the first of many open zones Sonic finds himself in.\n\nSonic Frontiers is Sega's latest foray with their titular mascot, Sonic the Hedgehog. For Sonic Frontiers, they've taken inspiration from The Legend of Zelda: Breath of the Wild, while also learning from the failures and successes of previous titles like Sonic Forces, to create an all new style for Sonic Frontiers with an Open Zone gameplay.\n\nSonic Frontiers features two main segments, open zone gameplay moments and cyber space levels similar to former Sonic games. The Open Zone gameplay is reminiscent of other open world games, with Sonic free to explore and tackle challenges as he pleases, all while gathering various items and upgrades he'll need to progress both the story and his stats.\n\nNew to Sonic Frontiers is a completely revamped battle system, allowing Sonic to not only bash enemies, but also combo and chain various attacks against them, with many mini-bosses forcing players to use Sonic's speed and platforming skillset, along with combos, to defeat them.\n\nIn this video, you'll see both the Open Zone of Kronos as well as multiple Cyber Space levels.\n\n#sonicfrontiers #sonicgameplay", "link": "https://www.youtube.com/watch?v=Nv4DNw71JEo", "date_published": "2022-11-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sonic Frontiers Review", "description": "Sonic Frontiers marks a bold new direction for the series, meshing traditional Sonic action with an open-ended approach to progression and exploration across its semi-open world.", "link": "https://www.youtube.com/watch?v=GCZmQWoZOCo", "date_published": "2022-11-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]