[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Denzel Curry: Tiny Desk Concert", "description": "This year, NPR Music is celebrating Black Music Month with an array of brand new Tiny Desk concerts — both from home and from behind our beloved Desk. Together, these artists represent the past, present and future of Black music. This month of carefully curated shows is a celebration of Black artists expressing themselves in ways we've never seen before, and of the Tiny Desk's unique way of showcasing that talent.\n\nAshley Pointer | June 29, 2022\nAfter taking a sip of his tea towards the end of his six-song set, Denzel Curry turns to his band and exclaims: “We lowkey breezed through this b****! That’s great for two rehearsals!” \n\nFrom the moment Curry and his people stepped foot into NPR headquarters to record their Tiny Desk concert, the vibes were right. With a 10-piece configuration — consisting of drums, bass, keys, guitar, horns and percussion — the rapper put on a flawless and inspired live performance of songs off his latest LP as well as some of his biggest hits, all freshly arranged for the Tiny Desk.  \n\nOver the course of a decade, Curry has released a number of albums and EPs, becoming one of the most versatile emcees in hip-hop today. His sixth studio album, Melt My Eyez See Your Future, marked a new artistic beginning for him: infusing neo-soul, jazz and traditional hip-hop influences into the album, with less “rah” and more mature introspection. Throughout this concert, you get a little bit of both. \n\nCurry and the Cold-Blooded Soul Band open their set with “Melt Session #1,” a feel-good neo-soul groove where Curry’s introspective lyrics flow beautifully, taking center stage. Then kicking it up a notch, Curry performs “Walkin” and “Troubles” with an assist from DJ POSHtronaut, employing some serious bounce complimented by catchy horn lines. In the second half of his set, Curry takes us back with “DIET_.” Evoking instant head-bops as bass and drums smoothly lock in, Curry charms our audience with his improvised rhymes and exuberant personality.  \n\nAs Curry and the band closed out the concert going absolutely bonkers with “RICKY,”  I could feel how light the room had gotten as everyone in the audience fed off Curry’s infectious energy fueled by distorted guitar and bass and punchy horns. “You know I killed that s***. You know I murked that s***!” Yes, Denzel Curry. Yes you did. \n\nSET LIST\n“Melt Session #1”\n“Walkin”\n“Troubles”\n“DIET_”\n“CLOUT COBAIN | CLOUT CO13A1N”\n“RICKY”\n\nMUSICIANS\nDenzel Curry: vocals\nDJ POSHtronaut: vocals\nMarcus Paul: trumpet \nBrandyn Phillips: trumpet\nTim McKay: saxophone/flute\nAlex Csillag: trombone\nBrian Gazo: percussion\nBrian Patterson: drums\nJay Winfield: keys\nJack Siegel: guitar\nDavid McKinzie: bass\n\n\nTINY DESK TEAM\nProducer: Bobby Carter\nAudio Recording & Mix Engineer: Josh Rogosin\nDirector: Joshua Bryant\nEditor: Kara Frame\nSeries Creator: Bob Boilen\nVideographers: Kara Frame, Joshua Bryant, Michael Zamora, Pierre Kattar, Alanté Serene\nProduction Assistant: Ashley Pointer\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Jill Britton, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #BMM #denzelcurry", "link": "https://www.youtube.com/watch?v=glHqWvkpRqo", "date_published": "2022-06-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]