[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCsXVk37bltHxD1rDPwtNM8Q", "title": "The Last Human – A Glimpse Into The Far Future", "description": "Because of the potential size of the future, the most important thing about our actions today might be their impact on future generations. This simple-sounding idea has some surprising moral implications: https://80000hours.org/kurzgesagt-last-human\n\nSources & further reading: https://sites.google.com/view/sources-last-human/\n\nThis video was created in partnership with the Open Philanthropy Project\n\nKurzgesagt in 8 languages: https://linktr.ee/kgs_international\n\nThe future of humanity seems insecure. Rapid climate change, political division, our greed and failings make it hard to look at our species with a lot of optimism and so many people think our end is in sight. But humans always thought they lived in the end times. Every generation assumes they’re important enough to witness the apocalypse and then life just goes on. \nThis is a problem because it leads to short term thinking and prevents us from creating the best world for ourselves and our descendants. What makes this worse is that we actually may live at an extremely critical moment in human history. To understand why, let us look at the temporal window of humanity and ask:\nWhen will the last human be born and how many people will there ever be? \n\nOUR CHANNELS\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nGerman:        https://kgs.link/youtubeDE\nSpanish:        https://kgs.link/youtubeES\nFrench:          https://kgs.link/youtubeFR\nPortuguese:  https://kgs.link/youtubePT\nArabic:           https://kgs.link/youtubeAR\nHindi:             https://kgs.link/youtubeHI\nJapanese:     https://kgs.link/youtubeJA\nKorean:          https://kgs.link/youtubeKO\n\n\nHOW CAN YOU SUPPORT US?\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThis is how we make our living and it would be a pleasure if you support us!\n\nGet Merch designed with ❤  https://kgs.link/shop-163  \nJoin the Patreon Bird Army 🐧  https://kgs.link/patreon  \n\n\nDISCUSSIONS & SOCIAL MEDIA\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nReddit:            https://kgs.link/reddit\nInstagram:     https://kgs.link/instagram\nTwitter:           https://kgs.link/twitter\nFacebook:      https://kgs.link/facebook\nDiscord:          https://kgs.link/discord\nNewsletter:    https://kgs.link/newsletter\n\n\nOUR VOICE\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThe Kurzgesagt voice is from \nSteve Taylor:  https://kgs.link/youtube-voice\n\n\nOUR MUSIC ♬♪\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\n700+ minutes of Kurzgesagt Soundtracks by Epic Mountain:\n\nSpotify:            https://kgs.link/music-spotify\nSoundcloud:   https://kgs.link/music-soundcloud\nBandcamp:     https://kgs.link/music-bandcamp\nYoutube:          https://kgs.link/music-youtube\nFacebook:       https://kgs.link/music-facebook\n\nThe Soundtrack of this video:\nSoundcloud: https://bit.ly/3A5LwaB\nBandcamp: https://bit.ly/3OzdsIs\n\nIf you want to help us caption this video, please send subtitles to subtitle@kurzgesagt.org\nYou can find info on what subtitle files work on YouTube here:\nhttps://support.google.com/youtube/answer/2734698?hl=en-GB&amp;ref_topic=7296214\nThank you!\n\n🐦🐧🐤 PATREON BIRD ARMY 🐤🐧🐦\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nMany Thanks to our wonderful Patreons (from http://kgs.link/patreon) who support us every month and made this video possible: ziipzaaapM16A4, Filippo, Alloy robot, Harold Mabin Jr, Toby Lowe, BiohazardVictim, Riad Salihu, Gunnstein Lye, Jeff Wheeldon, Andy Kelly, Quenby Joanette, Daniel Schulte-Hillen, Val Kabalkin, Maximilian Thomas Goldstein, Tyler Lindberg, Felix, Davesanify, Russ Newman, Kira, Thomas Schenck, Skyler Stanley, dirk from wellington, LoveGiants (Polyamorous) Seeking 4 BrotherHusbands, BalrogWing, Coffee is the path to victory, Addie, Lucas, vb, Santiago Perez, Robert Walsh, Angus Jake Smith, JamesDBartlett3, Marlison Gosalvez de Alencar, Rahul Golwalkar, Keerthi Vasan, Brian Bradley, Lincoln Volk, Haubrechts, Avalanche, Craig B, Tina Hatch, Nathan Ornat, Amathara, khalifa almehairbi, jtfletchbot, Steven Zeck, Maurice Ibler, Bafy78, Andreas Høve Smidt-Nielsen, Victoria Camp, Andrew Dawson, pierluigi valente, GH, Jay C, Sergey Melnik, CultistLemming, Thane Stevens, Alex MacKay, SimpleAvocado, Dave Kircher, Karen Rosenow, James Pita, Kyron", "link": "https://www.youtube.com/watch?v=LEENEFaVUzU", "date_published": "2022-06-28 14:00:23+00:00", "persistent": false, "user": null, "language": "en-US"}]