[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Warhammer 40,000: Darktide’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down more of the weaponry of Warhammer 40,000: Darktide, including the iconic Boltgun, the versatile Grenadier Gauntlet, and an M79 Grenade Launcher in space.\n\n00:00 - Opening\n00:45 - Braced Autogun\n02:04 - Shredder Autopistol\n03:35 - Purgation Flamer\n06:41 - Grenadier Gauntlet\n08:01 - Spearhead Boltgun\n11:09 - Infantry Lasgun\n12:18 - Ripper Gun\n14:23 - Combat Shotgun\n17:05 - Helbore Lasgun\n18:26 - Quickdraw Stub Revolver\n21:02 - Twin-Linked Heavy Stubber\n23:43 - Grenade Launcher\n24:48 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Warhammer 40,000: Darktide and compares them to their potential real-life counterparts, of which there are unsurprisingly few.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=o9lzIC05aHU", "date_published": "2022-12-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fornite Chapter 4 A New Beginning Official Trailer", "description": "We get our first tease and glimpse at what's to come in season 4 of Fortnite which is releasing on December 4th. We got to see some cross collaborations with Hulk, Doom Slayer, Geralt of Rivia, and what appears to be Youtube influencer Mr. Beast. \n\n#fortnite #fortniteseason4", "link": "https://www.youtube.com/watch?v=eFbR9eXb_HY", "date_published": "2022-12-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite Chapter 3 Finale Full Event Gameplay", "description": "Watch as Chapter 3 of Fortnite heads to an end. We work with other players to collect enough Zero Fragments to initiate Zero Fusion. What does the next chapter of Fortnite hold for us? We'll find out soon enough. We even got a tease at the end with a cinematic that showcased some collaborations including Doom Slayer, Hulk, and Geralt of Rivia. \n\nIntro 0:00\nOpening Cinematic 0:25\nStuck In Space Opening 2:34\nLanding on the Island 4:25\nCollecting Zero Fragments 5:18\nEnding of Fracture Event 36:05\nChapter 4 Teaser Trailer 36:25\nTeaser Loading Screen before Chapter 4 37:41\n\n#fortnite #fracture #gaming", "link": "https://www.youtube.com/watch?v=XW7SeMLOqR4", "date_published": "2022-12-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokemon Scarlet & Violet - What To Do Once You've Finished The Game", "description": "Pokémon Scarlet & Violet is a big game, and there’s even more to do after the credits roll. Here’s what to do once you beat the game.\n\nSo, you’ve finished Pokemon Scarlet or Violet and you’re wondering what to do next. Well, we’ve got you covered. Even without the Battle Tower, here are some activities that will keep you busy for dozens of hours.\n\nTechnically Scarlet and Violet’s story doesn’t end with the credits. Geeta will ask you to check in on all the gym leaders in Paldea. Of course, a “check-in” means a battle and each gym leader will hit you with everything they’ve got. Once you’ve defeated all the gym leaders for a second time, you will be able to participate in the school tournament. This allows you to rematch your friends and teachers at top form. You’ll need to do it at least once to complete the post-game story content, but you can technically participate in this tournament as many times as you want. Additionally, you can also battle team Stars generals again if you return to their base.\n\nOnce you’ve completed the tournament, Jacq will give you a call and tell you about difficult tera raids popping up all over Paldea. Do a few of these and he’ll call you again to warn you about even tougher, 6-star raids. 6-Star raids have a pink glowing outline on the map and can be significantly tougher than 5-star raids depending on the Pokemon and its typing. When it comes to these raids, I highly recommend squadding up with some friends or matchmaking with randoms.\n\nYou can always join other raids as well via the PokePortal in the pause menu, but it can be tough actually getting into raids from this menu. Your best bet is to wait until you can refresh the raid list and join something quickly.\n\nWhy should you do these difficult raids? The rewards for completing 5 and 6-star raids are usually worth the trouble. 5 and 6-star raids typically feature rare Pokemon with fantastic base stats. Even if you do manage to catch one of these rarer Pokemon in the wild it’s stats will be inferior. You can check a Pokemon’s base stats, or Individual Values, but pressing plus on a Pokemon in the boxes menu. The word “Best” next to a specific stat means its IV for that stat is perfect! “No Good” means its IV for that stat is 0. It’s worth noting that you can’t see a Pokemon’s IVs until you’ve finished the game and stopped by a Pokemon Center. Doing so will unlock the judge function.\n\nAlong with the powerful Pokemon, 5 and 6 star raids could potentially net you some rare items: Ability capsules, ability patches, and Herba Mystica. Ability capsules let you change a Pokemon’s ability while ability patches let you change a Pokemon’s ability to its hidden ability if it has one. These items are incredibly useful if you plan on putting together some competitive teams. Meanwhile herba mystica, if used properly, can dramatically increase your odds of finding a shiny Pokemon.\n\nIf you’re having trouble with these raids, I recommend heading back to the depths of Area Zero to catch your extra Muraidon or Koraidon depending on your version. You can technically use your ride legendary in raids, but it's nice having an extra one in your boxes just in case.", "link": "https://www.youtube.com/watch?v=DxQhjKNOPFM", "date_published": "2022-12-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Callisto Protocol's Goriest Deaths", "description": "The Callisto Protocol has some of the grossest, gnarliest death in gaming, and we're going show them to you. Warning: does contain spoilers for all enemy types and the final boss.\n\n#callistoprotocol #gaming", "link": "https://www.youtube.com/watch?v=F2OE-naWYjI", "date_published": "2022-12-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Every Rumor And Leak For The Game Awards 2022 | GameSpot News", "description": "Star Wars Jedi: Survivor, Hideo Kojima's next project, and more reveals at this year's Game Awards, info on Assassin's Creed Mirage's release date, and sign up for the weekend's Hyenas Alpha. \n#GameAwards #StarWars #HideoKojima #AsassinsCreed \n\nWe’re days away from the Game Awards, with leaks and rumors coming in thick and fast. Here’s a roundup of the biggest things we expect to see at the event.\n\nThere’s a really strong chance we’ll be getting a look at the upcoming sequel to Star Wars Jedi: Fallen Order; Jedi: Fallen Survivor. According to Jeff Grubb of GameSpot sister site, Giant Bomb, marketing for the game will be kicking off in December and expects the launch of the title to be March 2023. Then, Insider Gaming provided specific details around the game’s presence at the Game Awards, including a new trailer, release date, and pre-order details.\n\nThis would line up with the recent reveal of a tie-in book, Jedi: Battle Scars, that bridges part of the five year gap between the end of Fallen order and the beginning of Survivor.\n\nThis year, there has been an absolute ocean of rumors, leaks, and teases this year out of Kojima Productions and what they could possibly be working on next. A horror game? An anthology series? A sequel to Death Stranding? Metal Gear Solid 6?\n\nOk that last one I made up, but WHAT IF?!\n\nConsidering the recent teases from Kojima himself, as well as the fact the guy is certified bros with producer and host of the Game Awards Jeff Keighley, it seems almost inevitable the gaming auteur’s next title will be at the event. On December 1, Kojima tweeted an image with three logos and the caption, “start a new journey.”\n\nAccording to reports from insiders, Kojima Productions is working on two games: a horror title codenamed Project Overdose, which has already leaked footage, and Death Stranding 2. The prevailing theory is that these logos, which were also present with official reveal images that actors Ellie Fanning and Shiori Kitsuna would be a part of the project, are related to Overdose rather than Death Stranding 2. The previously mentioned leaked footage also revealed that Margaret Qualley, the actor behind Death Stranding’s character Mama, is also in the game.\n\nNo word on release date, and no concrete info on whether Overdose will be the exclusive that Kojima is working on for Xbox, but hopefully a lot of these messy details will be cleared up by the time the Game Awards wraps.\n\nJedi: Survivor and Overdose are just the tip of the iceberg of what to expect from the Game Awards. The rest of the rumors include: an appearance from Diablo IV with pre-orders going live during the show, more from FF XIV, particularly as its producer, Naoki Yoshida, is confirmed to be at the event, updates for Among Us, news from publisher 505, potentially a better look at Tekken 8, and a possible tease of the next game from Josef Fares and Hazelight, the game director and studio behind last year’s Game Awards Game of the Year Winner It Takes Two. Josef is confirmed to also be attending the event.", "link": "https://www.youtube.com/watch?v=ApgQGnx-EkI", "date_published": "2022-12-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Glen Schofield Breaks Down The Callisto Protocol's Horror | MindGames", "description": "Ahead of the release of The Callisto Protocol, the first game from his new studio Striking Distance, we sat down with the game's director Glen Schofield to talk about his horror influences, competing with Dead Space, and how he hopes his new game will get inside the head of even the most seasoned horror fan.\n\n#thecallistoprotocol #gaming #horrorgaming #mindgames", "link": "https://www.youtube.com/watch?v=ln4uRDYPCjY", "date_published": "2022-12-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Callisto Protocol Review", "description": "Though it starts off on a strong note, The Callisto Protocol's focus on action-heavy spectacles fails to adequately explore its horror and overcrowds its weak combat mechanics.\n\n#gaming #thecallistoprotocol #gamespot", "link": "https://www.youtube.com/watch?v=bkktCkDNYPw", "date_published": "2022-12-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]