[{"source": "https://www.jefftk.com/news.rss", "title": "Our 2022 Giving", "description": "<p><span>\n\n</span>\n\n<a href=\"https://juliawise.net/\">Julia</a> and I usually decide on our\nannual giving at the end of each year.  For the past few years this\nhas been relatively straightforward: I was paid \n\n<a href=\"https://www.jefftk.com/money\">a\nlot</a>, so we \n\n<a href=\"https://www.jefftk.com/donations\">donated 50%</a>. This year is less\nso, because halfway through I \n\n<a href=\"https://www.jefftk.com/p/leaving-google-joining-the-nucleic-acid-observatory\">switched\njobs</a> to work on something directly valuable. While I'm very\nexcited about the potential of this work, it does pay enough less that\neven if we stopped donating we'd be keeping less for ourselves than\nbefore.\n\n\n\n<p>\n\nOne option we considered was donating 50% of our income from the first\nhalf of the year, up until I switched jobs, and then some smaller\nproportion of the income from later in the year, representing about\nhow much we intend to donate going forward. We thought about this, but\ndecided not to:\n\n</p>\n\n<p>\n\n</p>\n\n<ul>\n\n<li><p>The <a href=\"https://www.jefftk.com/p/if-professional-investors-missed-this\">collapse\nof FTX</a>, taking with it their <a href=\"https://forum.effectivealtruism.org/posts/xafpj3on76uRDoBja/the-ftx-future-fund-team-has-resigned\">philanthropic\narm</a>, means that there is less money available for EA projects,\nso it's more valuable to have funding now than in the recent past.\n\n</p></li>\n<li><p>We're not sure how to pick an amount for the second half of\nthe year.  Some of this is not being clear on what sort of donation\nnorms we'd like to encourage for people working at the kind of\norganization they would otherwise be happy to fund, or who take\nlower-paying jobs for altruistic reasons. Another part is that what we\npersonally want to do depends on what the post-FTX funding situation\nfor our employers end up looking like.\n\n</p></li>\n<li><p>I like having a simple explanation for what we're doing with\nour money, and while pro-rating isn't that complicated it's still\nsomething I'd rather avoid.  Simplicity is also a reason why we lean\naway from donating via <a href=\"https://www.jefftk.com/p/mildly-against-donor-lotteries\">lottery</a> or <a href=\"https://www.jefftk.com/p/passing-up-pay\">salary sacrifice</a>.\n\n</p></li>\n</ul>\n\n\n\n<p>\n\nInstead, we've decided to just continue giving 50% for 2022, and give\nsome smaller proportion in 2023. How much? Not sure yet.\n\n</p>\n\n<p>\n\nAs in past years, we're planning to divide our giving between <a href=\"https://www.givewell.org/\">GiveWell</a> (evidence-backed public\nhealth interventions, like distribution of antimalarial bed nets) and\nthe <a href=\"https://funds.effectivealtruism.org/funds/ea-community\">EA\nInfrastructure Fund</a> (a wide range of projects intended to help the\neffective altruism community grow into the best community it can).\n\n</p>\n\n<p>\n\n\"Let's just keep doing what we were doing, and decide later what we\nwant to do later\" is not a very satisfying conclusion, but I'm hoping\nthings are clearer next year.\n\n  </p>\n\n<p><i>Comment via: <a href=\"https://www.facebook.com/jefftk/posts/pfbid037ViuxCZzx9P4QNm69uoM55tyD5xmXYc4MxNUu3pm8D9ef8GVYi9Pzn9g1GZQUCJql\">facebook</a>, <a href=\"https://lesswrong.com/posts/XTFJDXLvqyvJZuHsN\">lesswrong</a>, <a href=\"https://forum.effectivealtruism.org/posts/wDgdRxBmF7GXBsnqr\">the EA Forum</a>, <a href=\"https://mastodon.mit.edu/@jefftk/109450491707352816\">mastodon</a></i></p>", "link": "https://www.jefftk.com/p/our-2022-giving", "date_published": "2022-12-02 08:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]