[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Eliane Elias: Tiny Desk Concert", "description": "Suraya Mohamed | December 9, 2022\nEliane Elias and her team arrived the day before this Tiny Desk to check out the space and audition the piano. We all worked to make sure that every detail, including the sound and cameras, were just right. And it turned out great. The meticulousness and care that went into this concert is evident in the brilliance of the performance.\n\nElias and her band brought a little bit of Brazil with this commanding performance of the best of the Brazilian jazz genre. Watch how the piano keys sit comfortably under Elias' hands, and how the dynamic syncopation in her percussive left hand complements the beautiful melodic lines of her right, both blending perfectly with the musicianship of her talented band. This superb combination of Afro-Latin rhythms, like samba and bossa nova, with straight-ahead styles make for really infectious music.\n\nEliane Elias was born in São Paulo, Brazil, and grew up in a musical household. By the time she was 10 she was already a huge jazz fan. Today, she has her own fandom and a 31-album catalog that includes her latest release, Quietude, and Mirror Mirror, a project with Chick Corea and Chucho Valdés that won both a Grammy award and a Latin Grammy for best Latin jazz album earlier this year.\n\nSET LIST\n\"At First Sight\" \n\"An Up Dawn\" \n\"The Time is Now\"\n\nMUSICIANS\nEliane Elias: digital piano,vocals\nMarc Johnson: upright bass\nRafael Barata: drums, percussion\nLeandro Pellegrino: guitar\n\nTINY DESK TEAM\nProducer: Suraya Mohamed\nDirector/Editor: Maia Stern\nAudio Engineer: Josh Rogosin \nCreative Director: Bob Boilen\nSeries Producer: Bobby Carter\nVideographers: Maia Stern, Joshua Bryant, Kara Frame, Sofia Seidel\nAudio Assistant: Hannah Copeland\nProduction Assistant: Jill Britton\nTiny Desk Team: Marissa Lorusso, Hazel Cills, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #elianeelias", "link": "https://www.youtube.com/watch?v=PxKHo8kiBG4", "date_published": "2022-12-09 10:00:19+00:00", "persistent": false, "user": null, "language": "en-US"}]