[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Omicron is displacing delta science", "description": "Omicron infection also produced immunity against Delta. This means someone who has been infected with delta is largely immune to subsequent delta infection. Therefore delta will soon have no one to infect, therefore will go away.\n\nOmicron infection enhances neutralizing immunity against the Delta variantOmicron infection enhances neutralizing immunity against the Delta variant\n \nhttps://www.ahri.org/wp-content/uploads/2021/12/MEDRXIV-2021-268439v1-Sigal_corr.pdf\n\nAfrica Health Research Institute, Durban, South Africa\n\nSchool of Laboratory Medicine and Medical Sciences, University of KwaZulu-Natal\n\nOmicron has been shown to be highly transmissible\n\nOmicron has extensive evasion of neutralizing antibody immunity,\n\nelicited by vaccination and previous SARS-CoV-2 infection. \n\nOmicron infections are rapidly expanding worldwide often in the face of high levels of Delta infections. \n\nQuestion\n\nDo omicron antibodies neutralise delta virus variant?\n\nDoes neutralizing immunity elicited by Omicron also enhances neutralizing immunity against the Delta variant?\n\nMethod\n\nIsolated the omicron and delta virus\n\nTested these against the plasma of 15 confirmed omicron cases\n\nUsed a live virus neutralization assay\n(Vero E6 cells were propagated in complete growth medium) \n\nCalculated the focus reduction neutralization test (FRNT50) \n\nVolunteers\n\nPreviously vaccinated\n\nUnvaccinated individuals who were infected with SARS-CoV-2 in the Omicron infection wave\n\nRecruited soon after symptom onset\n \nWe then measured their ability to neutralize both Omicron and Delta virus at enrolment,\n\nversus a median of 14 days after enrolment. \n\nNeutralization of Omicron increased 14-fold over this time,\n \nshowing a developing antibody response to omicron\n\nAlso\nEnhancement of Delta virus neutralization, increased 4.4-fold. \n\nTherefore\n\nThe increase in Delta variant neutralization in individuals infected with Omicron may result in decreased ability of Delta to re-infect\n\nAlso\n\nEmerging data indicating that Omicron is less pathogenic than Delta\n\nTherefore\n\nCross immunity from omicron to delta may have positive implications in terms of decreasing the Covid-burden of severe disease. \n\nMore science\nThe ability of one variant to elicit immunity which can cross-neutralize another variant varies by variant\n\nImmunity elicited by Delta infection\n\nDoes not cross-neutralize Beta virus\n\nImmunity elicited by Beta infection\n\nDoes not cross-neutralize Delta well \n\nParticipants in this study\n\nMany probably previously infected\n\nMore than half were vaccinated\n\nTherefore  activation of antibody immunity from previous infection and/or vaccination is possible\n\nImplications\n\nThese results are consistent with Omicron displacing the Delta variant\n\nAs cross immunity makes re-infection with Delta less likely\n\n(But previous delta exposure will not protect from symptomatic omicron infection)\n\nIf indeed Omicron is less pathogenic than Delta\n\nThe incidence of Covid-19 severe disease would be reduced\n\nInfection may shift to become less disruptive to individuals and society", "link": "https://www.youtube.com/watch?v=PYLbJ0H8zdc", "date_published": "2022-01-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Amazing virology (fun clip)", "description": "Leading virologist, Professor Khansarinejad answers John’s questions with patience and understanding. The answers are amazing.\n\nOne way to realise you have understood a scientific concept is when you experience that sense of awe at the nature of reality.\n\nTo contact Professor Behzad Khansarinejad\n\nhttps://www.linkedin.com/in/behzad-khansarinejad-9bab513b/?originalSubdomain=ir\n\nkhansarinejad@gmail.com\n\nLaboratory facility in Iran\n\nhttps://www.behsanlab.com", "link": "https://www.youtube.com/watch?v=wEDtjZtpK1k", "date_published": "2022-01-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]