{"entries": [{"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/pogrzeb-benedykta-xvi-wiadomo-gdzie-zostanie-pochowany-emerytowany-papierz/90c5lmn", "title": "Pogrzeb Benedykta XVI. Wiadomo, gdzie zostanie pochowany emerytowany papież", "date_published": "2022-12-31 16:28:22+00:00", "description": "Benedykt XVI zostanie pochowany w podziemiach bazyliki Świętego Piotra, czyli tam, gdzie do beatyfikacji w 2011 r. znajdował się grób jego poprzednika Jana Pawła II.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/mer-kijowa-liczba-mieszkancow-zblizyla-sie-do-poziomu-sprzed-wojny/6erxg1f", "title": "Mer Kijowa: liczba mieszkańców zbliżyła się do poziomu sprzed wojny", "date_published": "2022-12-31 16:02:31+00:00", "description": "Liczba mieszkańców Kijowa zbliża się do poziomu sprzed wojny. — W Kijowie przed wojną mieszkało 3,8 mln ludzi, po inwazji było ich mniej niż milion, teraz jest 3,6 mln — powiedział mer Witalij Kliczko w opublikowanej w piątek rozmowie ze \"Spieglem\".", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/technologie/nowe-technologie/jak-zarabia-google-tak-wyglada-model-finansowy-najwiekszej-przegladarki-internetowej/4cmqyqt", "title": "Tak wygląda model finansowy największej przeglądarki internetowej. To potężny biznes", "date_published": "2022-12-31 15:38:52+00:00", "description": "Tylko w III kwartale tego roku Google zarobiło ponad 61 mld dol. Gigant technologiczny czerpie dochody nie tylko z reklam, ale i wielu innych usług, które oferuje.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/technologie/nowe-technologie/jak-zarabia-google-tak-wyglada-model-finansowy-najwiekszej-wyszukiwarki-internetowej/4cmqyqt", "title": "Tak wygląda model finansowy największej wyszukiwarki internetowej. To potężny biznes", "date_published": "2022-12-31 15:38:52+00:00", "description": "Tylko w III kwartale tego roku Google zarobiło ponad 61 mld dol. Gigant technologiczny czerpie dochody nie tylko z reklam, ale i wielu innych usług, które oferuje.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/chorwacja-zegna-sie-z-kuna-odlicza-godziny-do-przyjecia-euro/2lgv7yc", "title": "Chorwacja żegna się z kuną. Odlicza godziny do przyjęcia euro", "date_published": "2022-12-31 15:27:01+00:00", "description": "Chorwacja odlicza godziny do przyjęcia euro i wejścia do strefy Schengen, co nastąpi wraz z początkiem 2023 r. W niedzielę zamknięte zostaną 73 posterunki graniczne.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/w-tym-chiny-polska-i-swiat-juz-sa-pod-kreska-w-2023-r-lepiej-nie-bedzie/rd0qz49", "title": "W tym sektorze Chiny, Polska i świat już są pod kreską. W 2023 r. poprawy nie będzie", "date_published": "2022-12-31 15:04:30+00:00", "description": "Światowa produkcja stali się kurczy i to nie tylko za sprawą obniżenia wskaźników Chin. Prognozy na 2023 r. są niewiele lepsze, a huty na całym globie już szykują się na przyszłoroczne spowolnienie gospodarcze. Mniejsze zamówienia w przemyśle widać także w Polsce – produkcja stali spadła w listopadzie o blisko 25 proc., a zużycie w III kw. o milion ton. Ceny spadają, lecz klienci raczej się nie cieszą. Przyznają wprost: na rynku zapanowała stagnacja.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/rozwoj-osobisty/toksyczny-perfekcjonizm-sabotowal-moje-zycie-jak-sobie-poradzilam/sl8m08j", "title": "Toksyczny perfekcjonizm sabotował moje życie. Oto jak nauczyłam się zarządzać wewnętrznym krytykiem", "date_published": "2022-12-31 14:53:17+00:00", "description": "Czy często masz wrażenie, że nigdy nie będziesz wystarczająco dobry, niezależnie od tego, jak bardzo się starasz? A może masz wątpliwości, czy spróbować nowego hobby, bo boisz się, że ci się nie uda? Albo stawiasz sobie tak wysokie standardy, że wysysa to całą wewnętrzną radość? Jeśli któreś z tych stwierdzeń brzmi znajomo, jest duże prawdopodobieństwo, że zmagasz się z perfekcjonizmem.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/testy-na-covid-kolejne-kraje-wprowadzaja-kontrole-dla-podroznych-z-chin/lyretnq", "title": "Trzy kraje zmieniają zdanie w sprawie covid. Wprowadzają kontrole dla podróżnych z Chin", "date_published": "2022-12-31 14:34:33+00:00", "description": "Wielka Brytania, Hiszpania i Francja dołączyły do ​​innych krajów, które nakładają nowe kontrole na podróżnych z Chin w miarę wzrostu liczby przypadków covid po tym, jak Pekin zniósł drakońską politykę \"zero covid\".", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/technologie/nowe-technologie/przemysl-na-ksiezycu-kosmiczny-orlen-i-gornictwo-cieplne/04sz62c", "title": "\"Kosmiczny Orlen\" i górnictwo cieplne. Jak będzie wyglądał przemysł na Księżycu?", "date_published": "2022-12-31 13:56:35+00:00", "description": "Nie będzie górników, sztolni, fedrowania. Będą za to roboty wydobywające surowce — zarówno tradycyjnymi, jak i nowatorskimi metodami. Przykładem tych drugich jest górnictwo cieplne, opracowane z myślą o zasobach wody na Księżycu. To właśnie ona jest kluczem do produkcji paliw w Kosmosie, która z kolei pozwoli ludzkości na jeszcze bardziej ambitne i dalekie wyprawy.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/technologie/nowe-technologie/caroline-ellison-jest-fanka-harryego-pottera-i-matematycznym-geniuszem/cevbq4s", "title": "Jest fanką Harry’ego Pottera i matematycznym geniuszem. Co wiemy o bohaterce skandalu wokół FTX?", "date_published": "2022-12-31 13:33:59+00:00", "description": "Ma 28 lat i jest niezwykle utalentowana w dziedzinie matematyki. Pierwszą książkę przeczytała samodzielnie już w wieku pięciu lat. Od tego czasu nie wyrosła z fascynacji Harrym Potterem, zainteresowała się natomiast kryptowalutami i poliamorią. Jej ulubionym kolorem jest szary. Ta niepozorna kujonka ze Stanfordu jest dziś jedną z głównych bohaterek skandalu wokół upadku giełdy FTX. Grozi jej 110 lat więzienia.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gielda/to-byl-najgorszy-rok-dla-wall-street-od-14-lat/lgl4ek3", "title": "To był najgorszy rok dla Wall Street od 14 lat", "date_published": "2022-12-31 13:25:53+00:00", "description": "Rok 2022 okazał się najgorszym dla amerykańskich giełd od 2008 r. Agresja Rosji na Ukrainę, inflacja oraz wyższe stopy procentowe sprawiły, że główne amerykańskie indeksy giełdowe zaliczyły największe spadki od 14 lat. Po tak burzliwym roku inwestorzy z niepokojem patrzą na 2023 r.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/rozwoj-osobisty/5-sygnalow-ze-praca-nie-jest-dla-ciebie/ez40ts9", "title": "Chcesz uniknąć \"toksycznej atmosfery\" w pracy? Sprawdź tych 5 sygnałów", "date_published": "2022-12-31 13:05:00+00:00", "description": "Jeżeli wybierasz się na rozmowę o pracę i zastanawiasz się jedynie nad tym, co potencjalny pracodawca o tobie pomyśli, pora zmienić nastawienie. Jeżeli podczas rozmowy cokolwiek cię zaniepokoi, rozważ, czy przyjęcie tej pracy, nawet jeśli wcześniej wydawała się idealna, to na pewno dobry pomysł.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/technologie/nauka/powierzchnia-marsa-w-zdjeciach-ktore-zrobil-ladownik-insight-nasa/27qz8n4", "title": "Cztery lata badał Marsa. To ostatnie zdjęcia przed \"śmiercią\" lądownika InSight", "date_published": "2022-12-31 13:02:00+00:00", "description": "Kosztujący 813 mln dol. lądownik NASA InSight uległ pyłowi i na zawsze znieruchomiał na powierzchni czerwonej planety, kończąc tym samym swoją czteroletnią misję monitorowania trzęsień ziemi na Marsie, wirów pyłowych i uderzeń meteorytów.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gielda/wiadomosci/hity-i-kity-2022-roku-wygrani-i-przegrani-gieldy/cbqgbgd", "title": "Hity i kity 2022 roku. Wygrani i przegrani giełdy", "date_published": "2022-12-31 12:35:01+00:00", "description": "Na giełdzie w 2022 r. doszło do zmian spektakularnych. Bo jak inaczej nazwać wchłonięcie wicelidera roku poprzedniego przez spółkę, która zajmowała w hierarchii rynkowej dopiero 8. miejsce, wciągając jeszcze po drodze spółkę numer 16? Trzy podmioty oddzielnie były warte rok temu 79 mld zł, teraz jest to o 5 mld mniej. Trudno mówić o spektakularnym sukcesie. I do tego kapitalizacja notowanych na głównym rynku firm spadła aż o 135 mld zł. Tylko dywidendy i zyski dopisały, choć głównie tym wielkim, nielicznym. Większość musiała wiązać koniec z końcem.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/paliwa-orlen-obnizyl-ceny-hurtowe/fd85h1j", "title": "Paliwa. Orlen obniżył ceny hurtowe", "date_published": "2022-12-31 12:07:28+00:00", "description": "Orlen obniżył w ostatni dzień 2022 r. ceny hurtowe benzyny i oleju napędowego — wynika z najnowszego cennika płockiego koncernu. Przypomnijmy, że od 1 stycznia wzrosną akcyza i opłata paliwowa, a stawka podatku VAT powróci do poziomu sprzed tarczy antyinflacyjnej.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/najbrudniejszy-sekret-branzy-modowej-welniana-skarpeta-rozklada-sie-5-lat-a-lycra/dq9y3ye", "title": "Koszula rozkłada się 6 miesięcy, wełniana skarpeta 5 lat, lycra wieki. Oto najbrudniejszy sekret branży modowej", "date_published": "2022-12-31 11:43:00+00:00", "description": "Każdego roku przemysł odzieżowy wytwarza ponad 100 mld sztuk odzieży – co wystarcza, aby każdy mieszkaniec Ziemi otrzymał 14 nowych sztuk odzieży rocznie, ponad dwukrotnie więcej niż w 2000 r. Nasze przyzwyczajenie do kupowania i zwracania zakupów powoduje, że wiele z tych ubrań jest odsyłanych do sprzedawców. Wbrew temu, co sądzi wiele osób, większość oddawanych ubrań nie wraca do magazynu, nie jest przerabiana ani ponownie wykorzystywana, tylko trafia do śmieci.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/putin-laskawie-pozwoli-zaplacic-za-gaz-wydal-dekret/mjxx2te", "title": "Putin zmienił zdanie w sprawie płatności za rosyjski gaz. Wydał dekret", "date_published": "2022-12-31 11:25:31+00:00", "description": "Putin wydał dekret zezwalający odbiorcom zagranicznym na opłacenie długów za gaz w walucie obcej — podaje Reuters. Nie oznacza to jednak automatycznego wznowienia dostaw surowca. Rosja wstrzymała dostawy do tych państw, które nie zgodziły się na płatności w rublach, w tym do Polski.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gielda/wiadomosci/zajrzelismy-do-portfeli-najbogatszych-polakow-tracili-miliardy/nk2d5zs", "title": "Majątek króla Polsatu skurczył się o miliardy złotych. Powinien brać przykład z najbogatszej Polki", "date_published": "2022-12-31 10:54:39+00:00", "description": "Kryzys w 2022 r. dosięgnął portfeli najbogatszych Polaków, którzy swoje główne biznesy mają w spółkach notowanych na warszawskiej giełdzie. Majątek Zygmunta Solorza skurczył się o 6 mld zł, czyli około 40 proc. O ponad połowę zmniejszyła się też wartość akcji CCC należących do Dariusza Miłka. Jak zarabia się pieniądze? Najlepiej pokazała Dominika Kulczyk, której majątek urósł o dziesięciocyfrową kwotę.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/nie-zyje-barbara-walters-supergwiazda-amerykanskiej-tv-byla-pionierka/1lwnel7", "title": "Nie żyje supergwiazda amerykańskiej TV. \"Była pionierką\"", "date_published": "2022-12-31 10:44:11+00:00", "description": "W wieku 93 lat zmarła w piątek Barbara Walters, pierwsza kobieta supergwiazda amerykańskich wiadomości telewizyjnych. Popularność zyskała w latach 70. Dostała bezprecedensową roczną pensję 1 mln dol. Przeprowadzała wywiady z każdym prezydentem USA i pierwszą damą, od czasów Nixona, po Donalda Trumpa.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/biznes/zbigniew-komorowski-i-bakoma-niezwykla-historia-polskiego-krola-jogurtow/jfttnn4", "title": "Był politykiem, został polskim królem jogurtów. Jak Zbigniew Komorowski  zdobył fortunę?", "date_published": "2022-12-31 10:20:00+00:00", "description": "Zbigniew Komorowski swoje biznesowe imperium rozwijał w gęstych politycznych oparach. Jednak po kilkunastu latach polityce powiedział wyraźnie \"basta” i skupił się na interesach. Dziś prezesem Bakomy jest jego syn – Piotr Komorowski.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/benedykt-xvi-nie-zyje-emerytowany-papiez-mial-95-lat/vtd10sk", "title": "Benedykt XVI nie żyje. Emerytowany papież miał 95 lat", "date_published": "2022-12-31 09:42:11+00:00", "description": "Benedykt XVI nie żyje. Emerytowany papież zmarł w sobotę w wieku 95 lat. Joseph Ratzinger był najdłużej żyjącym papieżem w historii.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/sa-lepsze-od-najnowszej-technologii-delfiny-i-lwy-morskie-pomagaja-wojsku-w/7b3m2c2", "title": "Są lepsze od najnowszej technologii. Delfiny i lwy morskie pomagają wojsku w wykrywaniu zagrożeń", "date_published": "2022-12-31 09:31:14+00:00", "description": "Amerykańska marynarka wojenna szkoli niewielkie oddziały delfinów butlonosych i lwów morskich do odzyskiwania utraconego sprzętu, przechwytywania intruzów w portach i wykrywania zakopanych min morskich już od roku 1959.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/brakuje-lekow-farmaceuci-alarmuja/be2jkme", "title": "Farmaceuci alarmują. Brakuje leków", "date_published": "2022-12-31 09:15:06+00:00", "description": "Farmaceuci alarmują, że w aptekach brakuje leków. Sytuację potęguje sezon grypowy. Minister zdrowia uspokaja, że niedobory są lokalne.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/sezon-grypowy-farmaceuci-alarmuja-ze-brakuje-lekow/be2jkme", "title": "Farmaceuci alarmują. Brakuje leków", "date_published": "2022-12-31 09:15:06+00:00", "description": "Farmaceuci alarmują, że w aptekach brakuje leków. Sytuację potęguje sezon grypowy. Minister zdrowia uspokaja, że niedobory są lokalne.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/rosyjska-ropa-obajtek-mowi-co-dalej-z-kontraktem-orlenu/mtgjsv1", "title": "Obajtek mówi co dalej z kontraktem Orlenu na rosyjską ropę", "date_published": "2022-12-31 08:45:25+00:00", "description": "W styczniu wygasa kontrakt długoterminowy Orlenu na rosyjską ropę, którego nie przedłużymy. W efekcie ok. 90 proc. przerabianej ropy będzie spoza Rosji — oświadczył w sobotę prezes koncernu Daniel Obajtek. Obecnie 70 proc. surowca we wszystkich rafineriach Orlenu pochodzi z kierunków alternatywnych do rosyjskiego.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/7-nieprawdopodobnych-gospodarczych-faktow-ktore-zdarzyly-sie-w-2022-r/pez91t3", "title": "Siedem nieprawdopodobnych gospodarczych faktów, które zdarzyły się w 2022 r.", "date_published": "2022-12-31 08:10:01+00:00", "description": "Gdyby u kresu 2021 r. ktoś wskazał, że spełnią się opisane poniżej wydarzenia, mało kto mógłby dać temu wiarę. Ostatnie 12 miesięcy upłynęło pod znakiem zdarzeń, których albo nie widzieliśmy nigdy wcześniej, albo od wielu już lat. Niestety, tych niepokojących niespodzianek było znacznie więcej niż pozytywnych. Również w zauważalnie hamującej polskiej i światowej gospodarce.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/twoje-pieniadze/lokaty-obligacje-waluty-akcje-nic-nie-powstrzymalo-inflacji-tyle-zostalo-z-10-tys-zl/6pxnw2q", "title": "Inflacja pożera każde pieniądze. Tyle zostało z 10 tys. zł ulokowanych na kilka sposobów", "date_published": "2022-12-31 08:00:00+00:00", "description": "Ochrona oszczędności przed inflacją w 2022 r. była prawie niemożliwa. Niektóre z prostych sposobów lokowania pieniędzy potrafiły dać 8-10 proc. zysku, ale realne straty nawet w tym przypadku wynosiły kilkaset złotych z każdych 10 tys. zł. Eksperci wskazują, że 2022 r., napędzany galopującą inflacją oraz drastycznie rosnącymi stopami procentowymi, był wyjątkowy dla tego stulecia. Wymieniają przy tym największe inwestycyjne zawody.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/podatki/czym-jest-zobowiazanie-podatkowe-i-po-jakim-czasie-ulega-przedawnieniu/evyn2b8", "title": "Czym jest zobowiązanie podatkowe i po jakim czasie ulega przedawnieniu?", "date_published": "2022-12-31 07:00:00+00:00", "description": "Termin \"przedawnienie\" znajduje zastosowanie w wielu różnych gałęziach prawa. Dotyczy to zarówno prawa karnego, jak i administracyjnego czy cywilnego. To dzięki niemu wielu dłużnikom udało się uniknąć konieczności spłaty należności. Trzeba jednak pamiętać, że taki stan rzeczy nie oznacza, iż zobowiązanie podatkowe całkowicie wygasa. Co trzeba wiedzieć o przedawnieniu? Kto może z niego skorzystać?", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/poradnik-finansowy/oszczedzanie/czy-numer-rachunku-jest-tym-samym-co-numer-konta/ept5y3t", "title": "Numer rachunku a numer konta bankowego - czy czymś się różnią?", "date_published": "2022-12-31 07:00:00+00:00", "description": "Czy numer rachunku i numer konta to tożsame pojęcia? Z takim pytaniem boryka się wiele osób, szczególnie tych, które dopiero rozpoczynają swoją przygodę z bankowością. Warto zapoznać się również z kilkoma ważnymi pojęciami. Pozwolą one na bezproblemowe korzystanie z nowego konta. Co znaczą poszczególne cyfry wchodzące w skład numeru rachunku bankowego? Jak rozwiać wątpliwości przy transakcjach międzynarodowych za pomocą informacji zawartych w NRB?", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/poradnik-finansowy/ubezpieczenia/rieser-rente-co-to-jest/2jt4f91", "title": "Riester Rente –  niemiecki program ubezpieczenia emerytalnego. Kto może z niego korzystać?", "date_published": "2022-12-31 06:45:00+00:00", "description": "Riester Rente to obowiązujący od 2002 r. w Niemczech program prywatnego ubezpieczenia emerytalnego. Jest on przeznaczony dla ludzi zarabiających najmniej. Mechanizm jego działania polega na tym, że osoby, które regularnie wpłacają pewną część swoich dochodów, otrzymują od państwa dodatek do składek i ulgi podatkowe. Na starość oszczędzający mogą mieć wypłacaną dożywotnią emeryturę albo wykorzystać dotację na szybszą spłatę kredytu na nieruchomość. Jak działa Rieser Rente? Jak skorzystać z tej formy świadczenia?", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/prawo/praca/zwolnienie-chorobowe-w-niemczech-jak-isc-na-l4/0lc42w7", "title": "Jak iść na L4 w Niemczech?", "date_published": "2022-12-31 06:30:00+00:00", "description": "Zwolnienie chorobowe w Niemczech, czyli L4, przysługuje każdej legalnie pracującej osobie. Zasady działania są zbliżone do tych obowiązujących w Polsce. Z niemieckiego L4 mogą korzystać również Polacy pracujący w tym kraju. Jak w Niemczech iść na L4?", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/poradnik-finansowy/zarzadca-sukcesyjny-w-dzialalnosci-jaka-pelni-funkcje/r5ft9hj", "title": "Zarządca sukcesyjny w działalności - jaką pełni funkcję?", "date_published": "2022-12-31 06:30:00+00:00", "description": "Zarządca sukcesyjny to stosunkowo młoda profesja, która znajduje swoje zastosowanie przy przejęciu przedsiębiorstwa po śmierci jego właściciela. Jakie funkcje pełni taka osoba? Czy ustanowienie zarządcy sukcesyjnego wiąże się z koniecznością dodatkowych opłat lub zobowiązań? Jak wygląda praca zarządcy sukcesyjnego w kontekście różnych działalności.", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/twoje-pieniadze/praca/ile-wynosi-czas-pracy-w-krajach-unii-europejskiej/jpbzq79", "title": "W tych krajach Unii Europejskiej czas pracy jest najdłuższy. Polska w czołówce", "date_published": "2022-12-31 06:15:00+00:00", "description": "Czas pracy w krajach Unii Europejskiej jest definiowany przez unijne przepisy. Nie oznacza to jednak, że w całej wspólnocie wynosi on tyle samo. Określono w nich bowiem jedynie maksymalny limit czasu pracy, który nie może zostać przekroczony. Ile on wynosi? W których krajach UE pracuje się najwięcej?", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/poradnik-finansowy/chorobowe-przedsiebiorcy-jak-wyglada-w-2022-roku/vl43ckp", "title": "Chorobowe przedsiębiorcy - jak wygląda w 2022 r.?", "date_published": "2022-12-31 06:00:00+00:00", "description": "Polski Ład na ogół nie kojarzy się z dobrymi zmianami dla przedsiębiorców. Na przestrzeni ostatniego roku wprowadził on do gospodarki znaczący chaos i utrudnił życie wielu podmiotom prowadzącym działalności gospodarcze, jak i również sporej części pracowników. Wśród absurdalnych decyzji można jednak znaleźć kilka pozytywów — jednym z nich jest zarządzenie w związku z zasiłkiem chorobowym dla przedsiębiorcy. Jak wygląda ono w 2022 r.?", "persistent": false, "language": "en-US", "user": null}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/poradnik-finansowy/ubezpieczenia/ubezpieczenie-na-wypadek-smierci-polisa-warunki-wysokosc/px02xwh", "title": "Ubezpieczenie na wypadek śmierci — jak zabezpieczyć rodzinę?", "date_published": "2022-12-31 06:00:00+00:00", "description": "Ubezpieczenie na życie w wielu przypadkach może okazać się nieocenioną pomocą. Jest to znakomite zabezpieczenie finansowe zarówno dla osoby ubezpieczonej, jak i dla jej rodziny. Opłacanie świadczenia zapewnia większy spokój i poczucie bezpieczeństwa w kwestiach materialnych. Gdy dojdzie do zgonu ubezpieczonego, polisa na wypadek śmierci pozwoli najbliższym na zmniejszenie wielu kosztów z nim związanych. Co jeszcze trzeba wiedzieć o tym rodzaju świadczenia? Jaka jest wysokość odszkodowania?", "persistent": false, "language": "en-US", "user": null}], "source": {"url": "https://businessinsider.com.pl/.feed", "title": "Business insider"}}