[{"source": "https://www.engadget.com/rss.xml", "title": "Samsung taps a former Mercedes-Benz designer to lead its mobile design team", "description": "<p>Samsung’s mobile division has a new design chief. On Friday, the company <a href=\"https://news.samsung.com/global/samsung-appoints-hubert-h-lee-to-lead-its-mx-design-team\"><ins>announced</ins></a> the appointment of Hubert H. Lee to head up its Mobile eXperience (MX) Design Team, the unit responsible for designing some of Samsung’s most visible products, including its flagship Galaxy S series phones. Lee joins the electronics giant after a stint as the chief design officer of Mercedes-Benz China, a position that saw him lead the automaker’s design teams in China and the US. “His unique and visionary perspective will help shape the look and feel of Galaxy, building on the distinct design ethos that users know and love,” Samsung said.</p><p>It will probably be at least a year before we see Lee start to leave his mark on Samsung’s products. <a href=\"https://www.androidauthority.com/samsung-galaxy-s23-3177601/\"><ins>Prelease leaks</ins></a> of the company’s next Galaxy S series phones suggest they’ll look a lot like their Galaxy S22 predecessors. What’s more, with the way smartphone development timelines work, Samsung has likely already settled on a design for its 2024 flagship. Even then, don’t expect dramatic changes; from a design standpoint, phone companies have played it safe for <a href=\"https://www.engadget.com/2009-10-30-motorola-droid-review.html\"><ins>more than a decade</ins></a>. Still, Lee could push for small but meaningful tweaks to Samsung's design formula — much like <a href=\"https://www.engadget.com/apple-hardware-design-leader-evans-hankey-leaves-155100957.html\">Evans Hankey</a> did at Apple after <a href=\"https://www.engadget.com/2019-06-27-jony-ive-lovefrom.html\">Jony Ive's departure</a>.&nbsp;</p><span id=\"end-legacy-contents\"></span>", "link": "https://www.engadget.com/samsung-appoints-hubert-h-lee-design-chief-221014832.html?src=rss", "date_published": "2022-12-31 22:10:14+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "Today is the last day to use Dark Sky on iOS before it shuts down", "description": "<p>The time has come to say goodbye to Dark Sky. Nearly two years after Apple <a href=\"https://www.engadget.com/2020-03-31-apple-dark-sky-weather-app.html\"><ins>purchased the much-loved weather app</ins></a>, and more than a year after announcing its impending shutdown, Dark Sky is about to stop functioning. Since September, an in-app notification has <a href=\"https://9to5mac.com/2022/09/28/dark-sky-shutting-down-warning/\"><ins>warned iOS users</ins></a> the software would no longer work come January 1st, 2023. In September, Apple also removed Dark Sky from the App Store (<a href=\"https://www.engadget.com/apple-shuts-down-dark-sky-android-234923283.html\"><ins>following an earlier delisting from the Play Store</ins></a>).</p><p>If you’re looking for an alternative, it’s worth revisiting Apple’s own Weather app before turning to the App Store. Since <a href=\"https://www.engadget.com/ios-14-review-130053409.html\"><ins>iOS 14</ins></a>, the company has gradually integrated Dark Sky’s technology into its native offering. For instance, the Weather app now includes next-hour precipitation alerts, which is a feature that was directly inspired by Dark Sky. That said, if you’re set on trying a third-party alternative, a few that are worth checking out include AccuWeather and Carrot Weather.</p><span id=\"end-legacy-contents\"></span>", "link": "https://www.engadget.com/dark-sky-ios-shutdown-psa-203747733.html?src=rss", "date_published": "2022-12-31 20:37:47+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "Big Tech critic Tim Wu is leaving the White House", "description": "<p>After advising President Biden on technology and competition policy for nearly two years, net neutrality advocate Tim Wu is <a href=\"https://twitter.com/superwuster/status/1608897095334756354?s=20&amp;t=gk5jiSdsD7Mz7Rr7BmjV3Q\">leaving the White House</a>. The Biden administration announced the departure this week, noting Wu’s final day at the National Economic Council would fall on January 4th. Wu became a special advisor to the president in <a href=\"https://www.engadget.com/tim-wu-white-house-national-economic-council-172059273.html\"><ins>March 2021</ins></a>. He held a similar position during the Obama administration.</p><div id=\"cbdfa901fd424dea806ceb194929dd7e\"><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">In the New Year I'll be leaving the White House and returning to Columbia University.  We did more that I thought possible over the last two years to set a new course in antitrust and economic policy, and I'm grateful to have been a part of it <a href=\"https://t.co/r0bOHx033L\">https://t.co/r0bOHx033L</a></p>— Tim Wu (@superwuster) <a href=\"https://twitter.com/superwuster/status/1608897095334756354?ref_src=twsrc%5Etfw\">December 30, 2022</a></blockquote></div><p>Wu <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=c813ae39-7d58-41cb-ac66-ad830606ceef&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=The+New+York+Times&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiJjODEzYWUzOS03ZDU4LTQxY2ItYWM2Ni1hZDgzMDYwNmNlZWYiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cubnl0aW1lcy5jb20vMjAyMi8xMi8zMC90ZWNobm9sb2d5L3RpbS13dS1sZWF2ZXMtd2hpdGUtaG91c2UuaHRtbCIsImNvbnRlbnRVdWlkIjoiNWJhMjNhYzEtMWQ2Ni00YTE0LWEzZmMtYzEyMmVkNmE1M2QwIn0&amp;signature=AQAAAVpz06KKKAc5Qh-IhkvRHNCMelW8xnNe0rA9_5QBn7VU&amp;gcReferrer=https%3A%2F%2Fwww.nytimes.com%2F2022%2F12%2F30%2Ftechnology%2Ftim-wu-leaves-white-house.html\"><ins>told </ins><em><ins>The New York Times</ins></em></a><em>&nbsp;</em>he’s leaving the federal government to spend more time with his family. His post at the White House had required Wu to commute between New York and Washington DC, leaving his young children without their father for stretches of time. “There’s a time where the burden on family is too much,” he said. “I’ve been feeling the balance has shifted.” Wu told <em>The Times</em> he plans to return to Columbia University, where he was a law professor before his latest government stint.</p><span id=\"end-legacy-contents\"></span><p>Wu is leaving the White House at a critical moment during the Biden administration's efforts to rein in Big Tech. Last year, he co-authored the executive order that instructed the Federal Communications Commission to <a href=\"https://www.engadget.com/biden-executive-order-call-for-reinstating-net-neutrality-141029471.html\"><ins>restore net neutrality</ins></a> and promised greater scrutiny of mergers. In July of this year, the Federal Trade Commission <a href=\"https://www.engadget.com/ftc-meta-supernatural-within-vr-metaverse-antitrust-193448429.html\"><ins>sued Meta</ins></a> to block the purchase of VR developer Within. Earlier this month, the agency also moved to prevent Microsoft’s merger with <a href=\"https://www.engadget.com/ftc-microsoft-activision-blizzard-antitrust-competition-lawsuit-191341476.html\"><ins>Activision Blizzard</ins></a>. Both cases are currently before the courts and are expected to be tough battles for the FTC.&nbsp;</p>", "link": "https://www.engadget.com/big-tech-critic-tim-wu-is-leaving-the-white-house-191002294.html?src=rss", "date_published": "2022-12-31 19:10:02+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "Meta buys smart lensmaker Luxexcel to further AR ambitions", "description": "<p>Facebook parent company Meta has acquired Luxexcel, a Dutch startup specializing in smart eyewear. News of the purchase was first reported by <a href=\"https://www.tijd.be/ondernemen/technologie/techreus-meta-laat-oog-vallen-op-kempense-briltechnologie/10437117.html\"><em><ins>De Tijd</ins></em></a> and later confirmed by <a href=\"https://techcrunch.com/2022/12/30/meta-acquires-luxexcel-a-smart-eyewear-company/\"><em><ins>TechCrunch</ins></em></a>. “We’re excited that the Luxexcel team has joined Meta, deepening the existing partnership between the two companies,” a Meta spokesperson told the outlet. The company did not disclose the financial terms of the deal.</p><p>Founded in 2009, Luxexcel began life as a prescription lens manufacturer. More recently, the company has made a name for itself in the augmented reality space. At the start of 2021, for instance, it <a href=\"https://www.luxexcel.com/waveoptics-and-luxexcel-demonstrate-prescription-eyewear-for-ar-smartglasses/\"><ins>partnered with WaveOptics</ins></a>, the display manufacturer Snap <a href=\"https://www.engadget.com/snap-buys-ar-spectacles-display-maker-waveoptics-145650808.html\"><ins>paid $500 million</ins></a> later that same year to buy. As <em>TechCrunch </em>points out, there are also rumors Luxexcel previously worked with Meta on the company’s <a href=\"https://www.engadget.com/facebook-project-aria-ar-glasses-details-030106045.html\"><ins>Project Aria AR glasses</ins></a>.</p><span id=\"end-legacy-contents\"></span><p>The acquisition comes as Meta faces regulatory scrutiny from the Federal Trade Commission over its purchase of <em>Supernatural </em>developer Within. The agency <a href=\"https://www.engadget.com/ftc-meta-supernatural-within-vr-metaverse-antitrust-193448429.html\"><ins>sued Meta</ins></a> in July to block the deal. The social media giant also faces criticism over just how much it's spending to further its metaverse ambitions. In October, a month before the company <a href=\"https://www.engadget.com/meta-mass-layoffs-facebook-111406126.html\"><ins>laid off 11,000 employees</ins></a>, Meta told investors Reality Labs, its virtual and augmented reality unit, lost more than $9 billion in 2022. It went on to predict the division’s operating losses were likely to “grow significantly year-over-year” in 2023.</p>", "link": "https://www.engadget.com/meta-buys-smart-lensmaker-luxexcel-170629568.html?src=rss", "date_published": "2022-12-31 17:06:29+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "Grubhub ordered to pay $3.5 million to settle Washington DC deceptive practices lawsuit", "description": "<p>Grubhub has been <a href=\"https://abcnews.go.com/GMA/Food/grubhub-pay-35m-settlement-deceptive-practices-hidden-fees/story?id=95983162\">ordered</a> to pay $3.5 million to settle the lawsuit <a href=\"https://www.engadget.com/grubhub-lawsuit-hidden-fees-trade-practices-washington-dc-145003426.html\">filed against the company</a> by the District of Columbia over &quot;deceptive trade practices.&quot; Washington DC Attorney General Karl Racine has <a href=\"https://twitter.com/AGKarlRacine/status/1608851268327583747\">announced</a> that his office has reached an agreement with the food delivery service &quot;for charging customers hidden fees and using deceptive marketing techniques.&quot; If you'll recall, his office sued the company earlier this year, accusing it of charging hidden fees and misrepresenting Grubhub+ subscription's offer of &quot;unlimited free delivery,&quot; since customers still have to pay a service fee.</p><p>The DC Attorney General's office also accused the company of listing 1,000 restaurants in the area without their permission by using numbers that route to Grubhub workers or creating websites without the eateries' consent. A previous <a href=\"https://techcrunch.com/2022/03/21/grubhub-lawsuit-hidden-fees-dc-attorney-general-disclosure/\"><em>TechCrunch</em></a> report said the company had already ended those practices. Racine also said at the time that Grubhub ran a promotion called &quot;Supper for Support&quot; at the beginning of the pandemic and then &quot;stuck restaurants with the bill&quot; that cut into their profit margins.</p><span id=\"end-legacy-contents\"></span><p>Grubhub <a href=\"https://twitter.com/dwtovar/status/1505930332096372739\">called the lawsuit frivolous</a> at the time of its filing and said that the company was &quot;disappointed [the AG's office has] moved forward with [it] because [the service's] practices have always complied with DC law, and in any event, many of the practices at issue have been discontinued.&quot;</p><p>Under the terms of the settlement, Grubhub will pay affected customers in the DC area a total of $2.7 million. Their cut will be credited to their accounts, and it will be sent to them as a check if it remains unused within 90 days. In addition, the company has to pay $800,000 in civil penalties to the District of Columbia and has to clearly mark additional fees people have to pay with their order going forward.</p><div id=\"a504c34f44c941b1adbf32f80e417de3\"><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">My office reached a $3.5 million settlement with Grubhub for charging customers hidden fees and using deceptive marketing techniques.<br /><br />As a result, $2.7 million will be returned to the consumers who were impacted, and it will have to shape up and disclose every fee separately.</p>— AG Karl A. Racine (@AGKarlRacine) <a href=\"https://twitter.com/AGKarlRacine/status/1608851268327583747?ref_src=twsrc%5Etfw\">December 30, 2022</a></blockquote></div><p></p>", "link": "https://www.engadget.com/grubhu-pay-35-million-settle-deceptive-practices-lawsuit-150304597.html?src=rss", "date_published": "2022-12-31 15:03:04+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "NLRB says Tesla violated the law by telling employees not to talk about pay", "description": "<p>The National Labor Relations Board has accused Tesla of violating labor law by prohibiting employees in Orlando, Florida from talking about workplace matters. According to <a href=\"https://www.bloomberg.com/news/articles/2022-12-30/tesla-tsla-illegally-silenced-florida-workers-about-pay-nlrb-alleges\"><em>Bloomberg</em></a>, NLRB's Tampa regional director filed a complaint against the automaker in September for breaking the law when it told employees not to discuss their pay with other people and not to talk about the termination of another employee. In addition, based on the filing the news organization obtained through a Freedom of Information Act request, Tesla management reportedly told employees &quot;not to complain to higher level managers&quot; about their working conditions.&nbsp;</p><p>Tesla has had to face several <a href=\"https://www.engadget.com/2017-09-01-tesla-hit-with-unfair-labor-complaint-from-us-watchdog.html\">complaints by the NLRB</a> over the past years. In 2021, the agency found that the automaker had <a href=\"https://www.engadget.com/2019-09-28-tesla-musk-tweet-labor-law-violation.html\">violated</a> US labor laws by firing a union activist and threatening workers' benefits. The NLRB <a href=\"https://www.engadget.com/elon-musk-ordered-to-delete-tweet-from-2018-111132733.html\">ordered</a> the company to rehire union activist Richard Ortiz and to remove all mentions of disciplinary action from his files. It also ordered Tesla chief Elon Musk to delete a tweet that the court had deemed a threat that employees would be giving up company-paid stock options if they join a union. The tweet in question is <a href=\"https://twitter.com/elonmusk/status/998454539941367808\">still live</a>, and Tesla is <a href=\"https://www.reuters.com/legal/transactional/musk-tweet-union-campaign-not-illegal-threat-says-tesla-lawyer-2022-02-02/\">appealing</a> the NLRB's ruling in court.&nbsp;</p><span id=\"end-legacy-contents\"></span><p>An agency spokesperson told <em>Bloomberg</em> that a judge will hear the complaint filed by the Tampa regional director in February. As the publication notes, companies can still appeal the agency judges' decision to NLRB members in Washington and then to federal court, so any corrective action may take years to happen.</p>", "link": "https://www.engadget.com/nlrb-tesla-violated-the-law-telling-employees-not-to-talk-about-pay-085124724.html?src=rss", "date_published": "2022-12-31 08:51:24+00:00", "persistent": false, "user": null, "language": "en-US"}]