[{"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Kathy Griffin Takes Swipe At CNN’s New Year’s Eve Coverage With Anderson Cooper, Andy Cohen", "description": "Kathy Griffin took a shot at CNN ahead of the network&#8217;s New Year&#8217;s Eve coverage with anchor Anderson Cooper and his co-host for the event, Andy Cohen. &#8220;I can’t wait to watch Miley and Dolly tonight,&#8221; Griffin, who was fired from co-hosting the show, wrote on Instagram. Fox News reported that the remarks were an ...", "link": "https://www.dailywire.com/news/kathy-griffin-takes-swipe-at-cnns-new-years-eve-coverage-with-anderson-cooper-andy-cohen", "date_published": "2022-12-31 23:05:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Biden Reportedly Would Rage Over Reminders Of Trump In White House: ‘What A F***ing A**hole’", "description": "President Joe Biden would reportedly become enraged when he would stumble across reminders of former President Donald Trump inside the White House. The revelation was made in the forthcoming book, &#8220;The Fight of His Life: Inside Joe Biden&#8217;s White House,&#8221; by author Chris Whipple. The Daily Mail reported that examples of remnants from the Trump ...", "link": "https://www.dailywire.com/news/biden-reportedly-would-rage-over-reminders-of-trump-in-white-house-what-a-fing-ahole", "date_published": "2022-12-31 22:52:01+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Nancy Grace Reacts To Arrest Of Idaho Murders Suspect: ‘Would Suggest That There Is An Accomplice’", "description": "Crime show host Nancy Grace suggested that the revelation of what the Idaho murders suspect told law enforcement officials on Friday suggests that there might be an accomplice involved. It has been more than a month since Kaylee Goncalves, 21; Ethan Chapin, 20; Xana Kernodle, 20; and Madison Mogen, 21, were murdered in their home ...", "link": "https://www.dailywire.com/news/nancy-grace-reacts-to-arrest-of-idaho-murders-suspect-would-suggest-that-there-is-an-accomplice", "date_published": "2022-12-31 22:33:16+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "After Seeing Trump’s Tax Returns, I Would Like To Hire His Accountant So That I, Too, Can Pay As Little In Taxes As Possible", "description": "After nearly half of a decade, Congressional Democrats finally released former President Donald J. Trump&#8217;s tax returns and you won&#8217;t believe what happened next! Of course, nothing happened. Like any article that says, &#8220;you won&#8217;t believe what happened next!&#8221; what occurs next is the most obvious sequence of events of all time. The tax returns ...", "link": "https://www.dailywire.com/news/after-seeing-trumps-tax-returns-i-would-like-to-hire-his-accountant-so-that-i-too-can-pay-as-little-in-taxes-as-possible", "date_published": "2022-12-31 22:29:38+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "CNN’s Anderson Cooper, Andy Cohen Takes Shots During New Year’s Eve Coverage … It’s Not Alcohol", "description": "CNN&#8217;s Anderson Cooper and Andy Cohen rang in the New Year on the network by taking shots of non-alcoholic substances. During a company town hall back in November, CNN chairman and CEO Chris Licht informed staff that he would put a stop to much of the drinking that has usually been a hallmark of CNN’s ...", "link": "https://www.dailywire.com/news/cnns-anderson-cooper-andy-cohen-takes-shots-during-new-years-eve-coverage-its-not-alcohol", "date_published": "2022-12-31 22:23:23+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Hacked Material Shows Russia’s Propaganda Agreement With China: Report", "description": "Documents that were discovered in hacked emails from a Russian media broadcaster reveal that Russia and China have signed agreements to cooperate at coordinating propaganda that counters information in the free Western world. The Intercept noted that a prime example can be seen in China&#8217;s quick adoption of Russia&#8217;s debunked claim that the U.S. was ...", "link": "https://www.dailywire.com/news/hacked-material-shows-russias-propaganda-agreement-with-china-report", "date_published": "2022-12-31 22:19:22+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Iran’s IRGC Believed To Behind Attacks On Jewish Centers In Germany: Reports", "description": "German law enforcement officials reportedly believe that Iran&#8217;s Islamic Revolutionary Guard Corps (IRGC), which is a designated terrorist organization by the U.S., is behind a series of attacks on Jewish centers inside the country. Iran International reported that Iran conducts the operations by hiring criminals outside of Iran. Police have launched a probe investigating a ...", "link": "https://www.dailywire.com/news/irans-irgc-believed-to-behind-attacks-on-jewish-centers-in-germany-reports", "date_published": "2022-12-31 22:10:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Idaho Murders Suspect Believes He Will Be Exonerated During Court Proceedings: Report", "description": "The Idaho murders suspect is expected to waive his right to have his upcoming extradition hearing in front of a judge, according to a new report. It has been more than a month since Kaylee Goncalves, 21; Ethan Chapin, 20; Xana Kernodle, 20; and Madison Mogen, 21, were murdered in their home on November 13. ...", "link": "https://www.dailywire.com/news/idaho-murders-suspect-believes-he-will-be-exonerated-during-court-proceedings-report", "date_published": "2022-12-31 21:45:22+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Fauci Has A Gigantic Wall Filled With Portraits Of Himself In His Home Office", "description": "It seems that Dr. Anthony Fauci, the president’s outgoing top medical adviser and the director of the National Institute of Allergy and Infectious Diseases (NIAID), is a little embarrassed that The New York Times saw his gigantic wall filled with portraits of himself in his home office. The career bureaucrat doesn&#8217;t want his critics to ...", "link": "https://www.dailywire.com/news/fauci-has-a-gigantic-wall-filled-with-portraits-of-himself-in-his-home-office", "date_published": "2022-12-31 21:34:46+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "TCU Wins The Fiesta Bowl And Gets A Trophy That Weighs More Than A Grown Man, Worth $2.5 Million", "description": "In dramatic fashion, #3 Texas Christian University upset #2 the University of Michigan by a score of 51 &#8211; 45 in the VRBO Fiesta Bowl. The Horned Frogs will go on to face the winner of the #4 ranked Ohio State University vs. #1 University of Georgia, but before that happens, the Cinderella story football ...", "link": "https://www.dailywire.com/news/tcu-wins-the-fiesta-bowl-and-gets-a-trophy-that-weighs-more-than-a-grown-man-worth-2-5-million", "date_published": "2022-12-31 20:56:38+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Biden Remarks About 2024 Presidential Run While Vacationing In Caribbean", "description": "President Joe Biden dodged questions late this week about whether he was going to run for re-election in 2024. Mediaite reported that Biden ignored questions about whether he discussed the matter with his family as he was leaving a restaurant in downtown Christiansted on St. Croix. Biden apparently quipped at reporters, jokingly asking, “There’s an election ...", "link": "https://www.dailywire.com/news/biden-remarks-about-2024-presidential-run-while-vacationing-in-caribbean", "date_published": "2022-12-31 20:39:10+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "7 Of The Worst Political Predictions Of 2022", "description": "As 2022 comes to a close, it&#8217;s worth taking a look back and revisiting some of the worst political predictions that were made this year. The following are seven of the worst predictions that were made, according to an exhaustive list that was compiled by Politico: 1. Sam Bankman-Fried: “I don’t think I will be arrested” ...", "link": "https://www.dailywire.com/news/7-of-the-worst-political-predictions-of-2022", "date_published": "2022-12-31 20:03:17+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "12 Of The Biggest Names Who Died In 2022", "description": "As 2022 comes to an end, it&#8217;s worth taking a look back at some of the biggest names who died this year. Here are 12 of the biggest names who passed away: 1. Bob Saget Legendary comedian Bob Saget passed away on January 9 at 65 years old. Saget died of head trauma, not drugs ...", "link": "https://www.dailywire.com/news/12-of-the-biggest-names-who-died-in-2022", "date_published": "2022-12-31 19:28:02+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Ex-Assistant FBI Director Compares Idaho Murders Suspect To Notorious Serial Killer, Suggests More Victims", "description": "Former FBI assistant director Chris Swecker said during an interview late this week that he believes that the 28-year-old man accused of murdering four University of Idaho students is like notorious serial killer Ted Bundy. Swecker&#8217;s comments come after authorities arrested the suspect, who The Daily Wire is not naming in keeping with a policy ...", "link": "https://www.dailywire.com/news/ex-assistant-fbi-director-compares-idaho-murders-suspect-to-notorious-serial-killer-suggests-more-victims", "date_published": "2022-12-31 18:44:32+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Florida Business Partners Shoot Each Other To Death", "description": "Two Florida business partners ended a work dispute permanently this week when they shot each other to death. The two men were involved in a dispute at their auto body service business in Lakeland, Florida, on Thursday. The argument quickly devolved into a shootout, the Polk County Sheriff&#8217;s Office said. One of the business owners ...", "link": "https://www.dailywire.com/news/florida-business-partners-shoot-each-other-to-death", "date_published": "2022-12-31 18:29:14+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Sex Is Binary: Switzerland Rejects Gender Ideology In New Ruling", "description": "The Swiss government has rejected the idea of introducing a “third gender” or “no gender” option for official records. Last week, Switzerland opted not to hop on the “gender identity” ideology bandwagon that its European neighbors have deferred to. Swiss residents will continue to be entered into the nation’s civil registry as male or female, ...", "link": "https://www.dailywire.com/news/sex-is-binary-switzerland-rejects-gender-ideology-in-new-ruling", "date_published": "2022-12-31 18:06:13+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "College Football Player Killed In Tragic Construction Accident In His Hometown", "description": "A college football player died in a tragic construction accident Friday. Brigham Young University offensive lineman Sione Veikoso was killed in the accident in his hometown of Kailua, Hawaii, on Friday, the team stated on Twitter. Veikoso was working with a construction crew in the area when a retaining wall collapsed. A transfer from Arizona ...", "link": "https://www.dailywire.com/news/college-football-player-killed-in-tragic-construction-accident-in-his-hometown", "date_published": "2022-12-31 17:12:11+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "ABC News Producer’s Widow Arrested On Child Endangerment Charges: Report", "description": "Police arrested the widow of ABC News producer Dax Tejera on child endangerment charges in New York City hours after her husband died of a heart attack just before Christmas, according to authorities cited in a new report. Veronica Tejera was booked on two counts of “acting in a manner injurious to a child” after ...", "link": "https://www.dailywire.com/news/abc-news-producers-widow-arrested-on-child-endangerment-charges-report", "date_published": "2022-12-31 17:08:51+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Controversial California Fast Food Minimum Wage Law Placed On Hold", "description": "A California court issued a temporary hold on a law that would establish a board permitted to increase minimum wages received by fast food workers. The Fast Food Accountability and Standards Recovery Act, also known as the FAST Recovery Act, would create a “Fast Food Council” responsible for drafting “sectorwide minimum standards on wages, working ...", "link": "https://www.dailywire.com/news/controversial-california-fast-food-minimum-wage-law-placed-on-hold", "date_published": "2022-12-31 16:36:43+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Good Samaritans’: NFL Quarterback And Brothers Praised After Jet Ski Rescue Of Helicopter Crash Survivors", "description": "NFL quarterback Blaine Gabbert and his brothers aided in the rescue of four people whose helicopter had crashed into Hillsborough Bay in Florida. Gabbert, a backup quarterback for the Tampa Bay Buccaneers, and his two brothers, were out on jet skis when they came upon a helicopter crash Thursday night. &#8220;I vaguely remember hearing a ...", "link": "https://www.dailywire.com/news/good-samaritans-nfl-quarterback-and-brothers-praised-after-jet-ski-rescue-of-helicopter-crash-survivors", "date_published": "2022-12-31 16:34:18+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Five Takeaways From Twitter FBI Agent’s Deposition In Censorship Lawsuit Brought By Conservative States", "description": "Missouri Attorney General Eric Schmitt and Louisiana Attorney General Jeff Landry are suing the Biden administration for allegedly colluding with social media companies to censor speech. As part of that lawsuit, FBI agent Elvis Chan sat for a lengthy deposition about his interactions with executives from Twitter and other social media companies.", "link": "https://www.dailywire.com/news/five-takeaways-from-twitter-fbi-agents-deposition-in-censorship-lawsuit-brought-by-conservative-states", "date_published": "2022-12-31 16:26:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘We Refused To Capitulate On Our Biblical Standards’: Christian News Outlet Restored To Twitter After Months Of Suspension", "description": "The Twitter account belonging to The Christian Post was restored on Saturday following a nine-month suspension over a tweet calling Health and Human Services Assistant Secretary Rachel Levine, who claims identity as a transgender woman, a “man.” The move comes two months after Elon Musk officially took control of Twitter following a $44 billion acquisition ...", "link": "https://www.dailywire.com/news/we-refused-to-capitulate-on-our-biblical-standards-christian-news-outlet-restored-to-twitter-after-months-of-suspension", "date_published": "2022-12-31 15:39:13+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Bernie Sanders, Ro Khanna Tear Into Pete Buttigieg Over Southwest Airlines Fiasco", "description": "Several lawmakers blasted Transportation Secretary Pete Buttigieg over the meltdown at Southwest Airlines which caused thousands of passengers to miss their flights, claiming that the situation could have been avoided. The company, which announced plans to resume normal operations beginning on Friday, canceled roughly two-thirds of flights during the busy Christmas travel season, even after ...", "link": "https://www.dailywire.com/news/bernie-sanders-ro-khanna-tear-into-pete-buttigieg-over-southwest-airlines-fiasco", "date_published": "2022-12-31 15:00:09+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Disease Eliminated In U.S. Decades Ago Surges Back, Sending Dozens Of Children To Hospitals: Reports", "description": "A disease that U.S. health officials declared as eliminated at the turn of the century has surged back in recent weeks, sending dozens of children to hospitals. At least 82 children in central Ohio have contracted measles over the last two months, with at least 32 needing to be hospitalized due to the severity of ...", "link": "https://www.dailywire.com/news/disease-eliminated-in-u-s-decades-ago-surges-back-sending-dozens-of-children-to-hospitals-reports", "date_published": "2022-12-31 14:44:11+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Idaho Murders Suspect Asked Criminals In A Survey How They Chose Their Victims: Report", "description": "The 28-year-old man arrested in connection with the killing of four University of Idaho students last month was a criminology graduate student who reportedly conducted a survey asking criminals how they chose their victims. It had been more than a month since Kaylee Goncalves, 21; Ethan Chapin, 20; Xana Kernodle, 20; and Madison Mogen, 21, ...", "link": "https://www.dailywire.com/news/idaho-murders-suspect-asked-criminals-in-a-survey-how-they-chose-their-victims-report", "date_published": "2022-12-31 14:26:46+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "CDC Promotes New Tool To Increase Schools’ Acceptance Of Gender Ideology", "description": "The Centers for Disease Control (CDC) this week promoted a tool meant to encourage schools across the U.S. to embrace gender ideology to increase “inclusivity.”  On Tuesday, the CDC’s Division of Adolescent and School Health put out a link to a resource aimed at helping school administrators “quickly gauge inclusivity” at their schools.  The resource, ...", "link": "https://www.dailywire.com/news/cdc-promotes-new-tool-to-increase-schools-acceptance-of-gender-ideology", "date_published": "2022-12-31 13:18:03+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Gas Prices In 2022 Were The Highest On Record. Here’s Where They Could Be Heading Next Year.", "description": "In 2022, national average gas prices in the United States reached their highest point since GasBuddy began keeping track, and they could remain elevated relative to earlier levels next year. The fuel analytics company marked average prices at $3.96 per gallon for 2022, far surpassing the $3.02 per gallon average charted in 2021 and the ...", "link": "https://www.dailywire.com/news/gas-prices-in-2022-were-the-highest-on-record-heres-where-they-could-be-heading-next-year", "date_published": "2022-12-31 12:46:52+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "New York Police Praise Man Who Broke Into School To Save Stranded Winter Storm Travelers", "description": "Police in New York praised a man who broke into a school to shelter travelers stranded during last week’s winter storm that left dozens dead.  Jay Withey, of Cheektowaga, New York, broke into a local school during the storm in order to shelter 24 people who had been left stuck in their cars in the Buffalo ...", "link": "https://www.dailywire.com/news/new-york-police-praise-man-who-broke-into-school-to-save-stranded-winter-storm-travelers", "date_published": "2022-12-31 11:05:05+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Stocks Had Their Worst Year Since 2008 After Biden Boasted About Their Performance", "description": "One of the worst years for stocks in recent decades came after President Joe Biden made a series of rosy predictions about their performance. The S&amp;P 500 index has fallen nearly 20% since the beginning of the year, rivaling the 37% decline witnessed in 2008 amid the collapse of the American banking system, as well ...", "link": "https://www.dailywire.com/news/stocks-had-their-worst-year-since-2008-after-biden-boasted-about-their-performance", "date_published": "2022-12-31 11:02:02+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Federal Appeals Court Ruling On Transgender School Bathroom Policy May Trigger SCOTUS Showdown", "description": "The decision by a federal appeals court Friday to uphold a Florida school district&#8217;s policy barring trans students from using the restroom corresponding to their chosen sex could set up a showdown in the U.S. Supreme Court over the contentious issue. In a 7-4 decision, the 11th U.S. Circuit Court of Appeals held that the ...", "link": "https://www.dailywire.com/news/federal-appeals-court-ruling-on-transgender-school-bathroom-policy-may-trigger-scotus-showdown", "date_published": "2022-12-31 09:07:44+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "NC State Radio Voice Yanked Off The Air After Referencing ‘Illegal Aliens’ At The Southern Border", "description": "NC State radio broadcaster Gary Hahn was suspended indefinitely late this week after he mentioned &#8220;illegal aliens&#8221; during the Wolfpack&#8217;s bowl game against Maryland. The two teams squared off in the Mayo Bowl in Charlotte, North Carolina, Friday with the Terrapins beating the Wolfpack 16-12. Hahn made the remarks while updating fans on the score ...", "link": "https://www.dailywire.com/news/nc-state-radio-voice-yanked-off-the-air-after-referencing-illegal-alien-crisis-on-southern-border", "date_published": "2022-12-31 08:24:24+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "BREAKING: Pope Emeritus Benedict XVI Dead At 95", "description": "VATICAN CITY — Pope Benedict XVI, the former head of the Catholic Church whose historic resignation in 2013 created the position of “pope emeritus,” has died following a short illness. He was 95 years old. The Vatican confirmed his death Saturday local time. His body will lie in state at St. Peter&#8217;s Basilica beginning January ...", "link": "https://www.dailywire.com/news/breaking-pope-emeritus-benedict-xvi-dead-at-95", "date_published": "2022-12-31 05:03:52+00:00", "persistent": false, "user": null, "language": "en-US"}]