[{"source": "https://www.gamespot.com/feeds/mashup", "title": "Firearms Expert’s MOST CURSED Weapons Of 2022", "description": "<img height=\"480\" src=\"https://www.gamespot.com/a/uploads/square_medium/1571/15719603/4073975-cursed2022_site.jpg\" width=\"480\" /> Jonathan Ferguson, a weapons expert and Keeper of Firearms &amp; Artillery at the Royal Armouries, breaks down some of the most cursed weapons of 2022, including the horrific Porta-Pooper 5000 from Borderlands 3, COD Warzone’s Burger Town Classic, and a particularly cursed Glock-18 from Escape From Tarkov.", "link": "https://www.gamespot.com/videos/firearms-experts-most-cursed-weapons-of-2022/2300-6460190/", "date_published": "2022-12-31 15:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Steam Deck Opened Up PC Gaming In 2022 Like Never Before", "description": "<p dir=\"ltr\">Despite spending well over a decade in the games media, I've never been much of a PC gamer. I had played PC games a little in my youth, but I transitioned to a short-lived career in graphic design--where Mac reigned supreme--around the same time the PC hardware arms race accelerated. As a result, PC games have long felt out of reach for me, both financially and as a matter of practical understanding. Even if I could afford it, I didn't have the know-how to build a PC, I heard mixed-at-best things about prefab gaming rigs, and I didn't have the time to educate myself on either one. I settled into a place where PC gaming always felt like it'd be foreign and obtuse. It was against this backdrop that the Steam Deck arrived, effectively toppling most of the barriers that stood between me and the community of PC gamers.</p><p dir=\"ltr\">The cost was certainly one important consideration. At roughly $500 for the mid-tier model, the Steam Deck is around half the price of many standard pre-built gaming PCs, and roughly on-par with a gaming console like the PS5 and Xbox Series X. This made it an easier pill to swallow, and a good starting point for me as someone who had built up a very small library of Steam games over the years and was just looking to dip a toe in, regardless.</p><p dir=\"ltr\">It was a good price point partly because of its other significant feature, its form factor. Steam Deck is a portable PC first and foremost, which no doubt appeals to veteran PC players looking to take their games on the go. I came at it from the other side, though, as a dedicated Nintendo Switch fan who just loves portable gaming. I play plenty of games on my consoles, but portables have always just fit into my life better, as a matter of sheer convenience. Gaming on the go feels more at home to me, so the Steam Deck pitch of a portable PC definitely stood out to me due to the portable part. This wasn't a new way to play my PC library, but rather, a new platform altogether that already happened to be similar in function and form to another platform I loved: the Switch.</p><a href=\"https://www.gamespot.com/articles/steam-deck-opened-up-pc-gaming-in-2022-like-never-before/1100-6510186/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/steam-deck-opened-up-pc-gaming-in-2022-like-never-before/1100-6510186/?ftag=CAD-01-10abi2f", "date_published": "2022-12-31 14:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]