[{"source": "https://feeds.feedburner.com/TheHackersNews", "title": "Download eBook: Top virtual CISOs share 7 tips for vCISO service providers", "description": "Virtual Chief Information Security Officer (vCISO) services (also known as 'Fractional CISO' or 'CISO-as-a-Service') are growing in popularity, especially as growing cyber threats, tightening regulatory demands and strict cyber insurance requirements are driving small to medium-sized enterprises demand for strategic cybersecurity and compliance guidance and management. But vCISO services are", "link": "https://thehackernews.com/2022/10/download-ebook-top-virtual-cisos-share.html", "date_published": "2022-10-24 17:34:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://feeds.feedburner.com/TheHackersNews", "title": "SideWinder APT Using New WarHawk Backdoor to Target Entities in Pakistan", "description": "SideWinder, a prolific nation-state actor mainly known for targeting Pakistan military entities, compromised the official website of the National Electric Power Regulatory Authority (NEPRA) to deliver a tailored malware called WarHawk.\n\"The newly discovered WarHawk backdoor contains various malicious modules that deliver Cobalt Strike, incorporating new TTPs such as KernelCallBackTable injection", "link": "https://thehackernews.com/2022/10/sidewinder-apt-using-new-warhawk.html", "date_published": "2022-10-24 06:25:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://feeds.feedburner.com/TheHackersNews", "title": "CISA Warns of Daixin Team Hackers Targeting Health Organizations With Ransomware", "description": "U.S. cybersecurity and intelligence agencies have published a joint advisory warning of attacks perpetrated by a cybercrime gang known as the Daixin Team primarily targeting the healthcare sector in the country.\n\"The Daixin Team is a ransomware and data extortion group that has targeted the HPH Sector with ransomware and data extortion operations since at least June 2022,\" the agencies said.\nThe", "link": "https://thehackernews.com/2022/10/cisa-warns-of-daixin-team-hackers.html", "date_published": "2022-10-24 06:12:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://feeds.feedburner.com/TheHackersNews", "title": "Why Ransomware in Education on the Rise and What That Means for 2023", "description": "The breach of LA Unified School District (LAUSD) highlights the prevalence of password vulnerabilities, as criminal hackers continue to use breached credentials in increasingly frequent ransomware attacks on education.\nThe Labor Day weekend breach of LAUSD brought significant districtwide disruptions to access to email, computers, and applications. It's unclear what student or employee data the", "link": "https://thehackernews.com/2022/10/why-ransomware-in-education-on-rise-and.html", "date_published": "2022-10-24 05:45:00+00:00", "persistent": false, "user": null, "language": "en-US"}]