[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Age of Empires 25th Anniversary Livestream", "description": "Celebrate 25 years of Age of Empires with a special Anniversary Broadcast featuring announcements, trailers, and some surprises!\r\n\r\n#ageofempires #gaming", "link": "https://www.youtube.com/watch?v=FUcEToqYAOE", "date_published": "2022-10-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Bayonetta 3 Everything To Know", "description": "Bayonetta, the angel-hunting umbra witch is back for her 3rd installment in the much beloved PlatinumGames title. With the planned release date of October 28, 2022 fast approaching, here is Everything You Need to Know about Bayonetta 3.\n#bayonetta #bayonetta3 #gamespot \n\nThe original Bayonetta was created and directed by Hideki Kamiya. The same man behind Devil May Cry, and the advent of the arcadey combo-heavy 3D action game style. So, after creating a 2D game in a similar style via Viewtiful Joe, Kamiya created what would become another beloved combo-heavy action game -  Bayonetta.\nBayonetta took what Devil May Cry started, and added a stylistic new protagonist in its titular character, as well as stand out, gigantic boss fights. Her clothing is her hair, which she also uses for magic and to summon demons, and there’s overt sexual overtones throughout.\nBayonetta 3 releases October 28, 2022\n\nTimestamps:\n0:00 - Intro\n0:18 - Development\n1:46 - Gameplay\n4:58 - Story\n5:36 - Controversy\n8:08 - Release Date", "link": "https://www.youtube.com/watch?v=yNdtz6JAc6w", "date_published": "2022-10-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Free PS Plus For November 2022 Leaked | GameSpot News", "description": "November’s free games for PlayStation Plus and Amazon Prime Gaming have reportedly leaked. \n#GamingNews #PSPlus #PS5 \n\nNioh 2 is a yokai-slaying action game from Team Ninja that combines the pinpoint swordplay of Ninja Gaiden with the mechanics of Dark Souls. If you're up for that sort of thing, it's one of the best Souls-likes around, and is definitely worth a look. Both the PS5 and PS4 versions of Nioh 2 will be free.\n\nThe Lego Harry Potter Collection is not the most recent Lego video game out there, as it was released in 2016, but it's regarded as one of the best by reviewers and fans alike. This collection combines Years 1-4 and Years 5-7 into one game. If you've already blasted your way through the recent Lego Star Wars: The Skywalker Saga, it's a good next step.\n\nThe physics-based puzzle game Heavenly Bodies rounds out November's selection of games. It allows players to explore a zero-gravity environment, solve puzzles, and collect space goodies. The PS5 and PS4 versions of Heavenly Bodies will be available to claim.\n\nFallout: New Vegas is developed by Obsidian Entertainment originally released in 2010 for consoles and PC. New Vegas improved on the gameplay systems presented in Fallout 3 and offered a wider mission variety. With a huge open world and a huge collection of sidequests, New Vegas was engaging even after completing the main campaign.", "link": "https://www.youtube.com/watch?v=ColqiVPm2gk", "date_published": "2022-10-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War Ragnarök | Combat and Enemies Official 4K Dev Overview", "description": "We’re heading to Alfheim, land of the elves, for Episode 2 of the God of War Ragnarök Behind the Scenes series. \n\nThis episode will explore how the team at Santa Monica Studio is elevating the fluid and expressive combat of God of War Ragnarök, as well as the importance of building a unique, memorable, and varied cast of enemies for players to test their skill against. \n\nGod of War Ragnarök is coming to PS4 and PS5 on November 9th!\n\n#GodOfWar #GodOfWarRagnarok", "link": "https://www.youtube.com/watch?v=ycuyY_B5qAc", "date_published": "2022-10-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Scarlet & Violet | Introducing Greavard Official HD Trailer", "description": "Greavard is so affectionate that paying it any attention will make it so happy that it will follow you wherever you go. However, Greavard will slowly and inadvertently absorb the life-force of those around it. \n\n#Pokemon #PokemonScarletAndViolet #Greavard", "link": "https://www.youtube.com/watch?v=S7VYm7T3chU", "date_published": "2022-10-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Scarlet and Violet Ghost Hunt Cinematic Trailer", "description": "A student from the Paldea region just uploaded this footage of their search for Ghost-type Pokemon.\n\n#Pokemon #PokemonScarletAndViolet #GhostHunt", "link": "https://www.youtube.com/watch?v=ma2q9yYj_XM", "date_published": "2022-10-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Redfall - Into the Night Official 4K Trailer", "description": "Halloween tastes different here. What better way to get into the spirit than with a brand new trailer highlighting some of the game’s creepiest bloodsuckers. From the devious Angler to the ever-vigilant Watcher, this is just a bite of what you and your squad will face as you fight to take back Redfall.\n\nRedfall arrives exclusively on Xbox Series X|S and PC in 2023. Play it day one with Game Pass.\n\n#Redfall #Bethesda #Gaming", "link": "https://www.youtube.com/watch?v=BhvYVwT4uW0", "date_published": "2022-10-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village: Winters' Expansion Review", "description": "New additions to The Mercenaries make the Winters' Expansion for Resident Evil Village worthwhile, but Shadows of Rose is a fleeting slice of forgettable story DLC.", "link": "https://www.youtube.com/watch?v=E14vZquDMEM", "date_published": "2022-10-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Original Bayonetta Voice Actor Reacts To Backlash | GameSpot News", "description": "Original Bayonetta voice actor responds to backlash, confirms she was offered $15k for Bayonetta 3.\n#GamingNews #Bayonetta3 #Reaction\n\nVoice actor Hellena Taylor originally said she was offered $4,000 to appear as the voice of Bayonetta in Bayonetta 3, a figure she said was \"insulting.\" Hellena was later replaced by veteran voice actor Jennifer Hale and Platinum Games put out a statement in support of Hale, who received a wave of criticism and backlash. \nAfter Taylor's claims went viral, Bloomberg published a report that said she was offered around $15,000, a figure Taylor has since confirmed to be accurate. In her new Twitter thread, Taylor said she was initially offered $10,000 total to play Bayonetta in the third game, but she deemed it to be too low and wrote a letter to Bayonetta 3 director Hideki Kamiya asking him to pay her what she was worth.\nTaylor said, \"I thought that as a creative, he would understand. He replied saying how much he valued my contribution to the game and how much the fans wanted me to voice the game.” She added that Platinum Games offered her an additional $5,000 for a total of $15,000, but she declined the offer. Taylor then explained, “I heard nothing from them for 11 months. They then offered me a flat fee to voice some lines for 4,000 dollars.”\nAnother major release coming out soon is God of War Ragnarok. Unfortunately for fans who wanted to go into the experience with fresh eyes, the game is leaking ahead of time. A Twitter account is posting screenshots of the game that contain spoilers, according to VGC, which has seen the account.", "link": "https://www.youtube.com/watch?v=cXmWrCRR0IM", "date_published": "2022-10-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Complete BATMAN ARKHAM Timeline Explained!", "description": "The Batman Arkham franchise has grown to become an extensive series with a timeline that glides its way through 5 mainline games, a handful of spin-offs, a plethora of tie-in comic books, a novel, a VR experience, and a movie. But how does everything tie together?\n#Batman #ArkhamCity #ArkhamAsylum #SuicideSquad \n\nThis video breaks down the franchise chronologically, charting the story of Bruce Wayne’s alter ego of Batman from his origins, through to his supposed demise, and the rise of the Suicide Squad.\n\nWith Suicide Squad: Kill The Justice League set to expand the Batman Arkham franchise, what better time to dive back into the gaming saga of the Dark Knight.\n\n00:00 - Opening \n01:17 - Batman Arkham Origins\n03:42 - Batman Arkham Origins Blackgate\n04:37 - Batgirl: A Matter of Family\n05:37 - Batman: Assault on Arkham\n07:18 - Batman Arkham Asylum\n09:29 - Between Asylum and City\n10:51 - Batman Arkham City\n13:53 - Between City and Knight\n15:38 - Batman Arkham Knight\n19:43 - Suicide Squad: Kill the Justice League\n20:38 - Ending", "link": "https://www.youtube.com/watch?v=c1dv6aHLz5o", "date_published": "2022-10-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Horror of Dead Space", "description": "No game does the jump scare better than the original Dead Space. But why are they so effective?\n#deadspace #gaming #gamespot #horror \n\nHey, Stu here. In this video, I'm going to unravel what makes the original Dead Space such a classic in the horror genre. I'm going to layout the art of Dead Space's jump scares, and why it's a master class in its use of not just horror, but terror as well. So buckle up, and let's learn why necormorphs keep us up at night. And with the Dead Space Remake just a few months away, what better time than now to look back on this pinnacle space horror.\n\nTIMESTAMPS:\n00:00 Intro\n00:30 Terror Vs. Horror Breakdown\n02:17 Jump Scare Thoughts\n02:51 Communication\n04:16 Subversion\n05:42 Terrifying By Design\n06:06 Horror Is Fleeting\n06:36 Terrifying Environments\n08:06 Outro", "link": "https://www.youtube.com/watch?v=r6WVpJjQVVs", "date_published": "2022-10-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]