[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Assassin’s Creed Valhalla: Dawn of Ragnarök - Everything To Know", "description": "The latest from Ubisoft Sofia, Dawn of Ragnarök is Assassin’s Creed Valhalla’s third major piece of story DLC. However, unlike The Siege of Paris or Wrath of the Druids, this features a longer story and new gameplay mechanics. Here’s everything you need to know about Assassin’s Creed Valhalla: Dawn of Ragnarok.\n\nDawn Of Ragnarök is a 35-hour adventure that makes some massive changes and additions to the base game's formula, putting you in full control of a Norse god and their mythical abilities. Controlling Odin throughout your journey into one of the most dangerous areas of Valhalla is meant as endgame content, though newer players can receive a temporary power and equipment boost if they want to play it earlier.\n\nAssassin's Creed Valhalla: Dawn of Ragnarök releases for PS4, PS5, Xbox One, Xbox Series X|C, and PC on March 10.\n\nSTAMPS\n00:00 - Intro\n00:32 - Plot \n02:39 - Setting\n03:22 - Gameplay\n06:03 - Development Team \n06:31 - Platforms\n\n#AssassinsCreedValhalla #DawnofRagnarok", "link": "https://www.youtube.com/watch?v=u0iHKksWXyk", "date_published": "2022-03-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "9 Things We Want From Pokémon Scarlet & Violet", "description": "Pokémon Scarlet & Violet are sure to bring a bunch of new changes to the classic Pokémon formula. Here are 9 things we would love to see in the upcoming Gen 9 games.\n\nPokémon Scarlet & Violet is officially revealed. We know very little about the games except for the three new starters. That won’t stop us from speculating and breaking down all the things we’d like to see in a new Pokémon game. In this video, we’ve got 9 big things we want to see, some of them pretty plausible while others may be a bit of a reach. That won’t stop us from dreaming! \n\nPokémon Legends: Arceus has an excellent blueprint that Scarlet & Violet will hopefully pull from, but significant improvements should be made, especially on a visual level. Beyond that, we go into a desire for references to older Gen games, a content-packed end game with plenty of depth and more quality of life improvements, such as the return of Secret Bases!\n\nPokémon Scarlet & Violet doesn’t have a release date yet but is slated to come out late in 2022. If you have anything you want to see from Gen 9, leave your thoughts in the comments below. Check out our guides and videos on our channel or GameSpot.com for all else Pokémon.\n\nTime Stamps: \n0:28:27 - Red & Blue Throwbacks\n0:58:00 - A Rich Endgame\n2:30:00 - The Return Of PvP\n3:20 - Gym Battles With A Twist\n4:26 - Secret Bases (Gen 3 Style)\n5:24 - More Open World\n6:18 - Good Optimization\n6:52 - Voice Acting\n7:32 - Evolutions For Older Pokemon", "link": "https://www.youtube.com/watch?v=PvL98NS9q5Y", "date_published": "2022-03-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "How Games Get Weapon Attachments Wrong - Loadout", "description": "Whether it’s Call of Duty: Vanguard or Escape From Tarkov, modern shooters love to let you customise your weapons with a whole range of attachments, sights, grips, and suppressors. From Rainbow Six through to Battlefield, it’s a phenomenon that has spanned the shooter genre for longer than we think, so why then do many developers still miss the mark in their portrayal of weapon attachments?\n\nIn this episode of Loadout, Dave Jewitt visits the Royal Armouries to talk to Keeper of Firearms & Artillery Jonathan Ferguson to chat about gaming’s obsession with modular firearm attachments, from scopes and suppressors to foregrips and drum magazines.\n\nYou can check out more episodes of Loadout right here. - https://www.youtube.com/watch?v=yzSrmGkpWKk&list=PLpg6WLs8kxGMzIemU1gyyLmg5VlKI2UvC\n\nYou can check out our Firearms Expert Reacts series here. - https://www.youtube.com/watch?v=5FVzcoRjoN4&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/", "link": "https://www.youtube.com/watch?v=AiRMLtLbY5E", "date_published": "2022-03-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]