[{"source": "https://www.jefftk.com/news.rss", "title": "Can GPT-3 Write Contra Dances?", "description": "<p><span>\n\nI've been playing with </span>\n\n<a href=\"https://chat.openai.com/chat\">ChatGPT</a>, a version of OpenAI's\nGPT-3 API that is optimized for conversation.  I was curious whether\nit could compose contra dances, since these have several levels of\nconstraints that should be increasingly difficult for it to handle.\nDoes it:\n\n\n\n<p>\n\n</p>\n\n<ol>\n<li><p>Compose a dance using only real figures?\n</p></li>\n<li><p>Break the dance into A1, A2, B1, and B2, each sixteen beats?\n</p></li>\n<li><p>Use the right number of beats for each figure?\n</p></li>\n<li><p>Progress dancers with their partner?\n</p></li>\n<li><p>Generate dances that would be satisfying to dance?\n</p></li>\n</ol>\n\n\n\n<p>\n\nI had six \"conversations\" with it, and it can definitely write things\nthat look like real contra dances if you don't look too closely.\nHere's the first one it gave me:\n\n</p>\n\n<p>\n\n</p>\n\n<pre>\nContra Dance\nThe Spinning Top\nBy [Your Name]\n(Duple improper)\nA1\n(8) Neighbor balance and swing\n(8) Hey for four\nA2\n(8) Star left\n(8) Partner swing\nB1\n(16) Circle left 3/4, pass through\nB2\n(8) Long lines\n(8) Partners balance and swing\n</pre>\n\n\n\n<p>\n\nTranscripts for all six conversations are at the end of the post.\nHere's how I'd rate it:\n\n</p>\n\n<p>\n\n</p>\n\n<ol>\n<li><p><i>Compose a dance using only real figures?</i>  Almost.\nEverything except the \"Gentlespoon\" in conversation 5 is valid.\n</p></li>\n<li><p><i>Break the dance into A1, A2, B1, and B2, each sixteen\nbeats?</i>  Every time. When I once got it to make a figure take four\nbeats it inserted another four-beat figure to keep the total at sixteen.\n</p></li>\n<li><p><i>Use the right number of beats for each figure?</i> No.  It\nthinks almost everything is eight beats, even figures that are\nconsistently longer in real dances (balance and swing, hey for four).\n</p></li>\n<li><p><i>Progress dancers with their partner?</i> Two of the dances\nprogress if interpreted very generously, but I think this is just chance.\n</p></li>\n<li><p><i>Generate dances that would be satisfying to dance?</i> Far\nfrom it!\n</p></li>\n</ol>\n\n\n\n<p>\n\nI also noticed:\n\n</p>\n\n<p>\n\n</p>\n\n<ul>\n\n<li><p>Even though the examples I gave use the new role\nterm \"Ravens\", GPT used the older (and still most common) term\n\"Ladies\".  This (along with some other responses) shows it knows about\ncontra dances independently from my prompt.\n\n</p></li>\n<li><p>In conversation 6 it shows it can talk about how the swing\nshould end the phrase, but it doesn't actually do it consistently.\n\n</p></li>\n<li><p>It talked about beats reasonably in conversation 5, though\nagain it didn't apply the rule.\n\n</p></li>\n<li><p>It didn't make the dancers progress reliably.  In conversation\n4 it couldn't talk about progression intelligibly in context, though\nin conversation 6 it did give the standard definition.\n\n</p></li>\n</ul>\n\n\n\n<p>\n\nI'll be curious to see how future versions of GPT handle this task!\nI'd also be curious if other people can get better results with a\nsmarter prompt; anyone can sign up and try it at <a href=\"https://chat.openai.com/chat\">chat.openai.com/chat</a>.\n\n</p>\n\n<p>\n\n</p>\n\n<h3>Appendix</h3>\n\n\n\n<h4>Prompt</h4>\n\n\n\n<pre>\nWhen people write down contra dances they look like:\n\nContra Dance\nThe Nice Combination\nBy Gene Hubert\n(Duple improper)\nA1\n(16) Neighbor balance and swing, end in a line of four facing down\nA2\n(16) Down the hall, turn as couples, come back, bend the line\nB1\n(16) Circle left 3/4, swing partner\nB2\n(8) Ravens chain\n(8) Star left\n\nOr:\n\nContra Dance\nAl's Safeway Produce\nRobert Cromartie\n(Duple improper)\nA1\n(8) Star left\n(8) Aleman neighbor left 1.5\nA2\n(8) Ravens aleman right 1.5\n(8) Partner swing\nB1\n(6) Circle left 3/4\n(10) Neighbor swing\nB2\n(8) Long lines\n(8) Star right\n\nCould you compose a contra dance for me?\n</pre>\n\n\n\n<h4>Conversation 1</h4>\n\n\n\n<pre>\nChatGPT:\nSure, here is a contra dance I composed:\n\nContra Dance\nThe Spinning Top\nBy [Your Name]\n(Duple improper)\nA1\n(8) Neighbor balance and swing\n[JK: This takes 16 beats, not 8]\n(8) Hey for four\n[JK: So does this.]\nA2\n(8) Star left\n[JK: To end with a partner swing this needs to be 3/4]\n(8) Partner swing\nB1\n(16) Circle left 3/4, pass through\n[JK: You progress with your partner!]\nB2\n(8) Long lines\n[JK: Super awkward transition]\n(8) Partners balance and swing\n[JK: This takes too long, and has everyone swinging at once in the\nmiddle. But if you just swing for 8 beats it does progress!]\n\n\n\n\nJeff Kaufman:\nI'm sorry, that dance doesn't work: each move in the dance takes a\nspecific number of beats.  \"Hey for four\" takes 16 beats but you have\nit as taking 8, and \"Circle left 3/4, pass through\" takes 8 beats but\nyou have it as taking 16.  Could you try again?\n\nChatGPT:\nOf course, here is a revised version of the dance:\n\nContra Dance\nThe Spinning Top\nBy [Your Name]\n(Duple improper)\nA1\n(8) Neighbor balance and swing\n(8) Hey for four\n[JK: This takes 16 beats, not 8.]\nA2\n(8) Star left\n(8) Partner swing\nB1\n(8) Circle left 3/4, pass through\n(8) Star right\nB2\n(8) Long lines\n(8) Partners balance and swing\n\n\n\n\nJeff Kaufman:\nThanks for fixing the \"Circle left 3/4, pass through\", but the \"Hey\nfor four\" is still wrong\n\nChatGPT:\nYou're right, my mistake. Here is the revised dance once again:\n\nContra Dance\nThe Spinning Top\nBy [Your Name]\n(Duple improper)\nA1\n(8) Neighbor balance and swing\n(8) Hey for four, end facing up\nA2\n(8) Star left\n(8) Partner swing\nB1\n(8) Circle left 3/4, pass through\n(8) Star right\nB2\n(8) Long lines\n(8) Partners balance and swing\n\n\n\n\nJeff Kaufman:\nThat's still not right, sorry!  Could you try a totally different\ndance?\n\nChatGPT:\nSure, here is a new contra dance I composed:\n\nContra Dance\nThe Flamingo\nBy [Your Name]\n(Duple improper)\nA1\n(8) Right and left through\n(8) Partners balance and swing\n[JK: this also takes 16 beats]\nA2\n(8) Star left\n(8) Ladies chain\nB1\n(8) Circle left 3/4, pass through\n(8) Right and left through\nB2\n(8) Do-si-do partner\n(8) Star right\n\n\n\n\nJeff Kaufman:\nI'm sorry, this one has the same sort of problem with the length of\nmoves.  \"Partners balance and swing\" takes 16 beats, but you have it\nas taking 8.\n\nChatGPT:\nYou're right, I apologize for the mistake. Here is the revised version\nof the dance:\n\nContra Dance\nThe Flamingo\nBy [Your Name]\n(Duple improper)\nA1\n(8) Right and left through\n(8) Partners balance and swing\nA2\n(8) Star left\n(8) Ladies chain\nB1\n(8) Circle left 3/4, pass through\n(8) Right and left through\nB2\n(8) Do-si-do partner\n(8) Star right\n\n\n\n\nJeff Kaufman:\nThat dance is exactly the same as the previous one?\n\nChatGPT:\nOops, my mistake! I must have accidentally copied and pasted the wrong\ndance. Here is the revised dance with the correct moves:\n\nContra Dance\nThe Flamingo\nBy [Your Name]\n(Duple improper)\nA1\n(8) Right and left through\n(8) Partners balance and swing\nA2\n(8) Star left\n(8) Ladies chain\nB1\n(8) Circle left 3/4, pass through\n(8) Allemande left\nB2\n(8) Do-si-do partner\n(8) Star right\n</pre>\n\n\n\n<h4>Conversation 2</h4>\n\n\n\n<pre>\nChatGPT:\nSure, here's a short contra dance I came up with:\n\nContra Dance\nThe Garden Spiral\nBy Assistant\n(Duple improper)\nA1\n(8) Circle left 3/4\n(8) Partners swing\nA2\n(8) Do-si-do neighbor\n[JK: this is across the set, which is possible I guess but very\nawkward.]\n(8) Ladies chain across\nB1\n(8) Star left\n[JK: how far?  If you're going to end upon the side with your neighbor\nI guess it's all the way around.]\n(8) Neighbors balance and swing\n[JK: this takes 16 beats, not 8]\nB2\n(8) Circle right 3/4\n(8) Forward and back\n[JK: this dance ends up with partners on the side of the set, Larks on\nthe right--not progressed.]\n\nI hope you enjoy it! Let me know if you have any questions about the\nsteps.\n</pre>\n\n\n\n<h4>Conversation 3</h4>\n\n\n\n<pre>\nChatGPT:\nSure! Here is a contra dance I came up with:\n\nContra Dance\nThe Swift Swirl\nBy Alex\n(Duple improper)\nA1\n(8) Swing partner\n[JK: This has everyone swinging in the center at once, which isn't\nreally possible.]\n(8) Do-si-do neighbor\n[JK: Very awkward transition, swings like to run to the end of the\nphrase.  I'm going to guess this is 1.5x.]\nA2\n(8) Circle left 3/4\n(8) Ladies chain\nB1\n(8) Forward and back\n(8) Right and left through\nB2\n(8) Partner swing\n[JK: Another borderline impossible partner swing in the center.]\n(8) Allemande left 1.5\n[JK: Who is doing the Allemande?  If we make it with your neighbor the\ndance does progress, though!]\n\nEnjoy!\n\n\n\nJeff Kaufman:\nAt the end of the B2, who is the Allemande with?\n\nChatGPT:\nAt the end of the B2, the Allemande is with the neighbor on the left.\n[JK: in a contra context you'd just say \"neighbor\", but this is the\nright answer!]\n</pre>\n\n\n\n<h4>Conversation 4</h4>\n\n\n\n<pre>\nChatGPT:\nSure! Here's a simple contra dance that I came up with:\n\nContra Dance\nThe Spinning Wheel\nBy Assistant\n(Duple improper)\nA1\n(8) Dosido with partner\n[JK: later clarified this is 1x.  Awkward to do this all in the middle.]\n(8) Circle left 3/4\nA2\n(8) Partner swing\n(8) Balance and swing with neighbor\n[JK: this should take 16 beats, not 8.  It also seems to have everyone\nin the middle at once again.]\nB1\n(8) Circle right 3/4\n(8) Ladies chain\nB2\n(8) Star right\n[JK: later clarified this is 1x]\n(8) Partner gypsy and swing\n[JK: this should take 16 beats, not 8.  It also leaves the dancers\nunprogressed.]\n\nJeff Kaufman:\nIn the A1, how far around is the dosido?\n\nChatGPT:\nIn the A1 of this dance, the dosido is a full dosido, which means that\ndancers will start by facing their partner and then dosido around each\nother once, so that they end up back facing their partner again. This\nshould take up 8 counts of music, leaving the dancers in position to\ndo the circle left 3/4.\n\nJeff Kaufman:\nIn the B2, how far around is the star right?\n\nChatGPT:\nIn the B2 of this dance, the star right should be a full star, which\nmeans that dancers will start facing the center of the star and then\nwalk around each other once, so that they end up back facing the\ncenter again. This should take up 8 counts of music, leaving the\ndancers in position to do the partner gypsy and swing.\n\n\n\nJeff Kaufman:\nIt doesn't look to me like this dance progresses?  Can you fix it?\n\nChatGPT:\nIn this dance, the A1 and A2 are both actions that move the dancers\naround the dance floor, but they don't necessarily progress the\ndance. To make the dance progress, we could modify the A1 and A2 so\nthat they move the dancers down the hall, either by doing a \"down the\nhall\" action or by incorporating it into one of the existing\nactions. For example, we could modify the A1 to be:\n\nA1\n(8) Dosido with partner\n(8) Circle left 3/4, then down the hall\n[JK: there's no time for a down the hall here, and if there were it\nwouldn't fix the problem.  This isn't what 'progression' means in\ncontra, though it's a plausible guess.]\n\nThis would move the dancers down the hall after they do the circle\nleft 3/4, so that they are in position to do the A2.\n</pre>\n\n\n\n<h4>Conversation 5</h4>\n\n\n\n<pre>\nChatGPT:\nSure! Here's a contra dance that I came up with:\n\nContra Dance\nThe Quickstep Contra\nBy Assistant\n(Duple improper)\nA1\n(8) Circle left\n[JK: clarified this is 1x]\n(8) Do-si-do partner\n[JK: awk.  claridied this is 1x]\nA2\n(8) Ladies chain\n[JK: can't chanin from this position]\n(8) Gentlespoon\n[JK: this is an alternative role name and not a figure]\nB1\n(8) Long lines forward and back\n(8) California twirl\n[This takes 2-4 beats, not 8]\nB2\n(8) Right and left through\n(8) Partner swing\n\nI hope you enjoy dancing to this contra dance! Let me know if you have\nany questions or if you'd like me to make any changes.\n\n\n\n\nJeff Kaufman:\nIn the A2, how do you do a \"Gentlespoon\"?\n\nChatGPT:\nIn a contra dance, the gentlespoon is a move where the gentles (the\nmen in the dance) form a circle facing outward, with their left hand\non their neighbor's right shoulder. Then, the gentles take two steps\nclockwise around the circle and two steps back to their starting\nposition, all while holding onto their neighbor's shoulder. At the\nsame time, the ladies (the women in the dance) stand in the middle of\nthe circle and also take two steps clockwise and two steps back. The\ngentles and the ladies should end up back in their starting positions,\nfacing their original partners.\n\n\n\n\nJeff Kaufman:\nWhy do you have the California twirl in the B1 as taking eight beats?\n\nChatGPT:\nIn the contra dance that I composed, I wrote the California twirl as\ntaking eight beats because that is the most common way that this move\nis performed. However, it's important to note that the number of beats\nthat a move takes can vary depending on the dance and the caller (the\nperson who is leading the dance). Some callers may choose to have the\nCalifornia twirl take six beats, or even more or less than that. It's\nup to the caller to decide how long each move should take, based on\nthe music and the flow of the dance.\n\n\n\n\nJeff Kaufman:\nCould you modify the dance so the California twirl takes four beats?\n\nChatGPT:\nCertainly! Here's a modified version of the contra dance where the\nCalifornia twirl takes four beats:\n\nContra Dance\nThe Quickstep Contra\nBy Assistant\n(Duple improper)\nA1\n(8) Circle left\n(8) Do-si-do partner\nA2\n(8) Ladies chain\n(8) Gentlespoon\nB1\n(8) Long lines forward and back\n(4) California twirl\n(4) Star right\nB2\n(8) Right and left through\n(8) Partner swing\n\nIn this version of the dance, the California twirl is performed as a\nquick half turn with your partner, and then the dancers immediately do\na star right for the next four beats. This allows the California twirl\nto take up four beats of the dance instead of eight. I hope this works\nfor your needs! Let me know if you have any other questions or if\nyou'd like me to make any further changes to the dance.\n\n\n\n\nJeff Kaufman:\nIn the A1, how far around do you circle?\n\nChatGPT:\nIn the A1 of the contra dance that I composed, the dancers begin by\nforming a circle facing their neighbor to the left. They then take\neight beats to circle left around the circle, with each dancer moving\nto the left to make room for the next person in the circle. The\ndancers should end up back in their starting positions, facing their\noriginal neighbors.\n\n\n\nJeff Kaufman:\nIn the A1, is the dosido 1x or 1.5x?\n\nChatGPT:\nIn the A1 of the contra dance that I composed, the do-si-do is\nperformed as a single (also known as a \"one-time\") do-si-do. This\nmeans that the dancers will do the do-si-do once around, with the\ngentles moving in a clockwise direction and the ladies moving in a\ncounterclockwise direction. The dancers should end up back in their\nstarting positions, facing their original partners.\n</pre>\n\n\n\n<h4>Conversation 6</h4>\n\n\n\n<pre>\nChatGPT:\nSure, here is a contra dance I composed for you:\n\nContra Dance\nThe Never-Ending Waltz\nBy Assistant\n(Duple improper)\nA1\n(8) Circle left 3/4\n(8) Star right\nA2\n(8) Partner balance and swing\n[JK: this should go go end of phrase]\n(8) Gypsy with neighbor\n[JK: awkward having everyone in the middle at once]\nB1\n(8) Forward and back\n(8) Do-si-do partner\nB2\n(8) Right and left through\n(8) Swing partner\n[JK: doesn't progress]\n\nI hope you enjoy dancing this contra!\n\n\n\n\nJeff Kaufman:\nThis dance has a swing ending in the middle of the phrase; can you fix\nit?\n\nChatGPT:\nYes, of course! Here is a revised version of the contra dance:\n\nContra Dance\nThe Never-Ending Waltz\nBy Assistant\n(Duple improper)\nA1\n(8) Circle left 3/4\n(8) Star right\nA2\n(8) Partner balance and swing\n(8) Gypsy with neighbor\nB1\n(8) Forward and back\n(8) Do-si-do partner\nB2\n(8) Right and left through\n(8) Balance and swing partner\n\nIn this version, the swing occurs at the end of the phrase in B2,\nwhich is a more typical placement for a swing in a contra dance. I\nhope this works better for you! Let me know if you have any other\nquestions.\n\n\n\n\nJeff Kaufman:\nCan you fix the A2 swing as well?\n\nChatGPT:\nCertainly! Here is a revised version of the contra dance with the\nswing in A2 moved to the end of the phrase:\n\nContra Dance\nThe Never-Ending Waltz\nBy Assistant\n(Duple improper)\nA1\n(8) Circle left 3/4\n(8) Star right\nA2\n(8) Partner balance\n(8) Gypsy with neighbor, then swing neighbor\n[JK: balancing one person and going off with another is a very bold\nchoreographic decision...]\nB1\n(8) Forward and back\n(8) Do-si-do partner\nB2\n(8) Right and left through\n(8) Balance and swing partner\n\nIn this version, both swings occur at the end of the phrase, which is\na more typical placement for swings in contra dances. I hope this\nworks for you! Let me know if you have any other questions or if you\nwould like me to make any further changes to the dance.\n\n\n\n\nJeff Kaufman:\nWhat is progression in contra dance?\n\nChatGPT:\nIn contra dancing, progression refers to the way that dancers move\naround the dance floor during the course of the dance. Typically, in a\ncontra dance, the dancers will start out in parallel lines facing\ntheir partner. Then, through a series of movements, they will progress\ndown the line, switching partners and moving with the flow of the\ndance. This movement creates a sense of momentum and continuity in the\ndance, and it is an important part of the contra dance experience.</pre>\n\n  \n\n<p><i>Comment via: <a href=\"https://www.facebook.com/jefftk/posts/pfbid0VvRC6RG8hMdAAwS36Zc1ETcTFH4nXEg8Tjwu2p7ADBUgdZjCttSZ2yvnCXUahQnul\">facebook</a>, <a href=\"https://lesswrong.com/posts/RfPHdbnXNPkCCFhJg\">lesswrong</a>, <a href=\"https://mastodon.mit.edu/@jefftk/109453143190577104\">mastodon</a></i></p>", "link": "https://www.jefftk.com/p/can-gpt-3-write-contra-dances", "date_published": "2022-12-03 08:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]