[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Breath Of The Wild 2 Details May Have Leaked | GameSpot News", "description": "Details for The Legend of Zelda Breath of the Wild Sequel may have accidentally been revealed by voice actor, The Prince of Persia: The Sands of Time Remake is being moved to Ubisoft Montreal and PlayStation Plus subscribers can now claim the free games for May 2022. \n#GamingNews #BreathoftheWild #TLoZ #BOTW\n\nIn an interview with fan site Lega Hyrule (via Eurogamer), Ubaldi revealed that he had recorded new lines for Breath of the Wild 2, returning not only to the role of Daruk but also the Goron champion's ancestor. This has led fans to speculate that the ancestors of other Hyrulian champions--Revali, Mipha, and Urbosa--could potentially be encountered in Breath of the Wild 2\n\nUbisoft confirmed today that development has shifted from Ubisoft Pune and Ubisoft Mumbai to Ubisoft Montreal, the original creators of the Sands of Time series. Whether or not the remake is being rebooted or if Ubisoft Montreal will continue working on what was already done is unknown.\n\nRight now PlayStation Plus subscribers can grab this month's free games: Fifa 22, curse of the dead gods, and tribes of midgard. Over on Xbox and PC, Halo fans can jump into the new season of Infinite’s multiplayer called Lone Wolves.\n\nSTAMPS\n00:00 - Intro\n00:08 - Breath of the Wild 2\n01:05 - Prince of Persia\n01:54 - PS Plus, Halo Infinite, Sifu", "link": "https://www.youtube.com/watch?v=lGG6O6P4l78", "date_published": "2022-05-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Season 2 Launch Day Livestream", "description": "Jean-Luc hops into the second season of Halo Infinite's multiplayer to see what's new.", "link": "https://www.youtube.com/watch?v=w3X0dSDZv7g", "date_published": "2022-05-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Warcraft Arclight Rumble Announcement Cinematic Trailer", "description": "Check out the Warcraft Arclight Rumble Announce Cinematic trailer showcasing a brand new Warcraft Mobile game coming to iOS and Android. Open Beta is coming soon.\n\n#WarcraftArclightRumble #Warcraft", "link": "https://www.youtube.com/watch?v=glsjeCievng", "date_published": "2022-05-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Warcraft Arclight Rumble Hands-On Preview", "description": "Warcraft Arclight Rumble, the franchise's debut on mobile devices, is Blizzard's attempt to bring the Warcraft name back to those strategic roots. Here’s everything you need to know.\n\nWarcraft Arclight Rumble launches on iOS and Android, but as it stands right now Warcraft Arclight Rumble is off to a strong start.\n\nFor more on Warcraft Arclight Rumble, as well as the latest on what's happening with regard to the ongoing legal action at Activision Blizzard, head over to GameSpot.com.\n\n0:00 Introduction\n0:36 Gameplay Breakdown\n4:04 Missions\n5:47 Microtransactions\n6:48 Release Platforms and Outro\n\n#Warcraft #ArclightRumble", "link": "https://www.youtube.com/watch?v=q_-m3aOHgWA", "date_published": "2022-05-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Warcraft Arclight Rumble New Mobile Game Reveal Showcase", "description": "In Warcraft Arclight Rumble you will see coin-operated machines appearing in taverns throughout Warcraft's setting of Azeroth. Here patrons can use miniature figurines of creatures and heroes to battle against one another in a simplified real-time strategy game. Players will collect minis, create armies, and use them in both story battles against the AI and multiplayer matches against other players. Similarly to how Hearthstone uses the tavern as its setting, only exchanging cards for minis. \n\nOpen Beta is coming soon and the game will be coming to iOS and Android phones.\n\n#WarcraftArclightRumble", "link": "https://www.youtube.com/watch?v=FBmP80fVSqc", "date_published": "2022-05-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends: Saviors - Official Gameplay Trailer", "description": "See how new Legend Newcastle wields his shield, the monstrous changes to Storm Point and the reworked Ranked system, all coming in Apex Legends: Saviors!\n\n\n#ApexLegendsSaviors  #ApexSaviors #ApexLegends", "link": "https://www.youtube.com/watch?v=urI-BiKwZO8", "date_published": "2022-05-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Godrick the Grafted and Stormveil Castle - Elden Ring Lore", "description": "Godrick the Grafted, also known as Godrick the Golden, is the first major boss most players will find in Elden Ring. So, it's time to dig into the story and lore of Godrick. How much his golden linage from Godfrey the First Elden Lord affects his ego, and the seeming inferiority complex he develops compared to the likes of other great demigods like Marika, Radahn, Rykard, and Ranni. This is the tale and lore of Godrick the Grafted.\n\nLet’s discuss the first major boss of Elden Ring. A demigod and lord who despite his status, was laughed at behind his back, but would yearn for approval. Today, we’ll discuss Godrick the Grafted and Stormveil Castle.\n\n#EldenRing #GodrickLore", "link": "https://www.youtube.com/watch?v=kLvG2ySzwsI", "date_published": "2022-05-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Switch Sports Fans Are Smashing TVs Like It's 2006 | GameSpot News", "description": "Nintendo Switch Sports Is Leading To Smashed TVs, a modded toddler toy can play Elden Ring, and Square Enix Sells Tomb Raider, Deus Ex Studios And IP Rights To Embracer Group. \n#GamingNews #SwitchSports #EldenRing\n\nNintendo Switch Sports players are reporting broken televisions due to Joy-Cons flying out of sweaty hands. This is similar to how the many TV screens were shattered this same way in the 2000s as a result of Wii Sport players losing their grip on the WiiMote.\n\nTwitter user Rudeism has modded the Fisher-Price Laugh & Learn Game Controller to be a fully functional Xbox controller. Rudeism recently showed footage of the controller in action, using it to play Elden Ring on PC.\n\nEmbracer Group has announced that it has acquired Crystal Dynamics, Eidos-Montreal, Square Enix Montreal, and a catalog of IPs from Square Enix. The $300 million deal will see IPs such as Tomb Raider, Deus Ex, Thief, Legacy of Kain and more than 50 back-catalog games added to Embracer's portfolio.", "link": "https://www.youtube.com/watch?v=ZWLWwyjcrfU", "date_published": "2022-05-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]