[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Thee Sinseers: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nFelix Contreras | May 2, 2022\nTo appreciate the magic of a performance from Thee Sinseers, you have to understand the co-mingling of Chicano and African American communities in post-World War II, Southern California. Living in the same neighborhoods, these communities created a virtual symphony of R&B, mariachi and boleros. And what you hear in this California band's Tiny Desk (home) concert, as they perform among plants in a flower shop, builds on a legacy of music that became known as \"oldies but goodies\" in the Chicano community.\n\nRight from the start, band leader and vocalist Joey Quiñones and his crew dig deep with their original songs that pay homage to the oldies in a way that evokes my own memories of lowrider car shows and lazy Sunday afternoons at Roeding Park in Fresno, Calif. \"What's His Name\" features a delicate falsetto that was popular in 1950s R&B. The short horn parts and the doo-wop background vocals fall into a call and response backdrop for lyrics about a broken heart.\n\nThere is a very real connection in this set between the passionate vocals of the best R&B ballads and mariachi ranchera, both borrowing from the emotional devastation of Italian opera. That's all on display in \"Hold On,\" which makes us question how we have the power to keep on living. Particular attention has to be paid to vocalist Adriana Flores' delicate pleading on \"Lovin You,\" which crescendos into a blown out ballad powered by a tight, shouted chorus from the entire band.\n\nSET LIST\n\"What's His Name\"\n\"Hold On\"\n\"Lovin' You\"\n\"There Must Be Something\"\n\nMUSICIANS\nJoey Quiñones: vocals, keys\nAdriana Flores: vocals\nChristopher Manjarrez: bass\nFrancisco Flores: guitar \nBryan Ponce: guitar, vocals\nLuis Carpio: drums, vocals\nEric Johnson: saxophone\nJoseluis Jimenez: trombone \nSteve Surman: saxophone\n\nCREDITS\nDirector/Editor: Bryan Ponce\nCamera: Anthony Ramirez, Rosario Briseño\nRecording Engineer: Brian Gazo \nMixed by: Joey Quiñones\nLocation: Floreria Primavera \n\nTINY DESK TEAM\nProducer: Ana Sayre\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Joshua Bryant, Michael Zamora, Maia Stern, Ashley Pointer\nVP, NPR Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#NPRMusic #TinyDesk #TheeSinseers", "link": "https://www.youtube.com/watch?v=lsg1BCISPNU", "date_published": "2022-05-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]