[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Running Android apps on Linux: It's very close, but...", "description": "Download the State of Enterprise Linux Security Management Report here: https://tuxcare.org/ponemon_report\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\nYou can also protect your privacy by using this extension from Startpage, each install helps the channel with a small commission: https://add.startpage.com/en/protection/?campaign=4&source=aff \n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n00:00 Intro\n00:46 Sponsor: Get some free insight on the Security of Linux\n01:49 What is Waydroid, and how to install it?\n06:22 How to install applications\n08:50 Add Google Apps and Services\n11:25 Why run Android apps on Linux?\n13:55 Sponsor: Get a Linux laptop or desktop from Slimbook\n14:30 Support the channel\n\n\n💡 USEFUL LINKS FOR WAYDROID\nInstall instructions: https://docs.waydro.id/usage/install-on-desktops\nF-Droid website: https://f-droid.org/en/packages/\nAurora Store Website: https://auroraoss.com/\nScript to flash Gapps: https://pythonawesome.com/script-to-add-gapps-and-other-stuff-to-waydroid/\n\n\n\nRunning Android apps on another system than Android requires a container, like what Waydroid implements. Waydroid is based on LineageOS, based on Android 10, and can access any needed hardware. It can run Android apps on x86 or ARM cpus, it's fully open source, it can add your Android apps to your menu, it can display apps in their own windows or fullscreen, it can display the Android Ui for navigation, and has near native performance.\n\nWaydroid lets you install .APK applications, which you can download online relatively easily, but to begin with, you might want to get an app store, which will make this process a lot simpler. Let's go with F Droid, which has tons of open source applications for Android, that will also work on Waydroid.\n\nwaydroid app install and then the path to your APK file, and hit enter.\n\nYou'll then have to restart the system service for Waydroid, using \n\nsudo sysctemctl start waydroid-container\n\nYour app should now be added to your applications menu, and you can open it through there. From F-Droid, you can install any application you want, and they'll also get automatically added to your applications menu. Of course, at first install, you'll need to enable installing applications from an untrusted source, like on a \"real\" android device.\n\nYou can also add the Google Apps and the Play Services.\n\nI left a link to the install instructions, it's not an easy, one click install by any means, and you'll have to run multiple command lines, install a few packages on your distro, register your \"fake device\" with Google, clear the Play Store cache, install magisk and more. Once that's done, though, you do get a fully functional Android system, complete with Google apps, and the Google Play Store. You can login with your Google account, and use Waydroid as a full Android system.\n\nApp apps that require the Google Play Services will also work, including youtube, Google Maps, Gmail, and a lot more. You'll also be able to download apps you might already have purchased in the Play Store on an Android device, if you so choose.\n\nI couldn't find certain apps in the Play Store, though, like Netflix for example, which might be a country-related issue. Some apps would also crash at startup, like Amazon prime Video. \n\nXbox Game Pass worked, I could navigate the UI and launch a game with Xcloud, but after that, games would just not display anything, sticking to a black window, which I had to quit to resume using Waydroid. My banking app also failed with an error message telling me the service wasn't available.\n\nTwitter worked perfectly, Duolingo also did, although in Portrait mode.", "link": "https://www.youtube.com/watch?v=dV7zFHIWxBU", "date_published": "2022-05-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]