[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Joyce Wrice: Tiny Desk Concert", "description": "Ashley Pointer | October 18, 2022\nWarning: It’s hard to keep still when listening to the infectious music of effervescent R&B powerhouse Joyce Wrice. Side effects may include an intense head bop, the occasional stank face and a mean two-step. Wrice’s Tiny Desk concert is a stunning display of her talents, showing us where the San Diego bred, Los Angeles based singer has been and where she’s going next. Clad in all white and backed by a band wearing matching black Nike tracksuits and sneakers, they exude a vibe reminiscent of a family.\n\nThe concert commences with a sampling of her refreshing (and NPR favorite) 2021 debut album Overgrown, that established her as a major voice in contemporary R&B. Accompanied by a six-piece band of tasteful musicians, Wrice opens with a soulful live arrangement of “Chandler,” before smoothly transitioning into “Falling In Love.” That funky bassline you hear? Courtesy of the one and only Dernst “D'Mile” Emile II, who executive produced Overgrown and last graced the Tiny Desk for Lucky Daye’s concert in 2019.\n\nWe get a taste of Wrice’s new pop influenced EP Motive, which takes an energetic turn away from her more soulful debut. As she closes out the set with “Bittersweet Goodbyes,” and the Kaytranada produced “Iced Tea,” both written in collaboration with Mack Keane (who’s seen here holding it down on keys), we witness an assured artist motivated to make you move.\n\nSET LIST\n“Chandler”\n“Falling in Love”\n“Must Be Nice”\n“On One”\n“Bittersweet Goodbyes”\n“Iced Tea”\n\nMUSICIANS\nJoyce Wrice: vocals\nDernst “D’Mile” Emile II: bass\nBranden Akinyele: drums \nMack Keane: keys, vocals \nChristian Carey: guitar\nD'anna Stewart: vocals\nAstyn Turrentine: vocals\n\nTINY DESK TEAM\nProducer: Bobby Carter\nDirector: Kara Frame\nAudio Engineer: Josh Rogosin\nCreative Director: Bob Boilen\nEditor: Joshua Bryant\nVideographers: Kara Frame, Joshua Bryant, Michael Zamora\nAudio Assistant: Hannah Copeland\nProduction Assistants: Jill Britton, Alanté Serene\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#TinyDesk #NPRMusic #JoyceWrice", "link": "https://www.youtube.com/watch?v=4dd7WejIFi8", "date_published": "2022-10-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]