[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCG_nvdTLdijiAAuPKxtvBjA", "title": "Why Rings of Power Failed where House of the Dragon Worked | One v One", "description": "Sponsored by Ridge Wallet. Get 10% off and free international shipping with code FILMENTO: https://ridge.com/FILMENTO\n\nAmazon's Lord of the Rings: The Rings of Power is here to dethrone Game of Thrones: House of the Dragon as the new biggest show on TV. But did it? The seasons are still ongoing I guess, but based on the pilot episode, House of the Dragon comes on top.  Which is strange because both shows feature a lot of the fantasy elements. So in today's episode of One v One, let's compare these two shows with each other to see how the fantasy side of House of the Dragon is handled in such a way that it's much easier for casual audiences to get into the story... than compared to Rings of Power.\n\nFilmento en Español: \nhttps://youtu.be/ViDZUofaZd8\n\nSupport:     https://patreon.com/filmento\nFollow:        https://twitter.com/filmento\n\n#ringsofpower   #houseofthedragon  #onevone \n\nMusic:\n\n\n-\nThe Lord of the Rings: The Rings of Power (2022)\nPrime Video's The Lord of the Rings: The Rings of Power brings to screens for the very first time the heroic legends of the fabled Second Age of Middle-earth's history. This epic drama is set thousands of years before the events of J.R.R. Tolkien’s The Hobbit and The Lord of the Rings, and will take viewers back to an era in which great powers were forged, kingdoms rose to glory and fell to ruin, unlikely heroes were tested, hope hung by the finest of threads, and the greatest villain that ever flowed from Tolkien’s pen threatened to cover all the world in darkness. Beginning in a time of relative peace, the series follows an ensemble cast of characters, both familiar and new, as they confront the long-feared re-emergence rings of power vs house of the dragon rings of power bad show good show trash house of the dragon good show bad show trash rings of power watch free online free house of the dragon watch free online free shocking moments only action pilot episodes is house of  the dragon better than rings of power of evil to Middle-earth. From the darkest depths of the Misty Mountains, to the majestic forests of the elf-capital of Lindon, to the breathtaking island kingdom of Númenor, to the furthest reaches of the map, these kingdoms and characters will carve out legacies that live on long after they are gone.\n-\nGame of Thrones: House of the Dragon (2022)\nAn internal succession war within House Targaryen at the height of its power, 172 years before the birth of Daenerys Targaryen.  King Viserys I Targaryen,  Prince Daemon Targaryen,  Princess Rhaenyra Targaryen", "link": "https://www.youtube.com/watch?v=z1KkFu-5bKc", "date_published": "2022-10-17 18:35:56+00:00", "persistent": false, "user": null, "language": "en-US"}]