{"entries": [{"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-24/australia-zabojstwo-w-domu-opieki-nastolatek-mial-udusic-70-latke/", "title": "Australia. Zabójstwo w domu opieki. Nastolatek miał udusić 70-latkę", "date_published": "2022-12-24 21:24:00+00:00", "description": "Załoga domu opieki dla seniorów w australijskim Albany dokonała makabrycznego odkrycia. Znaleźli ciało 70-letniej pani Monicy. Policja ustaliła, że nie zmarła ona z naturalnych przyczyn. Mundurowi zatrzymali 19-letniego pracownika ośrodka. Podejrzewają, ze udusił seniorkę.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-24/pasterka-w-watykanie-papiez-franciszek-ilez-to-wojen-ofiarami-ludzkiej-zarlocznosci-sa-ci-slabi/", "title": "Pasterka w Watykanie. Papież Franciszek: Ileż to wojen! Ofiarami ludzkiej żarłoczności są ci słabi", "date_published": "2022-12-24 19:33:00+00:00", "description": "- Istnieje pewne ryzyko: wiemy bardzo wiele o Bożym Narodzeniu, ale zapominamy o jego znaczeniu - mówił papież Franciszek podczas watykańskiej pasterki. W jego ocenie także w te święta ludzkość nienasycona pieniędzmi, władzą i przyjemnościami, nie czyni miejsca, tak jak to było w przypadku Jezusa dla maluczkich, nienarodzonych, ubogich i zapomnianych.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-24/maxi-jazz-nie-zyje-wokalista-zespolu-faithless-mial-65-lat/", "title": "Maxi Jazz nie żyje. Wokalista zespołu Faithless miał 65 lat", "date_published": "2022-12-24 17:15:00+00:00", "description": "Nie żyje Maxi Jazz, wokalista grupy Faithless wykonującej muzykę techno i elektroniczną. Informację potwierdziła siostra zmarłego muzyka. Był człowiekiem, który zmienił nasze życie na wiele sposobów. Nadał właściwe znaczenie i przesłanie naszej muzyce - czytamy w oświadczeniu Faithless.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-24/paryz-zamieszki-po-demonstracji-kurdow-policja-uzyla-gazu-lzawiacego/", "title": "Paryż: Zamieszki po demonstracji Kurdów. Starcia z policją, mundurowi użyli gazu łzawiącego", "date_published": "2022-12-24 16:36:00+00:00", "description": "Po pokojowej demonstracji Kurdów, oddających hołd trzem ofiarom piątkowej strzelaniny w Paryżu, w stolicy Francji doszło do zamieszek oraz potyczek z policją. Funkcjonariusze - by rozgonić tłum - użyli gazu łzawiącego. Są straty w miejskiej infrastrukturze, podpalono także samochody.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-24/rosja-przywodca-bialorusi-alaksandr-lukaszenka-z-wizyta-w-centrum-szkolenia-kosmonautow/", "title": "Rosja: Przywódca Białorusi Alaksandr Łukaszenka z wizytą w Centrum Szkolenia Kosmonautów", "date_published": "2022-12-24 15:36:00+00:00", "description": "Białoruski dyktator Alaksandr Łukaszenka zjawił się w Rosji. W sobotę odwiedził podmoskiewskie centrum szkolenia kosmonautów. Przyglądał się testom białoruskich kandydatek do lotu i zabrał ze sobą chleb i smalec, które wręczył szefowi Roskosmosu Jurijowi Borysowowi. Łukaszenka weźmie także udział w spotkaniu szefów Wspólnoty Niepodległych Państw.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-24/ukraina-kazala-gwalcic-ukrainskie-kobiety-olga-bykowska-poszukiwana-przez-sbu/", "title": "Ukraina. Namawiała męża, by gwałcił Ukrainki. Olga Bykowska poszukiwana przez SBU", "date_published": "2022-12-24 14:03:00+00:00", "description": "Rosja wysłała jej męża na ukraiński front, a ona pozwoliła mu gwałcić ukraińskie kobiety - pod warunkiem, że będzie się zabezpieczał. Olga Bykowska poszukiwana jest teraz przez służby podległe rządowi w Kijowie. Grozi jej 12 lat pozbawienia wolności.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-24/ukraina-ostrzal-chersonia-co-najmniej-piec-osob-nie-zyje-a-20-jest-rannych/", "title": "Ukraina. Ostrzał Chersonia. Co najmniej osiem osób nie żyje, a 58 jest rannych", "date_published": "2022-12-24 11:47:00+00:00", "description": "Co najmniej osiem ofiar śmiertelnych i 35 rannych - to bilans ostrzału centrum Chersonia. O rosyjskim ataku poinformowały w sobotę władze Ukrainy. To terroryzm, to zabójstwo dla zastraszenia i dla przyjemności - napisał na Telegramie Wołodymyr Zełenski.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-24/waz-na-wolnosci-seryjny-zabojca-charles-sobhraj-przylecial-do-francji/", "title": "\"Wąż\" na wolności. Seryjny zabójca Charles Sobhraj przyleciał do Francji", "date_published": "2022-12-24 10:47:00+00:00", "description": "Seryjny zabójca, obywatel Francji Charles Sobhraj, przybył w sobotę do Paryża po prawie dwóch dekadach spędzonych w więzieniu w Katmandu. Sąd w Nepalu postanowił wypuścić go na wolność ze względu na jego podeszły wiek i poważną chorobę serca. Historia Sobhraja zainspirowała serial Netflixa pt. Wąż.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-24/ksiadz-waldemar-pawelec-dzieci-w-ukrainie-nie-czekaja-na-prezenty-ale-modla-sie-o-pokoj/", "title": "Ksiądz Waldemar Pawelec: Dzieci w Ukrainie nie czekają na prezenty, ale modlą się o pokój", "date_published": "2022-12-24 09:48:00+00:00", "description": "- Radość ze wspólnoty przy wigilijnym stole jest najważniejsza - powiedział w Polsat News ksiądz Waldemar Pawelec z Kijowa. - Bycie razem daje nam nadzieję na zakończenie wojny. Duchowny dodał, że ukraińskie dzieci nie czekają w tym roku na prezenty, ale pragną pokoju.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-24/aresztowano-kontrowersyjnego-biskupa-prowadzil-wystawny-tryb-zycia/", "title": "Aresztowano kontrowersyjnego biskupa. Prowadził wystawny tryb życia", "date_published": "2022-12-24 09:31:00+00:00", "description": "Pastor Lamor Miller-Whitehead z Brooklynu został aresztowany i oskarżony o próbę wymuszenia, oszustwo bankowe i składanie fałszywych zeznań. Duchowny od dawna wzbudza kontrowersje z powodu wystawnego trybu życia. W mediach społecznościowych często publikował zdjęcia drogich samochodów, ubrań i biżuterii. Kapłan nie przyznaje się do winy. Zapowiada złożenie pozwów na wysokie sumy odszkodowań.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-24/reportaz-piataewangelia-ziemia-swieta-wydarzenia-odwiedzily-miejsce-narodzin-jezusa/", "title": "Reportaż \"Piąta Ewangelia - Ziemia Święta\". \"Wydarzenia\" odwiedziły miejsce narodzin Jezusa", "date_published": "2022-12-24 08:30:00+00:00", "description": "Betlejem - miejsce narodzin Jezusa Chrystusa, najświętsze miasto na świecie, a zarazem ważny ośrodek władzy i kultury palestyńskiej. Żyje tam zaledwie procent chrześcijan. Wydarzenia były jedną z niewielu redakcji na świecie, które dostały zgodę na filmowanie Groty Narodzenia. Reportaż Piąta Ewangelia - Ziemia Święta Małgorzaty Ziętkiewicz dziś na antenie Polsat News o godz. 16:25.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-24/usa-zima-nie-odpuszcza-w-nowym-jorku-ogloszono-stan-wyjatkowy/", "title": "USA: Atak zimy. W Nowym Jorku ogłoszono stan wyjątkowy", "date_published": "2022-12-24 08:20:00+00:00", "description": "W amerykańskim stanie Nowy Jork ogłoszono stan wyjątkowy. Powodem są śnieżyce, które ograniczają widoczność do zera, oblodzone drogi, wichury oraz siarczysty mróz. Trudna sytuacja pogodowa ma utrzymywać się nad większością stanów. Władze apelują o pozostanie w domach.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-24/rosja-20-osob-zginelo-w-pozarze-domu-opieki-w-kemerowie-na-syberii/", "title": "Rosja. 20 osób zginęło w pożarze domu opieki w Kemerowie na Syberii", "date_published": "2022-12-24 07:30:00+00:00", "description": "Dwadzieścia osób zginęło w pożarze, który w piątek wybuchł w działającym nielegalnie domu spokojnej starości w rosyjskim mieście Kemerowo w zachodniej Syberii. Strażakom udało się ugasić pożar.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-24/byl-na-liscie-najbardziej-poszukiwanych-fbi-zatrzymali-go-hiszpanie/", "title": "Był na liście najbardziej poszukiwanych FBI. Zatrzymali go w Hiszpanii", "date_published": "2022-12-24 06:55:00+00:00", "description": "Funkcjonariusze hiszpańskiej policji (Policia Nacional) zatrzymali jednego z dziesięciu najbardziej poszukiwanych przez FBI przestępców na świecie. Do zatrzymania doszło w jednym z madryckich hoteli. Nowozelandczyk został skazany w USA na dożywocie za przestępstwa seksualne.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-24/francja-sprawca-ataku-w-paryzu-okreslil-sie-jako-rasista-byl-znany-sluzbom/", "title": "Francja. Sprawca ataku w Paryżu określił się jako \"rasista\". Był znany służbom", "date_published": "2022-12-24 05:15:00+00:00", "description": "Sprawca piątkowego ataku w centrum Paryża, w którym zginęły trzy osoby, był znany policji - przekazały media. Na tym etapie śledztwa służby ustaliły, że ma on co najmniej dwie sprawy karne, w tym atak na obóz dla migrantów. Na miejscu strzelaniny doszło do starć protestujących z policją.", "persistent": false, "language": "pl-PL"}], "source": {"url": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Polsat News"}}