{"entries": [{"source": "https://www.engadget.com/rss.xml", "link": "https://www.engadget.com/twitter-restores-suicde-prevention-feature-after-briefly-removing-t-200716547.html?src=rss", "title": "Twitter restores suicide-prevention feature after briefly removing it", "date_published": "2022-12-24 20:07:16+00:00", "description": "<p>Twitter says it’s working on bringing back the #ThereIsHelp banner, a feature that pointed users to suicide prevention hotlines and other safety resources when searching for certain content. On Friday, <a href=\"https://www.reuters.com/technology/elon-musk-orders-removal-twitter-suicide-prevention-feature-sources-say-2022-12-23/\">Reuters</a> reported that the company had removed the safety tool earlier in the week on orders from Elon Musk.</p><p>After the outlet published its story, Ella Irwin, Twitter’s head of trust and safety, confirmed the removal but said it was temporary. “We have been fixing and revamping our prompts. They were just temporarily removed while we do that,” she <a href=\"https://www.reuters.com/technology/twitter-restores-suicide-prevention-feature-after-reuters-report-2022-12-24/\">told Reuters</a>. “We expect to have them back up next week.”</p><span id=\"end-legacy-contents\"></span><p>On Saturday morning, Musk denied Twitter had ever removed the feature. “The message is actually still up. This is fake news,” Musk <a href=\"https://twitter.com/elonmusk/status/1606627557021212672?s=20&amp;t=y0QXbgvktIvfGBIUAzhDcg\">wrote on Twitter</a>, adding, “Twitter doesn’t prevent suicide.” When Engadget tired searching for terms like “suicide” and “COVID-19” on Saturday afternoon, the banner did not appear.</p><div id=\"ee36027449ac448e8bb4b90fb7a95dbe\"><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">1. The message is actually still up. This is fake news.<br /><br />2. Twitter doesn’t prevent suicide.</p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1606627557021212672?ref_src=twsrc%5Etfw\">December 24, 2022</a></blockquote></div><p>Moving forward, Irwin told <em>Reuters </em>Twitter plans to adopt an approach used by Google. She said the company “does really well with these in their search results and [we] are actually mirroring some of their approach with the changes we are making.”</p><p>The disappearance of the #ThereIsHelp banner, even if it was only momentary, led to criticism of Twitter from some consumer safety advocates. Eirliani Abdul Rahman, a <a href=\"https://twitter.com/eirliani/status/1600956598729715712?s=20&amp;t=IezJwHAj2bFDJfY3osKYRw\">former member</a> of the company’s <a href=\"https://www.engadget.com/twitter-dissolves-its-trust-and-safety-council-064143124.html\">recently dissolved Trust and Safety council</a>, told Reuters she found the event “extremely disconcerting and profoundly disturbing.” Rahman also pointed out companies typically work on safety features “in parallel,” leaving existing ones in place before replacing them.</p><p><em>In the US, you can reach the </em><a href=\"https://suicidepreventionlifeline.org/\"><em>National Suicide Prevention Lifeline</em></a><em> by dialing 988 or 800-273-8255.</em></p>", "persistent": false, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "link": "https://www.engadget.com/apple-pulls-ios-16-2-homekit-architecture-170237031.html?src=rss", "title": "Apple pulls new iOS 16.2 HomeKit architecture after users report Home app issues", "date_published": "2022-12-24 17:02:37+00:00", "description": "<p>Apple has stopped rolling out an optional Home app upgrade after users began reporting issues with the software. \"We temporarily removed the option to upgrade to the new Home architecture,\" the company says on a&nbsp;<a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3N1cHBvcnQuYXBwbGUuY29tL2VuLXVzL0hUMjEzNDgxIiwiY29udGVudFV1aWQiOiJiNzA4YzM1Yi0xYTAwLTQ0ZTItYjExYS04YjI0MDY4ODliOWYifQ&amp;signature=AQAAAYIKACJb9hcWoBYd8ChRJ9xrNNW8hour_eD2jlm10ohU&amp;gcReferrer=https%3A%2F%2Fsupport.apple.com%2Fen-us%2FHT213481\">support page spotted</a>&nbsp;by&nbsp;<a href=\"https://www.macrumors.com/2022/12/21/apple-pulls-new-home-architecture/\"><em>MacRumors</em></a><em>. \"</em>The option to upgrade will return soon. If you already upgraded, you are unaffected by this change.\"</p><p>Released as a part of&nbsp;<a href=\"https://www.engadget.com/apple-ios-16-2-available-180625523.html\">iOS 16.2</a>&nbsp;and&nbsp;<a href=\"https://www.engadget.com/apple-macos-venture-ipados-16-ios-161-updates-170844000.html\">macOS Ventura 13.1</a>&nbsp;on December 13th, the recalled update was an upgrade to HomeKit's underlying architecture. Apple said the rewrite would make the platform \"more reliable and efficient.\" However, some of those who installed the software quickly encountered issues, including select Siri terms not working correctly and their smart home devices not showing up within the Home app.&nbsp;<em>MacRumors&nbsp;</em>was one of the first publications to spot that Apple had removed the option to install the upgrade. The company later confirmed the move after <em>The Verge</em> contacted it.</p><span id=\"end-legacy-contents\"></span><p>\"We are aware of an issue that may impact the ability for users to share the Home within the Home app. A fix will be available soon,\" an Apple spokesperson told the outlet<em>. \"</em>In the meantime, we've temporarily removed the option to upgrade to the new Home architecture. Users who have already upgraded will not be impacted.\" If you've already installed the new architecture, you'll need to wait for Apple to release a fix for the software; there's no option to revert to the older framework.</p>", "persistent": false, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "link": "https://www.engadget.com/amd-radeon-7900-xtx-xt-review-better-4k-gaming-140002305.html?src=rss", "title": "Radeon RX 7900 XTX and XT review: AMD’s ‘reasonable’ stab at 4K gaming", "date_published": "2022-12-24 14:00:02+00:00", "description": "<p>Once again, AMD is ready to take on NVIDIA's latest video cards with powerful alternatives at a lower price. And once again, AMD still lags behind when it comes to ray tracing. That's pretty much the story behind the Radeon RX 7900 XT and 7900 XTX, two confusingly-named GPUs meant to be the pinnacle of AMD's new RDNA 3 graphics architecture. At $899 and $999, respectively, these cards are certainly easier to stomach than <a href=\"https://www.engadget.com/nvidia-rtx-4080-review-more-practical-4k-gaming-titan-140009349.html\">NVIDIA's $1,199 RTX 4080 </a>and the monstrously expensive <a href=\"https://www.engadget.com/nvidia-rtx-4090-review-gpu-unholy-amounts-power-130020430.html\">$1,599 RTX 4090</a> (both of which actually sell for far more at most stores).</p><p>For the most part, AMD’s new cards deliver solid 4K gaming performance, especially with the help of the company’s FidelityFX Super Resolution (FSR) upscaling technology. It's just a shame that you'll have to live with slower ray tracing performance than the competition. (On the bright side, they offer a major ray tracing upgrade over AMD's last batch of Radeon GPUs.)</p><span id=\"end-legacy-contents\"></span><p>So what makes these cards so special? They're the first GPU's built on a chiplet-based design, similar to AMD's latest CPUs. That should allow AMD to tweak its designs easily down the line, making it simpler to scale RDNA 3 down to laptops and lower-end GPUs. The 7900 XTX and XT feature a 5nm compute die and a 6nm memory die connected by a 5.3 TB/s interconnect. Together, that means they can reach up to 61 teraflops of computing power and utilize up to 24GB of GDDR6 RAM.</p><p>AMD also claims it beefed up ray tracing performance by 50 percent per compute unit, compared to its previous RDNA 2 architecture. Its video engine has been upgraded with support for AV1 encoding and decoding at up to 8K/60fps. That format isn't widely adopted yet, but it aims to deliver better video compression for 4K and 8K footage compared to existing codecs like H.264.</p><figure><img alt=\"AMD Radeon RX 7900 XT\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/35061370-8301-11ed-ba65-90de32282eec\" /><figcaption></figcaption><div class=\"photo-credit\">Devindra Hardawar/Engadget</div></figure><p>True to their names, the Radeon RX 7900 XTX and XT aren't very different. The top-end XTX sports 96 compute units, the same amount of ray accelerators and clock speeds between 2.3Ghz and 2.5GHz. The XT, meanwhile, offers 84 compute and ray tracing units and clocks between 2GHz and 2.4GHz. The higher end card comes equipped with 24GB of GDDR6 RAM, compared to 20GB on the XT. (Notably, they both offer more memory than the 16GB RTX 4080.)&nbsp;</p><p>Given their similarities though, it's unclear why anyone would opt to save $100 for the 7900 XT. If you're willing to spend close to $1,000 on a video card, you might as well go full-tilt and grab as much memory and power as you can. It would have been nice to see something slightly cheaper from AMD, even if it meant delivering a card that's a bit slower than the 7900 XT.</p><p>The reference GPUs we're reviewing look and feel like premium components, as we've come to expect from AMD's flagship cards. Most importantly, though, they only take up two slots on your motherboard, whereas the enormous RTX 4080 and 4090 take up three. The 7900 XT and XTX also rely on two 8-pin power connections, so you won't need to string any new PSU cables or cram in a dongle like with NVIDIA's cards. The 7900 XTX requires an 850-watt power supply, thanks to its starting power draw of 355W, while the XT model can work with a 750W PSU. Both cards hovered around 66C under load, which was right between what we saw on the RTX 4080 and 4090.</p><section><img alt=\"AMD Radeon RX 7900 XT\" class=\"e2ehero-url\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/351ca8b0-8301-11ed-8f9d-ea5672db3d0d\" /></section><p>While I was eager to see how these new GPUs compared to NVIDIAs, I had to go through several rounds of driver and motherboard BIOS updates on my Ryzen 9 7900X before both cards were stable enough to actually use. That's something I occasionally run into when testing cutting-edge hardware (NVIDIA's cards also required a BIOS update), but there were still issues with AMD's cards even after that. <em>Halo Infinite</em>, for example, refused to launch matches with either card. Sometimes my PC would completely shut down while testing <em>Cyberpunk 2077</em>, which required me to unplug my desktop and reset my BIOS before Windows would boot again.</p><p>I've been benching AMD and NVIDIA video cards on this PC, equipped with a premium Corsair 1000W PSU, for the past several months without any stability issues. So it was a surprise to see just how much havoc these GPUs could wreak. I haven't seen other reviews complaining of similar issues, so I'll chalk up my experience to early drivers. AMD <a href=\"https://www.tomshardware.com/news/amd-adrenalin-edition-22122-driver-slashes-rx-7900-xtx-power-consumption\">just released a new driver</a> that resolves an issue of high power draw during video encoding, so I'm hoping the company is also trying to address the bugs I'm seeing.</p><table><tbody><tr><td><p>None</p></td><td><p>3DMark TimeSpy Extreme</p></td><td><p>Port Royal (Ray Tracing)</p></td><td><p>Cyberpunk</p></td><td><p>Blender</p></td></tr><tr><td><p>AMD Radeon RX 7900 XTX</p></td><td><p>12,969</p></td><td><p>14,696/68fps</p></td><td><p>4K FSR RT: 57fps</p></td><td><p>2,899</p></td></tr><tr><td><p>AMD Radeon RX 7900 XT</p></td><td><p>11,688</p></td><td><p>13,247/61fps</p></td><td><p>4K FSRT RT: 50fps</p></td><td><p>3,516</p></td></tr><tr><td><p>NVIDIA RTX 4080</p></td><td><p>12,879</p></td><td><p>17,780/82fps</p></td><td><p>4K DLSS RT: 74fps</p></td><td><p>9,310</p></td></tr><tr><td><p>NVIDIA RTX 4090</p></td><td><p>16,464</p></td><td><p>25,405/117.62 fps</p></td><td><p>4K DLSS RT: 135fps</p></td><td><p>12,335</p></td></tr><tr><td><p>AMD Radeon RX 6800 XT</p></td><td><p>7,713</p></td><td><p>9,104/42.15fps</p></td><td><p>N/A</p></td><td><p>N/A</p></td></tr></tbody></table><p></p><p>When the cards ran smoothly, they proved to be fairly competitive with the RTX 4080. The 7900 XTX was on-par with the 4080 when it came to 3DMark's TimeSpy Extreme benchmark and Geekbench 5's Compute test. The 7900 XT scored 1,000 points lower on TimeSpy Extreme, which was 3,000 points higher than last year's RTX 3080 Ti, but it was bested by that NVIDIA card when it came to Geekbench. <em>Hitman 3</em> also ran blazingly fast on both cards in 4K, reaching 165fps and 180fps when I flipped on FSR upscaling. Much like NVIDIA's cards, there's little reason to run any game in 4K without the help of advanced upscaling tech.</p><p>The performance gulf between AMD and NVIDIA appeared once I started dabbling with ray tracing. The 7900 XTX and XT scored well below the RTX 4080 in the 3DMark Port Royal benchmark (at least they managed to beat the 3080 Ti). I also only saw around 57fps in <em>Cyberpunk 2077 </em>on the Radeon 7900 XTX while playing in 4K with full ray tracing <em>and </em>AMD's FidelityFX Super Resolution technology. Without FSR, that frame rate dipped to an unplayable 25fps. The slower 7900 XT only managed to hit 50fps in 4K with FSR and ray tracing enabled.</p><figure><img alt=\"AMD Radeon RX 7900 XTX (front) and XT (rear)\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/35146b50-8301-11ed-9fc7-ad3746a145b3\" /><figcaption></figcaption><div class=\"photo-credit\">Devindra Hardawar/Engadget</div></figure><p>Basically, if you're eager to get a video card that reaches well above 60fps in 4K <em>with</em> ray tracing, you'll have to look elsewhere. But if you can live with 1,440p, you'll find more to like: The 7900 XTX reached 130fps in <em>Cyberpunk </em>with ray tracing, FSR and graphics settings maxed, while the 7900 XT hit 114fps. That's almost enough to max out a 120Hz gaming monitor! Personally, I still find 4K gaming to be overrated — 1,440p still looks great, and you may never notice the benefits of pushing more pixels. But I’ll admit that I've been spoiled by NVIDIA's DLSS3 upscaling technology, which allowed me to hit 74fps in <em>Cyberpunk </em>while playing in 4K with ray tracing. That's as close to gaming heaven as I've ever been.</p><p>But there's one thing you'll find with these AMD GPUs that you won't with NVIDIA's: Reasonable street prices. Even after their launch, you can still snag the 7900XT and XTX close to retail. Many RTX 4080 models, meanwhile, are inching towards $1,500 at online retailers (assuming you can find them in stock at all). Spending close to $1,000 on a video card is still hard to stomach, but at least it makes more sense than going all the way to $1,500.</p><p>The Radeon RX 7900 XTX and XT are a solid step forward for AMD, especially when it comes to 4K gaming. But I'm hoping the company can get its driver situation in order, and perhaps eke out better ray tracing performance in the process. Most gamers are still better off waiting for AMD and NVIDIA's next-gen mid-range cards, which are sure to be launching soon. But if you're an avowed AMD fan, you've finally got the high-end upgrade you've been waiting for.</p>", "persistent": false, "language": "en-US"}], "source": {"url": "https://www.engadget.com/rss.xml", "title": "Engadget"}}