[{"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Blizzard, Bluster, And Bombs: Christmas Eve At The Siege Of Bastogne, 1944", "description": "American service members have often spent their holidays away from loved ones — and in harm&#8217;s way — and the men who found themselves in the besieged Belgian city of Bastogne just before Christmas of 1944 were no exception. Bastogne, which sits just a few miles from the border of Luxembourg, had been under German ...", "link": "https://www.dailywire.com/news/blizzard-bluster-and-bombs-christmas-eve-at-the-siege-of-bastogne-1944", "date_published": "2022-12-24 18:25:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Fiancée Of Texas Basketball Coach Changes Story: He Didn’t Strangle Me, He Acted In Self-Defense", "description": "The fiancée of University of Texas head men&#8217;s basketball coach Chris Beard said Friday that he did not strangle her and she did not want him arrested, a stark turn around from the story that emerged early this month. Beard, 49, was arrested on December 12 after the Austin Police Department reportedly responded to a “disturbance ...", "link": "https://www.dailywire.com/news/fiancee-of-texas-basketball-coach-changes-story-he-didnt-strangle-me-he-acted-in-self-defense", "date_published": "2022-12-24 17:58:04+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "TikTok Personality Gets Sued After Accusing Professor Of Murdering 4 Students At University Of Idaho", "description": "A University of Idaho history professor is suing a TikTok personality for claiming that she was behind the murder of four students at the school. The so-called &#8220;cyber-sleuth&#8221; Ashley Guillard accused professor Rebecca Scofield of the crimes. Guillard claims that she &#8220;solves crimes online&#8221; by using psychic readings. Guillard claims that Scofield was having a ...", "link": "https://www.dailywire.com/news/tiktok-personality-gets-sued-after-accusing-professor-of-murdering-4-students-at-university-of-idaho", "date_published": "2022-12-24 17:44:43+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Top Political Strategist: America Has Been Governed By ‘Boomers’ For Decades, It’s Time For Younger Faces", "description": "Top Republican strategist Karl Rove, now a Fox News contributor, said during a segment this week that the U.S. has been governed by the &#8220;boomer&#8221; generation for nearly 32 years, and that now is the time for fresh leadership on both sides of the aisle. Rove made the remarks when asked about his Wall Street ...", "link": "https://www.dailywire.com/news/top-political-strategist-america-has-been-governed-by-boomers-for-decades-its-time-for-younger-faces", "date_published": "2022-12-24 17:16:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Texas City Reveals Unique Driving Safety Campaign: ‘I Saw Mommy Killing Santa Claus’", "description": "A city in Texas has unveiled a series of Christmas themed messages this week to promote safe driving during the holiday season. The messages, from the city of Austin, feature Santa Claus and Frosty the Snowman meeting untimely ends due to texting and driving, or drinking and driving. “I saw mommy killing Santa Claus. He ...", "link": "https://www.dailywire.com/news/texas-city-reveals-unique-driving-safety-campaign-i-saw-mommy-killing-santa-claus", "date_published": "2022-12-24 17:13:07+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "China Expert: Communist China Using TikTok To Promote Drug Use, Violence In America In Attempt To Ruin Country", "description": "Gordon Chang, a senior fellow at the Gatestone Institute and author of &#8220;The Great U.S. China Tech War,&#8221; said during an interview this week that communist China is using TikTok to promote social disruption in the U.S. in an attempt to weaken America&#8217;s system of government. Chang initially responded to comments from Fox News host ...", "link": "https://www.dailywire.com/news/china-expert-communist-china-using-tiktok-to-promote-drug-use-violence-in-america-in-attempt-to-ruin-country", "date_published": "2022-12-24 17:03:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "WATCH: Dr. Ben Carson Explains Where ‘Wokeness’ Came From", "description": "Dr. Ben Carson, a neurosurgeon and former Trump administration official, told Fox News in an interview this week that wokeness came from political correctness that started back in the 1990s. Carson made the remarks during an interview on &#8220;Hannity&#8221; with guest host Tammy Bruce. &#8220;You know, I talked, the first time I spoke at the ...", "link": "https://www.dailywire.com/news/watch-dr-ben-carson-explains-where-wokeness-came-from", "date_published": "2022-12-24 16:41:49+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Joe Rogan’s Podcast Shows Horrifying Slave Conditions Used To Mine Materials Needed For Electric Cars", "description": "Podcast giant Joe Rogan used his show this week to shine a light on some of the horrifying slave conditions that are used to mine the raw materials used to make electric car batteries and batteries for other devices like cell phones and laptops. Rogan brought on activist Siddharth Kara to talk about what happens ...", "link": "https://www.dailywire.com/news/joe-rogans-podcast-shows-horrifying-slave-conditions-used-to-mine-materials-needed-for-electric-cars", "date_published": "2022-12-24 16:37:37+00:00", "persistent": true, "user": "rumpel", "language": "en-US", "tags": ["slave labour", "electric vehicles", "climate drama", "climate change"]}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Sweden’s New Pediatric Treatment Guidelines Ditch ‘Gender-Affirming’ Medication For Psychotherapy", "description": "Sweden published new treatment guidelines that abandon the model of care that &#8220;affirms&#8221; a child&#8217;s chosen transgender identity with medication. The Swedish National Board of Health and Welfare (NBHW) published new treatment guidelines for youth with gender dysphoria last week that explicitly instruct medical providers that psychosocial support should be the first line of treatment. ...", "link": "https://www.dailywire.com/news/swedens-new-pediatric-treatment-guidelines-ditch-gender-affirming-medication-for-psychotherapy", "date_published": "2022-12-24 16:15:52+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Judge Rules Against Kari Lake In Election Lawsuit", "description": "A judge in Arizona dismissed a lawsuit brought by Kari Lake, a Republican endorsed by former President Donald Trump, seeking to overturn her defeat in the state governor&#8217;s race. After a trial last week in Phoenix, Superior Court Judge Peter Thompson ruled on Saturday that the suit&#8217;s two remaining claims lacked &#8220;clear and convincing&#8221; evidence ...", "link": "https://www.dailywire.com/news/judge-rules-against-kari-lake-in-election-lawsuit", "date_published": "2022-12-24 15:45:36+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Couple With The Same Birthday Welcomes Newborn Baby On The Same Day", "description": "An Alabama couple who share the same birthday will have room enough for three after they welcomed a baby girl on the same day. Cassidy and Dylan Scott were both born on December 18, two years apart. Last week, Cassidy gave birth to the couple&#8217;s firstborn daughter, Lennon Kate, at 12:30 A.M. on December 18. ...", "link": "https://www.dailywire.com/news/couple-with-the-same-birthday-welcomes-newborn-baby-on-the-same-day", "date_published": "2022-12-24 15:40:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Twitter Was In Contact With Multiple Gov Agencies; Ex-FBI Lawyer Surprised By FBI’s Actions; Feds Sought Action On Foreign Narratives On Ukraine, COVID", "description": "Journalist Matt Taibbi released a new installment of &#8220;The Twitter Files&#8221; Saturday afternoon that showed that the FBI was not the only government agency that was in regular contact with Twitter about content on the platform. Taibbi said that the State Department, Department of Defense, and Central Intelligence Agency were also involved in contacting the ...", "link": "https://www.dailywire.com/news/twitter-was-in-contact-with-multiple-gov-agencies-ex-fbi-lawyer-surprised-by-fbis-actions-feds-sought-action-on-foreign-narratives-on-ukraine-covid", "date_published": "2022-12-24 15:36:57+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Santa Watchers Panic As NORAD’s ‘Santa Tracker’ Crashes Early Christmas Eve Morning", "description": "Holiday watchers were thrown into a panic Saturday morning as the famous NORAD &#8220;Santa Tracker&#8221; website crashed. The Daily Mail reported that the site was down at around 6:21 a.m. EST Saturday morning, and was down for less than 90 minutes. The brief outage sent social media users into a frenzy as they were unable ...", "link": "https://www.dailywire.com/news/santa-watchers-panic-as-norads-santa-tracker-crashes-early-christmas-eve-morning", "date_published": "2022-12-24 14:19:06+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "U.S. Military Bases Incurred Millions In Damages After Hosting Afghan Evacuees During Biden’s Withdrawal, Report Finds", "description": "U.S. military bases that hosted Afghan evacuees during the Biden administration’s withdrawal from Afghanistan incurred almost $260 million in damages, according to the Department of Defense’s inspector general.  The damages, which made some of the facilities not usable for American soldiers, came as the U.S. airlifted 120,000 individuals from Afghanistan in 17 days. Defense Department ...", "link": "https://www.dailywire.com/news/u-s-military-bases-incurred-millions-in-damages-after-hosting-afghan-evacuees-during-bidens-withdrawal-report-finds", "date_published": "2022-12-24 13:59:39+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Happy Shwanza’: Pelosi Draws Social Media Mockery After Flubbing African American Holiday", "description": "Outgoing House Speaker Nancy Pelosi drew social media mockery Friday after wishing a “happy shwanza,” presumably to those who celebrate Kwanzaa, in her remarks following passage of the omnibus spending bill. In what Pelosi said would likely be her last speech as speaker, she botched the name of the holiday, established in 1966 and celebrated ...", "link": "https://www.dailywire.com/news/happy-shwanza-pelosi-draws-social-media-mockery-after-flubbing-african-american-holiday", "date_published": "2022-12-24 13:20:04+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Alleged Child Pornographer On FBI’s ‘Ten Most Wanted List’ Nabbed In Spain", "description": "Authorities in Spain arrested an alleged pornography website owner who was on the FBI&#8217;s &#8220;Ten Most Wanted Fugitives&#8221; list last week, the bureau said Friday. Michael James Pratt, 40, faces a 19-count indictment, including counts of sex trafficking, production of child pornography, sex trafficking of a minor, and conspiracy to launder monetary instruments, in connection ...", "link": "https://www.dailywire.com/news/alleged-child-pornographer-on-fbis-ten-most-wanted-list-nabbed-in-spain", "date_published": "2022-12-24 12:42:18+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘We Must Beat Democrats At Their Own Game,’ RNC Chair Hopeful Harmeet Dhillon Tells Ben Shapiro", "description": "The Republican National Committee needs new leadership to beat the Democrats at their finely tuned ballot-gathering mastery, would-be party chair Harmeet Dhillon told The Daily Wire’s Ben Shapiro. Speaking on Shapiro’s popular podcast and radio show Friday, the conservative attorney said she is challenging RNC Chairwoman Ronna McDaniel in order to inject new life into ...", "link": "https://www.dailywire.com/news/we-must-beat-democrats-at-their-own-game-rnc-chair-hopeful-harmeet-dhillon-tells-ben-shapiro", "date_published": "2022-12-24 11:39:08+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "New York City Mayor Eric Adams Skips Town Ahead Of Winter Blast", "description": "Democratic New York City Mayor Eric Adams skipped town as the Big Apple braced for severe wintry weather, according to his office, leaving the Democrat open to criticism. City officials told reporters Adams took a couple of days off, noting he left town Thursday and would return Saturday. They would not divulge where the mayor ...", "link": "https://www.dailywire.com/news/new-york-city-mayor-eric-adams-skips-town-ahead-of-winter-blast", "date_published": "2022-12-24 10:43:38+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Whoopi Goldberg Doubles Down On Holocaust ‘Race’ Claim That Got Her Suspended", "description": "“The View” star Whoopi Goldberg doubled down on her history-challenged claim that the Holocaust had nothing to do with race in a new interview, despite the fact the same claim got her suspended from the ABC show back in February. The 67-year-old actress, whose second act has been as an $8 million-per-year politics and culture ...", "link": "https://www.dailywire.com/news/whoopi-goldberg-doubles-down-on-holocaust-race-claim-that-got-her-suspended", "date_published": "2022-12-24 10:25:03+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Taxpayer-Funded Tennessee Performing Arts Center Hosted ‘All Ages’ Drag Christmas Show As Republicans Propose Banning Similar Events", "description": "A performing arts center in part funded by Tennessee taxpayers hosted an “all ages” drag show last month as Republicans in the Volunteer State propose protecting children from “sexually explicit” performances.  Over the Thanksgiving weekend, the James K. Polk Theatre, a part of the Tennessee Performing Arts Center (TPAC), hosted a presentation of “A Drag ...", "link": "https://www.dailywire.com/news/taxpayer-funded-tennessee-performing-arts-center-hosted-all-ages-drag-christmas-show-as-republicans-propose-banning-similar-events", "date_published": "2022-12-24 09:40:22+00:00", "persistent": false, "user": null, "language": "en-US"}]