{"entries": [{"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/twoje-pieniadze/praca/co-miesiac-biore-tydzien-urlopu-aby-podrozowac-po-swiecie-nie-mowie-o-tym-szefowi/ekn6tjc", "title": "Co miesiąc biorę tydzień \"urlopu\", aby podróżować po świecie. Nie mówię o tym szefowi", "date_published": "2022-12-24 14:28:00+00:00", "description": "Mam pewien sekret. Od maja 2021 r. co miesiąc biorę urlop na co najmniej tydzień, nie mówiąc o tym mojemu pracodawcy. Zabieram ze sobą laptopa, znajduję neutralne tło i łączę się z dowolnego miejsca — Islandii, Portugalii czy Kolumbii.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/bogatych-chrzescijan-ubywa-swiat-zapelniaja-biedni-muzulmanie-religijna-mapa-swiata/dqvljxg", "title": "Bogatych chrześcijan ubywa, świat zapełniają biedni muzułmanie. Religijna mapa świata", "date_published": "2022-12-24 13:55:20+00:00", "description": "Liczba chrześcijan na świecie zmalała w ostatnich dwóch latach o prawie 40 mln – wynika z naszych szacunków na podstawie dostępnych publicznie baz danych. Najbardziej w Meksyku i USA. To nie tylko efekt pandemii, ale i odejść od wiary, zwykle w kierunku ateizmu. Dużo wolniej malała liczba muzułmanów. Ci są najbiedniejszą obecnie częścią mieszkańców Ziemi i rozwijają się wolniej niż cały świat.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wideo/jak-produkowane-sa-lampki-choinkowe-kiedy-jedna-sie-przepali-pozostale-beda-dzialac/gre1ll9", "title": "Jak produkowane są lampki choinkowe? Kiedy jedna się przepali, pozostałe będą działać", "date_published": "2022-12-24 13:25:00+00:00", "description": "Lampki choinkowe bywają łączone szeregowo lub równolegle. Druga metoda sprawia, że przy awarii jednej z lampek nie zgaśnie nagle cały sznur.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/rozwoj-osobisty/rownowaga/sprawdzamy-swoje-telefony-co-najmniej-34-razy-dziennie/9767k48", "title": "Naród dopaminowy, czyli jak odnaleźć równowagę w świecie wiecznych przyjemności", "date_published": "2022-12-24 13:03:00+00:00", "description": "Ludzie są zaprogramowani w taki sposób, aby dostarczać sobie przyjemności i unikać bólu. To instynkt, który sięga milionów lat wstecz, do czasów, kiedy musieliśmy codziennie szukać pożywienia i schronienia, by przetrwać. Dziś jednak zapewnienie i zaspokojenie podstawowych potrzeb jest często łatwe w realizacji. To znacznie zmienia sytuację i sprawia, że pojawiają się nowe wyzwania.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/lifestyle/efektywny-altruizm-czyli-pomaganie-wedlug-doliny-krzemowej/jlle6m6", "title": "Pomaganie według Doliny Krzemowej, czyli czym jest efektywny altruizm", "date_published": "2022-12-24 12:36:04+00:00", "description": "Głośny upadek giełdy kryptowalut FTX ma swoje reperkusje nie tylko w świecie finansów. Zawalenie się imperium Sama Bankmana-Frieda kładzie się cieniem na ruchu społecznym, który współtworzył i hojnie finansował. Efektywny altruizm, bo o nim mowa, jest ideą czyniącą z pomagania racjonalne przedsięwzięcie biznesowe. Wywodzący się ze środowisk akademickich ruch zyskał ogromną popularność wśród miliarderów z Doliny Krzemowej, ale swoich zwolenników ma na całym świecie, w tym także w Polsce.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/skala-zakazen-covid-19-w-chinach-moze-byc-ogromna-ujawnili-wyliczenia/l0zyxb3", "title": "Skala zakażeń COVID-19 w Chinach może być ogromna. Ujawnili wyliczenia", "date_published": "2022-12-24 12:16:54+00:00", "description": "Szacuje się, że już 250 mln osób w Chinach mogło zakazić się COVID-19 w ciągu ostatnich 20 dni. Liczby przedstawione na zamkniętym spotkaniu stanowią wyraźny kontrast z niską oficjalną liczbą przypadków.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/finanse/licznik-wciaz-bije-tyle-pieniedzy-tracimy-z-powodu-sporu-z-unia-europejska/4xnktwp", "title": "Licznik wciąż bije. Tyle pieniędzy tracimy z powodu sporu z Unią Europejską", "date_published": "2022-12-24 11:46:38+00:00", "description": "Konflikt polskich władz z organami Unii Europejskiej powoduje, że ten rok zamknie się wielkimi karami nałożonymi przez luksemburski Trybunał Sprawiedliwości. Każdy miesiąc kontynuowania sporu z Brukselą kosztuje nas około 140 mln zł. Podobny spór dotyczący kopalni węgla brunatnego w Turowie obciążył nas kwotą ponad 300 mln zł.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/twoje-pieniadze/masz-ksiazeczke-mieszkaniowa-warto-sie-pospieszyc-z-rejestracja/gvmgf2w", "title": "Nawet kilkadziesiąt tysięcy złotych premii na mieszkanie w 2023 r. Zostało kilka dni", "date_published": "2022-12-24 11:21:42+00:00", "description": "Masz książeczkę mieszkaniową? Jeśli chcesz skorzystać ze zgromadzonych tam pieniędzy w 2023 r., musisz zarejestrować ją jeszcze przed końcem tego roku. Zniszczyła się lub zgubiła? Można uzyskać duplikat takiego dokumentu.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/swieta-w-ciezarowce-gigantyczna-kolejka-do-granicy/9hkcgce", "title": "Tysiąc tirów w kolejce do granicy.  Wielu nie zdąży przed świętami", "date_published": "2022-12-24 10:52:57+00:00", "description": "W Wigilię o poranku w kolejce do przejścia granicznego w Bobrownikach stało blisko tysiąc ciężarówek, które stworzyły kolejkę o długości ponad 25 km. Wielu kierowców święta spędzi w kabinie.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/nie-daj-sie-nabrac-na-tani-pensjonat-sa-pierwsi-poszkodowani/6kfbcpz", "title": "Policja ostrzega przed oszustwami na \"wirtualne pensjonaty\". Są pierwsi poszkodowani", "date_published": "2022-12-24 10:32:01+00:00", "description": "Świąteczne rozprężenie próbują wykorzystywać oszuści. Policja zwraca uwagę na problem \"wirtualnych pensjonatów\". Już zgłaszają się pierwsi oszukani. Podejrzenie powinno wzbudzić: znakomita lokalizacja, wysoki standard i niska cena.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/lifestyle/grzaniec-ratowal-slabe-wino-i-mial-leczyc-przeziebienie-cenil-go-polski-zielarz/dwpbef3", "title": "Ratował słabe wino, miał leczyć przeziębienie. Tego o grzańcu mogliście nie wiedzieć", "date_published": "2022-12-24 10:18:05+00:00", "description": "Grzaniec nie zawsze był sposobem na ogrzanie się w mroźne zimowe wieczory. Grecy ratowali w ten sposób nieudane wino. W Polsce w XVI w. pewien zielarz polecał go dla zdrowotności. Prawdziwy renesans grzane wino przeżyło jednak pod koniec XIX w. i trwa z nami do dziś.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/przezyli-katastrofe-w-fukushimie-decyduja-sie-na-powrot-do-atomu/new4e7z", "title": "Japonia przeprasza się z atomem. Ogłasza plan ożywienia elektrowni warty wielkie pieniądze", "date_published": "2022-12-24 09:44:55+00:00", "description": "Kolejny kraj w odpowiedzi na kryzys energetyczny dokonuje zwrotu w polityce dotyczącej elektrowni atomowych. Japonia zatwierdziła plan, który zakłada inwestycje w energię jądrową przekraczające bilion dolarów. Od czasu tragedii w Fukushimie w 2011 r. atom miał być systematycznie wygaszany.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/prawo/podatki/opodatkowanie-umow-zlecania-w-2023-r-jak-odliczyc-kwote-wolna-od-podatku/x8eefy6", "title": "Ważne zmiany dla zleceniobiorców. Sprawdź, czy nie stracisz w 2023 r.", "date_published": "2022-12-24 09:08:13+00:00", "description": "Od początku 2023 r. wzrośnie minimalna stawka godzinowa dla zleceniobiorców. Zaczną też obowiązywać zmiany w PIT, które spowodują zmianę sposobu rozliczeń podatku przez osoby na umowach cywilnoprawnych, a więc umowie zlecenia i o dzieło. Osoby takie będą mogły wybrać, kiedy chcą zapłacić podatek, ale nie ile go zapłacą.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/prawo/politycy-nie-odpuszczaja-nawet-przed-swietami-poszlo-o-wybory/9md0pn2", "title": "W polityce gorąca atmosfera do samych świąt. Poszło o wybory", "date_published": "2022-12-24 08:40:09+00:00", "description": "Tuż przed świętami posłowie partii rządzącej zaproponowali zmiany w Kodeksie wyborczym. Stało się to polem konfliktu. Opozycja krytycznie odnosi się do projektu.  Padają zarzuty o manipulacje. Pomysłodawcy bronią się i mówią o \"proobywatelskim\" rozwiązaniu.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/twoje-pieniadze/narzekasz-na-ceny-nasi-sasiedzi-tu-szukaja-oszczednosci/edp85d7", "title": "Na tanie zakupy do Polski. Doradca czeskiego premiera mówi, ile można oszczędzić", "date_published": "2022-12-24 08:16:15+00:00", "description": "Czesi znaleźli sposób na tańsze zakupy na święta. — Polecam wyjazd na zakupy do Polski, gdzie niektóre produkty spożywcze można kupić za połowę ceny — powiedział doradca czeskiego premiera. Dzieje się tak m.in. za sprawą obowiązującej w Polsce zerowej stawki VAT. Czescy politycy nie rozważają podobnego rozwiązania.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wideo/jak-powstaje-sztuczna-choinka-poziom-skomplikowania-moze-zdziwic/j39wxb2", "title": "Jak powstaje sztuczna choinka? Poziom skomplikowania może zdziwić", "date_published": "2022-12-24 07:53:00+00:00", "description": "Choć naturalne choinki uważane są za bardziej ekologiczne, to ich wzrost wymaga czasu. Tymczasem sztuczne drzewko \"rośnie\" jeden dzień.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/ryszard-krauze-historia-upadku-miliardera-od-zus-u-do-kazachstanu-sylwetka/hxdm017", "title": "Dorobił się handlując z państwem, stracił fortunę na ropie. Nie stać go było na bankructwo. Jak upadał Ryszard Krauze?", "date_published": "2022-12-24 07:34:00+00:00", "description": "Państwowe kontrakty przez lata powiększały fortunę Ryszarda Krauzego. Jednak biznesmen nie radził sobie w prywatnych przedsięwzięciach. Paliwem, które miało rozbudować jego imperium, a w ostateczności je spaliło, okazała się kazachstańska ropa.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/czy-w-warszawskim-hong-kongu-da-sie-w-ogole-mieszkac-pojechalem-sprawdzic/gmmc64n", "title": "Czy w \"warszawskim Hong Kongu\" da się w ogóle mieszkać? Pojechałem sprawdzić", "date_published": "2022-12-24 07:18:00+00:00", "description": "Dla wielu warszawskie osiedle Bliska Wola to przykład \"patodeweloperki\", \"betonozy\" czy po prostu złej architektury. Ale czy mieszkańcy gigantycznego osiedla naprawdę narzekają? Czy ja sam mógłbym zamieszkać w \"mrówkowym\" osiedlu, przywołującym skojarzenia z azjatyckimi metropoliami? Pojechałem sprawdzić.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/twoje-pieniadze/benzyna-najdrozsza-w-unii-diesel-drugi-najdrozszy-orlen-wykorzystuje-sytuacje/hjhc7nt", "title": "Benzyna najdroższa w Unii, diesel drugi najdroższy. Orlen wykorzystuje sytuację", "date_published": "2022-12-24 07:10:00+00:00", "description": "Jeśli nie uwzględniać podatków nałożonych na paliwa samochodowe, to litr zarówno niemieckiej benzyny, jak i diesla jest już o około 70 gr tańszy od paliw sprzedawanych w Polsce. Orlen względnie niską ceną na stacjach może się chwalić już tylko dzięki niższemu polskiemu opodatkowaniu, a w rzeczywistości słono za paliwa przepłacamy. Nie licząc podatków, płacimy najwięcej w Unii Europejskiej za benzynę, a za olej napędowy taniej tylko od Szwedów.", "persistent": false, "language": "en-US"}], "source": {"url": "https://businessinsider.com.pl/.feed", "title": "Business insider"}}