[{"source": "https://www.theguardian.com/international/rss", "title": "‘Another night together’: Pelé ‘fights with faith’ in hospital as family gather", "description": "<ul><li>Son of Brazilian icon arrives at São Paulo hospital on Saturday</li><li>Legendary 82-year-old has ‘kidney and cardiac dysfunctions’</li></ul><p>Family members of the Brazilian football great Pelé are gathering at the Albert Einstein hospital in São Paulo where the 82-year-old global icon has been since the end of November.</p><p>Doctors said this week that Pelé’s cancer had advanced, adding that the three-times World Cup winner was under “elevated care” related to “kidney and cardiac dysfunctions”. No hospital statements have been published since.</p> <a href=\"https://www.theguardian.com/football/2022/dec/24/another-night-together-pele-fights-with-faith-in-hospital-as-family-gather\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/24/another-night-together-pele-fights-with-faith-in-hospital-as-family-gather", "date_published": "2022-12-24 20:04:15+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Kari Lake: Arizona judge throws out challenge to defeat in governor race", "description": "<p>Trump supporter has refused to concede to Democrat Katie Hobbs but Maricopa judge says no evidence of misconduct</p><p>A judge on Saturday threw out Republican Kari Lake’s challenge of her defeat in the Arizona governor’s race to the Democrat Katie Hobbs, rejecting her claim that problems with ballot printers at some polling places on election day were the result of intentional misconduct.</p><p>The Maricopa county superior court judge, Peter Thompson, who was appointed by then-Republican governor Jan Brewer, said the court did not find clear and convincing evidence of the widespread misconduct Lake alleged affected the result of the 2022 election. Lake will appeal, she said.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/24/kari-lake-arizona-judge-throws-out-challenge-defeat-governor-race-katie-hobbs\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/24/kari-lake-arizona-judge-throws-out-challenge-defeat-governor-race-katie-hobbs", "date_published": "2022-12-24 20:00:51+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Kurdish rapper wins appeal against death sentence in Iran", "description": "<p>Saman Yasin had denied charges of attempting to kill security forces</p><p>Iran’s supreme court has accepted an <a href=\"https://www.theguardian.com/global-development/2022/nov/11/rapper-who-protested-over-death-of-mahsa-amini-faces-execution-in-iran\">appeal by rapper Saman Yasin against his death sentence</a> even as it confirmed the same sentence against another protester.</p><p>Yasin, a well-known and acclaimed Kurdish artist and rapper, has been a vocal critic of the Iranian regime amid the current unrest. He wrote messages of support for protesters on his social media channels and has written several protest songs.</p> <a href=\"https://www.theguardian.com/world/2022/dec/24/kurdish-rapper-wins-appeal-against-death-sentence-in-iran\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/24/kurdish-rapper-wins-appeal-against-death-sentence-in-iran", "date_published": "2022-12-24 19:58:21+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Twitter restores suicide prevention feature", "description": "<p>Move follows criticism of Elon Musk after #ThereIsHelp feature disappeared from searches</p><p>Twitter has restored a feature that promoted suicide prevention hotlines and support groups after its CEO Elon Musk was criticised over their removal.<br /></p><p>The feature, known as #ThereIsHelp, placed a banner at the top of search results for certain topics and listed contacts for organisations in numerous countries related to mental health, HIV, vaccines, child sexual exploitation, Covid-19, gender-based violence, natural disasters and freedom of expression.<br /></p> <a href=\"https://www.theguardian.com/technology/2022/dec/24/twitter-restores-suicide-prevention-feature\">Continue reading...</a>", "link": "https://www.theguardian.com/technology/2022/dec/24/twitter-restores-suicide-prevention-feature", "date_published": "2022-12-24 19:30:54+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Taliban stop women from working for aid organisations", "description": "<p>Female employees of NGOs told to stop coming to work in latest move to curtail women’s freedoms in Afghanistan</p><p>Afghanistan’s Taliban-run administration has ordered all local and foreign non-governmental organisations (NGOs) to stop female employees from coming to work, according to a letter from the economy ministry.</p><p>The letter, the contents of which were confirmed by economy ministry spokesperson Abdulrahman Habib, said female employees of NGOs were not allowed to work until further notice.</p> <a href=\"https://www.theguardian.com/world/2022/dec/24/taliban-stop-women-from-working-for-aid-organisations\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/24/taliban-stop-women-from-working-for-aid-organisations", "date_published": "2022-12-24 18:04:37+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Sussexes dismiss Sun apology for Clarkson column as ‘PR stunt’", "description": "<p>Paper’s apology followed piece in which columnist said he ‘hated’ Meghan</p><p>A spokeswoman for the Duke and Duchess of Sussex has said an apology by the Sun over a column in which Jeremy Clarkson said he “hated” Meghan is “nothing more than a PR stunt”.</p><p>The Sun apologised for the column, in which he said he “hated” the Duchess of Sussex, on Friday.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/24/sussexes-dismiss-sun-apology-for-clarkson-column-as-pr-stunt\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/dec/24/sussexes-dismiss-sun-apology-for-clarkson-column-as-pr-stunt", "date_published": "2022-12-24 17:45:44+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Premier League and its players enter unknown territory after World Cup | Jonathan Wilson", "description": "<p>Usually there’s a month off for players to reset but this time it’s just days for those coming off Qatar’s highs and lows</p><p>It is late at night when the four hobbits arrive at the Brandywine Bridge. They are shocked to find it barred and they have to plead with the Shirriffs to let them in. The Shire has changed since they went away, trees chopped down, old buildings swept aside, the inns closed. Sandyman’s Mill has been replaced by an ugly new building, full of noisy machinery that pollutes the air and the river. This is not the homecoming they have dreamed of.</p><p>Merry blows the horn given him by Éowyn of Rohan and they raise the Shire then scour it but, still, there is a sense of anticlimax. After everything they have been through on Mount Doom, there is an unavoidable bathos about such mundane concerns and, after a time, Frodo, still grappling with the physical and psychological consequences of his quest, departs, granted passage to the blessed realms of Valinor.</p> <a href=\"https://www.theguardian.com/football/blog/2022/dec/24/premier-league-and-its-players-enter-unknown-territory-after-world-cup\">Continue reading...</a>", "link": "https://www.theguardian.com/football/blog/2022/dec/24/premier-league-and-its-players-enter-unknown-territory-after-world-cup", "date_published": "2022-12-24 17:30:02+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "El Paso: confusion in Texas border town as migrant numbers rise", "description": "<p>Delays and processing problems mean turmoil for arrivals from South and Central America seeking a better life in the US</p><p>After walking around downtown for hours, two young Colombian men stood across from the El Paso Chihuahuas baseball team’s stadium, looking for a shelter that immigration officials had mentioned.</p><p>A security guard who didn’t speak Spanish grasped their need and pointed towards the convention center.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/24/el-paso-us-mexico-border-migrants-crisis\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/24/el-paso-us-mexico-border-migrants-crisis", "date_published": "2022-12-24 16:41:21+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Maxi Jazz, lead singer of Faithless, dies aged 65", "description": "<p>Dance group announces death of singer, saying he was ‘a lovely human being with time for everyone’</p><p>Maxi Jazz, the lead singer of the dance group Faithless, has died aged 65.</p><p>In a Facebook post on Saturday, the group wrote: “We are heartbroken to say Maxi Jazz died last night. He was a man who changed our lives in so many ways.</p> <a href=\"https://www.theguardian.com/music/2022/dec/24/maxi-jazz-lead-singer-of-faithless-dies-aged-65\">Continue reading...</a>", "link": "https://www.theguardian.com/music/2022/dec/24/maxi-jazz-lead-singer-of-faithless-dies-aged-65", "date_published": "2022-12-24 16:39:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "World Cup final referee responds to French criticism with phone photo", "description": "<ul><li>Media in France say Messi goal should have been disallowed</li><li>Szymon Marciniak: ‘The French didn’t mention this photo’</li></ul><p>The World Cup final ended nearly a week ago but the drama around it continued as the match referee showed a photo on his phone during a news conference to respond to claims that Lionel Messi’s extra-time goal should not have stood.</p><p>Argentina <a href=\"https://www.theguardian.com/football/2022/dec/18/world-cup-final-argentina-france-match-report\">won the final</a> in Qatar 4-2 on penalties after the match ended 3-3, with Messi scoring twice and Kylian Mbappé bagging a hat-trick for France.</p> <a href=\"https://www.theguardian.com/football/2022/dec/24/world-cup-final-referee-responds-to-french-criticism-with-phone-photo\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/24/world-cup-final-referee-responds-to-french-criticism-with-phone-photo", "date_published": "2022-12-24 15:56:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘Can I go back to my regular job?’: US sports reporter’s weather dispatch goes viral", "description": "<p>Mark Woodley was sent by Iowa TV station to report on the bitterly cold conditions – and he did not like it that much</p><p>As a huge winter storm battered the US, a short-staffed TV station in Waterloo, Iowa dispatched a sports reporter to describe the scene outside.</p><p>Footage of Mark Woodley’s increasingly stressed <a href=\"https://twitter.com/MarkWoodleyTV/status/1605961457337712640\">video reports</a> for KWWL, from a bitterly cold and snow-covered highway, duly went viral, registering 27m views by Saturday.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/24/iowa-sports-reporter-weather-dispatch-mark-woodley\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/24/iowa-sports-reporter-weather-dispatch-mark-woodley", "date_published": "2022-12-24 15:22:21+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Alex Ovechkin scores twice to pass Gordie Howe on NHL’s all-time goals list", "description": "<ul><li>Capitals star moves to second in NHL goals with 802</li><li>Ovechkin, 37, remains 93 goals behind Wayne Gretzky</li></ul><p>Alex Ovechkin barely looked at the empty net when he shot the puck into it and set off a wild celebration with his teammates and among Washington Capitals fans.</p><p>With a no-look empty-net goal, Ovechkin made more history and moved another step closer to breaking one of hockey’s most hallowed records.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/24/alexander-ovechkin-goals-record-gordie-howe-wayne-gretzky\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/dec/24/alexander-ovechkin-goals-record-gordie-howe-wayne-gretzky", "date_published": "2022-12-24 15:11:51+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Twitter restores suicide-prevention hotline feature after outcry", "description": "<p>Top official confirms feature was removed but only temporarily, following Reuters report that prompted criticism of Elon Musk</p><p>Twitter has restored a feature that promoted suicide prevention hotlines and other safety resources to users looking up certain content, after coming under pressure from users and consumer safety groups.</p><p>The feature, known as #ThereIsHelp, placed a banner at the top of search results for certain topics, listing contacts for support organizations in many countries related to mental health, HIV, vaccines, child sexual exploitation, Covid-19, gender-based violence, natural disasters and freedom of expression.</p><p><em>In the US, the <a href=\"https://suicidepreventionlifeline.org/\">National Suicide Prevention Lifeline</a> is at 800-273-8255 and <a href=\"https://suicidepreventionlifeline.org/chat/\">online chat is also available</a>. You can also text HOME to 741741 to connect with a crisis text line counselor. In the UK and Ireland, <a href=\"https://www.samaritans.org/\">Samaritans</a> can be contacted on 116 123 or email <a href=\"mailto:jo@samaritans.org\">jo@samaritans.org</a> or <a href=\"mailto:jo@samaritans.ie\">jo@samaritans.ie</a>. In Australia, the crisis support service <a href=\"https://www.lifeline.org.au/\">Lifeline</a> is 13 11 14. Other international helplines can be found at <a href=\"http://www.befrienders.org/\">www.befrienders.org</a></em></p> <a href=\"https://www.theguardian.com/technology/2022/dec/24/elon-musk-twitter-feature-removal-reports\">Continue reading...</a>", "link": "https://www.theguardian.com/technology/2022/dec/24/elon-musk-twitter-feature-removal-reports", "date_published": "2022-12-24 15:09:52+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Garnacho’s talent will shine through as he matures at Manchester United", "description": "<p>The 18-year-old may have had his professionalism brought into question but there is no doubting his ability on the pitch</p><p>Playing is all that matters to Alejandro Garnacho and when he does not, that is when frustration kicks in. No one who has seen him on the pitch could ever doubt his ability but the Argentinian has faced public criticism over his attitude this season.</p><p>Last month Manchester United’s head coach, Erik ten Hag, issued a warning, shortly after his teammate Bruno Fernandes looked back to the summer trip to Thailand and Australia and said: “On the tour he didn’t have the best attitude that he should have had,” arguing that was behind his lack of opportunities early in the season. Garnacho turned up late to two meetings and was offered only one friendly appearance over the summer as a result.</p> <a href=\"https://www.theguardian.com/football/2022/dec/24/alejandro-garnacho-talent-will-shine-through-as-he-matures-at-manchester-united\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/24/alejandro-garnacho-talent-will-shine-through-as-he-matures-at-manchester-united", "date_published": "2022-12-24 15:00:35+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Young boy dies after incident at Center Parcs in Wiltshire", "description": "<p>Police say death of four-year-old at Center Parcs Longleat Forest not being treated as suspicious</p><p>A four-year-old boy has died after an incident at Center Parcs Longleat Forest, near Warminster, Wiltshire police said.</p><p>The force said: “Sadly, it’s been confirmed that a four-year-old boy has died following an incident at Center Parcs Longleat Forest near Warminster shortly after 11am this morning (24/12). This is not being treated as suspicious. Our thoughts are with the boy’s family at this difficult time.”</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/24/child-in-serious-medical-incident-at-wiltshire-center-parcs\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/dec/24/child-in-serious-medical-incident-at-wiltshire-center-parcs", "date_published": "2022-12-24 14:45:15+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Paris police use teargas on protesters decrying Kurdish centre killings", "description": "<p>Hundreds rally after three people allegedly shot by man awaiting trial for refugee camp attack</p><p>Protesters have clashed with police as they call for justice over the killing of three people in a Kurdish neighbourhood in Paris.</p><p>Several hundred representatives of France’s Kurdish community gathered at Republic Square on Saturday to demand answers over the killings, which they say have left the community afraid.</p> <a href=\"https://www.theguardian.com/world/2022/dec/24/paris-police-use-teargas-on-protesters-decrying-kurdish-centre-killings\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/24/paris-police-use-teargas-on-protesters-decrying-kurdish-centre-killings", "date_published": "2022-12-24 14:13:39+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Is Elon Musk going to turn into the same sort of joke that Trump has become? | Arwa Mahdawi", "description": "<p>Musk’s cult-like fans haven’t entirely lost faith in their leader yet, but it’s getting a lot harder for him to keep up his image</p><p>I hate it when I have to do this but here goes: I was wrong. I was very, very wrong. Back in October, when Elon Musk’s $44bn acquisition of Twitter was finalized, I <a href=\"https://www.theguardian.com/commentisfree/2022/oct/29/how-bad-will-elon-musks-twitter-takeover-be-my-guess-is-hell-get-bored-of-it\">predicted</a> that the social network would become a lot nastier but ultimately keep chugging along. I assumed Musk had a couple of brain cells and a little self-restraint; I assumed he wasn’t going to <a href=\"https://www.mediamatters.org/elon-musk/less-month-elon-musk-has-driven-away-half-twitters-top-100-advertisers\">drive away Twitter’s advertisers</a> by making erratic business decisions; I assumed he was going to be at least somewhat sensible. After all, he did have $44bn on the line.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/24/is-elon-musk-going-to-turn-into-the-same-sort-of-joke-that-trump-has-become\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/dec/24/is-elon-musk-going-to-turn-into-the-same-sort-of-joke-that-trump-has-become", "date_published": "2022-12-24 14:00:35+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Worried about that family Christmas? Here’s how you can avoid the rows | Susanna Abse", "description": "<p>It’s always a busy time of year for couples therapists like myself, but there are ways to protect your relationship from the stress</p><p>A few weeks ago, I received my first Christmas card from a carpet-cleaning company I sometimes use. A garish green and red, I opened it to read: May the Joy of Family Light Up Your Christmas,<em> </em>followed by the suggestion that I might like to “freshen” up my carpets for the coming seasonal guests.</p><p>This card, which was selling the idea that family is the <em>true</em> spirit of Christmas and the source of all happiness has, of course, some truth in it. But it’s no great secret that the festive season can also place big demands on our most intimate relationships.</p><p>Susanna Abse is a couples psychotherapist and author of <a href=\"https://guardianbookshop.com/tell-me-the-truth-about-love-9781529107333\">Tell Me the Truth About Love</a></p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/24/christmas-relationships-family-rows\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/dec/24/christmas-relationships-family-rows", "date_published": "2022-12-24 14:00:35+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Republican senator called Giuliani ‘walking malpractice’, January 6 report says", "description": "<p>Mike Lee of Utah made comment in text message to Trump aide on evening after the Capitol attack</p><p>A senator who received a voice message meant for another Republican on <a href=\"https://www.theguardian.com/us-news/2022/dec/24/january-6-report-review-845-pages-crimes-trump\">January 6</a> described the caller, Rudy Giuliani, as “walking malpractice”.</p><p>The piquant characterisation of the former New York mayor, then Donald Trump’s attorney and a leading proponent of his election fraud lie, was made in a text message sent by Mike Lee of Utah.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/24/rudy-giuliani-walking-malpractice-january-6-report-republican-senator-mike-lee\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/24/rudy-giuliani-walking-malpractice-january-6-report-republican-senator-mike-lee", "date_published": "2022-12-24 13:04:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "What links Whitney Houston to Raiders of the Lost Ark – and Stanley Tucci’s recipes?", "description": "<p>From a biopic of the singer to the adventures of the whip-cracking archaeologist, all via a galaxy far, far away</p><p>The untimely death of Whitney Houston in 2012, aged just 48, prompted several attempts to reconcile her supreme singing talent and 80s/90s mega-fame with her sad decline. Nick Broomfield’s well-received 2017 documentary <a href=\"https://www.theguardian.com/film/2017/jun/15/whitney-houston-whitney-can-i-be-me-review-nick-broomfield-documentary\" title=\"\">Whitney: Can I Be Me</a> was followed by the succinctly titled <a href=\"https://www.theguardian.com/film/2018/jul/08/whitney-review-documentary-houston-kevin-macdonald\" title=\"\">Whitney</a>, Kevin Macdonald’s authorised documentary. Now comes the inevitable biopic, I Wanna Dance With Somebody, with English actor Naomi Ackie playing the lead.</p> <a href=\"https://www.theguardian.com/culture/2022/dec/24/down-the-rabbit-hole-whitney-houston\">Continue reading...</a>", "link": "https://www.theguardian.com/culture/2022/dec/24/down-the-rabbit-hole-whitney-houston", "date_published": "2022-12-24 13:00:35+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘In real life, you don’t touch the trigger until you plan on squeezing’: what actual spies think of TV thrillers", "description": "<p>Too much sex and gunfights, far too little paperwork … espionage shows aren’t exactly a masterclass in realism. Ex-agents reveal what they get right and wrong</p><p>Spies are everywhere – especially on TV. Thanks to streaming services such as Netflix and Apple TV+, these are boom times for fans of espionage thrillers. But it’s not only fans who are tuning in: viewers also include actual undercover agents whose roles range from collecting intelligence to recruiting spies for a living. And sometimes what they see onscreen leaves them cringing. </p><p>Key figures in a new tranche of espionage shows range from losers and lawyers to real-life spooks. In Apple TV+’s <a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/09/slow-horses-season-2-review-apple-tv-gary-oldman-kristin-scott-thomas\">Slow Horses</a>, the secret agents are sad-sack screwups banished to MI5’s administrative purgatory. In the ITVX drama <a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/08/a-spy-among-friends-review-dont-take-your-eyes-off-this-star-packed-espionage-thriller\">A Spy Among Friends</a>, the intelligence officers are Cambridge-educated liars in crisp tailored suits. And in Prime Video’s <a href=\"https://www.theguardian.com/tv-and-radio/2018/aug/25/jack-ryan-amazon-prime\">Jack Ryan</a>, the CIA officials include paunchy lifers and Jason Bourne clones.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/24/tv-thrillers-real-spies-slow-horses-a-spy-among-friends\">Continue reading...</a>", "link": "https://www.theguardian.com/tv-and-radio/2022/dec/24/tv-thrillers-real-spies-slow-horses-a-spy-among-friends", "date_published": "2022-12-24 13:00:35+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "A year since fleeing Kabul: ‘Now my children can grow up in peace’", "description": "<p>The withdrawal of allied troops from Afghanistan a year ago led to desperate scenes as refugees tried to escape the Taliban. One man tells his family’s story</p> <a href=\"https://www.theguardian.com/australia-news/2022/dec/25/a-year-since-fleeing-kabul-now-my-children-can-grow-up-in-peace\">Continue reading...</a>", "link": "https://www.theguardian.com/australia-news/2022/dec/25/a-year-since-fleeing-kabul-now-my-children-can-grow-up-in-peace", "date_published": "2022-12-24 13:00:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Love puzzles as much as I do? Then you’ll adore these festive quizzes and riddles", "description": "<p>A lifelong fan of games, puzzles and brainteasers kicks off our bumper series of Christmas fun</p><p>Welcome to Saturday’s special Christmas puzzles edition. You are about to embark on hours of mind-sharpening fun – or indulge in a dangerous vice that will ruin both society and your brain. </p><p>I’m a lifelong puzzle fan and while writing a book about my obsession, I was amused and disturbed to see that, for as long as there have been puzzles, there have been denouncers.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/24/love-puzzles-as-much-as-i-do-then-youll-adore-these-festive-quizzes-and-riddles\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/24/love-puzzles-as-much-as-i-do-then-youll-adore-these-festive-quizzes-and-riddles", "date_published": "2022-12-24 13:00:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "From Marilyn to Shakespeare: how well do you know history’s most bungled quotes?", "description": "<p>The internet is full of wonky attributions and made-up catchphrases, from real life and pop culture. Can you tell your Attenborough from your Armstrong?</p><p><br /></p><p>Those of you who had “Sir David Attenborough has beef with Adelaide shopping mall plaque” on your 2021 bingo cards must have done a victory dance this week. A local conservationist recognised some “honeybee propaganda”, attributed to the legendary naturalist, on a plaque accompanying a Westfield Tea Tree Plaza mural and <a href=\"https://viewer.gutools.co.uk/australia-news/2021/nov/30/buzz-off-david-attenborough-intervenes-after-adelaide-shopping-centre-bee-plaque-misquotes-him\">alerted the relevant authorities (i.e. Sir David himself)</a>.</p><p>The plaque has been done away with, but plenty more misquotes and misattributions remain. If you’ve ever seen a brush-script quote adorning a black and white photo, a painted sunset, or an embroidered couch cushion and wondered “Hang on a minute …”, this quiz is for you. Last one to finish gets their name attached to a Spider-Man quote on an inspirational $2 shop fridge magnet.</p> <a href=\"https://www.theguardian.com/australia-news/2022/dec/25/from-marilyn-to-shakespeare-how-well-do-you-know-historys-most-bungled-quotes\">Continue reading...</a>", "link": "https://www.theguardian.com/australia-news/2022/dec/25/from-marilyn-to-shakespeare-how-well-do-you-know-historys-most-bungled-quotes", "date_published": "2022-12-24 13:00:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘Do you work in business?’ Sunak mocked for ‘excruciating’ exchange with homeless man", "description": "<p>PM filmed asking man if he would like to ‘get in to’ financial services during visit to London shelter</p><p>Rishi Sunak has been criticised over an awkward exchange with a homeless person while volunteering at a soup kitchen in front of television cameras.</p><p>The prime minister visited a shelter on Friday, where after a brief exchange he asked the man whether he worked in business. The man replied that he was homeless. Sunak then discusses his background in the finance industry and asks if it would be something the man would “like to get in to”.</p> <a href=\"https://www.theguardian.com/society/2022/dec/24/rishi-sunak-rebuked-over-excruciating-exchange-with-homeless-man\">Continue reading...</a>", "link": "https://www.theguardian.com/society/2022/dec/24/rishi-sunak-rebuked-over-excruciating-exchange-with-homeless-man", "date_published": "2022-12-24 12:52:07+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Polar bears vanishing from ‘polar bear capital of the world’ in Canada", "description": "<p>Government research shows dramatic decline in numbers in western Hudson Bay stronghold</p><p>Polar bears are disappearing fast from the western part of Hudson Bay on the southern tip of the Canadian Arctic, according to a government survey.</p><p>The report said there had been a dramatic decline in the of number of female bears and cubs in particular.</p> <a href=\"https://www.theguardian.com/world/2022/dec/24/polar-bears-vanishing-from-polar-bear-capital-of-the-world-in-canada\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/24/polar-bears-vanishing-from-polar-bear-capital-of-the-world-in-canada", "date_published": "2022-12-24 12:04:01+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Mark Robins gives Coventry City hope that dark clouds are lifting", "description": "<p>Popular manager is plotting an unlikely playoff push after steering the Championship club through choppy waters</p><p>Coventry City’s season began with them unable to play home games due to the state of the pitch, more recently they have received an <a href=\"https://www.theguardian.com/business/2022/dec/05/mike-ashley-frasers-groups-serves-coventry-city-fc-eviction-notice-stadium\">eviction notice</a> from the stadium and are in the process of being taken over. Anyone would forgive their small squad for being unable to focus considering everything going on around them but instead they are eighth in the Championship with a game in hand on those in the playoff places.</p><p>The key man holding things together is manager Mark Robins, who takes his side to face Sheffield United on Boxing Day. In his second spell in charge of the club, Robins has taken City from League Two to the Championship in three seasons, despite the turbulence around him, and kept them in mid-table for the past two campaigns.</p> <a href=\"https://www.theguardian.com/football/2022/dec/24/mark-robins-gives-coventry-city-hope-that-dark-clouds-are-finally-lifting\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/24/mark-robins-gives-coventry-city-hope-that-dark-clouds-are-finally-lifting", "date_published": "2022-12-24 12:00:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "We planned epic Scalextric tournaments as we watched TFI Friday – the Christmas present I’ll never forget", "description": "<p>I finally got the racing car set I’d always wanted when I went to university. But it didn’t work out quite as I imagined</p><p>As a child, I always wanted a Scalextric set for Christmas or my birthday, but I never got one. That’s not to say I wasn’t inundated with toys. Had my mum not later donated my entire Star Wars collection to the church jumble sale (thanks, Mum!), or had my dog not chewed up my original 1977 double-telescoping Darth Vader (thanks, Jasper!), I’d now be a millionaire. But, for some reason, the Formula One slot car racing game eluded me.</p><p>So, in my final year at university, when my parents asked what they could get the student who seemingly had everything, I asked for a Scalextric set. I could picture the scene perfectly: I’d have it set up in my student bedroom as a way of enticing the ladies back for a quick “circuit” or two. Or, better yet, we would set it up in the living room, figure-of-eighting around the back of the sofa, where we would host epic Scalextric tournaments as we watched TFI Friday on our rented (yes, rented) TV, to decide who would do the washing-up or take out the bins. Or, when we felt really lazy, we could use the cars to deliver cups of tea between fellow housemates. “Pass the TV remote control, you say? No, but I’ll happily Scalextric it to you …”</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/24/we-planned-epic-scalextric-tournaments-as-we-watched-tfi-friday-the-christmas-present-ill-never-forget\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/24/we-planned-epic-scalextric-tournaments-as-we-watched-tfi-friday-the-christmas-present-ill-never-forget", "date_published": "2022-12-24 12:00:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Meera Sodha’s vegan recipe for aubergine and silken tofu with tahini and crispy chilli spring onions | The new vegan", "description": "<p>Ready-made ingredients do the heavy lifting in a dish that’s bursting with flavour</p><p>A large part of my ability to put dinner on the table, sometimes at the last minute, relies on the genius of good ready-made ingredients. Specifically, I am talking about silken tofu, tahini and crispy chilli, all of which feature in today’s recipe and which are excellent friends in the kitchen. Good-quality silken tofu is a textural pleasure that can barely hold itself together; it’s gentle, savoury and soothing. It rubs along well with creamy hot aubergines, and the pair of them together are very receptive to most big delicious flavours – such as ginger, soy and crispy chilli – that you can throw at them.</p> <a href=\"https://www.theguardian.com/food/2022/dec/24/vegan-aubergine-and-silken-tofu-with-tahini-and-crispy-chilli-spring-onions-recipe-meera-sodha\">Continue reading...</a>", "link": "https://www.theguardian.com/food/2022/dec/24/vegan-aubergine-and-silken-tofu-with-tahini-and-crispy-chilli-spring-onions-recipe-meera-sodha", "date_published": "2022-12-24 12:00:31+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Huge winter storm hits US with life-threatening cold as holidays begin", "description": "<p>More than 60% of US faces winter weather warnings with temperatures drastically below normal in many places</p><p>A wild winter storm continued to envelop much of the US on Saturday, bringing blinding blizzards, freezing rain, flooding and life-threatening cold that created mayhem for those traveling for the Christmas holiday.</p><p>The storm downed power lines, littered highways with piles of cars in deadly accidents and led to mass flight cancellations.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/24/huge-winter-storm-bomb-cyclone-us-life-threatening-cold-holidays\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/24/huge-winter-storm-bomb-cyclone-us-life-threatening-cold-holidays", "date_published": "2022-12-24 11:55:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "'Watch me get crankier': sports anchor steps in to report on US storm – video", "description": "<p>A TV sports anchor from Iowa braved blizzard conditions on Thursday morning to report on the winter storm that has left more than 1.4 million homes without power. The reporter jokingly told audiences: 'I can still feel my face right now but I kind of wish I couldn't'. Broadcaster Mark Woodley said he usually reports on sports, but 'everything has been cancelled'</p> <a href=\"https://www.theguardian.com/us-news/video/2022/dec/24/us-storm-mark-woodley-sports-anchor-report-video\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/video/2022/dec/24/us-storm-mark-woodley-sports-anchor-report-video", "date_published": "2022-12-24 11:49:02+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Republicans calling Trump’s tax returns ‘private’ don’t understand privacy | Jan-Werner Müller", "description": "<p>The Trump years demonstrated that the norm of presidential candidates voluntarily releasing their returns is too weak</p><p>Donald Trump’s biggest worries right now might not be about Congress having released six years of his tax returns. But it is an issue where Republicans can comfortably have it both ways: please Trump’s base, as they loudly perform indignation about Democrats’ conduct, even as they cease defending a politically weakened Trump against the charges of the January 6 committee.</p><p>The Republican party has all but said that they will play tit-for-tat in the new Congress – investigations, impeachments, whatever it takes to troll Democrats and distract the public with political theater, as Republicans are unlikely to make good on campaign promises. Hence it is crucial to understand what made the release of Trump’s tax returns legitimate – and why Trump cannot appeal to privacy as a trump card – and why we must also put rules in place to prevent political witch-hunts.</p><p>Jan-Werner Mueller teaches at Princeton and is a Guardian US columnist. His most recent book is <a href=\"https://us.macmillan.com/books/9780374720711/democracyrules\">Democracy Rules</a></p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/24/republicans-calling-trumps-tax-returns-private-dont-understand-privacy\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/dec/24/republicans-calling-trumps-tax-returns-private-dont-understand-privacy", "date_published": "2022-12-24 11:14:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Vieira claims Martínez’s ‘stupid’ World Cup celebrations spoiled triumph", "description": "<ul><li>Argentina goalkeeper made vulgar gesture and mocked Mbappé</li><li>Patrick Vieira: ‘That was a stupid decision from Martínez’</li></ul><p>Crystal Palace’s manager, Patrick Vieira, believes the Aston Villa goalkeeper Emiliano Martínez’s “stupid” celebrations have taken some of the sheen off Argentina’s World Cup win.</p><p>Martínez was instrumental <a href=\"https://www.theguardian.com/football/2022/dec/18/world-cup-final-argentina-france-match-report\">in Argentina’s penalty shootout victory</a> over France last Sunday, but he has raised eyebrows with some of his actions afterwards.</p> <a href=\"https://www.theguardian.com/football/2022/dec/24/vieira-claims-martinezs-stupid-world-cup-celebrations-spoiled-triumph\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/24/vieira-claims-martinezs-stupid-world-cup-celebrations-spoiled-triumph", "date_published": "2022-12-24 11:14:10+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "In homage to Harry Styles, I tried to knit a grungy cloak of homemade smugness | Rebecca Nicholson", "description": "<p>I wanted to learn a skill that would come in handy after society collapsed – perhaps I should have taken up unarmed combat</p><p>The cardigan was conceived in anxiety, so no wonder it came out looking like that. I started knitting in lockdown, because keeping my hands occupied made it harder to refresh news apps.</p><p>At some point over the last year, as Covid worries began to retreat, knitting hitched itself to climate-based worries instead. I’m not saying it’s rational, but hear me out: my brain has been dabbling with “doomsday prepper” for its 2022 theme, and I reasoned with it that knitting was an essential skill for a rapidly changing world.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/24/think-this-is-bad-should-have-seen-first-attempt-at-stylish-cardigan\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/dec/24/think-this-is-bad-should-have-seen-first-attempt-at-stylish-cardigan", "date_published": "2022-12-24 11:00:32+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘A living museum’: what it’s like using Netflix’s DVD-by-mail in 2022", "description": "<p>The bright red envelopes feel like a nostalgic artifact from a different era and require an alarming degree of commitment</p><p>I opened my mailbox and it felt like 2006 all over again: there it was, a DVD in a bright red envelope.</p><p>While Netflix has become synonymous with streaming, its DVD-by-mail service remains alive – and 2022 marks its 25th anniversary. It could also mark the last full year before its brutal death: Reed Hastings, the company’s co-CEO, has suggested 2023 could be the year the service goes the way of Blockbuster. It once had 16 million subscribers, according to the <a href=\"https://apnews.com/article/business-reed-hastings-72d15f130ae63b2aa8668145c926d718?taid=638402b6c1bdbe000114716a\">Associated Press</a>; now it’s down to 1.5 million.</p> <a href=\"https://www.theguardian.com/media/2022/dec/24/netflix-dvd-by-mail-service-dvd-com\">Continue reading...</a>", "link": "https://www.theguardian.com/media/2022/dec/24/netflix-dvd-by-mail-service-dvd-com", "date_published": "2022-12-24 11:00:32+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘You see trees on sale’: the easing of Saudi Arabia’s Christmas taboo", "description": "<p>Furtive transactions a thing of the past as retailers tentatively sell decorations openly</p><p>In previous years during the run-up to Christmas, Alia Obaidi would go to the local market in Riyadh, summon an Indian merchant and whisper her order. A short time later, he’d return with a cardboard box from a back room and furtively collect money. </p><p>But things have changed. When Alia, a Lebanese resident of the Saudi capital, made her annual trip to source Christmas decorations this year, she no longer needed the merchant, or the subterfuge.</p> <a href=\"https://www.theguardian.com/world/2022/dec/24/you-see-trees-on-sale-the-easing-of-saudi-arabia-christmas-taboo\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/24/you-see-trees-on-sale-the-easing-of-saudi-arabia-christmas-taboo", "date_published": "2022-12-24 11:00:32+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘Dig deep and think as hard as possible’ – the secrets of success in Scrabble, Sudoku, Jenga and more", "description": "<p>From a 9-year old Scrabble prodigy to the UK jigsaw champion, we asked master gamers and puzzlers to reveal their secrets</p><p>The first time I speak to George Scholey this October, he is on the train to the UK Rubik’s Cube championships in Coventry. The 20-year-old English student at Queen Mary University in London won the title in 2019, and, as subsequent competitions were postponed due to the pandemic, has been reigning champion for three years. “It’s really nice, but undeserved,” he laughs.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/24/expert-master-secrets-scrabble-sudoku-jenga-and-more\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/24/expert-master-secrets-scrabble-sudoku-jenga-and-more", "date_published": "2022-12-24 11:00:31+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Transcripts reveal Cassidy Hutchinson was pressured to protect Trump: ‘I was scared’", "description": "<p>According to transcripts, Cassidy was conflicted ahead of the hearing: ‘I felt like Trump was looking over my shoulder’</p><p>“I’m about to be fucking nuked,” former White House aide Cassidy Hutchinson <a href=\"https://www.nbcnews.com/politics/congress/cassidy-hutchinson-knew-was-going-nuked-turning-trump-anyway-rcna62981\">reportedly</a> told a January 6 committee staff member after meeting with investigators before her bombshell testimony to the committee in June. Her prediction turned out to be accurate.</p><p>Within hours of Hutchinson’s surprise appearance, where she testified about a furious president who encouraged his supporters to march to the Capitol, tried to grab the steering wheel of a presidential SUV and hurled his lunch against an Oval Office wall, the backlash began.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/24/transcripts-reveal-cassidy-hutchinson-was-pressured-to-protect-trump-i-was-scared\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/24/transcripts-reveal-cassidy-hutchinson-was-pressured-to-protect-trump-i-was-scared", "date_published": "2022-12-24 10:00:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘A streak of extremism’: US book bans may increase in 2023", "description": "<p>Despite key victories, books covering race and LGBTQ+ topics continue to attract bans in conservative states</p><p>Book bans have plagued many US schools throughout 2022, with stories focusing on LGBTQ+ and race issues being targeted by conservatives across the country, and the right aims only to step up its attempts at censorship in the new year, experts warn. </p><p>States including Missouri and Utah have seen intensifying crackdowns in recent months, with some Utah school libraries now requiring permission slips for students to borrow books covering LGBTQ+ themes. Elsewhere the <a href=\"https://apnews.com/article/texas-governor-race-2022-midterm-elections-1aba86e87ccd8384655d4319fd14f3fb\">convincing re-elections</a> of Republican governors in Florida and Texas, which have some of the most restrictive laws around education, mean that change is unlikely there in the short term.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/24/us-book-bans-streak-of-extremism\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/24/us-book-bans-streak-of-extremism", "date_published": "2022-12-24 10:00:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘Brilliant fun’: UK automaker shrinks classic cars for big spenders", "description": "<p>The Little Car Company, housed in a converted RAF base at Bicester, makes miniature classics that run on batteries </p><p>Building cars is hard, so when Ben Hedley started his business he started small. To be precise, he started at 75% of the size. The Little Car Company does what its name suggests, producing shrunken but drivable battery electric toy versions of full-size classics from the likes of Aston Martin and Ferrari.</p><p>The company has made its way to £10m in turnover and 60 employees almost by accident over four years, Hedley says, walking around the company’s workshop in Bicester Heritage, a converted Royal Air Force base in Oxfordshire that has been turned into a hub for classic car businesses. The company made its first profits in the last financial quarter, despite supply chain problems that have <a href=\"https://www.theguardian.com/business/2022/nov/25/carmaker-jlr-reducing-its-production-at-uk-factories-until-spring\">hit automotive manufacturers big and small</a>.</p> <a href=\"https://www.theguardian.com/business/2022/dec/24/uk-automaker-shrinks-classic-cars-for-big-spenders\">Continue reading...</a>", "link": "https://www.theguardian.com/business/2022/dec/24/uk-automaker-shrinks-classic-cars-for-big-spenders", "date_published": "2022-12-24 10:00:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Gakpo to Gvardiol: how the January window is looking for transfer targets", "description": "<p>Premier League clubs are gearing up for the new year sales but the winter World Cup could hike individual price tags</p><p>PSV’s plan was to let the Netherlands international move in the summer but <a href=\"https://www.theguardian.com/football/2022/nov/27/versatile-cody-gakpo-in-life-changing-form-for-stuttering-netherlands\">after his exceptional World Cup</a> he has a chance to leave in January. Erik ten Hag is a big fan and Manchester United remain interested, making contact with the 23-year-old’s agents. Negotiations between the clubs have not started, though, and it depends on how much United are willing to invest in a forward. PSV wanted €50m last summer but are now demanding more than €60m.</p> <a href=\"https://www.theguardian.com/football/2022/dec/24/gakpo-to-gvardiol-how-the-january-window-is-looking-for-transfer-targets\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/24/gakpo-to-gvardiol-how-the-january-window-is-looking-for-transfer-targets", "date_published": "2022-12-24 10:00:29+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘Nick jumped in the water and this shot happened’: Pasha Francuz’s best phone picture", "description": "<p>How the Ukraine-born photographer, on a hot day by a pool in San Francisco, came to snap Santa socks</p><p>Pasha Francuz was born in Chernivtsi, in western Ukraine, but left eight years ago, living in Poland and Italy before settling near San Francisco with his wife and teenage daughter.</p><p>“A friend in Kyiv, Oleg, is a fashion designer, and sent me a few pairs of his socks to take some marketing shots of. It was one of the hottest days of the year, so I was down by our apartment complex’s pool with my friend and neighbour Nick. We took a series of photos, then Nick jumped in the water and this shot happened,” Francuz says.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/24/pasha-francuz-best-phone-picture\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/24/pasha-francuz-best-phone-picture", "date_published": "2022-12-24 10:00:29+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘Serpent’ serial killer Charles Sobhraj returns to France after 19 years in prison", "description": "<p>Sobhraj arrives in Paris on commercial flight after release from Nepalese prison on health grounds</p><p>Charles Sobhraj, a convicted killer known as “the Serpent” who police believe targeted western backpackers on the hippie trail in the 1970s, has returned to France after nearly two decades behind bars in Nepal, BFM TV reported.</p><p>Nepal’s supreme court ordered the release of Sobhraj on Wednesday, citing his advanced age and health.</p> <a href=\"https://www.theguardian.com/world/2022/dec/24/serpent-serial-killer-charles-sobhraj-returns-to-france-after-19-years-in-prison\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/24/serpent-serial-killer-charles-sobhraj-returns-to-france-after-19-years-in-prison", "date_published": "2022-12-24 09:58:04+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Alexia Putellas is first female player to regain Guardian top 100 crown", "description": "<p>Barcelona midfielder defends her title despite missing half the year with an ACL injury with lots of new players making the list</p><p>It is fair to say that 2022 was the most competitive and difficult year to choose <a href=\"https://www.theguardian.com/football/ng-interactive/2022/dec/21/the-100-best-female-footballers-in-the-world-2022\">the best 100 female footballers</a>, with 358 players receiving votes from our 119 judges.</p><p>Given we ask our judges to vote only for their own individual top 40, that is an incredible spread and shows how extensive the talent and quality in the women’s game is.</p> <a href=\"https://www.theguardian.com/football/2022/dec/24/alexia-putellas-is-first-female-player-to-regain-guardian-top-100-crown\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/24/alexia-putellas-is-first-female-player-to-regain-guardian-top-100-crown", "date_published": "2022-12-24 09:30:29+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Edward Enninful: ‘In African families, you can be one of three things: a doctor, a lawyer or a failure’", "description": "<p>The Vogue editor on loving reality TV, nearly losing his trousers at Buckingham Palace and the showbiz icon who ruined his day</p><p>Born in Ghana, Enninful, 50, came to the UK as a refugee. After a stint as a model, he became fashion director of i-D at just 18, and went on to work for W magazine and US Vogue. In 2016, he was awarded an OBE for services to diversity in the fashion industry, and the following year he became editor-in-chief of British Vogue. In 2020, he was also made European editorial director of Vogue. This year, he published the memoir, <a href=\"https://www.theguardian.com/books/2022/sep/15/a-visible-man-by-edward-enninful-review-the-long-road-to-vogue\" title=\"\">A Visible Man</a>. He lives in London with his husband.</p><p><strong>What is your greatest fear?</strong><br />When I get to the restaurant and don’t see any hot sauce on the table.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/24/edward-enninful-interview\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/24/edward-enninful-interview", "date_published": "2022-12-24 09:30:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Fire in Russian care home kills 22 people", "description": "<p>Blaze in Siberian city guts second floor of building housing unregistered home for older people</p><p>A fire in a home for older people in a Siberian cityhas killed 22 people, Russian investigators said.</p><p>The blaze gutted the second floor of the building, which was not officially registered as a care home, but it was out by the early hours of Saturday when rescuers finished combing the rubble in Kemerovo, state media and emergency services said.</p> <a href=\"https://www.theguardian.com/world/2022/dec/24/fire-in-russian-care-home-older-people-kemerovo-serbia\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/24/fire-in-russian-care-home-older-people-kemerovo-serbia", "date_published": "2022-12-24 09:29:54+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Pussy Riot song protests against war in Ukraine and calls for Putin to be prosecuted", "description": "<p>The collective said Mama, Don’t Watch TV – a reference to the words of a captured Russian conscript soldier – rails against the Russian leader’s ‘bloodthirsty puppets’ and ‘war criminals’</p><p><a href=\"https://www.theguardian.com/music/pussy-riot\">Pussy Riot</a> have released a new song protesting against the war in Ukraine, Russian censorship and the west “sponsoring” the regime through buying oil and gas from Russia. They have also called for the Russian leader, Vladimir Putin, to be tried at an international tribunal.</p><p>In a statement, they described Putin’s government as a “terrorist regime” and call him, his officials, generals and propagandists “war criminals”.</p> <a href=\"https://www.theguardian.com/world/2022/dec/24/pussy-riot-song-protests-against-war-in-ukraine-and-calls-for-putin-to-be-prosecuted\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/24/pussy-riot-song-protests-against-war-in-ukraine-and-calls-for-putin-to-be-prosecuted", "date_published": "2022-12-24 09:00:29+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Can you outwit Margaret Atwood? The bumper books quiz of 2022", "description": "<p>Which author was this year elected to the US Senate? In what horror story does a vampire appear as a cat? Test your wits with questions set by authors including Atwood, Bernardine Evaristo, Ian Rankin and more</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/24/can-you-outwit-margaret-atwood-the-bumper-books-quiz-of-2022\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/24/can-you-outwit-margaret-atwood-the-bumper-books-quiz-of-2022", "date_published": "2022-12-24 09:00:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Do you smell what I smell? How scents linked to Christmas have changed", "description": "<p>While oranges and cloves moved from medicine cabinet to kitchen, rosemary fell out of festive fashion in England</p><p>The waft of pine trees and cinnamon biscuits may mean it is beginning to smell a lot like Christmas, but the odours that conjure up yuletide today may not always have had such joyful connotations, research has revealed.</p><p>Experts studying records of smells described in texts dating as far back as the 16th century say they have discovered the scents we associate with Christmas have shifted over time.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/24/do-you-smell-what-i-smell-how-scents-linked-to-christmas-have-changed\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/24/do-you-smell-what-i-smell-how-scents-linked-to-christmas-have-changed", "date_published": "2022-12-24 09:00:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Tom Gauld on shopping with the three wise men – cartoon", "description": "<a href=\"https://www.theguardian.com/books/picture/2022/dec/24/tom-gauld-on-shopping-with-the-three-wise-men-cartoon\">Continue reading...</a>", "link": "https://www.theguardian.com/books/picture/2022/dec/24/tom-gauld-on-shopping-with-the-three-wise-men-cartoon", "date_published": "2022-12-24 08:00:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Yotam Ottolenghi’s last-minute recipes for the Christmas break", "description": "<p>Should guests with varying appetites turn up at short notice over the Christmas holidays, this dauphinoise, herby stuffing and pear dessert should help cover all bases</p><p>A festive “last minute” is not <em>quite</em> the same as a Monday night “last minute”. Agreed?! A festive last minute means that you’ve just been told that a few extra people are turning up for tomorrow’s feast. And one of them happens to be vegan, another is gluten-free and the other one’s just going to be very (very) hungry. Festive feasting is all about fending off last-minute curveballs such as this, so here are three dishes to help keep you covered.</p> <a href=\"https://www.theguardian.com/food/2022/dec/24/root-vegetable-dauphinoise-apricot-stuffing-roast-pears-recipes-yotam-ottolenghi-last-minute-christmas\">Continue reading...</a>", "link": "https://www.theguardian.com/food/2022/dec/24/root-vegetable-dauphinoise-apricot-stuffing-roast-pears-recipes-yotam-ottolenghi-last-minute-christmas", "date_published": "2022-12-24 08:00:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Far and away my best Christmas trip: a cottage on the Pembrokeshire coast", "description": "<p>Going away for the festivities can raise issues from sleeping to catering to whether Santa will still find you. But get it right and it can be a yuletide miracle</p><p>And then the dreaded words were spoken: “Let’s all go away for Christmas.”</p><p>We braced ourselves for the avalanche of opposition, particularly from the most formidable quarters: children and grandparents. Like most families we were riven by deaths, divorces, distance and Marmite. Christmas had become a crazy shuttling between familiar locations: picking people up, dropping others off, constantly eating. How many times in one day can you say with conviction to several different relatives, “Yes, your Christmas cake is the very best”? And constantly making amends, “I’m sorry, but we left all your presents at the last house we were in. Everything is such a rush …”</p> <a href=\"https://www.theguardian.com/travel/2022/dec/24/my-best-christmas-trip-cottage-on-pembrokeshire-coast\">Continue reading...</a>", "link": "https://www.theguardian.com/travel/2022/dec/24/my-best-christmas-trip-cottage-on-pembrokeshire-coast", "date_published": "2022-12-24 08:00:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Get perfect party waves with this foolproof new styler | Sali Hughes", "description": "<p>This easy-to-use gadget leaves me with loose, tangle-free curls</p><p>Hair gadgets are a high-risk business. They promise – and cost – so much, while their results are too often underwhelming, overcomplicated or flat-out disastrous (I know of at least three regular readers who have had to cut hot brushes out of their chewed-up hair).</p><p>So I feel compelled to tell everyone who regularly tongs their hair into waves that Babyliss’s new <strong><a href=\"https://www.johnlewis.com/babyliss-wave-secret-air-hair-styler-black/p109507883?s_ppc=2dx92700071884894967_mixed_technology_BAU&amp;amp;tmad=c&amp;amp;tmcampid=2&amp;amp;gclid=Cj0KCQiA37KbBhDgARIsAIzce17AlcdPHBVYLg4p1uwgFw_7Q_rxzjRH-RCltqPkof8FtkzbsG8UgaMaAmj-EALw_wcB&amp;amp;gclsrc=aw.ds\" title=\"\">Wave Secret Air Styler</a></strong> is different, genuinely problem-solving, and would deliver even with a baby chimp at the helm.</p> <a href=\"https://www.theguardian.com/fashion/2022/dec/24/get-perfect-party-waves-with-this-foolproof-new-styler\">Continue reading...</a>", "link": "https://www.theguardian.com/fashion/2022/dec/24/get-perfect-party-waves-with-this-foolproof-new-styler", "date_published": "2022-12-24 08:00:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "I curled up with my sister and we opened our stockings together one last time – the Christmas present I’ll never forget", "description": "<p>Ninka had been diagnosed with leukaemia when she was 16 but for one final festive celebration, she was out of hospital and back home with us</p><p>We didn’t know until the very last minute whether my sister would be let out of hospital for Christmas.</p><p>It was 1991 and we were camping in a house in London that a friend had lent my parents, waiting to find out. Home, in theory, was Rome for my parents, Edinburgh for me – but in practice, a year and a bit into my sister’s leukaemia, home was wherever Ninka was being treated. There had been a brief, sunny period in the summer where she had been in remission. When the cancer came back, Mum just put her into the car and drove her from Italy to the Royal Free Hospital in London.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/24/i-curled-up-with-my-sister-and-we-opened-our-stockings-together-one-last-time-the-christmas-present-ill-never-forget\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/24/i-curled-up-with-my-sister-and-we-opened-our-stockings-together-one-last-time-the-christmas-present-ill-never-forget", "date_published": "2022-12-24 08:00:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "London private school investigated over blanket A or A* grades in 2021 A-levels", "description": "<p>North London Collegiate school has faced multiple malpractice allegations over way grades awarded</p><p>A prestigious private school in London has faced multiple investigations into the way it awarded exam grades in 2021, when all its A-level entries received A* or A, the Guardian has learned.</p><p>Senior leaders and teachers at the North London Collegiate school (NLCS) have been placed under investigation for alleged malpractice in setting teacher-assessed grades, which replaced formal exams cancelled by the government because of the Covid pandemic.</p> <a href=\"https://www.theguardian.com/education/2022/dec/24/north-london-collegiate-school-investigated-a-level-grades-2021-malpractice-allegations\">Continue reading...</a>", "link": "https://www.theguardian.com/education/2022/dec/24/north-london-collegiate-school-investigated-a-level-grades-2021-malpractice-allegations", "date_published": "2022-12-24 08:00:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "You be the judge: should our daughter pay more towards the heating bills?", "description": "<p>Mum says Abigail keeps the radiators on all day; Abigail says she needs to stay warm while working from home. You decide who’s right in this heated debate</p><p>• <a href=\"https://www.theguardian.com/lifeandstyle/2021/sep/25/you-be-the-judge-send-us-your-domestic-disputes\">Find out how to get a disagreement settled or become a You be the judge juror</a></p><p><em>Abigail secretly turns the radiators on in the day, while we’re out. But we’re trying to keep costs down</em></p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/24/you-be-the-judge-should-our-daughter-pay-more-towards-the-heating-bills\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/24/you-be-the-judge-should-our-daughter-pay-more-towards-the-heating-bills", "date_published": "2022-12-24 08:00:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘The equivalent to our Covid pandemic’: bird flu hasn’t gone away and is still spreading", "description": "<p>Wild bird populations have been decimated across the UK and scientists fear there is more to come in 2023</p><p>It is more than a year since avian flu began to devastate wild birds in large numbers, and conservationists are fearful of what 2023 will hold. The highly infectious variant of H5N1 has caused <a href=\"https://www.efsa.europa.eu/en/efsajournal/pub/7415\">Europe’s worst bird flu season</a> and has spread across the globe with little sign of slowing.</p><p>In the UK, there were reports of some great skua dying from the H5N1 variant in the summer of 2021 but the mass die-offs started in the <a href=\"https://bvajournals.onlinelibrary.wiley.com/doi/epdf/10.1002/vetr.2311\">autumn and winter</a>. More than a third of Svalbard barnacle geese in the Solway Firth, on the border of England and Scotland, – 16,500 out of 43,000 – died last winter.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/24/bird-flu-hasnt-gone-away-bleak-outlook-2023-aoe\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/dec/24/bird-flu-hasnt-gone-away-bleak-outlook-2023-aoe", "date_published": "2022-12-24 07:45:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Russia-Ukraine war live: Russian strikes on infrastructure more infrequent due to missile shortage, says UK", "description": "<p>Ministry of Defence says Russia’s limited supply of munitions is limiting offensive operations; Russian president has finally ‘called the war what it is’, says Washington </p><ul><li><a href=\"https://www.theguardian.com/world/2022/dec/24/russia-ukraine-war-at-a-glance-what-we-know-on-day-304-of-the-invasion\">What we know on day 304 of the Russia-Ukraine war</a></li></ul><p><strong>Volodymyr Zelenskiy</strong> has warned Ukrainians that Russia could launch more strikes over Christmas, urging them to “pay attention to air raid alarms, help one another and look out for one another”.</p><p>The Ukrainian president said in his nightly video address on Friday:</p><p>With the holiday season fast approaching, the Russian terrorists could again step up their activities. They have no regard for Christian values or any values for that matter.</p><p>Russia has likely limited its long-range missile strikes against Ukrainian infrastructure to around once a week due to the limited availability of cruise missiles.</p><p>Similarly, Russia is unlikely to have increased its stockpile of artillery munitions enough to enable large-scale offensive operations.</p> <a href=\"https://www.theguardian.com/world/live/2022/dec/24/russia-ukraine-war-live-us-calls-for-russian-troop-pullout-after-putin-acknowledges-war\">Continue reading...</a>", "link": "https://www.theguardian.com/world/live/2022/dec/24/russia-ukraine-war-live-us-calls-for-russian-troop-pullout-after-putin-acknowledges-war", "date_published": "2022-12-24 07:43:56+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "The End of Nightwork by Aidan Cottrell-Boyce review – life in fast-forward", "description": "<p>Bold philosophical musings on the end of the world in a thrillingly ambitious debut about a man with a condition that causes rapid ageing</p><p>Ours is an age of acceleration and dislocation. The pandemic hurtled us from the end of one decade to the early years of another without pause for reflection, and we can’t quite connect who we are now with who we were – or what the world was – in the Before Times. So it’s fascinating that Aidan Cottrell-Boyce’s thrillingly ambitious debut novel, The End of Nightwork, features a narrator who suffers from a rare hormonal condition that dramatically accelerates the ageing process. At 13, Pol finds he has undergone a “heterochronous shock”, ageing him 10 years overnight – and leaving him there. Now in his early 30s, married to teacher Caroline and living in Kilburn with their young son, Jesse, Pol still has the appearance of a sprightly 23-year-old. His fast-forwarded development feels strangely apt for our times.</p><p>The details of his sudden teenage transformation are startling: “They had to shave me every day, because the beard and body hair growth was so rapid it was getting in the way of the doctors who were trying to operate on me … They were trying to stop my head from growing too quickly.” The medics were watching “a boy turning into a man before their very eyes”. While tales of metamorphosis are deep in the collective unconscious, shapeshifting myths normally resonate because of their moral framework, or at least act to reinforce the commonplace that everything is subject to change. For Pol, his transformation seems to carry no such reassuring meaning.</p> <a href=\"https://www.theguardian.com/books/2022/dec/24/the-end-of-nightwork-by-aidan-cottrell-boyce-review-life-in-fast-forward\">Continue reading...</a>", "link": "https://www.theguardian.com/books/2022/dec/24/the-end-of-nightwork-by-aidan-cottrell-boyce-review-life-in-fast-forward", "date_published": "2022-12-24 07:30:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Rude hippos, big beasts and lockdown for cats: it’s the nature news quiz of the year", "description": "<p>Take our bumper quiz to find out if you’re a biodiversity boffin or a nature no-hoper</p> <a href=\"https://www.theguardian.com/environment/2022/dec/24/nature-news-quiz-of-the-year-aoe\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/dec/24/nature-news-quiz-of-the-year-aoe", "date_published": "2022-12-24 07:15:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Cannibals! Crying! Carrots! The best movie moments of 2022", "description": "<p>From Elvis to Eo, Guardian writers have picked their most indelible scenes from this year’s big screen line-up</p><p>Jane Schoenbrun’s breakout horror film <a href=\"https://www.theguardian.com/film/2022/apr/26/were-all-going-to-the-worlds-fair-review-jane-schoenbrun\">We’re All Going to the World’s Fair</a> is about a lot of things: transgender gender dysphoria, the process of coming out, how the internet mediates teen identity development, parasocial relationships, and the strange culture of folklore, dares and sharing that has built up on the social web.</p> <a href=\"https://www.theguardian.com/film/2022/dec/24/cannibals-crying-carrots-the-best-movie-moments-of-2022\">Continue reading...</a>", "link": "https://www.theguardian.com/film/2022/dec/24/cannibals-crying-carrots-the-best-movie-moments-of-2022", "date_published": "2022-12-24 07:04:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Can you beat this fiendish Christmas quiz?", "description": "<p>Wizard of wordplay Frank Paul shares some of his trickiest brainteasers</p><p><strong>Film poem</strong></p><p>The names of 16 films from Rolling Stone’s Top 100 Films of the 1990s are concealed in this poem. They may be written forwards or backwards, separated by spaces, punctuation or line breaks (for instance, “<strong>No, it cele</strong>brates … ” would conceal “Election”).’</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/24/can-you-beat-this-fiendish-christmas-quiz\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/24/can-you-beat-this-fiendish-christmas-quiz", "date_published": "2022-12-24 07:00:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "In A Time of Panthers: Jeffery Henson Scales photographs Black history", "description": "<p>An absorbing pictorial history of a key component of the Black Power movement shows its relevance has not receded today</p><p>Jeffrey Henson Scales is a New York Times photo editor. His latest book is most compelling in how it helps place the relentless quest for equal treatment in easily understood context. Beyond beauty or mere appealing images, <a href=\"https://bookshop.org/p/books/in-a-time-of-panthers-early-photographs-jeffrey-henson-scales/18353773?ean=9781648230233\">In a Time of Panthers</a> is a highly valuable work.</p><p>Characterizing the Black Panther movement as “the vanguard of the African American civil rights struggle”, Henson Scales shows how it emerged. The movement became “focused on police violence and community needs in over-policed and under-served communities of color”. To Henson Scales, “So much in all of our lives would continue to change in ways unforeseen to me … so many of the issues that motivated us during these inspired years of activism in America remain unresolved.”</p> <a href=\"https://www.theguardian.com/books/2022/dec/24/in-a-time-of-panthers-jeffery-henson-scales-photographs-black-history\">Continue reading...</a>", "link": "https://www.theguardian.com/books/2022/dec/24/in-a-time-of-panthers-jeffery-henson-scales-photographs-black-history", "date_published": "2022-12-24 07:00:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "I’ve always felt a tug of sadness at Christmas – until this year | Rhiannon Lucy Cosslett", "description": "<p>I can never experience the festive season as a child again, but seeing it through my baby’s eyes is the next best thing</p><p>I’ve been well and truly ambushed by Christmas this year: the tree is only just decorated, and as for the homemade wreath I normally lovingly create with greenery foraged from the neighbourhood – forget it. I’m late on everything, from sending my tax information to my accountant to this column. I’ve missed all the Christmas delivery windows, and have spent this week rushing around town like the harassed mother I now am. Owing to illness and the baby forgetting how to sleep without the breast, I have missed every single festive gathering, both personal and professional, including the Guardian Opinion do, a huge family weekend in a Welsh haunted house, and various literary events, the schmoozing element of which could well have helped the chances of my new book – reference to which I have shoehorned in here in the hope that it might drum up some preorders. I have drunk precisely one (one!) martini, my first in 18 months, and while I enjoyed it, I would rather have had three, despite everyone knowing that two is the tipping point.</p><p>Yet I couldn’t be happier. Despite the opening paragraph, if you’ve come here for a protracted whinge, you will go away disappointed. This mad, chaotic singular year, I have felt the meaning of Christmas more than perhaps any other. I am the very essence of joy to the world, peace on earth, good tidings etc, etc. I haven’t even touched my misanthropic Merry Fucking Christmas <a href=\"https://open.spotify.com/playlist/6JwPuPiWSKldiJaoABK5sD\">Spotify playlist</a>, because I don’t wish I had a river I could skate away on. I’m happy right here, with my husband and my baby, and though I may roll my eyes during lullaby time when I get to lines such as “holy infant so tender and mild” and “the little Lord Jesus no crying he makes” it is only momentary. This year, I have had a great gift bestowed upon me, the gift of a child, and it has changed everything.</p><p>Rhiannon Lucy Cosslett is a Guardian columnist and author of <a href=\"https://guardianbookshop.com/the-year-of-the-cat-9781472290717\">The Year of the Cat</a>, which will be published in January 2023</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/24/christmas-baby-festive-season-child\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/dec/24/christmas-baby-festive-season-child", "date_published": "2022-12-24 07:00:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Rare Baldassare Peruzzi nativity painting saved for UK as ‘Christmas gift’", "description": "<p>Work created more than 500 years ago will go on display in Northern Ireland next year after export ban</p><p>A rare painting of the nativity created more than 500 years ago by Baldassare Peruzzi has been saved by the government as a “Christmas gift for the nation” after an export ban was imposed.</p><p>The Nativity, the only work by Peruzzi in the UK, will go on display in Northern Ireland next year. It was acquired by National Museums NI after funds were raised to buy the work from the National Heritage Memorial Fund, Art Fund, Department for Communities NI and the Esme Mitchell Trust.</p> <a href=\"https://www.theguardian.com/artanddesign/2022/dec/24/rare-baldassare-peruzzi-nativity-painting-saved-uk-christmas-gift\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/2022/dec/24/rare-baldassare-peruzzi-nativity-painting-saved-uk-christmas-gift", "date_published": "2022-12-24 07:00:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "The Norse god Baldr was killed by a spear made of what? The Saturday quiz", "description": "<p>From a Beatle to Bubbles the clown, test your knowledge with the Saturday quiz</p><p><strong>1</strong> What was recorded at Sarm West Studios on 25 November 1984?<br /><strong>2</strong> Ercole Mattioli and Eustache Dauger are proposed identities for which prisoner?<br /><strong>3</strong> The Norse god Baldr was killed by a spear made of what?<br /><strong>4</strong> Who followed Charles Hamilton and Frank Kennedy?<br /><strong>5</strong> Which tennis venue is named after a first world war fighter pilot?<br /><strong>6</strong> What was “made in Scotland from girders”?<br /><strong>7</strong> Edith Holden’s Nature Notes for 1906 become a bestseller under what title?<br /><strong>8</strong> In London motoring, what is the ULEZ?<br /><strong>What links:<br />9</strong> Ronna and quetta; ronto and quecto?<br /><strong>10</strong> Cinnamon; ice bucket; devious lick; Kylie Jenner lip?<br /><strong>11</strong> Ghawar (Saudi Arabia); Burgan (Kuwait); Ahvaz (Iran); Grane (Norway)?<br /><strong>12</strong> Carole Hersee; Bubbles the clown; noughts and crosses?<br /><strong>13</strong> Hieroglyphic; demotic; hieratic; Coptic?<br /><strong>14</strong> Histidine; isoleucine; leucine; lysine (and five others)?<br /><strong>15</strong> A Beatle; you; my two front teeth; Dukla Prague away kit?</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/24/the-norse-god-baldr-was-killed-by-a-spear-made-of-what-the-saturday-quiz\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/24/the-norse-god-baldr-was-killed-by-a-spear-made-of-what-the-saturday-quiz", "date_published": "2022-12-24 07:00:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Doctors warn parents about children swallowing objects in Christmas toys", "description": "<p>Button batteries can cause most damage, NHS says, as number of young people admitted to hospital doubles</p><p>Parents have been warned about the dangers of children swallowing small objects from Christmas presents and crackers.</p><p>Leading NHS doctors said the number of young people admitted to hospital after ingesting small objects had doubled over the past 10 years to 228, according to the latest data.</p> <a href=\"https://www.theguardian.com/society/2022/dec/24/doctors-warn-parents-about-children-swallowing-objects-in-christmas-toys\">Continue reading...</a>", "link": "https://www.theguardian.com/society/2022/dec/24/doctors-warn-parents-about-children-swallowing-objects-in-christmas-toys", "date_published": "2022-12-24 07:00:25+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Teenager killed in shooting at largest mall in the US", "description": "<p>People shown hiding in stores after apparent altercation between two groups amid Christmas influx at the Mall of America in Minnesota</p><p>A teenager was killed during a shooting at America’s largest mall, in the state of Minnesota, that sent frightened customers racing into a lockdown just before the holiday weekend, police said.</p><p>Bloomington’s police chief, Booker Hodges, said the victim was a 19-year-old man. A bystander’s jacket was also grazed by a bullet during the shooting at the Nordstrom outlet in the Mall of America on Friday.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/24/teenager-killed-in-shooting-at-largest-mall-in-the-us\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/24/teenager-killed-in-shooting-at-largest-mall-in-the-us", "date_published": "2022-12-24 06:18:10+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Christmas mulled wine: cheap but never that cheerful – Edith Pritchett cartoon", "description": "<a href=\"https://www.theguardian.com/lifeandstyle/ng-interactive/2022/dec/24/christmas-mulled-wine-cheap-but-never-that-cheerful-edith-pritchett-cartoon\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/ng-interactive/2022/dec/24/christmas-mulled-wine-cheap-but-never-that-cheerful-edith-pritchett-cartoon", "date_published": "2022-12-24 06:00:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "January 6 report review: 845 pages, countless crimes, one simple truth – Trump did it", "description": "<p>The House committee has done its work. The result is a riveting read, utterly damning of the former president and his followers</p><p>Whether fomenting insurrection, <a href=\"https://www.theguardian.com/us-news/2022/dec/21/writer-e-jean-carroll-rape-donald-trump-deposition\">standing accused of rape</a> or <a href=\"https://twitter.com/TimOBrien/status/1605395577566633984\">stiffing the IRS</a>, Donald Trump remains in the news. On Monday, the House select committee voted to issue <a href=\"https://january6th.house.gov/sites/democrats.january6th.house.gov/files/Report_FinalReport_Jan6SelectCommittee.pdf\">its final report</a>. Three days later, after releasing witness transcripts, the committee delivered the full monty. Bennie Thompson, Liz Cheney and the rest of <a href=\"https://january6th.house.gov/about/membership\">committee</a> name names and flash receipts. At 845 pages, the report is damning – and monumental.</p><p>Trumpworld is a <a href=\"https://www.documentcloud.org/documents/23469971-filed-ex-b-public-redacted-12-19-223438\">crime scene</a>, a tableau lifted from Goodfellas. Joshua Green of Bloomberg nailed that in <a href=\"https://www.theguardian.com/us-news/2017/jul/18/devils-bargain-review-steve-bannon-donald-trump-book\">The Devil’s Bargain</a>, his 2017 take on Trump’s winning campaign. The gang was always transgressive, fear and violence part of its repertoire.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/24/january-6-report-review-845-pages-crimes-trump\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/24/january-6-report-review-845-pages-crimes-trump", "date_published": "2022-12-24 06:00:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Tim Dowling: my wife clicks on a button that ruins five people’s Christmas", "description": "<p>We’re escaping the festive season by going to Morocco. Or at least, we were …</p><p>It was my wife’s idea: to escape Christmas by going someplace they don’t have it. She found cheap flights and whipped up sufficient enthusiasm among our three sons to persuade them to pay for their flights. We’d all spend Christmas together, in Morocco.</p><p>The only thing guaranteed to make me feel more anxious than Christmas itself is travelling at Christmas, but everything has been organised by my wife well in advance. I begin to relax by thinking of all the yuletide stuff I would not have to deal with.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/24/tim-dowling-my-wife-clicks-on-a-button-that-ruins-five-peoples-christmas\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/24/tim-dowling-my-wife-clicks-on-a-button-that-ruins-five-peoples-christmas", "date_published": "2022-12-24 06:00:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Trump, Bankman-Fried and Musk are the monsters of American capitalism | Robert Reich", "description": "<p>For them, and for everyone who still regards them as heroes, there is no morality in business or economics. The winnings go to the most ruthless</p><p>If this past week presents any single lesson, it’s the social costs of greed. Capitalism is premised on greed but also on guardrails – laws and norms – that prevent greed from becoming so excessive that it threatens the system as a whole.</p><p>Yet the guardrails can’t hold when avarice becomes the defining trait of an era, as it is now. Laws and norms are no match for the possibility of raking in billions if you’re sufficiently ruthless and unprincipled.</p> <a href=\"https://www.theguardian.com/business/2022/dec/24/trump-bankman-fried-and-musk-are-the-monsters-of-american-capitalism\">Continue reading...</a>", "link": "https://www.theguardian.com/business/2022/dec/24/trump-bankman-fried-and-musk-are-the-monsters-of-american-capitalism", "date_published": "2022-12-24 06:00:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "A Christmas far from home: Ukrainian families’ hopes and fears amid their new lives in Europe", "description": "<p>We revisit three families first interviewed in March after fleeing Ukraine to find safety in Spain, Portugal and France</p><p>In the weeks after the Russian invasion, the Guardian spoke to <a href=\"https://www.theguardian.com/global-development/2022/mar/27/ukrainian-families-on-starting-again-in-the-eu\">Ukrainians who had fled to find refuge across Europe</a>. As these families prepare to spend their first Christmas in their new homes, they describe the range of emotions that come with beginning a new year without the loved ones who stayed, as well as what the reality of a new life feels like.</p> <a href=\"https://www.theguardian.com/global-development/2022/dec/24/christmas-ukrainian-families-new-lives-europe\">Continue reading...</a>", "link": "https://www.theguardian.com/global-development/2022/dec/24/christmas-ukrainian-families-new-lives-europe", "date_published": "2022-12-24 06:00:25+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Blind date: ‘I was too busy thinking about the six kids he said we’d have to notice his table manners’", "description": "<p>Aaron, 25, meets Sid, 28. Both are support workers for children</p><p><strong><br />What were you hoping for?<br /></strong>A fun evening with drinks flowing, good company and good food.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/24/blind-date-aaron-sid\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/24/blind-date-aaron-sid", "date_published": "2022-12-24 06:00:25+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "How Tim Spector met Veronique Bataille: ‘The nurses were giving him a lot of attention. I didn’t want him snapped up’", "description": "<p>Spector, 64 and Bataille, 62, met while they were both working as doctors in Brussels in the 1980s. They married and have two children and live together in London</p><p>In 1983, the epidemiologist and author Tim Spector moved to Brussels for a year for a secondment, as part of a European Medical Rotation Scheme. He was transferred from his role as a junior doctor at St Bartholomew’s hospital in London to Cliniques Universitaires Saint-Luc. It was there that Tim met Veronique Bataille, who was then a student.</p><p>“I was in my penultimate year of medical school in Brussels,” says Veronique. She first spotted Tim in a meeting where hundreds of different specialists gathered to present and discuss complex cases. He was among those who had been asked to present.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/24/how-tim-spector-met-veronique-bataille-the-nurses-were-giving-him-a-lot-of-attention-i-didnt-want-him-snapped-up\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/24/how-tim-spector-met-veronique-bataille-the-nurses-were-giving-him-a-lot-of-attention-i-didnt-want-him-snapped-up", "date_published": "2022-12-24 06:00:25+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Qantas sends rescue flight to Azerbaijan after stranded passengers left in the dark", "description": "<p>Airline apologises to passengers and promises to get them to Heathrow airport ‘early on Christmas morning’</p><ul><li>Get our <a href=\"https://www.theguardian.com/australia-news/2022/oct/29/email-newsletters-guardian-australia-best-daily-news-emails-newsletter-free-sign-up-inbox-subscribe-headlines?CMP=cvau_sfl\">morning and afternoon news emails</a>, <a href=\"https://www.theguardian.com/technology/ng-interactive/2018/may/15/the-guardian-app?CMP=cvau_sfl\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></li></ul><p></p><p>Qantas passengers stranded in Azerbaijan after an emergency landing are expected to make it to London by Christmas morning, after the airline deployed a recovery flight from Australia.</p><p>The recovery flight left Sydney at 11.40am on Saturday and was expected to pick up the stranded passengers from Baku airport and continue on to London arriving “early on Christmas morning”, according to a statement Qantas released on Saturday afternoon.</p> <a href=\"https://www.theguardian.com/business/2022/dec/24/qantas-sends-rescue-flight-to-azerbaijan-after-stranded-passengers-left-in-the-dark\">Continue reading...</a>", "link": "https://www.theguardian.com/business/2022/dec/24/qantas-sends-rescue-flight-to-azerbaijan-after-stranded-passengers-left-in-the-dark", "date_published": "2022-12-24 05:48:44+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Chinese city seeing half a million Covid cases a day – local health chief", "description": "<p>The figures reported by Qingdao’s municipal health chief were in stark contrast to official statistics from the central government</p><p>Half a million people a day are being infected with Covid-19 in a single Chinese city, a senior health official has said, in a rare and quickly censored acknowledgment that the country’s wave of infections is not being reflected in official statistics.</p><p>A news outlet operated by the ruling Communist party in Qingdao reported the municipal health chief as saying that the eastern city was seeing “between 490,000 and 530,000” new Covid cases a day.</p> <a href=\"https://www.theguardian.com/world/2022/dec/24/chinese-city-seeing-half-a-million-covid-cases-a-day-local-health-chief\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/24/chinese-city-seeing-half-a-million-covid-cases-a-day-local-health-chief", "date_published": "2022-12-24 05:08:37+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "No room in Bethlehem’s inns as tourists return for Christmas season", "description": "<p>West Bank city gears up for festive season after two years of pandemic restrictions</p><p>There’s once again no room at the inn in Bethlehem as the Palestinian city gears up for its first Christmas season after two years of pandemic restrictions.</p><p>During the week of Christmas this year, 120,000 tourists and pilgrims from all over the world are expected to visit the occupied West Bank town, home to the Byzantine Church of the Nativity, which stands on the spot where it is believed Jesus was born. The predicted numbers for 2022 are almost on a par with 2019, when Bethlehem saw an all-time high of 150,000 visitors in the same time period, and 3 million visitors overall.</p> <a href=\"https://www.theguardian.com/world/2022/dec/24/no-room-in-bethlehems-inns-as-tourists-return-for-christmas-season\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/24/no-room-in-bethlehems-inns-as-tourists-return-for-christmas-season", "date_published": "2022-12-24 05:00:23+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Movie fans can sue over misleading trailer, US judge rules", "description": "<p>Ana de Armas enthusiasts say they were tricked into watching the film Yesterday as the Cuban actor was in the trailer but failed to make the final cut</p><p></p><p>Movie fans disappointed that their favourite actor was cut from a film after appearing in the trailer can sue the studio for false advertising, a US judge has ruled.</p><p>Two film buffs say Universal Pictures tricked them into renting 2019 flick Yesterday because the trailer featured actor Ana de Armas.</p> <a href=\"https://www.theguardian.com/film/2022/dec/24/movie-fans-can-sue-over-misleading-trailer-us-judge-rules\">Continue reading...</a>", "link": "https://www.theguardian.com/film/2022/dec/24/movie-fans-can-sue-over-misleading-trailer-us-judge-rules", "date_published": "2022-12-24 04:07:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "South Australia floods expected to inundate thousands of homes as NT town hit by one-in-50-year deluge", "description": "<p>Murray River forecast to peak in coming days as 241mm of rain falls on Timber Creek in the Northern Territory in 24 hours</p><ul><li><a href=\"https://www.theguardian.com/australia-news/live/2022/dec/24/australia-live-news-updates-qantas-passengers-stranded-in-azerbaijan-albanese-and-dutton-to-deliver-christmas-messages\">Follow our Australia news live blog for the latest updates</a></li><li>Get our <a href=\"https://www.theguardian.com/australia-news/2022/oct/29/email-newsletters-guardian-australia-best-daily-news-emails-newsletter-free-sign-up-inbox-subscribe-headlines?CMP=cvau_sfl\">morning and afternoon news emails</a>, <a href=\"https://www.theguardian.com/technology/ng-interactive/2018/may/15/the-guardian-app?CMP=cvau_sfl\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></li></ul><p>Thousands of residents in South Australia’s Riverland region are on high alert, with the rising Murray River forecast to peak in the coming days and thousands of properties expected to be inundated in coming weeks.</p><p>Meanwhile, a one-in-50-year flood has hit a remote town in the Northern Territory as authorities warn more rain is on the way for the rest of the territory.</p><p><strong><a href=\"https://www.theguardian.com/australia-news/2022/oct/29/email-newsletters-guardian-australia-best-daily-news-emails-newsletter-free-sign-up-inbox-subscribe-headlines?CMP=copyembed\">Sign up for Guardian Australia’s free morning and afternoon email newsletters for your daily news roundup</a></strong></p> <a href=\"https://www.theguardian.com/australia-news/2022/dec/24/south-australia-floods-thousands-of-murray-properties-expected-to-be-inundated-as-river-peaks\">Continue reading...</a>", "link": "https://www.theguardian.com/australia-news/2022/dec/24/south-australia-floods-thousands-of-murray-properties-expected-to-be-inundated-as-river-peaks", "date_published": "2022-12-24 03:55:09+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Australian allrounder Cameron Green makes Indian Premier League history with $3.15M deal", "description": "<ul><li>The 23-year-old is most expensive Australian in IPL history</li><li>Green joins Mumbai Indians after fierce bidding war</li></ul><p>Australian allrounder Cameron Green has made history at the Indian Premier League auction overnight, landing a deal with the Mumbai Indians worth a staggering $3.15 million, the most expensive IPL deal ever paid for an Australian.</p><p>Mumbai won the services of the 23-year-old West Australian in a fierce bidding war with the Delhi Capitals. It makes Green the most expensive Australian in IPL history. Yet the figure still fell short of the sum paid for English fast-bowler Sam Curran, who became the most expensive player in IPL ever when we received $3.38 million.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/24/cameron-green-makes-indian-premier-league-history-with-315m-deal\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/dec/24/cameron-green-makes-indian-premier-league-history-with-315m-deal", "date_published": "2022-12-24 03:39:44+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Fiji parliament confirms Sitiveni Rabuka as prime minister after days of uncertainty", "description": "<p>Rabuka accused the outgoing government of Frank Bainimarama of stoking ‘fear and chaos’ in the aftermath of the close election</p><p></p><p>Sitiveni Rabuka has become Fiji’s prime minister after a coalition of parties voted to install him, signalling an end to Frank Bainimarama’s 16 years in power.</p><p>The appointment of Rabuka on Saturday ended 10 days of uncertainty after an election delivered a hung parliament. Fiji’s Social Democratic Liberal party (Sodelpa) held the balance of power and on Friday voted to form a coalition with Rabuka’s People’s Alliance and the National Federation party.</p> <a href=\"https://www.theguardian.com/world/2022/dec/24/fiji-parliament-confirms-sitiveni-rabuka-as-prime-minister-after-days-of-uncertainty\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/24/fiji-parliament-confirms-sitiveni-rabuka-as-prime-minister-after-days-of-uncertainty", "date_published": "2022-12-24 01:40:17+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Tory Lanez found guilty in Megan Thee Stallion shooting", "description": "<p>Felonies facing  rapper Tory Lanez include assault with a semiautomatic weapon and could lead to up to 22 years in prison</p><p>A Los Angeles jury on Friday found rapper Tory Lanez guilty of three felonies in the 2020 shooting of hip-hop star Megan Thee Stallion that left her wounded with bullet fragments in her feet.</p><p>The jury deliberated for one day before convicting the 30-year-old Canadian rapper, whose legal name is Daystar Peterson, of assault with a semiautomatic firearm, having a loaded, unregistered firearm in a vehicle and discharging a firearm with gross negligence. The counts could lead to up to 22 years in prison.</p> <a href=\"https://www.theguardian.com/music/2022/dec/24/tory-lanez-found-guilty-in-megan-thee-stallion-shooting\">Continue reading...</a>", "link": "https://www.theguardian.com/music/2022/dec/24/tory-lanez-found-guilty-in-megan-thee-stallion-shooting", "date_published": "2022-12-24 00:02:23+00:00", "persistent": false, "user": null, "language": "en-US"}]