[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCsXVk37bltHxD1rDPwtNM8Q", "title": "The Most Horrible Parasite: Brain Eating Amoeba", "description": "https://kgs.link/shop-160\nIf you too want to overcome your existential dread, make your life beautiful and support Kurzgesagt, you can get sciency products made with love in our shop. Thanks so much to everyone who's supporting us.\n\nSources & further reading:\nhttps://sites.google.com/view/sources-brain-eater/\n\nThe Brain Eating Amoeba\nA war has been going on for billions of years that breeds well armed monsters who struggle with other monsters for survival. Having no particular interest in us, most of them are relatively harmless, as our immune systems deal with their weapons handily. But there are exceptions. \nNaegleria fowleri is an amoeba that not only has developed a deadly taste for human brains but is also a match for our defenses and a guest in dramatic headlines. What happens when this monster enters your body?\n\n\nOUR CHANNELS\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nGerman Channel: https://kgs.link/youtubeDE \nSpanish Channel: https://kgs.link/youtubeES \n\n\nHOW CAN YOU SUPPORT US?\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThis is how we make our living and it would be a pleasure if you support us!\n\nGet Merch designed with ❤ https://kgs.link/shop-160  \nJoin the Patreon Bird Army 🐧  https://kgs.link/patreon  \n\n\nDISCUSSIONS & SOCIAL MEDIA\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nReddit:            https://kgs.link/reddit\nInstagram:     https://kgs.link/instagram\nTwitter:           https://kgs.link/twitter\nFacebook:      https://kgs.link/facebook\nDiscord:          https://kgs.link/discord\nNewsletter:    https://kgs.link/newsletter\n\n\nOUR VOICE\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThe Kurzgesagt voice is from \nSteve Taylor:  https://kgs.link/youtube-voice\n\n\nOUR MUSIC ♬♪\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\n700+ minutes of Kurzgesagt Soundtracks by Epic Mountain:\n\nSpotify:            https://kgs.link/music-spotify\nSoundcloud:   https://kgs.link/music-soundcloud\nBandcamp:     https://kgs.link/music-bandcamp\nYoutube:          https://kgs.link/music-youtube\nFacebook:       https://kgs.link/music-facebook\n\nThe Soundtrack of this video:\nSoundcloud: https://bit.ly/3rTlDpB\nBandcamp: https://bit.ly/3Lw1nlB\n\nIf you want to help us caption this video, please send subtitles to subtitle@kurzgesagt.org\nYou can find info on what subtitle files work on YouTube here:\nhttps://support.google.com/youtube/answer/2734698?hl=en-GB&ref_topic=7296214\nThank you!\n\n🐦🐧🐤 PATREON BIRD ARMY 🐤🐧🐦\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nMany Thanks to our wonderful Patreons (from http://kgs.link/patreon) who support us every month and made this video possible:\nMarkus Schaidinger, nanowashere x, Nicholas Bales, Alexis St-Laurent, Roberto, Patrick Rathke, ThatTubaGuy, Michael Henry, Colin Stephens, Cy 'kkm' K'Nelson, Renen Adar, Kurt Steinkraus, erikfahr, Neo Architects, Sanne van Herwijnen, Alex Schumacher, Matt Gutberlet, Jose Barrera, Glenn Hall, Steven Dawson, Vengarth, Michael Patton, ggroggs, Gabriele Vissio, Wilee, Bernt Sietsma, Teddy Toussaint, Kisay, Jayce Collins, leandro, Cassandra Riling, Spencer Czapiewski, su4ns3t, Nicha Traipipattanapong, Eigenverse, Mikakohanpepperoni, Bonku BRB, Swagner, David Wagner, Random Dev, Litten, Luke Felix-Rose, Gabriel Steel", "link": "https://www.youtube.com/watch?v=7OPg-ksxZ4Y", "date_published": "2022-05-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]