[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Maryam Mursal - studio session, 2015 (audio only)", "description": "Maryam Mursal was a rising star in her native Somalia before civil war forced her to leave her homeland and find sanctuary in Denmark. Although she currently lives in the U.K., Mursal plans to return to live in the nation that welcomed her. \"I will never forget Denmark,\" she says. \"I'm Black Danish.\"\n\nMursal has not forgotten Somalia, either. In town as part of a residency at the Cedar Cultural Center in Minneapolis, Mursal and her band stopped by The Current's studio for a session hosted by Mark Wheat.\n\nMursal's residency is part of an ongoing program at the Cedar called Midnimo. According to Mohamed Samatar, a development assistant at the Cedar, \"Midnimo\" means \"Unity\" in the Somali language. \"It's a program reviving Somali culture and music,\" he explains. \"The way we do that is bring Somali icons to come and do week-long residencies that incorporate educational programs, public workshops and a final performance.\"\n\nSamatar says Mursal's workshop with 40 Somali women from Minneapolis was particularly successful. \"They shared stories with her and she shared her story with them,\" Samatar says. \"It was a powerful experience for [all] of them because they never heard her side of the story and, being refugees, it brought back a lot of memories.\"\n\nThe residency concluded with a live concert by Mursal on November 14, 2015, at The Cedar Cultural Center. Mursal cherished sharing her music with Somali youth who may never have seen her perform.\n\nAudiences can expect a performance that features Somali sounds as well as numerous Western influences; Mursal cites Ray Charles, Etta James, Elvis Presley and Bob Marley among the Western artists who inspired her, although her favorite may be Peter Gabriel. Mursal credits Gabriel for getting her signed to Real World Records.\n\n\"Peter Gabriel is someone who is dear to her heart,\" Samatar interprets on behalf of Mursal, \"and is the most kind human she has met.\"\n\nListen to the complete interview and the song performances above.\n\nSongs Played:\n00:00 \"Lei Lei\" (I Feel Alone)\n04:05 Interview segment 1 with host Mark Wheat\n06:47 \"Waaw\"\n12:50 Interview segment 2 with host Mark Wheat\n16:46 \"Sodewou\" (Welcome)\n\nFind more:\nMaryam Mursal perform in The Current studio:\nhttps://www.thecurrent.org/feature/2015/11/13/maryan-mursal-shares-somali-culture-through-stories-and-music\nMaryam Mursal - \"Lei Lei [I Feel Alone]\" (Live at The Current, VR/360 Video):\nhttps://www.youtube.com/watch?v=AHuOnXeU6-g\n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent?sub_confirmation=1\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/\nhttps://twitter.com/TheCurrent\nhttps://www.instagram.com/thecurrent/\n\n#maryammursal #maryanmursal #thecurrentsessions", "link": "https://www.youtube.com/watch?v=Um3z3sfgXYM", "date_published": "2022-05-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]