[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Fireboy DML: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nLaTesha Harris | March 3, 2022\nDearly beloved: we are gathered here today to get through this thing called \"Afro-life.\" Surrounded by lush greenery and soft lavender lighting, Fireboy DML makes his Tiny Desk (home) concert debut from Lagos, Nigeria. The Nigerian singer-songwriter delivers the three-song set with an earnest reverence – his warm vocals reflecting a depth of passion and devotion best attributed to being brought up in a church choir.\n\nFireboy DML describes his wide-ranging sound – a fusion of R&B, Afrobeats, pop and alté (Nigeria's alternative scene) – as \"Afro-life.\" This ambient, feel-good experimentation emerged in 2018 with his breakout single, \"Jealous.\" He went on to drop his debut album, Laughter, Tears and Goosebumps, in 2019 and his sophomore album Apollo in 2020. A member of YBNL Nation, a record label founded by Nigerian rapper Olamide, Fireboy DML is pushing the vanguard of Afropop alongside contemporaries like Rema, Joeboy and Oxlade. His third album, Playboy, is forthcoming.\n\nSET LIST\n\"Like I Do\"\n\"Tattoo\"\n\"Peru\"\n\nMUSICIANS\nFireboy DML: vocals\nVibe Kings (backing band)\nBest Amakhian: guitar\nFemi Jacobs Isaac: keyboard\nEbenezar Olayinka: drums\nJulius Olabiyi: trumpet\nAyodele Olusegun: bass\n\nCREDITS\nVideo: Greene 'Abula' Abdulazeez, Bolaji Kareem, Tina Jaiyesinmi, Eniola Awode\nAudio: Glitch Africa, Don Zenith, Kenechi Raphael, Sifon Alphonsus\nProducer: Ladi Sodimu\nAssistant Producer: Adenugba Kelvin\nEditor, Colorist: Greene \"Abula\" Abdulazeez\nLocation Manager: Yusuf Ganiy\nCamera assistant: Demylade Olurombi, Oresajo Opeyemi\nGaffer: Folorunsho Olagunju\nProduction company: The Greenade Company\n\nTINY DESK TEAM\nProducer: Abby O'Neill\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Joshua Bryant, Maia Stern, Ashley Pointer\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #fireboy", "link": "https://www.youtube.com/watch?v=NjwA9i_o3pU", "date_published": "2022-03-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]