[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Modern Warfare 2 Preview - Bigger, Smaller, & Less Controversial", "description": "We went down to LA for a lengthy briefing on the features of the upcoming Modern Warfare 2, as well as played several maps and modes. Today we’re going to go over the briefing and can talk about hands-on impressions at a future date. We’ll have a larger written preview by Summer Doster that goes into even more granular detail. Modern Warfare 2 releases on October 28, with an open beta before launch. Infinity Ward paid for GameSpot to attend this preview event. Also please note that all gameplay in this video is from older Call of Duty titles like Modern Warfare (2019) and Cold War.\n\nModern Warfare 2 has both bigger and smaller multiplayer modes, with a campaign focused on reliving the greatest hits, like All Ghillied Up, using new twists. Ground War is now just one part of the Battle Maps mode. That means more purpose-built maps that are very much for mil-sim Call Of Duty players who loved the larger open-level design of Modern Warfare 2019. \n\nCore multiplayer, from what we saw, consists of smaller and more straightforward 6v6 competitive modes, like Knockout and Prisoner Rescue, that will appeal to more classic fast-paced Cold War fans in both map design and aesthetics. We know there will be a Spec-Ops mode, but we didn’t hear any details about it, except it will lean more towards the linear scenarios of the original MW2. When it comes to Warzone, we finally got an answer, and yes, the next Warzone will be a clean start coming soon after Modern Warfare 2's launch. It is separate from the current version of Warzone. In general, weapon customization seems as robust as in MW 2019, with categories of weapons that evolve into other roles as you go through the unlock tree. Perks are now grouped into packages, where you pick two to start with and earn the rest during a match, similar to MW 2019’s specialist option in multiplayer. \n\nThe biggest tech focus in Modern Warfare 2 is water as a movement and escape mechanic. Players can dive and swim into bodies of water, with the water becoming murkier the deeper you go. Ballistics are also impacted by water. Equipment will keep up the sandbox design of Modern Warfare 2019 with things like Cameras, Drill Charges, and Inflatable Dummies. Much of the gear also has alternate water modes. Movement both on foot and in vehicles has been improved. Vehicles, in particular, can now have bumpers ripped off or tires blown out and players, even drivers, can lean out or jump on the roofs of vehicles while they're moving.", "link": "https://www.youtube.com/watch?v=CKVRrHDpsb8", "date_published": "2022-06-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Modern Warfare II - Official Reveal Trailer", "description": "Check out the worldwide reveal for Call of Duty Modern Warfare 2. Call of Duty: Modern Warfare II, the sequel to 2019’s Modern Warfare, which will showcase the most innovative Call of Duty to date. Fight alongside Task Force 141 in a globe-trotting single-player campaign, play solo or rally with your team in immersive multiplayer combat, with new locales and ways to play. Experience an evolved Special Ops game mode featuring tactical co-op gameplay. \n\nAdditionally look forward to Call of Duty: Warzone 2.0 releasing this year. Expect a massive calendar of free content post-launch featuring evolving gameplay with new maps, modes, seasonal events, community celebrations and more. \n\n#CallofDuty #CoD #Modernwarfare2", "link": "https://www.youtube.com/watch?v=hCY08h5UQVw", "date_published": "2022-06-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mario Strikers: Battle League Review", "description": "Mario Strikers: Battle League may be the most mechanically dense Mario sports game I've played. The latest Mushroom Kingdom spin on soccer looks to take the sport seriously, allowing you to juggle passes, tackle, dodge, and cancel moves as the situation demands, even before factoring in its uniquely silly Mario twists.", "link": "https://www.youtube.com/watch?v=PP5AoL9C5r8", "date_published": "2022-06-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Netflix Geeked Week - Day 3 Livestream | Animation Showcase, Cyberpunk: Edgerunners", "description": "It's Netflix's Geeked Week, a celebration and showcase of all things geeked coming from Netflix. Day 3 includes the Animation Showcase, An inside look at Cyberpunk: Edgerunners, and more.", "link": "https://www.youtube.com/watch?v=3DE8dqvzvW0", "date_published": "2022-06-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Hideo Kojima Horror Game Leaked | GameSpot News", "description": "A new Hideo Kojima horror game has reportedly leaked, Layers Of Fear dev teases a new game as Silent Hill rumors run rampant, and Phil Spencer plays Banjo-Kazooie and fans begin to speculate.\n\nDeath Stranding director Hideo Kojima's next game is reportedly a horror title called Overdose that could feature Margaret Qualley who played Mama in Death Stranding. The leak comes from Tom Henderson for Try Hard Guides, who claim to have seen \"early footage\" of Overdose which shows actress Margaret Qualley in a blue dress. It's no secret that Kojima is working on something, but whether or not it's a new horror game or Death Stranding 2 is unofficial.\n\nKojima's plans for Silent Hill may be lost, but the Silent Hill franchise continues to live on in the rumor mill. Horror-centric developers Bloober Team, makers of Layers of Fear, Blair Witch, and The Medium, has released a teaser for a new project, one that alludes to a new Layers of Fear - after all, it was posted from the Layers of Fear 2 official Twitter account. However, that teaser comes amidst ongoing rumors that Bloober Team may also be working on a Silent Hill game in collaboration with Konami. \n\nXbox head Phil Spencer was caught playing Banjo-Kazooie recently, and the result has fans thinking it's a tease for an upcoming announcement of a new Banjo-Kazooie. According to Phil Spencer's Xbox activity, which can be tracked using xboxgamertag.com, P3, or Phil Spencer, showed he was playing the classic platformer just five days ago for a total of 37 minutes - just enough time to unlock a single achievement. However, he hasn't touched it since then. Instead he's been busy with the Elden Ring and Ninja Gaiden. Maybe Banjo-Kazooie wasn't hard enough for him. Still, the rumor mill has swirled regardless.\n\nBattlefield 2042 Hands-On Preview: https://youtu.be/xeaZf2ew-bM\n\n00:00 - Intro\n00:11 - Kojima Horror Game Leaked\n01:41 - Layer of Fear Dev Tease New Game\n02:51 - Phil Spencer Plays Banjo Kazooie, Fans Start To Speculate\n04:12 - Battlefield 2042 Season One Preview Coverage\n04:26 - Outro", "link": "https://www.youtube.com/watch?v=nRufbGkHdxs", "date_published": "2022-06-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Stray Preview", "description": "Jordan Ramée had the chance to attend a preview of Stray. In it, he got to see more utter cuteness from Stray's protagonist cat, with Blue Twelve Studio producer Swann Martin-Raget showcasing the cyberpunk themed world of Stray. Players will be able to control Stray's cat as you traverse through platform puzzles, escape from baddies, and attempt to discover the strange humanoid robotic story behind the game.\n\nStray is set to launch for PS5, PS4, and PC on July 19. The PlayStation versions of the game will be available day one on PlayStation Plus via the subscription service's two highest paid tiers.", "link": "https://www.youtube.com/watch?v=aaeE45dHGck", "date_published": "2022-06-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Quarry Review", "description": "The Quarry picks up where Until Dawn left off, introducing another group of personable teens you'll attempt to keep alive. Or not.", "link": "https://www.youtube.com/watch?v=NgOuUN6QoCc", "date_published": "2022-06-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Season 1 Hands-on Preview: Addition By Subtraction", "description": "Developer DICE adds a new map, a new specialist, new vehicles, and new weapons in Battlefield 2042's first season, along with adjustments in approach.\n\nZero Hour launches for all players on June 9, but GameSpot got a chance to spend a couple of hours playing with some of its new content additions during a preview event this week. That session put us on Exposure, the new map coming to Battlefield 2042 available to all players. Exposure feels like it sets a different tone from some of BF 2042's other maps, with a host of differing locations and a focus on verticality that goes beyond what we've previously seen in the game.\n\nWe played both Breakthrough and Conquest on Exposure, with the former mode using a smaller portion of the map and confining its player count to 64. The smaller Breakthrough approach is reflective of one of BF 2042's biggest changes going forward. DICE is \"unshackling\" its All-Out Warfare modes from its previous 128-player count, and will instead be focusing on somewhat smaller maps with more cover and density with seasonal releases going forward. You'll still find 128-player modes on original launch maps and Exposure offers 128-player Conquest, but starting in Season 2, new maps will stop supporting 128-player modes and top out at 64 players.\n\nDICE is adding a new specialist character in Season 1: anti-vehicle engineer Lis. The character is especially good at taking down airborn threats, it seems, with Lis sporting a tele-guided missile launcher--which means you control the missile and fly it into your target. Helicopters might sport radar-breaking stealth, but if you're using Lis, you can use her launcher to bypass the need for any smart tracking and do the aiming yourself.\n\nAdding some new variety for the rest of Season 1 are two new weapons and a new gadget to help spice up some loadouts. DICE is adding a new designated marksman rifle called the BSV-M, which is like having a sniper rifle that can also handle close combat. The gun comes with an integrated suppressor, to keep the noise down and make you tougher for enemies to find as you fight, along with single-fire and fully automatic firing modes. Even more fun than the BSV-M, though, is the new Ghostmaker Crossbow. The single-firing bow has a surprisingly long range, keeping it effective at a variety of distances, and it's nearly silent. At closer ranges, it'll generally earn you a one-hit kill--provided you actually hit what you're shooting at. Miss, and you'll suffer through a painfully long reload animation that leaves you extremely open to getting blasted by any faster-firing weapon. But if you land the hit, the crossbow is incredibly satisfying, and can even be effective at longer ranges, even though you'll have to land two or three shots to win a fight.\n\n#BF2042 #battlefield2042", "link": "https://www.youtube.com/watch?v=xeaZf2ew-bM", "date_published": "2022-06-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Zero Hour Season 1 Gameplay Trailer", "description": "Check out Battlefield 2042's first season Zero Hour in this latest gameplay trailer. Get a glimpse of what to expect!\n\nBattlefield 2042 is a first-person shooter made up of three distinct multiplayer experiences. All-Out Warfare features the next generation of fan-favorite modes Conquest and Breakthrough; Battlefield Portal allowing players to discover battles from the past, present, and future as well as to create and change the rules of war, while Battlefield Hazard Zone brings a tense, squad-focused survival experience. Adapt and overcome on dynamically-changing battlegrounds with the help of your squad and a cutting-edge arsenal, and prepare for unprecedented scale with up to 128 players*.\n\n#battlefield2042 #bf2042", "link": "https://www.youtube.com/watch?v=qUbOK2IJHak", "date_published": "2022-06-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Hollow Knight Fans React To Silksong Speculation | GameSpot News", "description": "Hollow Knight fans react to new Silksong speculation, Geoff Keighley reveals more about Summer Game Fest, Microsoft announces Xbox Showcase Extended and Goldeneye 007 Remastered achievements leak again. \n#GamingNews #Silksong #summergamefest \n\nDuring a recent Twitter Spaces discussion, Keighly confirmed the show will have \"a couple\" new game announcements, but it will be more focused on games that have already been announced. \n\nKeighley said people can expect to see games like The Callisto Protocol, Call of Duty: Modern Warfare 2, Gotham Knights, and Cuphead: The Delicious Last Course during the event, while Dwayne \"The Rock\" Johnson will be there as well for some kind of announcement.\n\nHollow Knight fans have their fingers crossed tight following a couple tweets today. It all began when Geoff Keighly tweeted, “There’s nothing like the feeling of seeing a good world premiere arrive in your inbox.\" Matthew Griffin, a member of Team Cherry's marketing and publishing team, replied to the tweet, saying \"I approve of the tease =P\".\n\n20 Questions With Geoff Keighley - https://www.youtube.com/watch?v=zNsWYBuQWmg\n\nVGC first reported that Wario64, who frequently tweets video game sales and bargains, spotted achievements for Goldeneye 007 on Xbox servers this past Sunday. This is not the first time that a potential Goldeneye remaster's achievements have leaked, nor Wario64's first time leaking its existence. Back in January, they leaked the exact same achievements, which can still be found on TrueAchievements.\n\nSTAMPS\n00:00 - INTRO\n00:06 - Summer Game Fest Info\n00:45 - Silksong Speculation\n01:38 - Xbox Showcase Extended\n02:27 - Goldeneye 007 achievements", "link": "https://www.youtube.com/watch?v=T2-xi21UjGs", "date_published": "2022-06-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Most Memorable E3 Moments", "description": "The eve of Summer Game Fest is upon us. Yet there is one former gaming event giant that won’t be part of the festivities this year… E3. The Electronic Gaming Expo sadly announced it was canceling its 2022 event, leaving us with only our memories. Yet, E3 has given us numerous memorable moments and memes from its two decades of history, so today we’re shouting out some of our favorites, from the breathtaking Keanu Reeves to the cringiest PlayStation moments.\n\nTimecodes\n0:00 - Intro\n0:37 - PlayStation 3 Price Announcement\n1:54 - Sony Dunks on Microsoft\n3:11 - Keanu Reeves's Breathtaking Moment\n4:08 - Peter Moore's GTAIV Tattoo\n4:57 - Unisoft's Battle Tag Cringe\n5:55 - Konami's Embarrassing Conference\n7:15 - Wii Music Performance\n8:12 - Zelda Skyward Sword Fail\n9:16 - Miyamoto Makes a Developer Cry\n10:10 - Outro\n\n#E3 #SGF2022", "link": "https://www.youtube.com/watch?v=a1EGyHI12nY", "date_published": "2022-06-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Netflix Geeked Week - Day 2 Livestream | Film Showcase, The Gray Man & The School for Good & Evil", "description": "It's Netflix's Geeked Week, a celebration and showcase of all things geeked coming from Netflix. Day 2 includes the Film Showcase, The Gray Man, The School for Good & Evil, and more.", "link": "https://www.youtube.com/watch?v=7QNt8Z-dYb8", "date_published": "2022-06-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sonic Central Full Presentation (June 2022)", "description": "Check out the latest Sonic Central that aired on June 7th showcasing Knuckles for the first time in Sonic Frontiers. Also hear from the voice of Sonic as they tease the Blue Ray release for the latest Sonic movie. Additionally get a look at Sonic Origins as well before the release later this month.\n\n#Sonic #sonicthehedgehog #Gaming", "link": "https://www.youtube.com/watch?v=oQYIycgGFu8", "date_published": "2022-06-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sonic Central Livestream Summer 2022", "description": "Tune in on June 7th at 9am PDT for a sneak peek at some of the upcoming projects, partnerships, and events happening in 2022 for the blue hedgehog in this latest Sonic Central Summer Showcase.\n\nWill we learn more about Sonic Frontiers, Sonic Origins, and other news? \n\n#Sonic #sonicthehedgehog #gaming", "link": "https://www.youtube.com/watch?v=1v8PR2MfiHQ", "date_published": "2022-06-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]