[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Naira Marley: Tiny Desk (Home) Concert", "description": "This year, NPR Music is celebrating Black Music Month with an array of brand new Tiny Desk concerts — both from home and from behind our beloved Desk. Together, these artists represent the past, present and future of Black music. This month of carefully curated shows is a celebration of Black artists expressing themselves in ways we've never seen before, and of the Tiny Desk's unique way of showcasing that talent.\n\nSuraya Mohamad | June 8, 2022\nBritish-Nigerian pop star Naira Marley opens his set with a sly smile and softly says “Marlians,” the name for his stans, a loyal group of followers who call Marley their president. Then, the first song kicks right in with a bouncy dance beat that just might get you dancing, wherever you are. \n\nIt’s OK that you might not know what Marley is actually speaking about. His casual rapping style, defined by lexical tones in the Yoruba language, is enough. The first song, “Ayewada,” means “where is the time and space” and has an English language line: “They are calling you thief / You are dancing wit de goat.” \n\nMarley is one of the greatest and most celebrated artists performing and producing in the Afrobeat scene today. He just released his debut album, God’s Timing’s the Best, on his own label. All songs performed here are from that new record, except the third song, “Soapy, '' which is a hit single from 2019. \n\nHis Marlian Records label has been producing and developing many rising Afropop stars, including Zinoleesky, a singer, songwriter and performer who performs on his own and is featured here on the last two songs of this set. Keep an eye out for him as he is sure to be another big name in the Afrobeat world.\n\nSET LIST\n“Ayewada”\n“Soapy”\n“O’dun” (feat. Zinoleesky) \n“Montego Bay”\n\nMUSICIANS\nNaira Marley: vocals\nUbiene Orowo Precious: keyboards\nOgueji Kenneth Uchenna: guitar\nStanley Unogu Amanze: drums\nRexxie Chisom Ezeh: keyboards\nElizabeth Famuyiwa: vocals\nZinoleesky: vocals\n\nCREDITS\nVideo: Eluma Munachisom, Omobonike Olofin\nAudio: Elisha Olanrewaju aka Audioboy, Tayo Akinyemi \n\nTINY DESK TEAM\nProducer: Abby O’Neill\nVideo Producer: Joshua Bryant\nAudio Mastering: Josh Rogosin\nAnimator: Kaz Fantone\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Michael Zamora, Maia Stern, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #tinydeskconcert #nairamarley", "link": "https://www.youtube.com/watch?v=kZ4C3xNMyI0", "date_published": "2022-06-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Life after Desk: Catching up with 2016 Tiny Desk Contest winner Gaelynn Lea", "description": "The eight winners of the Tiny Desk Contest — our annual search for a great unsigned artist to play a Tiny Desk concert — have all gone on to do great things, from performing on world tours to winning Grammy Awards. Today, we're taking a moment to highlight one of these artists: the beloved Gaelynn Lea, winner of our 2016 Contest. The Duluth, Minn., native won with a video of her song \"Someday We'll Linger In The Sun,\" which she recorded on her phone in the space where she taught fiddle lessons. Gaelynn Lea makes music unlike anyone else. Her beautiful folk melodies are often rooted in the sounds of Irish fiddle tunes. She also has brittle bone disease, which makes it necessary for her to play her instrument in an inventive and unique style.\n\n\"The Contest definitely changed my life,\" Lea told NPR Music last year. Since winning, she's toured the world and co-founded a coalition that amplifies disability culture in the music industry. She's also writing a book. Most recently, she wrote music for the Broadway adaptation of Macbeth – the director of the play first discovered her music from her Tiny Desk concert – which she hopes will help bring disability culture into the mainstream. \"Celebrating disability, rather than just accommodating it, is the next step in the journey to really valuing diversity,\" she says.\n\nNPR's Tiny Desk video team recently met with our 2016 Contest winner during production on Macbeth to hear about her journey from the Tiny Desk to Broadway. We're proud to share that video here today.", "link": "https://www.youtube.com/watch?v=ZWIFNGClc20", "date_published": "2022-06-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]