[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCsXVk37bltHxD1rDPwtNM8Q", "title": "Change Your Life – One Tiny Step at a Time", "description": "Change Your Life – One Tiny Step at a Time\nGet your Habit Journal here: https://kgs.link/shop-162\n\nSources & further reading:\nhttps://sites.google.com/view/sources-change/\n\nIf you are like most people, there is a gap between the person you are and the person you wish to be. There are little things you think you should do and big things you ought to achieve.\nFrom working out regularly, eating healthy, learning a language, working on your novel, reading more or simply actually doing your hobby instead of browsing reddit.\nBut it can seem that to achieve your goals, you have to become a different person. Someone who is consistent, puts in more effort, has discipline and willpower. Maybe you have tried your hardest to be like that. And it worked! For a while. Until you find yourself slipping back into your old ways. In the end, you always seem to fail. And with every failed attempt, you become more and more frustrated and annoyed with yourself. \nIf you believe “success and hustle” internet, it is all your own fault: if you don't succeed, you just didn’t want it enough and the failure is all you. But change is actually hard. But as with most things in life, understanding why makes things easier. \n\n\nOUR CHANNELS\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nGerman:        https://kgs.link/youtubeDE\nSpanish:        https://kgs.link/youtubeES\nFrench:          https://kgs.link/youtubeFR\nPortuguese:  https://kgs.link/youtubePT\nArabic:           https://kgs.link/youtubeAR\nHindi:             https://kgs.link/youtubeHI\nJapanese:     https://kgs.link/youtubeJA\nKorean:          https://kgs.link/youtubeKO\n\n\nHOW CAN YOU SUPPORT US?\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThis is how we make our living and it would be a pleasure if you support us!\n\nGet Merch designed with ❤ https://kgs.link/shop-162  \nJoin the Patreon Bird Army 🐧  https://kgs.link/patreon  \n\n\nDISCUSSIONS & SOCIAL MEDIA\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nReddit:            https://kgs.link/reddit\nInstagram:     https://kgs.link/instagram\nTwitter:           https://kgs.link/twitter\nFacebook:      https://kgs.link/facebook\nDiscord:          https://kgs.link/discord\nNewsletter:    https://kgs.link/newsletter\n\n\nOUR VOICE\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThe Kurzgesagt voice is from \nSteve Taylor:  https://kgs.link/youtube-voice\n\n\nOUR MUSIC ♬♪\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\n700+ minutes of Kurzgesagt Soundtracks by Epic Mountain:\n\nSpotify:            https://kgs.link/music-spotify\nSoundcloud:   https://kgs.link/music-soundcloud\nBandcamp:     https://kgs.link/music-bandcamp\nYoutube:          https://kgs.link/music-youtube\nFacebook:       https://kgs.link/music-facebook\n\nThe Soundtrack of this video:\nSoundcloud: https://bit.ly/3MeaN4M\nBandcamp: https://bit.ly/3as6FB9\n\nIf you want to help us caption this video, please send subtitles to subtitle@kurzgesagt.org\nYou can find info on what subtitle files work on YouTube here:\nhttps://support.google.com/youtube/answer/2734698?hl=en-GB&amp;ref_topic=7296214\nThank you!\n\n🐦🐧🐤 PATREON BIRD ARMY 🐤🐧🐦\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nMany Thanks to our wonderful Patreons (from http://kgs.link/patreon) who support us every month and made this video possible:\nziipzaaapM16A4, Filippo, Alloy robot, Harold Mabin Jr, Toby Lowe, BiohazardVictim, Riad Salihu, Gunnstein Lye, Jeff Wheeldon, Andy Kelly, Quenby Joanette, Daniel Schulte-Hillen, Val Kabalkin, Maximilian Thomas Goldstein, Tyler Lindberg, Felix, Davesanify, Russ Newman, Kira, Thomas Schenck, Skyler Stanley, dirk from wellington, LoveGiants (Polyamorous) Seeking 4 BrotherHusbands, BalrogWing, Coffee is the path to victory, Addie, Lucas, vb, Santiago Perez, Robert Walsh, Angus Jake Smith, JamesDBartlett3, Marlison Gosalvez de Alencar, Rahul Golwalkar, Keerthi Vasan, Brian Bradley, Lincoln Volk, Haubrechts, Avalanche, Craig B, Tina Hatch, Nathan Ornat, Amathara, khalifa almehairbi, jtfletchbot, Steven Zeck, Maurice Ibler, Bafy78, Andreas Høve Smidt-Nielsen, Victoria Camp, Andrew Dawson, pierluigi valente, GH, Jay C, Sergey Melnik, CultistLemming, Thane Stevens, Alex MacKay, SimpleAvocado, Dave Kircher, Karen Rosenow, James Pita, Kyron", "link": "https://www.youtube.com/watch?v=75d_29QWELk", "date_published": "2022-06-07 14:00:05+00:00", "persistent": false, "user": null, "language": "en-US"}]