[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To ARMA Reforger’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of ARMA Reforger, including the Beretta M9, the PKM and the LAW M73.\n\n00:00 - Opening\n00:41 - M16 A2\n05:05 - Beretta M9\n06:44 - M21 Sniper Weapons System\n08:32 - M249\n10:06 - PKM\n13:06 - M60\n15:31 - AK 74\n17:22 - LAW M73\n18:54 - SVD\n20:02 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of ARMA Reforger  and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020", "link": "https://www.youtube.com/watch?v=NAgyOYepCSE", "date_published": "2022-06-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "A Plague Tale: Requiem - Hands On Impressions", "description": "Jean-Luc had the chance to check out the Tribeca demo for A Plague Tale: Requiem. While a lot of the new gameplay additions feel familiar, the story seems to be moving in an interesting direction. The group comes together to talk about his hands on impressions of A Plague Tale: Requiem.\n\nA Plague Tale: Requiem takes place six months after A Plague Tale: Innocence, the sequel follows Amicia and Hugo as they travel south in hope of discovering a mysterious island that could hold the key to saving Hugo from his illness.\n\nA Plague Tale: Requiem will be release on October 18th on PlayStation 5, Xbox Series X and Series S, Nintendo Switch, and PC.\n\n#plaguetale #gaming", "link": "https://www.youtube.com/watch?v=BFFoJPi_g5k", "date_published": "2022-06-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Developer’s Next Game Is Almost Finished | GameSpot News", "description": "FromSoftware is almost done with its new game, Assassin’s Creed developer reveals the horses are actually twisted humans and Halo Master Chief Collection cosmetic Microtransactions being explored by 343.\n#GamingNews #EldenRing #Halo\n\nFromSoftware's Hidetaka Miyazaki revealed in an interview with 4Gamer that an unannounced project is in the final stages of development. This project is described as a more abstract fantasy that uses ideas that don't quite fit into the usual Souls-like adventure template. But regardless of what is being worked on, Elden Ring will still continue to receive support in the future, although Miyazaki mentioned that he wasn't ready to reveal what fans could expect to see next.\n\nFormer Ubisoft developer Charles Randall tweeted, \"The horse in AC1 was just a twisted f***ed-up human skeleton because our tool chain only worked with biped in 3ds max. Cheers to the amazing animators and riggers that managed to make that guy look like a horse!\" Randall also revealed that for the character of Malik, who only had one arm, Ubisoft didn't have the budget for a custom skeleton so the solution was to turn his extra limb inside out and push it up into his abdomen.\n\n343 Industries has confirmed that it is exploring the idea of adding microtransactions to Halo: The Master Chief Collection. In an update on the Waypoint site, community writer Alex Wakeford explained that 343 will be renaming Season Points as Spartan Points and is looking into adding a new form of microtransactions.\n\nSTAMPS\n00:00 - Intro\n00:07 - Elden Ring / From Software\n01:09 - Assassin’s Creed\n02:13 - Halo", "link": "https://www.youtube.com/watch?v=zqChi1gTKM8", "date_published": "2022-06-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "GameSpot After Dark Episode 150 - Decisions Of Mass Destruction", "description": "It's After Dark's first live episode! This week Jean-Luc got early hands-on with A Plague Tale: Requiem, everyone is loving Neon White, and we decide what single game would cause the most damage if it was erased from existence. \n\nVisit https://store.gamespot.com/ to pre-order a Keigh3 2022 limited edition t-shirt.\n\nJoin the GameSpot Discord: https://discord.gg/njS4cRUvbY", "link": "https://www.youtube.com/watch?v=iLnxS6eZdLw", "date_published": "2022-06-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo’s Effect On Coheed & Cambria’s Claudio Sanchez", "description": "Coheed & Cambria Frontman, Claudio Sanchez talks about how games like Halo: Combat Evolved, Double Dragon, Tetris and Elden Ring influenced him creatively throughout the years. \n\nBe sure to check out their new album, Vaxis II: Window of the Waking Mind, as well as their tour dates here: https://www.coheedandcambria.com/\n\n#gaming #coheedandcambria", "link": "https://www.youtube.com/watch?v=AwA3I34d63o", "date_published": "2022-06-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]