[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Monica: Tiny Desk (Home) Concert", "description": "This year, NPR Music is celebrating Black Music Month with an array of brand new Tiny Desk concerts — both from home and from behind our beloved Desk. Together, these artists represent the past, present and future of Black music. This month of carefully curated shows is a celebration of Black artists expressing themselves in ways we've never seen before, and of the Tiny Desk's unique way of showcasing that talent.\n\nMitra I. Arthur | June 24, 2022\nIt's only right to think \"New Monica!\" when her Tiny Desk (home) concert begins. Surrounded by candlelight, dressed in pink, Monica stands ready to deliver a vibrant vocal masterclass.\n\nWith her rich alto, Monica broke onto the music landscape in 1995 with her debut album, Miss Thang. In her class of '90s artists, the singer brought a mature sound, yet still tempered by youth, that made her relatable to audiences of any age who were growing into their own. Monica's albums are grounded in the here and now, the ups and the downs of life and love. For fans, she feels like a longtime friend to root for, not only for her talent, but because her realness is valued — an energy she brings to this performance.\n\nHere Monica and her musicians strip down 2003's \"So Gone,\" allowing a mellow, acoustic guitar to shine alongside the vocals. She shows us that when it comes to any #SoGoneChallenges, the viral challenge that had artists putting their own spin on the song, her original still reigns supreme. She also gives us a teaser of her upcoming single, the collaboration with Ty Dolla $ign \"Friends,\" on which Monica presents a tale of a relationship that doesn't require understanding from anyone on the outside, her soaring and acrobatic voice bending over a declaration of love. And when Monica revisits singles from her debut album, \"Why I Love You So Much\" and \"Before You Walk Out of My Life,\" in her Tiny Desk (home) concert they resonate on a different, and perhaps deeper, level now.\n\nSET LIST\n\"Angel of Mine\"\n\"Love All Over Me\"\n\"Why I Love You So Much\"\n\"So Gone\" \n\"Friends\" \n\"Before You Walk Out of My Life\" \n\nMUSICIANS\nMonica: vocals \nPriestly Johnson: vocals\nAshley Minnieweather: vocals\nAlexis McKinnon: vocals \nHerman \"P-Nut\" Johnson: drums \nRuben Royster: bass\nAdrian Forbes: keys\nDave Maiorino: guitar\n\nCREDITS\nExecutive Producers: Monica, Melinda Dancil \nAssociate Producer: Maurio Jackson \nProduction Coordinator: Rolanje Armstead \nCreative Director: Daniel \"Baby Yu\" Nakayama \nSet Designer: Akeem Clayton Designs\nLive Audio/Recording Engineer: Joseph Spencer III \nLive Audio/Recording Engineer: Tech: Ricky William Horton \nDirector: JT Colston \nDirector Of Photography: Sam Aldrich \nDigital Photography: Cyndi Brown \nCamera Operator: Tara Diiorio\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Michael Zamora\nAudio Mastering: Josh Rogosin\nAnimator: Kaz Fantone\nTiny Production Team: Bob Boilen, Kara Frame, Joshua Bryant, Maia Stern, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #monica #BMM", "link": "https://www.youtube.com/watch?v=jJ2rPTG1G9U", "date_published": "2022-06-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]