[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Breaks Down the Desert Eagle - Loadout Extended Chat", "description": "The Desert Eagle has appeared in hundreds of movies and games, but has never found much of a home among serious users in the real world. Is there any practical use for such a mammoth handgun, why is it so big, and what makes the Desert Eagle unique among handguns? (Presented by PUBG MOBILE)\n\nIn this episode of Loadout, Dave Jewitt visits the Royal Armouries to talk to Keeper of Firearms & Artillery Jonathan Ferguson to break down the intricate and unique interior of the Desert Eagle.\n\nYou can check out more episodes of Loadout right here. - https://www.youtube.com/watch?v=yzSrmGkpWKk&list=PLpg6WLs8kxGMzIemU1gyyLmg5VlKI2UvC\n\nYou can check out our Firearms Expert Reacts series here. - https://www.youtube.com/watch?v=5FVzcoRjoN4&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/", "link": "https://www.youtube.com/watch?v=gtVhAmosXls", "date_published": "2022-01-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "15 Things I Wish I Knew Before Starting Pokémon Legends: Arceus", "description": "Pokémon Legends: Arceus brings a bunch of changes to the typical Pokémon formula which means there's a lot to unpack and relearn! If you're just starting out on your new Pokémon adventure and don't know what heavy balls do, how alpha Pokémon work, or the best way to catch 'em all, check out this ultimate beginners guide!\n\n\nPokémon: Legends Arceus is not a typical Pokémon game, at least the way we’ve come to understand them. Nintendo’s latest mainline release for the franchise has flipped the formula players may have expected, and the result is a Pokémon game with a lot of new things to learn and discover. This video breaks down several important tips, perfect for the new Pokémon trainer starting their journey. \n\nFirst, we dive into battling tips, including the new “Agile” and “Strong” mechanics and how they can be  tactically utilized depending on your goals. For example, if you want to weaken a Pokémon, some Agile moves may let you strike first and throw a Powerball all in the same sequence before your opponent can even attack. \n\nWe also look at different ways players can use the new mechanics in the game, such as riding Pokémon to reach areas previously inaccessible, or by being more aggressive during Noble Pokémon fights without fear of losing save progress or items upon failure. \n\nThere are a lot of subtleties and distinct new changes in Pokémon Legends: Arceus, and we’ve got plenty of more cool videos cooking up for all of you soon, so be sure to subscribe to GameSpot and like this video if you found any of these tips helpful. Until next time!", "link": "https://www.youtube.com/watch?v=QaWK6-S0esI", "date_published": "2022-01-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To MORE Rising Storm 2: Vietnam Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of the Rising Storm 2: Vietnam, including the iconic Ithaca 37 shotgun, the Australian Owen Gun, and the SKS semi-automatic rifle.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down more of the guns from Rising Storm 2: Vietnam and compares them to their real-life counterparts.\n\nThe first Rising Storm 2 episode is here - https://www.youtube.com/watch?v=o0m9NLPEncc\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=QvGivhjVUAA", "date_published": "2022-01-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Legends: Arceus Reveals This Interesting Fact | GameSpot News", "description": "In today’s episode of GameSpot News, DeVante talks about an interesting fact that was confirmed in Pokémon Legends: Arceus, how Elden Ring should be easier to beat, and more. \n\nPokemon Legends: Arceus is out now, and a snippet of new Pokemon lore revealed in Arceus has set gaming Reddit ablaze. Supposedly, Pokemon themselves \"possess the odd power to shrink themselves down,\" and that's how they fit into the Poke Balls.\n\nLater in the video, DeVante talks about a Miyazaki interview with PlayStation Blog, where he shared that he believes the barrier of entry has been lowered in Elden Ring due to design choices that now provide additional player agency, and that he hopes “players embrace that idea of receiving help from others,” Miyazaki’s interview also included confirmation that Elden Ring will feature a New Game Plus mode and multiple endings.\n\nThe tech-savvy Killjoy, a character in Riot Games' tactical shooter Valorant, was recently shown in a tweet enjoying a piece of NFT art, which raised some eyebrows among more than a few fans. Riot quickly deleted the tweet and has since issued an apology.\n\nTimestamps:\nIntro - 00:00\nPokémon - 00:08\nElden Ring - 01:34\nKillyjoy - 03:35\nOutro - 04:49", "link": "https://www.youtube.com/watch?v=Is1KHSozoZo", "date_published": "2022-01-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The 9 Biggest Game Releases for February 2022", "description": "February is absolutely stacked for new games releases. In this video, Dave talks about the 9 biggest game releases heading our way this month.\n\nTo kick off the first few weeks of the month, Dying Light 2: Stay Human and Lost Ark are sure to keep you busy. Dying Light 2: Stay Human. It’s the direct sequel to 2015’s zombie action parkour game, Dying Light, and like the original game, Dying Light 2 will include 4-player co-op multiplayer. Lost Ark is a Korean Award Winning MMOARPG which was originally released in 2019. It’s finally seeing a Western release this February, and many have been waiting years to be able to play this, as development originally started back in 2011.\n\nWhether you're a strategy game fan or a fighting game fan, there's something for everyone towards the middle of the month. Total War: Warhammer III and King Of Fighters XV both release on the same day and are the next titles in each long-running series. These two huge releases are immediately followed by another with Horizon Forbidden West.\n\nAnd of course, you can't talk about February releases without talking about Elden Ring. After a short delay, FromSoftware’s latest IP, Elden Ring, is finally releasing and is taking its tried and true weighted 3rd person medieval combat from Dark Souls, and introducing a vast open world to the mix.\n\nFor more information on release dates, news, and updates of all our games in the list, please visit gamespot.com!\n\nTimestamps:\nIntro - 00:00\nDying Light 2 - 00:10\nLost Ark - 01:14\nKOF XV - 02:18\nTotal War: Warhammer III - 03:37\nHorizon Forbidden West - 04:37\nDestiny 2: The Witch Queen - 05:56\nGrid Legends - 06:58\nElden Ring - 08:18\nSteam Deck - 09:51\nOutro - 10:29", "link": "https://www.youtube.com/watch?v=rSmXf6eKo8U", "date_published": "2022-01-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]