[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCHnyfMqiRRG1u-2MsSQLbXA", "title": "How Electricity Actually Works", "description": "This video is sponsored by Brilliant. The first 200 people to sign up via https://brilliant.org/veritasium get 20% off a yearly subscription.\n\nSpecial thanks to:\nBruce Sherwood, Ruth Chabay, Aaron Titus, and Steve Spicklemore\nhttps://matterandinteractions.org\nVPython simulation: http://tinyurl.com/SurfaceCharge\n\nThanks to Ansys for help with the simulations: https://www.ansys.com/products/electronics/ansys-hfss\n\nHuge thanks to Richard Abbott from Caltech for all his modeling \n\nElectrical Engineering YouTubers:\nElectroboom: https://www.youtube.com/c/Electroboom\nAlpha Phoenix: https://www.youtube.com/c/AlphaPhoenixChannel\neevblog: https://www.youtube.com/c/EevblogDave\nBen Watson: https://www.youtube.com/channel/UCgZUVIEtBnnBpFWJuxl_E5g\nBig Clive: https://www.youtube.com/c/Bigclive\nZ Y: https://www.youtube.com/user/ZongyiYang\nNYU Quantum Technology Lab\nhttps://www.youtube.com/channel/UCk7io8SN3ZwKvkpnMCbIGsA\nDr. Ben Miles\nhttps://www.youtube.com/channel/UCUeZBocfxALSUdOgNJB5ySA\nFurther analysis of the large circuit is available here: https://ve42.co/bigcircuit\n\nSpecial thanks to Dr Geraint Lewis for bringing up this question in the first place and discussing it with us. Check out his and Dr Chris Ferrie’s new book here: https://ve42.co/Universe2021\n\n▀▀▀\nReferences:\nA great video about the Poynting vector by the Science Asylum: https://youtu.be/C7tQJ42nGno\n\nSefton, I. M. (2002). Understanding electricity and circuits: What the text books don’t tell you. In Science Teachers’ Workshop. -- https://ve42.co/Sefton\n\nFeynman, R. P., Leighton, R. B., & Sands, M. (1965). The feynman lectures on physics; vol. Ii, chapter 27. American Journal of Physics, 33(9), 750-752. -- https://ve42.co/Feynman27\n\nHunt, B. J. (2005). The Maxwellians. Cornell University Press.\n\nMüller, R. (2012). A semiquantitative treatment of surface charges in DC circuits. American Journal of Physics, 80(9), 782-788. -- https://ve42.co/Muller2012\n\nGalili, I., & Goihbarg, E. (2005). Energy transfer in electrical circuits: A qualitative account. American journal of physics, 73(2), 141-144. -- https://ve42.co/Galili2004\n\nDeno, D. W. (1976). Transmission line fields. IEEE Transactions on Power Apparatus and Systems, 95(5), 1600-1611. -- https://ve42.co/Deno76\n\n▀▀▀\nSpecial thanks to Patreon supporters: Inconcision, Kelly Snook, TTST, Ross McCawley, Balkrishna Heroor, Chris LaClair, Avi Yashchin, John H. Austin, Jr., OnlineBookClub.org, Dmitry Kuzmichev, Matthew Gonzalez, Eric Sexton, john kiehl, Anton Ragin, Diffbot, Micah Mangione, MJP, Gnare, Dave Kircher, Burt Humburg, Blake Byers, Dumky, Evgeny Skvortsov, Meekay, Bill Linder, Paul Peijzel, Josh Hibschman, Mac Malkawi, Michael Schneider, jim buckmaster, Juan Benet, Ruslan Khroma, Robert Blum, Richard Sundvall, Lee Redden, Vincent, Stephen Wilcox, Marinus Kuivenhoven, Clayton Greenwell, Michael Krugman, Cy 'kkm' K'Nelson, Sam Lutfi, Ron Neal\n\n▀▀▀\nWritten by Derek Muller\nEdited by Derek Muller\nFilmed by Trenton Oliver and Petr Lebedev\nAnimation by Mike Radjabov and Ivy Tello\nAdditional video/photos supplied by Getty Images\nMusic from Epidemic Sound and Jonny Hyman\nProduced by Derek Muller, Petr Lebedev, and Emily Zhang", "link": "https://www.youtube.com/watch?v=oI_X2cMHNe0", "date_published": "2022-04-29 13:59:54+00:00", "persistent": false, "user": null, "language": null}]