[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Things You Didn't Know About Saints Row", "description": "Although the Saints Row games throw secrets and easter eggs your way at breakneck speed, here are some things you might now know about the bombastic series. \n\nStu here to unravel the mysteries and zany references throughout the Saints Row games. From Arc Numbers to Fight Club, Saints Row is a series that revels in featuring the pop culture references and memes from the zeitgeist of the eras that they came out in. Some of these secrets occur as easter eggs within the games themselves, and some can be found within the development of the series as a whole. I'm excited to see how the series expands on its history of debauchery in the upcoming Saints Row reboot. Saints Row is Available on Playstation, Xbox, and PC. Saints Row The Third remastered is available on Playstation, Xbox, PC, and Switch.\n\nTime Stamps: \n00:00 Intro\n00:28  Chuck Niuk's Books\n00:49 The Mehrman\n01:28 Missing Ships\n03:11 Red Faction Series\n04:48 PC Projekt Red\n05:24 The 31 Theory\n07:49 Secret Areas\n08:31 Secret Stash\n09:27 Sky Divers\n09:51 Mathematical!\n10:11 Outro\n\n#gaming #saintsrow #gamespot", "link": "https://www.youtube.com/watch?v=KX3ELNMA3lY", "date_published": "2022-08-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "7 Things You Should Know In Madden 23", "description": "Madden 23 is here and is similar to the Madden's of old, however there are some distinct changes such as new seasons and battle passes. Here are 7 tips for new and returning players alike that are brushing the dust off their Madden skills and are ready to drop a few deep ball's to their favorite wide receiver.\n\nMadden NFL 23 pays homage to the late great John Madden with another year of the core gameplay that has kept Madden fans coming back year after year. In this video we take a look at several important tips you should know particularly if you are new to the franchise, or took a hiatus for a few years.\n\nIn this video we break down Skill Based Passing and Ultimate Team. We also help you decide if hopping into MUT is the right choice for you. There are also valuable tips such as setting up chunk plays on spectacular passes after establishing the run, as well as a refresher on the differences of game modes like competitive vs. simulation. \n\nIf you want more Madden 23 be sure to check out our livestream on our YouTube channel – it’s up right now and is a lot of fun. Also keep an eye out for our official review coming soon. Sound off in the comments how you feel about Madden 23 and what you’re hoping to see with each season.\n\nTimestamps: \n0:00 Intro \n0:16 Skill-Based Passing \n1:50 Adjusting The Camera \n2:28 DON'T ALWAYS SPRINT \n3:34 Pick Your Defense User Wisely \n4:26 Use Your Playbook To Bait The Opponent \n5:03 Understanding MUT (If You Want)  \n6:43 Check Out The Field Pass\n\n#gaming #gamespot #Madden23 #MaddenNFL #EASports #Ultimate Team #MUT #PatrickMahomes #TomBrady #JohnMadden #Fieldsense #JoshAllen #NFL #FieldPass", "link": "https://www.youtube.com/watch?v=tFrO8BQ9h9M", "date_published": "2022-08-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Black Myth: Wukong - Official In-game Cutscene", "description": "Get a look at a 6 minute in game cutscene in Black Myth: Wukong. Black Myth: Wukong is an action-adventure game developed by Game Science. Get a look at brand new never before scene characters in the game.\n\n#blackmythwukong #gaming #gamespot", "link": "https://www.youtube.com/watch?v=2uez2sCCQiQ", "date_published": "2022-08-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Black Myth: Wukong 8 Minute Gameplay Trailer with 4K RTX", "description": "Check out some brand new gameplay for Black Myth: Wukong that shows off ray tracing and NVIDIA DLSS. It was captured in 4K RTX and showcases collectibles, new combat and new enemies, hidden elements and more.\n\n#blackmythwukong #gaming #rtx", "link": "https://www.youtube.com/watch?v=lRrzJADBuHg", "date_published": "2022-08-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To DOOM (2016) & DOOM Eternal’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of DOOM and DOOM Eternal, including the Super Shotgun, the Plasma Rifle, and, of course, the BFG.\n\n0:00 - Opening\n0:48 - Pistol (DOOM)\n02:09 - Combat Shotgun (DOOM)\n03:16 - Combat Shotgun (DOOM Eternal)\n05:16 - Heavy Assault Rifle (DOOM)\n08:06 - Heavy Assault Rifle (DOOM Eternal)\n09:30 - Super Shotgun (DOOM)\n11:47 - Super Shotgun (DOOM Eternal)\n13:45 - Rocket Launcher (DOOM)\n15:03 - Rocket Launcher (DOOM Eternal)\n16:26 - Plasma Rifle (DOOM)\n17:55 - Plasma Rifle (DOOM Eternal)\n19:10 - Ballista (DOOM Eternal)\n19:54 - Chaingun (DOOM Eternal)\n21:31 - BFG 10,000 (DOOM Eternal)\n22:25 - BFG 9,000 (DOOM Eternal)\n22:59 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of DOOM and DOOM Eternal and compares them to their real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here. - https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=u_SdNgwbVho", "date_published": "2022-08-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]