{"entries": [{"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-26/turcja-odkryto-dodatkowe-zloza-gazu-ziemnego-na-morzu-czarnym/", "title": "Turcja. Odkryto dodatkowe złoża gazu ziemnego na Morzu Czarnym", "date_published": "2022-12-26 21:48:00+00:00", "description": "Prezydent Turcji Recep Tayyip Erdogan ogłosił, że jeden ze statków wiertniczych odkrył dodatkowe 58 mld metrów sześciennych gazu ziemnego na Morzu Czarnym. Prezydent powiedział, że nowe odkrycie znacząco przyczyni się do niezależności energetycznej kraju. Obecnie Turcja sprowadza surowce energetyczne z zagranicy.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-26/usa-nauczycielka-otrula-swojego-partnera-dolala-mu-do-koktajlu-plynu-chlodniczego/", "title": "USA. Nauczycielka otruła swojego partnera. Dolała mu do koktajlu płynu chłodniczego", "date_published": "2022-12-26 20:40:00+00:00", "description": "Judy Church, 64-letnia emerytowana nauczycielka z Massachusetts, miała otruć swojego 55-letniego chłopaka, Leroya Fowlera. Oskarżona jest o dolanie mu do koktajlu płynu chłodniczego. Mężczyzna zmarł, a kobieta trafiła do aresztu. Media przekazały, że Church miała wykupić polisę ubezpieczeniową na życie Fowlera.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-26/indie-zmarl-najbogatszy-rosyjski-deputowany-pawel-antow-spadl-z-okna-na-trzecim-pietrze/", "title": "Indie: Zmarł najbogatszy rosyjski deputowany. Paweł Antow wypadł z okna na trzecim piętrze", "date_published": "2022-12-26 19:36:00+00:00", "description": "Rosyjski polityk zmarł w niewyjaśnionych okolicznościach. Jego ciało znaleziono w kałuży krwi pod hotelem, w którym świętował swoje 65. urodziny - poinformowała Ukraińska Niezależna Agencja Informacyjna.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-26/miedwiediew-konfrontacja-z-rosja-zaprowadzila-warszawe-w-slepa-uliczke/", "title": "Miedwiediew: Konfrontacja z Rosją zaprowadziła Warszawę w ślepą uliczkę", "date_published": "2022-12-26 17:44:00+00:00", "description": "Poleganie na niekończącej się konfrontacji z Rosją zaprowadziło Warszawę w ślepą uliczkę - napisał Dmitrij Miedwiediew w tekście opublikowanym w Rossijskiej Gaziecie. Były rosyjski prezydent i premier podsumował w nim 2022 rok, przedstawiając własną wizję świata, w której Rosja nie walczy z narodem ukraińskim, ale z nazistowskimi szumowinami w Kijowie.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-26/usa-drugi-z-porwanych-pieciomiesiecznych-blizniakow-odnalazl-sie-przed-swietami-to-cud/", "title": "USA: Drugi z porwanych pięciomiesięcznych bliźniaków odnalazł się przed świętami. \"To cud\"", "date_published": "2022-12-26 16:08:00+00:00", "description": "Bezdomna kobieta ukradła samochód, w którym znajdowało się dwóch braci. Jednego z nich odnaleziono następnego dnia. Chłopiec został porzucony na lotnisku. Poszukiwania drugiego z bliźniaków trwały kilka dni. Udało się go znaleźć dzięki pomocy dwóch kobiet, które wcześniej namierzyły porywaczkę.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-26/dmytro-kuleba-rosja-nielegalnie-zajmuje-miejsce-w-radzie-bezpieczenstwa-onz/", "title": "Dmytro Kułeba: Rosja nielegalnie zajmuje miejsce w Radzie Bezpieczeństwa ONZ", "date_published": "2022-12-26 15:07:00+00:00", "description": "Rosja w Radzie Bezpieczeństwa ONZ jest uzurpatorem miejsca po ZSRR - przekazał szef ukraińskiej dyplomacji Dmytro Kułeba. Poinformował także o zainicjowaniu procesu, który ma wykluczyć Federację Rosyjską z RB oraz z Organizacji Narodów Zjednoczonych. Ukraina zaapelowała o poparcie wniosku pozostałych członków ONZ.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-26/serbia-ogloszono-stan-wyjatkowy-wykoleil-sie-pociag-z-amoniakiem/", "title": "Serbia. Wprowadzono stan wyjątkowy. Wykoleił się pociąg z amoniakiem", "date_published": "2022-12-26 13:36:00+00:00", "description": "W rejonie miasta Pirot w południowo-wschodniej Serbii wykoleił się pociąg z cysterną amoniaku. Miejscowe służby informują, że gazem zatruło się ponad 50 osób. W części miasta wprowadzono stan wyjątkowy. Siedem osób trafiło do szpitala.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-26/finlandia-pozar-w-kosciele-w-srodku-znajdowali-sie-wierni/", "title": "Finlandia: Pożar w kościele, w środku znajdowali się wierni", "date_published": "2022-12-26 13:14:00+00:00", "description": "W Rautjärvi w Finlandii ogniem zajął się zabytkowy kościół, w którym znajdowali się wierni. Według doniesień medialnych, w trakcie pożaru drzwi do świątyni zostały związane linami, uniemożliwiając ewakuację. Sprawą zajmuje się policja, najprawdopodobniej doszło do podpalenia.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-26/rosja-administracja-putina-kupila-choinki-z-polski/", "title": "Rosja: Administracja Putina kupiła choinki z Polski", "date_published": "2022-12-26 11:53:00+00:00", "description": "Jodły kaukaskie, które stanęły w siedzibie Rady Federacji i Izbie Obrachunkowej Rosji zostały zakupione w Polsce - przekazał Polygon.media. Jak się okazało, administracja Władimira Putina zakupiła sześć choinek od nieprzyjacielskiego kraju.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-26/swieta-na-plazy-boze-narodzenie-w-australii/", "title": "Święta na plaży. Boże Narodzenie w Australii", "date_published": "2022-12-26 10:39:00+00:00", "description": "Święty Mikołaj nie ma sań i przybywa z prezentami na desce surfingowej. Podczas Wigilii i Świąt nie brakuje mięsa, krewetek oraz alkoholu, a to wszystko na plaży przy temperaturze 30 stopni Celsjusza. O Bożym Narodzeniu w Australii opowiedzieli w Polsat News przewodnicy Edward Lipski i Patrycja Pietrasik.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-26/chiny-prowadza-cwiczenia-uderzeniowe-samoloty-wtargnely-w-strefe-powietrzna-tajwanu/", "title": "Chiny prowadzą \"ćwiczenia uderzeniowe\". Samoloty wtargnęły w strefę powietrzną Tajwanu", "date_published": "2022-12-26 09:20:00+00:00", "description": "47 samolotów naruszyło nieformalną granicę kontroli morskiej między Chińską Republiką Ludową a Tajwanem - powiadomiło CNN, powołując się na komunikat tajwańskiego ministerstwa obrony. Łącznie w ciągu ostatniej doby do rejonu Tajwanu Chiny skierowały 71 samolotów bojowych i siedem okrętów wojennych.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-26/korea-poludniowa-oddala-strzaly-jeden-z-samolotow-szturmowych-zestrzelono/", "title": "Korea Południowa oddała strzały. Jeden z samolotów szturmowych rozbity", "date_published": "2022-12-26 08:28:00+00:00", "description": "Korea Południowa wysłała samoloty bojowe i śmigłowce szturmowe oraz oddała strzały ostrzegawcze w poniedziałek po tym, jak północnokoreańskie drony naruszyły jej przestrzeń powietrzną. Jak powiadomiła agencja Reuters, około 140 km od Seulu rozbił się samolot szturmowy KA-1 wysłany przez władze Korei Południowej.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-26/wladimir-putin-jako-swiety-mikolaj-na-propagandowym-filmie-walczy-z-lgbt/", "title": "Władimir Putin jako Święty Mikołaj. Ratuje chłopca przed \"zepsutym Zachodem\"", "date_published": "2022-12-26 08:26:00+00:00", "description": "W Rosji powstał film, w którym autorzy przedstawili Władimira Putina jako Świętego Mikołaja, który uwalnia błagające go o pomoc dziecko od wpływów zepsutego Zachodu.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-26/tragiczny-bilans-ataku-zimy-w-usa-ofiary-znajdowane-w-samochodach-i-zaspach/", "title": "Atak zimy w USA. Tragiczny bilans. Ofiary znajdowane w zaspach", "date_published": "2022-12-26 07:27:00+00:00", "description": "Wskutek ataku zimy w Stanach Zjednoczonych zginęło od 30 do 37 osób. Śnieżyca sparaliżowała w Boże Narodzenie m.in. Buffalo w stanie Nowy Jork przy granicy z Kanadą. Zima daje się we znaki także w Japonii. W wyniku trwających od ubiegłego tygodnia obfitych opadów śniegu w tym kraju zginęło co najmniej 17 osób.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-26/media-eksplozje-w-rosyjskiej-bazie-lotniczej-sa-ofiary/", "title": "Rosja. Eksplozje w bazie lotniczej. Są ofiary", "date_published": "2022-12-26 06:44:00+00:00", "description": "Trzy osoby zginęły w nocy z niedzieli na poniedziałek w wyniku eksplozji w bazie lotniczej koło miasta Engels w obwodzie saratowskim na południu Rosji - poinformowała agencja Reutera, powołując się na rosyjskie ministerstwo obrony. Według mediów na terenie bazy wybuchł pożar, który objął powierzchnię 120 metrów kwadratowych.", "persistent": false, "language": "pl-PL"}], "source": {"url": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Polsat News"}}