[{"source": "https://businessinsider.com.pl/.feed", "title": "Płacisz składki ZUS? Musisz spełnić ten obowiązek. Masz czas tylko do końca grudnia", "description": "Do 30 grudnia 2022 r. wszyscy płatnicy składek powinni mieć konto na Platformie Usług Elektronicznych, w tym jednoosobowe firmy czy organizacje pozarządowe. Jeśli tego nie zrobią, konto założy ZUS. Lepiej jednak zrobić samodzielnie. Konto pozwala załatwić wiele spraw on-line, np. można przez nie złożyć wnioski o rozliczenia konta lub kontrolę zwolnienia lekarskiego pracownika albo sprawdzić stan opłaconych składek.", "link": "https://businessinsider.com.pl/prawo/praca/nowe-wymogi-zus-od-2023-r-kto-musi-zalozyc-elektroniczne-konto/8qdstmf", "date_published": "2022-12-26 14:05:40+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Jak GUS liczy inflację? \"Nie znam lepszego badania na świecie\"", "description": "Inflacja maleje, a nam się wydaje, że jest coraz drożej. Dlaczego tak się dzieje i jak właściwie liczone jest tempo wzrostu cen nad Wisłą? Wyjaśniamy.", "link": "https://businessinsider.com.pl/gospodarka/jak-gus-liczy-inflacje-nie-znam-lepszego-badania-na-swiecie/y0dnn0f", "date_published": "2022-12-26 13:32:53+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Volkswagen Taigo 1.0 TSI DSG – pomiędzy Polo i Golfem", "description": "Volkswagen Taigo to model, który łączy dwa światy, wpasowuje się idealnie między segmenty, które jeszcze niedawno wiodły prym na motoryzacyjnym rynku. Taigo jest czymś między Polo a Golfem. I naprawdę dobrą alternatywą dla miejskiego Volkswagena. Szkoda tylko, że kosztuje co najmniej 90 tys. zł. Dużo, ale teraz najtańsze Polo kosztuje mniej o raptem 1200 zł . Takie czasy.", "link": "https://businessinsider.com.pl/technologie/motoryzacja/volkswagen-taigo-10-tsi-dsg-pomiedzy-polo-i-golfem-test/0qg2k7z", "date_published": "2022-12-26 13:21:19+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Ford Tourneo Connect - alternatywa dla SUV-ów", "description": "Ford Tourneo Connect kojarzy się z samochodami dostawczymi i w sumie jest to słuszne skojarzenie. Tyle że w tej konkretnej wersji model ten nie ma nic wspólnego z siermiężnymi „blaszakami”. To niesamowicie przestronne i wygodne auto dla rodziny. Na dodatek uniwersalne i relatywnie niedrogie. W sumie, jeżdżąc takim samochodem, można się zastanawiać, po co istnieją SUV-y?", "link": "https://businessinsider.com.pl/technologie/motoryzacja/ford-tourneo-connect-alternatywa-dla-suv-ow-test/qj5brhg", "date_published": "2022-12-26 13:19:18+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kreml ściga znanego dziennikarza. Właśnie wysłał list gończy", "description": "Resort spraw wewnętrznych Rosji wysłał list gończy za czołowym dziennikarzem śledczym portalu Bellingcat Christo Grozewem – podał w poniedziałek niezależny rosyjski portal Mediazona. Jest on poszukiwany na podstawie \"paragrafu kodeksu karnego\". Nie wiadomo jednak, którego.", "link": "https://businessinsider.com.pl/wiadomosci/kreml-sciga-znanego-dziennikarza-wlasnie-wyslal-list-gonczy/73ml4jv", "date_published": "2022-12-26 13:08:41+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Wielkie zmiany dla influencerów od 2023 r. Koniec z reklamami takich produktów", "description": "Od stycznia 2023 r. obowiązują nowe zasady reklamy wyrobów medycznych. Wbrew powszechnej wiedzy chodzi nie tylko o soczewki kontaktowe, materiały opatrunkowe czy okulary korekcyjne. Wyrobem medycznym jest też botoks, kwas hialuronowy czy laser. I każdy, kto je promuje, musi uważać na nowe przepisy. Za ich złamanie przepisów grozi nawet do 2 mln zł.", "link": "https://businessinsider.com.pl/prawo/nowe-zasady-reklamy-wyrobow-medycznych-co-sie-zmienia-dla-kosmetyczek-lekarzy/xzejrk8", "date_published": "2022-12-26 12:59:11+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Znaleźli dowód na to, że bogaci żyją dłużej. \"Różnica 9 lat\"", "description": "Zamożni mieszkańcy Holandii żyją średnio o około 9 lat dłużej niż ich biedniejsi rodacy - wynika ze specjalistycznych badań Holenderskiego Urzędu Statystycznego (CBS).", "link": "https://businessinsider.com.pl/gospodarka/znalezli-dowod-na-to-ze-bogaci-zyja-dluzej-roznica-9-lat/6rwengr", "date_published": "2022-12-26 11:53:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "To będzie kluczowy sektor w 2023 r. Prezes PGE o fundamentalnych potrzebach", "description": "Wojna w Ukrainie i agresywna polityka Rosji sprawiły, że dziś fundamentalną potrzebą staje się zagwarantowanie bezpieczeństwa energetycznego — pisze prezes PGE Wojciech Dąbrowski. W felietonie dla Business Insider Polska stawia pięć najważniejszych pytań dla energetyki w 2023 r.", "link": "https://businessinsider.com.pl/wiadomosci/prezes-pge-zagwarantowanie-bezpieczenstwa-fundamentalna-potrzeba-w-energetyce-w-2023/49rlzr2", "date_published": "2022-12-26 11:35:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Sukces w biznesie wymaga 12-14 godzin pracy dziennie? To szkodliwy mit. Dlaczego?", "description": "Przedsiębiorcy, szczególnie ci mniej doświadczeni, często wierzą w wiele mitów na temat prowadzenia firm. Zakładają, że są to fakty, z którymi trzeba się pogodzić. To nieprawda. Oto 5 szkodliwych mitów na temat sukcesu w biznesie.", "link": "https://businessinsider.com.pl/twoje-pieniadze/praca/5-mitow-na-temat-prowadzenia-firmy-ktore-moga-nam-zaszkodzic/jrq85bj", "date_published": "2022-12-26 10:20:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Biznesowa wizytówka Warszawy, na której zwykli ludzie mogą stracić oszczędności życia. Jak do tego doszło?", "description": "Wielki kosztujący miliony euro biurowiec w samym centrum Warszawy, będący siedzibą znanego banku. Wydawać by się mogło, że ludzie, którzy zainwestowali w taki projekt, mogą śmiało odcinać kupony. Okazuje się jednak, że choć budynek stoi, to posiadacze obligacji spółki mającej zarządzać obiektem pozostają na ten moment z niczym. I nie są to rentierzy ani właściciele wielkich fortun. Na włosku wiszą środki życia zwykłych ludzi, także takich, którzy doskonale wiedzą, jak działa współczesna gospodarka i byli szczególnie uważni przy wyborze inwestycji.", "link": "https://businessinsider.com.pl/biznes/inwestowanie/mennica-legacy-tower-zwykli-ludzie-moga-na-niej-stracic-majatek/5gl9qtz", "date_published": "2022-12-26 10:11:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Jak zarobić milion przez trzydziestką? Kluczowe okazują się dwie sprawy", "description": "Jeszcze kilka lat temu można było powiedzieć: zainwestuj pieniądze na giełdzie albo postaw na nietypowe formy inwestowania: dzieła sztuki, kolekcjonerskie wina, nieruchomości czy kryptowaluty. Ale to już przeszłość. Dziś najbardziej opłaca się inwestować w... znajomości. Dlaczego?", "link": "https://businessinsider.com.pl/rozwoj-osobisty/kariera/jak-zostac-milionerem-w-wieku-30-lat-kazdy-moze-nie-kazdy-potrafi/p7ydsfl", "date_published": "2022-12-26 09:37:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Wiemy, kto najtaniej ogrzeje dom, a kto wyda najwięcej. Mamy konkretne dane", "description": "Ponieważ w kontekście przyszłego roku zostało już bardzo mało niewiadomych, to można zacząć szacować, która metoda ogrzewania domu będzie w 2023 r. najbardziej korzystna dla naszych portfeli. Okazuje się, że wciąż opłaci się palić węglem. Ale pod pewnymi warunkami.", "link": "https://businessinsider.com.pl/gospodarka/wiemy-kto-najtaniej-ogrzeje-dom-a-kto-wyda-najwiecej-mamy-konkretne-dane/nkxtlvd", "date_published": "2022-12-26 09:32:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Zapytali Polaków, jaki rząd byłby najlepszy. Obecny wskazało 6 proc.", "description": "Który rząd byłby najlepszy dla Polski? Zdaniem uczestników sondażu dla \"Rzeczpospolitej\" - ten złożony z bloku partii dziś będącej w opozycji. Tylko 6 proc. Polaków wskazało w tym przypadku rząd Zjednoczonej Prawicy.", "link": "https://businessinsider.com.pl/gospodarka/zapytali-polakow-jaki-rzad-bylby-najlepszy-obecny-wskazalo-6-proc/9fb67gl", "date_published": "2022-12-26 09:05:39+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Prezes Santandera o 2023 r. \"Idą czasy hiperpersonalizacji\"", "description": "Tradycyjnie grudzień to czas nie tylko podsumowań, ale i pełnych nadziei planów. Jaki będzie nadchodzący rok? Co przyniesie? Co nas będzie zajmować w nowym roku? Z pewnością jednym z kluczowych zagadnień będą konsekwencje polityczne, gospodarcze czy społeczne wojny w Ukrainie — pisze dla Business Insider Polska Michał Gajewski, prezes Santander Bank Polska.", "link": "https://businessinsider.com.pl/finanse/prezes-santandera-o-2023-r-ida-czasy-hiperpersonalizacji/qg2jfm0", "date_published": "2022-12-26 08:30:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Pili ją Wieniawa, Tuwim i inni skamandryci. Sowieci i naziści chcieli zniszczyć, władze PRL-u bały się wpuścić na rynek. Niezwykła historia najsłynniejszej wódki II RP", "description": "Jedną z pierwszych polskich marek działających na skalę globalną był lwowski producent wódki J.A. Baczewski. Firmę rozwijaną przez kilka pokoleń lwowskiej rodziny zniszczyli Niemcy i Sowieci w czasie II Wojny Światowej. Jednak po wojnie zaczęła szybko się odradzać w Austrii. PRL nie chciał jej do siebie wpuścić. Nad Wisłą marka oficjalnie pojawiła się znów dopiero niedawno.", "link": "https://businessinsider.com.pl/biznes/najslynniejsza-wodka-ii-rp-ja-baczewski-nie-zniszczyli-jej-sowieci-ani-nazisci/0d29mtz", "date_published": "2022-12-26 08:15:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kredytobiorcy mają nowy problem. Tym razem w PIT. MF wyjaśnia", "description": "Wraz z ugodami frankowymi pojawił się nowy problem. Kredytobiorcy zastanawiają się, czy umorzoną przez bank część kredytu należy ująć w zeznaniu podatkowym i - co za tym idzie - zapłacić od niej podatek. Ministerstwo Finansów wyjaśnia wątpliwości z tym związane.", "link": "https://businessinsider.com.pl/twoje-pieniadze/kredytobiorcy-maja-nowy-problem-tym-razem-w-pit-mf-wyjasnia/krh7y24", "date_published": "2022-12-26 08:11:18+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Nieudany prezent? Nie każdy możesz zwrócić i wymienić. Zobacz zasady", "description": "Nieudany prezent? Można go zwrócić bezwarunkowo, o ile został kupiony on-line. Wtedy jest na to 14 dni od otrzymania przesyłki — przypomina Małgorzata Cieloch z Urzędu Ochrony Konkurencji i Konsumentów. Jeśli podarunek był kupiony w stacjonarnym sklepie, to możemy polegać tylko na dobrej woli sprzedawcy.", "link": "https://businessinsider.com.pl/twoje-pieniadze/nieudany-prezent-nie-kazdy-mozesz-zwrocic-i-wymienic-zobacz-zasady/p0vvsrm", "date_published": "2022-12-26 08:00:36+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Rusza proces Lewandowski-Kucharski. Znamy datę", "description": "W lutym w Sądzie Rejonowym dla Warszawy-Śródmieścia ruszy proces Cezarego Kucharskiego, byłego menadżera Roberta Lewandowskiego. Został oskarżony o szantażowanie \"Lewego\" oraz jego żony Anny, o czym w Business Insider Polska pisaliśmy jako pierwsi w czerwcu.", "link": "https://businessinsider.com.pl/wiadomosci/rusza-proces-lewandowski-kucharski-znamy-date/60qgxy1", "date_published": "2022-12-26 07:36:56+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Tajemnica McDonald’sów.  Sprawdziliśmy, jak wygląda produkcja słynnych hamburgerów", "description": "O jedzeniu, które można dostać w fast foodach, krąży wiele legend. Obawy konsumentów wzbudza m.in. to, że nawet po wielu latach produkty podawane w restauracjach szybkiej obsługi nie psują się. Postanowiliśmy sprawdzić jak wygląda proces produkcji mięsa, które wypełnia hamburgery słynnej amerykańskiej sieci McDonaldów.", "link": "https://businessinsider.com.pl/lifestyle/jedzenie/hamburgery-z-mcdonalda-jak-sa-produkowane-odwiedzilismy-przetwornie-miesa/4cn68rt", "date_published": "2022-12-26 07:25:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Zaskakujące zachowania Polaków. Prezes największego biura podróży: mimo inflacji masowo kupują wakacje", "description": "Robi się nerwowo? Nie jadę. Tak było do czasów pandemii. Od tej pory zadziwiające jest, jak zmieniła się definicja słowa \"nerwowo\" — pisze dla Business Insider Polska Marcin Dymnicki, prezes TUI Poland, największego biura podróży w kraju. Podkreśla, że wyjazdy są droższe o ok. 20 proc. niż rok temu, ponad jedną trzecią niż w 2019 r., a mimo to Polacy masowo kupują wakacje na 2023 r.", "link": "https://businessinsider.com.pl/lifestyle/podroze/zaskakujace-zachowania-polakow-prezes-najwiekszego-biura-podrozy-mimo-inflacji-masowo/fywvq95", "date_published": "2022-12-26 07:02:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Osiem najważniejszych roszad personalnych w polskiej gospodarce i biznesie w 2022 r.", "description": "Karuzela kadrowa w polskim biznesie i gospodarce w 2022 r. kręciła się w najlepsze. Po 31 latach z funkcją prezesa pożegnał się najdłużej urzędujący szef w branży ubezpieczeń. Król TVN ogłosił przenosiny do Polsatu, a szef Telewizji Polskiej trafił do banku wszystkich banków. Poważne zmiany zaszły też w największych państwowych spółkach, gdzie trudno było nadążyć za wszystkimi roszadami.", "link": "https://businessinsider.com.pl/biznes/top8-najwazniejszych-roszad-w-polskiej-gospodarce-i-biznesie-w-2022-r/r02p3wn", "date_published": "2022-12-26 06:57:00+00:00", "persistent": false, "user": null, "language": "en-US"}]