{"entries": [{"source": "https://www.engadget.com/rss.xml", "link": "https://www.engadget.com/north-korean-hackers-targeted-nearly-1000-south-korean-foreign-policy-experts-213700088.html?src=rss", "title": "North Korean hackers targeted nearly 1,000 South Korean foreign policy experts", "date_published": "2022-12-26 21:37:00+00:00", "description": "<p>South Korean authorities believe <a href=\"https://www.scmp.com/news/asia/east-asia/article/3204528/north-korea-hacked-almost-900-south-korean-foreign-policy-experts-sought-ransom?module=lead_hero_story&amp;pgtype=homepage\">North Korean hackers</a>, working for the government, have targeted at least 892 foreign policy experts in the country. The efforts focused on members of think tanks and academics, dating back to April. The attacks began with spear phishing emails, often claiming to be from figures in South Koreas political system. These usually included either links to fake sites or viruses as attachments. The ploy, while not particularly sophisticated, was enough to fool at least a handful of victims.</p><p>The result was that several prominent experts had their personal data stolen, email lists compromised (exposing more people to the hackers), and 13 companies (primarily online retailers) were victims of ransomware. Although police believe only 49 recipients actually handed credentials over to the fakes sites and only two companies paid the 2.5 million won ($1,980) ransom, it's difficult to judge the full scale of the fallout.</p><span id=\"end-legacy-contents\"></span><p>It's unclear what non-financial resources the North Korean hackers may have gained from this latest campaign. But it's certain this will not be the last cyber attack on its souther neighbor. The county has previously <a href=\"https://www.engadget.com/google-north-korean-campaign-security-researchers-060603985.html\">targeted security researchers</a> to discover unpatched vulnerabilities, and even used the tragedy on Halloween in <a href=\"https://www.engadget.com/north-korean-hackers-target-south-koreans-following-itaewon-halloween-tragedy-185159350.html\">Itaewon</a> as a tool to target South Korean citizens.&nbsp;</p><p>Cyber warfare has been a major focus of North Korea for years, even as it seeks to deter foreign militaries with more traditional methods, like building nuclear weapons. It has also been a <a href=\"https://www.engadget.com/fbi-believes-north-korean-hacker-cell-behind-600-million-crypto-heist-190210513.html\">major source of revenue</a> for the country which is in perpetual financial crisis and largely cut off from the world's markets. It's estimated that North Korean hackers have stolen $1.72 billion worth of cryptocurrency since 2017. And it doesn't appear that it's letting the recent crypto crash scare it off, as the recent ransoms were also paid in BitCoin.</p><p>Though the hackers covered their tracks reasonably well, the targets, tactics and IP addresses have led police to believe this is the same group that hacked the Korea Hydro &amp; Nuclear Power in 2014. They also believe that the hackers will not cease their activity just because their efforts have been discovered. Authorities have urged people, especially those who work in sensitive areas like technology and government, to step up their security measures and be extra vigilant against fishing and human engineering attacks.</p>", "persistent": false, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "link": "https://www.engadget.com/uplift-standing-desk-irl-163028001.html?src=rss", "title": "What we bought: The standing desk I chose after researching the hell out of the competition", "date_published": "2022-12-26 16:30:28+00:00", "description": "<p>When I started working from home five years ago, my chair was the floor and my desk was a stool. I was allowed to type with two hands when the baby on the floor next to me was napping or otherwise occupied. So really, any desk would have been an upgrade, but once I knew working from home was going to be my reality long-term, I went all in and bought a motorized standing desk.</p><p>After some research and lots of YouTubing, I settled on an <a href=\"https://www.upliftdesk.com/uplift-v2-standing-desk-v2-or-v2-commercial/\">Uplift V2</a>, opting for the curved bamboo desk top in the 42-by-30-inch size with the standard (non-commercial) C-frame. I sprung for the advanced keypad, as Uplift recommends, and picked the storage grommet inserts, thinking I might want to put pens or a drink in there (I don’t).</p><span id=\"end-legacy-contents\"></span><figure><img alt=\"Uplift Desk IRL\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/5dfe0de0-773b-11ed-89f7-3770b0965608\" /><figcaption></figcaption><div class=\"photo-credit\">Amy Skorheim / Engadget</div></figure><p>I considered a few other companies including <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy5hdXRvbm9tb3VzLmFpLyIsImNvbnRlbnRVdWlkIjoiY2E5ZWJmYmEtMmI2MC00YjJjLThkZmUtMTMxZjFjNTBlNjFhIn0&amp;signature=AQAAAUmoVh6dOkINgHThXl1WbW5rJWHQuoW-hMNaRM7G6tMh&amp;gcReferrer=https%3A%2F%2Fwww.autonomous.ai%2F\">Autonomous</a>, <a href=\"https://www.vari.com/\">Vari</a> and <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=f8163f64-fce7-4bc3-8c9b-9f093154b6c1&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Fully&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiJmODE2M2Y2NC1mY2U3LTRiYzMtOGM5Yi05ZjA5MzE1NGI2YzEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuZnVsbHkuY29tLyIsImNvbnRlbnRVdWlkIjoiY2E5ZWJmYmEtMmI2MC00YjJjLThkZmUtMTMxZjFjNTBlNjFhIn0&amp;signature=AQAAAajLaSZxaejYVLD7BRUGW_YrKwKUdF0ODQvdj_K-evam&amp;gcReferrer=https%3A%2F%2Fwww.fully.com%2F\">Fully</a> when I was deciding which desk to get. Back when I ordered, the offerings from Uplift felt the most comprehensive, with a slew of size, color and desktop material customization options, and they had the most accessories.</p><p>That’s something you’ll notice as you configure your desk: there are a huge number of add-ons available. Probably the most unexpected is the <a href=\"https://www.upliftdesk.com/under-desk-hammock-by-uplift-desk/\">under-desk hammock</a>, but that’s only available for desks 72 inches wide and larger, so I didn't get one. Plus I own a couch. Mine came with two free accessories when I purchased it a couple years ago, but lucky buyers today get six freebies. I went for the free rocker board, which I don’t use, and now wish I’d grabbed the cushioned standing mat instead. I also picked the bamboo under-desk drawer, which I use daily, filled with a few of these <a href=\"https://threebythree.com/products/stacking-bin-sets-of-5\">metal storage bins</a>.</p><p>If you browse through the image galleries on Uplift’s site you’ll notice idealized office setups, with a curious lack of cables on, under or snaking away from the desks, as if buying one will somehow make <a href=\"https://artsandculture.google.com/story/tesla-s-vision-of-wireless-energy-nikola-tesla-museum/FQXRHCCNJKDMJg?hl=en\">wireless energy transmission</a> a reality. Turns out that’s not the case, but Uplift does offer a number of ways to route and hide those still-necessary cords. Every desk comes with a wire management tray that mounts at the rear underside of the desk, along with cable tie mounts to keep wires up and out of the way. I paid $35 extra for the <a href=\"https://www.upliftdesk.com/magnetic-cable-organizing-channel-by-uplift-desk/\">magnetic cable channel</a> which keeps the rather thick cable that powers the desk routed against the desk leg.</p><figure><img alt=\"Uplift Desk IRL\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/e1413930-773a-11ed-b78e-5b116d4e47e9\" /><figcaption></figcaption><div class=\"photo-credit\">Amy Skorheim / Engadget</div></figure><p>Once the desk arrived, it was fairly easy to assemble following the <a href=\"https://www.upliftdesk.com/uplift-desk-assembly-programming/\">video instructions</a>. What stood out to me most about my new office furniture was the weight. It’s <em>heavy</em>. Each leg contains three nesting sections of steel with a steel crossbar up top. I’m sure my bamboo desktop is among the lighter of Uplift’s options, but it’s still substantial. Considering how little anything wobbles as it raises and lowers, or when it’s 45 inches off the ground, I think the heft is a good thing.</p><p>After the desk was assembled, it took a little fussing to get the cables hidden in a way that somewhat resembled the minimalism you see in the Uplift gallery photos. It helps to lift the desk to its full height when you’re setting up so you can get under there to work with the plugs, power strips and cable ties – something I wish I’d realized before I spent an hour hunched under there while it was at normal-desk height.</p><figure><img alt=\"Uplift Desk IRL\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/1da0b2c0-773b-11ed-b7fc-917a55338303\" /><figcaption></figcaption><div class=\"photo-credit\">Amy Skorheim / Engadget</div></figure><p>Lifting and lowering the desk is a simple push-button operation. The standard (aka free) keypad only has up and down buttons, which you press and hold to adjust the desk’s height. Uplift “recommends” paying the extra $40 for an advanced keypad that lets you program four different height settings; I gave in to the upsell, but I’m glad I did. If you need to go from sitting to standing or the other way around, just push a numbered key and the desk adjusts all by itself. I only use two pre-programmed positions – a sit and a stand height – but it’s nice to have the option of more settings. For example, if I ever want to make use of that balance board, I might need a couple extra inches.</p><p>The operation is impressively smooth and almost silent. During working hours, my cat stations himself at the corner of my desk and doesn’t wake from a nap when I change heights. I adjust the desk four times a day, starting off standing, switching to sitting for lunch and staying seated for an hour or two after. When I start to feel that afternoon slump, I’ll raise the desk back up to standing, which (paired with a cup of tea) usually helps with focus. Then just before quitting time, I sit down for the last hour or so, pushing the standing button when I log off so it’s ready for tomorrow. I’ve been more or less following that pattern for two years and the motors are performing exactly as they did when I first got the desk. Aside from a little dulling in the desktop finish where I have my mouse, everything still feels and looks new.</p><p>You’ve probably heard it said that your healthiest working position is your next one, meaning you shouldn’t stay in any posture for long. Having an adjustable desk doesn’t necessarily solve the problem of bad ergonomics – standing still all day is nearly as bad as sitting – but I’ve found when I’m standing, I’m much more apt to step away and get in a stretch, or even pace a bit when I’m searching for my next word. The Uplift desk is worlds away from a stool on the floor, and I don’t think I could ever go back to just a regular desk again.</p>", "persistent": false, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "link": "https://www.engadget.com/engadget-best-games-2022-150020578.html?src=rss", "title": "Engadget’s favorite games of 2022", "date_published": "2022-12-26 15:00:20+00:00", "description": "<p>What a year for gaming. While 2022 may not have enjoyed as many AAA releases as in past years, the ones that weren’t delayed into 2023 were stellar and the indie development scene more than made up for the lack of big-budget titles. Some of our favorite releases this year came from small, ambitious teams that delivered fresh ideas. As is tradition, the Engadget team came together to extol the virtues of our favorite releases from the past 12 months.</p><div id=\"ea233c6e2a98466bbcf969cd842ac747\"></div><h2><a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=21fc7c82-c5eb-49a9-b5d3-fc32a78290de&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Nintendo&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiIyMWZjN2M4Mi1jNWViLTQ5YTktYjVkMy1mYzMyYTc4MjkwZGUiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cubmludGVuZG8uY29tL2VuLWNhL3N0b3JlL3Byb2R1Y3RzL2JheW9uZXR0YS0zLXN3aXRjaC8iLCJjb250ZW50VXVpZCI6Ijc0Mzg2MmRkLWM3YmYtNGQ5Mi1iNDM0LTRlMDE4NzE5NDJlZiJ9&amp;signature=AQAAAXCBSBMLk16za9EcAeU-pLFGehqBEH8K2qjvAeHBfdLd&amp;gcReferrer=https%3A%2F%2Fwww.nintendo.com%2Fen-ca%2Fstore%2Fproducts%2Fbayonetta-3-switch%2F\">Bayonetta 3</a></h2><p><a href=\"https://www.engadget.com/bayonetta-3-review-130024141.html\"><em>Bayonetta 3</em></a> is a delicious amplification of the series’ most ridiculous themes. It indulges in absurdity without disrupting the rapid-fire combat or Bayonetta’s unrivaled sense of fashion and wit. <em>Bayonetta 3</em> is joyful, mechanically rich and full of action, plus it allows players to transform into a literal hell train in order to take down massive beasts bent on destroying the multiverse. Bayonetta elegantly dances her way through battles, dropping one-liners and shooting enemies with her gun shoes in one moment, and turning into a giant spider creature the next.</p><span id=\"end-legacy-contents\"></span><p>The Bayonetta series just keeps getting weirder, but that doesn’t mean it’s losing its sense of satisfying gameplay along the way. In the franchise’s third installment, Bayonetta is powerful, confident and funny; she’s a drag queen in a universe loosely held together by witchcraft, and the chaos of this combination is truly magical. <em>– Jessica Conditt, Senior Reporter</em></p><h2><a href=\"https://www.cultofthelamb.com/\">Cult of the Lamb</a></h2><div id=\"1f0d0d693c4843ac9561e4803d5072ef\"></div><p>Sure, you’ve played <em>Animal Crossing</em>, <em>Stardew Valley</em>, <em>Hades</em> and <em>The Binding of Isaac</em> – but what if you could play all of them at once, in a single adorable demonic package? That’s <em>Cult of the Lamb</em>, baby.</p><p><em>Cult of the Lamb</em> is part social and farming simulator, part dungeon-crawling roguelike and all-around fantastic. After being sacrificed and resurrected, you’re instructed by a grand, dark deity to start your own cult, managing worship services, agriculture, cooking, marriages, deaths and much more. You must also venture into the wilderness to battle demons and recruit more followers. Keep in mind that you’re a lamb, which makes all of this exceptionally cute.</p><p><em>Cult of the Lamb</em> is a brilliant balance of satanic dungeon crawling and cult simulation, offering more action than <em>Animal Crossing</em> and more casual farming mechanics than <em>Hades</em>. <em>Cult of the Lamb</em> is incredibly satisfying, and it’s rich in gameplay, story and environments. Most of all, it’s cute as hell. <em>– J.C.</em></p><h2><a href=\"https://en.bandainamcoent.eu/elden-ring/elden-ring\">Elden Ring</a></h2><div id=\"3c89fbd4fbff4170b6c7045da6010d03\"></div><p>There was never going to be a version of this post that did not include <em>Elden Ring</em>, FromSoftware's big push into open-world <em>Berserk</em>-inspired sword and sorcery.</p><p>Yes, there's something to be said about the earlier, more linear Souls games forcing players down a path of increasing gloom and difficulty (<em>cue the hallmark rasping laugh of an NPC who seems to know precisely how screwed you are</em>), how the inevitability of that experience allowed the devs to craft a bespoke gameplay loop of apprehension, frustration, discovery and the eventual reward of mastery. I love that stuff! But <em>Elden Ring</em> tried something new, effectively playing a shell game with those four player states, and making discovery the new initial draw.</p><p>My big \"aha!\" moments in <em>Dark Souls 3</em> or <em>Bloodborne</em> arrived when I'd finally spotted a shortcut or sussed out a boss's hidden weakness. <em>Elden Ring</em> retained that. But what really made the good brain chemicals flow was just… roaming around. Reaching the top of some lava-ridden mesa. Or finding a way onto some seemingly inaccessible islet. The grandeur of the settings and knowledge FromSoft wouldn't make me work for a slice of geography devoid of treasures to loot and dudes to hack apart made the effort worthwhile.</p><p>Some fans adore the limited palate of <em>Sekiro</em> which essentially tells players, \"git gud or quit.\" Call me a bad gamer (accurate) but I prefer the maximalism and flexibility that <em>Elden Ring</em> brought to the table. Want to grind until every boss is trivial? How about a hitless all-remembrances run? Either, and anything in between, is valid. Allowing for challenge <em>and</em> accessibility makes <em>Elden Ring</em> a beautifully executed twist on the formula FromSoft has been honing for nearly 30 years. <em>– Avery Menegus, Senior News Editor</em></p><h2><a href=\"https://bethesda.net/en/game/ghostwire-tokyo\">Ghostwire: Tokyo</a></h2><div id=\"be133babcb2445ba91da003e87673d4e\"></div><p>Sometimes, games you were once really <a href=\"https://www.engadget.com/ghostwire-tokyo-preview-ps5-2022-150024173.html\">looking forward</a> to playing just sneak past you at launch. That’s totally true of <em>Ghostwire: Tokyo</em>, a game from Tango Gameworks, which also created the underrated horror game <em>The Evil Within</em> and its sequel.</p><p><em>Ghostwire: Tokyo </em>is different to those, though. It’s often… funny. Sure, there are grotesque Japanese folklore monsters and creepy faceless men-in-suits to hurl magic at, but there are also ghosts trapped in toilet cubicles that need a few extra rolls of toilet paper, or park trees that need to be magically cleansed for nearby spirits to feel at ease. You play through a first-person perspective, using elemental attacks, charms and a spiritual bow and arrow set to take down an array of spirits that have invaded a substantial patch of central Tokyo. If you’ve heard the game described as <em>Yakuza, </em>but with ghosts, well, it’s a completely different kind of game. But the beautifully rendered buildings, interiors and streets definitely hit similar notes. Due to a supernatural attack on the city, you won’t bump into any other humans, pretty much through the entire campaign, which adds an eerie air to the entire game. It’s either ghouls trying to kill you, or spirits that need your help to move on.</p><p>The main game is short but punchy enough. It feels like a game that was banking on DLC to round out a lot of the more ambiguous plot questions players might have, but it’s uncertain whether that will ever happen. It’s still a fun supernatural game that takes a different approach to horror, with some mind-bending set pieces that bring some of the more imaginative parts of games like <em>Control</em> into the neon-lit streets of Tokyo. And who doesn’t want to be stalked by hundreds of paper eyeballs? <em>– Mat Smith, UK Bureau Chief</em></p><h2><a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy5wbGF5c3RhdGlvbi5jb20vZW4tY2EvZ2FtZXMvZ29kLW9mLXdhci1yYWduYXJvay8iLCJjb250ZW50VXVpZCI6Ijc0Mzg2MmRkLWM3YmYtNGQ5Mi1iNDM0LTRlMDE4NzE5NDJlZiJ9&amp;signature=AQAAAX4PoeNAKM_iYQygWOGR-XqJ6UhhUtHftqmwje6tOMvl&amp;gcReferrer=https%3A%2F%2Fwww.playstation.com%2Fen-ca%2Fgames%2Fgod-of-war-ragnarok%2F\">God of War: Ragnarok</a></h2><div id=\"6fd3e2fa4afe475baf76510a8abc6c24\"></div><p>When I was first introduced to Kratos, the God of War, he was on my PS2, taking a stroll along a Cretan wharf, casually tearing a few Minotaurs in half. Things only went downhill from there. For a full three mythos-crushing game installments, things only went downhill from there. I mean, by the end of <em>GoW III</em> you had to dig pretty far down the Pantheon talent list to find a surviving deity.</p><p>But when we were reintroduced to Kratos on the PS4, we were not given back the pale ball of vengeful fury and barely-contained ultraviolence that we had grown to know and love. This new one was, well, not softer but at least not quite so hard-edged as before. This was a Kratos with bad knees who old-man grunted when he stood; a Kratos with a son he struggled to connect with but still reared in a dangerous and unforgiving world, demi-god or not. This was a more relatable Kratos, one that had aged alongside the gamers that inhabit his form in the intervening console years, with concerns and motivation beyond most efficiently chain slashing his way through enemy hordes.</p><p>I think a big part of what made <em>God of War</em> the Game of the Year in 2018 was that progression away from thinly-veiled plot points serving as excuses for more blood, boobs and button smashing; and towards a more mature, measured examination, not just of Kratos’ relationship with Atreus, but the larger theme of how to process familial loss, its accompanying grief, and to move forward from the pain.</p><p><em>Ragnarok</em> is both an affirmation of Kratos’ reformation and a lodestar for the future of the God of War franchise. I’m not going to spoil the rich and nuanced multi-arc-with-just-a-hint-of-time-travel storyline for those who have not yet played but it, in my opinion at least, is the best written of the series. This is a game with cutscenes you’ll want to sit through. Combine that with well-paced skill-adjustable action, huge maps packed with treasures and secrets, an expansive supporting cast and star-studded voice acting – not to mention a menagerie-worth of mystical wildlife just begging to be torn limb from limb – and you’ve got yourself one of the best games of 2022. <em>— Andrew Tarantola, Senior Reporter</em></p><h2><a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy5wbGF5c3RhdGlvbi5jb20vZW4tY2EvZ2FtZXMvaG9yaXpvbi1mb3JiaWRkZW4td2VzdC8iLCJjb250ZW50VXVpZCI6Ijc0Mzg2MmRkLWM3YmYtNGQ5Mi1iNDM0LTRlMDE4NzE5NDJlZiJ9&amp;signature=AQAAAU4Do2eKmpVDrpNg_2vjhyZ8R34cXnDTjH3wEUEbA7Oo&amp;gcReferrer=https%3A%2F%2Fwww.playstation.com%2Fen-ca%2Fgames%2Fhorizon-forbidden-west%2F\">Horizon Forbidden West</a></h2><div id=\"d28468b9c7d54305b8f16abc30403625\"></div><p>Sony’s first-party studios have generally done <a href=\"https://www.engadget.com/the-last-of-us-part-ii-review-070140792.html\">sequels</a><a href=\"https://www.engadget.com/god-of-war-ragnarok-review-ps5-162534113.html\">right</a>, and <em>Horizon Forbidden West</em><a href=\"https://www.engadget.com/horizon-forbidden-west-review-water-robot-dinos-080126554.html\">is no exception</a>. The first game had one of my favorite narratives, as protagonist Aloy learned what happened a thousand years prior to bring about the mysterious world she (and the player) inhabit – one where mankind lives in relatively primitive tribes trying to stay safe from giant animal-like machines run amok.</p><p><em>Forbidden West</em> delivers even more of what worked in <em>Horizon Zero Dawn. </em>Aloy remains a steadfast, righteous and occasionally stubborn protagonist who continues to grow as she uncovers more secrets about the world around her while fighting a totally unexpected force bent on destroying Earth as she knows it. The twists of <em>Forbidden West </em>don’t <em>quite</em> match the first game’s reveal of how the world we know evolved into the world Aloy inhabits. But the narrative is still rich and complex, and the new parts of what was once the American southwest that you get to explore are rendered in stunning detail. It’s one of the most beautiful games I’ve ever played.</p><p>As with any good sequel, combat and traversal around the world have been refined – there are more weapons than ever, and you can customize them to match your play style or the particular enemies you’re facing. Melee combat against humans and machines alike has also been significantly upgraded, and new items like a grappling hook and hang glider make getting around quicker and more fun. And nearly all the machines from the first game return, along with some colossal new enemies that present a massive challenge, but also a massive bit of satisfaction as you figure out their weak spots and systematically take them down.</p><p>I think my favorite new thing of <em>Forbidden West,</em> though, is the relationships you build with your friends. In the first game, Aloy is mostly a lone wolf, occasionally partnering with people here and there but mostly doing things on her own. In <em>Forbidden West</em>, though, you establish a posse of capable and likable companions, some old and some new, all of whom bring something different to the table in your massive quest. Trying to fend off the end of the world feels just a little bit easier when you have friends by your side. – <em>Nathan Ingraham, Deputy Editor</em></p><h2><a href=\"https://store.steampowered.com/app/1350200/IMMORTALITY/\">Immortality</a></h2><div id=\"6e0c6f0aaa394b48a5b41fdb8f4f9345\"></div><p>With <em>Immortality</em>, indie game director Sam Barlow has delivered a tribute to the surreal films of David Lynch, with a dose of Hitchcock for good measure. Similar to <em>Her Story</em>, it's also entirely about scrubbing through video clips, except this time it involves footage from three unreleased genre films spanning several decades. Your job? To figure out what happened to the actress Marissa Marcel.</p><p>Geared more towards cinephiles than mainstream gamers, <em>Immortality</em> can be frustrating if you're not operating on Barlow's wavelength. But if you're a fan of surreal cinema, and you enjoy diving into behind-the-scenes footage, it's a game with endless rewards. The mystery will get you started, but the spooky atmosphere and excellent performances will keep you hooked. <em>– Devindra Hardawar, Senior Editor</em></p><h2><a href=\"https://www.marvelsnap.com/\">Marvel Snap</a></h2><div id=\"8bf36ee351744268853a3346e1884951\"></div><p>After getting burnt out on <em>Hearthstone</em> a few years ago, and superhero movies more recently, the last thing I expected to hook me in 2022 was a comic book-themed collectible card game. But then the fine folks at Second Dinner released <em>Marvel Snap</em> and it quickly became my favorite time waster. Because a match lasts less than five minutes, you can easily play a round during commercials, while waiting for the train, or in the bathroom (I’m not judging). And while decks cap out at just 12 cards, there’s a surprising amount of depth with a huge variety of effects and counters. Meanwhile, thanks to appearances from lesser-known characters like Hell Cow, Devil Dinosaur and the Infinaut, the game has prompted me to learn more about Marvel lore than any of the movies ever did. So even though the game is a little barebones at the moment (the only mode is a basic ranked ladder but more features are on the way), <em>Marvel Snap</em> is sure to be a game I continue playing long after I’ve forgotten about whatever happened in the latest Spider-man movie. – <em>Sam Rutherford, Senior Reporter</em></p><h2><a href=\"https://neonwhite.rip/\">Neon White</a></h2><div id=\"8343ba9eb10b4bf98a99f437c16040f2\"></div><p>What do you do when you love speed running and score chasing, but you're generally not very good at it? You play <em>Neon White</em>.&nbsp;</p><p><a href=\"https://www.engadget.com/atari-pong-arcade-cabinet-anniversary-video-203045522.html\">Like all good games</a>, <em>Neon White</em> is simple to learn, and difficult to master. The basic ask is that you vanquish every demon from a level and head to a finish marker. It plays like a fast-paced first-person shooter, with the complexity coming from your weapons, which are cards that can either fire or be spent for a special movement or attack ability. The <em>real</em> challenge comes from the scoring system, which grades you based on the time you took to complete a level.</p><p>There are just shy of 100 levels, all begging to be learned, repeated and perfected. Despite its first-person shooter visuals, it plays out more like a cross between <em>Trackmania</em> and a platformer. You'll quickly turn that bronze medal into a gold, and then an \"ace\" that is supposedly your ultimate target. Then you'll see the online leaderboards and realize you've left some seconds on the table. Then you'll randomly achieve the secret red medal on a level, say \"oh jesus\" and realize that there's a whole hidden tier of perfection for you to attain.</p><p>The trick is that everything feels smooth, and fast. From my first gold medal time up to the top-ten-in-the-world run I showed my pretending-to-be-interested friends, every time I turned on the game I felt like a master, inches away from perfection. There are multiple paths through each level, ridiculous shortcuts to discover, and near-infinite degrees of satisfaction waiting after every good run.</p><p>The main negative point, for me, is the story, which plays out like a visual novel. I love the genre, and had heard good things about the game's characters, but found the narrative overly slow and just generally dull. There is mercifully a \"fast forward\" button, and once you've played through everything, a level select screen that lets you jump right into the action.</p><p>Despite its storytelling, and a couple of overly long levels that had me gnashing my teeth, <em>Neon White</em> was easily the most fun I had with a game this year. I played on Switch and PC, but a couple of weeks ago it landed on PlayStation as well, and I imagine I'll be starting up a new campaign and playing it all over again soon.<em>– Aaron Souppouris, Executive Editor</em></p><h2><a href=\"https://store.privatedivision.com/game/olliolli-world\">OlliOlli World</a></h2><div id=\"22daf635afb44ff3abe34941ed33ce45\"></div><p>Most of the time, single-player narrative-driven games are where I spend most of my gaming time. But once a year, I come across a game like <em>OlliOlli World</em> that I can play for minutes or hours at a time because the gameplay is <a href=\"https://www.engadget.com/olliolli-world-gameplay-preview-140021521.html\">just so satisfying</a>. The goal in <em>OlliOlli World</em> is simple: become a skateboarding god. You do that by progressing through five worlds, each of which has a dozen or more individual stages, each with a wildly unique course to traverse.</p><p>Unlike the earlier games in the OlliOlli series, <em>World</em> is a bit more forgiving at first. It’s much easier to pick up and start pulling off wild moves and combos than ever before. But it’s still fiendishly challenging – if you want to beat every challenge, you’ll need lightning-fast reflexes and the mental stamina to change up your tricks and moves constantly. But once you get fluent in the game’s mechanics, you can enter a flow state where you’re just making moves purely on instinct.</p><p>The level and character design in <em>OlliOlli World</em> only enhances this effect. Like the earlier games, each of the five biomes has its own unique characteristics, but in all cases the levels are extremely colorful and interactive, with tons of eye candy and bizarre creatures hanging out in the background. And you can customize your character with clothing and items you pick up for completing challenges, letting you express your personal style in a huge variety of ways. There are also competitive aspects, like the daily challenge where you compete against nine other skaters to post the top score in your group. And every time you visit a level, you’ll see a “rival” score to try and beat. There’s always something pushing you to skate even better in <em>OlliOlli World. – N.I.</em></p><h2><a href=\"https://overwatch.blizzard.com/en-us/\">Overwatch 2</a></h2><div id=\"ec7451e2b8c04ad5bea50b22acd47737\"></div><p><em>Overwatch</em> is my second favorite game of all time. Despite sharper, faster-paced gameplay, some much-needed quality-of-life improvements and the free-to-play shift I've wanted for years, <a href=\"https://www.engadget.com/overwatch-2-beta-first-look-160005268.html\"><em>Overwatch 2</em></a> isn't quite at that level yet. It's too rough around the edges.</p><p>The monetization changes felt like a gut punch. In fairness, many of the high-end skins cost around the same as what you'd pay for outfits in other major free-to-play titles. But newcomers now need to pay up if they want cosmetics that have been in the game for six years – items that veteran players were able to earn for free only a few months ago. Players also need to pay for the <a href=\"https://www.engadget.com/overwatch-2-battle-pass-explained-pricing-rewards-164051102.html\">premium battle pass</a>, grind through the free tier or wait until it's easier to unlock new heroes in later seasons before getting access to the latest characters.</p><p>And yet, <em>Overwatch 2</em> has a hold over me like no other game. It's still the best multiplayer title around, with a rich lore, a wonderful cast of characters and a colorful aesthetic that helps it stand out from many other games on the market. The ping system is an excellent addition for accessibility, and the four new heroes that have joined the lineup since launch are all a blast. Some of the major hero reworks, especially the Orisa one, have been a resounding success.</p><p>As much as I enjoy the game as it is now, Blizzard has laid the foundations for an even more exciting future. Next year will bring long-awaited, story-driven co-op missions to the franchise – until now, we've only had a taste of those during seasonal events. After getting a sneak peek at some of the stuff that's on the way to the PvP side in the next few seasons, including a new core game mode and the season four hero, I can't see myself putting this game down anytime soon. <em>– Kris Holt, Contributing Reporter</em></p><h2><a href=\"https://store.steampowered.com/agecheck/app/1294420/\">Rollerdrome</a></h2><figure><img alt=\"Rollerdrome\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-07/3e98e2b0-0c4f-11ed-96dc-e5e0035439c3\" /><figcaption></figcaption><div class=\"photo-credit\">Roll7</div></figure><h2></h2><p><a href=\"https://www.engadget.com/rollerdrome-preview-olliolli-skates-ps5-steam-160030108.html\"><em>Rollerdrome</em> is lush</a>. It’s incredibly stylish, taking cues from 1970s Hollywood sci-fi but with an attractive cel-shaded filter over every scene. Even better than its stunning visuals, <em>Rollerdrome</em> has smooth, precise mechanics that allow players to fall into a flow in every level. The game is all about gliding through the environments on rollerblades, picking up speed and doing tricks while dodging and shooting enemies, managing weapons and controlling time – and it all comes together in a thrilling dystopian bloodsport.</p><p>It’s a joy to dodge, dodge, dodge and then leap into the air, slow down time and take out the people shooting at you, refilling ammo and collecting health in the process. Meanwhile, an unsettling story of corporate greed unfolds naturally beneath the rollerblading bloodshed, keeping the stakes high. <em>Rollerdrome</em> was a sleeper hit of 2022, so if you’ve been napping on this one, now’s the time to wake up and play. <em>– J.C.</em></p><h2><a href=\"https://stray.game/\">Stray</a></h2><div id=\"e95932d7e1084fbeb3475982949c6f9f\"></div><p>When I fall in love with a game, it’s the setting that gets me, which maybe explains why I wandered around <em>Fallout 76</em>’s Appalachian wasteland long after most people had left – I wanted to live there. I want to live in the futuristic city where <em>Stray</em> takes place too, but since I’m neither cat nor robot, I wouldn’t be allowed. In the game, you play a standard orange tabby with no special abilities, apart from those given to most felines like agility and jumping prowess. Through a mishap, you find yourself trapped in a domed city populated exclusively by amiable humanoid robots, and you eventually team up with a small drone that lets you “talk” with those androids.</p><p>To find your way back to your cat family outside the city, you solve puzzles, fight mutant bacterial blobs and generally follow your curiosity. The cityscape is a gorgeous, multi-level cyberpunk playground that feels a little less hardcore than <em>Cyberpunk 2077’s </em>Night City, with plenty of woven rugs to scratch and pillows to nap on. In fact, scratching, napping and otherwise doing cat stuff not only unlocks achievements (I was particularly proud to earn the one for getting a paper bag stuck on my head) they’re also integral to the game.</p><p>As my colleague Jessica Conditt <a href=\"https://www.engadget.com/stray-review-ps5-cyberpunk-adventure-cute-cat-173018571.html\">said in her review</a>, Stray is “downright joyful.” By leaning into the cat premise, it creates a whole new gaming perspective – you can’t do stuff humans can do, but you <em>can</em> do stuff cats do, like shimmying through small holes and jumping on pipes and bookcases. Living 12 inches off the ground for the cumulative eight hours or so it took me to play the game, I finally understood why cats want to jump on top of everything. The view is just better up there. – <em>Amy Skorheim, Commerce Writer</em></p><h2><a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy5wbGF5c3RhdGlvbi5jb20vZW4tY2EvZ2FtZXMvdGhlLWxhc3Qtb2YtdXMtcGFydC1pLyIsImNvbnRlbnRVdWlkIjoiNzQzODYyZGQtYzdiZi00ZDkyLWI0MzQtNGUwMTg3MTk0MmVmIn0&amp;signature=AQAAAdfrGJs0VosihhKgZL1YHbX6hHkX4J8fgy7UPkttgvVQ&amp;gcReferrer=https%3A%2F%2Fwww.playstation.com%2Fen-ca%2Fgames%2Fthe-last-of-us-part-i%2F\">The Last of Us Part I</a></h2><figure><img alt=\"The Last of Us Part I review screenshots\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-08/dcb38c70-28a6-11ed-a77f-d92be29b5fc1\" /><figcaption></figcaption></figure><p>A ton has been said about how <em>The Last of Us Part I</em> is a remake of a game that was originally released for the PS3 and then remastered a year later for the PS4. (Oh, and it’s <a href=\"https://www.engadget.com/last-of-us-part-1-tlou-pc-release-date-march-3-2023-021024376.html\">coming to PC</a> in early 2023, too.) So, it’s not exactly an <em>essential</em> release if you’ve played it before. But for people who may have heard about the <a href=\"https://www.engadget.com/hbo-the-last-of-us-second-trailer-212931347.html\">upcoming HBO show</a> and want to know what all the fuss is about – or anyone who loved Joel and Ellie’s journey the first time – this PS5 version is <a href=\"https://www.engadget.com/the-last-of-us-part-1-ps5-review-150041410.html\">the definitive way</a> to experience this story.</p><p>The game has been entirely rebuilt from scratch, and it shows in everything from the ruined post-pandemic cities and surprisingly tranquil forests and mountains to the detail found in collectibles around the world. Most crucially, though, the facial animations are simply stunning. Everyone you encounter, whether a lead character or an NPC you only see once, looks amazingly detailed and realistic. Of course, that means the hordes of infected humans hunting you are even more disturbingly detailed than ever, as well.</p><p>The updates aren’t just skin deep, either. Enemies are smarter and more cunning than ever, thanks to developer Naughty Dog using the upgraded AI system they implemented in 2020’s <em>The Last of Us Part II.</em> Humans are more aggressive about flanking you and a lot easier to lose once they find you, while the Infected are even better at hearing you trying to sneak by. There are a host of other updates, big and small, perhaps the most important of which is a massive suite of accessibility features so that almost anyone can give this game a shot.</p><p>What hasn’t changed is the story and script – but that isn’t a problem, given that <em>The Last of Us</em> was already well-known for its outstanding performances and plotting. The debate on whether or not <em>The Last of Us Part I</em> was really “necessary” will likely continue, but don’t spend too much time thinking about it. If you’ve never played the game before, this is the way to do it. And if you’re like me and play it every year or two, this is the best way to do so. – N.I.</p><h2><a href=\"https://tunicgame.com/\">Tunic</a></h2><div id=\"81558e6f8cff4129be53fc88694f926c\"></div><p>How do you write about a game that’s best experienced without expectations? That’s the challenge of saying something meaningful about <em>Tunic</em>. You can speak to its influences – primarily <em>The Legend of Zelda: Link’s Awakening</em>, with a dash of Soulslike combat – but that doesn’t do the game justice. Worse yet, it fails to capture its appeal. I could also mention its <a href=\"https://youtu.be/GYQyo3CaIZ4\">haunting soundtrack</a> by Lifeformed and Janice Kwan or the <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy55b3V0dWJlLmNvbS93YXRjaD92PUE1QTd1b0pBT3ZZJmFiX2NoYW5uZWw9Tm9jbGlwQ3JldyIsImNvbnRlbnRVdWlkIjoiNzQzODYyZGQtYzdiZi00ZDkyLWI0MzQtNGUwMTg3MTk0MmVmIn0&amp;signature=AQAAAcXuIVSTl3UZg7nNwDALhDzoLWs3bPC-aTiBFGUoYbsS&amp;gcReferrer=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DA5A7uoJAOvY%26ab_channel%3DNoclipCrew\">austere beauty of its art style</a>. But again that’s not quite what makes <em>Tunic</em> so special.</p><p>I’m being purposefully vague because to say more would be to rob the game of its magic. So I’ll leave you with this: It’s fitting <em>Tunic</em> casts you as a cutesy fox because the game has a knack of making you feel so clever anytime you work through one of its many mysteries. Do yourself a favor and try to play this one without turning to the internet if you run into a roadblock. On the other end is one of the most rewarding gaming experiences in recent memory. – Igor Bonifacic, Weekend Editor</p><h2><a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=21fc7c82-c5eb-49a9-b5d3-fc32a78290de&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Nintendo&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiIyMWZjN2M4Mi1jNWViLTQ5YTktYjVkMy1mYzMyYTc4MjkwZGUiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cubmludGVuZG8uY29tL2VuLWNhL3N0b3JlL3Byb2R1Y3RzL3RyaWFuZ2xlLXN0cmF0ZWd5LXN3aXRjaC8iLCJjb250ZW50VXVpZCI6Ijc0Mzg2MmRkLWM3YmYtNGQ5Mi1iNDM0LTRlMDE4NzE5NDJlZiJ9&amp;signature=AQAAASjw9RM8LrROdip7fXkgPSGKox5QXpDvx35i4LtcMp8N&amp;gcReferrer=https%3A%2F%2Fwww.nintendo.com%2Fen-ca%2Fstore%2Fproducts%2Ftriangle-strategy-switch%2F\">Triangle Strategy</a></h2><div id=\"2c314eb571da4a43923be9b1ceffaf71\"></div><p>As a longtime fan of the SRPG genre, no game in the last decade has managed to evoke classics like <em>Final Fantasy Tactics</em> and <em>Tactics Ogre</em> more than <em>Triangle Strategy</em>. I admit it’s a bit of a slow burn and it gets a bit text-heavy, but with multiple endings (including a New Game+ mode), a deep roster of characters and rewarding turn-based combat, this game has it all. And thanks to its art style, which masterfully blends old-school sprites with a modern 2.5D approach, this game looks and feels like a love letter to those all-time greats of the late 90s. If you’re a fan of tactics games, <em>Triangle Strategy</em> is a must-play. – S.R.</p><h2><a href=\"https://store.steampowered.com/app/1794680/Vampire_Survivors/\">Vampire Survivors</a></h2><div id=\"6d32367fce614005bb077c1d92324d80\"></div><p>I had such good intentions for my <a href=\"https://www.engadget.com/steam-deck-review-small-hands-180026719.html\">Steam Deck</a>. I swore I'd use it to get through my Steam backlog and stream a bunch of games from Xbox Cloud Gaming and <a href=\"https://www.engadget.com/google-shutting-down-stadia-162704135.html\">Stadia (RIP)</a>. Sure, I do those things, but only on the rare occasion I can rip my attention away from <em>Vampire Survivors</em>.</p><p>It is a rudimentary-looking game with very basic controls. You'll face hordes of monsters, but because your weapons autofire, the only real control you have is using the thumbstick or touch controls to move your character. You'll need to carefully juke away from some enemies while getting close enough to kill others and pick up the experience gems they drop. After you collect enough gems and level up, you’re able to select another weapon or powerup.</p><p>This is where many of the game's intricacies come in. You'll get a random selection of weapons and power-ups to choose from at every level, as well as the ability to make your items more powerful. If you find the right pairings, you can evolve weapons into ultra-powerful forms. <em>Vampire Survivors</em> is the perfect distillation of the power fantasy. Flesh out the right build and you'll carve through bosses that once seemed unbeatable like a lightsaber through ice cream.</p><p>This game begs you to keep coming back. Since it debuted in early access last December, developer Poncle has frequently updated the game with more characters, weapons, items and levels. Part of the joy is in building different loadouts that can demolish enemies with ease. Vampire Survivors also shares some DNA with casinos. There's an explosion of color and some upbeat, tension-filled music whenever you open a treasure chest, along with a delightful chime whenever you grab a gem – you will hear that a lot. These aspects don't exactly make it easy to put the game down.</p><p>I love my Steam Deck. I love <em>Vampire Survivors</em>. Together, they have a toxic hold over my desire to play other games. I could simply uninstall <em>Vampire Survivors </em>from my Deck, but, really, what's the point when I can just <a href=\"https://www.engadget.com/vampire-survivors-ios-android-mobile-free-005055880.html\">play it on my phone now?</a><em>– K.H.</em></p><h2><a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=c813ae39-7d58-41cb-ac66-ad830606ceef&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=The+New+York+Times&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiJjODEzYWUzOS03ZDU4LTQxY2ItYWM2Ni1hZDgzMDYwNmNlZWYiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cubnl0aW1lcy5jb20vZ2FtZXMvd29yZGxlL2luZGV4Lmh0bWwiLCJjb250ZW50VXVpZCI6Ijc0Mzg2MmRkLWM3YmYtNGQ5Mi1iNDM0LTRlMDE4NzE5NDJlZiJ9&amp;signature=AQAAAbKKrx_zatro138syHhnf5j0fWaZIRj2wkYFJdzfmRrB&amp;gcReferrer=https%3A%2F%2Fwww.nytimes.com%2Fgames%2Fwordle%2Findex.html\">Wordle</a></h2><figure><img alt=\"Woman plays Wordle on her smartphone from the living room of her home on 21st April 2022 in Birmingham, United Kingdom. Wordle is a web-based word game played by millions of users / players worldwide often on their mobile devices. The game was created and developed by software engineer Josh Wardle, and owned by The New York Times Company since 2022. (photo by Mike Kemp/In Pictures via Getty Images)\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-05/2ffa94e0-d038-11ec-bb56-a859f5a5da45\" /><figcaption></figcaption><div class=\"photo-credit\">Mike Kemp via Getty Images</div></figure><p>For a while in 2022, a word game brought the world together. Because it’s the same puzzle for every single player each day, Wordle was a giant inside joke amongst solvers across international boundaries. At Engadget, for example, London-based Mat Smith could give me hints or laugh at my inability to guess a word he got.</p><p>I also loved sharing and seeing the little blocks that showed how many tries it took us to solve the word. It was a chance to both bond and brag – the perfect gaming experience. Plus, whenever a word was controversial, whether it was spelled in US or UK English, for example, I loved the inevitable debate that would result. In 2022, Wordle gave us an elevated form of watercooler conversation fodder, but for the entire world.</p><p>Although technically launched in 2021, Wordle found widespread popularity in 2022. It was born from software engineer Josh Wardle’s desire to make a word game for him and his partner Palak Shah to play together. But it was when the user base expanded beyond his family to encompass the entire globe that Wordle took on a life of its own.</p><p>Countless iterations were spawned, building on the format and name… which itself was based on Wardle’s last name. You may have seen examples like Heardle, Worldle, Squirdle, Absurdle and more, using the puzzle’s format for us to guess songs, countries and other subjects. As always happens with anything popular, hundreds of websites published guides to beating the game, while scores of clones popped up in the Android and iOS app stores, hoping to cash in on the fever. Wardle later <a href=\"https://www.engadget.com/wordle-nyt-new-york-times-sale-215510156.html\">sold the game to the New York Times</a> for an undisclosed sum that was reported to be in the low seven digits, and soon, just as quickly as the fever started, the game’s popularity subsided. Thanks to Wordle, we all may be leaving 2022 just a little bit savvier about the most common letters and words in the English language. <em>–  Cherlynn Low, Deputy Editor</em></p><h2><a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=21fc7c82-c5eb-49a9-b5d3-fc32a78290de&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Nintendo&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiIyMWZjN2M4Mi1jNWViLTQ5YTktYjVkMy1mYzMyYTc4MjkwZGUiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cubmludGVuZG8uY29tL2VuLWNhL3N0b3JlL3Byb2R1Y3RzL3hlbm9ibGFkZS1jaHJvbmljbGVzLTMtc3dpdGNoLyIsImNvbnRlbnRVdWlkIjoiNzQzODYyZGQtYzdiZi00ZDkyLWI0MzQtNGUwMTg3MTk0MmVmIn0&amp;signature=AQAAAcoIKrzwqRPRYtPoAG_6oivzwAel_qssJKlG05FOG4v-&amp;gcReferrer=https%3A%2F%2Fwww.nintendo.com%2Fen-ca%2Fstore%2Fproducts%2Fxenoblade-chronicles-3-switch%2F\">Xenoblade Chronicles 3</a></h2><div id=\"15ebdaa36f394ae297d350423431c33e\"></div><p>Getting into a new role-playing game series can be hard sometimes. This is especially true when you’ve allied yourself with a certain studio or series  – and we are into double digits in the <em>Trails</em> series, not to mention the juggernaut that is <em>Final Fantasy</em>. It’s trickier to reorient yourself to completely new gameplay dynamics, series in-jokes that fly over your head and just, well, things being different.</p><p>That means I’m late to playing critically acclaimed RPGs – I have to be in the right mindset. So how did <a href=\"https://www.engadget.com/nintendo-direct-xenoblade-chronicles-3-date-153058380.html\"><em>Xenoblade Chronicles 3</em></a><em>&nbsp;</em>weasel its way into my heart? I think it’s because I was told by several people, both gaming critics and friends, that it was a perfect entry into the series, regardless of whether you’d played its predecessors. They weren’t wrong.</p><p>It’s a nice game to approach with a blank slate because it goes through around three different tonal gear shifts before you entirely know exactly what the heck is going on. While I don’t want to ruin the anime-nodding plot twists, several of which you will see coming from a mile away, the game starts with a sci-fi, steam-punk high-concept scenario. Teen warriors on two factions are pitted against each other, waging wars with mechs, but also close-range weapons. It turns out direct kills are the only way to leech their enemy’s life force, building up a store in their base’s “flame clock” and ensuring a squad’s survival. They have to fight, to <em>live</em>.</p><p>Noah and two of his allies clash against Mio and her retinue, and after the battle ends in a draw – and I get to enjoy a slick, anime-styled battle movie between all six – the fates conspire to ensure <em>this</em> is your group of warriors, and only they can save the world.</p><p>With a wide range of classes to wield and master, as well as the ability to add a guest warrior to your squad pretty much any time throughout the game, battles initially seem chaotic, but I soon got attuned to the rhythm. Defenders will coax enemies into targeting them, allowing your heavy-hitting attackers to wail on them from the side or back – positioning is <em>crucial</em>. Meanwhile, your healers will ensure your defender doesn’t fall and amp up damage either with area-specific skills or targeted attacks on enemies. Also, your epic, charge-them-up-in-battle Interlink attacks are accompanied by such a high-energy soundtrack, it’s hard not to feel like a hero.</p><p>There are some big pacing problems in places, and when you get the ability to combine with your allies and form powerful Evangelion-esque avatars, you wonder exactly what can stop them at times. But it’s a vast adventure with several compelling side quests to fill out your time in Aionios. Annoyingly, it’s won me over – and I have since downloaded the original <em>Xenoblade Chronicles </em>(and its sequel) to play in 2023. <em>– M.S.</em></p>", "persistent": false, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "link": "https://www.engadget.com/best-sci-fi-movies-books-shows-141537070.html?src=rss", "title": "The best sci-fi movies, books and shows to consume over the holidays", "date_published": "2022-12-26 14:15:37+00:00", "description": "<p>If you need a break from the hustle and cheer of the holidays, there’s nothing better than the ultimate escapist genre: sci-fi. This year has been a good one for those who like their entertainment off-planet or otherwise removed from our reality. We finally got a <em>Predator</em> sequel that isn’t silly; the author of <em>Station Eleven</em> released her highly anticipated new book; Star Wars proved it’s ready to grow up; and the production company A24 brought us one of the most exhilarating movies in years. There are even a number of sci-fi podcasts that can keep you company while you wrap presents or decorate your home with tinsel and lights. Here are some of the best sci-fi movies, books and shows as of late that you can binge over the holidays.</p><h2>TV</h2><h2></h2><h3><strong>Resident Alien</strong></h3><figure><img alt=\"Resident Alien\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/47e609c0-75b2-11ed-87fa-1530f0805f61\" /><figcaption></figcaption><div class=\"photo-credit\">Syfy</div></figure><p>If you still miss <em>Northern Exposure</em> 27 years after its finale aired and thought Wash was the best part of <em>Firefly</em>, you’ll find something to appreciate in Syfy’s <em>Resident Alien</em>. Now in its second season on the <a href=\"https://www.syfy.com/syfy-app\">Syfy app</a> and <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=cbef8901-c2f3-4af7-b1b7-e2c3afcffd7a&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Peacock+TV&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiJjYmVmODkwMS1jMmYzLTRhZjctYjFiNy1lMmMzYWZjZmZkN2EiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cucGVhY29ja3R2LmNvbS93YXRjaC9hc3NldC90di9yZXNpZGVudC1hbGllbi83MDY3NDI3NzE0MzM1NDg2MTEyIiwiY29udGVudFV1aWQiOiI1YTkzN2I5Zi1mNGM2LTRlMmQtYmZjNC1jOGQwMDFjZDQwMmYifQ&amp;signature=AQAAAQsLVkQdtp7n291rkmLw2zObOeNk6YjiQQBfqMCPgWca&amp;gcReferrer=https%3A%2F%2Fwww.peacocktv.com%2Fwatch%2Fasset%2Ftv%2Fresident-alien%2F7067427714335486112\">Peacock</a>, the show follows a doctor, new to a small, snowy town, who’s actually an alien that came to Earth to exterminate humanity – except he’s misplaced his world-killer device. The extraterrestrial, played with gusto by Alan Tudyk, pretends to be Harry the human while getting into plenty of sitcom-style hijinks with a roster of quirky characters.</p><span id=\"end-legacy-contents\"></span><p>Two subplots expand the fish-out-of-water story: one about the recent murder of the former town physician, the other involving a secret government organization that’s hunting down the alien and his ship. It’s spit-your-drink-out funny and expertly plays with the small-town TV tropes we know and love. It’s also occasionally touching, particularly in moments between Harry and Max, a 10-year-old boy who happens to be the only person who can see past Harry’s human disguise.</p><h3><strong>Severance</strong></h3><figure><img alt=\"Adam Scott in 'Severance' on Apple TV+\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-01/8a202400-78a2-11ec-bf8f-88b23f956e6c\" /><figcaption></figcaption><div class=\"photo-credit\">Apple</div></figure><p>In my personal accounting, <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=4130e2f0-a14f-4c5e-bdab-cd52ac7d8e79&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Apple&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI0MTMwZTJmMC1hMTRmLTRjNWUtYmRhYi1jZDUyYWM3ZDhlNzkiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYXBwbGUuY29tL2FwcGxlLXR2LXBsdXMvP2l0c2NnPTEwMDAwJml0c2N0PWF0di0wLWFwbF9ocC1wbW9fbHJuLWFwbC1hdmwtMjEwOTE2IiwiY29udGVudFV1aWQiOiI1YTkzN2I5Zi1mNGM2LTRlMmQtYmZjNC1jOGQwMDFjZDQwMmYifQ&amp;signature=AQAAARAW8nRPJYBHLBxRy2zzh9GaSQrcSahd8YUVC5ewCdaP&amp;gcReferrer=https%3A%2F%2Fwww.apple.com%2Fapple-tv-plus%2F%3Fitscg%3D10000%26itsct%3Datv-0-apl_hp-pmo_lrn-apl-avl-210916\">Apple TV+</a> wins the streaming war this year, and <a href=\"https://tv.apple.com/us/show/severance/umc.cmc.1srk2goyh2q2zdxcx605w8vtx\"><em>Severance</em></a> is among the best of their offerings. That’s saying a lot, considering <a href=\"https://www.engadget.com/slow-horses-season-2-dead-lions-review-080042215.html\"><em>Slow Horses</em></a>, <em>Afterparty</em>, <a href=\"https://www.engadget.com/apple-renews-pachinko-213127201.html\"><em>Pachinko</em></a> and <em>Black Bird</em> all debuted on the streaming service in 2022. Not to mention the intelligent and pitch-dark time traveling serial killer thriller, <a href=\"https://www.engadget.com/apple-tv-plus-shining-girls-trailer-231759103.html\"><em>Shining Girls</em></a>. Where that show was awash in visceral, back-alley terror, <a href=\"https://www.engadget.com/apple-tv-plus-severance-trailer-213716350.html\"><em>Severance</em></a> occupies a cleaner, tech-washed version of reality, but one that’s no less nightmarish.</p><p>Weaponizing the ideals of modern working life against us – the minimalist, high-design office, a strict work-life balance – <em>Severance</em> tells the story of employees at Lumon. While we’re not sure what they do, we do know they’ve all undergone a surgical procedure to separate their work brains from their personal brains, effectively creating two different people. The delight lies in figuring out who these people <em>really</em> are (and what that even means), and sussing out what’s actually going on at Lumon. Gorgeous in a sterile, Apple Store kind of way, <em>Severance</em> is anchored by exacting performances from Adam Scott, Patricia Arquette, Christopher Walken and John Turturro. And yes, to keep us from rioting in the streets after season one’s cliffhanger, there will be a season two.</p><h3><strong>The Peripheral</strong></h3><figure><img alt=\"Chloe Grace Moretz\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/f4bcba80-7694-11ed-9edf-0cc73608e12d\" /><figcaption></figcaption><div class=\"photo-credit\">Prime Video</div></figure><p>With a William Gibson novel as source material and <em>Westworld</em> creators as producers, <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9UaGUtUGVyaXBoZXJhbC1TZWFzb24tMS9kcC9CMEI4VEZNWVhaP3RhZz1nZGd0MGMtcC1vLWM5LTIwIiwiY29udGVudFV1aWQiOiI1YTkzN2I5Zi1mNGM2LTRlMmQtYmZjNC1jOGQwMDFjZDQwMmYifQ&amp;signature=AQAAAa1gWV_kxtoPXReMefXbs8mX7_Y_-u1Jlb6yC6onGW1f&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FThe-Peripheral-Season-1%2Fdp%2FB0B8TFMYXZ\"><em>The Peripheral</em></a> has a strong sci-fi pedigree. The assured performance by Chloë Grace Moretz and a particularly lush set design make <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9UaGUtUGVyaXBoZXJhbC1TZWFzb24tMS9kcC9CMEI4VEZNWVhaP3RhZz1nZGd0MGMtcC1vLWM5LTIwIiwiY29udGVudFV1aWQiOiI1YTkzN2I5Zi1mNGM2LTRlMmQtYmZjNC1jOGQwMDFjZDQwMmYifQ&amp;signature=AQAAAa1gWV_kxtoPXReMefXbs8mX7_Y_-u1Jlb6yC6onGW1f&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FThe-Peripheral-Season-1%2Fdp%2FB0B8TFMYXZ\">Amazon Studios’</a> new production a treat for the eyes and ears – it gives your brain something to chew on, too.</p><p>Set both 10 years in the future in North Carolina and 77 years in the future in a post-apocalyptic, hologram-clad London, the show centers on Moretz’s Flynne, a woman trying to make enough money to care for her ailing mother by working her job at the local 3D print shop and by helping rich folks level up in VR games. When her brother lands a gig to try out a new headset, Flynne, being the better player, heads into the sim. Turns out, it’s not a sim, but a quantum tunnel into the future in which she controls perfectly rendered robots – the first one modeled after her brother, then one based on herself. Of course, putting on the headset ignites a world of troubles, some of which show up on Flynne’s doorstep.</p><p>There’s plenty of Gibson’s characteristic techno-cool terminology, and metaphysical and temporal intricacies that you’ll have to watch closely to figure out – you’ll get little hand-holding here – but the head-scratching opaqueness that obscured <em>Westworld’</em>s later seasons don’t really apply. Look for answers and you’ll find them, plus you’ll have a lot of cyberpunk-fueled fun along the way.</p><h3><strong>Andor</strong></h3><figure><img alt=\"Andor\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-05/606be2c0-dd2e-11ec-b7fe-1ae351d33a0f\" /><figcaption></figcaption><div class=\"photo-credit\">Lucasfilm/Disney</div></figure><p>The scads of people who are calling <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=85d85ef3-fac9-418f-9573-418cf162cd0c&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Disney%2B&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI4NWQ4NWVmMy1mYWM5LTQxOGYtOTU3My00MThjZjE2MmNkMGMiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuZGlzbmV5cGx1cy5jb20vc2VyaWVzL3N0YXItd2Fycy1hbmRvci8zeHNRS1dHMDBHTDUiLCJjb250ZW50VXVpZCI6IjVhOTM3YjlmLWY0YzYtNGUyZC1iZmM0LWM4ZDAwMWNkNDAyZiJ9&amp;signature=AQAAAZlocz9FCQ6OKC_UgjZKasc9lhg8VJqSzuFc1-Q16rzc&amp;gcReferrer=https%3A%2F%2Fwww.disneyplus.com%2Fseries%2Fstar-wars-andor%2F3xsQKWG00GL5\"><em>Andor</em></a> the best product in the Star Wars franchise aren’t wrong. Turning the camera away from the galaxy’s royal Skywalker family, the new <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=85d85ef3-fac9-418f-9573-418cf162cd0c&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Disney%2B&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI4NWQ4NWVmMy1mYWM5LTQxOGYtOTU3My00MThjZjE2MmNkMGMiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuZGlzbmV5cGx1cy5jb20vIiwiY29udGVudFV1aWQiOiI1YTkzN2I5Zi1mNGM2LTRlMmQtYmZjNC1jOGQwMDFjZDQwMmYifQ&amp;signature=AQAAAbxGuGKruDn1qkSgKnCwWYUvLgn09re62CY4_Y8zKyHd&amp;gcReferrer=https%3A%2F%2Fwww.disneyplus.com%2F\">Disney+</a> series follows Cassian Andor, who you may remember from <em>Rogue One</em> as the relative nobody in a band of nobodies who made sure the Death Star plans got into the hands of the Rebel Alliance so Luke could do his thing.</p><p>The series takes place five years before the events of <em>Rogue One</em> and replaces the melodrama of the saga and grandiosity of the Force with a human story on a human scale. It’s about a man who makes his own journey towards rebellion, instead of that rebellion being a predestined fact. Faced with an Empire that’s disturbingly bureaucratic in its repression, Cassian assists with a heist that prods the Empire to bring down its fist across the galaxy. Watching it gives you a detailed sense of the universe where Star Wars takes place, with fully realized worlds, mature storylines, and characters that don’t feel far, far away.</p><h2>Movies</h2><h2></h2><h3><strong>Prey</strong></h3><figure><img alt=\"Naru (Amber Midthunder) and the Predator (Dane DiLiegro), shown. (Photo by David Bukach.)\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/82bee240-7681-11ed-9b73-fb39b7e16ecc\" /><figcaption></figcaption><div class=\"photo-credit\"> HULU</div></figure><p>The 1987 sci-fi action classic <em>Predator</em> pits a band of heavily armed and macho soldiers against an extraterrestrial who likes to occasionally drop by Earth to hunt humans. Peak-form Arnold Schwarzenegger is the last man standing, and honestly looks pretty ragged in that final chopper ride out of the jungle. So how would a young Comanche woman in the early 1700s fare against a similar alien encounter? Pretty damn well, as it turns out.</p><p>Easily the best sequel in the Predator franchise, <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=ca19dea0-e7ad-4f54-beed-6302bce56589&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Hulu&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiJjYTE5ZGVhMC1lN2FkLTRmNTQtYmVlZC02MzAyYmNlNTY1ODkiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuaHVsdS5jb20vbW92aWUvcHJleS01NTM0OTc2NC0zMjNlLTRkMGUtODk4Zi1hNGMxMmM5YmY2MTUiLCJjb250ZW50VXVpZCI6IjVhOTM3YjlmLWY0YzYtNGUyZC1iZmM0LWM4ZDAwMWNkNDAyZiJ9&amp;signature=AQAAAQ1XjRSnksNvJnHCZIhhcF1woBsV1AsNd2xA_KO0Ezdp&amp;gcReferrer=https%3A%2F%2Fwww.hulu.com%2Fmovie%2Fprey-55349764-323e-4d0e-898f-a4c12c9bf615\">Hulu's Prey</a> takes place on the Great Plains where Naru, played with steel by Amber Midthunder, dreams of proving herself as a hunter and warrior. With her dog by her side and a throwing axe in hand, Naru gets a chance to do just that as she faces off against predators of the animal kind (bears and mountain lions), the human variety (French fur trappers) and ultimately, one from another planet. Special attention was paid to historical fidelity with on-set Indiginous advisors and a largely Indigenous cast playing the Comanche tribe members, proving that when Hollywood makes an effort to get things right, everything only gets better.</p><h3><strong>Everything Everywhere All at Once</strong></h3><figure><img alt=\"Everything Everywhere All At Once\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/40e72060-75b6-11ed-bef3-856bfbccdca0\" /><figcaption></figcaption><div class=\"photo-credit\">A24</div></figure><p>We need films like <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=a40dab20-176b-4e44-8184-98a609e5443d&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Showtime&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiJhNDBkYWIyMC0xNzZiLTRlNDQtODE4NC05OGE2MDllNTQ0M2QiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuc2hvLmNvbS90aXRsZXMvMzQ5Mzg3NS9ldmVyeXRoaW5nLWV2ZXJ5d2hlcmUtYWxsLWF0LW9uY2UiLCJjb250ZW50VXVpZCI6IjVhOTM3YjlmLWY0YzYtNGUyZC1iZmM0LWM4ZDAwMWNkNDAyZiJ9&amp;signature=AQAAAYDnuhE-R4G4nZwpNV4gBsm255tqAWAF-pvDReMClgHx&amp;gcReferrer=https%3A%2F%2Fwww.sho.com%2Ftitles%2F3493875%2Feverything-everywhere-all-at-once\"><em>Everything Everywhere All at Once</em></a> to remind us of the pure joy movies can make us feel. Picture a mashup of multiverse tropes, Kung Fu action, family drama and absurdist comedy, and you’ll get a sense of what to expect from <em>EEAAO. </em>Michelle Yeoh plays Evelyn, a Chinese-American immigrant living in Simi Valley with her husband and daughter. The laundromat they run is being audited by an IRS examiner played by an uncharacteristically dowdy Jamie Lee Curtis. But before Evelyn makes it to her IRS appointment, she’s told she’s an important player in an inter-dimensional battle against a chaos-loving force known as Jobu Tupaki. Eveyln flits through parallel universes, gaining skills and perspectives as she does, ultimately braiding threads together to figure out what existence “means.”</p><p>The film comes from A24, a production and distribution company with an uncanny knack for fostering wholly original movies in a world awash in reboots and franchises. <em>EEAAO</em> is already racking up awards and nominations to match its overwhelming public acclaim. If you haven’t done so already, watch it and never see hot dogs, rocks or <em>Ratatouille</em> in the same way again.</p><h3><strong>Nope</strong></h3><figure><img alt=\"Nope\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/86594b50-75b6-11ed-9f2f-0124204bb9a4\" /><figcaption></figcaption><div class=\"photo-credit\">Universal Pictures/Monkeypaw Productions</div></figure><p>After the psychological terror of <em>Get Out</em> and grisly horror of <em>Us,</em> director Jordan Peele made <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=cbef8901-c2f3-4af7-b1b7-e2c3afcffd7a&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Peacock+TV&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiJjYmVmODkwMS1jMmYzLTRhZjctYjFiNy1lMmMzYWZjZmZkN2EiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cucGVhY29ja3R2LmNvbS9zdHJlYW0tbW92aWVzL25vcGUiLCJjb250ZW50VXVpZCI6IjVhOTM3YjlmLWY0YzYtNGUyZC1iZmM0LWM4ZDAwMWNkNDAyZiJ9&amp;signature=AQAAAWyzbPyh8rsoe3HSuJfL99QpmyX4zyOFqMbPCKqPWQQd&amp;gcReferrer=https%3A%2F%2Fwww.peacocktv.com%2Fstream-movies%2Fnope\"><em>Nope</em></a> to prove he’s not out of ideas. Daniel Kaluuya plays the lead, as he did in <em>Get Out</em>, this time as a laconic cowboy in a trucker hat. Kaluuya’s OJ and Keke Palmer’s Emerald are a brother and sister team running a struggling ranch outside of Hollywood where they train horses for the movies. When nickels and house keys fall from the sky and the horses start running off, they see there’s something parked above the ranch, hiding in an immovable cloud – something that’s not from here, and definitely not friendly.</p><p>Like everything Peele makes, <em>Nope</em> has plenty of humor to shoot through the tension, and there’s a dose of abounding weirdness – particularly in a side plot about a sitcom chimpanzee. You also sense a clear love of movies coloring the film, with nods to classics like <em>Jaws</em>, <em>Close Encounters of the Third Kind</em> and <em>Alien</em>. In fact, the idea of movie making itself drives the team that comes together against the UFO. The need to get the shot, to document the alien, is just as, if not more, important than self-preservation.</p><h2>Books</h2><h2></h2><h3><strong>Sea of Tranquility</strong></h3><figure><img alt=\"Sea of Tranquility\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/81791470-7684-11ed-b8ff-f0f50716d77e\" /><figcaption></figcaption><div class=\"photo-credit\">Alfred A. Knopf</div></figure><p>If you caught the dreamy, post-apocalyptic miniseries <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy5oYm9tYXguY29tL3Nlcmllcy91cm46aGJvOnNlcmllczpHWVpXb09RNkY5Y0xEQ0FFQUFBQlAiLCJjb250ZW50VXVpZCI6IjVhOTM3YjlmLWY0YzYtNGUyZC1iZmM0LWM4ZDAwMWNkNDAyZiJ9&amp;signature=AQAAAeFbnAq33wsMmeCikP5BL5KnQq5a_afl6rPSGPkH333U&amp;gcReferrer=https%3A%2F%2Fwww.hbomax.com%2Fseries%2Furn%3Ahbo%3Aseries%3AGYZWoOQ6F9cLDCAEAAABP\"><em>Station Eleven on HBO</em></a> last December and wondered if there were any more ideas where that came from, check out Emily St. John Mandel’s latest novel, <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9TZWEtVHJhbnF1aWxpdHktRW1pbHktSm9obi1NYW5kZWwvZHAvMDU5MzMyMTQ0OD90YWc9Z2RndDBjLXAtby1jOS0yMCIsImNvbnRlbnRVdWlkIjoiNWE5MzdiOWYtZjRjNi00ZTJkLWJmYzQtYzhkMDAxY2Q0MDJmIn0&amp;signature=AQAAAQcKwLPH3CyBRpAdXorMUd51WXkKaVOa5GWJdid3xiPO&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FSea-Tranquility-Emily-John-Mandel%2Fdp%2F0593321448\"><em>Sea of Tranquility</em></a>. St. John Mandel wrote the book upon which the HBO series was based, and this time around, she’s exploring what life on a colonized moon would look like while also considering the effects of a space-time anomaly that links together a British Columbian forest, an airship terminal in Oklahoma City and four points in time running from 1912 to 2195. A time traveling agent is sent back from 2401 to investigate, tying together the narrative threads.</p><p>As in <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9TdGF0aW9uLUVsZXZlbi1FbWlseS1Kb2huLU1hbmRlbC9kcC8wODA0MTcyNDQ3P3RhZz1nZGd0MGMtcC1vLWM5LTIwIiwiY29udGVudFV1aWQiOiI1YTkzN2I5Zi1mNGM2LTRlMmQtYmZjNC1jOGQwMDFjZDQwMmYifQ&amp;signature=AQAAAQjT_2IEbdOVLh6GFC8ltL1aqpT-RQt1def_7Gkkned6&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FStation-Eleven-Emily-John-Mandel%2Fdp%2F0804172447\"><em>Station Eleven</em></a>, St. John Mandel pairs wondrous speculation about our future with deeply human stories. Even minor characters are layered and complex, and her philosophical explorations feel important without coming across as dry academic exercises. Also, her sentences are beautiful. Read it now and you’ll be ahead of the game when the adaptation, which is currently in development at HBO Max, comes out.</p><h3><strong>The Candy House</strong></h3><figure><img alt=\"The Candy House\n\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/e0975c50-7684-11ed-9d7d-9410b8b2ce4a\" /><figcaption></figcaption><div class=\"photo-credit\">Simon &amp; Schuster</div></figure><p>Jennifer Egan won a Pulitzer Prize for her essentially perfect 2010 work, <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9WaXNpdC1Hb29uLVNxdWFkLUplbm5pZmVyLUVnYW4tZWJvb2svZHAvQjAwMzZTNEM2Ry8_dGFnPWdkZ3QwYy1wLW8tYzktMjAiLCJjb250ZW50VXVpZCI6IjVhOTM3YjlmLWY0YzYtNGUyZC1iZmM0LWM4ZDAwMWNkNDAyZiJ9&amp;signature=AQAAAfUZ26f1Q2D5loiOGmQfvHzndQEZhClhhZyxT8THor1L&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FVisit-Goon-Squad-Jennifer-Egan-ebook%2Fdp%2FB0036S4C6G%2F\"><em>A Visit from the Goon Squad</em></a> and this year’s <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9DYW5keS1Ib3VzZS1Ob3ZlbC1WaXNpdC1TcXVhZC9kcC8xNDc2NzE2NzY1P3RhZz1nZGd0MGMtcC1vLWM5LTIwIiwiY29udGVudFV1aWQiOiI1YTkzN2I5Zi1mNGM2LTRlMmQtYmZjNC1jOGQwMDFjZDQwMmYifQ&amp;signature=AQAAAZw7apAhzadDyDirOFPb0QB7szXqLwcZYGCImuIws9rc&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FCandy-House-Novel-Visit-Squad%2Fdp%2F1476716765\"><em>The Candy House</em></a> is the sequel. Like <em>Goon Squad</em>, this is a novel told in stories and shifting perspectives. But where the first book focused on music and Gen X aimlessness, this time we’re looking at the technology we willingly give all parts of ourselves to. It’s not hard science fiction, but it does what the genre does best: speculating on a probable future and seeing how we humans react.</p><p>In the near future, a tech giant named Bix (a fleetingly minor character in <em>Goon Squad</em>) creates the next big thing in social media, called the cube, into which you can upload your unconsciousness and share it. Needless to say, there are repercussions. But the effects of the cube aren’t the focus. Instead, technology slips into the lives of the characters, just like all the previously impossible-seeming tech we live with today. Egan is one of the most assured writers I’ve ever read, and the prose is top-form literary stuff. It's never ever boring, and, like the teeming memories of the cube, impossible to look away from.</p><h3>Dead Silence</h3><figure><img alt=\"Dead Silence\n\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/4624faf0-7685-11ed-affd-c20958e92a97\" /><figcaption></figcaption><div class=\"photo-credit\">Tor Nightfire</div></figure><p>Pulitzer Prize-level literature is great. But sometimes you just want a gripping sci-fi story with a missing luxury cruise-liner spaceship in which all the people inside have violently died. Written by S.A. Barnes, who previously wrote under a pen name in the YA space, <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9EZWFkLVNpbGVuY2UtUy1CYXJuZXMtZWJvb2svZHAvQjA5NTFTQ1pSSz90YWc9Z2RndDBjLXAtby1jOS0yMCIsImNvbnRlbnRVdWlkIjoiNWE5MzdiOWYtZjRjNi00ZTJkLWJmYzQtYzhkMDAxY2Q0MDJmIn0&amp;signature=AQAAAWj_WMET97MR81XNccvagIphlNHD4mFlc7cJk5wijR4K&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FDead-Silence-S-Barnes-ebook%2Fdp%2FB0951SCZRK\"><em>Dead Silence</em></a> is part shipwreck hunter, part <em>Event Horizon</em> horror, and part Newt from <em>Aliens’</em> epilogue.</p><p>Taking us to the year 2149, the novel centers on Claire, the team lead on a repair crew responsible for maintaining communication beacons at the edge of the solar system. The team gets a faint distress signal from a Titanic-esque spaceship that disappeared decades ago, halfway into its maiden voyage. Naturally they investigate, and things get disturbing when they discover bodies upon bodies inside the ship. Claire also happens to be the sole survivor of a viral outbreak on a Mars outpost when she was eleven, an experience that has left her with PTSD and more than a little unreliability in the narration department. The book is creepy and scary and mind-trippy and reminds me of the twitchy gratification of reading Stephen King as a teenager (with the lights on).</p><h2>Podcasts</h2><h2></h2><h3><strong>Celeritas</strong></h3><figure><img alt=\"Celeritas\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/1337f520-75b8-11ed-bf6e-a02a5dfe62bf\" /><figcaption></figcaption><div class=\"photo-credit\">Magnesium Film</div></figure><p>The creators of <em>Celeritas</em> (available on <a href=\"https://podcasts.apple.com/us/podcast/celeritas/id1585759882\">Apple Podcasts</a>, <a href=\"https://open.spotify.com/show/1nOTwkIfDVscgd2shkhlZ6\">Spotify</a> and others) bill it as a “cinematic podcast,” which doesn’t mean it’s about movies, but rather that listening to it feels as immersive as experiencing something with both sound and picture. And that description is correct. The narrative centers on an astronaut who pilots the first light-speed space flight, and ends up deep in the future after things go awry.</p><p>From episode one, <em>Celeritas</em> expands the possibilities of the aural medium, which you first notice in the thrilling and densely layered sound design. Then there’s the storytelling, which ditches the audiobook “once upon a time” formula for an approach that takes full advantage of radio-play dynamics. Instead of an astronaut on a space walk delivering exposition or narration to us, we instead hear him intersperse his communication with mission control with a message he records for his daughter as he takes care of mundane EVA procedures. The eighth of 12 planned episodes dropped in late November, and new episodes are released roughly every two months.</p><h3><strong>Flash Forward</strong></h3><figure><img alt=\"Flash Forward\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/3f6a5980-75b8-11ed-b7db-70bc11ad1822\" /><figcaption></figcaption><div class=\"photo-credit\">Flash Forward</div></figure><p>Initially called <em>Meanwhile in the Future</em> when it was launched back in 2015, <em>Flash Forward</em> (available on <a href=\"https://podcasts.apple.com/us/podcast/flash-forward/id994349813\">Apple Podcasts</a>, <a href=\"https://open.spotify.com/show/5wsy0tqZZmsINxUlfz0PrA\">Spotify</a> and others) isn’t usually a sci-fi podcast but rather, one that takes a speculative notion – say, what if all the world’s volcanoes erupted at the same time? – and then talks with experts to try and answer the question.</p><p>It’s a fascinating show in its own right, but then in October of this year, 27 three- to six-minute episodes dropped all at once. They tell the story of Vanguard Estates, an AI-automated retirement home where “you” are deciding whether or not to leave your father. It’s a choose your own adventure podcast that cleverly brings up the increasingly entwined issues of aging, healthcare and robots. Afterwards, creator Rose Eveleth explores those issues in the usual <em>Flash Forward</em> style.</p><h3><strong>Escape Pod</strong></h3><figure><img alt=\"Escape Pod\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/b3e2f060-75b8-11ed-97ff-86adc4ff3975\" /><figcaption></figcaption><div class=\"photo-credit\">Escape Artists</div></figure><p>Throw a dart at any one of the 865 (and counting) episodes of <em>Escape Pod</em> (available on <a href=\"https://podcasts.apple.com/us/podcast/escape-pod/id73329293\">Apple Podcasts</a>, <a href=\"https://open.spotify.com/show/6G8vOC5f6ZuhWmeW4cmgUG\">Spotify</a>, their <a href=\"https://escapepod.org/\">website</a> and more) and you’ll be transported elsewhere. Each weekly episode tells a new short sci-fi story, written by a roster of different writers and narrated by talented voice actors. The episodes range from around 20 minutes to an hour long and cover every sci-fi angle possible: cyberpunk, space exploration, time travel, post-apocalypse, AI and far more. It has amassed numerous awards for podcasting and short fiction and, while I wish each episode included a brief description to make it a little easier to pick and choose, grabbing an episode at random will rarely let you down.</p>", "persistent": false, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "link": "https://www.engadget.com/oneplus-11-january-4-snapdragon-8-gen-2-130102183.html?src=rss", "title": "OnePlus 11 will debut in China on January 4th", "date_published": "2022-12-26 13:01:02+00:00", "description": "<p>The OnePlus 11 is launching globally on <a href=\"https://www.engadget.com/oneplus-11-5g-buds-pro-2-reveal-event-date-140054267.html\">February 7th</a>, but the flagship smartphone will actually make debut in China earlier on January 4th, OnePlus <a href=\"https://weibo.com/oneplusmobile\">announced</a>. The company has also announced pretty much all the specs, including the processor, RAM and storage, showing it'll be right up there with other high-end smartphones.&nbsp;</p><p>The OnePlus 11 will be powered by Qualcomm's <a href=\"https://www.engadget.com/qualcomms-snapdragon-8-gen-2-chip-offers-hardware-accelerated-ray-tracing-230008445.html\">Snapdragon 8 Gen 2 chip</a>, already announced with recent <a href=\"https://www.engadget.com/xiaomi-13-pro-type-1-snapdragon-8-gen-2-101000001.html\">Xiaomi</a> and <a href=\"https://chinese.engadget.com/iqoo-11-series-082540199.html\">Vivo</a> phones. That chip promises not just the usual speed improvements, but upgrades to AI, camera features, 5G speeds and graphics, including ray tracing support.&nbsp;</p><span id=\"end-legacy-contents\"></span><figure><img alt=\"OnePlus 11 set to debut on January 4th with high-end specs\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/363d83a0-8512-11ed-be9e-c3885814150a\" style=\"height: 718; width: 1080;\" /><figcaption></figcaption><div class=\"photo-credit\">OnePlus</div></figure><p>You'll get 12 or 16GB of LPDDR5X RAM, along with up 512GB of UFS 4.0 storage, and it should have OnePlus's Color 13 version of Android 13 right out of the box. Full camera specs have yet to be released, but we're seeing three cameras on a circular module with Hasselblad branding front and center.&nbsp;</p><p>Along with the smartphone (shown in green and black colors), OnePlus is expected to unveil the Buds Pro 2 and TWS earbuds on January 4th, and also internationally in February. We should learn all the details (perhaps apart from international pricing) at the event on January 4th, though you'll have to pay close attention with CES 2023 going on at the same time.&nbsp;&nbsp;</p>", "persistent": false, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "link": "https://www.engadget.com/microsofts-humble-note-pad-might-become-one-of-the-first-tabbed-windows-11-apps-103408955.html?src=rss", "title": "Microsoft's humble NotePad might be getting tabs in Windows 11", "date_published": "2022-12-26 10:34:08+00:00", "description": "<p>Shortly after Windows 11 arrived, Microsoft made some <a href=\"https://blogs.windows.com/windows-insider/2021/12/07/redesigned-notepad-for-windows-11-begins-rolling-out-to-windows-insiders/\">key improvements</a> in the Notepad app that hasn't seen much change since the Windows 95 days. Now, it may be introducing an even bigger feature, judging by a leak from a senior Microsoft product manager spotted by <a href=\"https://www.theverge.com/2022/12/24/23525732/microsoft-windows-11-notepad-tabs-feature-leak\"><em>The Verge</em></a>. &quot;Notepad in Windows 11 now has tabs!&quot; the person said on Twitter, before the tweet was deleted several minutes later.&nbsp;</p><p>The screenshot included in the tweet shows two tabs, along with a note &quot;confidential, don't discuss features or take screenshots.&quot; That warning clearly failed to do the job, but the screenshot indicates that tabs are in testing and may arrive to Windows Insiders sometime down the road.</p><span id=\"end-legacy-contents\"></span><figure><img alt=\"Microsoft's humble NotePad might be getting tabs in Windows 11\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/52001060-8505-11ed-b3ef-4b2929348c6e\" style=\"height: 613; width: 750;\" /><figcaption></figcaption><div class=\"photo-credit\">Microsoft</div></figure><p>Given how much we all depend on tabs in web browsers, it's hard to believe they're not more ubiquitous on other apps. Microsoft added that feature to File Explorer on Windows 11 <a href=\"https://www.engadget.com/windows-11-file-explorer-tabs-cloud-based-redesign-154512479.html\">earlier this year</a>, helping reduce the sprawl across screens when you're searching or copying files. The company did test tabs for Windows 10 apps <a href=\"https://www.engadget.com/2017-11-28-windows-10-sets-tabs.html\">some years ago</a>, but essentially abandoned that project.</p><p>Notepad is an old app, to say the least, having arrived in 1983 to help Microsoft sell people on using a mouse in MS-DOS. Considering it's largely the same plain text editor it was two decades ago, it's amazing it's still used as much as it is. If you're using Notepad so much that you need tabs, my hat's off to you — but the feature is just a rumor until we see it released into the wild.&nbsp;</p>", "persistent": false, "language": "en-US"}], "source": {"url": "https://www.engadget.com/rss.xml", "title": "Engadget"}}