[{"source": "https://www.jefftk.com/news.rss", "title": "Fractional Resignation", "description": "<p><span>\n\nWhen you're playing games you generally want to spend your time\nexploring interesting situations, which are typically ones where there\nare a range of outcomes.  If someone is definitely going to win it's\nnot usually much fun to keep going, and in many gaming cultures when\nyou get to this point it's polite to resign.  The problem is, what do\nyou do when it's only very likely that someone will win?\n\n</span>\n\n<p>\n\nIn some games, this is still a very interesting area to explore, with\nlots of interesting choices even for the losing player, but in others\n(Risk, Go, etc) it would usually be better to stop and play something\nelse.  In these cases, bargaining over fractional resignations can\nwork well.\n\n</p>\n\n<p>\n\n\nFor example, I might think I have an <a href=\"https://www.jefftk.com/p/two-player-catan\">80%\nchance of losing</a>, and if further play doesn't seem fun I could\noffer my opponent 80% of a resignation.  This is something that we\nwould think of as essentially equivalent to them winning four games\nand me winning one game.  If they think they actually have a 90%\nchance of winning we could bargain and maybe end up at 85%, but\nusually that isn't needed.\n\n</p>\n\n<p>\n\nThis does mean that more games end in resignations, but only in cases\nwhere that's what everyone wants.  It works especially well if you're\ngaming with someone who doesn't like to resign if there's a chance,\nbut you're playing games where finishing them off can be just really\ntedious.\n\n</p>\n\n<p>\n\nIn games with more than two players, negotiating fractional\nresignation should still be possible, but I don't think I've ever done\nit.  It's more common for these games to have dynamics that keep it\ninteresting for everyone, however, so this is often less needed.\n\n</p>\n\n<p>\n\n(Avoiding the need for this usually looks like keeping the possibility\nof anyone winning relatively live until the very end, through some\ncombination of randomness, secrecy, and last-shall-be-first dynamics.\nFor example, when I play Modern Art we usually don't know who will win\nuntil we count up the score because people's amounts of money are too\nhard to keep track of, in Ticket to Ride you don't know what sort of\nprogress opponents are making towards their tickets, and in Power Grid\nthe \"penalize the apparently leading player\" dynamic is a strong\nequalizer.)\n\n  </p>\n\n<p><i>Comment via: <a href=\"https://www.facebook.com/jefftk/posts/pfbid02UpS4nivAGY3pbVYZCGRtR8GZUVwvjP5MyvEsMYV66CrgjC2xzpERRfr62yjgiu5pl\">facebook</a>, <a href=\"https://lesswrong.com/posts/7h6kbKBEDeKsQxzsW\">lesswrong</a>, <a href=\"https://mastodon.mit.edu/@jefftk/109583276178129704\">mastodon</a></i></p>", "link": "https://www.jefftk.com/p/fractional-resignation", "date_published": "2022-12-26 08:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]