[{"source": "https://www.theguardian.com/international/rss", "title": "Australia v South Africa: second Test, day two – live", "description": "<ul><li>Updates as the three-Test series continues at the MCG</li><li>Start time in Melbourne is 10:30am/11:30pm GMT</li><li>Any thoughts? <a href=\"mailto:geoff.lemon@theguardian.com\">Email Geoff</a> or tweet <a href=\"https://twitter.com/GeoffLemonSport\">@GeoffLemonSport</a></li></ul><p>If you would like to know what happened yesterday, here is this helpful match report that some nice person wrote for you at stumps last night. It’s still fresh for breakfast.</p><p>A good Melbourne morning to wherever you may be in the world. It is the day after Boxing Day, which makes it the Boxing Day of Boxing Day if you will. If you won’t… well, I’ve got the keyboard. First of all, let me tell you that it is shaping up to be a scorcher. After weeks of cold weather, the early sunlight in Melbourne today has that particular hard glint that Australian sun gets when it is preparing itself to land hammers on the anvil of the earth below. The temperature is already mid-20s and it has just gone 9am. It’s heading northwards.</p> <a href=\"https://www.theguardian.com/sport/live/2022/dec/27/australia-v-south-africa-second-test-day-two-live\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/live/2022/dec/27/australia-v-south-africa-second-test-day-two-live", "date_published": "2022-12-26 23:04:05+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Four people drown in Australian waterways over Christmas weekend", "description": "<p>Three Victorians and a South Australian woman die, while two young girls  rescued in near-drowning at St Kilda beach in Melbourne</p><ul><li><strong><a href=\"https://www.theguardian.com/australia-news/live/2022/dec/27/australia-news-live-heatwave-floods-river-murray-drownings-car-crash-plane-water-safety-heat-weather-emergency-fire-warning\">Follow our Australia news live blog for the latest updates</a></strong><br /></li></ul><p>Three Victorians and a South Australian woman have drowned on Australian waterways in a deadly long weekend.</p><p>A 17-year-old Pakenham boy died near Mordialloc, south of Melbourne, on Monday afternoon.</p> <a href=\"https://www.theguardian.com/australia-news/2022/dec/27/four-people-drown-in-australian-waterways-over-christmas-weekend\">Continue reading...</a>", "link": "https://www.theguardian.com/australia-news/2022/dec/27/four-people-drown-in-australian-waterways-over-christmas-weekend", "date_published": "2022-12-26 22:24:37+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "The Crown and Blake’s 7 actor Stephen Greif dies at 78", "description": "<p>Doctors, Coronation Street and EastEnders among credits of actor whose career included working with RSC and the National Theatre</p><p>Stephen Greif, who appeared in Blake’s 7 and The Crown, has died aged 78, his representatives said.</p><p>The actor had an extensive career on stage and screen and appeared in other series including Doctors, Coronation Street, Tales of the Unexpected and EastEnders.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/26/the-crown-and-blakes-7-actor-stephen-greif-dies-at-78\">Continue reading...</a>", "link": "https://www.theguardian.com/tv-and-radio/2022/dec/26/the-crown-and-blakes-7-actor-stephen-greif-dies-at-78", "date_published": "2022-12-26 22:22:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Nketiah rounds off recovery as Arsenal beat West Ham and go seven clear", "description": "<p>“One Arsène Wenger” was the chant that rang around the Emirates. Sitting up in the directors’ box the old master obliged with a wave. Gabriel Martinelli had just put Arsenal in front, some of the football was reminiscent of their glory years and, on his first visit since departing emotionally in 2018, the architect of those times would have been forgiven a sense that the good old days were coming back.</p><p>Perhaps they really are. Saïd Benrahma’s first-half penalty could have blown Arsenal off course here: maybe the Premier League’s hiatus had checked them in their stride and forced a more realistic view of their title credentials. Prompted by the brilliant Martin Ødegaard, they responded through Bukayo Saka and, after Martinelli’s pivotal strike, Eddie Nketiah, to maintain the idea that their place at the summit is no mere dalliance.</p> <a href=\"https://www.theguardian.com/football/2022/dec/26/arsenal-west-ham-premier-league-match-report\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/26/arsenal-west-ham-premier-league-match-report", "date_published": "2022-12-26 22:11:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Stories of survival and rescue emerge from ‘war with mother nature’ in Buffalo", "description": "<p>Amid a deadly winter storm, heart-warming tales spring forth of neighbors assisting stranded tourists and helping deliver babies</p><p>As the US reels from a winter storm that has killed nearly 50 people nationwide, stories of hope and resilience have nonetheless emerged from America’s hardest hit region, western New York state.</p><p>This storm, which has <a href=\"https://apnews.com/f1efe43064cdae9eb2042db45491b56f#:~:text=BUFFALO%2C%20N.Y.,related%20disasters%20in%20its%20history.\">resulted in 27 deaths around the city of Buffalo</a>, brought hurricane-force winds and nearly four feet of snow in parts of the region, thwarting first responders’ emergency response and rescue efforts. “This is a war with mother nature, and she has been hitting us with everything she has,” New York’s governor Kathy Hochul said.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/26/new-york-buffalo-winter-storm-survival-rescue\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/26/new-york-buffalo-winter-storm-survival-rescue", "date_published": "2022-12-26 21:38:41+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Darwin Núñez ‘unstoppable’ despite frustrations in front of goal, says Klopp", "description": "<ul><li>Manager praises striker’s unselfishness after win at Aston Villa</li><li>Klopp: ‘The scoring in the beginning is not so important’</li></ul><p>Jürgen Klopp reiterated his confidence in Darwin Núñez after Liverpool’s 3-1 victory at Aston Villa, praising the Uruguay striker’s unselfish streak and insisting his £85m record signing is an “unstoppable” force despite his frustrations in front of goal.</p><p>Mohamed Salah equalled Kenny Dalglish’s Liverpool goalscoring mark to open the scoring with his 172nd strike for the club. Núñez missed a golden chance to get on the scoresheet but played a pivotal role in the buildup to the 18-year-old Stefan Bajcetic’s first Liverpool goal, which capped the scoring.</p> <a href=\"https://www.theguardian.com/football/2022/dec/26/darwin-nunez-unstoppable-despite-frustrations-jurgen-klopp-liverpool-aston-villa\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/26/darwin-nunez-unstoppable-despite-frustrations-jurgen-klopp-liverpool-aston-villa", "date_published": "2022-12-26 21:16:11+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Liverpool trying to prise Cody Gakpo from PSV ahead of Manchester United", "description": "<ul><li>23-year-old forward a long-time target of Old Trafford club</li><li>Liverpool have made rapid progress for player valued at £50m</li></ul><p>Liverpool are in advanced talks with PSV Eindhoven over the transfer of the Netherlands forward Cody Gakpo, a long-time Manchester United target.</p><p>Gakpo scored in each of the three group games for Louis van Gaal’s side at the World Cup and has attracted widespread interest after his impressive performances in Qatar. The attacking midfielder has been strongly linked with United, where the manager, Erik ten Hag, is a confirmed admirer and has reportedly met the 23-year-old’s representatives, while Newcastle were interested last summer.</p> <a href=\"https://www.theguardian.com/football/2022/dec/26/liverpool-cody-gakpo-psv-eindhoven\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/26/liverpool-cody-gakpo-psv-eindhoven", "date_published": "2022-12-26 21:09:14+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "US military academy begins removal of Confederate memorials from campus", "description": "<p>The elite military school is taking down monuments from its Hudson Valley, New York, site in accordance with Pentagon orders</p><p>The elite US military academy at West Point is removing Confederate monuments from its Hudson Valley campus in New York state, in accordance with a congressional review and orders set in motion by the Pentagon.</p><p>The removal, which includes a portrait of Gen Robert E Lee in Confederate uniform, began on 18 December. The academy, America’s oldest, said the operation to either take down or modify displays memorializing the Confederacy would be a “multi-phased process”.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/26/west-point-military-academy-removal-confederate-memorials\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/26/west-point-military-academy-removal-confederate-memorials", "date_published": "2022-12-26 20:23:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Arsenal bid for Mykhaylo Mudryk but Shakhtar Donetsk want £85m", "description": "<ul><li>Lightning-quick forward is Arsenal’s top transfer target</li><li>Mudryk, 21, has made it clear he would entertain move</li></ul><p>Arsenal have made a formal offer to Shakhtar Donetsk for the winger Mykhaylo Mudryk, who is their top target in the forthcoming transfer window, although their bid is believed to fall some way short of the Ukrainian club’s asking price.</p><p>Mudryk, a lightning-quick forward who turns 22 next month, has been a long-term target for the Premier League leaders and has attracted considerable interest from elsewhere too. Brentford were willing to make him their club-record signing during the summer but Shakhtar, notoriously tough negotiators, were unmoved by the Bees’ interest. Arsenal did not join in the bidding but the Guardian understands they have now moved with a view to securing the Ukraine international in January.</p> <a href=\"https://www.theguardian.com/football/2022/dec/26/arsenal-bid-for-mykhaylo-mudryk-but-shakhtar-donetsk-want-85m\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/26/arsenal-bid-for-mykhaylo-mudryk-but-shakhtar-donetsk-want-85m", "date_published": "2022-12-26 19:54:38+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Ukraine aims for UN-backed peace summit with Russia in February", "description": "<p>Aggressor must first face war crimes tribunal, says foreign minister Dmytro Kuleba, who says war will end in ‘a diplomatic way’</p><p>Ukraine is aiming to hold a peace summit by the end of February – preferably at the United Nations with its secretary general, António Guterres, as a possible mediator – according to its foreign minister. </p><p>But Dmytro Kuleba said that Russia could only be invited if the country faced a war crimes tribunal first.</p> <a href=\"https://www.theguardian.com/world/2022/dec/26/ukraine-aims-for-un-backed-peace-summit-with-russia-in-february\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/26/ukraine-aims-for-un-backed-peace-summit-with-russia-in-february", "date_published": "2022-12-26 19:44:25+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Teenager Stefan Bajcetic makes instant impact in Liverpool win at Aston Villa", "description": "<p>This was not a vintage Liverpool performance by any stretch but there were glimmers of sparkle as they dispatched Aston Villa and put their foot back on the accelerator in pursuit of the top four. Mohamed Salah got the ball rolling, equalling Kenny Dalglish’s goalscoring mark for Liverpool in almost double-quick time before Virgil van Dijk increased Liverpool’s first-half advantage. Villa deservedly replied through Ollie Watkins but a composed finish by the 18-year-old substitute Stefan Bajcetic for his first Liverpool goal left the away support rattling through their version of a Christmas classic. “Merry Christmas, Everton!” they sang as the celebrations continued.</p><p>Klopp’s festive message to supporters touched on various themes, from his admiration for Love, Actually and the “crazy world we are living in at the moment”, to Liverpool’s Champions League final defeat in May – “Mr Courtois had a pretty good day” – and, most pertinently, moving to “within punching distance” of the top four. Within 37 entertaining minutes here, they had homed in on fourth-placed Tottenham, whom they are now only five points behind with a game in hand.</p> <a href=\"https://www.theguardian.com/football/2022/dec/26/aston-villa-liverpool-premier-league-match-report\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/26/aston-villa-liverpool-premier-league-match-report", "date_published": "2022-12-26 19:33:19+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Arsenal v West Ham: Premier League – live", "description": "<ul><li>Updates from the 8pm GMT kick-off at the Emirates</li><li><a href=\"https://www.theguardian.com/football/live\">Scoreboard: All the Boxing Day results</a></li><li>Get in touch: you can contact Simon <a href=\"mailto:simon.burnton@theguardian.com\">by email</a> or <a href=\"https://twitter.com/Simon_Burnton\">Twitter</a></li></ul><p>What an awfully-timed World Cup that was for Arsenal. Top of the table, with points dropped in only one of their last nine league games, they were absolutely flying when the pause button was pressed in early November. Now we wait to discover whether that momentum has survived the last six weeks. For all their quality (and the fact that the last time they lost at home on Boxing Day was so long ago that one of their centre-backs that day is now 64 (1987 and David O’Leary, since you ask), a run the Hammers have twice tried and failed to end) this might not be a bad time to play them. There has only been one goalless draw between these teams since then, promisingly. West Ham started the season against Manchester City, and now have to restart it against Arsenal, which is a bit rum. I have a feeling in my bones that this game might be a good ’un, but then I am an incorrigible optimist. Welcome! </p> <a href=\"https://www.theguardian.com/football/live/2022/dec/26/arsenal-v-west-ham-premier-league-live\">Continue reading...</a>", "link": "https://www.theguardian.com/football/live/2022/dec/26/arsenal-v-west-ham-premier-league-live", "date_published": "2022-12-26 19:04:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Denver Broncos sack first-year head coach Nathaniel Hackett after 4-11 start", "description": "<ul><li>Denver terminate rookie head coach Nathaniel Hackett</li><li>Broncos were blown out 51-14 by Raiders on Christmas</li></ul><p>The Denver Broncos have fired first-year head coach Nathaniel Hackett with two games left in the season.</p><p>Owner and CEO Greg Penner said he’ll lead the search for a new coach with assistance from GM George Paton, in whom he expressed confidence Monday while announcing <a href=\"https://twitter.com/Broncos/status/1607432324152426496?s=20&amp;t=ptRR7Kbi9InGOMA4jA3oYw\">Hackett’s dismissal</a>.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/26/nathaniel-hackett-fired-denver-broncos\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/dec/26/nathaniel-hackett-fired-denver-broncos", "date_published": "2022-12-26 18:59:24+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "China starts to drop quarantine requirement for overseas passengers", "description": "<p>Eight days of isolation will no longer be needed for some visitors, and officials say citizens’ ability to travel will be slowly restored</p><p>China will drop Covid-19 quarantine requirements for passengers arriving from abroad from 8 January, its National Health Commission has announced in the latest easing of the country’s once-strict virus-control measures.</p><p>Currently, arriving passengers must quarantine for five days at a hotel, followed by three days at home. At one stage there was a requirement to quarantine for three weeks.</p> <a href=\"https://www.theguardian.com/world/2022/dec/26/china-starts-to-drop-quarantine-requirement-for-overseas-passengers\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/26/china-starts-to-drop-quarantine-requirement-for-overseas-passengers", "date_published": "2022-12-26 18:50:50+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "US airline pilot adopts dog abandoned by traveler at airport", "description": "<p>The owner of Polaris decided to journey onward from San Francisco after paperwork difficulties arose for the young canine</p><p>One very good boy finally has a very loving home.</p><p>A puppy abandoned at the San Francisco International airport was adopted by an air pilot just in time for the holidays.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/26/us-airline-pilot-adopts-dog-abandoned-at-airport\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/26/us-airline-pilot-adopts-dog-abandoned-at-airport", "date_published": "2022-12-26 18:46:44+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Tributes paid after death of LPGA record-holder Kathy Whitworth", "description": "<ul><li>Whitworth won 88 titles, the most on any professional tour</li><li>Annika Sörenstam: ‘A total class act, she will be sorely missed’</li></ul><p>The world of golf has been paying tribute to the record-breaking former LPGA Tour player Kathy Whitworth after she died at the age of 83 on Christmas Eve. The American’s 88 LPGA wins are the most on any professional tour, exceeding the men’s PGA Tour record of 82 shared by Sam Snead and Tiger Woods.</p><p>She won six major titles – the Titleholders Championship in 1965 and 1966, the 1967 Western Open and the Women’s PGA Championship in 1967, 1971 and finally 1975, the year she was inducted into the World Golf Hall of Fame.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/26/tributes-paid-after-death-of-lpga-record-holder-kathy-whitworth\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/dec/26/tributes-paid-after-death-of-lpga-record-holder-kathy-whitworth", "date_published": "2022-12-26 18:29:10+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "British dual nationals urged to leave Iran after Tehran steps up arrests", "description": "<p>Chair of foreign affairs committee describes ‘industralised taking of state hostages’ in protests crackdown</p><p>All British people still in Iran should leave immediately because of the “industrialised” level of people being taken state hostage, the chair of the foreign affairs select committee has said.</p><p>Alicia Kearns made her call after the Iranian government said it had arrested seven “British linked” suspects including some dual nationals allegedly involved in the country’s anti-government protests, which began 100 days ago.</p> <a href=\"https://www.theguardian.com/politics/2022/dec/26/british-dual-nations-urged-to-leave-iran-tehran-arrests-protest-crackdown\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/dec/26/british-dual-nations-urged-to-leave-iran-tehran-arrests-protest-crackdown", "date_published": "2022-12-26 18:16:19+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Zdenka Fantlová obituary", "description": "<p>Czech actor who described her experiences in surviving several Nazi camps during the Holocaust in her book The Tin Ring</p><p>Zdenka Fantlová, who has died aged 100, was a survivor of the Terezín (Theresienstadt) ghetto, in Nazi-occupied Czechoslovakia, as well as of Auschwitz, Bergen-Belsen and several other concentration camps.</p><p>She was a valuable witness to the remarkable musical and theatrical life in Terezín, featuring in the 1993 BBC2 documentary <a href=\"https://holocaustmusic.ort.org/places/theresienstadt/the-music-of-terezin/\">The Music of Terezín</a>, and wrote an account of her Holocaust experiences in a book, The Tin Ring, first published in 1996.</p> <a href=\"https://www.theguardian.com/world/2022/dec/26/zdenka-fantlova-obituary\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/26/zdenka-fantlova-obituary", "date_published": "2022-12-26 17:44:22+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Antonio Conte hails scorer Harry Kane’s ‘mental strength’ after World Cup blow", "description": "<ul><li>Striker scores at Brentford in first game since penalty miss</li><li>Antonio Conte says opposing fans ‘should clap’ England captain</li></ul><p>Antonio Conte has backed Harry Kane to put his World Cup disappointment behind him and suggested opposition fans should show appreciation for the England striker instead of abusing him, as was the case during Tottenham’s <a href=\"https://www.theguardian.com/football/2022/dec/26/brentford-tottenham-premier-league-match-report\">2-2 draw with Brentford</a> on Monday.</p><p>In his first appearance since <a href=\"https://www.theguardian.com/football/2022/dec/10/england-france-world-cup-quarter-final-match-report\">missing a penalty against France</a> that ultimately cost England the chance to progress in Qatar, Kane found himself on the receiving end of taunts from home supporters at the Gtech Community Stadium, with some suggesting he had let his country down. Kane responded in typical fashion – scoring with a 65th-minute header that sparked a comeback from Spurs after they had found themselves 2-0 down against Thomas Frank’s side.</p> <a href=\"https://www.theguardian.com/football/2022/dec/26/harry-kane-shows-mental-strength-to-overcome-world-cup-disappointment\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/26/harry-kane-shows-mental-strength-to-overcome-world-cup-disappointment", "date_published": "2022-12-26 17:38:37+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Lallana and March on target as Brighton ease to victory at Southampton", "description": "<p> </p><p>Adam Lallana struck against his former club as Brighton inflicted more misery on struggling Southampton with a resounding 3-1 Premier League victory at St Mary’s.</p><p>The Saints academy graduate Lallana benefited from a major blunder from the home goalkeeper Gavin Bazunu to put Albion ahead before Romain Perraud’s calamitous own goal doubled their half-time advantage.</p> <a href=\"https://www.theguardian.com/football/2022/dec/26/southampton-brighton-premier-league-match-report\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/26/southampton-brighton-premier-league-match-report", "date_published": "2022-12-26 17:36:46+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Rayan Aït-Nouri lifts Wolves off the bottom with late winner at Everton", "description": "<p>Discontent was building among the home crowd inside Goodison Park even before the Wolves substitute Rayan Aït-Nouri gave Julen Lopetegui the perfect start to his reign and heightened the pressure on Frank Lampard with a 95th-minute winner against Everton. The French defender pounced in the final minute as Wolves secured a fortunate but dramatic victory that lifted them off the bottom of the Premier League.</p><p>Everton’s overly cautious approach was generating dismay among their fans when James Tarkowski launched one final, long ball towards the Wolves penalty area. It returned with punishing interest, and after Aït-Nouri scrambled home a cross from fellow substitute Adama Traoré Everton were left to reflect on another ineffective, wasteful display. It is now six defeats in eight league games for Lampard’s faltering side. Improvement in the final third cannot come quickly enough for Everton.</p> <a href=\"https://www.theguardian.com/football/2022/dec/26/everton-wolves-premier-league-match-report\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/26/everton-wolves-premier-league-match-report", "date_published": "2022-12-26 17:28:13+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Aston Villa v Liverpool: Premier League – live", "description": "<ul><li>Updates from the 5.30pm GMT kick-off at Villa Park</li><li><a href=\"https://www.theguardian.com/football/live\">Live scoreboard: all today’s results and latest scores</a></li><li>And you can contact Rob <a href=\"mailto:rob.smyth@theguardian.com\">here</a> with your thoughts</li></ul><p><strong>The last six games between these teams</strong> at Villa Park - an unashamedly arbitrary cut-off point - have finished 0-6, 1-2, 5-0, 7-2, 1-4 and 1-2. Thirty one goals in six games!</p><p><strong>Villa start the game in 12th place</strong>, though they will move into the top ten if they win tonight. Liverpool are seventh; victory at Villa Park would move them above Brighton into sixth.</p> <a href=\"https://www.theguardian.com/football/live/2022/dec/26/aston-villa-v-liverpool-premier-league-live\">Continue reading...</a>", "link": "https://www.theguardian.com/football/live/2022/dec/26/aston-villa-v-liverpool-premier-league-live", "date_published": "2022-12-26 17:12:24+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Newcastle climb to second after Almirón and Joelinton sink Leicester", "description": "<p>Not even the World Cup has proved a deterrent in Newcastle United’s pursuit of Champions League football as Eddie Howe’s team climbed into second place in the Premier League with a victory secured in just over half an hour. </p><p>Early goals from Chris Wood, from the penalty spot, Miguel Almirón and Joelinton brought Newcastle a 10<sup>th</sup> win in 11 games in all competitions against one of the division’s supposed in-form teams, for whom the six-week international break in Qatar proved a block rather than a spur. On this evidence, Newcastle should relish hosting these opponents again in a fortnight in the Carabao Cup quarter-final.</p> <a href=\"https://www.theguardian.com/football/2022/dec/26/leicester-newcastle-premier-league-match-report\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/26/leicester-newcastle-premier-league-match-report", "date_published": "2022-12-26 17:11:35+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Aleksandar Mitrovic seals Fulham’s victory at nine-man Crystal Palace", "description": "<p></p><p>Patrick Vieira must be wondering how his side got this so wrong. Crystal Palace’s hopes of recording a fourth successive home victory in the Premier League for the first time in their history were destroyed in a three-minute spell in the first half by a clinical Fulham team led by the brilliant Aleksandar Mitrovic.</p><p>The disastrous defending that allowed Bobby DeCordova-Reid to open the scoring on 31 minutes was compounded by Tyrick Mitchell’s rush of blood to the head that earned him a straight red card and left Vieira’s side with a mountain to climb. Another red card for James Tomkins – making his first Premier League start since Boxing Day last year in absence of the suspended Marc Guehi – and further goals from Fulham’s captain Tim Ream and Mitrovic, with his tenth of the campaign, swept Marco Silva’s side to a deserved victory that leaves them level on points with Liverpool.</p> <a href=\"https://www.theguardian.com/football/2022/dec/26/crystal-palace-fulham-premier-league-match-report\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/26/crystal-palace-fulham-premier-league-match-report", "date_published": "2022-12-26 17:09:52+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Israeli politician suggests doctors could refuse to treat gay patients", "description": "<p>President condemns anti-LGBTQ rhetoric after comment by Orit Strook, which she later said referred to certain procedures</p><p>A suggestion by one of Benjamin Netanyahu’s incoming ministers that Israeli doctors should be allowed to refuse treatment to LGBTQ patients on religious grounds has heightened fears that the new government poses an unprecedented threat to gay rights.</p><p>The Israeli president, Isaac Herzog, has weighed in to condemn the growing anti-LGBTQ rhetoric, saying: “The racist pronouncements of recent days against the LGBTQ community and other sectors of the public make me extremely worried and concerned.” The president, whose post is largely ceremonial but who commands a degree of authority, added that such rhetoric undermined Israeli “democratic and moral values”.</p> <a href=\"https://www.theguardian.com/world/2022/dec/26/israeli-politician-suggests-doctors-could-refuse-to-treat-gay-patients\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/26/israeli-politician-suggests-doctors-could-refuse-to-treat-gay-patients", "date_published": "2022-12-26 16:32:15+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "More than 14,000 in Washington state lose power after energy station attacked", "description": "<p>Christmas Day outages add to an alarming string of incidents with similar power grid vandalism in Oregon and North Carolina</p><p>More than 14,000 people suffered <a href=\"https://www.yahoo.com/gma/2-power-substations-attacked-washington-203500942.html\">power outages</a> in Washington state on Christmas Day following burglaries and a series of vandalisms at different power stations.</p><p>The Pierce county sheriff said in two statements that no suspects have yet been identified for the incidents.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/26/washington-state-energy-station-attacked-christmas-day\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/26/washington-state-energy-station-attacked-christmas-day", "date_published": "2022-12-26 16:16:11+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Classical trash: how Taiwan’s musical trucks transformed ‘garbage island’", "description": "<p>Army of yellow trucks blasting out classical jingles brings out a Pavlovian response to take out bins</p><p>The sound is inescapable. Wherever you are in Taiwan – be it three beers deep at a city bar, floating in the Taiwan Strait, or hauling yourself up a mountain – you’ll still hear the tinny, off-key classical jingle, and it will trigger a Pavlovian surge of panic: I have to take the bins out.</p><p>In the last few decades, Taiwan has transformed itself from “garbage island” to one of the world’s best managers of household trash, and it’s done so with a soundtrack. Armies of yellow trucks trundle through the streets five days a week, blasting earsplitting snippets of either Beethoven’s Für Elise or A Maiden’s Prayer by Tekla Bądarzewska-Baranowska.</p> <a href=\"https://www.theguardian.com/world/2022/dec/26/classical-trash-how-taiwan-musical-truck-transformed-garbage-island\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/26/classical-trash-how-taiwan-musical-truck-transformed-garbage-island", "date_published": "2022-12-26 16:00:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘I would get out of breath running five metres – it’s time to get fit’: the thing I’ll do differently in 2023", "description": "<p>I’d do anything to get out of PE lessons at school. But now I’ve turned 30 and I need to get over my fitness-phobia</p><p>I turned 30 last month, and – naturally – spent the final stretch of my 20s thinking about all of the things I wished I’d done differently. During therapy sessions, I’d go on extended metaphors involving boats, tides and storms, which confirmed my long-held suspicion that I am definitely not a poet at heart. Amid all of the introspection, however, one theme did seem particularly pertinent: exercise, or the lack of it in my life.</p><p>Something (perhaps the slight creak my right hip now makes on a regular basis) was telling me that I needed to do more fitness, and, by “more”, of course I mean “any at all”. And so, here I am, declaring that 2023 will be the year I get over my fitness phobia, the albatross I’ve been dragging around since my very first day at primary school.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/26/new-year-resolution-start-exercising-keeping-fit\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/26/new-year-resolution-start-exercising-keeping-fit", "date_published": "2022-12-26 16:00:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "US public health officials brace for possible Covid-19 surge after holidays", "description": "<p>Concerns over increased influenza and RSV cases also high after indoor gatherings and abandoned preventive measures</p><p>US public health officials are bracing for a possible <a href=\"https://www.theguardian.com/world/coronavirus-outbreak\">Covid-19</a> surge in the coming weeks following indoor holiday gatherings among a populace that has largely abandoned preventive measures.</p><p>Concerns over this uptick come amid rising influenza and <a href=\"https://www.theguardian.com/us-news/2022/dec/01/us-surge-respiratory-virus-rsv-influenza-children-hospitalized\">RSV</a> cases in America. This so-called “<a href=\"https://www.theguardian.com/science/2022/dec/09/rsv-tripledemic-us-europe-covid-flu-respiratory-syncytial-virus\">tripledemic</a>,” experts warn, could further strain the already overburdened US health system.</p> <a href=\"https://www.theguardian.com/world/2022/dec/26/us-public-health-officials-covid-19-surge-holidays\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/26/us-public-health-officials-covid-19-surge-holidays", "date_published": "2022-12-26 15:53:17+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Harry Kane and Pierre-Emile Højbjerg lead Spurs fightback against Brentford", "description": "<p>Better late than never, right? Tottenham Hotspur cannot be counted out this season. However down they might be – in this case they were in the red thanks to goals from Vitaly Janelt and Ivan Toney – there is seemingly always a way back.</p><p>And so Harry Kane and Pierre-Emile Højbjerg proved, ensuring Brentford were unable to claim the victory that for more than an hour seemed likely. It was not the most dramatic of a series of Tottenham comebacks that has seen them claim 14 points from games they were behind in this season There is no doubting their steel, however, though they will be concerned at their habit of conceding first – here they did so for the ninth game in a row.</p> <a href=\"https://www.theguardian.com/football/2022/dec/26/brentford-tottenham-premier-league-match-report\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/dec/26/brentford-tottenham-premier-league-match-report", "date_published": "2022-12-26 15:15:59+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "The classic ocean poetry taking on troubling new meanings", "description": "<p>We hear the call of the sea in poems from Coleridge and Eliot to Kathy Jetn̄il-Kijiner, but those words also sound a warning – if only we would listen</p><p>TS Eliot wrote <a href=\"http://www.davidgorman.com/4quartets/3-salvages.htm\">The Dry Salvages</a> as second world war bombs fell on London. The poem imagines humanity adrift in a leaky boat, the sea “all about us”. But poetry, like the sea, is never still. “Where is there an end to the drifting wreckage,” the poem asks. The answer: “There is no end, but addition” reads differently in 2022 than in 1941, as <a href=\"https://www.science.org/doi/10.1126/science.1260352\">12m tonnes of plastic are added to the oceans each year</a>.</p><p>Reading is tidal, and each tide brings with it new associations. It is difficult now to read <a href=\"https://www.poetryfoundation.org/poems/54932/sea-fever-56d235e0d871e\">John Masefield’s Sea-Fever</a> without thinking of bleaching coral, or Samuel Taylor Coleridge’s <a href=\"https://www.poetryfoundation.org/poems/43997/the-rime-of-the-ancient-mariner-text-of-1834\">The Rime of the Ancient Mariner</a> without picturing <a href=\"https://www.theguardian.com/environment/2018/mar/12/albatross-film-dead-chicks-plastic-saving-birds\">Chris Jordan’s photographs of dead albatross</a>, their stomachs full of brightly coloured plastic. “‘<a href=\"https://www.poetryfoundation.org/poems/42889/hope-is-the-thing-with-feathers-314\">Hope’ is the thing with feathers</a>,” but avian flu is <a href=\"https://www.theguardian.com/environment/2022/jul/20/avian-flu-h5n1-wreaks-devastation-seabirds-aoe\">decimating seabird populations</a>.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/26/the-classic-ocean-poetry-taking-on-troubling-new-meanings\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/dec/26/the-classic-ocean-poetry-taking-on-troubling-new-meanings", "date_published": "2022-12-26 15:09:49+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Harlequins and Bristol look to vent festive frustration in pivotal clash", "description": "<ul><li>Match switched from Twickenham to the Stoop</li><li>Bristol bottom of table while Quins can go second with victory</li></ul><p>For Harlequins and Bristol there is a sense of frustration over their festive fixtures. The match on Tuesday between the two sides ought to be taking place at Twickenham – an annual tradition for Harlequins, who tend to head into January with a spring in their step and their coffers boosted as a result. Bristol, meanwhile, were supposed to be their opponents at HQ, then hosting their own new year’s bash against Wasps next weekend.</p><p>For varying reasons – transport logistics brought on by train strikes in Harlequins’ case, and <a href=\"https://www.theguardian.com/sport/2022/oct/28/wasps-suspended-from-premiership-as-rfu-confirms-relegation\">Wasps’ demise</a> in Bristol’s – neither is happening as planned. It leaves both clubs counting the cost, with Harlequins’ short trip to Twickenham delayed until March for a Six Nations fallow week and the meeting on Tuesday between the two now taking place at the Stoop with frustrations to vent. The bells and whistles that accompany Harlequins’s annual big game are absent but this fixture, which will mark the halfway point in the recalibrated season for the remaining 11 teams, has significance for both.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/26/harlequins-and-bristol-look-to-vent-festive-frustration-in-pivotal-clash\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/dec/26/harlequins-and-bristol-look-to-vent-festive-frustration-in-pivotal-clash", "date_published": "2022-12-26 15:05:08+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Are you bored yet? Four amazing ways to make the most of leftovers, from pigs in blankets to Christmas pud", "description": "<p>Breakfast hash? Sprout salad? Turkey with pasta? Hell, yeah!</p><p>It would be pushing it to claim that leftovers are my favourite part of the festivities but there is a particular pleasure in creating yet more good things from the scraps tidied from the table when everyone has eaten their fill.</p><p>Think of these recipes as suggestions, rather than strict instructions, and tweak them according to what you have to play with. This kind of cooking is all about using things up, rather than buying more, so don’t worry if you don’t have a certain spice or the right kind of onion. Instead, relax, and enjoy the opportunity to experiment after the pressure of the big day. You’ve earned it.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/26/are-you-bored-yet-four-amazing-ways-to-make-the-most-of-leftovers-from-pigs-in-blankets-to-christmas-pud\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/26/are-you-bored-yet-four-amazing-ways-to-make-the-most-of-leftovers-from-pigs-in-blankets-to-christmas-pud", "date_published": "2022-12-26 15:00:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘It’s tough on your body’: bitter cold poses grave threat for US outdoor workers", "description": "<p>As the storm hits vast parts of the US, outdoor workers are pushing for greater protections and compensation</p><p>As millions of Americans around the country experienced the effects of a winter storm, thousands of workers in essential and emergency jobs had no choice but to work outdoors in blizzards and record low temperatures.</p><p><a href=\"https://www.theguardian.com/us-news/2022/dec/23/us-weather-bomb-cyclone-us-christmas-latest\">Over 200 million Americans </a>were placed under winter weather alerts heading into Christmas weekend. Regions throughout the west and midwest were hit by record-breaking low temperatures. In the south, Florida experienced its coldest Christmas in decades. Hundreds of flights were canceled and thousands of Americans in hard-hit areas lost power.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/26/us-workers-bitter-cold-winter-storm\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/26/us-workers-bitter-cold-winter-storm", "date_published": "2022-12-26 15:00:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Bravemansgame lands Paul Nicholls a remarkable 13th King George victory", "description": "<ul><li>L’Homme Presse unseats at the last when looking beaten</li><li>Constitution Hill flawless as ever in Christmas Hurdle</li></ul><p>All the money in the run-up to Monday’s King George VI Chase at Kempton Park was for L’Homme Presse, who ended up as favourite at 9-4, but Paul Nicholls, the trainer of Bravemansgame, was undeterred. “He was drifting over the last few days,” Nicholls said in the winner’s enclosure here on Monday, having seen his runner finish a long way clear, “but I kept telling all my mates to lump on.”</p><p>Nicholls was, admittedly, buoyed by the confidence that comes with having won Kempton’s Christmas showpiece a record dozen times already, and his 13th success would have been achieved by perhaps a length or so had L’Homme Presse not unseated Charlie Deutsch, his rider, at the final fence. But the favourite’s backers can have no complaints about what might have been, as Harry Cobden and Bravemansgame had taken control a few seconds earlier with a strong run between the final two obstacles, having been prominent just behind the pace-setting Frodon from the start.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/26/bravemansgame-lands-paul-nicholls-a-remarkable-13th-king-george-vi-chase-victory-horse-racing-tips\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/dec/26/bravemansgame-lands-paul-nicholls-a-remarkable-13th-king-george-vi-chase-victory-horse-racing-tips", "date_published": "2022-12-26 14:57:14+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Boxing Day traditions and a blanket of snow – Monday’s best photos", "description": "<p>The Guardian’s picture editors select photo highlights from around the world</p> <a href=\"https://www.theguardian.com/news/gallery/2022/dec/26/boxing-day-traditions-and-a-blanket-of-snow-mondays-best-photos\">Continue reading...</a>", "link": "https://www.theguardian.com/news/gallery/2022/dec/26/boxing-day-traditions-and-a-blanket-of-snow-mondays-best-photos", "date_published": "2022-12-26 14:34:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Snip, unpick and save your buttons: how to build an at-home mending kit", "description": "<p>Sewing kits are no longer a universal household item – but if you want to make-do and mend, they’re essential</p><p>I have a vague memory of my mum keeping an emergency sewing kit in the glove compartment of her car. When I asked one of my brothers if he could recall the small plastic set, with its loose threads and tiny scissors he confessed that he now carries one too. In fact, he told me that just last week he’d used it to sew on a button while he and his girlfriend were travelling from Munich to Norway. (He’s always been irritatingly practical, but it turns out she sewed on the button).</p><p>While the sewing kit may no longer be a universal household item, the recent rise of thrift-flipping and easy access to online tutorials means the craft of mending is enjoying a reprise.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/27/snip-unpick-and-save-your-buttons-how-to-build-an-at-home-mending-kit\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/27/snip-unpick-and-save-your-buttons-how-to-build-an-at-home-mending-kit", "date_published": "2022-12-26 14:00:35+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘Red tape’ putting ex-British Council staff in Afghanistan at risk, say MPs", "description": "<p><strong>Exclusive: </strong>Foreign secretary urged to speed up efforts to help former staff and their families get to UK</p><p>Ministers are putting endangered British Council staff and their families in Afghanistan at risk because of a “blockage of red tape” preventing them from coming to the UK, a cross-party group of dozens of MPs and peers says.</p><p>John Baron, a senior Conservative backbencher, pioneered the cross-party call for the foreign secretary, James Cleverly, to ensure the country repays the “debt of gratitude and honour” he believed was owed to the roughly 200 people and their immediate relatives.</p> <a href=\"https://www.theguardian.com/politics/2022/dec/26/red-tape-putting-ex-british-council-staff-in-afghanistan-at-risk-say-mps\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/dec/26/red-tape-putting-ex-british-council-staff-in-afghanistan-at-risk-say-mps", "date_published": "2022-12-26 14:00:35+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Everton v Wolves, Leicester v Newcastle and more: Premier League – live", "description": "<ul><li>Updates from the 3pm Boxing Day kick-offs</li><li><a href=\"https://www.theguardian.com/football/live\">Live scoreboard: the latest from around the grounds</a></li><li>You can contact Simon <a href=\"mailto:simon.burnton@theguardian.com\">by email</a> or <a href=\"https://twitter.com/Simon_Burnton\">Twitter</a> with your thoughts</li></ul><p>Well let’s just crack on with what promises to be an afternoon of manic festive fun, shall we? Yuletide games are no longer the <a href=\"https://www.theguardian.com/football/2021/dec/24/boxing-day-1963-famous-results-two-days-later-football\">guarantee of ludicrous scorelines</a> that they once were but it’s still notable that two of the six highest-scoring games in Premier League history were played between Christmas and New Year (<a href=\"https://www.theguardian.com/football/2007/dec/30/match.reading\">Tottenham 6-4 Reading</a> in 2007 and <a href=\"https://www.theguardian.com/football/2012/dec/29/arsenal-newcastle-united-premier-league\">Arsenal 7-3 Newcastle</a> in 2012, since you ask), and today is the first anniversary of the comparatively dull <a href=\"https://www.theguardian.com/football/2021/dec/26/manchester-city-leicester-premier-league-match-report\">Manchester City 6-3 Leicester</a>. </p> <a href=\"https://www.theguardian.com/football/live/2022/dec/26/everton-v-wolves-leicester-v-newcastle-and-more-premier-league-live\">Continue reading...</a>", "link": "https://www.theguardian.com/football/live/2022/dec/26/everton-v-wolves-leicester-v-newcastle-and-more-premier-league-live", "date_published": "2022-12-26 14:00:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Australia’s best sporting moments of 2022 – in pictures", "description": "<p>With stadiums full of spectators and star athletes traversing the globe to take part in grand slams, the Winter Olympics, the Commonwealth Games, the Fifa World Cup and more, 2022 saw sport well and truly bounce back from pandemic-related delays and cancellations. Guardian Australian takes a look back at the best shots of the country’s best sportspeople</p><ul><li><strong><a href=\"https://www.theguardian.com/sport/2022/dec/24/australian-sport-rediscovers-pulse-in-2022-as-crowds-return-in-celebratory-mood\">Australian sport rediscovers pulse in 2022 as crowds return in celebratory mood</a></strong></li></ul> <a href=\"https://www.theguardian.com/sport/gallery/2022/dec/26/australias-best-sporting-moments-of-2022-in-pictures\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/gallery/2022/dec/26/australias-best-sporting-moments-of-2022-in-pictures", "date_published": "2022-12-26 14:00:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Even a snatched wallet couldn't dim the joy of my return to Venice | Joan Bakewell", "description": "<p>As the city came to life after the pandemic, gondoliers and tourists alike sat back, laughed and let fun and pleasure prevail</p><ul><li>What was the image on your phone that defined 2022? <a href=\"https://www.theguardian.com/commentisfree/series/snapshot-of-2022\">Writers give their perspectives</a></li></ul><p>It’s the Venice Biennale. Art aficionados flock to the Giardini, where each country has its own pavilion and its own art: they gossip, plot, criticise and do a little business.</p><p>Not so the gondoliers. Here they snatch a moment off duty to lark and frolic; young men, lithe, relaxed, off-duty, throwing gondola cushions back and forth. At a nearby restaurant, tourists scoff delicious Venetian dishes – truffle ravioli for me. My photograph reminds me how delicious it was. Venice offers untold pleasures: the brisk divide between formal tourists and local providers disappears. All enjoy its beauty, coloured houses, ancient pavements, the quayside, the glimpse at every moment of something beyond.</p><p>Joan Bakewell is a writer and broadcaster</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/26/snapshot-2022-return-venice-city-pandemic-tourists\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/dec/26/snapshot-2022-return-venice-city-pandemic-tourists", "date_published": "2022-12-26 14:00:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Herbs, mushrooms, ancient grains: London’s taste for natural cocktails", "description": "<p>Mixologist Mr Lyan finds and creates sustainable ingredients, helping customers connect with nature and reduce waste </p><p>Neon-coloured cocktails and sugary mixers might have been the order of the day until recently, but now an interest in natural flavours has taken off among London’s top mixologists.</p><p>With kitchens that resemble chemistry labs, and bottles full of home-fermented concoctions and syrups made of natural and foraged ingredients, cocktail makers are trying to bring customers closer to nature.</p> <a href=\"https://www.theguardian.com/food/2022/dec/26/herbs-mushrooms-ancient-grains-londons-taste-for-natural-cocktails\">Continue reading...</a>", "link": "https://www.theguardian.com/food/2022/dec/26/herbs-mushrooms-ancient-grains-londons-taste-for-natural-cocktails", "date_published": "2022-12-26 14:00:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘I just went crazy when we won!’ Lioness Chloe Kelly on her Euros triumph – and how to top it", "description": "<p>The England striker’s goal against Germany made her a national hero and sent interest in the women’s game rocketing. But she’s not about to take her foot off the gas</p><p>When Chloe Kelly’s 2022 began, the idea that a photo of herself would capture one of the defining moments of women’s football history in England, let alone of the year, was far from her mind. Kelly was battling back from an anterior cruciate ligament injury that ended her Olympic dreams. She would make her return to the pitch in April, 11 months on from her injury, and faced a race against time to get up to speed for the Euros in July.</p><p>“It’s crazy,” the 24-year-old Manchester City forward says of the tournament. “Sometimes I look at the images and I’m like: ‘Wow, that actually happened.’ It’s an amazing memory and one that will stick with me for ever, and what it can do for the sport is just huge.”</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/26/chloe-kelly-euros-triumph-lioness-went-crazy-when-won\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/26/chloe-kelly-euros-triumph-lioness-went-crazy-when-won", "date_published": "2022-12-26 14:00:32+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "The pendulum swung against globalisation in 2022 – and that’s no bad thing | Larry Elliott", "description": "<p>Climate crisis, Ukraine invasion and China-US tensions are challenging assumption free markets are best</p><p>This was supposed to be the year when things returned to normal. After the collapse of activity during the months of lockdown in 2020 and the supply bottlenecks of 2021, the hope was that 2022 would call time on an era of seemingly permanent crisis. It hasn’t quite turned out like that.</p><p>Indeed, 2022 is shaping up to be a pivotal year for the global economy, taking its place alongside the end of the Bretton Woods fixed exchange rate system in 1971, the reunification of Germany in 1990 and the near collapse of the banks in the financial crisis of 2008.</p> <a href=\"https://www.theguardian.com/business/2022/dec/26/the-pendulum-swung-against-globalisation-in-2022-and-thats-no-bad-thing\">Continue reading...</a>", "link": "https://www.theguardian.com/business/2022/dec/26/the-pendulum-swung-against-globalisation-in-2022-and-thats-no-bad-thing", "date_published": "2022-12-26 13:57:17+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "The King’s speech left Tories squirming: he preached the values they’ve abandoned | Stephen Bates", "description": "<p>Lauding public sector and voluntary workers, he evoked the compassionate conservatism the government has expunged from its ranks and rhetoric</p><p>Do people still rise out of their Christmas Day torpor to listen to the monarch’s message to the nation at 3pm? It used to be the one immutable point of the day: the only time in the year when the Queen – and it was always the Queen in living memory – spoke directly to the nation in her own words, unscripted by ministers. Yet its familiarity and – let’s face it – frequent vacuousness make it feel less relevant or significant to many these days.</p><p>Although in her later years the Queen often used the broadcast to speak movingly of her own faith, she stuck, you might say religiously, clear of politics. But was there a slight tremor of difference <a href=\"https://www.theguardian.com/uk-news/2022/dec/25/king-charles-highlights-cost-of-living-crisis-in-first-christmas-broadcast\">this year</a> in the new king’s lauding of public sector staff and voluntary workers – those who help at food banks and deliver aid to disaster zones across the world?</p><p>Stephen Bates is a former Guardian royal correspondent and author of Royalty Inc: Britain’s Best-Known Brand</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/26/kings-speech-tories-compassionate-conservatism\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/dec/26/kings-speech-tories-compassionate-conservatism", "date_published": "2022-12-26 13:17:07+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Three Russian soldiers dead after Ukrainian drone attack, Moscow says", "description": "<p>Defence ministry says drone was shot down on approach to Engels airbase but falling debris killed three</p><ul><li><a href=\"https://www.theguardian.com/world/live/2022/dec/26/russia-ukraine-war-live-moscow-admits-ukrainian-drone-reached-air-base-deep-inside-russia-three-killed\">Russia-Ukraine war – latest news updates</a></li></ul><p>Three Russian soldiers have died after a Ukrainian drone attack on a crucial airbase deep inside Russian territory, Moscow has said.</p><p>According to the defence ministry, a Ukrainian drone was shot down on the approach to Engels base early on Monday morning but falling debris killed three soldiers.</p> <a href=\"https://www.theguardian.com/world/2022/dec/26/three-russian-servicemen-die-after-ukrainian-drone-attack-moscow-says\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/26/three-russian-servicemen-die-after-ukrainian-drone-attack-moscow-says", "date_published": "2022-12-26 13:02:51+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Pigeon bags, chunky trainers and a doll’s house: the rise of the viral accessory", "description": "<p>Shoppers searching for more affordable ways into designer wear have made hats, shoes and bags the most in-demand fashion items</p><p>In fashion, desirable accessories are nothing new. See the Fendi baguette, the It bag of the 00s, or the recent fad for chunky dad trainers. But, as social media’s influence on style becomes more heightened, it is shoes, bags and hats that are hogging the spotlight more than ever. This is the era of the viral accessory.</p><p><a href=\"https://www.theguardian.com/fashion/2022/oct/10/the-rise-of-the-main-character-accessory\">JW Anderson’s pigeon bag</a> – a clutch that is a resin model of the bird – is a popular example. It has a waiting list on the brand’s site, where it was the most-viewed item in August. It has since been carried by Sarah Jessica Parker on the set of And Just Like That … and by Sam Smith at London fashion week.</p> <a href=\"https://www.theguardian.com/fashion/2022/dec/26/pigeon-bags-bulbous-trainers-and-a-dolls-house-the-rise-of-the-viral-accessory\">Continue reading...</a>", "link": "https://www.theguardian.com/fashion/2022/dec/26/pigeon-bags-bulbous-trainers-and-a-dolls-house-the-rise-of-the-viral-accessory", "date_published": "2022-12-26 13:00:31+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Thomasina Miers’ recipe for turkey, pancetta and parsnip empanadas | The new flexitarian", "description": "<p>Leftover Christmas ham and poultry are readymade for these pastry parcels of festive fun</p><p>Isn’t it time we looked at leftovers in a different light? They are tidy packages of beautifully seasoned ingredients prepped, cooked, ready to go and perfect for making something new when you are short of time and inspiration. Christmas leftovers are a thing of joy, and a readymade filling for these empanadas. Whether you buy the pastry or make the dough from scratch, the joy here is in the rich, glorious flavour of the filling.</p> <a href=\"https://www.theguardian.com/food/2022/dec/26/turkey-pancetta-and-parsnip-empanadas-recipe-thomasina-miers\">Continue reading...</a>", "link": "https://www.theguardian.com/food/2022/dec/26/turkey-pancetta-and-parsnip-empanadas-recipe-thomasina-miers", "date_published": "2022-12-26 13:00:31+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Freezing storm kills dozens of people and brings disruption across US – video report", "description": "<p>Severe weather conditions from a storm in the US have caused snowdrifts to immobilise emergency vehicles in New York state, left homes and business across the north-east without power, forced&nbsp; thousands of flights to be cancelled and made roads too dangerous to travel on.</p><p>The storm, which stretched from Great Lakes on the Canadian border to Rio Grande along the Mexican border, has killed at least 34 people</p><ul><li><a href=\"https://www.theguardian.com/us-news/2022/dec/26/us-storm-dozens-of-lives-lost-as-arctic-freeze-grips-nation\">US storm: freezing week ahead with dozens of lives lost so far</a></li></ul> <a href=\"https://www.theguardian.com/world/video/2022/dec/26/freezing-storm-kills-dozens-of-people-and-brings-disruption-across-us-video-report\">Continue reading...</a>", "link": "https://www.theguardian.com/world/video/2022/dec/26/freezing-storm-kills-dozens-of-people-and-brings-disruption-across-us-video-report", "date_published": "2022-12-26 12:32:37+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "The big idea: does true kindness have to be selfless?", "description": "<p>It feels great to give at Christmas. But does that pleasure detract from the good deed? </p><p>“I really enjoy doing it: it makes me feel good about myself. It gives me a boost, mentally and physically.” If these were your reactions to an activity, you’d surely be inclined to do it as often as you could. After all, aren’t a lot of us looking for ways to find more meaning in life and to be happier and healthier? What, then, is the act that elicits such positive responses? The answer: being <a href=\"https://www.theguardian.com/lifeandstyle/2022/nov/13/why-we-all-need-to-be-a-lot-less-hesitant-about-being-kind\" title=\"\">kind</a>.</p><p>A growing body of evidence from the fields of psychology and neuroscience demonstrates that performing kind acts increases mental wellbeing, enhances physical health and might even improve life expectancy. Kindness is not just beneficial for the recipient, but <a href=\"https://www.theguardian.com/science/2022/mar/13/cool-to-be-kind-being-nice-is-good-for-us-so-why-dont-we-all-do-it\" title=\"\">also for the giver</a>.</p> <a href=\"https://www.theguardian.com/books/2022/dec/26/the-big-idea-does-true-kindness-have-to-be-selfless\">Continue reading...</a>", "link": "https://www.theguardian.com/books/2022/dec/26/the-big-idea-does-true-kindness-have-to-be-selfless", "date_published": "2022-12-26 12:30:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Brentford v Tottenham: Premier League – live", "description": "<ul><li>Updates from the 12.30pm GMT Premier League kick-off</li><li><a href=\"https://www.theguardian.com/football/premierleague/table\">How they stand: the latest Premier League table</a></li><li>And you can contact Rob <a href=\"mailto:rob.smyth@theguardian.com\">here</a> with your thoughts</li></ul><p><strong>Antonio Conte on Harry Kane</strong></p><p>You can have a good tournament – he played really well – but at the same time he missed an important penalty. This is football. It’s important now to move on and focus on Tottenham.</p> <a href=\"https://www.theguardian.com/football/live/2022/dec/26/brentford-v-tottenham-premier-league-live\">Continue reading...</a>", "link": "https://www.theguardian.com/football/live/2022/dec/26/brentford-v-tottenham-premier-league-live", "date_published": "2022-12-26 12:18:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "How to make jambalaya – recipe | Felicity Cloake's Masterclass", "description": "<p>This much-loved spicy Cajun/Creole classic is the perfect way to give those festive leftovers a final send-off</p><p>There comes a point each year when even the most ardent sandwich fancier (me) has had her fill of turkey and bread sauce-stuffed butties and thoughts turn to giving the big bird a decent send-off. This much-loved Cajun/Creole classic, traditionally made with whatever meat happened to be around, is also easily adapted to festive leftovers.</p><p>Prep <strong>20 min</strong><br />Cook <strong>45 min</strong><br />Rest <strong>10 min</strong><br />Serves <strong>4-6</strong></p> <a href=\"https://www.theguardian.com/food/2022/dec/26/how-to-make-jambalaya-recipe-felicity-cloake-christmas-leftovers\">Continue reading...</a>", "link": "https://www.theguardian.com/food/2022/dec/26/how-to-make-jambalaya-recipe-felicity-cloake-christmas-leftovers", "date_published": "2022-12-26 12:00:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "That diary was tangible proof that exciting things were about to happen – the Christmas present I’ll never forget", "description": "<p>I wrote about watching Swap Shop and Rod Stewart’s birthday. But what strikes me now are the things I left out</p><p>The parcel was suspiciously small and definitely didn’t contain the longed-for pink Raleigh bicycle. Or even a cassette recorder. When I ripped open my mum’s elaborate gift-wrap, out fell a red leatherette volume with the words Five Year Diary etched into the cover in gold.</p><p>I remember feeling a surge of excitement. The lavish heft of the diary’s design implied that only very important life events would be worthy of its gilt-edged pages. The brass lock and key held the promise of future secrets. Not that I had any.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/26/that-diary-was-tangible-proof-that-exciting-things-were-about-to-happen-the-christmas-present-ill-never-forget\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/26/that-diary-was-tangible-proof-that-exciting-things-were-about-to-happen-the-christmas-present-ill-never-forget", "date_published": "2022-12-26 12:00:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "World’s Strongest Man and Christmas: a 40-year tradition for British fans", "description": "<p>Eddie Hall, the 2017 champion, recalls his memories of the event, its future, and why it has kept a festive television spot</p><p>For Eddie Hall, Christmas means only one thing. “It’s always been a tradition – 40 years ago when it started there were only three channels and you either watched EastEnders or you watched World’s Strongest Man,” the 2017 winner of the latter says. “I remember as a kid sitting down to watch it after having my Christmas dinner and it was always my favourite thing on TV. There is a whole generation of British people who grew up with it at Christmas and that has just carried on.”</p><p>But what if you knew that the UK coverage of the competition, which begins on Channel 5 this year on 27 December, has actually been delayed for more than six months? There will be no spoilers here but the Guardian even <a href=\"https://www.theguardian.com/sport/2022/may/31/worlds-strongest-man-oleksii-novikov\">ran a feature on the event</a> when it took place in Sacramento, California, at the end of May if you want to find out who won. So why the delay? According to the WSM series producer, Neil Green of IMG Productions, it’s all down to the scheduling.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/26/worlds-strongest-man-and-christmas-a-40-year-tradition-for-british-fans\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/dec/26/worlds-strongest-man-and-christmas-a-40-year-tradition-for-british-fans", "date_published": "2022-12-26 12:00:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "What’s the point of writing a diary? For me, it’s an expression of personal freedom | Lamorna Ash", "description": "<p>I know that obsessively narrating life can get in the way of living it. But my chronicling is a source of comfort </p><p>Under an awning at night with the rain coming down. On the top deck of a bus travelling between parties at opposite ends of London. Leaning against the cubicle door of a pub toilet. These are some of the places I have written Google Docs diary entries in the past week. Mostly I do so via the Google app on my phone in a document titled Written Version of 2022. It contains everything you might imagine – slipshod accounts of nights out and lists of everything I recall drinking, lines from poems and films and songs, screenshots of paintings, recipes, scraps of news, seasonally dependent paeans or fury directed towards the weather, honest accounts of my emotional state, less honest accounts of my emotional state.</p><p>At the time of writing, Written Version of 2022 is 52,000 words and 85 pages long. Sometimes I’ll augment it with new events two or three times per day. As things happen to me, I am already speculatively ordering them into a narrative, my so-called version of events becoming overlaid with their real-time unfurling. All this is to say, I’m worried my chronic diary-writing habit is starting to get in the way of me actually living my life.</p><p>Lamorna Ash is the author of Dark, Salt, Clear: Life in a Cornish Fishing Town</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/26/writing-a-diary-personal-freedom-life\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/dec/26/writing-a-diary-personal-freedom-life", "date_published": "2022-12-26 12:00:29+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Ben Stokes urges rethink on global cricket calendar to protect quality", "description": "<ul><li>England Test captain says current schedule reduces standards</li><li>Stokes details approach to bring excitement back to Test arena</li></ul><p>England’s Test captain, Ben Stokes, believes the quality of international cricket is being harmed by the sport’s scheduling. Stokes retired from one-day internationals in the summer, saying it was “unsustainable” for him to play in all three formats.</p><p>Speaking to the Today programme on BBC Radio 4, Stokes, who played a leading role in England’s 50-over World Cup win in 2019, said: “It really has an impact on the multi-format players and people who want to play all three forms.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/26/ben-stokes-urges-rethink-on-global-cricket-calendar-to-protect-quality\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/dec/26/ben-stokes-urges-rethink-on-global-cricket-calendar-to-protect-quality", "date_published": "2022-12-26 11:54:11+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "King George VI Chase and more: Boxing Day racing – live", "description": "<ul><li>Updates from the big festive meeting at Kempton Park</li><li>Get in touch: you can contact Tony <a href=\"mailto:tony.paley@theguardian.com\">by email</a> or <a href=\"https://twitter.com/tpaleyfilm\">on Twitter</a></li></ul><p>The King George is one of the most prestigious jumps races in the calendar with a roll-call of greats among its history of winners. There is one runner today at Kempton which could prove an all-time great to rank with the likes of Arkle, Desert Orchid and Kauto Star, all truly outstanding King George winners, That’s the Nicky Henderson-trained Constitution Hill, who lines up in the Christmas Hurdle at 1.55pm, and has just arrived at the track. </p><p>A spokesperson for <a href=\"https://bestofbets.com/\">BestofBets.com</a> pointed out that “Henderson’s Buveur d’Air was beaten a short head at 1-4 by stablemate Verdana Blue when bidding to follow up in 2018, while in between her two wins, Epatante from the same yard was turned over at odds of 1-5 in 2020” but if the new kid on the block is beaten today it ewill be the biggest shock for many a year. Watch<a href=\"https://twitter.com/AtTheRaces/status/1597230697617403907\"> this superb analysis</a> by Jamie Lynch of the horse’s most-recent win.</p> <a href=\"https://www.theguardian.com/sport/live/2022/dec/26/king-george-vi-chase-and-more-boxing-day-racing-live\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/live/2022/dec/26/king-george-vi-chase-and-more-boxing-day-racing-live", "date_published": "2022-12-26 11:48:48+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Maxi Jazz: the calm eye in the centre of Faithless’s rave storm", "description": "<p>Only Keith Flint and Maxim of the Prodigy rivalled Jazz in his command of the stage at the helm of a superstar 90s dance act – but there was more to him than his ability to energise a crowd</p><p>• <a href=\"https://www.theguardian.com/music/2022/dec/24/maxi-jazz-lead-singer-of-faithless-dies-aged-65\">Maxi Jazz, lead singer of Faithless, dies aged 66</a></p><p>Of all the artists who commanded the stage as dance music became big business in the 1990s, Maxi Jazz was in a class of his own. It wasn’t just that the Faithless frontman was an imposing vocalist: his sonorous tone and steady enunciation made that a given. While the group’s first two albums, Reverence and Sunday 8PM, delivered award nominations and a parade of Top 20 singles, it was on stage where Faithless minted their reputation as an elite-level act.</p><p>Born Maxwell Fraser in 1957, Maxi Jazz – as he had become known since stints on pirate radio in the mid-1980s – was nearly 40 years old by the time Faithless formed in 1995. The practising Buddhist’s air of pacific wisdom positioned him as a spiritual counter to the spangled masses who came to bear witness as the band’s popularity soared. The energy of an entire arena would flow through Fraser, this calm eye of a rave storm. </p> <a href=\"https://www.theguardian.com/music/2022/dec/26/maxi-jazz-the-calm-eye-in-the-centre-of-faithlesss-rave-storm\">Continue reading...</a>", "link": "https://www.theguardian.com/music/2022/dec/26/maxi-jazz-the-calm-eye-in-the-centre-of-faithlesss-rave-storm", "date_published": "2022-12-26 11:09:42+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "From Minx to Ramy: the best TV you never watched in 2022", "description": "<p>This year had some criminally underwatched TV, including a cracking feminist porn comedy, a razor-sharp look at millennial Muslims … and papergirls caught up in a time war</p><p>(Sky Atlantic) For season four, the most successful German TV drama ever made increasingly plunged the viewer into darkness. As the neo-noir crime show’s tale of Weimar-era Berlin grew ever closer to the advent of Nazi rule, lead detective Gereon Rath infiltrated the organisation in plots that became ever more menacing, while the wreckage of the 1929 financial crash destroyed lives all around him. More than ever, there was a desperate, poignant edge to the cabaret debauchery, as it became a refuge from the terrifying world outside, and this series served up 10 episodes of utterly gripping television.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/26/from-minx-to-ramy-the-best-tv-you-never-watched-in-2022\">Continue reading...</a>", "link": "https://www.theguardian.com/tv-and-radio/2022/dec/26/from-minx-to-ramy-the-best-tv-you-never-watched-in-2022", "date_published": "2022-12-26 11:00:29+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Sport’s most memorable moments of 2022 – No 1: Tennis", "description": "<p>From Djokovic’s deportation to the arrival of the future of the sport via farewells to two of the greatest players of all time</p><p>Roger Federer and Serena Williams were born one month apart and having built legendary careers that redefined the concept of longevity in the sport, this year they departed within three weeks of each other.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/26/sports-most-memorable-moments-of-2022-no-1-tennis\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/dec/26/sports-most-memorable-moments-of-2022-no-1-tennis", "date_published": "2022-12-26 10:44:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Shifting gears: why US cities are falling out of love with the parking lot", "description": "<p>Cities are loosening rules on building parking spots with new buildings: ‘It’s about the climate, it’s about walkability’</p><p>They are grey, rectangular and if you lumped their population of up to 2bn together they would cover roughly the same area as Connecticut, about 5,500 sq miles. Car parking spaces have a monotonous ubiquity in US life, but a growing band of cities and states are now refusing to force more upon people, arguing they harm communities and inflame the climate crisis.</p><p>These measures, along with expansive highways that cut through largely minority neighborhoods and endless suburban sprawl, have cemented cars as the default option for transportation for most Americans.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/26/us-cities-parking-lots-climate-walkability\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/26/us-cities-parking-lots-climate-walkability", "date_published": "2022-12-26 10:00:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "How to jazz up your Christmas Day leftovers | Kitchen aide", "description": "<p>Boxing Day never looked so good with these simple yet smart ideas from our experts to use up the remains of the big day</p><ul><li>Got a culinary dilemma? Email <a href=\"mailto:feast@theguardian.com\">feast@theguardian.com</a></li></ul><p><strong>What interesting things can I do with my Christmas Day leftovers? <br /></strong><em><strong>Chloe, Margate<br /></strong></em>Sure, Christmas dinner is great, but leftovers can be even better. Yesterday’s meat and veg encased in pastry for a pie, for example,<strong> </strong>or a turnover is a winner come Boxing Day, says Lisa Goodwin-Allen, executive chef of <a href=\"https://www.northcote.com/\">Northcote</a> in Lancashire and <a href=\"https://thestaffordlondon.com/the-game-bird/\">The Game Bird at The Stafford</a> in London. “They’re super-simple and can be made from everything left in your fridge.” She melts 20g butter, adds a diced onion and 100g sprouts, and cooks until soft. “Add crushed garlic, 60ml cream, season and cook for four minutes, then add a handful of diced turkey and ham.” Spoon on to squares of rolled puff pastry and fold, “pinching<strong> </strong>the sides to ensure you don’t have any air pockets. Slash with a knife and bake at 230C (210C fan)/450F/gas 8 for five to seven minutes, until golden.”</p><p>Alternatively, keep turkey day going with a risotto, <a href=\"https://www.theguardian.com/profile/tim-siadatan\">Tim Siadatan</a> of <a href=\"https://www.trullorestaurant.com/\">Trullo</a> and <a href=\"https://www.padella.co/\">Padella</a>, both in London, says: “Make it like you normally would, then at the end go in with chopped cooked turkey, a decent whack of butter and parmesan.” Get it on a plate, top with sliced raw sprouts (“for crunch”) and crumbs of stilton, and finish with good olive oil. Turkey – plus pigs in blankets, stuffing, and chestnuts – would also be at home in ravioli. “There’s lots going on here,” Siadatan says, “but it’s worth it.” Chop your filling ingredients, then enclose mounds of the stuff between sheets of pasta, stamp out your parcels and cook. Sauce-wise, Siadatan recommends “a nice, bitter Italian leaf” such as radicchio, which he roasts, chops and adds, along with butter, to gravy that has been reduced. Crown with crisp sage leaves.</p><p>Got a culinary dilemma? Email <a href=\"mailto:feast@theguardian.com\">feast@theguardian.com</a></p> <a href=\"https://www.theguardian.com/food/2022/dec/26/how-to-jazz-up-christmas-day-leftovers-kitchen-aide\">Continue reading...</a>", "link": "https://www.theguardian.com/food/2022/dec/26/how-to-jazz-up-christmas-day-leftovers-kitchen-aide", "date_published": "2022-12-26 10:00:29+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "January 6 panel’s body of work boosts DoJ case against Trump, experts say", "description": "<p>Former prosecutors say richly detailed report from Capitol attack committee ‘amounts to a detailed prosecution memo’</p><p>After 18 months of investigating Donald Trump’s drive to overturn his 2020 election loss, the House committee on the January 6 insurrection has provided the Department of Justice with an exhaustive legal roadmap as it pursues potential criminal charges against the former US president.</p><p>Amid reports the committee is already co-operating with DoJ by sharing evidence garnered from 1,000 witness interviews and thousands of documents, former federal prosecutors say the panel’s work offers a trove of evidence to strengthen the formidable task of DoJ prosecutors investigating the former US president and his top loyalists.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/26/january-6-capitol-attack-donald-trump-report\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/26/january-6-capitol-attack-donald-trump-report", "date_published": "2022-12-26 10:00:29+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘I want to get off WhatsApp and call my friends instead’: the thing I’ll do differently in 2023", "description": "<p>I’ve replaced real conversations with texted chats and I miss speaking to the people I love</p><p>Lately I’ve been feeling disconnected from my friends, which is strange, as I speak to them all the time. When I say “speak”, I mean we send messages to each other on WhatsApp. I hear their voices when they send voice notes. But mostly we type.</p><p>WhatsApp is indisputably convenient. Free to use, intuitive, immediate and, when it comes to group chats with friends, collective fun. A brief scan of my recent chats reveals a copious amount of memes, a photo of my friend’s new six-pack, a rant about someone on telly, an exchange of photos of cold sores, a pet video, a podcast recommendation and yet another attempt to arrange a get-together. I am in two WhatsApp groups that function solely to try to organise an IRL meet-up, which never happens. At least we have WhatsApp.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/26/annie-macmanus-get-off-whatsapp-call-friends-thing-ill-do-differently\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/26/annie-macmanus-get-off-whatsapp-call-friends-thing-ill-do-differently", "date_published": "2022-12-26 10:00:29+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘It’s the economy, stupid’ says the US campaign slogan. Starmer would do well to learn it | Anne McElvoy", "description": "<p>The Labour leader must be clear about how he’ll succeed where Tories have failed – rehashing Blair’s strategies isn’t enough</p><p></p><p>The future direction of UK plc now looks more likely to come from the Starmer and Reeves emporium than the woeful management of the present Are You Being (Under) Served?<em> </em>government. In the mayhem of 2022, the Tories forfeited their claim to be the natural managers of the UK economy. Opportunity knocks for the opposition to fill that gap.</p><p>Attacking the government’s record here is straightforward: the economy has had skimpy growth for most of its 12 years in power (<a href=\"https://www.economist.com/britain/2022/12/15/britains-economic-record-since-2007-ranks-near-the-bottom-among-peer-countries\">on a per-person basis, the economy has grown just 7% </a>in real terms since the financial crash of 2007-08). Perhaps more concerning for any potential replacement, productivity has lagged behind competitors. Voters feel the result in their real-terms household incomes, and lower earners now find basics, let alone treats, less affordable. So “the Tories tanked the economy” is a line with a lot of truth to it. Planning to get the economy upright again is a more daunting task. That will need to change in 2023 as voters will want to know more about Labour’s intended direction of travel.</p><p>Anne McElvoy is senior editor at the Economist</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/26/economy-keir-starmer-labour-tories-blair\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/dec/26/economy-keir-starmer-labour-tories-blair", "date_published": "2022-12-26 10:00:29+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Bah, humbug: anti-Christmas treats for the tinseled-out", "description": "<p>From a beach comedy movie to people-free abstract art, our critics offer cultural escapes for those who’ve already had enough festive spirit</p><p>There is plenty of cheer in the unapologetically silly, raunchy comedy Barb and Star Go to Vista Del Mar, but none of it particularly festive. It’s written by Annie Mumolo and Kristen Wiig – the team behind hit 2011 film Bridesmaids – and the two comedians also star as small-town Nebraskans having a rollicking good time on their first ever vacation. The fictional Florida town of Vista Del Mar is saturated in beachy summery hues, the hotel pool is an exquisite aquamarine blue, and talking crabs and mermaids feature. Yet in this cheerful idyll, danger brews in the form of a sun-avoiding supervillain plotting revenge on the forever-tanned Floridians. Jamie Dornan, playing the Hawaiian shirt-loving henchman, is a particular delight. <em>Rebecca Liu</em></p> <a href=\"https://www.theguardian.com/culture/2022/dec/26/christmas-cultural-escapes\">Continue reading...</a>", "link": "https://www.theguardian.com/culture/2022/dec/26/christmas-cultural-escapes", "date_published": "2022-12-26 10:00:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Call to allow reuse of graves as burial plots run low in England and Wales", "description": "<p>Local authorities say they are short of space due to Victorian laws that are also causing rise in funeral costs</p><p>Cemeteries are running out of space to bury the dead, local authorities have warned, prompting calls for an overhaul of archaic legislation to prevent deepening funeral poverty for families.</p><p>The disposal of human remains is governed by a complex set of legislation in England and Wales dating to the Victorian era, which prevents graves being reused.</p> <a href=\"https://www.theguardian.com/society/2022/dec/26/call-allow-reuse-graves-burial-plots-run-low-england-wales\">Continue reading...</a>", "link": "https://www.theguardian.com/society/2022/dec/26/call-allow-reuse-graves-burial-plots-run-low-england-wales", "date_published": "2022-12-26 10:00:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Festive re-reads: David Copperfield by Charles Dickens", "description": "<p>Continuing our series of Guardian writers picking the titles to revisit this Christmas, Sam Jordison recommends the great Victorian writer’s ‘favourite child’</p><p>• Tell us what you’ve been reading over the holidays in the comments</p><p>I’m aware that this must hardly be the first time you’ve had David Copperfield pressed on you. Not that I have any compunction about recommending such a masterpiece again. This novel has not yet been praised enough, even though we are approaching 175 years since it first appeared between two covers, in 1850.</p><p>To list all the virtues of the work Dickens himself called “his favourite child” would require a volume as long as the actual 250,000-word doorstopper. Instead, let me just focus on just one: Betsey Trotwood.</p> <a href=\"https://www.theguardian.com/books/2022/dec/26/festive-re-reads-david-copperfield-by-charles-dickens\">Continue reading...</a>", "link": "https://www.theguardian.com/books/2022/dec/26/festive-re-reads-david-copperfield-by-charles-dickens", "date_published": "2022-12-26 10:00:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "The revenge of history in Ukraine: year of war has shaken up world order", "description": "<p>A shared sense of national history is proving to be a crucial weapon, spurring on Ukraine resistance and Russian soldiers</p><p>The Ukrainian writer Oksana Zabuzhko recalls a quote attributed to Otto von Bismarck: “Wars are not won by generals, but by schoolteachers and parish priests.” It’s a country’s taught collective memory, its shared sense of its own history, that are the decisive instruments for mobilisation, and are as important on the battlefield as weaponry.</p><p>Few conflicts have been so shaped by the chief actors’ sense of their own national story as the Ukrainian war that began in February. It is the competing grand narratives of the past, not just in Russia and Ukraine, but in Germany, France, Poland, the Baltics, the UK, the US, and even the global south, that make this war so hard to resolve.</p> <a href=\"https://www.theguardian.com/world/2022/dec/26/ukraine-war-revenge-of-history-how-geopolitics-shaping-conflict\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/26/ukraine-war-revenge-of-history-how-geopolitics-shaping-conflict", "date_published": "2022-12-26 10:00:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘We make sure that every day they can still laugh and smile’: London’s revolutionary youth cancer treatment", "description": "<p>Proton beam therapy, offered in only two UK hospitals, precisely targets tumours, reducing damage to surrounding healthy tissue</p><p>On their first day in London, two police officers waved at George from a coffee shop window. On another day, a nurse raced with the three-year-old down a hospital corridor.</p><p>The memories are two of many written in a book, logging the best parts of George’s days. Keeping a record of moments for which to be grateful is particularly important to Lisa Radcliffe, after her son was diagnosed with cancer in May after a tumour appeared near his temple.</p><p>George with play specialists at University College London hospital. It is one of the only places where patients can access proton beam therapy.</p> <a href=\"https://www.theguardian.com/artanddesign/2022/dec/26/we-make-sure-that-every-day-they-can-still-laugh-and-smile-londons-revolutionary-youth-cancer-treatment\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/2022/dec/26/we-make-sure-that-every-day-they-can-still-laugh-and-smile-londons-revolutionary-youth-cancer-treatment", "date_published": "2022-12-26 10:00:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Boxing Day strikes: thousands face travel chaos across Britain as action by railway and Border Force workers continues", "description": "<p>Railways closed because of RMT strike while 1,000 Border Force staff in PCS union continue action</p><p>Here is a reminder of the upcoming strikes which have been announced by up until January. </p><p>Shoppers hoping for a Boxing Day bargain could face traffic jams as rail strikes bring train services to a halt, with the AA saying it expects 15.2m cars on UK roads on Boxing Day, with shoppers and football fans among those likely to travel.</p> <a href=\"https://www.theguardian.com/uk-news/live/2022/dec/26/boxing-day-strike-travel-chaos-rail-railway-border-force-industrisal-action\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/live/2022/dec/26/boxing-day-strike-travel-chaos-rail-railway-border-force-industrisal-action", "date_published": "2022-12-26 09:15:46+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Moon rivers? UK scientists at heart of mission to extract water from lunar rock", "description": "<p>With the success of Artemis, lunar travel is back on the agenda – and a way to produce water on moon is vital for human presence</p><p>In 1970, Neil Armstrong predicted there would be people living in Antarctica-style lunar research bases “within our lifetime”. He was wrong: it’s been 50 years since the last Apollo crewed mission.</p><p>Perhaps not so very wrong, however. Ten years after Armstrong’s death, lunar travel is back on the agenda, with teams of scientists around the world working to fulfil Nasa’s aspiration to have humans living on the moon within the decade.</p> <a href=\"https://www.theguardian.com/science/2022/dec/26/moon-rivers-uk-scientists-at-heart-of-mission-to-extract-water-from-lunar-rock\">Continue reading...</a>", "link": "https://www.theguardian.com/science/2022/dec/26/moon-rivers-uk-scientists-at-heart-of-mission-to-extract-water-from-lunar-rock", "date_published": "2022-12-26 09:00:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Post your questions for Miriam Margolyes", "description": "<p>Have you something to ask the outspoken doyen of stage and screen? Then send it our way and we’ll put it to her</p><p>With a career that has spanned nearly 50 years, it might be hard to pinpoint your favourite Miriam Margolyes moment. Maybe you remember her Bafta-winning performance as Mrs Mingott in Martin Scorsese’s The Age of Innocence? As the rude-shaped-turnip-appreciating Lady Whiteadder in Blackadder? Or as Professor Sprout in the Harry Potter franchise?</p><p>The Jewish, Labour-supporting actor has been outspoken about her politics since her days at Oxford, so when it comes to interviews, she’s gold dust. She <a href=\"https://www.youtube.com/watch?v=F186jg6MsGQ\">explained to Graham Norton</a> how, erm, “sexually aroused” she was at first meting Sir Laurence Olivier and <a href=\"https://www.youtube.com/watch?v=Umfm3Foy9Ls\">told Daniel Radcliffe</a> how much he had “matured” since they first worked together. In October she told Radio 4 exactly what <a href=\"https://www.theguardian.com/culture/video/2022/oct/15/miriam-margolyes-swears-about-jeremy-hunt-on-bbc-radio-4-audio\">she thinks of Jeremy Hunt</a>. And now she’s fronting <a href=\"https://www.youtube.com/watch?v=cU85x9tQDLM\">The Big Gay “Donation”</a> to get the 2030 World Cup held in a LGBTQ+ friendly host country, a campaign that has currently raised over £15K.</p> <a href=\"https://www.theguardian.com/film/2022/dec/26/post-your-questions-for-miriam-margolyes\">Continue reading...</a>", "link": "https://www.theguardian.com/film/2022/dec/26/post-your-questions-for-miriam-margolyes", "date_published": "2022-12-26 09:00:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘I’m extremely interested in deviant behaviour’: Christina Ricci on cannibalism, chaos and childcare", "description": "<p>With roles in hit cannibal horror Yellowjackets and a TV reboot for the Addams Family character that made her name, the actor has had an amazing year – even if she has plenty of regrets …</p><p>When I was a teenager and first going to gigs, I was told an unwritten rule: never wear the T-shirt of the act you’re going to see. So, I thought long and hard about whether to wear my T-shirt of Christina Ricci (as Wednesday Addams) to my interview with Christina Ricci. We’re due to discuss her far more recent role as Misty Quigley in the macabre survival drama Yellowjackets, when the T-shirt question is taken out of my hands: her publicists insist our video call be voices only. But as I soon learn, Ricci is not someone with whom rules hold much sway. “Rules” suggests definiteness, yet defying other people’s definitions has been her lifelong career, and even in our interview – as I press my questions, trying to get a sense of her – she eludes it. “I love chaos,” she muses at one point. Yep, I should have worn the T-shirt.</p><p>When we connect, Ricci, 42, is in the middle of shooting season two of Yellowjackets, which this time around sees Elijah Wood (Lord of the Rings) and Lauren Ambrose (Six Feet Under) join the cast. “Reading the first two scripts, I was shocked,” she says. Which is saying something, given that season one followed a girls’ high school soccer team descending into cannibalistic tribes when their plane crashes in the wild. Ricci plays the adult Misty – a quiet, unpopular kid who finds that the wilderness gives her the social cache she always dreamed of. “So many people will say to me, ‘I am Misty,’” says Ricci. “It’s interesting that people relate to such an extreme character, and that feeling of not being accepted, of feeling alone.” Ricci was instantly intrigued by her. “I’m extremely interested in deviant behaviour,” she says, “and what happens to someone when they feel very small – the pettiness, the control – especially in terms of how it relates to women’s experience.”</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/26/im-extremely-interested-in-deviant-behaviour-christina-ricci-on-cannibalism-chaos-and-childcare\">Continue reading...</a>", "link": "https://www.theguardian.com/tv-and-radio/2022/dec/26/im-extremely-interested-in-deviant-behaviour-christina-ricci-on-cannibalism-chaos-and-childcare", "date_published": "2022-12-26 09:00:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘Wholly unremarkable’: the suburban couple in Sweden accused of spying for Russia", "description": "<p>Pair suspected of illegally gathering intelligence against Sweden and US for more than a decade</p><p>For the leafy Stockholm suburb of Nacka, it was a rude, pre-dawn awakening: wailing sirens, two Black Hawk helicopters clattering overhead and special forces in combat gear fast-roping through the windows of an imposing white villa – all at 6.01am.</p><p>The raid late last month by Sweden’s security service, police elite units and army, lasting little over a minute, targeted a Russian couple suspected of carrying out “illegal intelligence activities” against Sweden and the US for more than a decade.</p> <a href=\"https://www.theguardian.com/world/2022/dec/26/spies-swedish-couple-russian-espionage-scandal\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/26/spies-swedish-couple-russian-espionage-scandal", "date_published": "2022-12-26 09:00:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "South Korea scrambles jets as North Korean drones ‘violate airspace’", "description": "<p>Warning shots fired after drones crossed military demarcation line from north, South Korea military says </p><p>South Korea scrambled warplanes and attack helicopters and fired warning shots on Monday after North Korean drones violated its airspace, the South Korean military said. </p><p>South Korea tracked the drones crossing from North Korea over what is known as the military demarcation line between the two countries after detecting them in the skies of the western city of Gimpo at about 10.25am (0125 GMT), the military said.</p> <a href=\"https://www.theguardian.com/world/2022/dec/26/south-korea-scrambles-jets-as-north-korean-drones-violate-airspace\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/26/south-korea-scrambles-jets-as-north-korean-drones-violate-airspace", "date_published": "2022-12-26 08:35:35+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Kevin Morby: This Is a Photograph review – exemplary songwriter wrings light from darkness", "description": "<p><strong>(Dead Oceans)<br /></strong>Morby’s seventh album was inspired by sickness and mortality but his elegiac songs focus on life’s transience and joys</p><p>The story of <a href=\"https://pitchfork.com/reviews/albums/kevin-morby-this-is-a-photograph/\">Kevin Morby’s superb seventh album</a> begins in January 2020. After his father collapsed at dinner one night and was rushed to hospital, the Kansas-based singer-songwriter found himself leafing through old family photos of his dad in his youthful prime. The older man was in recovery by the time his son moved into the <a href=\"https://www.rollingstone.com/music/music-news/kevin-morby-this-is-a-photograph-album-video-1315720/\">Peabody Hotel in Memphis</a>, Tennessee to pour out songs about mortality, family and the relentlessness of time.</p><p>Morby maps all this out in the first track of This Is a Photograph: “This is a photograph, a window to the past,” he begins, concluding: “This is what I’ll miss about being alive.” The album’s Dylanesque take on Americana is teased with blues, jazz, deep soul and Afrobeat, and sprinkled with field recordings ranging from children playing to birdsong. References abound: Morby includes snatches of Led Zeppelin and John Lennon lyrics and alludes to Jeff Buckley’s drowning in the Mississippi River, obliquely on Disappearing and directly on A Coat of Butterflies. Morby is such an exemplary songwriter that everything hangs together wonderfully.</p> <a href=\"https://www.theguardian.com/music/2022/dec/26/kevin-morby-this-is-a-photograph-review-exemplary-songwriter-wrings-light-from-darkness\">Continue reading...</a>", "link": "https://www.theguardian.com/music/2022/dec/26/kevin-morby-this-is-a-photograph-review-exemplary-songwriter-wrings-light-from-darkness", "date_published": "2022-12-26 08:00:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "The winter world may seem gloomy – but look closely, and you’ll see nature casting a spell | Lucy Jones", "description": "<p>For less than a tenner, do as I do: buy a hand lens, head outside and discover fungi and moulds lighting up the darkness</p><p>The profound therapeutic benefits of connecting with nature and spending time outside are <a href=\"https://www.nature.com/articles/s41598-019-44097-3\">well known</a>. But in winter? When it’s cold, gloomy and everything looks dead? In fact, <em>especially</em> in the winter, when we are susceptible to fatigue, illness and <a href=\"https://www.theguardian.com/commentisfree/2020/sep/13/sad-seasonal-affective-disorder-depression-winter-britain-poor-mental-health\">seasonal low mood</a>. And actually there is plenty of life, beauty and wonder right outside our doors, if we look closely.</p><p>Come and take a short walk with me in my nearest wild patch – an urban cemetery, a common environment across the British Isles.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/26/winter-nature-fungi-moulds-darkness\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/dec/26/winter-nature-fungi-moulds-darkness", "date_published": "2022-12-26 08:00:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "I had to turn down a coat with dead fox draped over it – the Christmas present I’ll never forget", "description": "<p>I was 20, living in St Petersburg and desperately in need of a warm coat. But as I saw the gift, my face turned ashen</p><p>In December 1993, I was living in St Petersburg as part of the year abroad for my university course in Russian. This was in the heady days of glasnost, perestroika and <a href=\"https://www.theguardian.com/business/2022/mar/10/putin-war-mcdonalds-russia-i-remember\">newly opened branches of McDonald’s</a> where you met Russians who burst into tears of disbelief when they realised you were from “<em>tam</em>” (over there).</p><p>It was the innocent time of trading Levi’s and hard currency in the street. People would ask endless earnest questions about the Beatles, Deep Purple and King Crimson. With the strains of the Scorpions’ Winds of Change ringing in our ears (“Let your balalaika sing / What my guitar wants to say”), it was completely normal to assume that Russia was on its way to becoming a beacon of democracy and freedom like any other responsible independent eastern European state, just a rather large one. How times change.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/26/i-had-to-turn-down-a-coat-with-dead-fox-draped-over-it-the-christmas-present-ill-never-forget\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/26/i-had-to-turn-down-a-coat-with-dead-fox-draped-over-it-the-christmas-present-ill-never-forget", "date_published": "2022-12-26 08:00:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "The Jaguars’ turnaround has been astonishing. And they’re only getting started", "description": "<p>Yes, the Jaguars are peaking at the right time as they close in on a playoff berth. But their recent success drives home just how much the dark days of this franchise are in the past</p><p>As fanbases go, no one had a more joyous last few weeks than Jacksonville. It wasn’t just following the Jags’ astonishing Week 15 overtime win over Dallas by <a href=\"https://www.theguardian.com/sport/2022/dec/22/jacksonville-jaguars-new-york-jets-game-report\">taking care of the Jets 19-3</a> on Thursday night. It wasn’t just because that was the team’s third win in a row. Or that at 7-8 they now sit atop the AFC South and can clinch a home playoff game in Duval County with a Week 18 win over the reeling Titans. </p><p>Yes, Jacksonville are peaking at the right time. But their recent success drives home just how much the dark days of this franchise are over. It’s kind of a miracle, really. To excel in the present, one must learn from the past. For a while, it wasn’t clear if Jags owner Shad Khan was capable of turning around the franchise he purchased in 2012. </p> <a href=\"https://www.theguardian.com/sport/2022/dec/26/jacksonville-jaguars-turnaround-playoffs\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/dec/26/jacksonville-jaguars-turnaround-playoffs", "date_published": "2022-12-26 08:00:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Where in the world? The big Boxing Day travel quiz", "description": "<p>In which city were candy canes invented, and where is Bethlehem? Gather friends and family, fill your glasses and try our fun and fiendish quiz</p><p><strong>1. </strong>Which airline had to suspend a policy allowing staff to wear gender-neutral uniforms on a flight taking the England football team to the World Cup in Qatar?</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/26/big-boxing-day-christmas-travel-quiz\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/26/big-boxing-day-christmas-travel-quiz", "date_published": "2022-12-26 08:00:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘Planting seeds of peace’: Bosnian war stories are brought to the stage", "description": "<p>Susan Moffat and Aida Haughton explain how their play My Thousand Year Old Land was given a universal humanity by using raw, real-life testimony </p><p>Three women – Pravda (meaning “justice”), Istina (“truth”), and Nada (“hope”) – sit around a table, grinding coffee and telling stories. Around them on stage are men’s boots, belts and a hat. The men are no longer here but killed in war.</p><p>It’s what writer and director Susan Moffat calls “the presence of absence”. In the play My Thousand Year Old Land (A Song for BiH), which Moffat wrote alongside Bosnian war survivor Aida Haughton, we follow three women whose lives are changed by the deaths of their communities’ men in the 1990s conflict in Bosnia and Herzegovina. They find themselves taking on the typically male roles in the family, from tilling the fields to feeding cockerels.</p> <a href=\"https://www.theguardian.com/stage/2022/dec/26/bosnian-war-stories-stage-my-thousand-year-old-land-susan-moffat-aida-haughton\">Continue reading...</a>", "link": "https://www.theguardian.com/stage/2022/dec/26/bosnian-war-stories-stage-my-thousand-year-old-land-susan-moffat-aida-haughton", "date_published": "2022-12-26 08:00:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "A lighter side of life – picture essay", "description": "<p>Advertising art director turned photographer Alan Burles on the influence of French-American photographer Elliott Erwitt and the beauty of getting ‘lost in wonder, love and praise’</p><p>I’d like to begin by misquoting the first line of Joseph Heller’s Catch-22 – “It was love at first sight.”</p><p>The first time I saw a photograph by Elliott Erwitt I fell madly in love with him.</p><p>Soho, London, October 2021</p> <a href=\"https://www.theguardian.com/artanddesign/2022/dec/26/a-lighter-side-of-life-picture-essay\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/2022/dec/26/a-lighter-side-of-life-picture-essay", "date_published": "2022-12-26 08:00:25+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Joe Woodhouse’s recipes for leftover Christmas vegetables", "description": "<p>Put zing into leftover veg with sprouts dressed in a herby, lemony yoghurt, and couscous jewelled with pomegranate, citrus and nuts  </p><p>These recipes reimagine your Christmas leftovers; they are also a fresh way of working with what’s on offer at this time of year. The idea is to keep things easy and stress-free, so you use up what you have, though with as much veg as possible, as well as bursts of citrus flavour to liven everything up. Use these recipes as a baseline and adapt them to your liking.</p> <a href=\"https://www.theguardian.com/food/2022/dec/26/leftover-christmas-vegetables-recipes-couscous-pomegranate-sprouts-yoghurt-joe-woodhouse\">Continue reading...</a>", "link": "https://www.theguardian.com/food/2022/dec/26/leftover-christmas-vegetables-recipes-couscous-pomegranate-sprouts-yoghurt-joe-woodhouse", "date_published": "2022-12-26 08:00:25+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "The ‘who said it’ quiz of the year! Who claimed to break the rules without knowing – and who enraged social media?", "description": "<p>Here are some of 2022’s most memorable quotes on Ukraine, the Queen and Trump, but can you remember who said them?</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/26/the-who-said-it-quiz-of-the-year-who-claimed-to-break-the-rules-without-knowing-and-who-enraged-social-media\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/26/the-who-said-it-quiz-of-the-year-who-claimed-to-break-the-rules-without-knowing-and-who-enraged-social-media", "date_published": "2022-12-26 08:00:25+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Cameron Green rips through South Africa as Australia take control at MCG", "description": "<ul><li>Australia 45-1; South Africa 189 at stumps on day one</li><li><a href=\"https://www.theguardian.com/sport/2022/dec/26/shane-warne-given-new-cricket-honour-by-on-day-of-tributes-at-boxing-day-test\">Shane Warne given new honour on day of tributes</a></li></ul><p>Three million bucks, five wickets, zero problems. That was Cameron Green’s week, after the big all-rounder followed <a href=\"https://www.theguardian.com/sport/2022/dec/24/cameron-green-makes-indian-premier-league-history-with-315m-deal\">his Indian Premier League auction success</a> by bagging 5-27 in the Boxing Day Test in front of more than 64,000 people. His contribution saw South Africa bowled out for 189 after again being sent in to bat by Australian captain Patrick Cummins, confident in applying the squeeze to a team that has now gone seven innings without reaching 200. In reply Australia had moved to 45-1 by stumps.</p><p>All out for 152 and 99 to start the series in Brisbane, South Africa made only one change, bringing all-rounder Theunis de Bruyn in to bat at No 3 in place of Rassie van der Dussen. Australia went unchanged, with Scott Boland given the chance to repeat his Boxing Day heroics from last year after Josh Hazlewood told medical staff he was not completely confident in his recovery from a side strain. </p> <a href=\"https://www.theguardian.com/sport/2022/dec/26/cameron-green-rips-through-south-africa-as-australia-take-control-of-boxing-day-test\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/dec/26/cameron-green-rips-through-south-africa-as-australia-take-control-of-boxing-day-test", "date_published": "2022-12-26 07:37:53+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘Miracles and heartbreak’: saving orphaned elephants as Kenya’s drought devastates herds", "description": "<p>Sheldrick Wildlife Trust is nursing record numbers of young animals back to health but as rains continue to fail, the vulnerable mammals face a challenging future</p><p>It had been a tricky shoot for Alvin Kaunda, a young Kenyan television reporter, but finally, after about 10 takes, he was managing to get through it. His subject: a heartfelt dispatch about the plight of elephants caught up in the drought. His backdrop: three dust-red, flappy-eared orphans chomping through the greenery of their Nairobi home.</p><p>For about 30 seconds, Kaunda spoke movingly about the impact of human activity on the ecosystem. Then it all started to go awry. First, a trunk appeared in the reporter’s left ear, then on his head, then attached itself to his nose, mistaking it, perhaps, for a spot of lunch. Kaunda, who had soldiered on heroically until this point, collapsed into giggles.</p> <a href=\"https://www.theguardian.com/global-development/2022/dec/26/miracles-and-heartbreak-saving-orphaned-elephants-as-kenyas-drought-devastates-herds\">Continue reading...</a>", "link": "https://www.theguardian.com/global-development/2022/dec/26/miracles-and-heartbreak-saving-orphaned-elephants-as-kenyas-drought-devastates-herds", "date_published": "2022-12-26 07:30:24+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Russia-Ukraine war live: Moscow admits Ukrainian drone reached air base deep inside Russia, three killed", "description": "<p>Three Russian military personnel reportedly killed when a <a href=\"https://www.theguardian.com/world/live/2022/dec/26/russia-ukraine-war-live-moscow-admits-ukrainian-drone-reached-air-base-deep-inside-russia-three-killed?page=with:block-63a90a608f08c23d9f5d78ee#block-63a90a608f08c23d9f5d78ee\">drone attacked an airbase near Saratov</a>, 450 miles south-east of Moscow</p><ul><li><a href=\"https://www.theguardian.com/world/2022/dec/26/russia-ukraine-war-at-a-glance-what-we-know-on-day-306-of-the-invasion\">At a glance: what we know on day 306 of the invasion</a></li></ul><p><strong>Russians troops are working “round-the-clock” at new anti-aircraft missile system positions to defend against missile and air strikes by Ukraine</strong>, the Russian Interfax reported late on Sunday citing the defence ministry.</p><p>Crews of the S-300V systems were “mastering new position areas” of the Russian long range surface-to-air missile systems, the news agency reported.</p><p>In the interests of long-range aviation, the development and supply of the entire range of aviation weapons, including new cruise hypersonic missiles, is being carried out.”</p> <a href=\"https://www.theguardian.com/world/live/2022/dec/26/russia-ukraine-war-live-moscow-admits-ukrainian-drone-reached-air-base-deep-inside-russia-three-killed\">Continue reading...</a>", "link": "https://www.theguardian.com/world/live/2022/dec/26/russia-ukraine-war-live-moscow-admits-ukrainian-drone-reached-air-base-deep-inside-russia-three-killed", "date_published": "2022-12-26 07:16:52+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Heavy snow in Japan kills at least 17", "description": "<p>Many deaths caused by people falling from roofs or being buried underneath thick piles of snow sliding off rooftops</p><p>Heavy snow in large parts of Japan has killed 17 people and injured more than 90 while leaving hundreds of homes without power, disaster management officials have said. </p><p>Powerful winter fronts have dumped heavy snow in northern regions since last week, stranding hundreds of vehicles on highways, delaying delivery services and causing 11 deaths by Saturday.</p> <a href=\"https://www.theguardian.com/world/2022/dec/26/heavy-snow-in-japan-kills-at-least-17\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/26/heavy-snow-in-japan-kills-at-least-17", "date_published": "2022-12-26 07:13:17+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "The best songs of 2022 … you may not have heard", "description": "<p>From funk to pop to country, Guardian writers pick their favourite songs of the year that seem to have passed most listeners by</p><p>Picture the scene: you’re floating around your Frank Lloyd Wright bungalow a little lovelorn, but not so lovelorn that you can’t shuffle out a little two-step to the stereo and make yourself a cocktail. Here’s the world suggested by the bone-dry funk of Holy Hell, the lead single from the second album by Eddie Chacon. You might know him as one half of 90s duo Charles and Eddie (of Would I Lie to You? fame). After the band split in 1997 and Charles Pettigrew died in 2001, Chacon entered a wilderness period, wrestling with his ego and motivation for making music before stopping altogether. After meeting pianist and producer John Carroll Kirby (Solange, Blood Orange, Harry Styles), Chacon made the remarkable comeback album Pleasure, Joy and Happiness in 2020. Next year sees an equally fantastic follow-up, heralded by a song so addictive it put the rest of my Spotify Unwrapped in the shade. The sublime drums snap like turtles, the synths bubble as languidly as lava lamp orbs; Chacon’s ghostly croon rises to a brushed-velvet falsetto, just ready to go up in flames as he entreats a lover to choose between pleasure and pain. <em>Laura Snapes</em></p> <a href=\"https://www.theguardian.com/music/2022/dec/25/the-best-songs-of-2022-you-may-not-have-heard\">Continue reading...</a>", "link": "https://www.theguardian.com/music/2022/dec/25/the-best-songs-of-2022-you-may-not-have-heard", "date_published": "2022-12-26 07:11:24+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Can you solve it? Argentina’s creative genius", "description": "<p>Puzzles to Messi with your mind</p><p>To celebrate Argentina’s World Cup victory eight days ago, today’s puzzles are set by Rodolfo Kurchan, an internationally renowned puzzle inventor and author from Buenos Aires.</p><p><strong>1. Messi maths</strong></p> <a href=\"https://www.theguardian.com/science/2022/dec/26/can-you-solve-it-argentinas-creative-genius\">Continue reading...</a>", "link": "https://www.theguardian.com/science/2022/dec/26/can-you-solve-it-argentinas-creative-genius", "date_published": "2022-12-26 07:10:24+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "2022: the year rewilding went mainstream – and a biodiversity deal gave the world hope | Max Benato", "description": "<p>Cop15’s long-awaited agreement will be closely watched, says the Guardian’s biodiversity editor, but it was by no means the only positive nature news, despite the heartbreaking ravages of avian flu</p><p>After 12 years, two years of Covid-related delays and two weeks of intense negotiation in Montreal, the world finally got it its <a href=\"https://www.theguardian.com/environment/2022/dec/19/cop15-historic-deal-signed-to-halt-biodiversity-loss-by-2030-aoe\">once-in-a-decade deal</a> to halt the destruction of nature. Many lauded this month’s agreement at <a href=\"https://www.theguardian.com/environment/cop15\">Cop15</a> in Montreal as “historic”; many are hopeful that its ambition can be achieved; and many are concerned about whether action will meet words: not one of the last set of targets, <a href=\"https://www.theguardian.com/environment/2010/oct/27/japan-biodiversity-conference-conservation\">set in Japan in 2010</a>, was met in full.</p><p>But the fact that nearly 200 countries were able to sign off on an international agreement to halt the loss of biodiversity is something to applaud. Few thought it would happen. Now it is all about the implementation. With an estimated 1 million species at risk of extinction and a <a href=\"https://www.theguardian.com/environment/2022/dec/06/the-biodiversity-crisis-in-numbers-a-visual-guide-aoe\">69% average plunge in wildlife populations</a> between 1970 and 2018, we must not “pause for a second”, warned the UN’s environment chief, <a href=\"https://www.theguardian.com/environment/2022/dec/20/embrace-history-un-environment-chief-calls-for-immediate-action-on-cop15-deal\">Inger Andersen</a>.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/26/2022-the-year-rewilding-went-mainstream-and-a-biodiversity-deal-gave-the-world-hope\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/dec/26/2022-the-year-rewilding-went-mainstream-and-a-biodiversity-deal-gave-the-world-hope", "date_published": "2022-12-26 07:00:24+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Are you bored yet? How to turn that unfinished bottle of booze into a Christmas cocktail banger", "description": "<p>Get the shaker out and make the most of the leftovers from the big day – including the novelty creams</p><p>The aftermath of Christmas is a fine time for messing around with cocktails. There isn’t too much to do, hopefully. With any luck, the kitchen is full of half-drunk bottles, novelty creams, brandied fruits and so on. And at this stage in festive proceedings, the constitution can probably take a mid-morning cocktail or two.</p><p>For the sugar syrup, simply dissolve two parts golden caster sugar in one part hot water, and leave to cool. It will keep for six or more weeks in the fridge. All recipes serve one but should really be doubled.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/26/are-you-bored-yet-how-to-turn-that-unfinished-bottle-of-booze-into-a-christmas-cocktail-banger\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/26/are-you-bored-yet-how-to-turn-that-unfinished-bottle-of-booze-into-a-christmas-cocktail-banger", "date_published": "2022-12-26 07:00:24+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "I felt excluded by football’s homophobic lad culture – until I found an LGBT fan group | Luke Turner", "description": "<p>For years my bisexual identity and the love of West Ham I shared with my dad seemed irreconcilable. But Pride of Irons changed that</p><p>Like many of those similarly afflicted, I don’t know West Ham without my dad, or my dad without West Ham. My earliest memories of Saturday afternoons are of crackling football commentary on a transistor radio, as his tea cooled in a 70s brown and orange mug – a familiar place of safety and happiness. Like our shared big noses, my support for West Ham wasn’t something I could really choose of my own free will.</p><p>As a teenager I was still listening to matches on the radio while I did my homework, but gradually the emotional pull of football waned. The son of one of mum’s best friends, who was the same age as me, was murdered in an incident connected to Scottish football sectarianism. I rolled my eyes at the naff jingoism surrounding the 1996 European Championships. Above all, the sport seemed at odds with my growing confusion about my sexuality. During the 1990s, it was a pillar of the homophobic lad culture that I encountered at school, in the media, on the stands when dad and I went to Upton Park, and in the brutal treatment of the gay footballer Justin Fashanu, who died by suicide in 1998. I felt excluded from football, and music took over as my life’s passion.</p><p>Luke Turner’s second book, Men at War: Loving, Lusting, Fighting, Remembering 1939-1945, is out next year</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/26/bisexual-man-football-fan-west-ham\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/dec/26/bisexual-man-football-fan-west-ham", "date_published": "2022-12-26 07:00:24+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Through the looking glass: Guardian portraits of the year – in pictures", "description": "<p>From Steve-O and Samantha Morton to nudists and pigeon racers, here are the Guardian and Observer’s best portraits – and features – of the year</p> <a href=\"https://www.theguardian.com/artanddesign/gallery/2022/dec/26/guardian-portraits-of-the-year-in-pictures\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/gallery/2022/dec/26/guardian-portraits-of-the-year-in-pictures", "date_published": "2022-12-26 07:00:24+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Now Something Is Slowly Changing review – a cold hard look at personal growth", "description": "<p>From leadership training with horses to learning emotional growth with pigs, the self-improvement industry is coolly scrutinised in this enigmatic documentary</p><p>Menna Laura Meijer’s documentary is an intriguing, if distinctly refrigerated, look at the various ways in which people in the Netherlands are coached in personal growth and mindfulness. The movie is a series of tableaux, with the various study sessions and encounter groups shot from a distance in a fixed camera position, very rarely cutting to a closeup. The movie washes every scene with an invigoratingly cold, clear light and there is an elegant visual and compositional sense in every frame.</p><p>We see quarterlife crisis coaching and leadership training with horses; people learn emotional focus and centredness by lying down in a barnyard stroking some very clean-looking pigs. Cops learn not to react to provocation through role-playing. People learn how to take ownership of their emotions so their emotions do not take ownership of them. There is tree climbing to overcome fear and some (eminently sensible) tutoring in fall prevention for senior citizens.</p> <a href=\"https://www.theguardian.com/film/2022/dec/26/now-something-is-slowly-changing-review-a-cold-hard-look-at-personal-growth\">Continue reading...</a>", "link": "https://www.theguardian.com/film/2022/dec/26/now-something-is-slowly-changing-review-a-cold-hard-look-at-personal-growth", "date_published": "2022-12-26 07:00:23+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘Seas are becoming landfills’: the Senegalese surfer saving a beach – and a way of life – from plastic", "description": "<p>Babacar Thiaw has surfed Dakar’s beach for 20 years. To protect it for future generations, he realised he needed the help of a whole community</p><p>It took a wave of plastic-strewn water crashing over Babacar Thiaw as he paddled out to sea for him to decide to act.</p><p>By the time his surfboard had carried him back to Virage beach on the north shore of Senegal’s capital, Dakar, Thiaw had a plan that would make use of the surfing community he had built there.</p> <a href=\"https://www.theguardian.com/global-development/2022/dec/26/seas-becoming-landfills-senegalese-surfer-saving-beach-from-plastic\">Continue reading...</a>", "link": "https://www.theguardian.com/global-development/2022/dec/26/seas-becoming-landfills-senegalese-surfer-saving-beach-from-plastic", "date_published": "2022-12-26 06:15:22+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "How Tom Kerridge met Beth Cullen: ‘Her first words to me were: Give me £3 for the stripper!’", "description": "<p>Sculptor Cullen, 52, proposed to chef Kerridge, 49, six weeks after they met at a bar. They have now been married for 22 years and have a young son</p><p>The night Tom Kerridge met his future wife, Beth, he had just finished his shift as a chef in Covent Garden, London, and he wanted to go home – but it was his friend’s birthday and his flatmate dragged him out. “We went into Camden, walked into a bar and there was this loud northern woman,” says Tom with a laugh. “She went: ‘You’re Tom. Give me £3 for the stripper.’” (To be fair, this was 1997, when it was still considered ironic to get a stripper for a friend’s birthday.) “That was the first sentence Beth said to me.”</p><p>Beth Cullen, <a href=\"https://bethcullensculpture.co.uk/\">a sculptor</a>, worked with Tom’s best friend’s brother as an assistant for the artist Sir Anthony Caro. That night, she says, they “talked for ages, and somebody actually said: ‘How long have you been going out?’ We were like: ‘We’ve just met!’ We just hit it off.” What did they talk about? “I have to be honest, it was 25 years ago and I was quite a big drinker then, so I have absolutely no idea,” says Tom. But obvious flirtation? “It was like it was already there,” says Beth. “We were flirty, but it was already a done deal.” Tom adds: “It was like we’d known each other for ages.”</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/26/how-tom-kerridge-met-beth-cullen-her-first-words-to-me-were-give-me-3-for-the-stripper\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/26/how-tom-kerridge-met-beth-cullen-her-first-words-to-me-were-give-me-3-for-the-stripper", "date_published": "2022-12-26 06:00:24+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "The best theatre, dance and comedy tickets to book for 2023", "description": "<p>Danny Boyle’s Matrix-inspired spectacular opens in Manchester, Succession star Brian Cox returns to the stage and standups Maisie Adam, Guz Khan and Catherine Cohen are on tour</p><ul><li><a href=\"https://viewer.gutools.co.uk/culture/series/2023-culture-preview\">More from the 2023 culture preview</a></li></ul> <a href=\"https://www.theguardian.com/stage/2022/dec/26/the-best-theatre-dance-and-comedy-tickets-to-book-for-2023\">Continue reading...</a>", "link": "https://www.theguardian.com/stage/2022/dec/26/the-best-theatre-dance-and-comedy-tickets-to-book-for-2023", "date_published": "2022-12-26 06:00:23+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "‘Very weak’ Rohingya refugees land on Indonesia beach after weeks at sea", "description": "<p>Local people and authorities in Aceh province aid 58 men after UN had urged countries in the region to rescue 190 adrift on small boat </p><p>Dozens of hungry and weak Rohingya Muslims were found on a beach in Indonesia’s northernmost province of Aceh on Sunday after weeks at sea, officials said.</p><p>The group of 58 men arrived on Indrapatra beach at Ladong, a fishing village in Aceh Besar district, said local police chief Rolly Yuiza Away. Villagers who saw the group of Rohingya on a rickety wooden boat helped them to land and then reported their arrival to authorities, he said.</p> <a href=\"https://www.theguardian.com/world/2022/dec/26/very-weak-rohingya-refugees-land-on-indonesia-beach-after-weeks-at-sea\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/26/very-weak-rohingya-refugees-land-on-indonesia-beach-after-weeks-at-sea", "date_published": "2022-12-26 05:01:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "What did I achieve in 2022? Erm, let me get back to you on that one | Arwa Mahdawi", "description": "<p>What healthy habits did I take up in 2022? I’m racking my brain, searching for scraps of self-improvement, but I’ve had a hard time finding any</p><p>It’s humblebragging season. Around this time of year newspapers are stuffed to the brim with articles about what so-and-so achieved in 2022 and what they hope to achieve in 2023. They read a book a day! They gave up alcohol! They gave up social media! They took up <a href=\"https://www.theguardian.com/lifeandstyle/2022/oct/01/wild-swimming-health-miracle-or-a-high-risk-pastime\">wild swimming</a>!</p><p>Me? I did none of those things. Especially not wild swimming, which is a peculiarly British obsession. There’s nothing Brits love more than turning something objectively miserable into a hobby. Long muddy walks, beans on toast, swimming in freezing cold lakes: if it’s damp and vaguely masochistic, Brits are all over it.</p><p>Arwa Mahdawi is a Guardian columnist</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/26/healthy-habits-end-of-year\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/dec/26/healthy-habits-end-of-year", "date_published": "2022-12-26 05:00:21+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Aid groups suspend Afghanistan operations after ban on women working for NGOs", "description": "<p>Four international aid groups say they cannot work effectively without female staff and Red Cross warns of ‘catastrophic’ consequences</p><p>Four major international aid groups have suspended their operations in Afghanistan following a decision by the Taliban regime to ban women from working at non-governmental organisations.</p><p>Save the Children, the International Rescue Committee, the Norwegian Refugee Council and CARE said on Sunday they could not effectively reach people in desperate need without the women in their workforces. The NGO ban was <a href=\"https://www.theguardian.com/world/2022/dec/24/taliban-stop-women-from-working-for-aid-organisations\">introduced a day earlier</a>, allegedly because women were not wearing the Islamic headscarf correctly.</p> <a href=\"https://www.theguardian.com/world/2022/dec/26/aid-groups-suspend-afghanistan-operations-after-ban-on-women-working-for-ngos\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/26/aid-groups-suspend-afghanistan-operations-after-ban-on-women-working-for-ngos", "date_published": "2022-12-26 04:15:41+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "NBA Christmas 2022: Tatum’s 41 power Celtics past Bucks in top-two matchup", "description": "<ul><li>Tatum has 41, Celtics push back on Giannis, Bucks 139-118</li><li>Doncic, Mavs top Lakers 124-115 to celebrate Nowitzki statue</li><li>Embiid helps 76ers blow by Knicks to win eighth straight</li></ul><p>Jaylen Brown knocked down his shots in the fourth quarter. And then he knocked down Bucks star Giannis Antetokounmpo.</p><p>Brown scored 13 of his 29 points in the fourth, and Jayson Tatum scored 41 for Boston on Sunday to help the Celtics beat Milwaukee 139-118 in a matchup of the top two teams in the NBA.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/25/nba-christmas-day-games-2022-scores\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/dec/25/nba-christmas-day-games-2022-scores", "date_published": "2022-12-26 03:34:58+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Can I tell you a secret? Episode one: the beginning | podcast", "description": "<p>Revisited: Guardian journalist Sirin Kale takes us to a small town in the north of England to uncover how one man began a decade of cyberstalking</p><p><em>This week we are revisiting the Can I tell you a secret? series. This episode was first broadcast on 23 September 2022.</em></p><p>In this seven-episode podcast, the Guardian journalist <strong>Sirin Kale</strong> investigates the story of Matthew Hardy, a cyberstalker who terrified people in his hometown and beyond for more than a decade.</p> <a href=\"https://www.theguardian.com/news/audio/2022/dec/26/can-i-tell-you-a-secret-episode-one-the-beginning-podcast\">Continue reading...</a>", "link": "https://www.theguardian.com/news/audio/2022/dec/26/can-i-tell-you-a-secret-episode-one-the-beginning-podcast", "date_published": "2022-12-26 03:00:19+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Dozens of Chinese warplanes cross Taiwan median line", "description": "<p>Beijing says drills also involving navy ships are a ‘firm response’ after US defence spending bill prioritised support for Taiwan</p><ul><li><a href=\"https://www.theguardian.com/world/2022/aug/01/china-and-taiwan-whats-behind-the-tensions-in-30-seconds\">China-Taiwan relations: what’s behind the tensions?</a></li></ul><p>China’s military sent 71 planes and seven ships toward Taiwan in a 24-hour display of force directed at the island, Taiwan’s defense ministry said, after China expressed anger at Taiwan-related provisions in a US annual defense spending bill passed on Saturday.</p><p>China’s military harassment of self-ruled Taiwan, which Beijing claims to own, has intensified in recent years, and the Communist party’s People’s Liberation Army has sent planes or ships toward the island on a near-daily basis.</p> <a href=\"https://www.theguardian.com/world/2022/dec/26/dozens-of-chinese-warplanes-cross-taiwan-median-line\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/26/dozens-of-chinese-warplanes-cross-taiwan-median-line", "date_published": "2022-12-26 02:55:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "US storm: dozens of lives lost as Arctic freeze takes hold", "description": "<p>Fears death toll will rise as weather warnings cover around 60% of the US</p><p>Millions of people have hunkered down to ride out the winter storm that has killed at least 34 people across the United States and is expected to claim more lives after trapping people inside houses and knocking out power to tens of thousands of homes and businesses.</p><p>The scope of the storm has been on a rarely seen scale, stretching from Canada down to the Rio Grande along the border with Mexico.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/26/us-storm-dozens-of-lives-lost-as-arctic-freeze-grips-nation\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/dec/26/us-storm-dozens-of-lives-lost-as-arctic-freeze-grips-nation", "date_published": "2022-12-26 02:17:41+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Activists to revisit controversial ‘Where is Peng Shuai’ protests at January Australian Open", "description": "<p>One of the protesters, Drew Pavlou, says they want to ‘make trouble’ for Tennis Australia over its links to China</p><ul><li><a href=\"https://www.theguardian.com/australia-news/live/2022/dec/26/australia-news-live-floods-south-australia-river-murray-drownings-boxing-day-plane-crash-northern-territory\">Follow our Australia news live blog for the latest updates</a></li><li>Get our <a href=\"https://www.theguardian.com/australia-news/2022/oct/29/email-newsletters-guardian-australia-best-daily-news-emails-newsletter-free-sign-up-inbox-subscribe-headlines?CMP=cvau_sfl\">morning and afternoon news emails</a>, <a href=\"https://www.theguardian.com/technology/ng-interactive/2018/may/15/the-guardian-app?CMP=cvau_sfl\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></li></ul><p> Activists plan to reprise their controversial “Where is Peng Shuai?” protest at next month’s grand slam, with the support of three-time Australian Open winner Martina Navratilova.</p><p>At this year’s Open in January, Tennis Australia was criticised for initially confiscating the shirts, citing a ban on “commercial or political” material. The decision was later reversed.</p> <a href=\"https://www.theguardian.com/australia-news/2022/dec/26/activists-to-revisit-controversial-where-is-peng-shuai-protests-at-january-australian-open\">Continue reading...</a>", "link": "https://www.theguardian.com/australia-news/2022/dec/26/activists-to-revisit-controversial-where-is-peng-shuai-protests-at-january-australian-open", "date_published": "2022-12-26 02:11:58+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "title": "Russia-Ukraine war at a glance: what we know on day 306 of the invasion", "description": "<p>Explosions heard at Russia’s Engels air base hundreds of miles from Ukraine’s front lines; Putin says west trying to ‘tear apart’ Russia</p><ul><li><strong><a href=\"https://www.theguardian.com/world/ukraine\">See all our Ukraine war coverage</a></strong></li></ul> <a href=\"https://www.theguardian.com/world/2022/dec/26/russia-ukraine-war-at-a-glance-what-we-know-on-day-306-of-the-invasion\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/dec/26/russia-ukraine-war-at-a-glance-what-we-know-on-day-306-of-the-invasion", "date_published": "2022-12-26 01:31:54+00:00", "persistent": false, "user": null, "language": "en-US"}]