{"entries": [{"source": "https://feeds.feedburner.com/TheHackersNews", "link": "https://thehackernews.com/2022/12/guloader-malware-utilizing-new.html", "title": "GuLoader Malware Utilizing New Techniques to Evade Security Software", "date_published": "2022-12-26 12:27:00+00:00", "description": "Cybersecurity researchers have exposed a wide variety of techniques adopted by an advanced malware downloader called GuLoader to evade security software.\n\"New shellcode anti-analysis technique attempts to thwart researchers and hostile environments by scanning entire process memory for any virtual machine (VM)-related strings,\" CrowdStrike researchers Sarang Sonawane and Donato Onofri said in a", "persistent": false, "language": "en-US"}, {"source": "https://feeds.feedburner.com/TheHackersNews", "link": "https://thehackernews.com/2022/12/2022-top-five-immediate-threats-in.html", "title": "2022 Top Five Immediate Threats in Geopolitical Context", "date_published": "2022-12-26 12:20:00+00:00", "description": "As we are nearing the end of 2022, looking at the most concerning threats of this turbulent year in terms of testing numbers offers a threat-based perspective on what triggers cybersecurity teams to check how vulnerable they are to specific threats. These are the threats that were most tested to validate resilience with the Cymulate security posture management platform between January 1st and", "persistent": false, "language": "en-US"}, {"source": "https://feeds.feedburner.com/TheHackersNews", "link": "https://thehackernews.com/2022/12/privateloader-ppi-service-found.html", "title": "PrivateLoader PPI Service Found Distributing Info-Stealing RisePro Malware", "date_published": "2022-12-26 12:12:00+00:00", "description": "The pay-per-install (PPI) malware downloader service known as PrivateLoader is being used to distribute a previously documented information-stealing malware dubbed RisePro.\nFlashpoint spotted the newly identified stealer on December 13, 2022, after it discovered \"several sets of logs\" exfiltrated using the malware on an illicit cybercrime marketplace called Russian Market.\nA C++-based malware,", "persistent": false, "language": "en-US"}], "source": {"url": "https://feeds.feedburner.com/TheHackersNews", "title": "The Hacker News"}}