{"entries": [{"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/pranked-pence-spox-denies-former-vp-filed-for-presidential-campaign", "title": "Pranked? Pence Spox Denies Former VP Filed For Presidential Campaign", "date_published": "2022-12-26 18:56:18+00:00", "description": "No, former Vice President Mike Pence did not file to run for president in 2024. His spokesman, Devin O&#8217;Malley, quickly snuffed out early buzz stemming from a Statement of Candidacy form submitted to the Federal Election Commission in Pence&#8217;s name on Monday. &#8220;Former Vice President Mike Pence did not file to run for President today,&#8221; ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/ted-lieu-deletes-tweet-after-getting-fact-checked-by-elon-musk", "title": "Ted Lieu Deletes Tweet After Getting Fact-Checked By Elon Musk", "date_published": "2022-12-26 18:50:31+00:00", "description": "Rep. Ted Lieu (D-CA) deleted a tweet Monday after getting called out by Twitter CEO Elon Musk for posting false information about the latest release of &#8220;The Twitter Files.&#8221; The latest Twitter Files release showed that the Biden administration pressed the social media platform to suppress alleged COVID “disinformation” while promoting the White House’s preferred ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/nord-stream-whodunit-gets-complicated-as-russia-takes-steps-to-repair-sabotaged-pipelines", "title": "Nord Stream Whodunit Gets Complicated As Russia Takes Steps To Repair Sabotaged Pipelines", "date_published": "2022-12-26 18:44:58+00:00", "description": "Russia is preparing to make expensive repairs to a pair of natural gas pipelines in the Baltic Sea that many Western experts suspected Moscow had ordered sabotaged to begin with. Moscow&#8217;s latest moves complicate already uncertain theories about who could be responsible for bombing the Nord Stream pipelines in September and why. Swedish investigators looking ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/after-true-life-grinch-steals-indiana-familys-food-and-presents-police-save-christmas-with-donations", "title": "After ‘True-Life Grinch’ Steals Indiana Family’s Food And Presents, Police Save Christmas With Donations", "date_published": "2022-12-26 18:33:23+00:00", "description": "Police in Indiana saved Christmas for one family whose holiday cheer was ruined by a &#8220;true-life Grinch.&#8221; The South Bend Police Department responded to a breaking and entering report on Christmas Eve morning. A burglar had taken food from the refrigerator and all the family&#8217;s Christmas presents, leaving nothing for the children to open on ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/new-study-details-how-pediatricians-can-identify-trafficked-children", "title": "New Study Details How Pediatricians Can Identify Trafficked Children", "date_published": "2022-12-26 18:28:05+00:00", "description": "The American Academy of Pediatrics updated a clinical report last week about assisting pediatricians with identifying children and teens subjected to human trafficking. The Council on Child Abuse and Neglect and Council on Immigrant Child and Family Health published the “Exploitation, Labor and Sex Trafficking of Children and Adolescents: Health Care Needs of Patients” report ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/schiff-gets-serious-about-senate-run-im-getting-a-lot-of-encouragement", "title": "Schiff Gets ‘Serious’ About Senate Run: ‘I’m Getting A Lot of Encouragement’", "date_published": "2022-12-26 18:22:15+00:00", "description": "Rep. Adam Schiff (D-CA) said he is giving &#8220;serious&#8221; consideration to a run for Senate. Such an endeavor could raise Schiff&#8217;s profile even higher after the congressman established himself as a leading Trump foe on the national stage while serving as chairman of the House Intelligence Committee, impeachment manager, and member of the January 6 ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/mark-cuban-bashes-progressive-san-francisco-tech-industry-pretentious-as-f", "title": "Mark Cuban Bashes Progressive San Francisco Tech Industry: ‘Pretentious As F***’", "date_published": "2022-12-26 18:17:12+00:00", "description": "Entrepreneur and multibillionaire Mark Cuban slammed the Left-wing policies of San Francisco during an interview on Bill Maher&#8217;s &#8220;Club Random&#8221; podcast over the weekend. Cuban and Maher spoke on Sunday&#8217;s episode of the show about the current state of affairs in the country. “I could not live here as a permanent resident just ’cause of ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/nfl-players-suspended-for-throwing-punches-after-game", "title": "NFL Players Suspended For Throwing Punches After Game", "date_published": "2022-12-26 18:06:24+00:00", "description": "A linebacker for the Denver Broncos and an offensive lineman for the Los Angeles Rams were suspended for one week without pay after throwing punches following the game between the two teams over the weekend. Edge rusher Randy Gregory and offensive guard Oday Aboushi traded blows as the teams were shaking hands following the Rams&#8217; ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/nepo-babies-jamie-lee-curtis-kate-hudson-fight-back-i-dont-care-where-you-come-from", "title": "‘Nepo Babies’ Jamie Lee Curtis & Kate Hudson Fight Back: ‘I Don’t Care Where You Come From’ “", "date_published": "2022-12-26 17:58:12+00:00", "description": "Hollywood &#8220;nepo babies&#8221; Jamie Lee Curtis and Kate Hudson hit back at critics who appeared to suggest that the film industry — and other arenas as well — gave deference to the children of celebrities. The topic graced the latest cover of New York Magazine, along with the headline, &#8220;Aw, Look! She Has Her Mother&#8217;s ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/artificial-intelligence-is-the-future-of-plagiarism-university-professor-warns", "title": "Artificial Intelligence Is The Future Of Plagiarism, University Professor Warns", "date_published": "2022-12-26 17:19:56+00:00", "description": "A university professor is warning his administration, and universities across the country, that AI chatbots are the future of plagiarism. In a Facebook post earlier this month, Furman University philosophy professor Darren Hick recounted his first experience with a student who attempted to use an artificial intelligence chat software to cheat on an assignment. Hick ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/see-it-the-trump-tweet-that-ex-fbi-lawyer-jim-baker-said-should-be-a-violation-of-covid-policy", "title": "SEE IT: The Trump Tweet That Ex-FBI Lawyer Jim Baker Said Should Be A Violation Of COVID Policy", "date_published": "2022-12-26 17:12:03+00:00", "description": "Former General Counselor of the FBI (and former Twitter Deputy General Counsel) James Baker reportedly assisted in the effort to stifle any dissenting voices when it came to COVID-19 — even, or perhaps especially, when the dissenting voice belonged to then-President Donald Trump. According to the most recent dump in the ongoing &#8220;Twitter Files&#8221; series, ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/jackson-mississippi-issues-christmas-boil-order-after-water-lines-break-in-freezing-temperatures", "title": "Jackson, Mississippi Issues Christmas Boil Order After Water Lines Break In Freezing Temperatures", "date_published": "2022-12-26 16:05:43+00:00", "description": "The already embattled city of Jackson, Mississippi issued another boil water notice to residents as a dangerous winter storm swept across the country this week. In a public announcement on Christmas Day, city officials in Jackson urged residents to boil city water because of low water pressure in the city&#8217;s pipes. Officials attributed the pressure ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/mean-girls-actress-defends-hallmark-after-candace-cameron-bure-exit-everything-is-centered-around-the-heart", "title": "‘Mean Girls’ Actress Defends Hallmark After Candace Cameron Bure Exit: ‘Everything Is Centered Around The Heart’", "date_published": "2022-12-26 15:48:25+00:00", "description": "Actress Lacey Chabert made it clear that she was standing by the Hallmark Channel after former network star Candace Cameron Bure left to pursue a relationship with competing channel Great American Family. Bure, who made a number of Christmas movies and starred in a mystery-movie franchise at Hallmark, announced the surprise move in early 2022. ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/kari-lake-could-be-on-hook-for-big-payday-benefiting-dem-lawyer-from-steele-dossier-debacle", "title": "Kari Lake Could Be On Hook For Big Payday Benefiting Dem Lawyer From Steele Dossier Debacle", "date_published": "2022-12-26 15:32:14+00:00", "description": "A high-powered Democratic attorney who became a big name in the Trump-Russia controversy may get a hefty paycheck for battling Kari Lake in her recently tossed 2022 election lawsuit seeking to overturn the results of last month&#8217;s governor&#8217;s race. Arizona Governor-elect Katie Hobbs and Maricopa County filed motions on Monday for sanctions against Lake and ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/king-charles-evicts-prince-andrew-from-buckingham-palace", "title": "King Charles ‘Evicts’ Prince Andrew From Buckingham Palace", "date_published": "2022-12-26 14:37:40+00:00", "description": "King Charles III reportedly evicted the disgraced Duke of York Prince Andrew from using an office at Buckingham Palace in the wake of his ties to convicted pedophile Jeffrey Epstein. The 62-year-old Duke reportedly paid millions of dollars in an out-court settlement after Virginia Giuffre accused the Royal Family member of sexually abusing and raping ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/west-point-begins-removing-confederate-monuments-from-campus-robert-e-lee-portrait-and-bust-cleared-out", "title": "West Point Begins Removing Confederate Monuments From Campus; Robert E. Lee Portrait And Bust Cleared Out", "date_published": "2022-12-26 14:22:59+00:00", "description": "West Point has begun to remove monuments and references that “commemorate or memorialize the Confederacy,” the academy announced last week.  The 220-year-old U.S. military academy said it had begun a “multi-phase” process over the holiday break to remove all 13 references and monuments that West Point says honor the Confederacy, including a portrait and bust ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/nfls-broncos-sack-rookie-head-coach-after-embarrassing-loss", "title": "NFL Team Sacks Rookie Head Coach After Embarrassing Loss", "date_published": "2022-12-26 14:00:48+00:00", "description": "The Denver Broncos fired head coach Nathaniel Hackett Monday, following a humiliating 51-14 loss to the Los Angeles Rams that dropped the team’s record to 4-11. Hackett, who was in his first year coaching the team, lost the confidence of the team’s new ownership, led by Walmart heir Rob Walton. The Broncos have struggled all ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/superhero-fatigue-studio-suits-grow-increasingly-nervous-over-gargantuan-budget-films", "title": "Superhero Fatigue: Studio Suits Grow Increasingly Nervous Over Gargantuan Budget Films", "date_published": "2022-12-26 12:50:44+00:00", "description": "All you needed to know about the hunger for superhero content came with 2018’s “Venom.” Tom Hardy’s anti-hero romp got hammered by critics and is considered one of the weaker superhero films of the modern era. It still earned more than $200 million at the U.S. box office, according to BoxOfficeMojo.com, generating a sequel in ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/latest-twitter-files-reveal-biden-admin-push-against-covid-19-disinformation", "title": "Latest Twitter Files Reveal How Biden Admin ‘Rigged’ The COVID Vaccine Debate", "date_published": "2022-12-26 12:46:37+00:00", "description": "The latest Twitter Files release shows that the Biden administration pressed the social media platform to suppress alleged COVID &#8220;disinformation&#8221; while promoting the White House&#8217;s preferred messaging. The Monday updates came in the form of a series of tweets from Free Press reporter David Zweig. The federal government reportedly &#8220;rigged&#8221; the COVID debate, &#8220;By censoring ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/2-dead-4-injured-in-new-orleans-mass-shooting", "title": "2 Dead, 4 Injured In New Orleans Mass Shooting", "date_published": "2022-12-26 12:08:47+00:00", "description": "An overnight shooting in New Orleans left two people dead and four more wounded, police reported. All of the victims were teenagers, with no suspect in custody, according to local authorities, who responded to the incident at the 2000 block of St. Maurice Avenue in the Lower Ninth Ward neighborhood. The shooting occurred around 12:30 ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/watch-ukraine-likens-war-effort-to-die-hard-in-film-trailer-style-video", "title": "WATCH: Ukraine Likens War Effort To ‘Die Hard’ In Film Trailer-Style Video", "date_published": "2022-12-26 12:02:02+00:00", "description": "Ukraine plays John McClane in a new Christmas-themed video posted on Twitter by the embattled nation’s defense ministry. The one-minute video is a trailer-style sendup for the 1988 action film classic “Die Hard,” with Ukraine in the role of McClane, the hero NYPD cop played by Bruce Willis who single-handedly bests a gang of terrorists ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/substation-attacks-leave-15k-washington-homes-without-power-on-christmas", "title": "Substation Attacks Leave 15K Washington Homes Without Power On Christmas", "date_published": "2022-12-26 11:41:39+00:00", "description": "Over 15,000 homes were without power on Christmas Day after vandals damaged four substations in Washington State. The attacks began at 2:30 a.m. Pacific Time Sunday, according to Puget Sound Energy. Three attacks occurred during the early morning hours, with a fourth incident later reported on Christmas night. “It is unknown if there are any ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/more-than-50-people-dead-during-extreme-winter-weather-across-u-s", "title": "More Than 50 People Dead During Extreme Winter Weather Across U.S.", "date_published": "2022-12-26 11:30:54+00:00", "description": "More than 50 people are dead nationwide following extreme winter weather and low temperatures across the United States. The deaths occurred in over a dozen states, with at least 17 reported in New York alone after a massive snowstorm in Buffalo. “We do believe based on reports we’re getting from the field we are going ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/celeb-backed-bail-fund-closes-chapter-after-waiter-shot-by-man-it-sprang-sues", "title": "Celeb-Backed Bail Fund Closes Chapter After Waiter Shot By Man It Sprang Sues", "date_published": "2022-12-26 11:14:29+00:00", "description": "The Bail Project, an organization that openly states that it wants to “disrupt the money bail system” and is backed by celebrities including John Legend, Danny Glover, and Richard Branson, has closed its Las Vegas chapter after being sued for posting bond for a career criminal who shot an Asian waiter six days later. Rashawn ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/san-francisco-cannot-clear-out-homeless-encampments-judge-rules", "title": "San Francisco Cannot Clear Out Homeless Encampments, Judge Rules", "date_published": "2022-12-26 10:30:10+00:00", "description": "San Francisco cannot clear out its ubiquitous homeless encampments because it hasn’t offered shelter to their inhabitants, a federal judge ruled Friday. The city had been conducting sweeps in which it took the tents and belongings of homeless people living in the tent cities until Magistrate Judge Donna Ryu in the U.S. District Court in ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/insanely-disrespectful-nfl-network-lambasted-after-cutting-to-commercial-during-franco-harris-tribute", "title": "‘Insanely Disrespectful’: NFL Network Lambasted After Cutting To Commercial During Franco Harris Tribute", "date_published": "2022-12-26 10:21:03+00:00", "description": "Saturday night in Pittsburgh was nearly perfect for football fans who filled Acrisure Stadium to watch the action and remember an NFL great, but those watching the NFL Network’s broadcast of the much-anticipated halftime ceremony soon became incensed.  The Steelers Christmas Eve matchup against the Las Vegas Raiders was more than a game — it ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/china-send-71-warplanes-around-taiwan-in-strike-drill", "title": "China Send 71 Warplanes Around Taiwan In ‘Strike Drill’", "date_published": "2022-12-26 09:59:30+00:00", "description": "Seventy-one Chinese warplanes were detected flying around Taiwan on Sunday, performing military exercises, according to Taiwan’s Defense Ministry. According to the People&#8217;s Liberation Army, China was conducting a “strike drill” in response to “provocations” and “collusion” between Taiwan and the United States. “71 PLA aircraft and 7 PLAN vessels around Taiwan were detected in our ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/purported-inventor-of-email-tosses-hat-in-twitter-ceo-ring", "title": "Purported Inventor Of Email Tosses Hat In Twitter CEO Ring", "date_published": "2022-12-26 09:33:32+00:00", "description": "If you’re hoping to succeed Elon Musk as CEO of Twitter, you have some serious competition – from the man who claims to have invented email. Shiva Ayyadurai, the MIT-trained brainiac sometimes credited with creating digital correspondence, tweeted Saturday that he wants the job. Musk, who bought Twitter in October for $44 billion and has ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/futuristic-scenes-as-buffalo-freezes-over-at-least-16-people-dead", "title": "Futuristic Scenes As Buffalo Freezes Over, At Least 16 People Dead", "date_published": "2022-12-26 09:18:06+00:00", "description": "This may not be the time to insist on global warming to the people of Buffalo, New York, where the freezing temperatures over the weekend have left houses covered in ice, and at least 16 people reportedly died from the frozen weather. Some reports stated that the blizzard that hit Buffalo was the worst to ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/onetime-desantis-opponent-andrew-gillum-loses-bid-to-toss-corruption-charges", "title": "Onetime DeSantis Opponent Andrew Gillum Loses Bid To Toss Corruption Charges", "date_published": "2022-12-26 08:29:26+00:00", "description": "Florida Democrat Andrew Gillum, who lost a close 2018 election to Governor Ron DeSantis before being found in a motel unconscious with drugs and a male escort, will have to face trial on federal charges including fraud and lying to the FBI. U.S. District Judge Allen Winsor declined last week to throw out the case ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/south-korea-scrambles-fighter-jets-attack-helicopters-to-shoot-down-north-korean-drones", "title": "South Korea Scrambles Fighter Jets, Attack Helicopters To Shoot Down North Korean Drones", "date_published": "2022-12-26 08:19:08+00:00", "description": "South Korea responded with force to a potential North Korean threat Monday after drones from the Hermit Kingdom violated South Korea’s airspace.  Five North Korean drones flew across the demilitarized zone (DMZ), the first violation of South Korea’s airspace in five years, officials said, according to The Associated Press. One drone was detected as far ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/abc-news-producer-dies-suddenly-of-a-heart-attack-at-37", "title": "ABC News Producer Dies Suddenly Of A Heart Attack At 37", "date_published": "2022-12-26 07:43:04+00:00", "description": "Dax Tejera, executive producer of &#8220;This Week&#8221; on ABC News, died of a heart attack Friday, according to the network. He was 37. ABC News President Kim Godwin sent a memo to staff on Saturday announcing his passing. &#8220;It’s with a heavy heart and great sadness that we share that our friend and colleague, Dax ...", "persistent": false, "language": "en-US"}], "source": {"url": "https://www.dailywire.com/feeds/rss.xml", "title": "Daily Wire"}}