[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "NO CLEVO? Starlabs Starbook Mk. V review", "description": "We've got a very special laptop running Linux out of the box: the StarLabs Starbook Mark 5. This one is pretty different from virtually every other manufacturer: it's NOT using a clevo or tongfang chassis, it's custom designed, aluminium, and it's a pretty amazing ultrabook that really deserves an in depth look.\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nI also do a Gaming Podcast: https://www.youtube.com/channel/UCbRPZ11S1quJ4ESoj42A3ug\n\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n00:00 Intro\n00:32 Unboxing\n02:01 Device and Build\n05:34 Display\n06:15 Keyboard and Trackpad\n07:46 Speakers, mic, and webcam\n09:24 Performance\n11:18 Price? Should I buy?\n13:15 Support the channel\n\nStarbook: https://starlabs.systems/pages/starbook\n\nThe StarBook mk 5 is made out of black anodised aluminium. The chassis is custom designed by Starlabs, and it's a good one. It's sturdy, with some flex in the middle of the keyboard deck.\n\nBranding is super minimal, with a starlabs logo on the back, and that's it. It's also super easy to open up, with 10 philips screws, that give you access to the RAM and SSD if you want to replace them. \n\nMy unit has a UK keyboard, but you cant get a US, Spanish, French, or Nordic keyboard.\n\nIn terms of choices, you can get either an i3 1115G4, or an 1165G7, from 8 to 64Gb of RAM, up to 1TB of SSD, and a preinstalled distro of your liking, choosing from Ubuntu, Mint, manjaro, MX Linux, Zorin, elementary OS, and a lot of others. What's also really interesting is that they actually let you choose between the AMI BIOS, or Coreboot, which my model has.\n\nI/O wise, it's pretty limited: you have 2 USB A 3.0, one USB 2.0, one thunderbolt 4 port that supports charging, a micro SD card reader, a headphone jack, and a full HDMI port, plus the super small barrel charger if you don't spring for the USB C charging cable.\n\nThe screen is a TFT panel, at 1080p. The viewing angles are excellent, at 178 degrees, colors are accurate, with 100% covering of sRGB, and the anti glare coating means severely reduced reflections.\n\nTyping on the Starbook is nice. Their keyboard is a chiclet design, with large keys, well spaced. The keys have pretty shallow key travel, but they're relatively soft at the end, so it doesn't feel like you're typing on glass. Keys are stable, actuate reliably, and it's generally a good typing experience.\n\nYou even get an unbranded super key, which, IMO, is better than trying to fit either a logo or a tux key. \n\nThe trackpad is full reflective glass. It looks super cool, feels super smooth, especially for the trackpad gestures in elementary OS. It's very precise, and the click feels super solid, not plasticky, or like it makes the chassis move.\n\nThe speakers are better than most I've used, but still only OK. They can go pretty loud, but highs will make the chassis vibrate. They're decent, but nothing special.\n\nThe microphone is really bad. It picks up sound from the fans when they're running, trackpad clicks, key presses, and the sound is super tinny. Laptop mics tend to be really crappy, but this one is really sub par.\nThe webcam is also really basic, like most other laptops. It kinda even felt worse, with a softness and a lot of noise on the image. It's supposed to be 720p, but it feels 480p to me.\n\nOn Geekbench 5, the i7 1165G7 got 1667 in single core, and 4700 in multi core. \n\nIt's also not a noisy laptop. The fan rarely runs at full speed, and when it does, it's not helicopter like, although there is a bit of whine, barely audible. It aggressively shuts down instead of ramping down, which means you might hear it in short bursts in normal use.\n\nThe stardrive SSD is pretty interesting though. It got almost 3GB per second in sequential read speed, and 2.8 GB per second in write speed.\n\nThe Battery life is good. Really good. While I was testing the laptop, running Geekbench, KDiskMark, running youtube videos, installing applications, all on wifi, and with brightness up to 50%, the laptop endured for 5 hours.", "link": "https://www.youtube.com/watch?v=T6IuzQehsrA", "date_published": "2022-01-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]