[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "24 Overwatch Heroes That Never Made The Cut", "description": "Heroes in Overwatch are some of the most meticulously designed and well crafted characters in the business. I want to explore some of the characters that either evolved into the heroes we know today, or got left on the cutting room floor.\n#gaming #Overwatch #gamespot #Overwatch2 \n\nStu here to dive into the development and evolution of the Overwatch Roster. In the last 6 years Overwatch’s heroes have become some of the most iconic characters in video games, and it's been fascinating to explore all the different design elements and deliberate choices the team made to create such a unique roster of characters. With the addition of more heroes at launch and many more updates coming with Overwatch 2, I cannot wait to see the new types of heroes that Blizzard can cook up.\n\n#overwatch2 #overwatch #gaming\n\nSTAMPS:\n00:00 Intro\n00:13 Brit\n00:32 Bruiser\n00:42 Firestarter\n01:02 Frost\n01:19 Helio\n01:35 Hivemind\n01:55 Huntress\n02:17 JetPack Cat\n03:21 Luc\n03:38 Mama Hong\n03:54 McCloud\n04:18 Overmind\n04:32 Phoenix\n04:53 Phreak\n05:14 Praetor\n05:39 Psyblade\n05:53 Rashi\n06:09 Recluse\n06:35 Rumble\n06:49 Shield Guy\n07:09 Troy\n07:18 Watcher\n07:29 Wildebeest\n07:49 Yetzi\n08:00 Genji\n08:06 Outro", "link": "https://www.youtube.com/watch?v=a7MByOMOWA0", "date_published": "2022-10-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 Sequel Announced, Witcher Projects Explained | GameSpot News", "description": "CD Projekt Red announces Cyberpunk 2077 sequel as well as several Witcher Games, the Dead Space remake gets its first look at gameplay, and Nintendo announces a Direct around the upcoming Super Smash Bros. movie.\n#GameSpot #Cyberpunk #witcher3 \n\nCyberpunk 2077 is getting a sequel, more Witcher games than you can shake a stick at, Dead Space reveals final gameplay, and a Nintendo Direct is coming this week. All on today’s GameSpot News.\n\nAs part of its strategy presentation, CD Projekt has announced that it has multiple new games in development. Although details are slim, the company did announce that a sequel to 2020's Cyberpunk 2077 is in development under the codename \"Project Orion\" and will \"prove the full power and potential of the Cyberpunk universe\" when it is released.\n\nAdditionally, a number of new games set in The Witcher universe are also in various stages of development. These are all being developed under various codenames as well, and include Project Sirius, Project Polaris, and Project Canis Majoris.\n\nFor Project Sirius, this Witcher game is described as an innovative take on the series that is aimed at both veteran fans and people new to the franchise. Currently in pre-production, it is being developed by Flame in the Flood developer The Molasses Flood and has 60+ people involved in its creation.\n\nProject Polaris is described as a story-driven open-world RPG built on the legacy of The Witcher 3: Wild Hunt and has more than 150 people working on it at CD Projekt Red. This game will be the start of a new Witcher trilogy that is aiming to be delivered within a 6-year period following the Polaris release.\n\nA story-driven single-player open-world RPG set within The Witcher universe, Project Canis Majoris  will be developed by a third-party studio that will be led by ex-Witcher veterans.\n\nBeyond its two most well-known franchises, CD Projekt is also working on a new standalone IP, codename Project Hadar. It has been in \"IP incubation\" since 2021 and is currently in the conceptual phase. This game is described as being distinct from Cyberpunk 2077 and The Witcher and is being developed 100% internally.", "link": "https://www.youtube.com/watch?v=y9Nr_eV-pck", "date_published": "2022-10-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dead Space Official 4K Gameplay Trailer", "description": "Something has gone horribly wrong on board the mining ship, USG Ishimura. \n\nGet your first look at Dead Space™ gameplay. See how you’ll explore the eerie, echoing corridors and workspaces within the USG Ishimura and survive the nightmarish horrors that await you. \n\nThe sci-fi survival horror classic Dead Space returns, completely rebuilt from the ground up to offer a deeper and more immersive experience. This remake brings jaw-dropping visual fidelity and suspenseful atmospheric audio, as well as new gameplay content and improvements while staying faithful to the original game’s thrilling vision.\n\nPrepare to uncover the mystery aboard the USG Ishimura when Dead Space launches on January 27, 2023.\n\n#DeadSpace", "link": "https://www.youtube.com/watch?v=4Tls3Wx_M4A", "date_published": "2022-10-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Horizon Zero Dawn Reportedly Getting A PS5 Remake | GameSpot News", "description": "The first Horizon game is potentially getting remade, along with the franchise gaining multiplayer, the PS5 has been jailbroken, and 2 million PSVR2 units are reportedly being made.\n#gaming  #PlayStation5 #PS5 \n\nAn Horizon Zero Dawn remake, the PS5 has been jailbroken, and Sony plans to make a bunch of PSVR2s. All this on today’s GameSpot News.\n\nHorizon Zero Dawn could be getting a significant upgrade, as a new report claims that \"accessibility features, graphics modes, and quality of life improvements to the gameplay itself,\" will bring Guerrilla Games' 2017 title up to the same similar standard as its 2022 sequel Horizon Forbidden West.\n\nSeveral of these upgrades can be found in the PC version of Horizon Zero Dawn that was released in 2020, although that game mostly reused the same assets as the PS4 edition.\n\nAccording to the report, Guerrilla Games is also currently working on a Horizon multiplayer game for PS5 and PC. Co-op features had been planned for Zero Dawn as far back as 2014 according to VGC's sources, but these elements were scrapped so that other areas of the game could be focused on. The idea hasn't been entirely scrapped for the mainline series and could make its way into Horizon 3.\n\nSony is also expanding the series into other forms of media, and with a Horizon TV show headed to Netflix, it wouldn't be too surprising to see some sort of announcement from the gaming side of the series. This could be a similar situation to The Last of Us Part 1 which arrived ahead of the HBO Max live-action series.\n\nIn some more PS5 news, it looks like someone has managed to crack the security on the system. The jailbreak was spotted by modder Lance McDonald--who modified Bloodborne to run at 60fps--and uploaded to Twitter, showcasing how the software can give a user access to the PS5's debug menu.\n\nAdditionally, a PS5 with the software installed can also have game backups installed on it, with McDonald's footage showing the delisted PT demo being loaded onto the system, although it wasn't playable on the system. The exploit does come with numerous limitations though, as its makers claim that it only works around 30% of the time and has multiple potential points of failure.\n\nThe exploit will only work on consoles with firmware version 4.03 from October 2021, and it is possible that PS5s with earlier firmware could run it according to the creator. The software in its current state won't be too useful to the ordinary gamer, as the creator of the exploit noted that hackers and people who are curious to see what's under the hood of the PS5 will find it worth installing.\n\n\nTIMECODES:\n00:12 - Horizon Zero Dawn PS5 remaster\n01:28 - PS5 has been jailbroken\n02:33 - PSVR2 has begun manufacturing", "link": "https://www.youtube.com/watch?v=S1kdi4bHHA0", "date_published": "2022-10-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Zelda Tears of the Kingdom Similarities You Likely Missed", "description": "We’ve compiled a list of references and displayed them side by side to show what Tears of the Kingdom might be based off of. But more importantly, Ghibli may have a bigger influence now more than any other previous Zelda games, and the astounding number of similarities we found in just a few short trailers might surprise you.\n#gaming #tearsofthekingdom #breathofthewild #zelda #ghibli #gamespot \n\nThings compared include unused Breath of the Wild concept art, such as the broken Master Sword and Ganon’s floating castle, all the way to previous games directly such as A Link to the Past and Skyward Sword. However, while fans have always known that the Zelda team takes light inspirations from Ghibli films in themes and tones, the direct references this time in Tears of the Kingdom are much more profound. \n\nIf there were only several references between Ghibli and Tears of the Kingdom, it would be easier to discount this connection. But there are almost 15 total references that are too specific to be a coincidence. Things such as a crumbling castle as it rises upwards, sky islands hidden within a circling thunderstorm around it, ancient boulders with designs on them being used as an elevator and much more show that just within several short trailers, the Zelda team is definitely showing their appreciation for Studio Ghibli.\n\nTimestamps:\n0:00 Intro\n0:25 Ancient Robots\n0:32 Surprised Zelda Animation\n0:40 Ganon's Shadow On The Wall\n0:46 Goddess Harp (Or Omega)\n0:52 Destroyed Master Sword\n1:00 Ancient Wall Designs Lit Up\n1:08 Kargarok (Non-Twilight)\n1:16 Skydiving + Loftwing Summon\n1:25 Skydiving\n1:35 Rats In Dungeon With Zelda And Link\n1:42 Old Shrine/Dungeon Concept\n1:51 Ganon's Castle In The Sky\n1:59 Ritual Using Zelda\n2:07 12 Castle In The Sky References\n5:03 3 Princess Mononoke References\n5:58 Outro", "link": "https://www.youtube.com/watch?v=gjXOrkJTfW8", "date_published": "2022-10-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]