[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "7 areas where Linux is JUST BETTER than Windows", "description": "Make sure your Python applications stay relevant for longer: https://bit.ly/3CyfKnL \nGrab a brand new laptop or desktop running Linux:https://www.tuxedocomputers.com/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to a weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYouTube: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n📹 MORE VIDEOS FROM ME\nLinux news in Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\nGaming on Linux: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nI'm also on ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n🏆 FOLLOW ME ELSEWHERE:\nTwitter : http://twitter.com/thelinuxEXP\nMastodon: https://mastodon.social/web/@thelinuxEXP\nPixelfed: https://pixelfed.social/TLENick\nDiscord: https://discord.gg/xK7ukavWmQ\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\nThis video is distributed under the Creative Commons Share Alike license.\n\n#linux #windows \n\n00:00 Intro\n00:37 Sponsor: Extend the lifecycle of your Python application\n01:28 Software Management\n03:01 Monetary Cost\n04:56 Open Source and Free Software\n06:24 Performance\n07:56 Configuration & Customization\n09:44 Privacy and Security\n11:31 Command Line\n13:26 Sponsor: Get a device that runs Linux perfectly\n14:30 Support the channel\n\n\nThe first area is software management. You can install anything in one click, update the system, and the apps in the same place. Imagine having to update each app from its own GUI instead of having a central update place. Imagine having to avoid malicious installers distributed by websites. Imagine being forced to update your system instead of picking when to do it.\n\nSecond area is monetary cost. Linux, in 99% of cases is free of charge. Windows is never free.\n\nAnother big win for Linux is its open source and free software nature. It means people can fix stuff quickly. If an issue is detected, and it's a big problem, it will be fixed in days, sometimes in hours. \nAnd this also means that if you know how to code, you can also try and fix the issue yourself.\n\nOpen Source, and to a higher degree, free software is a demonstrably better option than full proprietary apps.\n\nhttps://www.youtube.com/watch?v=i9Op7Xa5eKs\n\nNow, let's talk performance. Because Linux can be way more efficient than Windows.\nIn terms of disk size, a clean windows install will use 20 Gigs. Most Linux distros use about 4 or 5 gigs, sometimes up to 10. And some lightweight distros just use upwards of 20 megabytes, like Tinycore.\n\nLinux can also run on super old computers, without making them unusable.\n\nLinux is also vastly more customizable and offers more choice than Windows\nWhy is choice important? Because we all use our computers to do different things, and having a one size fits all desktop will never serve everyone perfectly. You end up with something that kinda works for everyone, but is perfect for no one.\n\nOn Linux, you can choose from an enormous number of distributions, and desktop environments, and tools to make sure that your experience is the one that works the best for you.\n\nLinux is also a more private system. When you install windows, you have to go through about 10 screens of configuration, most of which will ask you if you want to have your data collected, and most of them only letting you limit the data that is collected, not completely turn it off.\n\nWIndows also requires a microsoft account, or at least hides the option to do away with that so that 99% of people will create that account. \nNone of that on Linux.\n\nAs per security, it's not an inherent advantage of Linux, but it IS targeted far less than Windows by malicious actors. \n\nOk, last area where Linux is just better, is the terminal. The Linux command line interface is just insanely powerful, bash scripting is super easy, and can automate tons of stuff for you, and there are tons of tools you can add to the default utilities to make the terminal even easier to use, and more powerful.", "link": "https://www.youtube.com/watch?v=CVbABo0aXG4", "date_published": "2022-09-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]