[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Intermittent fasting with Tim and John", "description": "Why not enrol on the Zoe Intermittent Fasting Study?  Learn about your own metabolism while contributing to citizen science and medical research.\n\nTo pre-register now, https://health-study.joinzoe.com/intermittent-fasting\n\nOr join via the Zoe Health Study app", "link": "https://www.youtube.com/watch?v=pQH48I5wBtE", "date_published": "2022-10-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Zoe data with Professor Spector", "description": "The report and the data files can be downloaded from this link https://console.cloud.google.com/storage/browser/covid-public-data.", "link": "https://www.youtube.com/watch?v=yxi6jzbzLk0", "date_published": "2022-10-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Excess baby deaths investigation", "description": "Review of spikes in Neonatal Mortality ordered by Scotland\n\nhttps://www.healthcareimprovementscotland.org/our_work/governance_and_assurance/programme_resources/neonatal_mortality_in_scotland.aspx\n\nHealthcare Improvement Scotland, asked by Scottish Government\n\nReview of significant increase in neonatal mortality\n\n2021 to 2022\n\nScottish Government orders review as neonatal deaths higher than expected\n\nhttps://www.bbc.co.uk/news/uk-scotland-63097142\n\nNeonatal death rates, two spikes over six-months\n\nSeptember 2021, at least 21 babies under 4 weeks died\n\nMarch 2022, at least 18 babies under 4 weeks died\n\nAverage mortality rate among newborns\n\nTwo per 1,000 births.\n\nIn September 2021, 4.9 per 1,000 births\n\nMarch 2020, 4.6 per 1,000 births\n\nFor all of 2021, 3.9 infant deaths for every thousand live births\n\nFor all of 2020, 3.1\n\n(A preliminary investigation found the September spike was not linked to Covid)\n\nThis form of monitoring introduced, July 2017\n\nDr Sarah Stock, maternal and foetal medicine, University of Edinburgh\n\nhttps://www.scotsman.com/health/scottish-government-orders-review-as-neonatal-deaths-higher-than-expected-3863538\n\nI think the numbers are really troubling and I don't think we know the reasons why yet.\n\nWhat we do know it's not neonatal Covid – the rates of Covid-19 infection in babies are very low and deaths from Covid are thankfully very, very small, \n\nso this isn't Covid affecting babies\n\n\nCovid Scotland: Vaccines ruled out in neonatal deaths spike\n\nhttps://www.heraldscotland.com/news/23028843.covid-scotland-vaccines-ruled-cause-neonatal-deaths-spike/?ref=rss\n\nPUBLIC health experts ruled out any link between spikes in neonatal deaths and the Covid vaccine\n\nwithout checking whether any of the infants' mothers had received the jag during pregnancy.\n\nExperts stressed, no “plausible” link to justify investigating maternal vaccination status. \n\nPublic Health Scotland (PHS) said its consultants had given “careful consideration” to the “potential benefits and harms” of carrying out such as analysis as part of its probe into the tragic deaths of 39 infants, \n\nbut concluded against doing so\n\nPHS added\n\nA risk that “identifying the vaccination status of the mothers, even at aggregate level, \n\nwould result in harm to those individuals and others close to them, \n\nthrough actual or perceived judgement of the effects of their personal vaccination decision”\n\nFurthermore\n\n“the outcomes of such analysis, whilst being uninformative for public health decision making, \n\nhad the potential to be used to harm vaccine confidence at this critical time”\n\nPHS response, “We do not have any plans to examine maternal vaccination status, as there is no public health reason to do so”.\n\nNHS logging baby deaths as stillbirths ‘to avoid scrutiny’\n\nhttps://www.telegraph.co.uk/news/2022/10/16/nhs-logging-baby-deaths-stillbirths-avoid-scrutiny/\n\nFamilies call into question trusts’ transparency after hospital accounts clash with their experience\n\nNHS hospitals have claimed that babies born alive were stillborn\n\nprompting accusations they were trying to avoid scrutiny.\n\nSix children who died before they left hospital were wrongly described as stillborn. \n\nSeveral of the children lived for minutes and one lived for five days.\n\nhttps://www.gov.uk/government/news/new-powers-to-investigate-stillbirths\n\nAt present, coroners can only hold inquests for babies who have shown signs of life after being born.\n\nThe babies identified by The Telegraph should have been recorded as neonatal deaths, but staff claimed they were stillbirths\n\n‘Our baby was alive for five days but was recorded as a stillbirth’", "link": "https://www.youtube.com/watch?v=wj4rE0LrpR0", "date_published": "2022-10-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]