[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends: Eclipse | Official Cinematic Launch Trailer", "description": "Tressa has fought for Cleo since she was a teenager. Seer may have brought the Legends to her home, but Catalyst is ready to keep up. \n\n#ApexLegendsEclipse #ApexEclipse #ApexLegends", "link": "https://www.youtube.com/watch?v=pJtiUygQeQg", "date_published": "2022-10-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Modern Warfare 2 - Everything to Know", "description": "Call of Duty: Modern Warfare in 2019 delivered a very different take on Call of Duty's multiplayer. With the sequel's release fast approaching, here's everything you need to know for Call of Duty: Modern Warfare 2.\n #gaming #gamename #gamespot \n\nCall of Duty: Modern Warfare in 2019 delivered a very different take on Call of Duty, one that appealed to mil-sim fans, lapsed Battlefield players, and folks ready to try large open maps, all while coming in hot with a campaign as fiery and as controversial as the original Modern Warfare 2. It delivered a year of memorable moments like the Nuke Event and Haunting of Verdansk, kicked off the free-to-play Warzone, and gathered a whole new Call of Duty fanbase. So here we are, finally, the sequel, Modern Warfare 2. Here’s everything you need to know before diving in. Let's talk campaign, Gunsmith 2.0, gear, Battle Maps, Core Multiplayer, Spec-Ops, Warzone 2.0, and Raids. \n\nModern Warfare 2 and Warzone are multiplatform releases, on PS4, PS5, Xbox One, Xbox Series X|S, and PC. PC includes Steam. This time around, there is a multi-week launch with early access campaign on October 20, a full launch on October 28, a Warzone 2.0 and DMZ launch on November 16, and an unspecified by end of year release for Raids.", "link": "https://www.youtube.com/watch?v=S-H4KUINM3c", "date_published": "2022-10-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "FINAL FANTASY XVI “AMBITION” Official HD Trailer", "description": "Check out this new trailer for Final Fantasy XVI!\n\nWho shall claim their fading light?\nFrom a single spark, will the land ignite\nA new shadow rises to fall upon the Dominants,\npainting their destinies black as night.\n\nIt has been fifteen hundred years since the fall of our forebears, and Valisthea has been slowly dying ever since. Darkness spreads as day gives way to twilight, the Mothers' flame now all but a flicker. And as the fringes fade, the people flock to the Mothercrystals.\n\nCOMING SUMMER 2023\n\n#FF16 #FinalFantasy", "link": "https://www.youtube.com/watch?v=tC-3kHd7Cjs", "date_published": "2022-10-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Gotham Knights Review", "description": "Gotham Knights acts as more of a cautionary tale than the logical next step for this storied universe.\n#gothamknights #GameSpot #Batman \n\nBatman is dead. With so few words, Gotham Knights is instantly intriguing. What does Gotham look like without its Dark Knight perched over the rotten city? For Batgirl, Nightwing, Robin, and Red Hood, their leader's sudden demise leaves a massive hole in the heart of Gotham, and asks them to step out from his shadow. Although the new guard fares well from a narrative standpoint, the gameplay systems built to serve their 30-hour campaign to reclaim Gotham let the team down.", "link": "https://www.youtube.com/watch?v=EdPDbTQ1HJg", "date_published": "2022-10-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Insomniac’s Wolverine Launch Window, According To Microsoft | GameSpot News", "description": "Microsoft may have revealed the Wolverine release window and we round up this week’s free games and Halloween events. \n#GamingNews #Wolverine #PS5  \n\nAs spotted by Tech4Gamers, some recent filings from Microsoft in relation to the UK's Activision Blizzard acquisition investigation claim that Wolverine will release in 2023.\n\nIn the document, Microsoft noted how PlayStation has a \"large portfolio of high-quality exclusive content,\" arguing that the latter wouldn't be massively affected by the acquisition. Microsoft goes on to note the range of exclusive titles coming to the console, saying, \"PlayStation also has a spate of first- and third-party exclusive titles lined up for launch in 2023, including Spider-Man 2, Wolverine, Horizon, Final Fantasy XVI and Forspoken.\"\n\nInsomniac is also developing Marvel's Spider-Man 2, and it assured fans just this week that the game would still be out in 2023, but Wolverine doesn't currently have a release window. That makes the inclusion of this title from Microsoft an odd one. It's unclear if Microsoft knows something that we don't, but it's also just possible that there was a misinterpretation about Wolverine's release date on Microsoft's part somewhere along the line.\n\nNext up I want to talk about some free games because who doesn’t love free things.  \n\nFor starters, Sims 4 is free to play now for every platform the game is currently available on–sorry Switch players.  \n\nOver on the Epic Games Store you can grab the game of the year edition of the classic RPG Fallout 3. And if you’re ok with splitting your purchases between multiple storefronts–and why wouldn’t you when the game is free–then you can also grab a Microsoft Store version of Fallout 76 from Amazon Prime Gaming. Keep in mind that you have to be an active Prime member to take advantage of that deal. \n\nWhile you’re grabbing the 76 code, you might as well grab the free copy of Middle-earth: Shadow of War that is redeemable in the GOG Store. \n\nWhen it comes to the newest games you can play on PlayStation Plus, make sure to check out our latest video in which Lucy James walks you through what's on offer this month for subscribers.", "link": "https://www.youtube.com/watch?v=Tpai6gPhjU4", "date_published": "2022-10-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Modern Warfare 2 Campaign Livestream", "description": "Call of Duty: Modern Warfare 2 kicks off it's early access campaign for players who preordered the full game. Join David & Jean-Luc as they check out the first couple of missions in Infinity Ward's latest release. \r\n\r\n#modernwarfare2 #gamespot", "link": "https://www.youtube.com/watch?v=R1OCSwTPmTY", "date_published": "2022-10-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Tales From The Borderlands - First 40 Minutes of Gameplay", "description": "Tales From the Borderlands is back! In this clip we are checking out the opening chapter of Gearbox's story-driven take on the Borderlands universe.\n\n#NewTalesFromTheBorderlands #GameSpot #gaming", "link": "https://www.youtube.com/watch?v=vTAxk-60on8", "date_published": "2022-10-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil 4 Remake Full Breakout | Resident Evil Showcase", "description": "Capcom revealed new gameplay from the Resident Evil 4 remake, which includes all new gameplay elements. The merchant was revealed to be coming back too. While the game is rebuilt with new ideas, it will still honor the original game. Resident Evil 4 will include a Deluxe Edition and a Collector's Edition.  Resident Evil 4 Remake will release to PS5, PS4, Xbox Series X|S, and Steam. Pre-orders being today, and Resident Evil 4 Remake releases March 24, 2023.\n\n#ResidentEvil #ResidentEvil4 #Capcom", "link": "https://www.youtube.com/watch?v=AEkSuzWay1A", "date_published": "2022-10-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil 4 Remake Gameplay Trailer | Resident Evil Showcase", "description": "Capcom revealed plenty of gameplay from the first section of its classic Resident Evil 4, which shows off the total graphic overhaul Resident Evil 4 Remake will be receiving. From the first Ganado Leon Kennedy comes across, to the infamous town Leon stumbles across, and, of course, Dr. Salvador. New gameplay mechanics to Resident Evil 4 were also shwon in the form of sneaking, cover mechancis, quick inventory guns, and more. Resident Evil 4 Remake releases March 24, 2023.\n\n#ResidentEvil4 #ResidentEvil #Capcom", "link": "https://www.youtube.com/watch?v=wlP02yvRLxA", "date_published": "2022-10-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil 4 Remake Hands-On Preview", "description": "Kurt Indovina got hands-on time with Resident Evil 4 Remake, and it's shaping up to be the remake fans may want, but not the one they're expecting.\n\nWhen Capcom officially announced it was remaking Resident Evil 4, Kurt was apprehensive. The original Resident Evil 4 is not without its blemishes--it is, after all, a 17-year-old game. But tank controls and Ashley Graham aside, his apprehension was largely tied to whether Capcom could capture the spirit of the original. \n\nAfter 30 minutes of playing Resident Evil 4 Remake, Kurt can say that most of his concerns have been washed away. While brief, his time with the demo showed him that this could be the Resident Evil 4 Remake fans want, but not the one they're expecting. And this approach can be illustrated by a single choice Capcom has made involving a dog--you know the one.\n\n#gaming #residentevil4 #gamespot", "link": "https://www.youtube.com/watch?v=6DXTWwxZeA4", "date_published": "2022-10-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil 4 Remake Trailer | Resident Evil 4 Showcase", "description": "The brand new Resident Evil 4 Remake trailer showcases Ashley Graham, Luis Sera, Ada Wong, and of course, Leon Kennedy. It also showcased many of Resident Evil 4's major villains, such as El Gigante, Chief Menendez, and Ramon Salazar. Resident Evil 4 Remake releases March 24, 2023.\n\n#ResidentEvil #ResidentEvil4", "link": "https://www.youtube.com/watch?v=5lnSPbcmB7Y", "date_published": "2022-10-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil 4 Remake vs PS4 Comparison", "description": "Just like the Resident Evil 2 and 3 Remakes before, the Resident Evil 4 Remake looks to be a complete reworking of the original game. Where-as RE2 and RE3 worked in elements of Resident Evil 4 to their gameplay, Resident Evil 4’s Remake has larger environments and enhanced gameplay mechanics, all with a graphics overhaul. Please keep in mind the game is still in development, so everything we show here is subject to change.\n#residentevil4 #re4 #re4remake", "link": "https://www.youtube.com/watch?v=tzRtVGmkqVc", "date_published": "2022-10-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Showcase 2022 Full Conference", "description": "Capcom revealed plenty in their latest Resident Evil Showcase about the upcoming Resident Evil Village DLC, Resident Evil Village: Winters Expansion, as well as about the upcoming RE:Verse Resident Evil, and Resident Evil 4 Remake. A brand new trailer was shown for the RE: Village expansion, showcasing more of 3rd person mode, the Rose Winters expansion, and the ability to play as some of the major Lords, like Lady Dimitrescu. \n\nResident Evil 4 Remake had plenty of brand new reveals, including how the gameplay itself would work, many of the new gameplay mechanics added in, and a Resident Evil 4 Remake trailer showcasing plenty of the game's beloved allies and villains. Resident Evil Village Gold Edition and Winters' Expansion comes out October 28, 2022. Resident Evil 4 Remake releases March 24, 2023.\n\n#ResidentEvil #ResidentEvil4 #ResidentEvilVillage #Capcom", "link": "https://www.youtube.com/watch?v=QftHGjaiEDs", "date_published": "2022-10-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Showcase Livestream | 10.20.2022", "description": "Tune in for never before seen gameplay and a new trailer from Resident Evil 4, a look at the Winters’ Expansion, and much more.\r\n\r\n#gaming #residentevil4 #residentevil", "link": "https://www.youtube.com/watch?v=tS6ckJ2SAE4", "date_published": "2022-10-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village Winters Expansion Full Breakout | Resident Evil Showcase", "description": "Director Kento Kinoshita revealed even more about the Resident Evil Village: Winters Expansion during the Resident Evil Showcase. Rose Winters story takes place in the realm of consciousness. You can even play as various Lords from the original game, like Heisenberg, or of course, Lady Dimitrescu. Resident Evil Village Gold Edition and Winters' Expansion comes out October 28, 2022.\n\n#ResidentEvil #ResidentEvilVillage #WintersExpansion", "link": "https://www.youtube.com/watch?v=yftAGS45JTM", "date_published": "2022-10-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "15 MORE Things You STILL Didn't Know In Zelda Breath Of The Wild", "description": "This time in Breath of the Wild, we look back at some secrets about Zelda WiiU, what clothing shop banners actually are, and funny ways to disarm certain enemies.\n\nIn the video above, we cover 15 facts, tips and tricks that aren’t quite as well known, ranging from secrets to glitches, so me that are pretty simple and others that are fairly complex. The Legend of Zelda: Breath of the Wild has been out for four years at this point, and players have found some amazing things, intended or not, that keep the game and its sense of discovery feeling fresh.\n\n#botw #breathofthewild #gaming \n\n0:00 Intro\n0:20 Zonai Towers Were Changed\n0:54 Repair Sheikah Text\n1:23 Two Guidance Stones Messages\n2:08 Guardian Resist Buff Translated\n2:16 Final Trial Lock Text\n2:41 Hyrule Castle Library Categorization\n3:21 Zelda WiiU Loves Ghibli\n3:58 Zelda WiiU Sound Effects\n4:49 Hestu's Island\n5:00 Armor Shop Banners\n5:22 Holding Jump Attacks\n5:38 Tips From The Wild\n5:58 Holding Fire While Crouching\n6:23 Buy Shields Out Of Enemies Hands\n7:07 Disarming Lynels\n7:43 Outro", "link": "https://www.youtube.com/watch?v=WeRjOmQbOHA", "date_published": "2022-10-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "SILENT HILL Townfall Official Teaser Trailer", "description": "From Annapurna Interactive, the creators of Stories Untold and Observation, and No Code, comes Silent Hill: Townfall - a spinoff of the Silent Hill franchise. Not much is known about Silent Hill: Townfall as of yet, but it's meant to be an expanded concept on Silent Hill, and No Code's prior games were inspired by the psychological horror of Silent Hill. No release date has been revealed as of yet.\n\n#silenthill #townfall #gaming", "link": "https://www.youtube.com/watch?v=FIRDHM2zqE0", "date_published": "2022-10-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "SILENT HILL f Official 4K Teaser Trailer", "description": "After many long years, the classic psychological horror franchise Silent Hill is finally back with Silent Hill f. Silent Hill f is the first original Silent Hill sequel in years. In the trailer we see odd blood vines, and a Japanese Torii gate. The blood blossoms around a girl to reveal what looks like a creepy inner disease. Silent Hill f is written by Ryukishi07, creature & character design from kera, and produced by Motoi Okamoto. Silent Hill f has yet to receive a release date.\n\n#silenthillf #konami #gaming", "link": "https://www.youtube.com/watch?v=ZqzK_nqDU9M", "date_published": "2022-10-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Silent Hill F Teaser Trailer", "description": "Check out the teaser trailer for an upcoming game Silent Hill F that was announced during the Konami Transmission.\n\n#silenthillf #konami #gaming", "link": "https://www.youtube.com/watch?v=jbYB8HD-RX8", "date_published": "2022-10-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "When Will Call of Duty Be On Game Pass? | GameSpot News", "description": "We’ve got another update in the Microsoft & Activision Blizzard investigation as well as Silent Hill and Disney news.\n#GamingNews #CallofDuty #ModernWarfare2\n\nThe Competition and Markets Authority has so far expressed a number of concerns related to Microsoft and Activision Blizzard’s deal. One concern is how it has the potential to have a major impact on Sony if Activision Blizzard content is made exclusive to Xbox. \n\nIn response to the CMA’s decision to enter a second phase of investigation into the proposed $69 billion deal, Microsoft highlighted footnote references to a tweet from Microsoft Gaming CEO Phil Spencer that said, \"The agreement between Activision Blizzard and Sony includes restrictions on the ability of Activision Blizzard to place Call of Duty titles on Game Pass for a number of years.” \n\nAfter months of speculation and reports, Konami officially confirmed its Silent Hill 2 remake during the Silent Hill Transmission video presentation. The game, which opened the presentation with an impressive trailer, looks to be rebuilt from the ground up while still keeping the essence of the 2001 original intact.\n\nThe trailer gives us a look at the new James Sunderland, who has ventured to Silent Hill to rescue his wife Mary--long believed dead. We see some signature series elements in the trailer, as well, including the fog-filled streets and a few familiar enemies. Those, naturally, include Pyramid Head.\n\nThe Sunlit Plateau has fallen under darkness, and Scar--who wants to make that area his home--recruits the player to set things right. A new set of Star Path rewards are also available, which will let players earn Halloween-themed clothes and decorations to give their version of Dreamlight Valley a spooky spin.\n\nThe update also includes multiple bug fixes, from minor elements like Mickey's weird eyes and lightning flashes to game-breaking bugs. For example, memory pieces that would spawn inside the counter at Scrooge's store no longer do so, which allows players to finish questlines for multiple characters.", "link": "https://www.youtube.com/watch?v=fqgyXMvhLHg", "date_published": "2022-10-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]