[{"source": "https://www.theguardian.com/world/rss", "title": "Protester condemns ‘barbaric’ attack in Manchester outside China consulate", "description": "<p>Bob Chan backs calls for UK government to expel any Chinese officials involved in peaceful protest</p><p>A pro-democracy protester who appeared to be beaten up by men from China’s consulate in Manchester has condemned the attack as “barbaric” and backed calls for the UK government to expel any Chinese officials involved.</p><p>Speaking for the first time since the incident, which was captured on video, Bob Chan said: “I’m shocked and hurt by this unprovoked attack,” adding he had been taking part in a “peaceful protest”.</p> <a href=\"https://www.theguardian.com/uk-news/2022/oct/19/protester-slams-barbaric-attack-manchester-outside-china-consulate\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/oct/19/protester-slams-barbaric-attack-manchester-outside-china-consulate", "date_published": "2022-10-19 22:11:56+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "India’s Congress party appoints first non-Gandhi president in 24 years", "description": "<p>Mallikarjun Kharge, a Gandhi loyalist, aims to lead fightback against Narendra Modi’s BJP</p><p>India’s Congress party has appointed its first president in 24 years not from the Gandhi dynasty, in an effort to reverse its apparent decline and take on the seemingly invincible Narendra Modi.</p><p>Mallikarjun Kharge, 80, a loyalist in the court of the Nehru-Gandhi dynasty which rules the party, defeated the rival candidate Shashi Tharoor by almost 7,000 votes in a poll of 9,000 party delegates. </p> <a href=\"https://www.theguardian.com/world/2022/oct/19/india-congress-party-appoints-first-non-gandhi-president-in-24-years\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/19/india-congress-party-appoints-first-non-gandhi-president-in-24-years", "date_published": "2022-10-19 15:07:15+00:00", "persistent": false, "user": null, "language": "en-US"}]