[{"source": "https://feeds.feedburner.com/TheHackersNews", "title": "Researchers Detail Azure SFX Flaw That Could've Allowed Attackers to Gain Admin Access", "description": "Cybersecurity researchers have shared more details about a now-patched security flaw in Azure Service Fabric Explorer (SFX) that could potentially enable an attacker to gain administrator privileges on the cluster.\nThe vulnerability, tracked as CVE-2022-35829, carries a CVSS severity rating of 6.2 and was addressed by Microsoft as part of its Patch Tuesday updates last week.\n<!--adsense-->\nOrca", "link": "https://thehackernews.com/2022/10/researchers-detail-azure-sfx-flaw-that.html", "date_published": "2022-10-19 13:18:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://feeds.feedburner.com/TheHackersNews", "title": "Chinese Hackers Targeting Online Casinos with GamePlayerFramework Malware", "description": "An advanced persistent threat (APT) group of Chinese origin codenamed DiceyF has been linked to a string of attacks aimed at online casinos in Southeast Asia for years.\nRussian cybersecurity company Kaspersky said the activity aligns with another set of intrusions attributed to Earth Berberoka (aka GamblingPuppet) and DRBControl, citing tactical and targeting similarities as well as the abuse of", "link": "https://thehackernews.com/2022/10/chinese-hackers-targeting-online.html", "date_published": "2022-10-19 12:33:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://feeds.feedburner.com/TheHackersNews", "title": "A Quick Guide for Small Cybersecurity Teams Looking to Invest in Cyber Insurance", "description": "In the world of insurance providers and policies, cyber insurance is a fairly new field. And many security teams are trying to wrap their heads around it. \nWhat is it and do they need it? And with what time will they spend researching how to integrate cyber insurance into their strategy? \nFor small security teams, this is particularly challenging as they contend with limited resources.\nLuckily,", "link": "https://thehackernews.com/2022/10/a-quick-guide-for-small-cybersecurity.html", "date_published": "2022-10-19 12:30:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://feeds.feedburner.com/TheHackersNews", "title": "Experts Warn of Stealthy PowerShell Backdoor Disguising as Windows Update", "description": "Details have emerged about a previously undocumented and fully undetectable (FUD) PowerShell backdoor that gains its stealth by disguising itself as part of a Windows update process.\n\"The covert self-developed tool and the associated C2 commands seem to be the work of a sophisticated, unknown threat actor who has targeted approximately 100 victims,\" Tomer Bar, director of security research at", "link": "https://thehackernews.com/2022/10/experts-warn-of-stealthy-powershell.html", "date_published": "2022-10-19 10:09:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://feeds.feedburner.com/TheHackersNews", "title": "CISA Warns of Critical Flaws Affecting Industrial Appliances from Advantech and Hitachi", "description": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Tuesday released two Industrial Control Systems (ICS) advisories pertaining to severe flaws in Advantech R-SeeNet and Hitachi Energy APM Edge appliances.\nThis consists of three weaknesses in the R-SeeNet monitoring solution, successful exploitation of which \"could result in an unauthorized attacker remotely deleting files on the", "link": "https://thehackernews.com/2022/10/cisa-warns-of-critical-flaws-affecting.html", "date_published": "2022-10-19 08:51:00+00:00", "persistent": false, "user": null, "language": "en-US"}]