[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCHnyfMqiRRG1u-2MsSQLbXA", "title": "How did they actually take this picture? (Very Long Baseline Interferometry)", "description": "This is an image of the supermassive black hole, Sagittarius A*, at the center of our Milky Way galaxy.\nVisit https://www.kiwico.com/veritasium30 to get 30% off your first month of any crate!\n\n▀▀▀\nImage of Sgr A* from EHT collaboration\nEvent Horizon Telescope collaboration: https://ve42.co/EHT\n\nAnimations from The Relativistic Astrophysics group, Institute for Theoretical Physics,  Goethe-Universität Frankfurt. Massive thanks to Prof. Luciano Rezzolla, Dr Christian Fromm and Dr Alejandro Cruz-Osorio.\n\nA huge thanks to Prof. Peter Tuthill and Dr Manisha Caleb for feedback on earlier versions of this video and helping explain VLBI.\n\nGreat video by Thatcher Chamberlin about VLBI here – https://youtu.be/Y8rAHTvpJbk\n\nAnimations and simulations with English text:\nL. R. Weih & L. Rezzolla (Goethe University Frankfurt)\nhttps://youtu.be/jvftAadCFRI\n\nVideo of stars going around Sgr A* from European Southern Observatory\nhttps://www.eso.org/public/videos/eso1825e/\n\nVideo zooming into the center of our galaxy from European Southern Observatory\nhttps://www.youtube.com/watch?v=dXAU0gzsPOw\n\nVideo of observation of M87 courtesy of:\nC. M. Fromm, Y. Mizuno & L. Rezzolla (Goethe University Frankfurt)\nhttps://youtu.be/meOKmzhTcIY\n\nVideo of observation of SgrA* courtesy of\nC. M. Fromm, Y. Mizuno & L. Rezzolla (Goethe University Frankfurt)\nZ. Younsi (University College London)\nhttps://youtu.be/VnsZj9RvhFU\n\nVideo of telescopes in the array 2017:\nC. M. Fromm & L. Rezzolla (Goethe University Frankfurt)\nhttps://youtu.be/Ame7fzBuFnk\n\nAnimations and simulations (no text):\nL. R. Weih & L. Rezzolla (Goethe University Frankfurt)\nhttps://youtu.be/XmvpKFSvB7A\n\n\n▀▀▀\nSpecial thanks to Patreon supporters: Inconcision, Kelly Snook, TTST, Ross McCawley, Balkrishna Heroor, Chris LaClair, Avi Yashchin, John H. Austin, Jr., OnlineBookClub.org, Dmitry Kuzmichev, Matthew Gonzalez, Eric Sexton, john kiehl, Anton Ragin, Diffbot, Micah Mangione, MJP, Gnare, Dave Kircher, Burt Humburg, Blake Byers, Dumky, Evgeny Skvortsov, Meekay, Bill Linder, Paul Peijzel, Josh Hibschman, Mac Malkawi, Michael Schneider, jim buckmaster, Juan Benet, Ruslan Khroma, Robert Blum, Richard Sundvall, Lee Redden, Vincent, Stephen Wilcox, Marinus Kuivenhoven, Clayton Greenwell, Michael Krugman, Cy 'kkm' K'Nelson, Sam Lutfi, Ron Neal\n\n▀▀▀\nWritten by Derek Muller\nAnimation by Ivy Tello, Mike Radjabov, Maria Raykova\nFilmed by Petr Lebedev", "link": "https://www.youtube.com/watch?v=Q1bSDnuIPbo", "date_published": "2022-05-12 14:52:13+00:00", "persistent": false, "user": null, "language": null}]