[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "The Bee Weekly: Ultra-MAGA Siaka and the Libertarian Zoomer", "description": "Kyle Mann is joined by The Babylon Bee’s own MJ and special guest Siaka Massaquoi. The trio discuss laaaaaame Democrats, the FBI confiscating MAGA hats, Gen Z being a weird generation, and more!\n\nNew editions of Bee Radio and Weakly News are here… and MJ answers questions from her Twitter followers. They all seem to like her but the rest of us have to deal with hate mail. Why do we keep getting these? You’re hurting our feelings, you guys. FROWNY FACE.\n\nSiaka Massaquoi is also running for California office as representative of District 43! If you’re in that area try legally voting for him. He seems cool. And he’s black. Also, check out his What The Fact channel on...\nRumble: https://rumble.com/c/c-620593\nand on Instagram: https://www.instagram.com/whatthefact.tv/\nhttps://www.siakaforassembly.com/\n\nThis episode is brought to you by Alliance Defending Freedom! Support the ones defending your freedom and receive a free American flag as a thank you!\nADF: http://adflegal.org/bee\n\nThis episode is also brought to you by Faithful Counseling! Get the help that you need today from counselors who share your faith and your values and get 10% off!\nFaithful Counseling: http://faithfulcounseling.com/babylonbee\n\nThis episode is also brought to you by our friends at PublicSq who are connecting freedom-loving Americans with their local communities, reliable information, and the businesses that share their values. Now available on the App Store, Google Play, Windows, and Mac.\nPublicSq: http://publicsq.com", "link": "https://www.youtube.com/watch?v=W1wH-TfzaRc", "date_published": "2022-05-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "We Don't Talk About China (Song Parody)", "description": "The left, celebrities, and athletes will take money from China, but they sure don't like talking about China. Tap your foot to the hit song parody of \"We Don't Talk About Bruno\"!\n\nLyrics: \nPsaki/Biden\nWe don't talk about China, no, no, no!\nWe don't talk about China\nIt was inauguration day\nWe were getting ready and there wasn't a crowd at the mall\nFences all over the mall\nChina calls in per our mutual win\nCorn Pop!\nYou telling this story, or am I?\nI'm sorry, Jen Psaki, go on!\nChina says, \"We don’t detain…\"\nWhat’d those Chinamen tell us?\n“Uighurs, or start COVID strains.”\nObama was a clean fella\nWe’ll circle back another day\nHunter took their pay, so they’re okay!\nWe don't talk about China, no, no, no!\nWe don't talk about China!\n\nDisney\nHey! Grew to find a love of China silencing and censoring\nI will always pander to their editing and murdering\nI associate them with the sound of printing cash\nGot a gay kiss? It’s a miss with the Chinese\nEdit till we get it all approved by the commies\nGrappling with policies we couldn't understand\nDo you understand?\n\nDr. Anthony Fauci\n5 foot 7 frame\nBat soup as a snack\nAll my function gains\nWill all fade to black\nCan’t hear beagles’ screams\nCause I surgically removed their vocal cords!We don't talk about China, no, no, no!\nWe don't talk about China\n\nEric Swalwell\nFang Fang told me she really loved me,\nbut the next day: GONE!\n\nJohn Cena\n我会说一点普通话\nWǒ huì shuō yīdiǎr pǔtōnghuà\n医生一清冲\nYīshēng qīngchóng\n\nYvonne Tong\nWhen I asked the WHO about Taiwan\nmy phone call went dead\n\nChorus\nYour fate is sealed when your fortune cookie’s read!\n\nXi Jinping\nI tell you that Taiwan and Hong Kong are in\nChina and someday be mine\nI tell you that my power will grow like the\ndragon that fly through the sky(Yes, Xi Jinping is on his way)\n\nLeBron\nThey told me that their slaves would make me some nice Nike jerseys\nIf I shut up and dribble(It's like I hear him now)\n\nXi Jinping\nU.S., I want not a sound out of you(It's like I hear him now,\nI can hear him now)Donald J. Trump\nUm, China...\nYeah, about that China...\nI really told you all about China...\nI had the the truth and the whole truth, China\n\n(Donald Trump, you get out of here!)\n(Get off Twitter)\n\nChorus\nDon't talk about China!\n\nDonald J. Trump\nI warned you all about China!\n\nChorus\nNot a word about China!\n\nDonald J. Trump\nI really warned you all about China!\n\nBecome a premium subscriber:  https://babylonbee.com/plans\n\nThe Official The Babylon Bee Store:  https://shop.babylonbee.com/\n\nFollow The Babylon Bee:\nWebsite: https://babylonbee.com/\nTwitter: https://twitter.com/thebabylonbee\nFacebook: https://www.facebook.com/TheBabylonBee\nInstagram: http://instagram.com/thebabylonbee", "link": "https://www.youtube.com/watch?v=GfJOh25Enco", "date_published": "2022-05-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]