[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Putin's Road to War: Julia Ioffe (interview) | FRONTLINE", "description": "In an interview for the FRONTLINE documentary “Putin’s Road to War,” journalist Julia Ioffe discusses Vladimir Putin’s invasion of Ukraine — and why she believes the Russian leader is now “more dangerous than he’s ever been at any point in the last 22 years.”\n\n“What he has opened up with this invasion is unthinkable,” Ioffe tells FRONTLINE. “And because he is losing and because the sanctions and the Ukrainians are humiliating him, because he is backed into a corner, he is the most dangerous he has ever been, because it is now existential for him.”\n\nJulia Ioffe is an American journalist who was born in Russia. She is a writer for and founding partner of the media company Puck. She previously reported on politics and world affairs for The Atlantic.\n\nThis interview was conducted by FRONTLINE’s Mike Wiser on March 3, 2022. It has been edited for clarity and length.\n\n“Putin’s Road to War” premieres March 15, 2022. Watch the trailer now: https://youtu.be/EaUefbpmV08\n\nThis interview is being published as part of FRONTLINE’s Transparency Project, an effort to open up the source material behind our documentaries. Explore the transcript of this interview, and others, on the FRONTLINE website: https://www.pbs.org/wgbh/frontline/about-frontlines-transparency-project/\n\n#PutinsRoadToWar #JuliaIoffe #FrontlineInterview\n\nLove FRONTLINE? Find us on the PBS Video App, where there are more than 300 FRONTLINE documentaries available to watch any time: https://to.pbs.org/FLVideoApp\n\nSubscribe on YouTube: http://bit.ly/1BycsJW\nInstagram: https://www.instagram.com/frontlinepbs\nTwitter: https://twitter.com/frontlinepbs\nFacebook: https://www.facebook.com/frontline\n\nFRONTLINE is produced at GBH in Boston and is broadcast nationwide on PBS.\n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Additional funding for FRONTLINE is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=kSNo2FPQDQw", "date_published": "2022-03-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Putin's Road to War (trailer) | FRONTLINE", "description": "FRONTLINE tells the story of what led to Vladimir Putin’s war on Ukraine. Veteran filmmaker Michael Kirk and his team examine the events that shaped the Russian leader, the grievances that drive him and how a growing conflict with the West exploded into war in Europe.\n\nLove FRONTLINE? Find us on the PBS Video App, where there are more than 300 FRONTLINE documentaries available to watch any time: https://to.pbs.org/FLVideoApp\n\nSubscribe on YouTube: http://bit.ly/1BycsJW\nInstagram: https://www.instagram.com/frontlinepbs\nTwitter: https://twitter.com/frontlinepbs\nFacebook: https://www.facebook.com/frontline\n\nFRONTLINE is produced at GBH in Boston and is broadcast nationwide on PBS. Funding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=EaUefbpmV08", "date_published": "2022-03-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]