[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCsXVk37bltHxD1rDPwtNM8Q", "title": "We WILL Fix Climate Change!", "description": "Getting something from the kurzgesagt shop is the best way to support us and to keep our videos free for everyone. ►► https://kgs.link/shop-159     \n(Worldwide Shipping Available)\n\nSources & further reading:\nhttps://sites.google.com/view/sources-can-we-fix-climate/\n\nVisit https://brilliant.org/nutshell/ to get started learning STEM for free, and the first 200 people will get 20% off their annual premium subscription.\n\nOur home is burning. Rapid climate change is destabilizing our world. It seems our emissions will not fall quickly enough to avoid runaway warming and we may soon hit tipping points that will lead to the collapse of ecosystems and our civilization.\n\nWhile scientists, activists and much of the younger generation urge action, it appears most politicians are not committed to do anything meaningful while the fossil fuel industry still works actively against change. It seems humanity can’t overcome its greed and obsession with short term profit and personal gain to save itself. \n\nAnd so for many the future looks grim and hopeless. Young people feel particularly anxious and depressed. Instead of looking ahead to a lifetime of opportunity they wonder if they will even have a future or if they should bring kids into this world. It’s an age of doom and hopelessness and giving up seems the only sensible thing to do. \n\nBut that’s not true. You are not doomed. Humanity is not doomed.\n\n\nOUR CHANNELS\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nGerman Channel: https://kgs.link/youtubeDE \nSpanish Channel: https://kgs.link/youtubeES \n\n\nHOW CAN YOU SUPPORT US?\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThis is how we make our living and it would be a pleasure if you support us!\n\nGet Merch designed with ❤ https://kgs.link/shop  \nJoin the Patreon Bird Army 🐧  https://kgs.link/patreon  \n\n\nDISCUSSIONS & SOCIAL MEDIA\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nReddit:            https://kgs.link/reddit\nInstagram:     https://kgs.link/instagram\nTwitter:           https://kgs.link/twitter\nFacebook:      https://kgs.link/facebook\nDiscord:          https://kgs.link/discord\nNewsletter:    https://kgs.link/newsletter\n\n\nOUR VOICE\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThe Kurzgesagt voice is from \nSteve Taylor:  https://kgs.link/youtube-voice\n\n\nOUR MUSIC ♬♪\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\n700+ minutes of Kurzgesagt Soundtracks by Epic Mountain:\n\nSpotify:            https://kgs.link/music-spotify\nSoundcloud:   https://kgs.link/music-soundcloud\nBandcamp:     https://kgs.link/music-bandcamp\nYoutube:          https://kgs.link/music-youtube\nFacebook:       https://kgs.link/music-facebook\n\nThe Soundtrack of this video:\nSoundcloud: https://bit.ly/3v0ZGWu\nBandcamp: https://bit.ly/3r4qF29\n\nIf you want to help us caption this video, please send subtitles to subtitle@kurzgesagt.org\nYou can find info on what subtitle files work on YouTube here:\nhttps://support.google.com/youtube/answer/2734698?hl=en-GB&ref_topic=7296214\nThank you!\n\n🐦🐧🐤 PATREON BIRD ARMY 🐤🐧🐦\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nMany Thanks to our wonderful Patreons (from http://kgs.link/patreon) who support us every month and made this video possible:\nMarkus Schaidinger, nanowashere x, Nicholas Bales, Alexis St-Laurent, Roberto, Patrick Rathke, ThatTubaGuy, Michael Henry, Colin Stephens, Cy 'kkm' K'Nelson, Renen Adar, Kurt Steinkraus, erikfahr, Neo Architects, Sanne van Herwijnen, Alex Schumacher, Matt Gutberlet, Jose Barrera, Glenn Hall, Steven Dawson, Vengarth, Michael Patton, ggroggs, Gabriele Vissio, Wilee, Bernt Sietsma, Teddy Toussaint, Kisay, Jayce Collins, leandro, Cassandra Riling, Spencer Czapiewski, su4ns3t, Nicha Traipipattanapong, Eigenverse, Mikakohanpepperoni, Bonku BRB, Swagner, David Wagner, Random Dev, Litten, Luke Felix-Rose, Gabriel Steel, Chlorissa Pecha, Anatidae, freakazoid, Ayrton Aquiles Mera Concha, Christoph Stock, Bruce Kneale, ShakyHades ., Alexandre Paques, Sieghard Hillbrecht, Matthieu Heras, Victoria Morgan, Aubrey T, Wyvern, NDRS, Y.Tamino, Dan Walker, Bruce A Johnson, Luke Elasky, VictorHuerta, KeyarK, Patron12, Nail Saberov, Devon Charlton, Sara & Son, Porus, Julija Besciokova, Cathy Wu, Nikita Kozlov, Kira Kuhne, David Noack, Alex Suarez Mendez, DerRobot, Rimuru Tempest, Terell Seitz, Benjamin Duggan, Martyn Warry, John Doe, William Sallembien, Gabriele Quida, Skyler Foster, Ant Corke, Nicolas, Nuttakan Chuntra, Brin, Tactical Bagels, Nathan Zubrzycki, hollowjackals, Joshua Stringham, Anveio, Carla, Ethan Ogiba, Alin Nica, David Richard Bakken, DrummerGeek", "link": "https://www.youtube.com/watch?v=LxgMdjyw8uw", "date_published": "2022-04-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]