[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "6 Things I HATE about using LINUX", "description": "Get 100$ credit for your own Linux and gaming server: https://www.linode.com/linuxexperiment \nGrab a brand new laptop or desktop running Linux:https://www.tuxedocomputers.com/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to a weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYouTube: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n📹 MORE VIDEOS FROM ME\nLinux news in Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\nGaming on Linux: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nI'm also on ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n🏆 FOLLOW ME ELSEWHERE:\nTwitter : http://twitter.com/thelinuxEXP\nMastodon: https://mastodon.social/web/@thelinuxEXP\nPixelfed: https://pixelfed.social/TLENick\nDiscord: https://discord.gg/xK7ukavWmQ\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\nThis video is distributed under the Creative Commons Share Alike license.\n\n#linux #opensource \n\n00:00 Intro\n00:35 Sponsor: 100$ free credit for your Linux or gaming server\n01:28 Parts of the Linux community\n02:34 Packaging formats that all do the same thing\n04:47 Hardware support and choice\n07:31 The Linux Desktop is still seen as a niche market\n09:38 Stability and lack of inter-project communication\n10:40 Battery life is just not up to par\n11:52 Linux is still the best choice for me\n12:55 Sponsor: Get a device that runs Linux perfectly\n13:53 Support the channel\n\n\nI'm deeply annoyed by some parts of the Linux community. More specifically, I'm very annoyed at people who just won't let others use what they want. Whether it's WIndows, macOS, a specific distro, or a specific piece of software, you always get someone who will attack these choices, say it's crap, that you're an idiot, or that what they use is better.\n\nSecond thing that I really hate on Linux is the software management. I hate that we have to find out which packaging format a specific app uses after it fails to show up in our software stores. There are just too may ways to install an application or a tool.\n\nAll a packaging format is supposed to do is get you an app or a tool, and add it to your menu. That's it. Put the files in the right place, and let me mindlessly run the app. Why do we have so many formats?\n\nNext point of contention is hardware. I wish we had more choice for hardware that runs Linux. We do have plenty of great manufacturers, like System76, Tuxedo, Slimook, Starlabs, and a lot of others. But they all have the same problems. First, they don't always ship worldwide. Second, they don't have all the choices to completely serve everyone. Where is my powerful ARM laptop with awesome battery life? Where are my dedicated AMD GPUs? Where are my nice chassis colors? Where are my peripherals that work well with Linux?\n\nThird, they can't produce at the same scale as more established manufacturers.\n\nAnd I won't even mention specialized hardware, like audio devices, stream decks, drawing tablets, fingerprint readers, and others. Manufacturers, make Linux drivers. Now. The market is big.\n\nWhich nicely transitions us to the next issue: I still hate that Linux is seen as a second rate choice, or a small, niche, enthusiast OS on the desktop.\n\nAccording to some 2022 stats, there are as many devs that use Linux than macOS. We're not a small platform anymore. In 2019, 47% of the world's population had a home computer. Not counting phones. We are around 8 billion people on earth, so 3.76 billion have a computer, and 2.7%, so 101.5 million people use a Linux desktop.\n\nAnother issue that drives me crazy is Linux's stability. Just look at the GRUB problem on Arch. Or look at GlibC breaking easy anti cheat. Or look at the \"steam removed my desktop environment\" on PopOS. Or look at GNOME extensions, broken after each GNOME update.\n\nFinal point that I really hate on Linux is the battery life on laptops.\n\nNo 2 ways about it, in all the laptops I tested, battery life isn't great. I never reached more than 7 or 8h, and that was with the biggest laptop batteries, 80 Wh or more, and on 50% brightness with the CPU scaled way down.", "link": "https://www.youtube.com/watch?v=pCPDWQ5yGFQ", "date_published": "2022-08-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]