[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Free PS Plus Games For September 2022 | GameSpot News", "description": "September’s PlayStation Plus games have been confirmed and new God of War: Ragnarok combat details have been revealed.\n#GamingNews #PSPlus #GodofWarRagnarok \n\nA new month is upon us! Which means new free games that you can add to your backlog and hopefully get around to playing because there's some good ones here. September 2022's PS Plus Essential lineup will include Need for Speed Heat, Toem, and Granblue Fantasy: Versus. This new batch of games will be available starting September 6 and all PS Plus subscribers, regardless of tier, can claim the PlayStation Plus Essential lineup each month.\n\nIf you haven't already, make sure to claim the August freebies before they leave PlayStation Plus on September 6. That lineup is 3 for 3 with absolute bangers: Yakuza: Like a Dragon, Tony Hawk's Pro Skater 1 + 2, and Little Nightmares. Don’t miss out. And if you’re one of these rich kids with an Extra membership, you can look forward to games like Deathloop, Watch Dogs 2 and Assassin’s Creed Origins just to name a few. The super rich kids with a Premium membership have access to new classic titles like the Sly Collection, Sly Cooper: Thieves in Time and most importantly Toy Story 3 for PSP.\n\nWhen it comes to God of War Ragnarok, two of the lead combat designers for the game, Mihir Sheth and Denny Yeh, have broken the silence, offering some insight on new combat abilities for the former Spartan.\n\nSpeaking with Game Informer, Sheth and Yeh have detailed some of Kratos's new combat techniques, including the ability to infuse both the Leviathan Axe and the Blades of Chaos with enhanced elemental properties depending on the weapon--ice for the Axe and fire for the Blades. Doing so activates new Weapon Signature Moves--Frost Awaken for the Axe and Whiplash for the Blades--which will inflict massive damage on enemies.\n\nSTAMPS\n000 - Intro\n00:07 - PlayStation Plus\n02:10 - God of War Ragnarok", "link": "https://www.youtube.com/watch?v=yyf07IKbpCM", "date_published": "2022-08-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Last Of Us PS5 - First 20 Minutes 4K Gameplay", "description": "The Last of Us Part I looks pretty dang good. Here's the first 20 minutes of Naughty Dog's epic post-apocalyptic adventure.\n\nIn this scene we see the heartbreaking opening to The Last of Us Part 1. It can be difficult to watch so that keep that in mind. The game opens in Austin, Texas on Joel's birthday. He gets home to his daughter Sarah who stayed up waiting for him.\n\nQuickly things go south and Joel's neighbors break in. From there, Tommy, Joel, and Sarah hop in a car and try to escape the city.\n\nThis is set to fidelity mode meaning it favors resolution of framerate, and was captured in 4K.\n\nThe Last of Us Part I is available for PS5 on September 2nd.\n\n#thelastofus #gaming #ps5", "link": "https://www.youtube.com/watch?v=GWi9Bffj4uY", "date_published": "2022-08-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Last of Us Part I Review", "description": "The Last of Us Part I manages to tell a harrowing story of loss and redemption that still holds up despite some of its dated level design.\n\nThe Last of Us remake for PS5 is finally here and it looks stunning. Naughty Dog has done a lot to make the world of The Last of Us even more grounded an believable. \n\nIn Jake's 4K review he highlights the major improvements and how they affect the overall experience. The Last of Us Part I also includes the fantastic DLC story, Left Behind. If you've never played The Last of Us and you own a PS5, this is the perfect to experience this world. Keep in mind that it isn't always for the faint of heart.\n\nThe Last of Us Part I comes to PS5 on September 2.", "link": "https://www.youtube.com/watch?v=D6wyS5i9vnk", "date_published": "2022-08-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Biggest Game Releases For September 2022", "description": "Back to school season is upon us, but we’ve got a list of games that you can play instead of doing that homework. Here are 10 of the biggest games releasing in September 2022.\n#Gaming #Splatoon3 #NBA2K23\n\nSeptember is starting strong with the re-remaster of one of the best games of all time. The Last of Us Part 1 features updated and improved AI, a new permadeath mode, a speedrun mode, an updated photo mode, unlockable costumes for Joel and Ellie and a model viewer. On the technical side, Part 1 can render in native 4K at a targeted 30fps or a dynamic 4K at a targeted 60fps display mode.\n\nThis year’s NBA offering from 2K makes a host of changes to the gameplay and focuses on bringing balance back to the offensive game. New gesture combos, such as double throws and switchbacks, are meant to provide shooting windows in tight quarters. Double-throw gestures are used for hop-step layups, while switchback gestures are used for Euro-step and cradle layups. The game's ball handling combos are also getting expanded on, with the full list of Moving Crossovers nearly doubling from last year's game, from 15 to 28 options.\n\nSplatoon is back and this time around it's introducing new modes like Splatfests, matches that will feature not two but three competing sides and table Turf Battle, a new card-collecting puzzle game mode. All of the weapons from previous Splatoon games will be returning, along with a new bow-and-arrow-like weapon called a Stringer, and a melee sword weapon with a charged slash called a Splatana.\n\nSTAMPS\n00:00 - Intro\n00:10 - The Last of Us Part 1\n01:23 - NBA 2K23\n02:18 - Splatoon 3\n03:22 - JoJo’s Bizarre Adventure\n04:11 - Steelrising\n04:59 - Metal: Hellsinger\n05:51 - Return To Monkey Island\n06:25 - Soulstice\n07:02 - Serial Cleaners\n07:49 - The DioField Chronicle", "link": "https://www.youtube.com/watch?v=SSFp_dnSD5A", "date_published": "2022-08-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best Xbox Game Pass Games To Play Right Now", "description": "Xbox Game Pass continues to grow each month, with new games like Immortality and action brawlers such as Midnight Fight Express. Here's a list of seven great games you can play on the service right now.\n#gamespot #gamepass #xbox \n\nXbox Game Pass, Microsoft's gaming subscription service, is often referred to as the best deal in gaming, and for good reason. Each month, multiple games are added to its rotating catalog of titles, a mix of first-party Xbox games, indies, and other huge games. \n\nIt can be a little overwhelming, but have no fear. In this video, we're going to tell you the best games to play on Xbox Game Pass. There's something for everyone, from puzzle mystery games like Immortality, to unrelenting brawlers such as Midnight Fight Express. If you're in the mood for something more chill, there's also Coffee Talk and Cooking Simulator. And speaking of sims, Two Point Campus is also available on Game Pass this month. Each month, GameSpot highlights the best games on Xbox Game Pass, so make sure you subscribe to get the best recommendations.\n\nTIMESTAMPS:\n00:00 - Intro\n00:15 - Immortality\n01:13 - Midnight Fight Express\n02:13 - Tinykin\n03:28 - Immortals Fenyx Rising\n04:20 - Coffee Talk\n05:31 - Cooking Simulator\n06:40 - Two Point Campus\n07:35 - Outro", "link": "https://www.youtube.com/watch?v=XScPiR3-5Cw", "date_published": "2022-08-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Big Chungus Might Be Headed To MultiVersus | GameSpot News", "description": "Big Chungus might be headed to MultiVersus and September’s Games with Gold have been revealed.\n#GamingNews #BigChungus #Xbox \n\nAs spotted in a European Union trademark filing that was shared on Twitter by Andrew Marmo, it looks like Big Chungus might be headed to MultiVersus. The trademark filing for video game software doesn't mention MultiVersus in its fine text, but Big Chungus would be a natural fit for MultiVersus and its varied roster that includes Scooby Doo characters, Batman, and Morty from Adult Swim's Rick and Morty animated series. Big Chungus is also canon to Looney Tunes, as the character appeared in the iOS and Android game World of Mayhem in 2021 and on the big screen in Space Jam 2.\n\nAnd sticking with the subject of free games, Microsoft has unveiled the next batch of monthly free games for Xbox Live Gold and Game Pass Ultimate subscribers. September's Games with Gold lineup includes Gods Will Fall, Double Kick Heroes, Thrillville, and Portal 2. The latter pair of games are the final Xbox 360 backwards compatible classics that Microsoft is giving away via Games with Gold. Starting in October, the service will only include games from the Xbox One era and up.\n\nSTAMPS\n00:00 - Intro\n00:05 - Big Chungus\n00:55 - Games with Gold", "link": "https://www.youtube.com/watch?v=QkO_ncX-h90", "date_published": "2022-08-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Last of Us Part I: Bill's Town Official Gameplay", "description": "Check out 7 minutes of gameplay from the Last of Us Part I in Bill's Town. You'll get to see various action with Joel and Ellie, including fighting a Bloater.\n\n#thelastofus #playstation #gaming", "link": "https://www.youtube.com/watch?v=1Z-MqA0mUEk", "date_published": "2022-08-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]