[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCW0gH2G-cMKAEjEkI4YhnPA", "title": "Rings of Power Ep 1 & 2 - My First Impressions - No Spoilers Review", "description": "After seeing the first two episodes of Rings of Power in NYC, I thought I'd share my non-spoiler thoughts on the first 2+ hours as a whole. While there's some things I'm still not convinced of their necessity (harfoots), there were moments of splendor and heart (Khazad-dum).  I have some quibbles with some of the (particularly First Age) choices, but overall, I think it was a really solid launch for the series and I'm excited to see more!\n\nSERIES PREMIERE WATCH PARTY: https://youtu.be/1jeaEfPPFVU\n\nHit subscribe - and the bell!\nNerd of the Rings on PATREON: https://www.patreon.com/NerdoftheRings\n\n#theringsofpower #ringsofpower #lordoftherings", "link": "https://www.youtube.com/watch?v=hpo01KAs_i8", "date_published": "2022-08-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCW0gH2G-cMKAEjEkI4YhnPA", "title": "Unboxing Gil-galad's Ring Prop from The Rings of Power | LOTR Collectibles", "description": "I've been a huge fan of prop makers since seeing the work of Wētā Workshop in the LOTR Appendices, so I'm excited to take an up-close look at one of Gil-galad's prop rings made by Into the Fire Jewelry for the upcoming The Lord of the Rings: The Rings of Power series.\n\nView this and other rings at the Into the Fire Jewelry website: https://www.intothefirejewelry.com/gold-charred-super-nova-10kt-24kt-yellow-gold-skull-ring-155\n\nWhile this was sent to me by a vendor, I was under no obligation to give this item a positive review.  Any praise/criticism in my reviews is my genuine opinion/thoughts.  If you are surprised that I really enjoy a LOTR piece of memorabilia, you really shouldn't be. :)\n\n#theringsofpower #gilgalad #unboxing", "link": "https://www.youtube.com/watch?v=EVVOBvt7u9c", "date_published": "2022-08-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]