[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Long list of side effects to look out for", "description": "The Complete List of the Pfizer Adverse Events of Special Interest\n\nLink to Wefwafwa's original video, https://www.youtube.com/watch?v=q1JO0kl3RYk\n\nand channel, https://www.youtube.com/channel/UCzsLklGgOttU3Se-WGLp7ow\n\nPlease suscribe to Wefwafwa@s channel to spport the community health work in Uganda\n\nhttps://phmpt.org/wp-content/uploads/2021/11/5.3.6-postmarketing-experience.pdf\n\nhttps://drjessesantiano.com/the-complete-list-of-the-pfizer-adverse-events-of-special-interest/\nIvermectin study apparently withdrawn\n\nhttps://www.sciencedirect.com/science/article/pii/S1201971221009887\n\nThe researchers and experts told The Associated Press that the findings are no longer relevant.\n\nhttps://apnews.com/article/fact-checking-136056839408\n\nAnother retraction example\n\nhttps://www.thelancet.com/journals/lancet/article/PIIS0140-6736(20)31180-6/fulltext\n\nAdverse Event of Special Interest \n\nis an event for a particular product that should be monitored by a drug or vaccine manufacturing company. \n\nIt can be severe or non-serious, but it can lead to a serious medical condition.\n\nAccording to the CIOMS Working Group VII\n\nhttps://cioms.ch\n\nThe Council for International Organizations of Medical Sciences (CIOMS),\n\ninternational, non-governmental, non-profit organization established jointly by WHO and UNESCO in 1949. \n\nSuch events should be described in protocols or protocol amendments, \n\nand instruction provided for investigators as to how and when they should be reported to the sponsor.\n\nThe original Pzifer appendix is a wall of words with the diagnoses separated by semi-colons. \n\nMore than 95% of the adverse events listed are life-changing. (for the bad)\n\nIf you are lucky enough to have a diagnosis from your doctors and say it is not related to the shot, \n\nshow this list to them. \n\nTell them that Pfizer is watching out for those complications. \n\nMany doctors, nurse practitioners, or physician assistants don’t know. \n\nI didn’t until I read the whole list.\n\nMany of the conditions below are rare. \n\nThat means a doctor may not have seen that condition before or might have forgotten about them from medical school. \n\nRare also means there may be no standardized treatment for them.\n\nThe diagnosis on the list does not mean they always happen with the COVID-19 shots, \n\nbut anyone who got “vaccinated” and then diagnosed with the illnesses below should be reported to Pfizer or the VAERS. \n\nThe diagnosis may be months or years after the shots. You can still report them.\n\nThe World Health Organization is also keeping an eye on the AESIs. AESI monitoring determines if there is a higher incidence of specific diseases in people who had the COVID shots. \n\nIf the incidence is higher in people who had the shots, they should stop using these “vaccines”. \n\nThat is if they do their job.\n\nThis list may be from Pfizer, but ALL WHO HAD THE COVID SHOTS WHATEVER THE MANUFACTURER SHOULD REPORT THEIR DIAGNOSIS.", "link": "https://www.youtube.com/watch?v=EASM6EzCVeg", "date_published": "2022-03-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]