[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Camilo: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nAnamaria Sayre | March 10, 2022\nWhen catching glimpses of his meteoric rise to global stardom and his picturesque life with partner and artist Evaluna Montaner, fans are often left to speculate on the romance of Camilo’s life. From his Tiny Desk (home) Concert in Miami, the Colombian singer-songwriter pulls back the curtain for 15 minutes of soul-baring intimacy, letting the world view his fairytale life in full bloom.\n\nTrading out his typical guitar opening for soulful strings, Camilo opens with a softer rendition of “Índigo,” a sweet dedication to his soon-to-be born baby of the same name. Setting the tone for his love-laden performance, he sings to an off-camera Montaner, Índigo’s mamá and Camilo’s querida, who trades her usual place as singer on the duet to serve as director for the performance. Transitioning to a slower “La Mitad,” his sweet vocals overlap with layers of singing guitar for a meditative rendition of the heartfelt track. When he completes the piece, Camilo pauses to recite a poem he’s written for the occasion, inviting the audience to explore the inner workings of the mind behind the music.\n\nHe transitions into a full-bodied, emotional performance of “El Mismo Aire,” complete with more silky strings and captivating percussion. Cowbell and trumpet converse playfully to create a resounding close with “Vida de Roco.” The Colombian singer-songwriter offers up a percussive bouquet for this performance, presenting each song with a novel depth of instrumentation and tone. He builds a dream landscape on layers of sweet drum solos and chest-gripping strings, inviting the listener to partake in a world where sound and heart perfectly coexist.\n\nSET LIST\n“Índigo”\n“La Mitad”\n“El Mismo Aire”\n“Vida de Rico”\n\nMUSICIANS\nCamilo: vocals, kalimba, sampler, veillette, guitar\nDaniel Uribe: guitar, lap steel\nOscar Convers: bass\nNico González: melodica, steel guitar, guiro\nFranda Fuentes: percussion\nRichi López: ronroco, chekere\nJonTheProducer: mellotron, cowbell\njosefe: trumpet, bugle\nManuela López Lambuley: cello\nFrancia Laurens: viola\n\nCREDITS\nDirector: Evaluna Montaner\nProducer: Mayte Calzacorta\nProduction House: The Way Films\nRecording Engineer: Pascual Matera \nVocal Engineer: Natalia Ramírez \nMixing Engineer: Nicolás Ramírez \nMastering Engineer: Nicolás Ramírez\n\nTINY DESK TEAM\nProducer: Anamaria Sayre\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Joshua Bryant, Maia Stern, Ashley Pointer\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #camilo", "link": "https://www.youtube.com/watch?v=FlZuFh0KUvc", "date_published": "2022-03-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]