[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Biggest PC Games Coming in 2023 and Beyond", "description": "PC Gamers have a lot to look forward to next year. Here are some of the biggest games coming to PC in 2023.\n\nDespite consoles continuing to get the big press conferences, PC remains the most varied, customizable, and potentially powerful way to play while also offering multiplatform games at their best. PC doesn’t need to make a fuss cause it knows it kicks all the butt like that. So as we wrap up 2022, it’s time to look ahead to next year and beyond at the bright future of PC games and go through some of the most anticipated games coming.\n\nWe've got fan favorites and highly anticipated games that are on our list for next year but we almost certainly missed something you’re excited about, so let us know in the comments! And don’t forget to subscribe to Gamespot as we look as some of our other most anticipated games on consoles as well! \n\nTimestamps:\n0:00 Intro\n0:16 Avowed\n0:36 Resident Evil 4 Remake\n0:57 - Star Wars Jedi: Survivor\n1:20 - Judas\n1:46 - Hades 2\n2:15 - The Last Of Us Part One\n2:53 - Returnal\n3:14 - Kerbal Space Program 2\n3:37 - Diablo 4\n4:10 - Perfect Dark\n4:31 - The Elder Scrolls VI\n4:51 - Starfield\n5:26 - The Next Mass Effect\n5:56 - Dragon Age: Dreadwolf\n6:19 Forspoken\n6:40 - Fable\n6:58 - Redfall\n7:20 - S.T.A.L.K.E.R. 2: Heart of Chornobyl\n7:51 - Senua's Saga: Hellblade II\n8:11 - Suicide Squad: Kill The Justice League\n8:41 - System Shock\n9:02 - Baldur's Gate 3\n9:30 - Company of Heroes 3\n9:46 - Final Fantasy XVI\n10:12 - Final Fantasy VII Rebirth\n10:30 - Dead Island 2\n10:52 - Atomic Heart", "link": "https://www.youtube.com/watch?v=Vg0Aix5sHgw", "date_published": "2022-12-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Biggest Nintendo Switch Games Coming in 2023 and Beyond", "description": "Nintendo had a great 2022, and it may have an even better 2023. Here are some of the biggest games coming to the Nintendo Switch next year.\n00:00 - Intro\n00:25 - Hollow Knight: Silksong\n01:18 - Pikmin 4\n01:54 - Advanced Wars 1+2: Re-Boot Camp\n02:37 - Fire Emblem: Engage\n03:21 - Metal Slug Tactics\n04:06 - Bomb Rush Cyberfunk\n04:58 - Octopath Traveler II\n05:35 - Pepper Grinder\n05:59 - Blanc\n06:22 - Metroid Prime 4\n07:02 - The Legend of Zelda: Tears of the Kingdom", "link": "https://www.youtube.com/watch?v=Ld4rwq7sFzI", "date_published": "2022-12-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "GTA 6 Leak Appears In Goat Simulator 3 Ad | GameSpot News", "description": "The Goat Simulator franchise isn’t new to trollish antics, but a recent ad for Goat Sim 3 took those antics to another level by including gameplay from the massive GTA 6 leak that emerged earlier this year.\n#GamingNews #GTA6 #GrandTheftAuto \n\nThe ad, which is currently unavailable, featured a humorous overview of an NPC named Shaun, who describes his duties as walking around in circles, picking things up, and sitting on a bench. The GTA 6 clip comes late in the ad, when Shaun says that you can see him in some \"footage that was leaked a couple of months ago.\"\n\nGTA publisher Take-Two did not find this bit funny at all, and it didn't take long for the company to issue a DMCA notice to take down the video.\n\nIn other news, the director of Star Wars Jedi: Survivor recently spoke with Game Informer and explained features we can expect from the upcoming game. \n\nThere are a total of five lightsaber stances, including a dual-blade stance and one where Cal wields both a lightsaber and a blaster. A new heavy and slow style uses the crossguard lightsaber, as introduced by Kylo Ren. These new stances will let you hit harder or from farther away, but whether you should use them depends on the enemies you will be facing.\n\nIf you want to play a space game right now, look no further than High On Life. \n\nThe wild and wacky shooter from Squanch Games is tearing it up on Xbox Game Pass. Benji Sales on Twitter found a list that showed the new game from Ricky and Morty's Justin Roiland as the No. 1 \"most-popular\" Xbox Game Pass title earlier this week. The game's own Twitter account re-shared the tweet.", "link": "https://www.youtube.com/watch?v=wsvX122FnuU", "date_published": "2022-12-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "What To Know When Upgrading your Gaming PC With GIGABYTE", "description": "Whether you’re looking to get a new PC or just upgrade some key components, we’ve teamed up with GIGABYTE AORUS to give you a crash course in how to elevate your PC gaming hardware. (Presented by GIGABYTE)\n\n#GIGABYTE #AORUS #pcgaming \n\n0:00 Intro\n1:23 Motherboard\n3:18 Graphics Card\n5:10 Monitors", "link": "https://www.youtube.com/watch?v=CDByqhOgj44", "date_published": "2022-12-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]