[{"source": "https://businessinsider.com.pl/.feed", "title": "Zełenski rozmawiał z Bidenem. Pentagon ujawnił, jaką broń przekaże Ukrainie", "description": "—Jestem dzisiaj w Waszyngtonie, by podziękować amerykańskiemu narodowi, prezydentowi i Kongresowi za tak potrzebne wsparcie — powiedział ukraiński przywódca Wołodymyr Zełenski, który w środę wieczorem przyleciał do Stanów Zjednoczonych. To pierwsza zagraniczna wizyta Zełenskiego od czasu inwazji Rosji na Ukrainę.", "link": "https://businessinsider.com.pl/wiadomosci/zelenski-w-usa-pentagon-ujawnil-jaka-bron-przekaze-ukrainie/s6vzx1s", "date_published": "2022-12-21 21:21:49+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Rusza projekt Ivy Ukraine. Pomoc dla ukraińskich uczniów", "description": "Studenci najlepszych uniwersytetów na świecie będą pomagać w zadaniach domowych, przygotowaniu do egzaminów i wyrównaniu podstawy programowej dzieciom, które uciekły przed wojną z Ukrainy do Polski lub nadal pozostają w swoim kraju. Rusza polski projekt Ivy Ukraine zapewniający wsparcie edukacyjne dla dzieci i młodzieży z Ukrainy.", "link": "https://businessinsider.com.pl/wiadomosci/rusza-ivy-ukraine-wsparcie-w-nauce-dla-dzieci-i-mlodziezy-z-ukrainy/2bnfkhp", "date_published": "2022-12-21 20:21:38+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Tak wyludnia się Polska. Oto gminy, które straciły najwięcej mieszkańców [MAPY]", "description": "Główny Urząd Statystyczny opublikował kolejne wyniki spisu powszechnego. Pokazały one, że najbardziej wyludniają się gminy najdalej położone od miast wojewódzkich oraz te na wschodzie kraju. Gdzie w Polsce przybyło ludności?", "link": "https://businessinsider.com.pl/gospodarka/spis-powszechny-oto-gminy-ktore-stracily-najwiecej-mieszkancow-mapy/met45tf", "date_published": "2022-12-21 19:31:01+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Prezydent Ukrainy już w Waszyngtonie. Jest deklaracja w sprawie Patriotów", "description": "Prezydent Ukrainy Wołodymyr Zełenski przyleciał w środę do Waszyngtonu, gdzie będzie przebywał z kilkugodzinną wizytą. Dotarł do stolicy USA na pokładzie amerykańskiego samolotu wojskowego, który wyleciał z Polski. Jest już pierwsza deklaracja ze strony USA, które przekażą Ukrainie dodatkową pomoc wojskową o wartości 1,85 mld dolarów, w tym m.in. system obrony powietrznej Patriot.", "link": "https://businessinsider.com.pl/wiadomosci/prezydent-ukrainy-juz-w-usa-jest-deklaracja-w-sprawie-patriotow/jscpep0", "date_published": "2022-12-21 18:48:03+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Prezes Orlenu zrezygnował z zasiadania w radzie nadzorczej", "description": "Prezes PKN Orlen Daniel Obajtek zrezygnował z zasiadania w radzie nadzorczej Energi — poinformowała w środę spółka z Grupy Orlen. Jak dodała, PKN Orlen złożył zarazem oświadczenie o powołaniu do rady dwóch nowych osób.", "link": "https://businessinsider.com.pl/biznes/prezes-orlenu-zrezygnowal-z-zasiadania-w-radzie-nadzorczej-energi/164gzxj", "date_published": "2022-12-21 18:29:45+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Tak wyglądają polskie święta w Google. \"Kevin sam w domu\" zdetronizowany", "description": "Coraz częściej z pytaniami o przepisy na święta, prezenty itp. odpalamy internet i szukamy pomocy w wyszukiwarce Google. Najnowsze statystyki pokazują, że w tym roku wśród prezentów dominuje drobna elektronika, w tym szczególnie smartfony i smartwatche, ale wybieramy także perfumy czy premierowe gry na konsolę. Okazuje się, że wśród świątecznych filmów Grinch wyprzedził Kevina, a najpopularniejszą ozdobą są kurtyny świetlne.", "link": "https://businessinsider.com.pl/wiadomosci/polskie-swieta-w-google-kevin-sam-w-domu-zdetronizowany/pe1lmh3", "date_published": "2022-12-21 18:19:24+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Raport ze stacji paliw. Nie dla wszystkich kierowców święta będą dużo droższe", "description": "Tankowanie diesla przed świętami uderzy po kieszeni. W porównaniu z analogicznym okresem poprzedniego roku litr oleju napędowego zdrożał o prawie 2 zł. Narzekać nie powinni właściciele samochodów na gaz. Cenniki są dość zróżnicowane pomiędzy województwami.", "link": "https://businessinsider.com.pl/twoje-pieniadze/jeszcze-nie-tankowales-przed-swietami-tyle-teraz-zaplacisz-na-stacji-paliw/3j32rzn", "date_published": "2022-12-21 17:16:39+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Szachtar Donieck chce 40 mln euro odszkodowania od FIFA", "description": "Ukraiński klub Szachtar Donieck uważa, że ucierpiał finansowo z powodu kilku decyzji podjętych przez FIFA po inwazji Rosji na Ukrainę. Klub domaga się 40 mln odszkodowania od FIFA.", "link": "https://businessinsider.com.pl/sport/szachtar-donieck-chce-40-mln-euro-odszkodowania-od-fifa/gseprez", "date_published": "2022-12-21 17:05:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Czy za 31 grudnia w sobotę należy się dodatkowe wolne? Wyjaśniamy", "description": "Tegoroczny układ kalendarza nie sprzyja przedłużonemu odpoczynkowi. Wigilia w 2022 r. wypada w sobotę, a pierwszy dzień świąt w niedzielę. Z kolei Nowy Rok witamy z soboty na niedzielę. Jak wygląda kwestia \"odbioru dnia wolnego za święta\"?", "link": "https://businessinsider.com.pl/wiadomosci/czy-za-31-grudnia-w-sobote-nalezy-sie-dodatkowe-wolne-wyjasniamy/e00f3dg", "date_published": "2022-12-21 16:27:46+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Jest podpis prezydenta pod ustawą podatkową. Zmiany dotyczą m.in. paliw", "description": "Najpóźniej 1 stycznia 2023 r. wejdą w życie nowe przepisy, jakie znalazły się w nowelizacji ustawy o podatku akcyzowym oraz niektórych innych ustaw. Pod nimi podpisał się w środę prezydent Andrzej Duda. Dotyczą m.in. paliw, papierosów elektronicznych, wina i samochodów hybrydowych.", "link": "https://businessinsider.com.pl/twoje-pieniadze/prawo-i-podatki/zmiany-w-podatkach-z-podpisem-prezydenta-dotycza-min-paliw/z3kzcjj", "date_published": "2022-12-21 16:19:16+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Konsumenci, w tym kredytobiorcy, zyskają większą ochronę. Łatwiej wytoczą pozew grupowy", "description": "Organizacje konsumenckie będą mogły wytaczać pozwy grupowe przeciwko przedsiębiorcom, którzy naruszają interesy konsumentów. Będą mogły żądać unieważnienia umowy z obowiązkiem wzajemnego zwrotu świadczeń lub zwrotu pobranych opłat. Tak wynika z projektu ustawy przygotowanego przez Urząd Ochrony Konkurencji i Konsumentów.", "link": "https://businessinsider.com.pl/prawo/konsumenci-zyskaja-wieksza-ochrone-latwiej-wytocza-pozew-grupowy/z2c70jz", "date_published": "2022-12-21 16:14:17+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kryzys energetyczny. Jest decyzja w sprawie niemieckich elektrowni jądrowych", "description": "Trzy ostatnie elektrownie jądrowe w Niemczech miały być wyłączone z końcem tego roku, jednak ich działanie wydłużono ze względu na kryzys energetyczny. W środę minister gospodarki poinformował o decyzji kanclerza Olafa Scholza, zgodnie z którą ostateczna rezygnacja z energetyki jądrowej nastąpi w kwietniu.", "link": "https://businessinsider.com.pl/gospodarka/kryzys-energetyczny-jest-decyzja-w-sprawie-niemieckich-elektrowni-jadrowych/ffvbne9", "date_published": "2022-12-21 16:03:11+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Były prezydent Rosji w Pekinie. Oto co usłyszał od Xi Jinpinga na temat Ukrainy", "description": "Prezydent Chin Xi Jinping powiedział byłemu prezydentowi Rosji Dmitrijowi Miedwiediewowi, że Pekin chciałby rozmów w sprawie Ukrainy.", "link": "https://businessinsider.com.pl/wiadomosci/miedwiediew-w-pekinie-oto-co-uslyszal-od-xi-jinpinga-na-temat-ukrainy/v5q6jn6", "date_published": "2022-12-21 15:44:43+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Górnicy domagają się 25-proc. podwyżek. Na razie dostali 84 mln zł na posiłki", "description": "W tym roku wynagrodzenia w JSW wzrosły o 10 proc., a w lipcu wypłacono także nagrody po kilkanaście tysięcy złotych. Od nowego roku górnicy będą mogli także liczyć na posiłki o wartości ponad 50 zł. To nie koniec. Związkowcy domagają się także 25-proc. wzrostu płac w firmie i podniesienia wartości deputatu węglowego.", "link": "https://businessinsider.com.pl/biznes/dluga-lista-zadan-gornikow-25-proc-podwyzki-i-nietanie-posilki/vr4kwgs", "date_published": "2022-12-21 15:36:09+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kolejne roszady kadrowe w KGHM. Jest nowy wiceprezes", "description": "W środę rada nadzorcza KGHM powołała Mateusza Wodejko do pełnienia funkcji wiceprezesa miedziowego giganta. To skutek poprzednich zmian na szczycie drabinki kadrowej KGHM.", "link": "https://businessinsider.com.pl/biznes/kolejne-roszady-kadrowe-w-kghm-jest-nowy-wiceprezes/zht48fp", "date_published": "2022-12-21 15:34:23+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Stowarzyszenie Filmowców Polskich: Netflix szykuje pułapkę", "description": "Netflix ogłosił pilotaż nowego systemu dodatkowych wynagrodzeń dla twórców popularnych lokalnych produkcji. — Netflix szykuje pułapkę na polskich filmowców — uważa prezes Stowarzyszenia Filmowców Polskich.", "link": "https://businessinsider.com.pl/wiadomosci/stowarzyszenie-filmowcow-polskich-netflix-szykuje-pulapke-na-polskich-filmowcow/7wsqvw6", "date_published": "2022-12-21 14:59:37+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "PIT za 2022 r. Jak fiskus wyliczy ulgę dla klasy średniej? Znamy szczegóły [TYLKO U NAS]", "description": "PITy za 2022 r. będą wyjątkowe. Ulga dla klasy średniej powróci bowiem jeszcze raz. Niektórym może się ona bardziej opłacić niż rozliczenie z niższą stawką PIT. Ministerstwo Finansów w odpowiedzi na pytania Business Insider wyjaśnia szczegółowo, jak będzie sprawdzało, czy ulga opłaca się podatnikowi. Przyznaje nam, że będzie można skontrolować obliczenia fiskusa!", "link": "https://businessinsider.com.pl/prawo/podatki/pit-za-2022-r-jak-fiskus-wyliczy-ulge-dla-klasy-sredniej-wyjasnienia-mf/h0ly00r", "date_published": "2022-12-21 14:55:11+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Gwiazdor disco-polo żali się na emeryturę. \"Nawet łódki nie zatankuję za te pieniądze\"", "description": "Prawda o emeryturach Polaków jest bolesna. Problem dotyka też zamożnych artystów. Lider Bayer Full przyznaje, że dostał pismo z ZUS, że po 37 latach płacenia składek ma gwarantowane niecałe 400 zł emerytury.", "link": "https://businessinsider.com.pl/twoje-pieniadze/gwiazdor-zali-sie-na-emeryture-nawet-lodki-nie-zatankuje-za-te-pieniadze/rdw5p93", "date_published": "2022-12-21 14:49:03+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Google wykorzysta sztuczną inteligencję do odczytania bazgrołów lekarza", "description": "Lekarzom od dawna zarzuca się nieczytelne pismo. Google chce wykorzystywać sztuczną inteligencję do odszyfrowania trudnych do przeczytania fragmentów. Firma, we współpracy z farmaceutami, pracuje nad modelem SI, który może odszyfrować trudne do odczytania pismo ręczne – takie, jakie od dawna zarzuca się lekarzom.", "link": "https://businessinsider.com.pl/wiadomosci/google-wykorzystuje-sztuczna-inteligencje-do-odszyfrowania-bazgrolow/jvnvnxp", "date_published": "2022-12-21 14:42:04+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Akcesoria kawowe od marki Timemore. Jakość, design, funkcjonalność", "description": "Timemore to marka, której raczej nie trzeba przedstawiać miłośnikom i miłośniczkom kawy speciality. Minimalistyczny design, dbałość o najmniejsze detale oraz najwyższa jakość wykonania sprawiają, że akcesoria od tego brandu otwierają drzwi do najlepszej filiżanki kawy, każdego dnia na nowo. Wybraliśmy pięć produktów, które warto mieć w swojej kuchni, niezależnie od tego, czy dopiero wkraczasz w świat kawowej alternatywy, czy czujesz się w nim jak w domu.", "link": "https://businessinsider.com.pl/technologie/akcesoria-kawowe-od-marki-timemore-mlynek-dripper-french-press-kettle/6rgdyk4", "date_published": "2022-12-21 14:39:44+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Staje największy blok energetyczny w Polsce. Przed nami trudne tygodnie", "description": "W samym środku sezonu zimowego, gdy zapotrzebowanie na energię elektryczną jest najwyższe, z usterką zmaga się najnowszy blok w Elektrowni Kozienice, należący do Enei. To największa jednostka wytwórcza w kraju, której moc sięga 1075 MW. Obecnie blok działa na połowie mocy, ale od piątku zupełnie przestanie przesyłać prąd do sieci, a postój potrwa aż do 8 stycznia 2023 r. To zwiastuje kłopoty w utrzymaniu rezerw mocy na bezpiecznym poziomie, czyli takim, który minimalizuje ryzyko przerw w dostawach energii.", "link": "https://businessinsider.com.pl/gospodarka/staje-blok-w-elektrowni-kozienice-najwiekszy-w-polsce-przed-nami-trudne-tygodnie/l8vngew", "date_published": "2022-12-21 14:11:42+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Czesi i Węgrzy uważają, że swoje już zrobili. Stopy procentowe bez zmian", "description": "Banki centralne Czech i Węgier zdecydowały na posiedzeniach w tym tygodniu, aby nie podnosić już — przynajmniej na razie — stóp procentowych. Podobnie może być w Polsce w najbliższych miesiącach.", "link": "https://businessinsider.com.pl/finanse/makroekonomia/czesi-i-wegrzy-uwazaja-ze-swoje-juz-zrobili-stopy-procentowe-bez-zmian/ly73nf6", "date_published": "2022-12-21 14:09:07+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Posłuchaj niepokojącego odgłosu z głębin Pacyfiku. Przez lata przyprawiał naukowców o gęsią skórkę", "description": "Posłuchaj niepokojącego dźwięku nagranego na południowym Pacyfiku, który przez lata przyprawiał naukowców o gęsią skórkę. Nazwali go \"bloop\".", "link": "https://businessinsider.com.pl/technologie/nauka/dziwny-dzwiek-z-dna-pacyfiku-podejrzewano-ze-wydaje-go-nieodkryte-morskie-stworzenie/b2fgbt3", "date_published": "2022-12-21 14:08:15+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Telefonia komórkowa w Rosji może cofnąć się do poziomu lat 90.", "description": "Gdy z końcem roku producenci sprzętu telekomunikacyjnego Nokia i Ericsson opuszczą Rosję z powodu nałożonych na ten kraj europejskich sankcji, w dłuższej perspektywie może to stopniowo sparaliżować rosyjskie sieci komórkowe. Spowodowane tym trudności cofną telefonię komórkową w Rosji o 30 lat.", "link": "https://businessinsider.com.pl/biznes/rosja-cofnie-sie-o-pokolenie-bedzie-trudno-porozmawiac-przez-telefon/p2390tk", "date_published": "2022-12-21 13:57:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kaczyński o wyroku sądu: będę musiał sprzedać dom. Sikorski postawił warunek", "description": "Zgodnie z decyzją sądu Jarosław Kaczyński ma zapłacić ponad 700 tys. zł na pokrycie kosztów opublikowania przeprosin Radosława Sikorskiego w Onecie. — Będę zmuszony sprzedać dom, nawet nie wiem, czy to wystarczy — powiedział Kaczyński. Do tych słów odniósł się Sikorski, stawiając warunek, pod jakim odstąpi od domagania się przeprosin.", "link": "https://businessinsider.com.pl/wiadomosci/kaczynski-o-przeprosinach-dla-sikorskiego-bede-musial-sprzedac-dom/9sv3kql", "date_published": "2022-12-21 13:43:21+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Nowa metoda oszustwa na kryptowaluty. Tak można stracić oszczędności życia", "description": "Około 160 tys. zł stracił 57-letni mieszkaniec okolic Bielska Podlaskiego, który uwierzył oszustom, że zainwestują jego oszczędności w kryptowaluty. Za namową przestępców wziął nawet kredyty, ostatecznie zablokowali mu oni dostęp do wpłaconych na specjalne konto pieniędzy.", "link": "https://businessinsider.com.pl/twoje-pieniadze/nowa-metoda-oszustwa-na-kryptowaluty-tak-mozna-stracic-oszczednosci-zycia/44qxc6p", "date_published": "2022-12-21 13:27:42+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Rzuciłam posadę na wysokim stanowisku i zaczęłam organizować luksusowe wycieczki. Nigdy nie byłam szczęśliwsza", "description": "Sarah Groen przez lata pracowała w bankach i największych firmach technologicznych. Mimo zmian pracodawcy jedna rzecz pozostała dla niej niezmienna: miłość do podróży. Amerykańska przedsiębiorczyni pewnego dnia postanowiła przekształcić swoją pasję w biznes, który rozkwitał nawet w czasach pandemii.", "link": "https://businessinsider.com.pl/lifestyle/podroze/luksusowe-podroze-sarah-groen-i-jej-pomysl-na-biznes-po-rzuceniu-pracy/wl827pb", "date_published": "2022-12-21 13:25:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Polska wygrywa wieloletnią batalię o setki milionów złotych. Co z odszkodowaniem?", "description": "Polska wychodzi zwycięsko z wieloletniej batalii z luksemburskim funduszem, który kiedyś był właścicielem jednego z banków działających w naszym kraju. Kilka wyroków skazywało Polskę na zapłatę blisko 650 mln zł odszkodowania. Ostateczna decyzja jest taka, że nic nie zapłacimy, a gigantyczne koszty procesowe pokryje przegrany.", "link": "https://businessinsider.com.pl/biznes/polska-gora-przed-szwedzkim-sadem-wygrywa-wieloletnia-batalie/6bt8c63", "date_published": "2022-12-21 13:19:50+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Mocne zarzuty związkowców pod adresem odwołanego prezesa PLL LOT", "description": "Odwołany w środę prezes PLL LOT nie odchodzi w chwale. — Milczarski zapisze się w historii narodowego przewoźnika jako jeden z najgorszych szefów, który notorycznie łamał prawa pracownicze i prześladował niezależnych liderów związkowych — twierdzi Piotr Szumlewicz, przewodniczący Związku Zawodowego Związkowa Alternatywa.", "link": "https://businessinsider.com.pl/biznes/jeden-z-najgorszych-szefow-zwiazkowcy-ostro-o-odwolanym-szefie-pll-lot/c67lwr4", "date_published": "2022-12-21 12:59:49+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "W drugi dzień świąt nie zrobisz przelewu", "description": "Przelewy, które zlecimy w najbliższy piątek 23 grudnia, po godzinie 16:00 trafią na konta odbiorców we wtorek 27 grudnia. 26 grudnia to dzień wolny od pracy. Do dyspozycji klientów banków pozostanie system płatności natychmiastowych.", "link": "https://businessinsider.com.pl/twoje-pieniadze/w-drugi-dzien-swiat-26-grudnia-nie-zrobisz-przelewu/21qd386", "date_published": "2022-12-21 12:36:13+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Dyskonty podnoszą pensje. Porównanie stawek w Biedronce i Lidlu", "description": "We wtorek Biedronka zapowiedziała podwyżki dla swoich pracowników od nowego roku. Lidl wzrost pensji zapowiedział już w listopadzie. Oto ile będzie można zarobić w czołowych dyskontach w Polsce.", "link": "https://businessinsider.com.pl/twoje-pieniadze/praca/dyskonty-podnosza-pensje-porownanie-stawek-w-biedronce-i-lidlu/38yvdvh", "date_published": "2022-12-21 11:59:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Prezes Polskich Linii Lotniczych LOT odwołany. Stracił jeszcze jedno stanowisko", "description": "Rady Nadzorcze Polskich Linii Lotniczych LOT i Polskiej Grupy Lotniczej podjęły w środę decyzje o odwołaniu Rafała Milczarskiego z funkcji prezesa obu spółek — poinformował rzecznik PLL LOT Krzysztof Moczulski. Na czele LOT-u stał prawie siedem lat.", "link": "https://businessinsider.com.pl/biznes/prezes-pll-lot-odwolany-po-siedmiu-latach-pracy-stracil-nie-tylko-to-stanowisko/1bc3v4s", "date_published": "2022-12-21 11:57:15+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Podwójne znaczenie inflacji. Wpłynie na wyniki firm i zyski z inwestycji", "description": "Choć okres walki z inflacją jest jeszcze daleki od zakończenia, przy trwającym ryzyku geopolitycznym i związanym z cenami energii, to w drugiej połowie 2023 r. prawdopodobnie będzie już widać wyraźne oznaki poprawy koniunktury, a na rynkach akcji wzrosty wyników spółek, szczególnie amerykańskich — ocenił w rozmowie z ISBnews Grzegorz Zatryb, dyrektor departamentu zarządzania funduszami rynków kapitałowych i główny strateg w Skarbcu TFI. Spadek inflacji powinien poprawić nie tylko mnożniki wyceny spółek, ale także ich zyski.", "link": "https://businessinsider.com.pl/finanse/podwojne-znaczenie-inflacji-wplynie-na-wyniki-firm-i-zyski-z-inwestycji/6vqry8t", "date_published": "2022-12-21 11:51:08+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Jarosław Kaczyński w szpitalu. Rzecznik PiS zdradza szczegóły", "description": "Prezes PiS Jarosław Kaczyński rzeczywiście przebywa obecnie w szpitalu, ale była to dużo wcześniej zaplanowana wizyta; proszę się nie martwić, wszystko jest w porządku — powiedział w środę rzecznik PiS Rafał Bochenek.", "link": "https://businessinsider.com.pl/wiadomosci/jaroslaw-kaczynski-w-szpitalu-rzecznik-pis-zdradza-szczegoly/92ry64m", "date_published": "2022-12-21 11:38:22+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Ten aparat zniesie wszystko. Jest odporny na zgniatanie ciężarem do 100 kg i -10 st. C", "description": "Trenujesz wyczynowo albo uwielbiasz ekstremalne podróże? Jeśli tak, prawdopodobnie zależy ci na uwiecznianiu na zdjęciach wyjątkowych sytuacji, które zdarzają się w trakcie twojej aktywności. Tam, gdzie nie da rady smartfon, da radę kompaktowy aparat do zadań specjalnych. Olympus Tough TG-6 zniesie nawet najtrudniejsze warunki: ujemne temperatury, pył, upadki z wysokości i wodne głębiny.", "link": "https://businessinsider.com.pl/technologie/kompaktowy-aparat-wyczynowy-odporny-na-mroz-zgniatanie-i-wode/b17efw1", "date_published": "2022-12-21 11:34:50+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Zapytali Rosjan, czego obawiają się w 2023 r. Intrygujące wyniki", "description": "Choć w Rosji ze względu na polityczne uciemiężenie trudno o wiarygodne badania opinii publicznej, przez barierę cenzury spróbowały się przebić prywatne firmy badawcze. Wygląda na to, że nie wojna i ewentualna utrata bliskich jest największym zmartwieniem Rosjan.", "link": "https://businessinsider.com.pl/wiadomosci/zapytali-rosjan-czego-obawiaja-sie-w-2023-r-intrygujace-wyniki/ts42fws", "date_published": "2022-12-21 11:33:57+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Noblista krytykuje Muska i Bankmana-Frieda. Mówi, że żyjemy w erze \"nadętych oligarchów\"", "description": "Paul Krugman zaatakował znanych liderów technologii, takich jak Elon Musk i Sam Bankman-Fried, którzy niegdyś zostali okrzyknięci mianem rewolucjonistów, ale według ekonomisty nagrodzonego Noblem są w rzeczywistości dowodem na to, że żyjemy w erze \"nadętego oligarchy\".", "link": "https://businessinsider.com.pl/technologie/nowe-technologie/paul-krugman-krytykuje-muska-i-bankmana-frieda-mowi-ze-zyjemy-w-erze-nadetych/8llpvdy", "date_published": "2022-12-21 11:18:39+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Epoka lodowcowa na rynku kredytów mieszkaniowych. Dużo lepiej prędko nie będzie", "description": "W całym 2022 r. wartość sprzedaży kredytów mieszkaniowych sięgnie około 46 mld zł, co oznacza spadek prawie o połowę w stosunku do 2021 r. — przewiduje główny analityk Biura Informacji Kredytowej (BIK) prof. Waldemar Rogowski. Jego zdaniem istotna poprawa prędko nie nastąpi, ale są pewne sygnały pozytywne.", "link": "https://businessinsider.com.pl/finanse/epoka-lodowcowa-na-rynku-kredytow-mieszkaniowych-duzo-lepiej-predko-nie-bedzie/lcj8r22", "date_published": "2022-12-21 11:16:06+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kicze, które do dziś wzbudzają emocje. Ile kosztują bombki z PRL-u?", "description": "Ceny bombek wyprodukowanych w siermiężnej epoce deficytu i okaleczonego wzornictwa, mogą dziś znacznie przekraczać stawki za nowe świąteczne błyskotki.", "link": "https://businessinsider.com.pl/lifestyle/bombki-z-czasow-prl-ile-kosztuja-ozdoby-choinkowe-na-aukcjach/c3qvrz0", "date_published": "2022-12-21 11:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Patkowski: inflacja może sięgnąć 20 proc., w marcu zacznie się dezinflacja", "description": "Szczyt inflacji zobaczymy w lutym przyszłego roku, być może osiągnie ona poziom 20 proc. W marcu wskaźnik inflacji ma już zacząć spadać — przewiduje Piotr Patkowski, wiceminister finansów. 2023 r. ma być według niego najtrudniejszym rokiem kryzysu.", "link": "https://businessinsider.com.pl/gospodarka/patkowski-inflacja-moze-siegnac-20-proc-w-marcu-zacznie-sie-dezinflacja/4b6rjf8", "date_published": "2022-12-21 10:52:56+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Dane z budownictwa zaskakująco dobre. To może być jednak łabędzi śpiew", "description": "Budowlanka w listopadzie umknęła recesji dzięki przyspieszeniu prac specjalistycznych oraz infrastrukturalnych, być może po części w związku z prognozami mroźnego i śnieżnego grudnia. Być może związane jest to także ze zbliżającym się końcem rozliczenia środków z minionej perspektywy finansowej UE. Branży ciąży jednak spowolnienie w mieszkaniówce i w najbliższych miesiącach będzie to zapewne jeszcze bardziej dla całej branży odczuwalne — oceniają ekonomiści.", "link": "https://businessinsider.com.pl/finanse/makroekonomia/dane-z-budownictwa-zaskakujaco-dobre-to-moze-byc-jednak-labedzi-spiew/nh3tn3x", "date_published": "2022-12-21 10:39:48+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Akt oskarżenia w sprawie Azotów. Chodzi o 87 mln zł", "description": "Prokuratura Regionalna w Szczecinie skierowała do Sądu Okręgowego w Szczecinie akt oskarżenia przeciwko 26 osobom, dotyczący nieprawidłowości w zarządzaniu Grupą Azoty Zakłady Chemiczne Police SA, które spowodowały straty w wysokości ponad 87 mln zł.", "link": "https://businessinsider.com.pl/prawo/akt-oskarzenia-w-sprawie-azotow-chodzi-o-87-mln-zl/e0t63c5", "date_published": "2022-12-21 10:37:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "ING stworzył „Strefę bezpieczeństwa” z innowacyjnymi rozwiązaniami w jednym miejscu", "description": "Polacy są coraz bardziej aktywni on-line, jednocześnie aż 70% Polaków uważa, że liczba cyberataków dziś wzrasta, a prawie połowa badanych (44%) twierdzi, że padło ofiarą oszustwa online lub zna kogoś, kto doświadczył cyberataku – to wnioski z najnowszego raportu ING Banku Śląskiego. Jak zatem wzmocnić ochronę finansów? „Strefa bezpieczeństwa” to innowacyjne zabezpieczenia i zestaw narzędzi, wśród których znajdziemy m.in. weryfikację behawioralną, CyberRescue, czy możliwość włączenia alertów i raportów BIK. Zobacz, co możesz zrobić, żeby lepiej chronić swoje finanse.", "link": "https://businessinsider.com.pl/technologie/nowe-technologie/strefa-bezpieczenstwa-od-ing-te-narzedzia-chronia-przed-cyberprzestepcami/bj29r2k", "date_published": "2022-12-21 10:10:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Poprawiły się nastroje konsumentów, ale wskaźnik dobrobytu pozostaje bardzo niski", "description": "W grudniu odnotowano poprawę zarówno obecnych, jak i przyszłych nastrojów konsumenckich w stosunku do poprzedniego miesiąca — wynika z danych Głównego Urzędu Statystycznego. Wskaźnik dobrobytu, obliczany przez Biuro Inwestycji i Cykli Ekonomicznych, już nie spada, ale wciąż jest na bardzo niskich poziomach.", "link": "https://businessinsider.com.pl/finanse/makroekonomia/poprawily-sie-nastroje-konsumentow-ale-wskaznik-dobrobytu-pozostaje-bardzo-niski/e9k57kc", "date_published": "2022-12-21 09:54:15+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Plajty piekarni już się rozpoczęły. Senat naciska na rząd", "description": "Gigantyczne wzrosty rachunków za gaz zmusiły już pierwszych właścicieli piekarni do zwinięcia interesu. Inni straszą chlebem po 15 zł. \"Czekamy, czy rząd zaproponuje jakąś formę pomocy dla piekarni, co zapowiada. Jeżeli nie, przygotuję inicjatywę ustawodawczą Senatu w tej sprawie\" — mówi w rozmowie z \"Dziennikiem Gazetą Prawną\" senator Krzysztof Kwiatkowski.", "link": "https://businessinsider.com.pl/firmy/plajty-piekarni-juz-sie-rozpoczely-senat-naciska-na-rzad/v747fjm", "date_published": "2022-12-21 09:51:08+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Święta bez ryby po grecku. Na czym będziemy oszczędzać w tym roku?", "description": "91 proc. Polaków nie wyobraża sobie stołu wigilijnego bez sałatki warzywnej, a jednocześnie jest ona najczęściej wyrzucanym daniem. Do wyrzucania świątecznego jedzenia przyznaje się 39 proc. ankietowanych. Jednocześnie prawie połowa Polaków deklaruje, że w tym roku przygotuje mniej niż 12 potraw na wigilijny stół, a w pierwszej kolejności rozważa rezygnację z ryby po grecku.", "link": "https://businessinsider.com.pl/twoje-pieniadze/swieta-bez-ryby-po-grecku-na-czym-bedziemy-oszczedzac-w-tym-roku/pppk1j0", "date_published": "2022-12-21 09:19:47+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Sprzedaż detaliczna zaskoczyła pozytywnie. Polacy nie tak łatwo dają się inflacji", "description": "Rosnące ceny, hamujący wzrost wynagrodzeń i wysokie stopy procentowe uderzają w możliwości zakupowe Polaków. W listopadzie sprzedaż detaliczna urosła po korekcie o inflację już tylko symbolicznie w porównaniu rok do roku - wynika z najnowszych danych Głównego Urzędu Statystycznego. Nadal dodatnią dynamikę widać jedynie w produktach pierwszej potrzeby: lekach, kosmetykach, żywności i napojach.", "link": "https://businessinsider.com.pl/finanse/makroekonomia/sprzedaz-detaliczna-zaskoczyla-pozytywnie-polacy-nie-tak-latwo-daja-sie-inflacji/tt3cf4j", "date_published": "2022-12-21 09:09:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Krzyki, przekleństwa i wyzwiska to najczęstsze formy przemocy, których Polacy doświadczają w pracy", "description": "Według najnowszego sondażu, w ostatnim półroczu aż 40 proc. pracowników doświadczyło w miejscu pracy sytuacji o charakterze mobbingowym. Patrząc na wskazany przez badaczy katalog, widać, że najczęściej dochodzi do krzyków, przekleństw i wyzwisk. Dość powszechne jest również przydzielanie bezsensownych zadań, a także obmawianie i rozsiewanie plotek.", "link": "https://businessinsider.com.pl/twoje-pieniadze/praca/krzyki-przeklenstwa-i-wyzwiska-to-najczestsze-formy-przemocy-ktorych-polacy/cb2qr5r", "date_published": "2022-12-21 09:06:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Czym jest inflacja i w jaki sposób może ona wpływać na wysokość raty kredytowej?", "description": "Rosnące ceny towarów i usług nie pozostawiają złudzeń – inflacja w Polsce jest jedną z najwyższych wśród państw Unii Europejskiej. Niemal przyzwyczailiśmy się do sytuacji, w której z dnia na dzień rosną ceny podstawowych produktów spożywczych. Średnioroczna inflacja w 2022 r. wynosi 15,6 proc., przez co zaczyna być coraz bardziej zauważalna przez samych konsumentów.", "link": "https://businessinsider.com.pl/poradnik-finansowy/kredyty/czym-jest-inflacja-i-w-jaki-sposob-moze-ona-wplywac-na-wysokosc-raty-kredytowej/dyy1h70", "date_published": "2022-12-21 09:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Urzędnicy fiskusa coraz skuteczniejsi. Nowe narzędzia robią swoje", "description": "W 9 miesięcy urzędnicy skarbówki wykryli 127,5 tys. fikcyjnych faktur. Oszustom coraz trudniej przebrnąć przez zabezpieczenia fiskusa. – W mojej ocenie, nowe narzędzia fiskusa, w tym JPK_VAT, Mechanizm Podzielonej Płatności, system STIR, system SENT, a także zaostrzenie przepisów karnych wpłynęły z pewnością na podwyższenie świadomości społecznej co do samego zjawiska tzw. fikcyjnych faktur – mówi prof. Adam Mariański, przewodniczący Komisji Podatkowej BCC i prezes Polskiego Instytutu Analiz Prawno-Ekonomicznych.", "link": "https://businessinsider.com.pl/finanse/urzednicy-fiskusa-coraz-skuteczniejsi-nowe-narzedzia-robia-swoje/px41rt9", "date_published": "2022-12-21 08:42:38+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Czym są obligacje i w jaki sposób można w nie zainwestować?", "description": "Wiele osób, decydując się na oszczędzanie lub inwestowanie pieniędzy, ma do wyboru dość duży wachlarz możliwości instrumentów finansowych. Jednym z nich są obligacje. Dzieli się je na wiele rodzajów, a kupno każdego z nich obarczone jest różnym stopniem ryzyka. Czym są obligacje i jak można w nie zainwestować? Które z nich będą najkorzystniejsze?", "link": "https://businessinsider.com.pl/poradnik-finansowy/oszczedzanie/czym-sa-obligacje-i-w-jaki-sposob-mozna-w-nie-zainwestowac/w28srwx", "date_published": "2022-12-21 08:30:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Wybuch granatnika w gabinecie Komendanta Głównego Policji. Jakie kary przewiduje prawo?", "description": "W środę w ubiegłym tygodniu doszło do wybuchu granatnika w gabinecie Komendy Głównej Policji. Wskutek zdarzenia ucierpiał sam Komendant Główny Policji generalny inspektor Jarosław Szymczyk oraz jeden pracownik cywilny. Prokuratura wszczęła śledztwo, a komendantowi przyznano status osoby poszkodowanej. Sprawdziliśmy, co mówi prawo i jakie są kary w podobnych przypadkach.", "link": "https://businessinsider.com.pl/prawo/wybuch-granatnika-w-gabinecie-komendanta-glownego-policji-jakie-kary-przewiduje-prawo/xnl2q9n", "date_published": "2022-12-21 08:29:02+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Nie przybywa już mocno osób korzystających z wakacji kredytowych. Oto najnowsze dane", "description": "Do 27 listopada 2022 r. banki zaraportowały do bazy Biura Informacji Kredytowej 1,07 mln rachunków kredytów mieszkaniowych objętych wakacjami kredytowymi, hipoteki te opiewają na 270 mld zł. Dane te wskazują, że liczba beneficjentów programu już istotnie nie rośnie. Kto miał zawiesić płatność rat, zrobił to już wcześniej.", "link": "https://businessinsider.com.pl/finanse/nie-przybywa-juz-mocno-osob-korzystajacych-z-wakacji-kredytowych-oto-najnowsze-dane/2xxsdh0", "date_published": "2022-12-21 08:21:08+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kurs dolara 21 grudnia w okolicach 4,4 zł", "description": "Kurs dolara w okolicach 4,4 zł. W środę rano 21 grudnia 2022 r. kurs USD/PLN wynosi 4,3972.", "link": "https://businessinsider.com.pl/gielda/kursy-walut/kurs-dolara-usdpln-notowania-walut-20-grudnia-2022/909cpve", "date_published": "2022-12-21 08:14:52+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kurs euro 21 grudnia poniżej 4,7", "description": "Kurs euro poniżej 4,7 zł. W środę rano 21 grudnia 2022 r. kurs EUR/PLN wynosił 4,6729 zł.", "link": "https://businessinsider.com.pl/gielda/kursy-walut/kurs-euro-eurpln-notowania-walut-21-grudnia-2022/l1dp2ne", "date_published": "2022-12-21 08:13:02+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kurs franka 21 grudnia w okolicach 4,75 zł", "description": "Frank szwajcarski w okolicach 4,75 zł. W środę rano 21 grudnia 2022 r. kurs tej waluty wobec polskiego złotego wynosi 4,7432.", "link": "https://businessinsider.com.pl/gielda/kursy-walut/kurs-franka-frank-szwajcarski-chfpln-21-grudnia-2022/qcxfhyw", "date_published": "2022-12-21 08:11:04+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Zełenski wyruszył do USA. Internauci zwracają uwagę na samolot w Polsce", "description": "Prezydent Ukrainy Wołodymyr Zełenski poinformował w środę, że wyruszył w podróż do Stanów Zjednoczonych, a celem wizyty jest wzmocnienie zdolności obronnych jego kraju. Zełenski potwierdził, że w trakcie wizyty spotka się z prezydentem Joe Bidenem. Internauci tymczasem próbują ustalić trasę przelotu i wskazują na amerykański samolot pod Rzeszowem.", "link": "https://businessinsider.com.pl/wiadomosci/zelenski-wyruszyl-do-usa-internauci-zwracaja-uwage-na-samolot-w-polsce/6h672rq", "date_published": "2022-12-21 07:23:36+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "\"Sylwestra Marzeń\" zasponsoruje Orlen", "description": "Nadal nie wiadomo, kto będzie główną gwiazdą tegorocznego Sylwestra Telewizji Polskiej w Zakopanem. Wiadomo natomiast, że głównym sponsorem imprezy ponownie został PKN Orlen — informuje serwis wirtualnemedia.pl.", "link": "https://businessinsider.com.pl/biznes/sylwestra-marzen-zasponsoruje-orlen/snbnl8d", "date_published": "2022-12-21 07:22:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Co to jest dropshipping?", "description": "Sklepy dropshippingowe to światowy trend w dziedzinie e-commerce. Dropshipping stanowi łatwy sposób na zarabianie pieniędzy w internecie. Dzięki niemu osoby, które chcą założyć swój sklep internetowy, mogą go prowadzić z dowolnego miejsca na Ziemi. Ponadto nie muszą inwestować w asortyment ani martwić się o wysyłkę sprzedanych towarów. Co to jest dropshipping? Na czym polega to rozwiązanie? Dropshipping – jak zacząć na nim zarabiać?", "link": "https://businessinsider.com.pl/twoje-pieniadze/praca/dropshipping-co-to-jest-na-czym-polega-i-z-jakimi-kosztami-sie-wiaze/2pjfj7e", "date_published": "2022-12-21 07:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Zełenski leci do Waszyngtonu, Ukraina dostanie Patrioty", "description": "Prezydent Ukrainy Wołodymyr Zełenski leci do Waszyngtonu, gdzie spotka się z prezydentem USA Joe Bidenem. Wystąpi na konferencji prasowej oraz przed Kongresem, który głosuje właśnie nad nowym budżetem USA, w którym mają się znaleźć środki dla Ukrainy. Podczas wizyty ogłoszony zostanie też pakiet pomocy wojskowej o wartości 2 mld dol., obejmujący m.in. baterię systemu przeciwlotniczego i przeciwrakietowego Patriot.", "link": "https://businessinsider.com.pl/wiadomosci/zelenski-leci-do-waszyngtonu-ukraina-dostanie-patrioty/ypcbxkz", "date_published": "2022-12-21 06:52:23+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Większość Ukraińców zadowolonych z pracy w Polsce. Rośnie jednak grupa rozczarowanych", "description": "To, co doskwiera także Polakom, czyli rosnące koszty życia, coraz bardziej nie podoba się pracującym tu Ukraińcom. Do tego dochodzić mają rozbieżności między dostępnymi wakatami a oczekiwaniami pracowników ze Wschodu. Wciąż jednak to zadowoleni z pracy nad Wisłą są zdecydowaną większością.", "link": "https://businessinsider.com.pl/twoje-pieniadze/praca/rosnie-grupa-ukraincow-rozczarowanych-praca-w-polsce-oto-co-im-doskwieta/7sz62l6", "date_published": "2022-12-21 06:43:53+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Wiceminister finansów o \"wyborczych cukierkach\" PiS", "description": "Wiceminister finansów Artur Soboń był pytany o przedwyborcze obietnice PiS. Nie wykluczył nowych transferów budżetowych, ale przekonywał, że jego partia zaproponuje tylko możliwe do realizacji rozwiązania.", "link": "https://businessinsider.com.pl/gospodarka/wiceminister-finansow-o-wyborczych-cukierkach-pis/6sqy5zn", "date_published": "2022-12-21 06:33:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "\"Zrezygnuję, jak znajdę wystarczająco głupiego\". Musk reaguje na wyniki ankiety", "description": "Zamieszania z Twitterem ciąg dalszy. Po tym, jak w ankiecie Elona Muska większość opowiedziała się za tym, że powinien ustąpić z szefowania Twitterowi, ten deklaruje, że słowa dotrzyma. Zrobi to jednak dopiero wtedy, gdy znajdzie kogoś \"wystarczająco głupiego\".", "link": "https://businessinsider.com.pl/firmy/zrezygnuje-jak-znajde-wystarczajaco-glupiego-musk-reaguje-na-wyniki-ankiety/1kc3esg", "date_published": "2022-12-21 06:20:09+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Władze spółek Skarbu Państwa hojnie dotują PiS", "description": "Wydłuża się lista menedżerów spółek Skarbu Państwa, wspierających finansowo partię rządzącą — pisze środowa \"Rzeczpospolita\". Wśród nich są m.in. wiceprezes \"Bogdanki\", wiceprezes Enei i wiceprezes banku Pekao. Wpłaty na rzecz PiS dokonał też szef Orlenu Daniel Obajtek.", "link": "https://businessinsider.com.pl/biznes/wladze-spolek-skarbu-panstwa-hojnie-dotuja-pis/n5qqk3f", "date_published": "2022-12-21 06:10:37+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Pierwszy od ponad dwóch lat spadek cen w Polsce. Na razie tych w produkcji", "description": "Mamy pierwszy od ponad dwóch lat spadek cen w polskiej gospodarce. Wprawdzie tych producenckich, a nie detalicznych, no ale od czegoś trzeba zacząć. Wciąż nie chcą niestety spadać ceny artykułów rolnych w skupach. Za to dane o produkcji przemysłowej i płacach w listopadzie wypadły lepiej od oczekiwań ekonomistów. Dane statystyczne o wynagrodzeniach niejako potwierdza Biedronka, zapowiadając kilkunastoprocentowe podwyżki płac dla swoich pracowników. A na świecie coraz lepiej wyglądają notowania złota. Oto pięć najciekawszych wydarzeń w gospodarce teraz.", "link": "https://businessinsider.com.pl/gospodarka/piec-najciekawszych-wydarzen-w-gospodarce-teraz-21122022/0mey3r1", "date_published": "2022-12-21 05:54:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Można zarobić 10,5 tys. zł, ale klienci bywają upiorni. Kurierzy powiedzieli nam, jak wygląda ich praca przed świętami", "description": "Okres świąteczny to z jednej strony okazja do większego zarobku dla kurierów, a z drugiej czas pośpiechu i niekiedy niemiłych spotkań z klientami. Np. z tymi, którzy zamówili paczki \"za pobraniem\".", "link": "https://businessinsider.com.pl/wiadomosci/mozna-zarobic-105-tys-zl-ale-nie-ma-kiedy-sie-wysikac-kurierzy-mowia-jak-wyglada/gymesf7", "date_published": "2022-12-21 05:42:48+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Prawie połowa rodziców nie jest w stanie odkładać na przyszłość swoich dzieci", "description": "Co czwarty ankietowany jest w stanie zaspokoić tylko podstawowe potrzeby dziecka. Cześć rodziców zadłuża się, by zaspokoić potrzeby albo marzenia dzieci. W najtrudniejszej sytuacji są ci, którzy z rodzicielstwem mierzą się w pojedynkę.", "link": "https://businessinsider.com.pl/twoje-pieniadze/prawie-polowa-rodzicow-nie-jest-w-stanie-odkladac-na-przyszlosc-swoich-dzieci/ghk24ed", "date_published": "2022-12-21 05:41:07+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Inżynier w mediach. To on był twórcą potęgi TVN", "description": "Handlował chipsami i futrami. Biznes życia założył w wieku 47 lat. Mariusz Walter zapisze się w historii polskich mediów. — Wybrałem dobrze, bo szczęśliwie spędziłem swoje zawodowe życie – mówił w jednym z wywiadów. Na środę 21 grudnia zaplanowano jego pogrzeb.", "link": "https://businessinsider.com.pl/biznes/pogrzeb-mariusza-waltera-jak-inzynier-stworzyl-medialna-potege/v4eny87", "date_published": "2022-12-21 05:29:18+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Daniel Obajtek broni fuzji. Mówimy \"sprawdzam\" i rozliczamy jego odpowiedzi", "description": "Fuzja Orlenu i Lotosu, a zwłaszcza sprzedaż części Rafinerii Gdańskiej, budzą coraz więcej wątpliwości. Aby zmierzyć się z ostatnimi zarzutami, Daniel Obajtek zamieścił w internecie nagranie z dłuższej wymiany zdań, jaką odbył z dziennikarzami. W rozmowie padają zarzut dotyczące tego, że reporterzy nie wiedzą co to \"rafineria processingowa\", że we Francji media nie atakują Saudyjczyków, a cała fuzja została zaakceptowana przez wszystkie służby, a nawet przez Komisję Europejską. Czy obrona jest skuteczna? Prześwietlamy ją krok po kroku.", "link": "https://businessinsider.com.pl/gospodarka/daniel-obajtek-broni-fuzji-mowimy-sprawdzam-i-rozliczamy-jego-odpowiedzi/1wmk34h", "date_published": "2022-12-21 05:18:58+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Dokumenty podatkowe Donalda Trumpa staną się jawne", "description": "Kongres zdecydował, że ujawni dokumenty podatkowe byłego prezydenta Stanów Zjednoczonych. Donald Trump, w odróżnieniu od swoich poprzedników oraz następcy — i mimo składanych obietnic — nigdy ich nie podał do wiadomości publicznej.", "link": "https://businessinsider.com.pl/wiadomosci/dokumenty-podatkowe-donalda-trumpa-stana-sie-jawne/7s33k6n", "date_published": "2022-12-21 05:16:48+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Nie tylko granatniki przeciwpancerne. Takie prezenty otrzymują szefowie polskich służb", "description": "Szef Komendy Głównej Policji otrzymał w prezencie od ukraińskich służb dwa granatniki przeciwpancerne, które miały być zużyte i przerobione na przedmioty dekoracyjne. To dość nietypowy podarek, którego szef polskiej policji nie zgłosił do rejestru korzyści. Być może nie musiał, jeśli jego wartość oszacowano na mniejszą, niż wymaga obowiązek informacyjny. Inni szefowie polskich służb różnie podchodzą do tematu. Niektórzy skrupulatnie wyliczają otrzymane zegarki, szable, sztućce i pióra. Pozostali z kolei twierdzą, że nie otrzymują prezentów lub wcale nie składają oświadczeń.", "link": "https://businessinsider.com.pl/finanse/nie-tylko-granatniki-przeciwpancerne-takie-prezenty-otrzymuja-szefowie-polskich-sluzb/jxe1zdj", "date_published": "2022-12-21 05:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]