[{"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Tom Cruise Releases Footage Of ‘Most Dangerous’ Stunt He’s Ever Attempted For New ‘Mission: Impossible’ Film", "description": "Legendary actor Tom Cruise gave fans a behind-the-scenes look at how he executed what he called &#8220;the most dangerous&#8221; stunt that he&#8217;s ever attempted for the newest film in the Mission Impossible movie franchise. The clip that Cruise shared on social media previews a stunt from his upcoming summer 2023 movie &#8220;Mission: Impossible — Dead ...", "link": "https://www.dailywire.com/news/tom-cruise-releases-footage-of-most-dangerous-stunt-hes-ever-attempted-for-new-mission-impossible-film", "date_published": "2022-12-21 23:05:35+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Colorado Nurse Accused Of Drugging, Sexually Assaulting And Recording Lewd Images Of Unconscious Patients For Ten Years", "description": "A class action lawsuit alleges a registered nurse at a Colorado hospital drugged and sexually assaulted possibly thousands of intensive care unit patients and took lewd photos and videos without their consent for at least ten years. Christopher Lambros, 61, reportedly was hit with the lawsuit filed Tuesday by Denver civil rights law firm Rathod ...", "link": "https://www.dailywire.com/news/colorado-nurse-accused-of-drugging-sexually-assaulting-and-recording-lewd-images-of-unconscious-patients-for-ten-years", "date_published": "2022-12-21 22:43:41+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "FedEx Truck Driver Charged With Murdering Young Girl Now Faces Child Sex Charges In Separate Case: Report", "description": "The FedEx driver accused of brutally murdering a 7-year-old Texas girl was hit with new charges this week for allegedly sexually assaulting a minor. Prosecutors charged Tanner Horner, 31, earlier this month for allegedly murdering Athena Strand. He&#8217;s now been charged with three counts of sexual assault on a child in a separate case, FOX ...", "link": "https://www.dailywire.com/news/fedex-truck-driver-charged-with-murdering-young-girl-now-faces-child-sex-charges-in-separate-case-report", "date_published": "2022-12-21 22:17:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "George Soros Funding Criminal Justice Reform Plants In Legacy Media", "description": "Democratic megadonor George Soros will pay journalists anywhere from $63,000 to $85,000 to advance progressive criminal justice reform. Soros is offering media fellowships, or “Soros Justice Fellowships,” through his nonprofit: the Open Society Foundations (OSF). Fellows must produce projects that align with Soros’ goals of reducing incarceration rates and sentencing guidelines. Media fellowships last 12 ...", "link": "https://www.dailywire.com/news/george-soros-funding-criminal-justice-reform-plants-in-legacy-media", "date_published": "2022-12-21 22:10:48+00:00", "persistent": true, "user": "rumpel", "language": "en-US", "tags": ["george soros"]}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "BREAKING: Former Top FTX Executives Plead Guilty To Federal Charges In Fraud Case", "description": "Two former top executives at FTX have reportedly pleaded guilty to federal charges and are cooperating in the criminal fraud case against disgraced founder and former CEO Sam Bankman-Fried. &#8220;I&#8217;m announcing that the Southern District of New York has filed charges against Caroline Ellison, the former CEO of Alameda Research, and Gary Wang, a co-founder ...", "link": "https://www.dailywire.com/news/breaking-former-top-ftx-executives-plead-guilty-to-federal-charges-in-fraud-case", "date_published": "2022-12-21 21:36:02+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "U.S. Law Enforcement Takes Sam Bankman-Fried Into Custody: Report", "description": "U.S. law enforcement officials took disgraced FTX founder Sam Bankman-Fried into custody on Wednesday to face criminal charges stemming from the collapse of the company. The Wall Street Journal reported that Bankman-Fried was being flown to New York to face the charges in the Justice Department&#8217;s Southern District of New York. FTX filed for bankruptcy ...", "link": "https://www.dailywire.com/news/u-s-law-enforcement-takes-sam-bankman-fried-into-custody-report", "date_published": "2022-12-21 21:04:22+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘January 6th Was Pelosi’s Fault’: House Republicans’ Investigative Report Unveils Counter Narrative Of U.S. Capitol Riot", "description": "Text messages and emails from House Speaker Nancy Pelosi&#8217;s (D-CA) office reveal her staff held regular meetings discussing security detail, helped edit authorities’ plans, and turned down several requests from federal law enforcement needed to protect the United States Capitol on January 6, 2021. Reps. Jim Banks (R-IN), Rodney Davis (R-IL), Troy Nehls (R-TX), Jim Jordan ...", "link": "https://www.dailywire.com/news/january-6th-was-pelosis-fault-house-republicans-investigative-report-unveils-counter-narrative-of-u-s-capitol-riot", "date_published": "2022-12-21 20:29:42+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Toyota CEO Akio Toyoda: ‘Silent Majority’ Of Automakers Not Fully Sold On Electric Vehicles", "description": "The head of the world&#8217;s largest automaker said this week that he remains skeptical of trying to move to only producing electric vehicles and that the majority of people who work in the auto industry agree with him. Toyota Motor chief Akio Toyoda made the remarks while speaking to reporters during a visit to Thailand. ...", "link": "https://www.dailywire.com/news/toyota-ceo-akio-toyoda-silent-majority-of-automakers-not-fully-sold-on-electric-vehicles", "date_published": "2022-12-21 19:52:18+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Texas Federal Judge Rules Against Title X Allowing Teens To Get Birth Control Without Telling Parents", "description": "A judge in Texas ruled Tuesday against a program that allowed teenagers to get birth control without telling their parents.  U.S. District Judge Matthew Kacsmaryk issued a ruling stating that the Title X program violates the rights of parents, as well as state code. Kacsmaryk used to work as a religious liberty lawyer who assisted in ...", "link": "https://www.dailywire.com/news/texas-federal-judge-rules-against-title-x-allowing-teens-to-get-birth-control-without-telling-parents", "date_published": "2022-12-21 19:08:36+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "GOP Congressman-Elect Getting Heat Over Résumé Fraud Allegations", "description": "George Santos, a Republican who was just elected to Congress to represent New York, is battling allegations that he misrepresented himself on the campaign trail. Santos&#8217; résumé contains claims about his education and employment history that are either unsupported by evidence or contradicted by it, according to a Monday report from The New York Times and corroborating ...", "link": "https://www.dailywire.com/news/gop-congressman-elect-getting-heat-over-resume-fraud-allegations", "date_published": "2022-12-21 18:18:40+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "The ‘All Ages’ Christmas Drag Show Is Demented And Perverted", "description": "Editor’s Note: The following contains graphic imagery that is sexual in nature. Viewer discretion is advised.  Have you heard about this &#8220;all ages&#8221; drag queen Christmas show that is currently on a national tour? It could be coming to a city near you — it has 36 shows in 18 different states, as well as ...", "link": "https://www.dailywire.com/news/the-all-ages-christmas-drag-show-is-demented-and-perverted", "date_published": "2022-12-21 18:12:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Democratic Hispanic Business Leader Discusses Migrant Crisis: ‘The Democrats Are Going To Make A Republican Out Of Me’", "description": "A Democratic business leader discussed the migrant crisis, saying that Hispanic business owners “are screaming at the top of their lungs” about illegal migration and what will happen if Title 42 ends.  Javier Palomarez, the president of the U.S. Hispanic Business Council (USHBC), spoke to Fox News’ &#8220;America Reports&#8221; on Wednesday. Palomarez discussed the issues ...", "link": "https://www.dailywire.com/news/democratic-hispanic-business-leader-discusses-migrant-crisis-the-democrats-are-going-to-make-a-republican-out-of-me", "date_published": "2022-12-21 18:06:02+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Once In A Generation’ Winter Storm Expected To Affect Most Of U.S., Midwest Likely To Be Hardest Hit", "description": "A &#8220;once in a generation&#8221; winter storm expected to sweep across the country this week has several states declaring emergencies in preparation. The emergency declarations come as a massive winter storm is expected to cover most of the United States, producing deep snowfalls and dangerously cold temperatures that are expected to cripple holiday travel. &#8220;A ...", "link": "https://www.dailywire.com/news/once-in-a-generation-winter-storm-expected-to-affect-most-of-u-s-midwest-likely-to-be-hardest-hit", "date_published": "2022-12-21 18:04:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Get Over It!’: James Cameron Laughs Off Decision That Cost Matt Damon $250 Million", "description": "Director James Cameron laughed off a recent question about actor Matt Damon and his claim that turning down a role in the first &#8220;Avatar&#8221; film cost him millions. &#8220;When was the last time you had a conversation with Matt Damon?&#8221; a BBC radio interviewer asked Cameron, who was promoting &#8220;Avatar: The Way of Water&#8221; — ...", "link": "https://www.dailywire.com/news/get-over-it-james-cameron-laughs-off-decision-that-cost-matt-damon-250-million", "date_published": "2022-12-21 18:00:57+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Wednesday Afternoon Update: Zelensky In D.C., $1.7 Trillion Omnibus Advances, DEA Seized Enough Fentanyl To Kill Every American In 2022", "description": "This article is a companion piece to today’s Morning Wire Afternoon Update. To listen to the podcast version, click here. Biden Administration Sending More Assistance To Ukraine The Biden administration announced today it is sending $1.85 billion in aid to Ukraine comprised of $1 billion in military equipment and $850 million in funding. The announcement came ...", "link": "https://www.dailywire.com/news/wednesday-afternoon-update-zelensky-in-d-c-1-7-trillion-omnibus-advances-dea-seized-enough-fentanyl-to-kill-every-american-in-2022", "date_published": "2022-12-21 17:50:22+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Chick-Fil-A Owner Fined, Had To Give Back Pay For Giving Workers Food Vouchers Instead Of Pay", "description": "A Chick-fil-A owner in North Carolina had to pay back workers and was fined more than $6,000 after violating several child labor and minimum wage rules. On Monday, the Department of Labor reportedly released a report saying that the Chick-fil-A site in Hendersonville, North Carolina, permitted three employees who were minors to work, unload, or ...", "link": "https://www.dailywire.com/news/chick-fil-a-owner-fined-had-to-give-back-pay-for-giving-workers-food-vouchers-instead-of-pay", "date_published": "2022-12-21 17:44:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "FBI Responds To ‘Twitter Files’", "description": "The FBI defended its actions in the face of fierce criticism rising from &#8220;The Twitter Files,&#8221; which revealed contacts between the bureau and Twitter executives. The statement comes after one disclosure showed the FBI repeatedly warned Twitter employees about foreign election interference campaigns, after which the bombshell story about Hunter Biden’s laptop from the New York ...", "link": "https://www.dailywire.com/news/fbi-responds-to-twitter-files", "date_published": "2022-12-21 17:40:38+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "House Bill Would Let January 6 Suspects Move Trials Out Of D.C. For A Jury Of Their Peers", "description": "A bill introduced by a Republican congressman would allow January 6 defendants and other out-of-towners the right to move the trial out of the 92% Democrat jurisdiction in order to secure a jury of their peers.", "link": "https://www.dailywire.com/news/house-bill-would-let-january-6-suspects-move-trials-out-of-d-c-for-a-jury-of-their-peers", "date_published": "2022-12-21 16:56:57+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Vox Writer Slams RBG ‘Arrogance,’ Says Kagan And Sotomayor Should Take One For The Team And Retire", "description": "Vox writer Ian Millhiser slammed late Supreme Court Justice Ruth Bader Ginsburg&#8217;s &#8220;arrogance&#8221; and called on sitting Justices Elena Kagan and Sonia Sotomayor to consider retiring rather than risk the possibility of an unfavorable Senate makeup later. &#8220;Sotomayor and Kagan need to think about retiring,&#8221; the headline read, and the sub-headline added the reason for ...", "link": "https://www.dailywire.com/news/vox-writer-slams-rbg-arrogance-says-kagan-and-sotomayor-should-take-one-for-the-team-and-retire", "date_published": "2022-12-21 16:52:36+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Biden Admin Sending ‘Busloads’ Of Illegal Aliens To Tennessee, Governor Says", "description": "Tennessee Republican Governor Bill Lee said Tuesday that he had been informed by Immigration and Customs Enforcement (ICE) that the agency would be transporting &#8220;multiple busloads” of illegal aliens to the Volunteer State to await trial.  Lee said the agency informed him on Monday and called the move “irresponsible.” It is unclear where the detainees ...", "link": "https://www.dailywire.com/news/biden-admin-sending-busloads-of-illegal-aliens-to-tennessee-governor-says", "date_published": "2022-12-21 16:33:44+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Oprah Winfrey Sparks Online Debate After Suggesting Gift That Costs ‘Like A Hundred And Some Dollars’", "description": "Oprah Winfrey has ignited debate after suggesting a Christmas gift that costs “like a hundred and some dollars,” then appearing surprised when the person to whom she made the suggestion balked at the price. The 68-year-old former talk show host appeared in a TikTok in which a stranger asks her for a gift idea for his ...", "link": "https://www.dailywire.com/news/oprah-winfrey-sparks-online-debate-after-suggesting-gift-that-costs-like-a-hundred-and-some-dollars", "date_published": "2022-12-21 16:24:18+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "2020 Election Lawsuit In Georgia’s Fulton County Gets New Lease On Life", "description": "A lawsuit in Fulton County, Georgia, seeking a review of absentee ballots from the 2020 election in search of fraud is still alive and kicking. The case, which was dismissed by a judge in October 2021 and had been working its way through the justice system, is now being sent back to the appeals court ...", "link": "https://www.dailywire.com/news/2020-election-lawsuit-in-georgias-fulton-county-gets-new-lease-on-life", "date_published": "2022-12-21 16:22:18+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "The Left’s Big Pitch: Embrace A Worse Life In The Name Of Equality", "description": "This week, The New York Times released a long expose of the shortcomings of the United Kingdom’s National Health Service. Long cherished as a crown jewel of Left-wing governmental policy, the NHS has been plagued by massive resource shortcomings, requiring rationing of critical infrastructure and care. Now, citizens are waiting up to twelve hours for ...", "link": "https://www.dailywire.com/news/the-lefts-big-pitch-embrace-a-worse-life-in-the-name-of-equality", "date_published": "2022-12-21 16:19:11+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Secret EU Document Revealed Plans Undermining Israeli Control Of Biblical Areas", "description": "A secret document from the European Union, an organization that has supported Palestinian efforts to take control of parts of Judea and Samaria that are legally under Israeli control, was revealed this week. According to Israel National News, the document indicates the EU will attempt to map land in order “to prove Palestinian Arab rights ...", "link": "https://www.dailywire.com/news/secret-eu-document-revealed-plans-undermining-israeli-control-of-biblical-areas", "date_published": "2022-12-21 16:16:01+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "How Bad Is The Border? DEA Agents Seized Enough Fentanyl To Kill Every American In 2022", "description": "President Joe Biden and &#8220;Border Czar&#8221; Vice President Kamala Harris couldn&#8217;t care less about the southern U.S. border. But the crisis at the border has exploded as a federal court has ruled that a statute deployed by former President Donald Trump &#8212; Title 42, which gives the government the power to shut down the border ...", "link": "https://www.dailywire.com/news/how-bad-is-the-border-dea-agents-seized-enough-fentanyl-to-kill-every-american-in-2022", "date_published": "2022-12-21 16:02:47+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Season’s Greetings From The Swamp: Support Our $1.7 Trillion Omnibus Bill, Pay Your Taxes, And Kick Rocks, America", "description": "Happy holidays, America, now support The Uniparty&#8217;s massive $1.7 trillion spending bill, pay your taxes, and kick rocks. That&#8217;s the message from our elder statesmen in Washington, D.C. these days. You&#8217;ve spent your whole year working hard, getting taxed out the wazoo, and for what? Well, you&#8217;ve been busting your butt at your 9-5 (and ...", "link": "https://www.dailywire.com/news/seasons-greetings-from-the-swamp-support-our-1-7-trillion-omnibus-bill-pay-your-taxes-and-kick-rocks-america", "date_published": "2022-12-21 15:54:45+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Non-Binary’ Artist Arrested By Undercover FBI Agent After Allegedly Trying To Rape 9-Year-Old Boy", "description": "A “non-binary queer” artist was recently arrested for allegedly trying to rape a 9-year-old boy after a series of conversations with undercover FBI agents. According to the Department of Justice, the accused, Efrem Zelony-Mindell, allegedly started communicating on an encrypted messaging site and “repeatedly expressed, in graphic and unambiguous terms, his desire to engage in ...", "link": "https://www.dailywire.com/news/non-binary-artist-arrested-by-undercover-fbi-agent-after-allegedly-trying-to-rape-9-year-old-boy", "date_published": "2022-12-21 15:42:05+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "John Mayer Says He Doesn’t ‘Date That Much,’ Addresses Past ‘Womanizer’ Label", "description": "Singer John Mayer said he doesn&#8217;t &#8220;date that much&#8221; anymore and addressed his past &#8220;womanizer&#8221; label, shutting down the idea he was ever into something that wasn&#8217;t long-term. During the 45-year-old&#8217;s appearance on the &#8220;Call Her Daddy&#8221; podcast, host Alex Cooper asked Mayer about his past relationships. &#8220;Dating is no longer a codified activity for ...", "link": "https://www.dailywire.com/news/john-mayer-says-he-doesnt-date-that-much-addresses-past-womanizer-label", "date_published": "2022-12-21 15:22:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "$1.7 Trillion Omnibus Bill Would Invest Half A Billion Into ‘Family Planning,’ Threats To Biodiversity", "description": "Packed inside the $1.7 trillion 4,155-page omnibus bill congressional leaders advanced in the Senate on Tuesday reads a feature that would fund half a billion dollars into &#8220;family planning/reproductive health,&#8221; including in areas where population growth &#8220;threatens biodiversity.&#8221; Senate leaders advanced the massive spending bill 70-25 Tuesday night, expecting the House to vote on it ...", "link": "https://www.dailywire.com/news/1-7-trillion-omnibus-bill-would-invest-half-a-billion-into-family-planning-threats-to-biodiversity", "date_published": "2022-12-21 15:14:09+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Singer Meghan Trainor Wants 4 Kids, Said It’s Her ‘Dream’ To Get Pregnant Again In 2023", "description": "Singer Meghan Trainor is excited to grow her family again, she said recently, and hopes to one day have four kids total. The 28-year-old pop star told People that one of her &#8220;goals&#8221; for 2023 is to get pregnant again. She and her husband Daryl Sabara currently share a son, 1-year-old Riley. When the interviewer ...", "link": "https://www.dailywire.com/news/singer-meghan-trainor-wants-4-kids-said-its-her-dream-to-get-pregnant-again-in-2023", "date_published": "2022-12-21 15:08:25+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Horrifying Video Shows Moment Cop Shot And Killed Homeowner Protecting His House From Suspected Intruder: ‘It Wasn’t Me’", "description": "Surveillance video and police bodycam footage show the moments before and after Austin, Texas, police shot and killed 33-year-old tech entrepreneur Rajan Moonesinghe. On November 15, the Austin Police Department received a call shortly after midnight about a man in a robe pointing a rifle down the street in a wealthy neighborhood. The caller, a ...", "link": "https://www.dailywire.com/news/horrifying-video-shows-moment-cop-shot-and-killed-homeowner-protecting-his-house-from-suspected-intruder-it-wasnt-me", "date_published": "2022-12-21 15:05:56+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Social Worker Secretly Gave 13-Year-Old Daughter Chest Binder To Flatten Her Breasts, Mom Tells School Board", "description": "A social worker at a Maine school gave a 13-year-old girl a chest binder and secretly supported her gender transition without informing her parents, the girl&#8217;s mother claims. Earlier this month, mom Amber Lavigne gave an emotional speech to the Central Lincoln County School System school board in southern Maine, claiming a social worker at ...", "link": "https://www.dailywire.com/news/social-worker-secretly-gave-13-year-old-daughter-chest-binder-to-flatten-her-breasts-mom-tells-school-board", "date_published": "2022-12-21 14:57:19+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Dolly Parton Confirms Rumors About Item She’s Placed Under Dollywood That Won’t Be Unveiled Until She’s 99", "description": "Dolly Parton finally confirmed rumors about a time capsule that she&#8217;s placed under her Dollywood theme park that she said won&#8217;t be unveiled until she&#8217;s 99 years old, whether she&#8217;s still alive or not. During the 76-year-old country music icon&#8217;s appearance on &#8220;The Kelly Clarkson Show,&#8221; Parton said that inside the capsule buried beneath the ...", "link": "https://www.dailywire.com/news/dolly-parton-confirms-rumors-about-item-shes-placed-under-dollywood-that-wont-be-unveiled-until-shes-99", "date_published": "2022-12-21 14:15:59+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘True Blood’ Actor Shares Emotional Tribute To Franco Harris: ‘Most Of All, He Was My Friend’", "description": "&#8220;True Blood&#8221; actor Joe Manganiello posted a heartfelt tribute to NFL legend — and friend — Franco Harris, sharing just how much the football great&#8217;s friendship had meant to him over the years. Manganiello, who was born and raised in Pittsburgh, Pennsylvania, said that Harris — a former Steeler — had been instrumental in rallying ...", "link": "https://www.dailywire.com/news/true-blood-actor-shares-emotional-tribute-to-franco-harris-most-of-all-he-was-my-friend", "date_published": "2022-12-21 14:10:49+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "City Of Buffalo Files Lawsuit Against Several Gun Manufacturers Following Mass Shooting", "description": "The city of Buffalo, New York, filed a lawsuit against several gun manufacturers on Tuesday following a mass shooting earlier this year that left 10 people dead. Mayor Byron Brown, a Democrat-turned-independent, said the suit was filed in the state Supreme Court and the defendants include Smith &amp; Wesson, Bushmaster, Colts, Glock, Beretta, and Remington. ...", "link": "https://www.dailywire.com/news/city-of-buffalo-files-lawsuit-against-several-gun-manufacturers-following-mass-shooting", "date_published": "2022-12-21 14:09:49+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘A Crisis This Big…Cannot Be Ignored’: Ex-Democrat Senator Leading Bipartisan Group To The Border", "description": "Arizona Sen. Kyrsten Sinema is organizing a group of Republican and Democrat senators to head to the southern border to examine the nation&#8217;s immigration system. This is one of the biggest moves Sinema has made since ditching her Democrat affiliation to become an Independent. “Part of the problem is that many in Washington have never ...", "link": "https://www.dailywire.com/news/a-crisis-this-bigcannot-be-ignored-ex-democrat-senator-leading-bipartisan-group-to-the-border", "date_published": "2022-12-21 14:01:52+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘No One Loves To Be Harassed’: James Gunn Replies To Haters After Backlash Over ‘Wonder Woman’ Sequel, Henry Cavill Exit", "description": "Director and new DC Studios co-head James Gunn responded on Tuesday to backlash over some of the early decisions that he and fellow co-head Peter Safran had made — namely the decisions not to move ahead with the third installment in the &#8220;Wonder Woman&#8221; franchise and not to bring back actor Henry Cavill as Superman. ...", "link": "https://www.dailywire.com/news/no-one-loves-to-be-harassed-james-gunn-replies-to-haters-after-backlash-over-wonder-woman-sequel-henry-cavill-exit", "date_published": "2022-12-21 13:27:46+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Pork, Parks, And Woke: All The ‘Fun’ Features In $1.7 Trillion Omnibus", "description": "Critics are howling at spending perks and rules littered throughout the $1.7 trillion &#8220;omnibus&#8221; bill meant to fund the federal government for another fiscal year. The legislation was unveiled in the Senate early Tuesday and boasts $858 billion in defense funding as well as $772.5 billion for non-defense &#8220;discretionary programs,&#8221; according to a summary. Time ...", "link": "https://www.dailywire.com/news/pork-parks-and-woke-all-the-fun-features-in-1-7-trillion-omnibus", "date_published": "2022-12-21 13:16:22+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Ghoulish’: Critics Savage Netflix’s ‘The Crown’ Over Reported Scene Showing Princess Diana In Open Casket", "description": "The former chef of Great Britain’s Princess Diana ripped into the Netflix series “The Crown” after it was reported the series will show scenes of Diana&#8217;s open casket. In reality, when public showings and her state funeral occurred in September 1997, Diana&#8217;s coffin was closed while adorned with a royal standard flag. Diana died on August ...", "link": "https://www.dailywire.com/news/ghoulish-critics-savage-netflixs-the-crown-over-reported-scene-showing-princess-diana-in-open-casket", "date_published": "2022-12-21 13:11:58+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Bank Will Fork Over $3.7 Billion After ‘Thousands’ Wrongly Lose Homes And Vehicles", "description": "Wells Fargo will pay $1.7 billion in civil penalties and $2 billion in redress after the bank carried out a number of abuses concerning mortgages and consumer accounts. According to a press release from the Consumer Financial Protection Bureau, the company illegally assessed fees and interest charges on various loans, wrongly repossessed cars, and misapplied ...", "link": "https://www.dailywire.com/news/bank-will-fork-over-3-7-billion-after-thousands-wrongly-lose-homes-and-vehicles", "date_published": "2022-12-21 12:35:14+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Liberal Oscar-Winning Actor Says He Flipped During Pandemic, Defends Unvaxxed, Anti-Lockdown Supporters", "description": "Left-wing Academy Award-winning actor Tim Robbins defended those who oppose vaccine mandates and lockdown measures after admitting he used to feel anger for such people before opening his mind. &#8220;I bought into it,&#8221; Robbins told actor and podcast host Russell Brand. &#8220;I was masking everywhere. I was keeping my social distance. I was adhering to the ...", "link": "https://www.dailywire.com/news/liberal-oscar-winning-actor-says-he-flipped-during-pandemic-defends-unvaxxed-anti-lockdown-supporters", "date_published": "2022-12-21 12:32:32+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "One Of America’s Longest-Running Children’s Theatres Casts Drag-Obsessed Man As Wicked Witch", "description": "NASHVILLE, Tenn. — Kids and parents filled one of America’s oldest continuously operating children’s theatres last weekend for a professional performance of the classic “The Wizard of Oz” — only this showing of L. Frank Baum’s 1900 children’s fantasy contained a spin: a man in drag. As play-goers waited patiently for the performance to start, ...", "link": "https://www.dailywire.com/news/one-of-americas-longest-running-childrens-theatres-casts-drag-obsessed-man-as-wicked-witch", "date_published": "2022-12-21 12:23:24+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Eight Teenage Girls ‘Swarmed’ A Man And Stabbed Him To Death In Toronto, Police Say", "description": "A group of teenage girls, some as young as 13, “swarmed” a man living in a shelter and stabbed him to death, police in Toronto, Canada, say. The victim, a 59-year-old man who had been living in a shelter, has not been identified as police are still notifying his family members. The man was found ...", "link": "https://www.dailywire.com/news/eight-teenage-girls-swarmed-a-man-and-stabbed-him-to-death-in-toronto-police-say", "date_published": "2022-12-21 12:14:15+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘B.S.’: Greg Gutfeld Offers Unique Aromatic Reason For Why Pelosi’s Face Looks Young", "description": "Fox News’ Greg Gutfeld, speaking of the decision by the House January 6 Committee — assembled by House Speaker Nancy Pelosi (D-CA) — to refer former President Trump to the Justice Department for criminal prosecution, targeted Pelosi with a unique reason for her face looking younger than her 82 years. Pelosi has often been accused ...", "link": "https://www.dailywire.com/news/b-s-greg-gutfeld-offers-unique-aromatic-reason-for-why-pelosis-face-looks-young", "date_published": "2022-12-21 12:00:09+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Jimmy Stewart, A World At War, And Why ‘It’s A Wonderful Life’ Was Almost A Little Less Wonderful: Part II", "description": "Months after his return from combat, actor James &#8220;Jimmy&#8221; Stewart was still adrift — unmoored in the Hollywood he had previously called home, living with fellow veteran Henry Fonda, and waiting for film offers that just weren&#8217;t coming in. After a couple of months had gone by, director Frank Capra — who had worked with ...", "link": "https://www.dailywire.com/news/jimmy-stewart-a-world-at-war-and-why-its-a-wonderful-life-was-almost-a-little-less-wonderful-part-ii", "date_published": "2022-12-21 11:48:05+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Sick’: Harry Styles’ Gucci Campaign Draws Ire For Pink Teddy Bear, Child-Sized Mattress Following Balenciaga Debacle", "description": "Harry Styles is facing criticism for a new fashion campaign he did with Gucci that has fans recalling the recent Balenciaga fiasco. The 28-year-old singer is featured in the new campaign that debuted on social media earlier this month.  &#8220;A performance piece starring #HarryStyles and the #GucciHAHAHA collection,&#8221; the brand tweeted of the collaboration. In ...", "link": "https://www.dailywire.com/news/sick-harry-styles-gucci-campaign-draws-ire-for-pink-teddy-bear-child-sized-mattress-following-balenciaga-debacle", "date_published": "2022-12-21 11:46:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Ukraine’s Zelensky To Meet With Biden, Address Congress In First Foreign Trip Since Russian Invasion", "description": "Ukrainian President Volodymyr Zelensky will meet with U.S. President Joe Biden and address a joint session of Congress in Washington, D.C., on Wednesday in a gesture symbolizing the United States’ support of Ukraine in its war against Russia. Zelensky travels to Washington as Congress contemplates sending roughly $45 billion more to Ukraine to support its ...", "link": "https://www.dailywire.com/news/ukraines-zelensky-to-meet-with-biden-address-congress-in-first-foreign-trip-since-russian-invasion", "date_published": "2022-12-21 11:36:45+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Less Friendly Than Fox’: Piers Morgan Suggests Anderson Cooper ‘Backstabbed’ Him While At CNN", "description": "TV host Piers Morgan said this week that he was backstabbed by CNN host Anderson Cooper during his tenure at CNN, adding that the network is &#8220;a lot less friendly&#8221; than Fox News. “I gotta say, and this, you know, people can believe this or not, but I find it a very friendly collegiate place ...", "link": "https://www.dailywire.com/news/less-friendly-than-fox-piers-morgan-suggests-anderson-cooper-backstabbed-him-while-at-cnn", "date_published": "2022-12-21 11:24:37+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Dangerous Incentive’: Twitter Files Journo Tells Ben Shapiro FBI Payments Shaped Twitter Policy", "description": "The FBI’s payment of millions of dollars to Twitter to flag conservative tweets and accounts in the runup to the 2020 presidential election created a “dangerous incentive” for the platform to do the bureau’s bidding, a Twitter Files journalist told Daily Wire Editor Emeritus Ben Shapiro. Author and journalist Michael Shellenberger, one of four people chosen ...", "link": "https://www.dailywire.com/news/dangerous-incentive-twitter-files-journo-tells-ben-shapiro-fbi-payments-shaped-twitter-policy", "date_published": "2022-12-21 11:17:13+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Biden Administration Will Spend Nearly $10 Billion On Electric Vehicles For The Postal Service", "description": "The United States Postal Service announced a plan to spend $9.6 billion over the next five years to transition toward more electric delivery vehicles. Funding for the initiative will come from regular Postal Service budgets and $3 billion from the Inflation Reduction Act, a piece of legislation signed by President Joe Biden to allocate more ...", "link": "https://www.dailywire.com/news/biden-administration-will-spend-nearly-10-billion-on-electric-vehicles-for-the-postal-service", "date_published": "2022-12-21 11:09:19+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Original E.T. Model From Spielberg’s Film Sells At Auction For Massive Amount", "description": "The original model used for E.T. from the cult classic 1982 film sold at auction last weekend for $2.56 million. The mechatronic model of the beloved alien from Steven Spielberg&#8216;s “E.T. the Extra-Terrestrial” was among 1,300 Hollywood artifacts auctioned off at Julien&#8217;s Auctions&#8217; &#8220;Icons and Idols: Hollywood&#8221; event in partnership with Turner Classic Movies, per ...", "link": "https://www.dailywire.com/news/original-e-t-model-from-spielbergs-film-sells-at-auction-for-massive-amount", "date_published": "2022-12-21 11:08:23+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "READ IT: Ex-San Francisco Entrepreneur Provides ‘Translation’ Of Mayor’s ‘Politician-Speak’ About Struggling City", "description": "Technology entrepreneur Joe Lonsdale provided a “translation” of a statement from San Francisco Democratic Mayor London Breed regarding the city’s collapsing tax base and budget woes. Lonsdale attended Stanford University and launched Palantir, a defense software company, before starting venture capital fund 8VC. The libertarian-leaning executive said he moved the company from San Francisco to ...", "link": "https://www.dailywire.com/news/read-it-ex-san-francisco-entrepreneur-provides-translation-of-mayors-politician-speak-about-struggling-city", "date_published": "2022-12-21 10:55:24+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Police Investigating Abandoned White Hyundai Found In Oregon To See If It Is Connected To University Of Idaho Slayings", "description": "Police in Moscow, Idaho, are investigating an abandoned white Hyundai Elantra found in Eugene, Oregon, to see if it is the vehicle they have been searching for in connection to the quadruple homicide of University of Idaho students. Police have been looking for the occupants of a white 2011-2013 Hyundai Elantra that was seen in the ...", "link": "https://www.dailywire.com/news/police-investigating-abandoned-white-hyundai-found-in-oregon-to-see-if-it-is-connected-to-university-of-idaho-slayings", "date_published": "2022-12-21 10:49:56+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Why Boris Becker’s Fail Makes For A Must-See Documentary", "description": "Serial killers are all the rage on podcasts and docuseries like “The Jeffrey Dahmer Files.” We can’t get enough of them. Tales of stars who fall from grace, however, may come in a close second. It’s why the upcoming docuseries on tennis great turned inmate Boris Becker is bound to draw a crowd. Becker, 55, ...", "link": "https://www.dailywire.com/news/why-boris-beckers-fail-makes-for-a-must-see-documentary", "date_published": "2022-12-21 10:47:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Good Grief: McConnell Claims Sending Ukraine Assistance Is ‘Number One Priority’ For Most Republicans", "description": "If you were hoping for Republicans in the Senate to focus on stopping the invasion at the southern border or spending its time exposing deep-state corruption, it would appear that you are out of luck. On Tuesday, Senate Minority Leader Mitch McConnell (R-KY) claimed that the GOP&#8217;s top objective is to provide Ukraine with more assistance ...", "link": "https://www.dailywire.com/news/good-grief-mcconnell-claims-sending-ukraine-assistance-is-number-one-priority-for-most-republicans", "date_published": "2022-12-21 10:47:35+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Packed With Pork: Senate Advances $1.7 Trillion 4,155-Page Bill That No One Read", "description": "The Senate on Tuesday morning put forward a massive spending package to shell out some $1.7 trillion in the next fiscal year. The bill totaled 4,155 pages. By Tuesday evening, the Senate advanced the legislation by a 70-25 vote. So who read it? Well, no one. Certainly not any of the senators. This site says ...", "link": "https://www.dailywire.com/news/packed-with-pork-senate-passes-1-7-trillion-4155-page-bill-that-no-one-read", "date_published": "2022-12-21 10:29:05+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Elizabeth Hurley Blasts British Airways During Extended Delay With ‘No Food Or Water’", "description": "Actress Elizabeth Hurley had some strong words for British Airways after being allegedly stranded at an airport for more than 20 hours following a flight delay. The 57-year-old British star took to Twitter to vent her frustrations over the lack of communication from the airline. She had been traveling from Antigua and got stuck there ...", "link": "https://www.dailywire.com/news/elizabeth-hurley-blasts-british-airways-during-extended-delay-with-no-food-or-water", "date_published": "2022-12-21 09:38:54+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "AOC Slammed Over Tweet On The Minimum Wage", "description": "Rep. Alexandria Ocasio-Cortez (D-NY) was mocked online Tuesday afternoon after she attacked the Republican Party for voting against raising the minimum wage, which some in her party have also opposed. Ocasio-Cortez&#8217;s tweet was in reference to recent statistics that show that the majority of Americans are living paycheck-to-paycheck under the Biden administration. &#8220;60% of workers ...", "link": "https://www.dailywire.com/news/aoc-slammed-over-tweet-on-the-minimum-wage", "date_published": "2022-12-21 09:26:49+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘McCarthy And His Gang Of Flying Monkeys’: Jake Tapper Mocks House Republicans Fighting $1.7 Trillion Omnibus Bill", "description": "CNN’s Jake Tapper mocked House Minority Leader Kevin McCarthy and Republicans in the House over McCarthy’s resistance to the mammoth $1.7 trillion spending bill pushed by the Democratic Party. The Democrats had failed to pass twelve appropriations bills in September, ultimately rolling all of them into one omnibus bill over 4,000 pages long. Control of ...", "link": "https://www.dailywire.com/news/mccarthy-and-his-gang-of-flying-monkeys-jake-tapper-mocks-house-republicans-fighting-1-7-trillion-omnibus-bill", "date_published": "2022-12-21 09:04:42+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "WATCH: Train Flies Off Tracks After Smashing Through Truck Carrying 134-Foot Concrete Beam", "description": "A freight train was derailed in Tennessee this week after it smashed through a tractor-trailer that was carrying a massive concrete beam. The crash happened Tuesday afternoon in the Chattanooga suburb of Collegedale in Hamilton County, according to local media. &#8220;This afternoon, Norfolk Southern train slams into a tractor trailer carrying a 134 foot concrete ...", "link": "https://www.dailywire.com/news/watch-train-flies-of-tracks-after-smashing-through-truck-carrying-134-foot-concrete-beam", "date_published": "2022-12-21 07:47:56+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Franco Harris, NFL Hall of Famer Who Caught ‘Immaculate Reception’ And Won 4 Super Bowls, Dies At 72", "description": "Franco Harris, the NFL Hall of Fame running back who helped the Pittsburgh Steelers win four Super Bowls in the 1970s and caught the so-called “Immaculate Reception,” has died at 72. Harris, who played his college ball at Penn State, began his career with the Steelers in 1972 after being picked in the first round ...", "link": "https://www.dailywire.com/news/franco-harris-nfl-hall-of-famer-who-caught-immaculate-reception-and-won-4-super-bowls-dies-at-72", "date_published": "2022-12-21 07:39:59+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Formula One Bans Drivers From Making Political Statements At Races", "description": "Formula One&#8217;s governing body, the Fédération Internationale de l&#8217;Automobile (FIA), is banning drivers from making political statements at races without prior permission from the group. FIA unveiled the new rule in an article to the International Sporting Code, saying that the following is now a violation of the rules: “The general making and display of ...", "link": "https://www.dailywire.com/news/formula-one-bans-drivers-from-making-political-statements-at-races", "date_published": "2022-12-21 07:33:26+00:00", "persistent": false, "user": null, "language": "en-US"}]