[{"source": "https://feeds.feedburner.com/TheHackersNews", "title": "Raspberry Robin Worm Strikes Again, Targeting Telecom and Government Systems", "description": "The Raspberry Robin worm has been used in attacks against telecommunications and government office systems across Latin America, Australia, and Europe since at least September 2022.\n\"The main payload itself is packed with more than 10 layers for obfuscation and is capable of delivering a fake payload once it detects sandboxing and security analytics tools,\" Trend Micro researcher Christopher So", "link": "https://thehackernews.com/2022/12/raspberry-robin-worm-strikes-again.html", "date_published": "2022-12-21 12:23:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://feeds.feedburner.com/TheHackersNews", "title": "The Rise of the Rookie Hacker - A New Trend to Reckon With", "description": "More zero knowledge attacks, more leaked credentials, more Gen-Z cyber crimes - 2022 trends and 2023 predictions.\nCybercrime remains a major threat to individuals, businesses, and governments around the world. Cybercriminals continue to take advantage of the prevalence of digital devices and the internet to perpetrate their crimes. As the internet of things continues to develop, cybercriminals", "link": "https://thehackernews.com/2022/12/the-rise-of-rookie-hacker-new-trend-to.html", "date_published": "2022-12-21 11:37:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://feeds.feedburner.com/TheHackersNews", "title": "GodFather Android Banking Trojan Targeting Users of Over 400 Banking and Crypto Apps", "description": "An Android banking trojan known as GodFather is being used to target users of more than 400 banking and cryptocurrency apps spanning across 16 countries.\nThis includes 215 banks, 94 crypto wallet providers, and 110 crypto exchange platforms serving users in the U.S., Turkey, Spain, Italy, Canada, and Canada, among others, Singapore-headquartered Group-IB said in a report shared with The Hacker", "link": "https://thehackernews.com/2022/12/godfather-android-banking-trojan.html", "date_published": "2022-12-21 09:16:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://feeds.feedburner.com/TheHackersNews", "title": "Ransomware Hackers Using New Way to Bypass MS Exchange ProxyNotShell Mitigations", "description": "Threat actors affiliated with a ransomware strain known as Play are leveraging a never-before-seen exploit chain that bypasses blocking rules for ProxyNotShell flaws in Microsoft Exchange Server to achieve remote code execution (RCE) through Outlook Web Access (OWA).\n\"The new exploit method bypasses URL rewrite mitigations for the Autodiscover endpoint,\" CrowdStrike researchers Brian Pitchford,", "link": "https://thehackernews.com/2022/12/ransomware-hackers-using-new-way-to.html", "date_published": "2022-12-21 07:41:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://feeds.feedburner.com/TheHackersNews", "title": "Ukraine's DELTA Military System Users Under Attack from Info Stealing Malware", "description": "The Computer Emergency Response Team of Ukraine (CERT-UA) this week disclosed that users of the Delta situational awareness program received phishing emails from a compromised email account belonging to the Ministry of Defense.\nThe attacks, which have been attributed to a threat cluster dubbed UAC-0142, aimed to infect systems with two pieces of data-stealing malware referred to as FateGrab and", "link": "https://thehackernews.com/2022/12/ukraines-delta-military-system-users.html", "date_published": "2022-12-21 07:12:00+00:00", "persistent": false, "user": null, "language": "en-US"}]