[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCHnyfMqiRRG1u-2MsSQLbXA", "title": "We tested the US Military’s secret space weapon", "description": "An engineer came up with a plan to drop tungsten telephone poles from space - the idea has been seriously considered on multiple occasions, so we tested it. This video is sponsored by Brilliant. You can get started for free, or the first 200 people to sign up via https://brilliant.org/veritasium get 20% off a yearly subscription. \n\n\nMassive thanks to Archisand for building such a beautiful sandcastle. https://www.youtube.com/@GregLeBon\nThanks to Inland Empire Film Services and the San Bernardino County Film Office for portions of the video shot in the County of San Bernardino.\n\nHuge thanks to John and Angie Miller for helping us with securing the shooting location and going above and beyond to make this shoot happen – http://highdesertlocations.com/\n\nMassive thanks to Dr David Wright for the interview and providing invaluable guidance during the research for this video.\n\nHere’s a great video about space-based missile defense – https://www.ucsusa.org/resources/space-based-missile-defense-not-good-idea\n\nMassive thanks to Adam Savage for being part of this video\n\nAdditional photos from NASA and ESA\n\n\n▀▀▀\nReferences:\nUSAF. (2003). The US Air Force transformation flight plan.\n\nPreston, R., Johnson, D. J., Edwards, S. J., Miller, M. D., & Shipbaugh, C. (2002). Space weapons earth wars. Rand Corporation.\n\nWright, D., Grego, L., & Gronlund, L. (2005). The physics of space security. A Reference Manual, Cambridge.\n\nDeBlois, B. M., Garwin, R. L., Kemp, R. S., & Marwell, J. C. (2004). Space weapons: crossing the US Rubicon. International Security, 50-84.\n\nBaucom, D. R. (2017). The Rise and Fall of Brilliant Pebbles 1. In United States Military History 1865 to the Present Day (pp. 329-376). Routledge.\n\nHitchens, T., & Samson, V. (2004). Space-based interceptors: still not a good idea. Georgetown journal of international affairs, 21-29.\n\nNational Research Council. (2012). Making sense of ballistic missile defense: An assessment of concepts and systems for US boost-phase missile defense in comparison to other alternatives. National Academies Press.\n\nBorger, J. (2005). Bush likely to back weapons in space. The Guardian, 19.\n\n▀▀▀\nSpecial thanks to: Bernard McGee, James Sanger, Elliot Miller, Brian Busbee, Jerome Barakos M.D., Amadeo Bee, TTST, Balkrishna Heroor, Chris LaClair, John H. Austin Jr., OnlineBookClub.org, Eric Sexton, John Kiehl, Diffbot, Gnare, Dave Kircher, Burt Humburg, Blake Byers, Evgeny Skvortsov, Meekay, Bill Linder, Paul Peijzel, Josh Hibschman, Mac Malkawi, Mike Schneider, John Bauer, Jim Buckmaster, Juan Benet, Sunil Nagaraj, Richard Sundvall, Lee Redden, Stephen Wilcox, Marinus Kuivenhoven, Michael Krugman, Cy 'kkm' K'Nelson, Sam Lutfi\n\n▀▀▀\nWritten by Petr Lebedev, Derek Muller, and Emily Zhang\nFilmed by Trenton Oliver, Derek Muller, Petr Lebedev, Emily Zhang, Raquel Nuno and Eddie Lopez\nAnimation by Mike Radjabov, Fabio Albertelli and Jonny Hyman\nEdited by Trenton Oliver\nSlow Motion Camera: Shawn Sanders and Anthony Corrales\nSandcastle Timelapse by Greg LeBon and Archisand\nPhantom rental from Panny Hire LA\nHelicopter Pilots: Rick Shuster and Cliff Fleming\nHelicopter Safety Officer: Ryan Hosking\nFPV Drone Pilots: Sammie Saing and Josh Ewalt\nProduction Assistants: Roman Bacvic and Eddie Lopez\nIntern: Katie Barnshaw\nAdditional video/photos supplied by Pond5 and Getty Images\nMusic from Epidemic Sound\nProduced by Derek Muller, Petr Lebedev, and Emily Zhang", "link": "https://www.youtube.com/watch?v=J_n1FZaKzF8", "date_published": "2022-12-21 17:56:57+00:00", "persistent": false, "user": null, "language": "en-US"}]