{"entries": [{"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/good-decision-for-them-to-run-russian-forces-retreating-as-ukraines-counteroffensive-sees-success", "title": "‘Good Decision For Them To Run’: Russian Forces Retreating As Ukraine’s Counteroffensive Sees Success", "date_published": "2022-09-10 22:03:05+00:00", "description": "Russia announced Saturday that it is pulling back troops from two areas as Ukraine’s counteroffensive advances in the country’s eastern region. Ukrainian forces have appeared to make successful advances near Kharkiv, the country’s second-largest city, the Associated Press reported. President Volodymyr Zelenszky mocked the Russians after the announcement of a retreat in a video released ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/poll-herschel-walker-increasing-lead-in-georgia-senate-race", "title": "Poll: Herschel Walker Increasing Lead In Georgia Senate Race", "date_published": "2022-09-10 21:38:51+00:00", "description": "A new poll indicates that Georgia GOP candidate Herschel Walker is gaining speed in the Peach Tree State&#8217;s senate race against incumbent Senator Raphael Warnock (D-GA). The poll, conducted by Insider Advantage/Fox 5, shows that Warnock has lost four points since July, while Walker has picked up two points. The former University of Georgia football ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/candace-owens-announces-new-daily-podcast-hints-at-shocking-story-to-be-discussed-in-first-episode", "title": "Candace Owens Announces New Daily Podcast, Hints At Shocking Story To Be Discussed In First Episode", "date_published": "2022-09-10 21:20:04+00:00", "description": "She’s getting a new show and promises to be as fiery as ever. Candace Owens announced that she will begin producing a daily podcast starting Monday with DailyWire+. The show will focus on deep dives, investigations, and exposes, and Owens gave future listeners a hint of what to expect in the show’s shocking first episode, ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/visa-to-categorize-sales-at-gun-stores-in-win-for-gun-control-advocates", "title": "Visa To Categorize Sales At Gun Stores In Win For Gun Control Advocates", "date_published": "2022-09-10 20:33:47+00:00", "description": "Visa announced Saturday that the world’s largest payment processing corporation will begin separately categorizing firearm purchases at gun stores. Gun control activists have encouraged the decision, claiming it will allow for easier tracking of gun sales and help prevent mass shootings, the Associated Press reported. Second Amendment proponents, however, see the move as a dangerous ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/democrat-congressman-claims-republicans-stole-u-s-house-seat-in-texas-by-winning-the-election", "title": "Democrat Congressman Claims Republicans ‘Stole’ U.S. House Seat In Texas By Winning The Election", "date_published": "2022-09-10 19:53:38+00:00", "description": "A Democrat congressman in South Texas engaged in election denialism during an event late this week with House Intelligence Committee chairman Adam Schiff (D-CA), falsely claiming that Republicans &#8220;stole&#8221; a U.S. House seat from a fellow Democrat earlier this year during a special election. Rep. Mayra Flores (R-TX) beat former Rep. Dan Sanchez (D-TX) in ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/german-bishops-fail-to-pass-document-radically-altering-church-teaching-on-sex", "title": "German Bishops Fail To Pass Document Radically Altering Church Teaching On Sex", "date_published": "2022-09-10 18:33:16+00:00", "description": "Liberal Catholic bishops in Germany failed to approve a document changing the Church&#8217;s teachings on sex and sexuality. The 30-page document, entitled “Life in succeeding relationships – The principles of renewed sexual ethics,” was brought to a vote at a meeting of the German Bishops&#8217; Conference&#8217;s &#8220;Synodal Way&#8221; in Frankfurt Thursday. The resolution to approve needed ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/ivy-league-school-will-be-free-for-students-whose-families-make-under-100k", "title": "Ivy League School Will Be Free For Students Whose Families Make Under $100K", "date_published": "2022-09-10 18:07:41+00:00", "description": "One of the country’s most prestigious universities will completely remove tuition and room and board fees for undergraduates of families who make under $100,000 a year. Starting in the fall of 2023, Princeton University will be free for students who fit into the specific income bracket. The New Jersey school announced the new “groundbreaking” financial ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/asians-get-smallest-science-grants-from-government-following-anti-racism-policy-that-deprioritizes-them", "title": "Asians Get Smallest Science Grants From Government Following Anti-Racism Policy That Deprioritizes Them", "date_published": "2022-09-10 16:59:23+00:00", "description": "A study—written by minority researchers funded by National Science Foundation (NSF)—said that NSF was racist because it didn’t give enough funding to minority researchers. The paper called for more anti-racism efforts, even though by far the largest statistical disparity in the study was the low level of funding to Asians, perhaps a result of existing anti-racism policy which says that affirmative action should go to blacks and Hispanics but not Asians.", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/roberts-defends-scotus-after-vp-harris-democrats-attack-courts-legitimacy", "title": "Roberts Defends SCOTUS After VP Harris, Democrats Attack Court’s Legitimacy", "date_published": "2022-09-10 16:20:10+00:00", "description": "Supreme Court Chief Justice John Roberts defended the court from attacks on its legitimacy. Speaking to jurists at the 10th Circuit Bench and Bar Conference in Colorado Springs, Colorado, Roberts pointed out that the nation&#8217;s highest court has always handled controversial cases, and decided some cases that provoked strong reactions from the public. However, Roberts ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/man-accused-of-murdering-eliza-fletcher-charged-in-additional-sexual-assault-case-from-last-year", "title": "Man Accused Of Murdering Eliza Fletcher Charged In Additional Sexual Assault Case From Last Year", "date_published": "2022-09-10 16:07:12+00:00", "description": "The man charged with murdering Eliza Fletcher is now facing additional charges of kidnapping and rape from a separate incident. Cleotha Henderson, the 38-year-old suspected of murdering the Memphis mother of two, is facing “unrelated” charges of aggravated kidnapping and rape, a Memphis police official confirmed to Fox News. Henderson was indicted for the new ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/hillary-clinton-taunts-melania-trump-and-daughter-chelsea-rips-into-dark-side-ivanka", "title": "Hillary Clinton Taunts Melania Trump, And Daughter Chelsea Rips Into ‘Dark Side’ Ivanka", "date_published": "2022-09-10 14:56:26+00:00", "description": "Twice-failed presidential candidate Hillary Clinton and her daughter Chelsea Clinton publicly bashed former First Lady Melania Trump and Ivanka Trump during a “Watch What Happens Live” segment on Thursday. Hillary seemed to taunt Melania over the FBI’s raid of former President Donald Trump’s Florida home, while Chelsea claimed Ivanka has gone to the &#8220;dark side.&#8221; During a segment ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/we-always-have-disney-employees-florida-sheriff-reveals-results-of-human-trafficking-investigation", "title": "‘We Always Have Disney Employees’: Florida Sheriff Reveals Results Of Human Trafficking Investigation", "date_published": "2022-09-10 14:05:49+00:00", "description": "A Florida sheriff said that his department “always” caught Disney employees during undercover operations, while revealing the results of a week-long investigation into human trafficking.  The large investigation, known as “Fall Haul 2,” was spearheaded by the Polk County Police Department and involved a week-long sting operation in central Florida that netted over 150 arrests.   ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/pentagon-tells-struggling-army-soldiers-families-to-apply-for-food-stamps", "title": "Pentagon Tells Struggling Army Soldiers, Families To Apply For Food Stamps", "date_published": "2022-09-10 11:44:31+00:00", "description": "The Pentagon is recommending U.S. soldiers struggling with soaring food prices apply for welfare, in a move that underscores both low military pay and the economic headwinds facing the nation as a whole. The recommendation came last month from Sergeant Major of the Army Michael Grinston, and directs Army soldiers and their families to apply ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/report-heres-really-why-meghan-markle-wasnt-at-ailing-queens-bedside", "title": "Report: Here’s Really Why Meghan Markle Wasn’t At Ailing Queen’s Bedside", "date_published": "2022-09-10 11:31:03+00:00", "description": "Meghan Markle made headlines Thursday when her husband, Prince Harry, traveled alone from London to Balmoral to visit his ailing grandmother Queen Elizabeth II. But according to a royal expert, the decision wasn&#8217;t really up to Markle — the former actress wasn&#8217;t invited by the family. “It&#8217;s understood that the family wanted Prince Harry to ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/the-white-males-have-lost-south-carolina-republicans-block-proposed-state-abortion-ban-threaten-filibuster", "title": "‘The White Males Have Lost’: South Carolina Republicans Block Proposed State Abortion Ban, Threaten Filibuster", "date_published": "2022-09-10 11:03:35+00:00", "description": "Several Republican state senators in South Carolina blocked a proposed near total abortion ban in the state this week after at least one Republican threatened to filibuster.  Republican State Senator Tom Davis threatened to filibuster the proposed &#8220;Human Life Protection Act,&#8221; which allowed no abortion exceptions for rape or incest. His actions effectively scuttling the legislation ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/fbi-hiding-potentially-explosive-records-on-jeffrey-epstein-internet-sleuth-claims-after-foia-denial", "title": "FBI Hiding Potentially Explosive Records On Jeffrey Epstein, Internet Sleuth Claims After FOIA Denial", "date_published": "2022-09-10 09:48:01+00:00", "description": "A well-followed internet sleuth believes he has uncovered evidence that the FBI could be sitting on potentially explosive secret records involving dead sex trafficker Jeffrey Epstein. The anonymous Techno Fog, an self-described lawyer and writer who has nearly 400,000 followers on Twitter and also writes a popular Substack column, says a recent response to a ...", "persistent": true, "language": "en-US"}], "source": {"url": "https://www.dailywire.com/feeds/rss.xml", "title": "Daily Wire"}}