[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call Of Duty’s 2023 Plans Teased | GameSpot News", "description": "Activision has provided an update on what to expect from Call of Duty in 2023, one of Battlefield 2042’s maps has a new look and feel, plus PS Plus games for August are now available.\n#GamingNews #CallofDuty #modernwarfare2 \n\nIn a statement during its Q2 2022 earnings report, Activision said, \"Across the Call of Duty ecosystem, the teams are well positioned to support these launches with substantial live operations, while also continuing development of new premium content planned for 2023 and beyond.” \n\nOver on Twitter Bloomberg’s Jason Schreier said, “For 2023 I'd expect new paid (\"premium\") content for Modern Warfare 2, not a brand new Call of Duty. Treyarch is leading the next mainline game, which was delayed to 2024, as Bloomberg reported earlier this year.\n\nCall of Duty: Modern Warfare II is scheduled to launch on October 28 and will likely increase engagement in the series. If everything goes to plan, the proposed acquisition of Activision Blizzard by Microsoft is also expected to be finalized next year after it's approved by various government regulatory bodies across the world.\n\nIn other FPS news, an update for Battlefield 2042. Version 1.2 of the game includes bug fixes, balance changes and quality of life improvements. Possibly the biggest part of this update is the first of DICE’s planned reworks for 2042’s launch maps Kaleidoscope. According to the patch notes, this map now features improved gameplay flow with new cover assets, flag positions, terrain elevations and visual changes. \n\nUpdate 1.2 also introduces the game’s new revised art direction for its Specialists in order to help them feel more a part of the gritty 2042 game world. Other changes include: a player profile and statistics page are now available, aim assist on controllers feels smoother and more consistent and a couple weapons have been tweaked.\n\nSTAMPS\n00:00 - Intro\n00:10 - Call of Duty\n01:51 - PlayStation Plus \n02:41 - Battlefield 2042", "link": "https://www.youtube.com/watch?v=Omz1ucw3ah4", "date_published": "2022-08-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "This Overpowered Weapons Glitch Changes BOTW", "description": "Weapon Modifier Corruption has changed the landscape of Breath of the Wild, and has given players (With the patience to do it) a way to forge their own powerful and broken weapons however they want. This is not mod, this can be done on any Nintendo Switch. This is both a tutorial on the simplest way to pull this off yourself and an explanation on why this works, because the technical magic behind this is absurd.\n\nWeapon Modifier Corruption was first discovered by Kinak on July 9th 2022, using offset slots to push CookData properties onto weapons. Players then found that combinations of meals and ingredients unlocks custom modifiers with the use of binary numbers. Once this complex work is done, this makes your weapon unbelievably overpowered, and opens new doors for taking on Breath of the Wild’s toughest enemies.\n\nWMC Master Document with recipes\nhttps://docs.google.com/spreadsheets/d/1efenvai4JJM9iPGziHvvef6jSWvNeUGrx-WV9eWlR3g/edit#gid=0\n\nDecimal to Hex Converter\nhttps://www.rapidtables.com/convert/number/decimal-to-hex.html\n\n\n0:00 Intro\n0:41 Initial Setup\n4:09 Arrowless Offset\n6:41 Weapon Modifier Corruption\n7:52 Transfer The Weapon Elsewhere\n9:01 Weapon Modifier Corruption Explained!\n11:27 Weapon Modifier Type Explained\n13:11 Weapon Modifier Values Explained\n14:36 Outro", "link": "https://www.youtube.com/watch?v=KqImUP0DSvY", "date_published": "2022-08-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Why Sony Is Worried Players Will Jump To Xbox | GameSpot News", "description": "Microsoft and Call of Duty have Sony a little worried, PlayStation is getting rid of a feature and new Pokémon information is incoming August 3, 2022. \n#GamingNews #PS5 #CallofDuty\n\n\nMicrosoft's plan to acquire Activision Blizzard is currently being scrutinized by regulatory bodies across the world, and in Brazil, Sony's official response to that government's questions has been published. According to those documents, Sony believes that once Microsoft owns the Call of Duty franchise as part of the acquisition, it'll have the power to influence users' console choices.\n\nThe funny thing about this is that PlayStation has been using Call of Duty to influence player console choice for years now by having exclusive and/or early access to content. For example, 2019’s Modern Warfare launched with a co-op spec ops survival mode as a PS4 exclusive feature.   \n\nIn other PlayStation news, Sony is doing away with PS5's accolades this fall. Accolades was a launch feature on PS5, and players could give medals like helpful, welcoming, and good sport to others in multiplayer games. In theory, Sony implemented the accolades system to reduce toxicity. But in practice, nobody really knew that this system existed, to say nothing of actually using it--a fact Sony acknowledged in the discontinuation announcement.\n\nThe Pokémon Company has announced that a new Pokémon Presents will be streamed on August 3 at 6 AM PT / 9 AM ET on its YouTube channel. The next games in the series, Scarlet and Violet, will be the main event for this week's presentation, and it's likely that the video will have a few more pocket monsters to reveal. As for the other games that will be shown at Wednesday’s stream, there's a whole lot of Pokémon projects currently active, ranging from mobile games Pokémon Unite to Pokémon Masters, as well as apps for the franchise such as Pokémon Home.\n\nSTAMPS\n00:00 - Intro\n00:07 - Call of Duty\n01:30 - PS5 Feature\n02:10 - Pokémon", "link": "https://www.youtube.com/watch?v=uEFGCml3PZA", "date_published": "2022-08-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]