[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "FreedomFest Special: We Ask Crazy Libertarians The 10 Questions", "description": "The Babylon Bee crew wandered FreedomFest and asked those crazy liberty-loving folks questions like \"What book would you add to the Bible?\", \"Do you prefer cigars or pipes?\", and, of course, \"Would you do us a solid and accept Jesus as your Lord and Savior?\" Here are the most interesting or insane responses we got!\n\nDon't forget to subscribe to the new Babylon Bee Podcast channel: https://www.youtube.com/channel/UCWHeOvQs6p-9KcMtvV0sNmQ\n\nBecome a premium subscriber:  https://babylonbee.com/plans\n\nThe Official The Babylon Bee Store:  https://shop.babylonbee.com/\n\nFollow The Babylon Bee:\nWebsite: https://babylonbee.com/\nTwitter: https://twitter.com/thebabylonbee\nFacebook: https://www.facebook.com/TheBabylonBee\nInstagram: http://instagram.com/thebabylonbee", "link": "https://www.youtube.com/watch?v=F4vjg7bp__o", "date_published": "2022-07-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "The Bee Weekly: FreedomFest and The Best Video Games Ever", "description": "Enjoy an 82% discount and 3 months free with the most trusted VPN provider, Private Internet Access at our link: https://www.privateinternetaccess.com/offer/TheBabylonBee_v12qjfi\n\nThis week at The Babylon Bee, the guys review their crazy weekend in Las Vegas at FreedomFest because what happens in Vegas echoes in eternity. They also talk about good Samaritans who use guns and run into burning buildings, repent of not knowing the fish slapping dance, and discuss the top ten greatest video games of all time. Travis is back with a vengeance this episode.\n\nThis episode is also brought to you by these sponsors bringing you Fake News You Can Trust:\nBetterHelp: http://betterhelp.com/babylonbee\nMy Patriot Supply: http://preparewithbee.com\nABIDE app: http://abide.co/babylon\nAllegiance Gold: http://allegiancegold.com/bee\n\nThe Babylon Bee crew also talks about the news of the week like Brandon Falls being a historical landmark now, NPR deciding to open up a brand new disinformation wing, and Joe Biden wandering around the Middle East asking for Jafar. There’s also more Sizzler facts, a Weakly News with Claire filling in for Adam, and Bee Radio with Austin Robertson. Kyle sits down with Andrew Crapuchettes, from Red Balloon, who is trying to connect freedom-loving employers with people who just want to work without compromising their beliefs and values. Last but not least, the guys at The Babylon Bee set in stone their top ten video games of all time. \n\nThe Babylon Bee Podcast channel is breaking up! Make sure to follow the podcast at the new YouTube channel: https://www.youtube.com/channel/UCWHeOvQs6p-9KcMtvV0sNmQ?sub_confirmation=1\n\nCheck out Red Balloon: https://www.redballoon.work/\n\nBecome a premium subscriber:  https://babylonbee.com/plans\n\nThe Official The Babylon Bee Store:  https://shop.babylonbee.com/\n\nFollow The Babylon Bee:\nWebsite: https://babylonbee.com/\nTwitter: https://twitter.com/thebabylonbee\nFacebook: https://www.facebook.com/TheBabylonBee\nInstagram: http://instagram.com/thebabylonbee", "link": "https://www.youtube.com/watch?v=UsNUVaJlqz8", "date_published": "2022-07-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]