[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "NoSo: Tiny Desk Concert", "description": "Elle Mannion | November 4, 2022\nBaek Hwong, the artist who performs as NoSo, arrived at NPR’s headquarters on a sunny Friday afternoon that followed a week of relentless rain in Washington, D.C. The change in weather was apt for the Los Angeles-based artist whose music often sheds light on dark times. \n\nI first discovered NoSo when they entered the Tiny Desk Contest back in 2019. Even though they didn’t win, their spectacular guitar playing, memorable hooks and sentimental lyricism left a lasting impression. They bring all those elements to their Tiny Desk set, in which they’re accompanied by musicians Marian Li-Pino on drums and Jayla Tang on violin. NoSo’s soft-spoken nature complements their musical dexterity to create the kind intimate performance that really shines in the close quarters behind the Desk.\n\nAcross the three-song set, Hwong sings about the “quiet suburbia” they grew up in and reflects on feelings about their evolving gender identity. The final song of the set, “Everything I’ve Got,” is an aching portrayal of the way confidence and longing can be upended by gender dysphoria; before playing the song, Hwong shares that they’ve “healed a lot” since writing it. “I know if I was born fairly, I’d be it / I’ll love you with everything I’ve got,” they sing quietly over a swelling violin and an audience of sniffling NPR staff. \n\nNoSo reflects on their adolescence — often granting newfound compassion to their younger self — across their debut album, Stay Proud Of Me, which came out earlier this year. They say releasing that record and playing a Tiny Desk three years after submitting to the Contest feels like “a real full-circle moment.” Toward the end of the set, Hwong smiles and admits: “This is a dream come true.”\n\nSET LIST\n“I Feel You”\n“Suburbia”\n“Everything I've Got”\n\nMUSICIANS\nBaek Hwong: guitar, vocals\nMarian Li-Pino: drums\nJayla Tang: violin\n\nTINY DESK TEAM\nProducer: Bob Boilen\nDirector/Editor: Joshua Bryant\nAudio Engineer: Josh Rogosin\nSeries Producer: Bobby Carter\nVideographers: Joshua Bryant, Maia Stern, Michael Zamora, Sofia Seidel\nAudio Assistant: Alex Drewenskus\nProduction Assistant: Jill Britton\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer, Kara Frame\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #noso", "link": "https://www.youtube.com/watch?v=u3axBzTe2-I", "date_published": "2022-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]