[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "First 20 Minutes Of GTA 5 In 4k On PS5", "description": "New generation versions of Grand Theft Auto V and GTA Online release on PlayStation 5 and Xbox Series X/S on March 15th. Here's what it looks like in 4k on PlayStation 5. \n\n#GTA5 #PS5", "link": "https://www.youtube.com/watch?v=sVM9SczFzNg", "date_published": "2022-03-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Ghostwire: Tokyo - 8 Minutes of Open World PS5 Performance Mode Gameplay", "description": "Check out gameplay of Ghostwire: Tokyo, running the PlayStation 5 in performance mode.\n\nIn this video we give you a small sample of what Ghostwire has to offer. An open world Shibuya to run around in? Check. Cat Yokai who've taken over all the local convenience stores. You know it! And for you dog lovers, not only are there plenty of Shiba to pet, but if you give them food they'll dig up a reward for you.\n\nWe also show off the game's spirit finger gun combat, which has you blasting your jutsu at the many evil spirts that have invaded the city. It may be a little simple, but thanks to the slick animations, it's also very satisfying.\n\nGhostwire: Toyko hits PlayStation 5 and PC on March 25, 2022.", "link": "https://www.youtube.com/watch?v=3HqSmvUfkbg", "date_published": "2022-03-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Ghostwire: Tokyo - High Hopes After The First 5 Hours", "description": "We've gotten to play the first two chapters of Ghostwire: Tokyo, and are excited at the promise the game shows.\n\nJean-Luc's time with the game clarified a lot of what exactly Ghostwire: Tokyo is. In many ways the game is building off of the open world foundation found in developer Tango Gameworks previous game, The Evil Within 2. There's plenty to do in the empty streets of Shibyua with side quests take on, shops to buy from, and collectable to find. The combat, while simple, is increiabley satisfying \n\nBased on his experience, Jean-Luc greatly enjoyed Ghostwire: Tokyo and has high hopes for it as long as it can maintain this level of quality for the rest of the game. Our preview build of the game is running on the PlayStation 5 and the footage you are seeing is in performance mode.\n\n#GhostwireTokyo", "link": "https://www.youtube.com/watch?v=YkUt394HEbk", "date_published": "2022-03-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Will PlayStation Unban Borderlands 3 Cross-Play? | GameSpot News", "description": "Tiny Tina’s Wonderlands will have cross-play at launch, Hogwarts Legacy State of Play is announced for March 17 and Halo Infinite crash bug is fixed on PC in new update\n\nGearbox's Randy Pitchford confirmed the upcoming Borderlands spin-off Tiny Tina's Wonderlands will have cross-play support for all platforms at launch. Cross-play support for all platforms in Borderlands 3 might be coming soon as well, as Pitchford says he sees that as being \"inevitable\" now that cross-play is coming to Tiny Tina's Wonderlands. Borderlands 3 currently supports cross-play between Xbox and PC, but not PlayStation.\n\nSony has announced a new State of Play livestream that will focus on Hogwarts Legacy. The livestream is scheduled for Thursday March 17 at 2pm PT/5pm ET. The whole thing will run for about 20 minutes and will feature over 14 minutes of Hogwarts Legacy gameplay captured on PS5.\n\nA new patch is out now for Halo Infinite that makes some small but important changes for the PC edition of the sci-fi shooter. The March 14 update for Halo Infinite specifically improves stability in the PC version by resolving a \"common crash.\"\n\nSTAMPS\n00:00 - Intro\n00:07 - Tiny Tina\n01:38 - Hogwarts Legacy\n02:48 - Halo Infinite Update", "link": "https://www.youtube.com/watch?v=tyIsJWDKSPA", "date_published": "2022-03-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Breaks Down Different Weapon Attachments - Loadout Bonus Chat", "description": "From scopes and suppressors to foregrips and drum magazines, our favourite shooters love to let us customise our firearms. In this episode, Keeper of Firearms & Artillery Jonathan Ferguson breaks down a variety of weapon attachments and compares them to their virtual counterparts.\n\n00:00 - Opening\n00:58 - Heavy Barrels \n02:24 - Underslung Grenade Launchers\n03:56 - Extended Magazines\n05:59 - Red Dot Sights & Rail Systems\n07:35 - Weight Issues with Attachments\n09:21 - Accuracy vs. Gameplay choice\n10:55 - Ending\n\nIn this episode of Loadout, Dave Jewitt visits the Royal Armouries to talk to Keeper of Firearms & Artillery Jonathan Ferguson about weapon attachments and how they’re portrayed within our video games.\n\nYou can check out more episodes of Loadout right here. - https://www.youtube.com/watch?v=yzSrmGkpWKk&list=PLpg6WLs8kxGMzIemU1gyyLmg5VlKI2UvC\n\nYou can check out our Firearms Expert Reacts series here. - https://www.youtube.com/watch?v=5FVzcoRjoN4&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/", "link": "https://www.youtube.com/watch?v=7WPb2_uECnk", "date_published": "2022-03-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]