[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Dr Lisa Fitzpatrick, Community health promotion, Washington DC", "description": "Grapevine Health web site, https://www.grapevinehealth.com/\n\nand YouTube channel, https://www.youtube.com/c/GrapevineHealth\n\nThank you very much for coming on again Lisa, and for your great work", "link": "https://www.youtube.com/watch?v=k2XNOtBzGDU", "date_published": "2022-02-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Pandemic ends Thursday", "description": "All legal restrictions in England ending Thursday, 24th February\n\nProf Sir David Spiegelhalter\n\nhttps://www.bbc.co.uk/news/health-60408419?xtor=ES-208-[50410_NEWS_NLB_ACT_WK08_Mon_21_February]-20220221\n\nIt is now time to start seeing the risks as similar to those we face from other viruses and hazards we encounter in our lives.\n\nCovid has assumed what is called a \"dread risk\"\n\nthe mental and emotional toll of the pandemic means people overestimate the actual risks.\n\n\"Those feelings of dread make it challenging to accept a risk as something 'normal', to weigh it up in the way we all have to weigh the inevitable risks of everyday life.\"\n\nHMQ\n\nThursday, 24th Feb, all Covid restrictions will end in England\n\nhttps://www.bbc.co.uk/news/uk-60467183\n\nLegal duty to isolate for positive tests stopped\n\nFree mass testing will stop from 1 April\n\nMr Johnson\n\nToday is not the day we can declare victory over Covid because this virus is not going away\n\nbut it is the day when all the efforts of the last two years finally enable us to protect ourselves whilst restoring our liberties in full.\n\nOmicron, with falling cases and hospital admissions, and we could now complete the \"transition back towards normality\" \n\nwhile retaining contingencies to respond to a Covid resurgence or a new variant.\n\nProf Sir Chris Whitty\n\nthe ending of virus restrictions was a \"gradual, steady change over a period of time\" as rates were declining, adding: \"This is not a sudden everything stops.\"\n\nThe public health advice would be for people with Covid to self-isolate to prevent others catching it, \n\nas would be the case for many other highly infectious diseases\n\nSir Patrick Vallance\n\nthe virus would continue to evolve over the next couple of years and there was no guarantee that future variants would be less severe than Omicron.\n\nFrom 21 February\n\ndropping guidance for education and childcare, twice weekly asymptomatic testing\n\nFrom Thursday 24 February\n \nPeople who test positive for Covid will no longer be legally required to self-isolate\n\nstill be advised to stay at home and avoid contact with others for at least five full days\n\nRoutine contact tracing will end\n\nFully vaccinated close contacts and those aged under 18 will no longer be legally required to test daily for seven days\n\nFrom 1 April\n\nFree mass testing for symptomatic and asymptomatic for the general public will end\n\nwill instead be targeted towards the most vulnerable\n\nPeople with Covid symptoms will be asked to exercise personal responsibility when deciding whether to stay at home, \n\nuntil then they are still advised to do so\n\nCurrent government guidance on Covid passports will end and it will no longer recommend venues use the NHS Covid pass", "link": "https://www.youtube.com/watch?v=AOUHSg81HMU", "date_published": "2022-02-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Mr Bill Gates is sad", "description": "But why?\nNatural immunity discussed by Mr. Bill Gates\n\nhttps://twitter.com/disclosetv/status/1494810193175195652\n\nSadly the virus itself \n\nparticularly the variant called Omicron\n\nis a type of vaccine, creates both B cell and T cell immunity\n\nand it's done a better job of getting out to the world population than we have with vaccines.\n\nSerosurvey in African countries, 80% positive\n\nChance of severe disease, dramatically reduced because of that infection exposure.\n\nWe didn’t do a great job on therapeutics\n\nUK\n\nCases down dramatically, infections down slightly\n\nhttps://coronavirus.data.gov.uk/details/cases\n\nhttps://covid.joinzoe.com/data#levels-over-time\n\nONS tracks omicron BA.2", "link": "https://www.youtube.com/watch?v=tlygUb9RVgA", "date_published": "2022-02-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]