[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring - Everything To Know", "description": "FromSoftware's latest game, Elden Ring, releases on February 25, 2022. The upcoming game from the creators of Dark Souls, Bloodborne, and Sekiro will feature a brand new open world, and plenty of other gameplay features both new and familiar to longtime Soulsborne fans. Here's everything you need to know about Elden Ring.\n\nElden Ring is the latest game from FromSoftware - creators of Demon’s Souls, Dark Souls, Bloodborne, and of course, King’s Field. The game takes the basic action RPG mechanics of Dark Souls, but introduces a brand new open world that completely changes things up.\n\nSimilar to the Soulsborne games, as of the closed Beta, players will be able to choose from a number of starting classes, with stats they’ll be able to upgrade as they level up, allowing for a  level of freedom in creating your own builds. The starting classes thus far are Vagabond, Warrior, Hero, Bandit, Astrologer, Prophet, Samurai, Prisoner, Confessor, and Wretch - with Wretch being the level 1 build.\n\nStats you can choose to upgrade with each level are: Vigor, Mind, Endurance, Strength, Dexterity, Intelligence, Faith, and Arcane. This means, similar to prior Soulsborne games, you’ll have the freedom to choose between Strength, Quality, Dex, and varying magic builds - or any merger of those.\n\nLeveling up is only possible after meeting your first finger maiden, Melina; once you have met her, you’ll be able to level up at any of the game’s Sites of Grace - which act similar to bonfires from the Souls games.\n\nAt the Sites of Grace, you’ll be able to manage your Estus Flasks, and - like Dark Souls 3 - you’ll have a variety of Estus Flask types. You’ll have ones that refill your HP, ones that refill your FP, or Focus Points that allow you to cast magic, and a brand new Flask of Wondrous Physick, which is a customizable estus flask that will give you varying attributes depending on what crystal tears you equip to it.\n\nYou’ll also be able to upgrade how many Estus Flask uses you get by using special Golden seeds. If you recall from the game’s trailer, there are giant golden Erd Trees throughout the game, that are clearly significant. There are also smaller, lesser Erd Trees you can find throughout the game’s map. At these lesser Erd Trees, you’ll find special golden seeds, which are exactly what you need to upgrade your estus flask uses. The number of seeds you need will change as you upgrade your flask, and this isn’t the only way to obtain these seeds. Additionally, you can upgrade the recovery strength of your estus flasks.\n\n#EldenRing #GameSpot", "link": "https://www.youtube.com/watch?v=mYo6ZzGz6ig", "date_published": "2022-02-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Steam Deck - Everything To Know", "description": "Ahead of its initial launch in late February 2022, we're taking a look at everything revealed about Valve's Steam Deck so far.\n\nThe Steam Deck is a portable, handheld PC that will ship with Valve's own SteamOS (built on top of Linux). The device is billed as an entirely open platform, letting players install games outside of the Steam ecosystem, run additional PC software alongside them, or just replace the entire OS with Windows if they like. Valve is hoping that most (not all) games will work just fine on SteamOS when the Steam Deck launches, with a lot of work going into improving Proton--a compatibility layer that allows Windows games to run on Linux without native support, and without (too many) issues.\n\nSTAMPS\n00:00 - Intro\n00:30 - What is the Steam Deck?\n02:22 - Price and Versions\n03:17 - Specifications\n04:41 - Game Compatibility \n06:13 - Release Date", "link": "https://www.youtube.com/watch?v=KOtTGrct4UM", "date_published": "2022-02-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Street Fighter 6 Announcement Teaser Trailer", "description": "HERE COMES A NEW STREET FIGHTER. \n\nIt's official: Street Fighter 6 is in development! Stay tuned for more news coming Summer 2022. https://www.streetfighter.com/6\n\n#StreetFighter6 #SF6", "link": "https://www.youtube.com/watch?v=JT3Mrboykvo", "date_published": "2022-02-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "How Games Get Miniguns Wrong - Loadout", "description": "Whenever a game or movie needs to dial up the action, the roar of the Minigun is there, whether it’s mounted to a Battlefield helicopter or clutched in the arms of a T-800 Terminator. From Call of Duty set-pieces to Predator-hunting mercenaries, it’s a must-have for any larger-than-life action hero, so with its colossal reputation and a history spanning centuries, why do movies and video games keep getting the spinning maw of the Minigun so wrong? (Presented by PUBG MOBILE)\n\nIn this episode of Loadout, Dave Jewitt visits the Royal Armouries to talk to Keeper of Firearms & Artillery Jonathan Ferguson to discover the surprising origins of the M134 Minigun, and see why it’s one of the least well-represented guns in pop culture history.\n\nYou can check out more episodes of Loadout right here. - https://www.youtube.com/watch?v=yzSrmGkpWKk&list=PLpg6WLs8kxGMzIemU1gyyLmg5VlKI2UvC\n\nYou can check out our Firearms Expert Reacts series here. - https://www.youtube.com/watch?v=5FVzcoRjoN4&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/", "link": "https://www.youtube.com/watch?v=_DNUI1iywA8", "date_published": "2022-02-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "So You've Decided To Play Destiny 2...", "description": "Don't worry. We've been playing Bungie's pinnacle loot shooter and have a comprehensive catch-up guide for all new and returning players alike, eager to play Destiny with the upcoming launch of The Witch Queen!\n\nDestiny 2 is a constantly evolving game, so if you haven’t touched it even as far back as the Shadowkeep expansion when it went free-to-play, it might be quite different from what you remember. Whether you're a new player or a returning one, we got you! We breakdown everything from what expansions you need to worry about buying, to how seasons work, and armor builds and exotic tips, just to name a few. \n\nThe Witch Queen is at max hype right now, and this story is about to be incredible with all the build-up over the last 7 years from Destiny 1 coming to this moment. If Lightfall is like Avenger’s Endgame, then Witch Queen certainly feels like Infinity War, and I’m 100% here for it. Trust me, if you haven’t played yet or you fell off, I’m sorry to say that you missed out on some really cool shared experiences but that’s ok! Because you’re back now, and there’s, even more, to discover and experience together, and that’s all that matters. See you on the field, Guardian.\n\nIf you would like a written lore catchup on Destiny's story so far, check out Phil Hornshaw's in depth articles here:\n\nhttps://www.gamespot.com/articles/destiny-the-story-so-far-from-the-black-garden-to-beyond-light/1100-6452481/\n\nhttps://www.gamespot.com/articles/destiny-2-story-catch-up-everything-that-happened-from-beyond-light-to-witch-queen/1100-6500256/\n\nTimestamps:\n00:00 - Intro\n02:17 - What to buy?\n03:56 - How do Seasons work?\n05:17 - How do I catch up on story?\n07:33 - How Do I catch up on power level?\n08:06 - How much can I play solo vs. with friends?\n10:19 - Should I keep my old character or start a new one?\n11:08 - What guns and armor should I be trying to get?\n14:18 - How do armor builds even work?\n18:19 - Why Are Void and Statis classes different?\n19:11 - How do I get exotics?\n20:35 - Will it take a long time to have a high level character?\n21:35 - What activities and modes are actually worth playing?", "link": "https://www.youtube.com/watch?v=CE-E7bwm4_M", "date_published": "2022-02-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]