[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Belle and Sebastian: Tiny Desk Concert", "description": "Bob Boilen | July 8, 2022\nNow that we're back filming Tiny Desk concerts behind my desk at NPR, I get to witness that nervous energy surrounding most artists who are about to perform in an office, in daylight, with fans just a few feet away. This was surely true of the eight members of Belle and Sebastian when they kicked off their warmup with \"Unnecessary Drama.\" That's the title of a track from the band's fabulous new album A Bit of Previous and not my description of what was about to unfold. Though I can't deny the tension.\n\nYou see, we don't amplify the singer's voice in the room, and we don't use monitor speakers. It all adds to the intimacy of the performance, but it also made it hard for Stuart Murdoch to hear himself sing. In fact, he began to question whether having an ensemble of drums, keyboards, guitars, bass, etc. was right for the Tiny Desk and considered scrapping it all in favor of him and a guitar and maybe another player. But with a little work on the overall volume of the band, some run-throughs and the creature comfort of a handheld microphone, the band from Glasgow was charming and magnificent.\n\nBelle and Sebastian performed three songs from A Bit of Previous, its ninth album excluding two soundtracks. The band ended its delightful set with its classic tune \"Judy and the Dream of Horses\" from If You're Feeling Sinister, an album that's just celebrated its 25th anniversary. With questioning lyrics and youthful imagery, a guest trumpeter and a gallop in the rhythm, Belle and Sebastian gloriously made its dramatic mark at the Tiny Desk.\n\nSET LIST\n\"Unnecessary Drama\"\n\"Working Boy in New York City\"\n\"Reclaim the Night\"\n\"Judy and the Dream of Horses\"\n\nMUSICIANS\nStuart Murdoch: vocals, guitar \nStevie Jackson: guitar, harmonica, vocals \nBob Kildea: guitar, vocals \nRichard Colburn: drums \nSarah Martin: keys, flute, recorder\nChris Geddes: keys\nDave McGowan: bass, vocals\nSarah Wilson: keys, vocals\nJason Covey: trumpet\n\nTINY DESK TEAM\nProducer: Bob Boilen \nAudio Engineer: Josh Rogosin \nDirector: Michael Zamora \nSeries Producer: Bobby Carter \nEditor: Michael Zamora\nVideographers: Kara Frame, Joshua Bryant, Michael Zamora, Pierre Kattar, Alanté Serene \nProduction Assistants: Jill Britton, Joby Tanseco \nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer, Maia Stern \nVP, Visuals and Music: Keith Jenkins \nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #TinyDesk #BelleAndSebastian", "link": "https://www.youtube.com/watch?v=NWEqYj3OOoo", "date_published": "2022-07-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]