[{"source": "https://www.theguardian.com/rss", "title": "Women’s Euro 2022 Golden Boot: top goalscorers, game by game", "description": "<p>Who will get the most goals at the European Championship in England? </p><p>The race for the Women’s Euro 2022 Golden Boot will be fascinating, with so many great goalscorers taking part in England.</p><p>Norway’s Ada Hegerberg will be one of the favourites, having returned to the international fold after a five-year absence while her Scandinavian colleagues Pernille Harder (Denmark) and Stina Blackstenius (Sweden) are also in with a shout.</p> <a href=\"https://www.theguardian.com/football/ng-interactive/2022/jul/08/womens-euro-2022-golden-boot-top-goalscorers-game-by-game\">Continue reading...</a>", "link": "https://www.theguardian.com/football/ng-interactive/2022/jul/08/womens-euro-2022-golden-boot-top-goalscorers-game-by-game", "date_published": "2022-07-08 11:50:00+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Challenges and opportunities: what does sustainability really mean for business?", "description": "<p>For companies to be truly sustainable, they must know their full impact on the world, but change can bring resilience as well as savings</p><p>No doubt you will have heard the word “sustainable” recently. Or perhaps you hear it so often that you now just filter it out. Indeed, you may well feel the same about words such as “eco”, “ethical” and “social responsibility”.</p><p>This points to a problem that all businesses face. On the one hand, sustainability is increasingly important. But on the other hand, many organisations overuse the term to the point where it is now meaningless. It has become a label to slap on.</p> <a href=\"https://www.theguardian.com/the-whole-picture/2022/jul/08/challenges-and-opportunities-what-does-sustainability-really-mean-for-business\">Continue reading...</a>", "link": "https://www.theguardian.com/the-whole-picture/2022/jul/08/challenges-and-opportunities-what-does-sustainability-really-mean-for-business", "date_published": "2022-07-08 09:58:22+00:00", "persistent": false, "user": null, "language": "en-UK"}]