[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Beabadoobee – live at Rock the Garden 2022 (full set)", "description": "After Bill DeVille introduced Beabadoobee, the London rocker and her band wasted no time ripping into a set of power-pop songs that had the audience captivated from the first downbeat. During the third song, the audience were singing so wholeheartedly they could be heard belting out the lyrics to “Care” from backstage. None other than Corin Tucker of Sleater-Kinney made her way to the wings to snap a smartphone photo of the band in action. The set comprised tunes from Beabadoobee’s 2020 album \"Fake It Flowers\" and this year’s \"Beatopia,\" as well as from the intervening year’s EP Our Extended Play and 2019’s Space Cadet.\n\nBeabadoobee quieted things down for a bit when she gave a solo acoustic performance of “Coffee” before ramping up the energy again with the dynamics-hopping “Sorry.” The next song, “She Plays Bass” had the audience completely engrossed in singing and dancing (save for a bit of playful distraction from a supersize beachball making its way among the crowd). Beabadoobee seized a moment during “She Plays Bass” to introduce bassist Eliana Sewell, as well as drummer Luca Caruso and lead guitarist Jacob Bugden. (Bugden’s cool glasses and shock of bleach-blonde hair lent him a resemblance to Chris Collingwood of power-pop icons Fountains of Wayne.)\n\nA moment of drama ensued during Beababoodee’s self-declared favorite song from Beatopia, “See You Soon,” when Caruso’s drum shield collapsed into his kit. After a scramble by the quickly responsive stage crew, the group closed out the set with a string of rockers given extra punch with the drum shield now gone, the audience hanging on to every last beat, lick and lyric. \n\nSongs Performed \n00:00 Worth It\n03:51 Together\n07:13 Care\n11:16 Talk\n14:10 He Gets Me So High\n17:01 Coffee\n19:04 Sorry\n22:43 She Plays Bass\n26:40 See You Soon\n30:50 Back to Mars\n32:55 Last Day on Earth\n36:49 Cologne\n\nYou rely on The Current to keep you connected to the music you love, and we rely on you to power this station. Everything you find here is only possible because of listener support. Give now at: http://www.support.mpr.org/youtube\n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent?sub_confirmation=1\n\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/\nhttps://twitter.com/TheCurrent\nhttps://www.instagram.com/thecurrent/\n\n#beabadoobee #rockthegarden", "link": "https://www.youtube.com/watch?v=OGkxugu5Wos", "date_published": "2022-07-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Bombino – live at Rock the Garden 2022 (full set)", "description": "Bombino provided a perfect re-entry to Rock the Garden following the two-year hiatus. Backed by insistent drums, growling bass and jangling rhythm guitar, Bombino launched into blues-tinged North African grooves, tracing pentatonic-scale shapes up and down the fretboard of his chiming electric guitar. Dressed in bubus, traditional Taureg attire, Bombino and his bandmates — Kawisan Mohammed (rhythm guitar), Youba Dia (bass) and Corey Wilhelm (drums) — soon got a sizeable number of the crowd dancing joyfully in front of the stage, matching the band’s irresistible rhythms.\n\nInteraction with the audience was sparse, but the music did the talking. “English is very hard for us,” admitted bass player Dia, alternately switching from English to French, the latter of which was met enthusiastically by a not insignificant francophone contingent in the audience.\n\nThe songs flowed seamlessly from one to the other, maintaining an upbeat spirit throughout the set. “With Bombino, there’s never a setlist,” Wilhelm explained afterwards. “It’s all feeling. Bombino sees what’s working with the audience and calls the songs as we go.”\n\nYou rely on The Current to keep you connected to the music you love, and we rely on you to power this station. Everything you find here is only possible because of listener support. Give now at: http://www.support.mpr.org/youtube\n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent?sub_confirmation=1\n\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/\nhttps://twitter.com/TheCurrent\nhttps://www.instagram.com/thecurrent/\n\n#bombino #rockthegarden", "link": "https://www.youtube.com/watch?v=uD3vkbgBae4", "date_published": "2022-07-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Sleater-Kinney - \"Worry With You\" (Live at Rock the Garden 2022)", "description": "Watch Sleater-Kinney perform \"Worry With You,\" recorded live onstage at Rock The Garden in Minneapolis on Saturday, June 11, 2022.\n\nYou rely on The Current to keep you connected to the music you love, and we rely on you to power this station. Everything you find here is only possible because of listener support. Give now at: http://www.support.mpr.org/youtube", "link": "https://www.youtube.com/watch?v=i0l9gKCX7zU", "date_published": "2022-07-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Sleater-Kinney – live at Rock the Garden 2022 (full set)", "description": "As Sleater-Kinney walked on-stage, a full hill of fans erupted in cheers. The iconic punk rock band that formed during the Riot Grrl movement in the 1990s clearly hasn’t lost their relevance. Similar to the age of those dancing in the audience, the setlist spanned decades, pulling from 1997’s Dig Me Out to their most recent and first self-produced album, Path of Wellness, released in 2021.\n\nThe performance was incredibly tight. After 10 albums, Sleater-Kinney are seasoned and wicked smart musicians. Vocalists and founding duo, Corin Tucker and Carrie Brownstein know exactly how to complement and make room for each other as they wove together wails and melodies. Their sound isn’t stripped down these days, but rather full with the support of a keyboardist, additional guitarist, and drummer Angie Boylan, replacement for long-time member Janet Weiss, who left the band in 2019.\n\nThe crowd kept jumping and screaming along until the very end, as Sleater-Kinney wrapped up with “Entertain” and “Modern Girl” - both from 2005’s The Woods and both prime examples of the band’s signature critique of consumerism, gender roles and sticking to the status quo.\n\nAs always, Sleater-Kinney played like they have nothing to prove and the only role they have to fill is the one they chose. - Darby Ottoson\n\nSongs Played\n00:00:00 High in the Grass\n00:04:37 All Hands on the Bad One\n00:07:33 Bury Our Friends\n00:11:37 Worry With You\n00:15:27 Surface Envy\n00:18:32 Can I Go On?\n00:22:15 I Wanna Be Your Joey Ramone \n00:26:39 Price Tag\n00:30:37 Shadow Town (plus band introduction)\n00:35:49 No Cities to Love\n00:39:14 The Fox\n00:42:24 A New Wave\n00:46:12 Reach Out\n00:50:13 Modern Girl\n00:53:26 Dig Me Out\n00:55:48 Entertain\n\nYou rely on The Current to keep you connected to the music you love, and we rely on you to power this station. Everything you find here is only possible because of listener support. Give now at: http://www.support.mpr.org/youtube\n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent?sub_confirmation=1\n\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/\nhttps://twitter.com/TheCurrent\nhttps://www.instagram.com/thecurrent/\n\n#sleaterkinney #rockthegarden", "link": "https://www.youtube.com/watch?v=q-hz1AcldX0", "date_published": "2022-07-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]