[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCsXVk37bltHxD1rDPwtNM8Q", "title": "What Happens if the Moon Crashes into Earth?", "description": "Getting something from the kurzgesagt shop is the best way to support us and to keep our videos free for everyone.  ►► http://kgs.link/shop-157\n(Worldwide Shipping Available)\n\nGet the Limited Edition Crashing Moon Pin here:\nhttps://shop.kurzgesagt.org/\n\nSources & further reading:\nhttps://sites.google.com/view/sources-moon-crash/\n\nToday we are answering an age-old very scientific and important question: What if the moon crashes into earth? It’s more interesting and weird than you probably think. Let's start with the basics: Why isn't the Moon on its way to crash into us already?\n\nOUR CHANNELS\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nGerman Channel: https://kgs.link/youtubeDE \nSpanish Channel: https://kgs.link/youtubeES \n\n\nHOW CAN YOU SUPPORT US?\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThis is how we make our living and it would be a pleasure if you support us!\n\nGet Merch designed with ❤ https://kgs.link/shop-157  \nJoin the Patreon Bird Army 🐧  https://kgs.link/patreon  \n\n\nDISCUSSIONS & SOCIAL MEDIA\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nReddit:            https://kgs.link/reddit\nInstagram:     https://kgs.link/instagram\nTwitter:           https://kgs.link/twitter\nFacebook:      https://kgs.link/facebook\nDiscord:          https://kgs.link/discord\nNewsletter:    https://kgs.link/newsletter\n\n\nOUR VOICE\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThe Kurzgesagt voice is from \nSteve Taylor:  https://kgs.link/youtube-voice\n\n\nOUR MUSIC ♬♪\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\n700+ minutes of Kurzgesagt Soundtracks by Epic Mountain:\n\nSpotify:            https://kgs.link/music-spotify\nSoundcloud:   https://kgs.link/music-soundcloud\nBandcamp:     https://kgs.link/music-bandcamp\nYoutube:          https://kgs.link/music-youtube\nFacebook:       https://kgs.link/music-facebook\n\nThe Soundtrack of this video:\nSoundcloud: https://bit.ly/3GEZXBT\nBandcamp: https://bit.ly/3HwgF7U\n\nIf you want to help us caption this video, please send subtitles to subtitle@kurzgesagt.org\nYou can find info on what subtitle files work on YouTube here:\nhttps://support.google.com/youtube/answer/2734698?hl=en-GB&ref_topic=7296214\nThank you!\n\n🐦🐧🐤 PATREON BIRD ARMY 🐤🐧🐦\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nMany Thanks to our wonderful Patreons (from http://kgs.link/patreon) who support us every month and made this video possible:\nNicolas Lycas, Laurence Gonsalves, Повелитель, Jess Lee, Lowell Dariyanani, tyrx360, Levi Heßmann, Ro Yue, lucrezia terzi, Matt Friedman, Aurelian Nicolae, Dustin Dippen, David Ka, Liz Apke, Chris Klimmek, Tom Larsen, Arpenik Kroyan, Welzuwiusz, Poul Daniele Wild, Shawn Tabai, Mr.Rotten, conan747, Brefel Hugo, Jason Sandoval, Curtisanne Voltaires, Bjørn Gjertsen, Paula Calin, Anna Filina, Dr. Torf, Reedoxx, Niko Steffen, Christopher J Knorr, Jobin Joseph, Michael, Saukerl Manchmals, Chowizard Pyngam, Vakaris Jakas, Sir-Raptor, Angus Kelsey, Brittnee, Galv 2k22, Ethan, Bert Boot, Ralph Sommer, Jerith Hart, Dvaloin Battlehorn, Kyle Climaco, Sam, Cesar Medina, Jing Chen, Stephen Goyne, Lazer, Darius Pivoriūnas, Christian Minguillon, Amos Restad, FantasticMrFawkes, Jasper Song, Ankylosaurus, Jervis Johnson, Vincent le Gros Jardinier le Matin, Ke ke Walker-Chun, Tom, Riccardo Amici, William Clendinning, Ky-Cuong Huynh, Ben Jacobs, Karl Kasamon, Hannah Stapley-Parker, Katebee, Álvaro López-Berges Timon, Paul@MountainAshMetalwork, Noli Ergas, Corey Dome, Andrew Langston, Spencer Rose, Pratik Karki, Parker FK, Christian Bunk, Jonas Boll Esser, Anthony Pettid, Daniil Bratchenko, Matthew Middleton, Oromis, OnlineBookClub.org, Josh Bennett, Simon Thompson, pinky, Wayne B Hayes, Kristin Purdy, Boaz de Vries, brb_coffee, Matthew O'Rourke, Eric R Taylor, Inkuto, Kim Gilligan, Michael K. Scott, Seweryn M., Richard Lember, Daniel Jacques Osuna, Kirill, bearmassacre, Brittany Toole, Alex Mooney, Aria Bend, Aletheia McLan, David Laborde, Hung Nguyen, Masood Latif, Benjamin Meyers, Christopher, applesauce, Roy Villavicencio, Stefano Perna, Tim van Mourik, Harald Kepplinger, NightOps59, Ola Mellowhype, Ashley Andrews, Amelia Price, Дмитрий Ковтун, Christopher Zullig, Nick Riker, Dennis Zhang, Victor Paslay, Crafting With Luigi, Ryan W, Hagiu Alexandru, bob huh, Mitchell Mebane, Ziff, Sonny D, Bill Sangary, Christopher Coutts, Miha Rekar, Alex Wendland, Vitor Vilela, Roko Lisica, Cosmo, Marc Probst, Debreczeni Szabolcs, Maven, David Junk, Adam Grimaldi, Danny Arauz, Oleg, Bill Dora, Marc van der Schee, Solal Fukui, Smelly_Patreon, David McGrath, Štěpán Hrabovský, Zane Rastrick, Andy Brychenko, Dan Malear, John Boyne, Tim Engelmann, George Georgiou, Miruna Andreea, Kais Kovash, Itay Tishler, Simon Hodgson, Marvin Hansen, Nicolas Grønlund, Jamal Alishov, Jeremy, Tyler Richard Trumpie, Anders Ryssdal, Billy Carr, Yuma Kobayashi, Rumo, Sarasomniac, Prasanth Madhurapantula, Will Regan-Jones, Elijah and William Krastev, MI, Luke Clews, Adam Garner, Steffen Halstrick, Zac Clennell, ab, Stephen Mulshnock, Alex, Dr. Chill, Michael Cross, Jan, Artemaeus, Fergus Costello, Kamil Kowalski, Lucas Furtado, Doru Vraja, Brad Wasbrough", "link": "https://www.youtube.com/watch?v=lheapd7bgLA", "date_published": "2022-02-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]