[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Destiny 2: The Witch Queen & Season of the Risen Preview", "description": "Phil Hornshaw got an early preview at Destiny 2's upcoming Witch Queen expansion, including a look at the campaign, weapon crafting, and Void 3.0.\n\nSome of the best environments that have ever existed in the Destiny world appeared in the Dreadnaught--the massive warship, dungeon, and personal hellscape of Oryx, the Taken King. Exploring the Dreadnaught was the peak of the original Destiny, as it was both a horrifying place to find yourself trapped in, and a delightfully dense landscape full of mysteries to uncover. In the upcoming Destiny 2 expansion The Witch Queen, players are again delving into the throne world of a deadly Hive god. With Savathun's throne world, though, developer Bungie looks to be pushing even harder on creating a twisted locale filled with frightening threats and deadly secrets.\n\nWe recently got a chance to see about an hour of The Witch Queen in action during a hands-off preview, in which Bungie took us through the new destination, demonstrated some elements of the expansion's new story campaign, and showed how new things such as weapon crafting will work.\n\n\nTimestamps:\n00:00 - Intro\n00:56 - Savathun's Throne World\n03:44 - The Campaign\n06:13 - Season of the Risen\n07:52 - Enclave & Weapon Crafting\n11:14 - Void 3.0\n13:02 - Outro", "link": "https://www.youtube.com/watch?v=PUud6SeNrDg", "date_published": "2022-02-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Lost Ark Developers React To Launch Issues | GameSpot News", "description": "Lost Ark suffers from issues on Steam, Call of Duty: Vanguard and Warzone Season 2 details are revealed, and Fortnite’s compatibility with Steam Deck becomes doubtful. \n\nIn this video, DeVante talks about Lost Ark players experiencing an issue with being able to download the game. The official Lost Ark Twitter confirmed the issue and went on to say it is working with Steam to resolve the problem. \n\nLater in the video, DeVante talks about new details for Vanguard and Warzone Season 2 as well as the Steam Deck’s lack of Fortnite support at launch. \n\nTimestamps\n00:00 - Intro\n00:08 - Lost Ark Suffers From Issues On Steam\n01:12 - Vanguard & Warzone Season 2 Details\n02:07 - Fortnite Won't Be Playable On Steam Deck", "link": "https://www.youtube.com/watch?v=113qGRrjM_U", "date_published": "2022-02-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Legends: Arceus - 12 Things You Didn't Know", "description": "We dove into Pokémon Legends: Arceus and all the changes the game brings to the Pokémon franchise. We found a bunch of interesting quirks and revamped systems! From swapping mounts on the fly to having a Pokémon play dead for a photo op, here are 12 things you didn't know about Pokémon Legends: Arceus\n\nPokémon Legends: Arceus has overhauled what longtime fans of the Pokémon franchise expect from mainline games. With a revamped story and many Hisui variants of classic Pokémon, there are plenty of new quirks and hidden things the game lets you discover on your own.\n\nWe've compiled several things we've learned that both newcomers and veterans may not know in this video. From an efficient way to swap mounts on the fly, to even taking Instagram-worthy photos with your Pokémon. Here are 12 things you didn't know about Pokémon Legends: Arceus\n\nCheck out our formal video review, as well as our breakdown of 14 tips that we wish we knew when starting on our new Pokémon journey, all on our YouTube channel. Don't forget to like and subscribe if you want more Pokémon content, and for everything else, stick to GameSpot!\n\n#pokemon #gamespot\n\nTimestamps: \n0:00 - Intro\n0:39 - Swap Mounts On The Fly\n1:29 - Spam Pokéballs\n1:53 - Pokéball Steam Dictates Catch Difficulty\n2:30 - Chill With Your Team\n3:08 - Change The Weather\n3:38 - XP Gains Aren't The Same As Before\n4:14 - Status Effects Are Reworked\n4:40 - Moves Have Been Reworked\n6:00 - Choose Your Own Legendary\n6:53 - Your WiFi is Off\n7:13 - Menu Screen Will Change\n7:35 - Your Pokémon Can Play Dead\n8:03 - Outro", "link": "https://www.youtube.com/watch?v=vjmKrdO7m7o", "date_published": "2022-02-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "15 Minutes Of Far Cry 6 Joseph: Collapse DLC Gameplay", "description": "Watch Joseph literally bible-thump people out of existence in the final villain-focused DLC for Far Cry 6.", "link": "https://www.youtube.com/watch?v=dHMX8KhGqFk", "date_published": "2022-02-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dying Light 2 Hits Milestone On Steam Despite Bugs | GameSpot News", "description": "Dying Light 2: Stay Human has a huge start on Steam, Batman: Arkham Collection possibly leaked for Nintendo Switch and you can sign up for PSVR2 pre-order notifications. \n\nIn this video, DeVante talks about Dying Light 2: Stay Human’s impressive first weekend numbers on Steam. The game’s popularity grew rapidly despite the its buggy launch that has included issues with co-op as well as crazy spinning heads just to name a few. Dying Light 2 is also available on PlayStation and Xbox consoles, but player data for those platforms is not available.\n\nSTAMPS\n00:00 - Intro\n00:06 - Dying Light 2\n00:53 - Batman on Switch?\n01:36 - PSVR2 Info", "link": "https://www.youtube.com/watch?v=RhLWbZskA7Y", "date_published": "2022-02-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Parents React to FINAL FANTASY XIV: Endwalker", "description": "Renowned FINAL FANTASY expert Jesse Cox gets his parents to react to FINAL FANTASY XIV: Endwalker. This expansion is the thrilling final chapter in the Hydaelyn and Zodiark story bringing a variety of new dungeons, jobs, and updates to the game! (In Partnership with Square Enix)\nPlay now: https://bit.ly/3mbPBlM", "link": "https://www.youtube.com/watch?v=cl7t5IjgMvU", "date_published": "2022-02-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]