[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Rainbow Six Extraction Final Preview", "description": "Rainbow Six Extraction is built from Siege's DNA but seems to be missing some of the best key strands. \n\nJordan got to spend 6 hours of hands on time with Rainbow Six Extraction playing two maps located in San Francisco and New York. One stand out note is that the maps are substantially larger than their Rainbow Six Siege predecessors but they are way more horizontal compared to those found in Siege, where verticality plays a larger role in both map design and navigation. This is only based on the two maps listed above. \n\nIn Extraction, several of Rainbow's operators are recruited to join a special team tasked with combating the parasitic alien Archaeon threat that's spread throughout North America. That mission takes you to four different zones, each of which are divided into three maps, and each of those maps in turn are cut into three separate regions. So, for example, the San Francisco zone is split into the Tenderloin, Enterprise Space Foundation, and Apollo Casino & Resort maps.", "link": "https://www.youtube.com/watch?v=65p4-n68qB0", "date_published": "2022-01-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Minecraft Froglight Blocks Are Coming! | GameSpot News", "description": "In this episode of GameSpot news, we talk about Minecraft adding Froglights blocks, Jedi: Fallen Order sequel reportedly being announced this year, and new details on rumored the Last of Us PS5 remake.\n\nIn this video, DeVante talks about Minecraft’s beta update that introduces Froglight blocks to the game. These blocks emit light and there are 3 new types: pearlescent, verdant, and ochre. The update also brings new audio and animations to frogs and tadpoles. \n\nDeVante also talks about Jedi: Fallen Order sequel reportedly being announced this year before E3. As well as new details on rumored the Last of Us PS5 remake.\n\nTIME STAMPS\n00:00 - Intro\n00:08 - Minecraft Froglight Blocks\n01:08 - Jedi: Fallen Order 2\n02:14 - Rumored the Last of Us PS5 remake\n03:17 - Outro", "link": "https://www.youtube.com/watch?v=PbYtZin_8RE", "date_published": "2022-01-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Razer CES 2022 Livestream", "description": "Live from the RazerStore in Las Vegas, see all the new announcements for everything Razer is showing off at CES 2022.", "link": "https://www.youtube.com/watch?v=8eWaKW5-8AA", "date_published": "2022-01-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Razer's New Zephyr Pro Mask Presentation at CES 2022", "description": "Check out the Razer Zephyr Pro the new upgraded version of the Zephyr RGB mask with new features. Learn more in this video on what to expect from the product. Learn more from the latest Razer Store Livestream at CES 2022.\n\nBreathe freely and be heard clearly with the Razer Zephyr Pro—the next generation in our award-winning concept. Stay safe with its replaceable N95 Grade filters for daily protection. Stay social with its transparent design, illumination, and voice-amplification for seamless communication. Stay sustainable with its reusable nature for long-term use.\n\n#Razer #CES2022", "link": "https://www.youtube.com/watch?v=XDxSXrfe99c", "date_published": "2022-01-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]