[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Marvel's Midnight Suns Everything To Know", "description": "Marvel's Midnight Suns is far from a superhero reskin of XCOM. It’s got a card-based combat system and a more substantial focus on roleplay and getting to know your fellow heroes. Here’s everything you need to know about Marvel’s Midnight Suns.\n\nMarvel's Midnight Suns is the new game from  Firaxis Games, the studio behind Civilization and the past three XCOM titles. It’s far from a superhero reskin of XCOM, however, as it’s got a card-based combat system and a more substantial focus on roleplay. In the above video, we run you through everything you need to know about the upcoming game, from plot details to gameplay and what kinds of DLC to expect. \n\nThe story in Midnight Suns is based loosely on the '90s comic book series Rise of the Midnight Sons, a crossover event that paired up the Avengers with more supernatural and magic-based characters to stop a demonic threat. You'll be playing as a new character, The Hunter, and you'll round up a team of Marvel mainstays like Dr Strange, Captain Marvel, Wolverine, and Blade. Midnight Suns is turn-based, but has a major twist: instead of set abilities, your heroes have ability cards.\n\nStay tuned to GameSpot for our upcoming Marvel's Midnight Suns review, and for more on the game, make sure to check out the channel and gamespot.com, we've got gameplay and hands on impressions up now. \n\n#midnightsuns #fireaxis #gamespot\n\nTimestamps: \n00:00 - Intro\n00:22 - Plot\n01:25 - Gameplay\n06:22 - DLC\n07:05 - Platforms & release info", "link": "https://www.youtube.com/watch?v=gXdu1C0J3wg", "date_published": "2022-11-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Callisto Protocol - Everything To Know", "description": "Striking Distance Studio's brutal survival horror The Callisto Protocol is bringing sci-fi horror back to the mainstream. Check out this video to learn everything you need to know about the upcoming game.\n\nThey say that in space, no one can hear you scream. We’ll see if that’s still the case when you’re being attacked by gruesome mutated humans in a prison on the moon of Jupiter. That's what’ll be happening to you in The Callisto Protocol, a game created by the twisted minds behind Dead Space. \n\nThe Callisto Protocol releases on December 2, 2022 and will be available for PC, PS4, PS5, Xbox One, and Xbox Series X|S.\n\nWhy Horror Games Are Good For You | MindGames - https://www.youtube.com/watch?v=NgKSDpmvW34&t=3s\n\nThe Terror Of Liminal Spaces In Video Games - https://www.youtube.com/watch?v=tX_EqcflUpw&t=482s\n\n00:00 - Intro\n00:23 - Plot\n01:09 - Gameplay\n04:21 - DLC\n05:22 - Development Team\n07:09 - Release Date & Price", "link": "https://www.youtube.com/watch?v=-3HsXdh1D-s", "date_published": "2022-11-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Witcher Remake To Be Fully Open World | GameSpot News", "description": "The remake of the original Witcher game is getting a huge change, Starship Troopers Extinction is announced, and video games will be a part of James Gunn's new DCU.\n#Gaming #TheWitcher #CDProjektRed \n\nThe remake of the original Witcher is making at least one massive departure from its source; it’ll be open world, a feature that didn’t come to the franchise until 2015’s The Witcher 3, which is getting a next gen update on December 14. \n\nCodenamed Canis Majoris, and developed by third party studio Fool’s Theory, the remake will be built from the ground up in Unreal Engine 5, with former CD Projekt Red developers working on the project. The news that the game will be open world came as a part of the publisher CD Projekt’s most recent earnings report.\n\nBoth the original Witcher and its sequel, Assassin of Kings, featured large open zones players could explore. However, progressing the story past certain key points would move players to a new zone, closing off the previous area entirely. \n\nOn top of Canis Majoris, two other Witcher projects are currently in development: Polaris and Sirius. Sirius has been described as an innovative take on the series that is aimed at both veteran fans and people new to the franchise. Currently in pre-production, it is being developed by Flame in the Flood developer The Molasses Flood and has 60+ people involved in its creation.\n\nProject Polaris is described as a story-driven open-world RPG built on the legacy of The Witcher 3: Wild Hunt and has more than 150 people working on it at CD Projekt Red. This game will be the start of a new Witcher trilogy that is aiming to be delivered within a 6-year period following the Polaris release.\n\nFrom fantasy monster slaying to sci-fi monster slaying, Developer Offworld Industries has revealed Starship Troopers: Extermination, a new game based on the cult-classic 1997 sci-fi film.\n\nExtermination will recruit you into the Deep Space Vanguard, an elite Special Forces group within the Mobile Infantry that has been sent to deal with a particularly deadly bug outbreak on the planet of Valaka.\n\nOnce on the ground, 12 players will form up into four squads and will begin working on gathering resources, building a base, establishing defenses, and exterminating every bug in sight. Remember, the only good bug is a dead bug. \n\nThree playable classes--Assault, Support, and Defense--will be available from launch and a progression system will allow for new weapons, equipment, and perks for each class to be gradually unlocked.\n\nThe game will launch first on PC via Steam early access in 2023.", "link": "https://www.youtube.com/watch?v=_qEQUDQJ8C8", "date_published": "2022-11-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "SCAR: The SOCOM Rifle That Became A Fortnite Icon - Loadout", "description": "Since the early 2000s, the SCAR-L and SCAR-H Assault Rifles have become mainstays in our video games. But what are the differences between the two, how did they become such essential additions to our gaming arsenals, and do they deserve their place among other iconic assault rifles like the M16 and AK-47?\n\nIn this episode of Loadout, Dave Jewitt visits the Royal Armouries to talk to Keeper of Firearms & Artillery Jonathan Ferguson about the real world history of the SCAR-H and SCAR-L Assault Rifles, from their SOCOM origins to their surprising pop culture impact in video games like Call of Duty and Fortnite.\n\nYou can check out more episodes of Loadout right here. - https://www.youtube.com/watch?v=yzSrmGkpWKk&list=PLpg6WLs8kxGMzIemU1gyyLmg5VlKI2UvC\nYou can check out our Firearms Expert Reacts series here. - https://www.youtube.com/watch?v=5FVzcoRjoN4&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/", "link": "https://www.youtube.com/watch?v=pU8prp8Z_vg", "date_published": "2022-11-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]