[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "GNOME 43: building a better Linux platform takes time", "description": "Download Safing's Portmaster, or subscribe to the SPN, and take control of your network traffic: https://safing.io/portmaster \nGrab a brand new laptop or desktop running Linux:https://www.tuxedocomputers.com/en#\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to a weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYouTube: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n📹 MORE VIDEOS FROM ME\nLinux news in Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\nGaming on Linux: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nI'm also on ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n🏆 FOLLOW ME ELSEWHERE:\nTwitter : http://twitter.com/thelinuxEXP\nMastodon: https://mastodon.social/web/@thelinuxEXP\nPixelfed: https://pixelfed.social/TLENick\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\nThis video is distributed under the Creative Commons Share Alike license.\n\n#linux #gnome43 #desktop \n\n00:00 Intro\n00:42 Sponsor: Monitor and secure your internet connection\n01:37 GNOME Shell and quick toggles\n04:13 Nautilus gains some, and loses some\n08:07 Device Security: incomplete but a good first step\n09:39 Application updates\n13:05 The missing piece\n13:52 GNOME 43: is it worth the upgrade?\n15:32 Sponsor: Gat a device that runs Linux perfectly\n16:34 Support the channel\n\nThe new quick toggles let you enable or disable these features in one click. Clicking the little arrow will expand the setting, letting you switch to another wifi network, change the power profile on your laptop, or even select the audio output and inputs.\n\nIn the apps grid, you now get some pagination arrows to let you move easily from one page to the other if you're not using a touchpad.\n\nThe File manager has also received a lot of love. First, it's now adaptive. The list view also makes it a lot easier to select multiple files and folders. There's also some blank space between elements so you can use the context menu inside the current directory, and it lets you drag the mouse to select multiple files.\n\nThe properties dialog has also been revamped, the recents folder can now be sorted, and the search UI saw a nice revamp as well, with a filter icon replacing the drop down arrow Nautilus used previously.\n\nYou can also middle click the next or previous button to open the resultant directory in a new tab, thumbnails with transparency will display a checkerboard background, you can copy the current path to the clipboard from the context menu, or open the current directory in other apps from the same menu, and the tabs have a new look.\n\nThe new Device Security page is accessible from the Privacy panel, and it gives you some details about the status of your hardware and firmware. All of this is combined into a security level ranging from 0 to 3, 3 being the highest, that will let you know whether your hardware is safe or not.\n\nThe Calendar is getting a new sidebar with a datepicker and an agenda view, and it's responsive. You also get a new pinch to zoom gesture to scale the main view.\n\nEpiphany now supports webextensions, so you can install Firefox and Chrome extensions inside it. All you have to do is download the xpi or crx file, and add them from Epiphany's \"Extensions\" menu. Epiphany also gets the \"view source\" option.\n\nGNOME software also got some love, with performance tweaks and improvements, and a better drop down to select the packaging format, now indicated by a big colored pill. You'll also be able to see other apps made by the same developer as the one you're currently looking at.\n\nIf you installed web apps using GNOME web, and if your distro has that support enabled, GNOME software can also manage web apps.\n\nGNOME contacts can now import and export vcard contacts, which is nice, because that's a pretty basic feature for a contacts app.", "link": "https://www.youtube.com/watch?v=wefK40cjz9s", "date_published": "2022-09-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]