[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Girl Ultra: Tiny Desk Concert", "description": "From Sept. 15 through Oct. 15, Tiny Desk is celebrating Latinx Heritage Month with an \"El Tiny\" takeover, featuring Jessie Reyez, Susana Baca and more musicians from all corners of Latinidad.\n\nStefanie Fernández | Sept. 21, 2022\nGirl Ultra's music is never one thing for long. After coming up in Mexico City's alt R&B scene, Mariana de Miguel built on that premise with experiments in house, bolero, pop and punk, fused with her own distinct glint. Her El Tiny performance is an effortless flash of all she is capable of and of the commanding performance she's finessed over her career. Even the onomatopoeic chorus of house track \"BOMBAY\" translates seamlessly to the desk.\n\nSlowed and acoustic as it is, the El Tiny version of \"Punk\" captures the frenetic rush of the original, itself an alt transfiguration of Gwen Stefani's \"Bubble Pop Electric\" that interpolates its pop chorus and tailors it to the allure of going out in the south side of Mariana de Miguel's hometown of Mexico City. \"Dime tú que voy a hacer con este feeling,\" (\"You tell me what I'm going to do with this feeling\") she asks, ostensibly of the person she's singing about. But it's also a question that speaks to the mutability of her performance: effusive and commanding, but never lacking a controlled restraint as it evolves. As she sings in \"DameLove,\" \"feelings always come and go.\"\n\nShe begins her El Tiny performance of that song by playing a few moments of the recorded version. Cuco's voice and hers float in from the drum machine, warped, as she flutters her fingers in front of her face, cultivating mystery against the familiarity of the setting for a solo rendition of the song that feels even more intimate.\n\nShe describes the final song of her set, \"Ella Tú y Yo\" from 2019's Nuevos Aires, as \"about finding a third one in a relationship – which is pretty common these days.\" Here, she reworks the R&B ballad into a simmering indie rock churn, its titular phrase whispered with a soft wince.\n\nJust one album and an EP into her career, Girl Ultra has already commanded change — as necessary and sometimes difficult as it can be — as a driver of expression. Here, it's thrilling.\n\nSET LIST\n\"BOMBAY\"\n\"Punk\"\n\"DameLove\"\n\"Ella Tú y Yo\"\n\nMUSICIANS\nGirl Ultra: vocals, guitar\nSami Mendoza: drums\nAndrea Martínez: bass\nSantiago Mijares: keys\n\nTINY DESK TEAM\nProducer: Anamaria Sayre\nAudio Engineer: Natasha Branch\nAudio Mix: Josh Rogosin\nDirector: Kara Frame \nCreative Director: Bob Boilen\nSeries Producer: Bobby Carter\nEditor: Michael Zamora\nVideographers: Kara Frame, Joshua Bryant, Michael Zamora\nAudio Assistant: Hannah Copeland\nProduction Assistant: Jill Britton\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=aQcXSoamCVA", "date_published": "2022-09-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]