[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "For Migrant Women Farmworkers, Abuse Often Comes with the Job (full documentary) | FRONTLINE", "description": "FRONTLINE and Univision News uncovered the hidden price that many migrant women working in America’s fields and packing plants pay to keep their jobs and provide for their families. (Aired 2013)\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nFor the women who pick and package the food we eat every day, sexual assault often comes with the job. “Rape in the Fields/Violación de un Sueño” investigated why female farmworkers, especially those who are undocumented, fall prey to field bosses and co-workers — and run the very real risk that they’ll lose their jobs or be deported if they dare to denounce their attackers.\n\nExplore additional reporting on \"Rape in the Fields\" on our website:\nhttps://www.pbs.org/wgbh/frontline/documentary/rape-in-the-fields/\n\n#Documentary #Frontline #Univision #Migrants #SexualHarassment\n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nFRONTLINE is produced at GBH in Boston and is broadcast nationwide on PBS. Funding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.\n\nCHAPTERS:\nPrologue - 00:00\n“Sexual Harassment is an Epidemic in the Fields” - 00:57\nAn EEOC Investigation into an Apple Grower  - 14:46\nFor Undocumented Victims, the Fear of Deportation  - 20:05\nPattern of No Criminal Charges for Sexual Violence Against Farmworkers  - 34:15\nLawsuits and Outcomes  - 42:40\nCredits - 51:56", "link": "https://www.youtube.com/watch?v=tRGTNchcfZU", "date_published": "2022-09-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]