[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "The Lion King: Tiny Desk Concert", "description": "Josh Rogosin | November 11, 2022\nActors and musicians on Broadway have a grueling performance schedule: eight shows a week with only Mondays off. Yet the band and cast of The Lion King were ecstatic to spend their one free day traveling from New York to Washington, D.C. to celebrate 25 years of the iconic musical with a performance at NPR’s Tiny Desk.\n\nMany of the songs written by Elton John and Tim Rice will be familiar — like the Oscar-winning “Can You Feel the Love Tonight” and “Hakuna Matata.” But the cast also treated the enthusiastic Tiny Desk crowd to songs written just for the stage. “They Live In You” wasn’t in the original movie, but is sung in the show by Mufasa (L. Steven Taylor) to his cub Simba (Brandon A. McCall). The young lioness Nala sings “Shadowland'', another gem from the musical sung by Pearl Khwezi (the first South African cast in the role).\n\nInfused throughout the music of The Lion King is spine-tingling African rhythm and language. It’s as captivating as the groundbreaking costume design by director, co-writer and artist Julie Taymor. The team at Disney Theatrical sent the masks of Simba and Nala in time to be prominently displayed on the desk during the concert. Examining their details up close gave me chills — just like the ones I felt watching the show at the New Amsterdam Theatre, way back in 1997 when the musical first debuted.\n\n\nSET LIST\n“Circle of Life”\n“They Live in You”\n“Can You Feel the Love Tonight”\n“Hakuna Matata”\n“Endless Night / Shadowland”\n“Circle of Life” (Reprise)\n\nMUSICIANS\n\nCAST\nL. Steven Taylor\nTshidi Manye\nBrandon A. McCall\nPearl Khwezi\nLindiwe Dlamini\nMduduzi Madela\nS’bu Ngema\n \nMUSICIANS\nJim Abbott: keyboard, guitar\nAnders Bostrom: flutes\nDavid Kuhn: bass\nRolando Morales-Matos: percussion\nJuan Carlito Mendoza: drums\n\nMusic Arrangements\nJim Abbott\n \nThe Lion King Broadway Resident Director\nRufus Bonds Jr.\n\nTINY DESK TEAM\nProducer/Audio Engineer: Josh Rogosin \nDirector/Editor: Kara Frame \nCreative Director: Bob Boilen \nSeries Producer: Bobby Carter\nVideographers: Kara Frame, Maia Stern, Joshua Bryant, Sofia Seidel\nAnimator: Jackie Lay\nAudio Assistant: Natasha Branch\nProduction Assistant: Jill Britton\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #thelionking", "link": "https://www.youtube.com/watch?v=cx67TnQrqcg", "date_published": "2022-11-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]