[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best PlayStation Plus Games To Play In September 2022", "description": "It’s September, which means pumpkin-spiced lattes, an influx of Green Day memes, and a whole bunch of new games are coming to PlayStation Plus. Regardless of which subscription plan you’re on, there are plenty of games to download, stream, and enjoy; here’s what you can expect.\n#Gaming #GameSpot #PlayStationPlus \n\nPlayStation Plus changed during summer 2022, going from one plan to three, with each plan offering various benefits including cloud saves, game trials, and, crucially, a bunch of games to download and play. If you have PlayStation Plus Premium, you’ve got hundreds of games at your fingertips, and if you’re suffering from choice paralysis, then have no fear, each month we’ll round up the new additions and guide you on what to play first.\n\nFirst up are the new monthly games added to PlayStation Plus. You get access to these regardless of which PS Plus plan you have, all you gotta do is add them to your library and they are yours as long as your subscription is active. One of September’s offers is Need for Speed Heat for PS4, which pitsting you against the police as you climb your way up the ladder to become the best of the best at street racing. Earn resources to upgrade your cars by taking part in the Palm City Speedrunner Showdown during the day, and take part in street races by night to boost your reputation.\n\nIf you have the PlayStation Plus Extra or Premium plan, you can access the Game Catalog, as well as the Ubisoft+ Classics collection. First up, Deathloop for the PS5. Now, this one’s special for us here at GameSpot because not only did we give it a rare 10/10, but we also awarded it our 2021 Game of the Year. It’s the latest from Arkane Lyon, the developers behind Dishonored, and it has possibly the coolest premise for a game that we’ve ever heard.", "link": "https://www.youtube.com/watch?v=PLovEMHIGGg", "date_published": "2022-09-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Call Of Duty: Modern Warfare 3’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of the Call Of Duty: Modern Warfare 3, including the Remington ACR, the Accuracy International AS50, and the H&K XM25.\n\n00:00 - Opening\n00:47 - FN Five-seven\n02:21 - Magpul FMG-9\n03:26 - Fusil Automático Doble\n04:33 - Remington ACR\n06:12 - PP-90M1\n07:25 - USAS-12\n09:35 - MP-412 Rex\n11:24 - Colt CM901\n13:00 - Remington MSR\n14:01 - Accuracy International AS50\n15:41 - H&K XM25\n17:10 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down more of the guns of Call Of Duty: Modern Warfare 3 and compares them to their real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=BH75HB0c340", "date_published": "2022-09-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Why We Gave The Last of Us Part I 8/10 | GameSpot After Dark Ep 160", "description": "This week on After Dark, we talk about our review for The Last of Us Part I and give our spoiler-free thoughts on Immortality. Plus we discuss the news around Halo Infinite canceling split-screen co-op, Assassin's Creed Mirage, and the rumored Zelda Nintendo direct.\n\n#gaming #lastofuspart1 #immortality \n\nTimestamps:\n0:00:00 - Intro\n0:07:44 - The Last of Us Part 1\n0:23:58 - Immortality\n0:42:32 - Flintlock: The Siege of Dawn\n0:52:29 - Destiny 2 King's Fall Raid\n0:57:41 - Halo Infinite Cancels Split-Screen Co-op\n1:14:25 - Assassin's Creed Mirage Announced\n1:24:41 - Rumored Zelda Nintendo Direct\n1:29:41 - Question of the Week", "link": "https://www.youtube.com/watch?v=ngjZalpbdNA", "date_published": "2022-09-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Things You Didn't Know About The Last Of Us", "description": "The Last of Us is a series that revels in creating tiny “ah-ha'' moments throughout its journey. If you didn’t get a chance to experience these fun homages and legendary tales, here’s 10 things you didn’t know about The Last of Us.\n\nWarning these can be pretty spoiler heavy, so proceed with caution.\n#gaming #thelastofus #gamespot #naughtydog \n\nStu here to spot the references and hidden details throughout the world of The Last of Us. Although known for crafting some of the most immersive worlds through their storytelling and stunning (as well as horrifying) visuals; Naughty Dog has spared no expense when it comes to their secrets. Spanning both games, Naughty Dog has sneakily hidden a ton of in-references, along with other fun connections to the greater world outside of Joel and Ellie's zombie stricken landscape. These secrets don’t necessarily jump out at you to take you away from the moment to moment action, but rather they fill in the gaps and make the world immensely rich and layered experience. From Hotline Miami to AC/DC to legends of the outbreak, stick around to see how deep these secrets go. \n\n00:00 Intro\n00:24 Music To My Ears\n03:21 Get Your Eyes Checked, Kid\n03:38 Well Read\n04:46 The Naughty Dog - Verse\n06:19 Don't Stop Me Now\n06:33 Not Today Capitalism\n06:55 The Legend Of Ish\n08:29 Movie Magic\n09:39 The 0451 Code\n10:13 The Last of Us: Vice\n10:33 Outro", "link": "https://www.youtube.com/watch?v=2Cp99e07mPo", "date_published": "2022-09-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 Reveal Planned Amid Expansion Rumors | GameSpot News", "description": "In this episode of GameSpot News, DeVante refreshes your memory on the Cyberpunk 2077 expansion rumors before the future of the game is officially revealed next week.\n#GamingNews #Cyberpunk2077 #GamePass \n\nCD Projekt Red says that it will reveal \"what's next\" for Cyberpunk 2077 in a livestream next week. Alongside its game, the company will also share some new information on the Cyberpunk Edgerunners series coming to Netflix soon that had a very NSFW trailer recently. \n\nThis new Night City episode will be streamed at 8 AM PT / 11 AM ET on September 6, but while we wait for that, let’s go over the story details for the upcoming expansion that appeared to have leaked online back in May 2022. \n\nAccording to VGC, which saw the leaked files and first reported on them, hundreds of lines of dialogue spelling out most of the events and characters of the expansion have appeared online. The dialogue points to a character named Songbird, who was datamined in Cyberpunk 2077, being the focus of the DLC. The expansion will reportedly take players to the Combat Zone and Sports Dome, which were both previously inaccessible spots across Cyberpunk 2077's setting Night City.\n\nWhile the side missions seem to mostly contain placeholder text, enough of the dialogue throughout shows that Johnny Silverhand, an AI of a rockstar played by Keanu Reeves, may have a more diminished presence in the expansion, though it's unknown exactly why that may be the case. That may come as a disappointment and shocker to many fans of Cyberpunk 2077, since Reeves' involvement was a major selling point for the game and a significant part of the title's marketing efforts once it re-emerged in 2019.\n\nSTAMPS\n00:00 - Intro\n00:09 - Cyberpunk 2077\n01:53 - Xbox Game Pass", "link": "https://www.youtube.com/watch?v=URLcYgZgynE", "date_published": "2022-09-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "GameSpot Swipe Mobile Showcase - What to Expect", "description": "Tune in for Swipe, GameSpot’s first ever mobile games showcase. Coming this September 8 at 10am PT, we'll be hosting a livestreamed event that puts the spotlight on the latest and greatest games for iOS and Android devices. We'll learn more about titles from Activision, EA, Ubisoft, Apple Arcade, Netflix, and much more. GameSpot Swipe will be broadcast on GameSpot, YouTube, and Twitch.\n\n#swipe #gamespot #gaming", "link": "https://www.youtube.com/watch?v=kwM7IEeiyz8", "date_published": "2022-09-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Gearbox PAX West 2022 Panel Livestream", "description": "Tune in for Gearbox Entertainment's PAX West 2022 Showcase, live from the main theater!\r\n\r\n#paxwest #gearbox #borderlands", "link": "https://www.youtube.com/watch?v=c7CCYrL3aZk", "date_published": "2022-09-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Hogwarts Legacy Touring The Common Rooms Gameplay (Gryffindor, Ravenclaw, Hufflepuff, Slytherin)", "description": "Get a quick tour of all 4 houses in Hogwarts Legacy. \n\nEnjoy a return to the familiar Gryffindor common room, nested inside one of the tallest towers at Hogwarts.\n\nHere’s a new look at the Ravenclaw common room, a brightly lit haven for knowledge and creativity.\n\nThe Hufflepuff Common Room, where cozy natural sunlight and an array of plants await.\n\nTake a tour of the Slytherin common room, located deep within the dungeons of Hogwarts Castle.\n\nTimestamps:\n0:00 Intro\n0:02 Gryffindor Common Room\n1:13 Ravenclaw Common Room\n2:22 Hufflepuff Common Room\n3:33 Slytherin Common Room", "link": "https://www.youtube.com/watch?v=dngETLI-888", "date_published": "2022-09-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "I Heart Dark Souls Extended", "description": "An extended episode of I Heart Dark Souls!\n#darksouls #gaming #iheartgaming #gamespot \n\nWhile Dark Souls isn't the first game in FromSoftware's now massively successful Soulsborne series, it was one of the most influential, spawning an entire genre of games influenced by its mechanics dubbed Souls-likes. Dark Souls has also gained passionate fans all around the globe. This is the story of Dark Souls, as told by those fans.\n\nJoin Adam Mason, Brad Ellis of Easy Allies, Caddicarus, Chris Morris, Dave Jewitt, DaveControl, Gav Murphy and Rory Powers of RKG, Super BunnyHop, HeyZeusHeresToast, Iron Pineapple, Jessie Gender, LobosJR, Lucy James and Tamoor Hussain of Giant Bomb, Marz, Otzdarva, Prod, Quelaag, and Sinclair and Sophie of SinclairLore as they tell the story of Dark Souls, and discuss the impact it had on both them and gaming.\n\nThe story of Dark Souls is told through though simple moments like finding shortcuts back to a bonfire in Undead Burg or Firelink Shrine, to the stunning moment when players first reach Anor Londo, to one of Dark Souls steepest challenges in the fight with Ornstein & Smough. The low moments like getting cursed in The Depths, to traversing the treacherous terrain of Blighttown are highlighted, all while leading to that rewarding feeling of overcoming an obstacle that at first felt insurmountable.\n\nLobosJR sings one of his favorite tracks of the game with the Asylum Demon fight, while Marz, Super Bunnyhop, and Sophie sing the famous \"pling pling plong\" of Gwyn's theme. Meanwhile, some curse every moment they spent in PvP, while others share their favorite moments of low-level PvP runs with evil glee.\n\nEnjoy an extended episode of I ❤️ Gaming with I ❤️ Dark Souls, and please consider watching our other episodes on Skyrim, Final Fantasy VII, Metal Gear Solid, Resident Evil 4, and Red Dead Redemption 2!", "link": "https://www.youtube.com/watch?v=y1sPUkYrj00", "date_published": "2022-09-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Tales from the Borderlands Official 18 Minute Gameplay Demo", "description": "Check out an extended gameplay look at the New Tales from the Borderlands that was showcased during Gearbox's Pax West showcase. \n\nIn this reveal, our three lovable losers must travel through the sewers of Promethea, racing against Tediore to open a dormant Vault. As they figure out a way past the Tediore guards, they must also battle for honor and glory in a Vaultlanders duel, with QTEs deciding the winner of glorious plastic combat!\n\n#borderlands #gearbox #gaming", "link": "https://www.youtube.com/watch?v=13tRse1fnG0", "date_published": "2022-09-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Tales from the Borderlands Official Character Trailer", "description": "In the New Tales from the Borderlands three nobodies band together to change their circumstances. \n \nWithin the perpetually war-torn metropolis of Promethea, you'll control Anu, Octavio, and Fran on the worst day of their lives.\n \nFran Miscowicz: A hard-working woman running her family's Frogurt shop, Fran answers to no one. Attacked out of spite during the Maliwan invasion, Fran's trying to put the pieces back together but life has other plans for her. \n \nOctavio Wallace-Dhar: As Meridian City's most popular citizen - at least in his own mind - Octavio is looking to be a Somebody. His big break is on the way and then comes the big payday!\n \nDr. Anuradha Dhar: The socially awkward genius who stumbles into an invention that could change the fabric of society itself. Anu dreams of a world where no one has to kill to get ahead.\n \n#borderlands #gaming", "link": "https://www.youtube.com/watch?v=h9mcEox6070", "date_published": "2022-09-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sonic Frontiers Official Overview Trailer", "description": "Get an overview of Sonic Frontiers in this latest trailer.\n\nWelcome to the Starfall Islands, a playground of speed with diverse platforming challenges, fearsome mechanized enemies, and ancient secrets to uncover. In search of his captured friends, Sonic must accelerate to new heights, unlock Cyber Space portals, unleash newly upgraded abilities, and explore this untamed land on his path to solving the mysteries of the Starfall Islands.\n\n#sonicfrontiers #sonic #gaming", "link": "https://www.youtube.com/watch?v=w8CeYK67vIw", "date_published": "2022-09-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]