[{"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Ukraine, COVID, And Monkeypox: Biden Asks Congress For Another $47 Billion To Address ‘Critical Needs For The American People’", "description": "The White House asked Congress for another $47 billion Friday to address what it considers “immediate needs,” including the spread of monkeypox at home and abroad, the never-ending fight against COVID, and the defense of Ukraine. President Joe Biden’s request to Congress is aimed at keeping the government open beyond the September 30 expiration of ...", "link": "https://www.dailywire.com/news/ukraine-covid-and-monkeypox-biden-asks-congress-for-another-47-billion-to-address-critical-needs-for-the-american-people", "date_published": "2022-09-02 19:53:51+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Ben Shapiro Shreds President Biden Over Controversial Speech", "description": "The Daily Wire’s Ben Shapiro slammed Democrat President Joe Biden during Friday&#8217;s broadcast of “The Ben Shapiro Show” over the widely criticized speech that the president delivered Thursday night in Philadelphia, saying that it was the worst speech he&#8217;s ever seen. Shapiro noted that when Biden claims his political opponents are the font of all ...", "link": "https://www.dailywire.com/news/ben-shapiro-shreds-president-biden-over-controversial-speech", "date_published": "2022-09-02 19:30:57+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Paul Pelosi Sold Computer Chip Stock In Time To Avoid Heavy Losses", "description": "Paul Pelosi, the husband of House Speaker Nancy Pelosi (D-CA), cut his losses in software company Nvidia before the United States placed new restrictions on computer chip sales to China and Russia. As noted by an analysis from MoneyWise, Pelosi sold 25,000 shares of Nvidia on July 26 at an average price of $165.05 — ...", "link": "https://www.dailywire.com/news/paul-pelosi-sold-computer-chip-stock-in-time-to-avoid-heavy-losses", "date_published": "2022-09-02 19:17:08+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Kanye: ‘What The F*** Is Kwanzaa And Who Made That Bulls*** Up?’", "description": "On Wednesday, rap icon Kanye West, who confused many of his followers when he acted in a friendly manner toward former President Trump, issued a tweet (later deleted) in which he questioned the validity of the holiday Kwanzaa. Kwanzaa was created by black activist Maulana Karenga in 1966; in 1971 he was convicted of felonious ...", "link": "https://www.dailywire.com/news/kanye-what-the-f-is-kwanzaa-and-who-made-that-bulls-up", "date_published": "2022-09-02 19:04:16+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "California Expected To Offer Tax Credit To Low-Income Residents With No Cars", "description": "The California legislature recently passed a measure that would give money to low-income households in the state who do not have a vehicle. The measure applies to single-filing people who don’t have a vehicle and have an adjusted gross income of $40,000, as well as those who file together and make up to $60,000 and ...", "link": "https://www.dailywire.com/news/california-offers-tax-credit-to-low-income-residents-with-no-cars", "date_published": "2022-09-02 18:21:06+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Department Of Veterans Affairs To Begin Offering Abortions To Vets, Even In States Where It Is Banned", "description": "The Biden administration will begin offering &#8220;abortion counseling&#8221; and, in some cases, abortions, to veterans through Department of Veterans Affairs (VA) hospitals &#8212; regardless of state law &#8212; in a move aimed at the Supreme Court decision overturning Roe v. Wade, the VA said Friday.", "link": "https://www.dailywire.com/news/department-of-veterans-affairs-to-begin-offering-abortions-to-vets-even-in-states-where-it-is-banned", "date_published": "2022-09-02 18:14:43+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Former NFL Player Arrested After Allegedly Breaking Into Hollywood Mansion Twice, Bathing In Fountain", "description": "Former Detroit Lions cornerback Stanley Wilson Jr. was arrested after he allegedly broke into a $30 million Hollywood mansion, raided the home, and took a bath in an outdoor fountain on August 24. The 39-year-old’s latest break-in was allegedly his second at the same property, causing damages of at least $5,000. Wilson Jr., who is ...", "link": "https://www.dailywire.com/news/former-nfl-player-arrested-after-allegedly-breaking-into-hollywood-mansion-twice-bathing-in-fountain", "date_published": "2022-09-02 17:29:05+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "21-Year-Old Beauty Queen Dies When She Opens Parachute Too Late Skydiving", "description": "A young beauty queen and TikTok influencer who also reached the semi-finals in the 2017 Miss Canada pageant tragically died when she reportedly released her parachute too late as she was skydiving. Tanya Pardazi, 21, who had 100,000 followers on TikTok under the name “Philosatea,” was assaying her first skydive when she jumped with Skydive ...", "link": "https://www.dailywire.com/news/21-year-old-beauty-queen-dies-when-she-opens-parachute-too-late-skydiving", "date_published": "2022-09-02 17:14:35+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Jane Fonda Reveals She’s Been Diagnosed With Cancer, Starts Chemo", "description": "Actress Jane Fonda shared the news with followers Friday that she&#8217;s been diagnosed with non-Hodgkin’s lymphoma, and has already begun chemotherapy treatments to deal with the cancer. In a lengthy post the 84-year-old activist shared on Instagram, Fonda talked about how she recognizes she&#8217;s privileged to have access to the &#8220;best doctors and treatments&#8221; available to ...", "link": "https://www.dailywire.com/news/jane-fonda-reveals-shes-been-diagnosed-with-cancer-starts-chemo", "date_published": "2022-09-02 16:59:34+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Mississippi Water Crisis Drags Into Fifth Day", "description": "Authorities in Jackson, Mississippi, are gradually making progress on returning water to residents and businesses. Multiple water pumps at the O.B. Curtis Water Treatment Plant failed earlier this week after severe storms caused the Pearl River to flood, prompting low water pressure and a risk of bacterial infection, according to a press release from the ...", "link": "https://www.dailywire.com/news/mississippi-water-crisis-drags-into-fifth-day", "date_published": "2022-09-02 16:52:32+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "FBI Raided Trump Of Books, ‘Clothing/Gift’ Items, News Clippings: Court Documents", "description": "A federal judge on Friday unsealed a more detailed list of items the FBI confiscated from Mar-a-Lago during an August 8 raid targeting former President Donald Trump. The 8-page document provides a fuller picture of what agents took from Mar-a-Lago, Trump’s Florida resort and residence after leaving the White House, though it still lacks specifics ...", "link": "https://www.dailywire.com/news/fbi-raided-trump-of-books-clothing-gift-items-news-clippings-court-documents", "date_published": "2022-09-02 16:36:43+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Jason Aldean Dropped By PR Firm After Wife’s Transgender Post", "description": "Country star Jason Aldean has been dropped by his public relations firm following the backlash against his wife Brittany Aldean&#8217;s social media post about transgenderism, despite her stating later that her comments were &#8220;taken out of context.&#8221; The public relations firm that has represented the 45-year-old country singer for the last 17 years announced in ...", "link": "https://www.dailywire.com/news/jason-aldean-dropped-by-pr-firm-after-wifes-transgender-post", "date_published": "2022-09-02 15:54:35+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Joe Rogan Slams Blood-Red, Dark Background Of Biden’s Speech", "description": "Joe Rogan reacted Friday to the blood-red background of President Joe Biden&#8217;s Thursday night speech in front of Independence Hall in Philadelphia. The host of Spotify&#8217;s “The Joe Rogan Experience” podcast posted his thought on the viral photo of Biden standing against the dark red and black background of the hall on Instagram. &nbsp; View ...", "link": "https://www.dailywire.com/news/joe-rogan-slams-blood-red-dark-background-of-bidens-speech", "date_published": "2022-09-02 15:27:03+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Tolkien Fans Should Not Reject Amazon’s ‘Rings Of Power’ Too Soon", "description": "Amazon’s “Rings of Power” is not J.R.R. Tolkien’s “The Lord of the Rings.” It’s not Tolkien’s “Hobbit.” It’s not even Tolkien’s “Silmarillion.” These will, naturally, be the standards by which fans of the greatest author the fantasy genre has ever known will measure the series. And by those standards, some are already deeming it a ...", "link": "https://www.dailywire.com/news/tolkien-fans-should-not-reject-amazons-rings-of-power-too-soon", "date_published": "2022-09-02 15:13:15+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "The Man Who Outsmarted The Devil", "description": "In the end, there were only two ways to die: accidentally or on purpose. Medication and replacement body parts had eliminated most of the so-called “natural causes” of death. All that was left were catastrophes, suicides and murders. Catastrophes happened all the time. Over a life span of a thousand years or so, the chance ...", "link": "https://www.dailywire.com/news/the-man-who-outsmarted-the-devil", "date_published": "2022-09-02 14:50:33+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "White House Claims Schools Reopened ‘In Spite of Republicans.’ Here Are Several Videos Of Democrats Defending Closed Schools", "description": "White House Press Secretary Karine Jean-Pierre raised eyebrows Thursday by suggesting that Republicans prevented schools from reopening sooner amid the rollback of government lockdowns. When a reporter questioned Jean-Pierre about dismal test results on the National Assessment of Educational Progress — which showed average scores for nine-year-olds declining five points in reading and seven points in mathematics ...", "link": "https://www.dailywire.com/news/white-house-claims-schools-reopened-in-spite-of-republicans-here-are-several-videos-of-democrats-defending-closed-schools", "date_published": "2022-09-02 14:33:13+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Biden Walks It Back: President Says Not All Trump Voters Are Bad After All", "description": "President Biden tried Friday to walk back his previous night’s primetime attack on former President Trump’s supporters, saying he doesn’t consider them all to be “a threat to the country” after all. Biden, who delivered the strident, 24-minute speech in front of Philadelphia&#8217;s Independence Hall with glowing red backlighting and U.S. Marines at his side, ...", "link": "https://www.dailywire.com/news/biden-walks-it-back-president-says-not-all-trump-voters-are-bad-after-all", "date_published": "2022-09-02 14:04:02+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Republicans Urge Voters To Answer Biden’s Angry Speech At Polls, Not On Streets", "description": "Republican leaders alarmed at the tone of President Joe Biden&#8217;s Thursday night speech urged conservatives to react at the polls and not on the streets. The speech, delivered at Philadelphia&#8217;s Independence Hall with glowing red and blue backlighting, was denounced by GOP leaders as angry and divisive. But conservatives urged Republicans not to be baited ...", "link": "https://www.dailywire.com/news/republicans-urge-voters-to-answer-bidens-angry-speech-at-polls-not-on-streets", "date_published": "2022-09-02 13:44:03+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "CNN White House Correspondent John Harwood Out At Network", "description": "CNN White House correspondent John Harwood is out at the network as its parent company, Warner Bros. Discovery, overhauls its composition and lineup. Harwood announced his departure Friday on Twitter. In a brief message, Harwood said he was proud of his work and thanked his colleagues. He added that he “look[s] forward to figuring out ...", "link": "https://www.dailywire.com/news/cnn-white-house-correspondent-john-harwood-out-at-network", "date_published": "2022-09-02 13:35:15+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "TikTok, Drones, And Huawei: China’s Triangular Digital War On The West", "description": "Mao Zedong told President Nixon in 1972 that Chinese troops “do not go abroad” in order to alleviate fears about massive intervention from Beijing as America was withdrawing from Vietnam. China has long criticized the U.S. as imperialistic for acting as the world’s policeman. Though, the Chinese Communist Party (CCP) is not without its own ...", "link": "https://www.dailywire.com/news/tiktok-drones-and-huawei-chinas-triangular-digital-war-on-the-west", "date_published": "2022-09-02 13:18:08+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Motherf***er Hit Me Over A Bulls*** Joke’: Chris Rock Unleashes On Will Smith Over Oscars Slap", "description": "Superstar Chris Rock unleashed on Will Smith over the actor slapping him at the 2022 Oscars, saying it was over a “bulls*** joke” and Smith showed he&#8217;s “as ugly as the rest of us.” The 57-year-old comedian took the stage Thursday alongside Dave Chappelle at Liverpool&#8217;s M&amp;S Bank Arena in the United Kingdom where Chappelle asked ...", "link": "https://www.dailywire.com/news/motherfer-hit-me-over-a-bulls-joke-chris-rock-unleashes-on-will-smith-over-oscars-slap", "date_published": "2022-09-02 12:56:24+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "G7 Finance Ministers Commit To Russian Oil Price Cap, Will Help Ukraine ‘For As Long As It Takes’", "description": "G7 finance ministers committed on Friday to jointly pursue a price cap on Russian oil. Members of the forum, which includes Canada, France, Germany, Italy, Japan, the United Kingdom, and the United States, announced the policy three months ago during a conference in Austria. A statement from the nations’ finance ministers published on Friday affirms ...", "link": "https://www.dailywire.com/news/g7-finance-ministers-commit-to-russian-oil-price-cap-will-help-ukraine-for-as-long-as-it-takes", "date_published": "2022-09-02 12:42:36+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "New Contract Proves Nick Saban Is One Of A Kind", "description": "This week, University of Alabama head football coach, Nick Saban, agreed to a $93.6 million contract extension that extends through February 2030. He will earn $11.7 million per season.  Not only does Saban’s agreement surpass Kirby Smart’s $11.2 million per year contract at Georgia, but it also includes a clause stating Saban’s guaranteed compensation can ...", "link": "https://www.dailywire.com/news/new-contract-proves-nick-saban-is-one-of-a-kind", "date_published": "2022-09-02 12:21:29+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Stolen Voting Machine Mysteriously Turns Up For Sale On EBay, Goodwill Site", "description": "A voting machine turned up for sale on eBay after vanishing from a Michigan county, and now the state is working with police to find out how it happened. The voter assist terminal from Colfax Township in Wexford County was put up for sale on eBay and linked to Goodwill, according to Cadillac News. State ...", "link": "https://www.dailywire.com/news/stolen-voting-machine-mysteriously-turns-up-for-sale-on-ebay-goodwill-site", "date_published": "2022-09-02 11:07:30+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Unemployment Rate Edges Upward For The First Time In Months As More Americans Return To Work", "description": "The unemployment rate increased to 3.7% in August 2022 even as more Americans returned to work, according to a Friday release from the Bureau of Labor Statistics. Total nonfarm payroll employment rose by 315,000, with notable job gains occurring in the professional services, health care, and retail trade sectors. However, the labor force participation rate ...", "link": "https://www.dailywire.com/news/unemployment-rate-edges-upward-for-the-first-time-in-months-as-more-americans-return-to-work", "date_published": "2022-09-02 10:43:04+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Earnie Shavers, Boxing Legend Whose Power Shook Ali And Even Sylvester Stallone, Dead At 78", "description": "Earnie Shavers, the hard-punching heavyweight who lost title fights to Muhammad Ali and Larry Holmes in the 1970s and once showed Sylvester Stallone what a real punch felt like, died Thursday, one day after turning 78. An Alabama native who grew up in Cleveland and turned pro in 1969, Shavers was known as “The Black ...", "link": "https://www.dailywire.com/news/earnie-shavers-boxing-legend-whose-power-shook-ali-and-even-sylvester-stallone-dead-at-78", "date_published": "2022-09-02 10:26:36+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "School Board Elections Are Political, So Stop Calling Parents ‘Domestic Terrorists’ And Make Candidates Self-Identify", "description": "There is nothing inherently wrong with politicizing school board elections. In fact, there are very few decent arguments against school board candidates placing a political party indicator next to their name in elections. The resurgence of parental interest in American education has been sparked by discoveries during the COVID lockdowns that shed light on decades ...", "link": "https://www.dailywire.com/news/school-board-elections-are-political-so-stop-calling-parents-domestic-terrorists-and-make-candidates-self-identify", "date_published": "2022-09-02 09:55:35+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Progressive’ Town Manager Who Spurred Mass Police Exodus Fired Despite Probe", "description": "A self-described “progressive” municipal manager who prompted an entire North Carolina town’s police force to resign has been fired after an investigation into whether she had created a toxic work environment. Justine Jones, who Kenly Police Chief Josh Gibson in July accused of creating a “hostile work environment,” had her contract terminated by a 3-2 ...", "link": "https://www.dailywire.com/news/progressive-town-manager-who-spurred-mass-police-exodus-fired-despite-probe", "date_published": "2022-09-02 09:39:30+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Lori Lightfoot Calls Greg Abbott A Racist For Sending Illegal Immigrants To Chicago", "description": "Chicago Democrat Mayor Lori Lightfoot, irate after Texas GOP Governor Greg Abbott had announced he would bus illegal immigrants to her city, attacked him, calling him a racist. Despite Lightfoot’s prior boasts that Chicago was a “sanctuary city,” Lightfoot felt compelled to derogate the idea of more illegal immigrants arriving in her strife-torn city. “He ...", "link": "https://www.dailywire.com/news/lori-lightfoot-calls-greg-abbott-a-racist-for-sending-illegal-immigrants-to-chicago", "date_published": "2022-09-02 09:20:52+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Grim Old Man Screaming’: Ben Shapiro, Others React To Biden’s Dark Speech Before Eerie Red Backdrop", "description": "President Joe Biden’s prime-time speech Thursday night, which featured a blood-red backdrop and a grim warning about the endangered “soul of America,” drew fierce reactions online, with critics branding the content divisive and the theatrics just plain weird. Biden, who framed the upcoming midterm elections as a fight between good and evil, stood flanked by ...", "link": "https://www.dailywire.com/news/grim-old-man-screaming-ben-shapiro-others-react-to-bidens-dark-speech-before-eerie-red-backdrop", "date_published": "2022-09-02 09:05:06+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Disney’s ‘She-Hulk’ Introduces Twerking To The MCU With Superstar Rapper Cameo", "description": "Disney Plus&#8217; new series “She-Hulk: Attorney at Law” has  introduced the Marvel Cinematic Universe (MCU) to the idea of twerking after superstar Megan Thee Stallion made a cameo appearance. On the latest episode of the streaming site&#8217;s new Marvel show, Tatiana Maslany, who plays She-Hulk/Jennifer Walters, gets a lesson on twerking when the “Savage” hitmaker ...", "link": "https://www.dailywire.com/news/disneys-she-hulk-introduces-twerking-to-the-mcu-with-superstar-rapper-cameo", "date_published": "2022-09-02 08:57:33+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "7 Country Singers Who Remain Unashamed Conservatives", "description": "There was a time when fans could safely assume that all country music stars leaned conservative, even if they didn’t explicitly say so. Now everything has become political and it’s hard to find any neutral celebrities. And what’s worse, it’s almost impossible to find any famous people who are brave enough to espouse conservative views, ...", "link": "https://www.dailywire.com/news/7-country-singers-who-remain-unashamed-conservatives", "date_published": "2022-09-02 08:50:35+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Dem Senatorial Candidate Admits: Democratic Brand ‘Is Not Good In A Lot Of These Places’", "description": "Ohio Democratic Rep. Tim Ryan, who is running against Republican J.D. Vance for the Senate seat to be vacated by GOP Senator Rob Portman, admitted that the “Democratic brand” could hurt him in the November election. Ryan was interviewed by Manu Raju of CNN, who pointed out that Ryan’s ads “do not emphasize he is ...", "link": "https://www.dailywire.com/news/dem-senatorial-candidate-admits-democratic-brand-is-not-good-in-a-lot-of-these-places", "date_published": "2022-09-02 08:37:44+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Libs Of TikTok, Babylon Bee CEO Team Up To Find Person Who Made Bomb Threat To Hospital", "description": "Babylon Bee CEO Seth Dillon offered thousands of dollars for information leading to the arrest of whoever called in a fake bomb threat to a children&#8217;s hospital this week. Boston Children’s Hospital received the threat Tuesday night, sparking a large police response as the hospital was searched and ultimately no explosive devices were found. Some ...", "link": "https://www.dailywire.com/news/libs-of-tiktok-babylon-bee-ceo-team-up-to-find-person-who-made-bomb-threat-to-hospital", "date_published": "2022-09-02 08:21:11+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Biden Slammed By Mainstream Journalists For Using Marines As Props While Attacking American Citizens", "description": "Democrat President Joe Biden faced backlash from mainstream news reporters Thursday night after U.S. Marines were positioned behind him during a highly polarizing political speech in which the president demonized millions of Americans as being “extremists” who posed a threat to the country. Biden repeatedly had to clear his throat and coughed throughout the speech ...", "link": "https://www.dailywire.com/news/biden-slammed-by-mainstream-journalists-for-using-marines-as-props-while-attacking-american-citizens", "date_published": "2022-09-02 07:44:59+00:00", "persistent": false, "user": null, "language": null}]