[{"source": "https://www.computerworld.com/index.rss", "title": "Windows 11 Insider Previews: What’s in the latest build?", "description": "<article>\n\t<section class=\"page\">\n<p><a href=\"https://www.computerworld.com/article/3635896/microsoft-lets-windows-11-loose-on-the-world.html\">Windows 11 has been released</a>, but behind the scenes, Microsoft is constantly working to improve the newest version of Windows. The company frequently rolls out public preview builds to members of its Windows Insider Program, allowing them to test out — and even help shape — upcoming features.</p><p>The Windows Insider program is divided into three cha", "link": "https://www.computerworld.com/article/3623370/windows-11-insider-previews-whats-in-latest-build.html#tk.rss_all", "date_published": "2022-09-02 13:19:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.computerworld.com/index.rss", "title": "Office 365: A guide to the updates", "description": "<article>\n\t<section class=\"page\">\n<p>Office 365 and Microsoft 365 subscribers get more frequent software updates than those who have purchased Office without a subscription, which means subscribers have access to the latest features, security patches, and bug fixes. But it can be hard to keep track of the changes in each update and know when they’re available. We’re doing this for you, so you don’t have to.</p><p>Following are summaries of the updates to Office 365/Microsoft 365 for Windows, wit", "link": "https://www.computerworld.com/article/3205187/office-365-a-guide-to-the-updates.html#tk.rss_all", "date_published": "2022-09-02 13:06:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.computerworld.com/index.rss", "title": "Apple wasn’t fooling when it said it wanted to make Macs more secure", "description": "<article>\n\t<section class=\"page\">\n<p>When Craig Federighi, Apple’s senior vice president of software engineering last year said, “We have a level of malware on the Mac that we don’t find acceptable,” he apparently really meant it. And Apple seems to be doing about something about it.</p><h2><strong>Apple is giant taking steps to secure the Mac</strong></h2>\n<p>Federighi characterized Apple as being in an enduring battle against malware on the Mac. He also explained that between May 2020 and May ", "link": "https://www.computerworld.com/article/3672528/apple-wasnt-fooling-when-it-said-it-wanted-to-make-macs-more-secure.html#tk.rss_all", "date_published": "2022-09-02 11:55:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://www.computerworld.com/index.rss", "title": "Decline in PC and tablet shipments will continue through 2023, says IDC", "description": "<article>\n\t<section class=\"page\">\n<p>Global shipments of PCs and tablets are in steep decline, but will pick up again in 2024, according to a new study by IDC.</p><p>Shipments of traditional PCs are forecast to decline 12.8% to 305.3 million units in 2022, while IDC expects tablet shipments will fall 6.8% to 156.8 million. The combined market for PCs and tablets will decline by 2.6% in 2023 before returning to growth in 2024, according to IDC. </p><p>It attributes the reduced outlook to inflatio", "link": "https://www.computerworld.com/article/3672409/decline-in-pc-and-tablet-shipments-will-continue-through-2023-says-idc.html#tk.rss_all", "date_published": "2022-09-02 11:51:00+00:00", "persistent": false, "user": null, "language": null}]