[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Catherine Russell: Tiny Desk (Home) Concert", "description": "NPR Music's Tiny Desk series will celebrate Black History Month with Tiny Desk (home) concerts featuring legends in the world of R&B, jazz, gospel, and hip-hop. Each artist in this legacy lineup has helped to define Black music as we know it and will be performing a Tiny Desk concert for the first time.\n\nSuraya Mohamed | February 11, 2022\nLook around the GB's Juke Joint studio in Long Island City, N.Y. and you will see adornments from jazz singer Catherine Russell's home: a vintage Royal typewriter, a black dial phone, a red tiny desk and a striking Malian Bògòlanfini cloth that drapes the piano. Black and white photos of Billie Holiday and old-time big bands rest on the shelves and piano along with a copy of Russells' soon-to-be-released album, Send For Me, out April 1.\n\nTwo-color paintings hang on the back wall. One was purchased by Russell from a local Panamanian artist while visiting Bocas Del Toro, her father's birthplace. The other is from the studio's collection: an image of Willie Dixon, one of the fathers of the early blues.\n\nRussell, a Grammy Award-winning vocalist, is one of the most recognized jazz artists performing today. Behind the mic, her satiny voice is robust and relaxed, and it's clear she and the band are having a ton of fun. They start this joyful set with a foot-stomping swing tune, \"The Darktown Strutters' Ball.\" Written by the African American composer Shelton Brooks, this popular early jazz standard hasn't lost its bounce more than a century later.\n\nRussell's music is informed by many early 20th century musicians, and especially inspired by the Black blues women of the 1920s. Her set highlights that influence with \"He May Be Your Dog But He's Wearing My Collar\" by vaudeville singer Rosa Henderson. She also sings a tune written by her father, Luis Russell, a renowned pianist and composer who was Louis Armstrong's long-time musical director. \"Lucille\" is a playful love story about Armstrong's fourth and longest-lasting marriage. The set ends with an inspiring bluesy song, \"You've Been A Good Old Wagon,\" one of the first ragtime songs ever published.\n\nSET LIST\n\"The Darktown Strutters' Ball\"\n\"He May Be Your Dog But He's Wearing My Collar\"\n\"Lucille\"\n\"You've Been A Good Old Wagon\"\n\nMUSICIANS\nCatherine Russell: vocals\nMatt Munisteri: guitar, banjo, musical director\nTal Ronen: bass\nMark McLean: drums\nSean Mason: piano\n\nCREDITS\nExecutive Producer: Paul Kahn\nTechnical Supervisor: Glen Forrest\nRecorded by Hector Castillo & Colin Mohnacs\nVideo Production: Ross Mayfield\nCameras: Ross Mayfield & Andrés Cottin\nFilmed at GB's Juke Joint, Long Island City, NY\n\nTINY DESK TEAM\nProducer: Suraya Mohamed\nVideo Producer: Joshua Bryant\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Maia Stern, Sofie Hernandez-Simeonidis, Ashley Pointer\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#catherinerussell #nprmusic #tinydesk #bhmxnprmusic", "link": "https://www.youtube.com/watch?v=vvTXMeexv5Y", "date_published": "2022-02-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]