[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dying Light 2 Best Bugs And Glitches", "description": "Bugs and glitches in games can be annoying, but they can also be hilarious. In this video, we've collected some of the best glitches from Dying Light 2: Stay Human.\n\n#DyingLight2", "link": "https://www.youtube.com/watch?v=RLnpyCBCVsM", "date_published": "2022-02-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To EVEN MORE Battlefield 4 Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Battlefield 4, including the AN94 assault rifle, the Swedish AK 5C, and the PKP Pecheneg.\n\n00:00 - Opening\n00:59 - L115 Long Range Rifle\n03:11 - PP-2000 Submachine Gun\n04:42 - IWI ACE 23 Assault Rifle\n06:29 - AK 5C Assault Rifle\n08:37 - AN-94 Assault Rifle\n11:20 - OTs-14 Groza Bullpup Assault Rifle\n12:49 - PKP Pecheneg Machine Gun\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down more of the guns from Battlefield 4 and compares them to their real-life counterparts.\n\nFirearms Expert Reacts To Battlefield 4’s Guns - https://www.youtube.com/watch?v=aIN7OP63lvs\n\nFirearms Expert Reacts To MORE Battlefield 4 Guns - https://www.youtube.com/watch?v=OolGxrGNXKY\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=lfqoA3WHDNI", "date_published": "2022-02-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "I Played Dark Souls for the First Time In 2022", "description": "If there’s one game series that sets a fire in the hearts of gamers, it’s Dark Souls. The franchise has become synonymous with intense difficulty, it’s lack of desire to be inviting to new players, and it’s polarized reception by gamers. So, to prove her skill in time for Elden Ring, producer Jessie Earl dove headfirst into the world of Lordran for the first time ever... and oh boy was she in for an emotional experience.\n\n0:00 - Prepping My Soul\n2:16 - Day 1\n8:36 - Day 2\n14:31 - Day 3 & 4 (AKA The Days That Broke Me)\n19:48 - Day 5\n24:29 - The Final Boss (or The Redemption of Kurt)\n27:50 - Outro\n\n#DarkSouls #FromSoftware", "link": "https://www.youtube.com/watch?v=ifqh1jJLnUA", "date_published": "2022-02-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "12 SIFU Combat Tips", "description": "Sifu is a demanding game that requires you to master the art of kung-fu on your quest for revenge and in this video, Persia goes over 12 useful tips to help you when you get your first taste of combat. \n\nFrom strategically unlocking abilities to learning combos, there are many different ways to fight your way through Sifu's brutal bosses. Making use of blocking, dodging, and parries can help you stay alive in the middle of a crowded fight and managing your environmental resources, weapons, and structure will be the key to dishing out damage.\n\nPersia also goes over combos, invulnerability frames, and more useful combat tips for the game that you might have overlooked. For more Sifu coverage, be sure to visit gamespot.com.\n\nTimestamps: \nIntro - 00:00\nInvulnerability Frames - 00:16\nLearn combos and use all of your tools - 01:02\nBlock, parry, and dodge - 01:53\nStructure System - 02:37\nBack away to regain Structure - 03:30\nDon’t underestimate your environment - 03:47\nTry to start each fight with a weapon - 04:11\nBuild with your age in mind - 04:50\nGrind levels to earn XP and permanent unlockable skills - 05:22\nShortcuts - 05:55\nFocus attacks - 06:13\nUse the cloud to manipulate saves - 06:15\nOutro - 07:22\n\n#SIFU", "link": "https://www.youtube.com/watch?v=MTkeek5OAUg", "date_published": "2022-02-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Warzone 2 Is Changing Everything! | GameSpot News", "description": "A sequel to Call of Duty: Warzone and 2019’s Modern Warfare, have been revealed. Here are all the newest details. \n\nIn this video, DeVante talks about a sequel to Call of Duty: Warzone and 2019’s Modern Warfare being revealed. According to Activision, the sequels to Modern Warfare and Warzone have been designed together from the ground up by Infinity Ward.\n\n#CallofDuty #Warzone2 #GameSpotNews", "link": "https://www.youtube.com/watch?v=kCrcx0YibXg", "date_published": "2022-02-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Horizon Forbidden West - Everything To Know", "description": "After a five-year wait, Horizon Forbidden West is just around the corner. As we prepare for its February 18th release, check out our video rounding up everything we know so far.\n\nTimestamps:\n00:22 - Plot & Setting\n01:43 - Gameplay\n04:34 - Platforms\n06:27 - DLC\n06:50 - Release Date & Price\n\nHorizon Forbidden West is the long-awaited sequel to one of PlayStation's biggest recent franchise starters, Horizon Zero Dawn. Set in a post-apocalyptic world where feral machines roam like beasts and dinosaurs, the seeds of a new civilization have emerged and begun to rebuild. But the nascent tribal societies are threatened by both the machines and each other. The heroine Aloy emerged as humanity's champion in Zero Dawn, and she's back to unlock new mysteries in Forbidden West as she journeys toward the wreckage of the American west coast. Horizon Forbidden West will serve as a showpiece for the PS5, though it's also appearing on PS4 as well. Here's everything we know about Horizon Forbidden West.", "link": "https://www.youtube.com/watch?v=XdB4_M_0u7Q", "date_published": "2022-02-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xbox Needs To Bring Back These Dead Activision Games", "description": "Microsoft is bound to acquire Activision and its 43 year legacy, and with it, some dormant franchises Xbox could potentially resurrect. \n\nIt's easy to see Activision for what it is now, with Call of Duty and everything Blizzard. But Activision's impact on this industry is deeply rooted in seminal franchises that helped shape the interactive medium.\n\nCEO of Microsoft Gaming Phil Spencer recently expressed interest in going through Activision's deep catalog of franchises in hopes to give some of them new life. Activision is the parent company of industry giants like Sierra Entertainment, pioneers in the adventure genre with games like King's Quest and Phantasmagoria. There's also Radical Entertainment, the developers behind Prototype and The Incredible Hulk: Ultimate Destruction. And before Raven Software was a support studio for Call of Duty, they created the iconic Hexen series and the cult-classic Singularity. All these franchises have been dormant for years, some decades. \n\nIn the above video, Kurt Indovina details Activision's long lineage of classic games that Xbox could potentially rise from the grave. \n\n#Microsoft #Activision", "link": "https://www.youtube.com/watch?v=-4UD4sctx1Y", "date_published": "2022-02-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]