[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Feid: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nAnamaria Sayre | April 22, 2022\nFrom the line up of traditional Colombian instruments to the card playing interlude, every second of Feid's Medellín, Colombia pool hall performance invokes the feeling of charlando and cantando, chatting and singing, with friends.\n\nSeamlessly anchoring all five tracks with a bass-emulating acoustic guitar and cajón-driven dembow, the new guard reggaeton royal brings unique instrumentation and culturally significant visuals to this Tiny Desk (home) concert for a deeply authentic portrait of a star on the rise baring a sonic piece of his soul to the world.\n\nFlexing his multi-instrumentalist background, Feid brings in a new instrument for each arrangement of his hit tracks to represent the five different regions of Colombia in a comprehensive homage to his home. He opens with su propio region, using a tiple guitar from the Andean region on \"JORDAN IV.\" Moving to the Llanos, his band breaks out a harp for a beautiful rendition of \"TE MATA.\" He pulls in a tambor alegre on \"VACAXIONES\" to represent cumbia from the Caribbean region. Pausing for quick brindis, taking a shot, he closes out the show with two heartfelt numbers: First, an accordion-backed, vallenato version of \"AMOR DE MI VIDA\" for the Atlantic coastal region, and then a final pivot to the Pacific coastal region he mixes in a marimba de chonta on \"SI TÚ SUPIERAS,\" before leaving the hall and riding off on a motorcycle.\n\nThe Colombian artist utilizes his full 15-minute set to depict an artistic and intentional musical image of his home and its rich sonic diversity, bringing the people, place and spirit behind a global genre center stage.\n\nSET LIST\n\"JORDAN IV\"\n\"TE MATA\"\n\"VACAXIONES\"\n\"AMOR DE MI VIDA\"\n\"SI TÚ SUPIERAS\"\n\nMUSICIANS\nFeid: vocals\nPedro Mejía: Music Director, guitar\nNicolás Guevara: cajón\nAngel \"Arpangel\" Rodriguez: harp\nDaniel Uribe: tiple\nMateo Morales: tambor alegre \nKike Riascos: marimba\nLuis Javier Hernandez: accordion\n\nCREDITS\nDirector: Sebastian Sánchez \nExecutive Producer: Feid, Sebastián Arango\nProject Manager: Albert Piedrahita\nProduction Coordinator: Fernando Ríos\nPersonal Manager: Luis Villamizar\nAssistant Director: Ana Isabel Duque\nDirector of Photography: unmojigato\nAudio Engineer: Miguel Mass\nAssistant Audio: Estefania Giraldo\n1st AC: Camilo Gutierrez\n2st AC: Lukas Restrepo\nRonin: Sebastián Escobar Gil\nVHS Camera: Felipe Molina\nDIT: Santiago Arango\nGaffer: Julián Echavarría\nLighting Engineer: Carlos Beltrán\nElectric: Nilson Florez\nAssistant Lights: Jhonatan Satizabal, Arnulfo Villada\nProduction Design: Camila Agudelo\nAssistant Art: Elizabeth Rendón, John Esteban Isaza\n\nTINY DESK TEAM\nProducer: Anamaria Sayre\nVideo Producer: Michael Zamora\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Joshua Bryant, Maia Stern, Ashley Pointer\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=UJMhvIlADYc", "date_published": "2022-04-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "S. Carey: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nStephen Thompson | April 21, 2022\nSean Carey's music often evokes the comforts of home, so it only makes sense that he'd gravitate to the quiet confines of a modest kitchen in his hometown of Eau Claire, Wis. This is a Tiny Desk (home) concert in the truest sense: S. Carey performs these four songs surrounded by household appliances and a handful of his closest collaborators.\n\nCarey's fourth solo album, Break Me Open, lends itself perfectly to confined intimacy. The record came out of an intense stretch of Carey's life in which the singer got divorced, lost his father and embarked on a period of deep introspection. But it's a record about growth as well as grief.\n\nOf course, Carey had a clear musical path to follow, given that he joined Bon Iver shortly after bandleader Justin Vernon wrote his own masterful breakup album, For Emma, Forever Ago. Now, more than a decade later, he's the one healing amid the snows of western Wisconsin, just in time for the spring thaw.\n\nSET LIST\n\"Paralyzed\"\n\"Where I Was\"\n\"Rose Petals\"\n\"Island\"\n\nMUSICIANS\nS. Carey: guitar, Wurlitzer, vocals\nCourtney Hartman: guitar, vocals\nZach Hanson: percussion, vocals\nBen Lester: synth\nJeremy Boettcher: upright bass\n\nCREDITS\nVideo: Brendan Lauer and Christopher Behnen\nAudio: Brian Joseph\nMixed by S. Carey and Zach Hanson\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Michael Zamora\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Kara Frame, Joshua Bryant, Maia Stern, Ashley Pointer\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #TinyDesk #SeanCarey", "link": "https://www.youtube.com/watch?v=mpdZZhRBnOg", "date_published": "2022-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]