[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Every Unreal Engine 5 Game Announced So Far", "description": "Take a look at some the biggest games set to use the latest version of Epic's Unreal Engine.\n\nUnreal Engine 5 is the latest version of Epic Games' popular game development software and has been available for use since the start of 2021. A year later, more studios have begun to adopt the software as the foundation for projects that can leverage its versatile power to create detailed games.\n\nAs part of a State of Unreal livestream on April 5, Epic revealed the engine is now available to all, including new sample projects you can use to play around with. We also got another good look at what Unreal Engine 5 is capable of and heard from a variety of developers who touted the benefits of utilizing the engine. That even included the reveal that a new Tomb Raider game is on the way that will run on UE5.\n\nVarious games and genres are being built in Unreal 5 right now, ranging from licensed mobile titles to AAA blockbusters. We've gathered up all the confirmed titles that are currently confirmed to utilize it, as well as a look at many of the studios who are lined up to do the same.\n\n#UnrealEngine5", "link": "https://www.youtube.com/watch?v=cn50_jZC1Eo", "date_published": "2022-04-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New PS Plus Release Dates - When You Can Sign Up | GameSpot News", "description": "New PlayStation Plus release dates announced, Borderlands 3 adding full cross-play with PlayStation, and God of War: Ragnarok is still on track.\n#GamingNews #PS5\n\nSony has announced release dates for the new version of PlayStation Plus, and it'll be here soon. In a blog post, Sony said the new PlayStation Plus will debut in Asian markets (but not Japan) starting late May, with a release in Japan, the Americas, and Europe to follow throughout June.\n\nGearbox Software has now officially announced that Borderlands 3 will soon have full cross-play support across all platforms sometime this spring. With the update, players across PC, Xbox, and PlayStation consoles, as well as streaming through Stadia, can connect and play together.\n\nSomeone on Twitter asked Ragnarok animation director Bruno Velazquez for reassurance that the game is still on track for release in 2022, and Velazquez confirmed, \"Ragnarok is coming this year.\"\n\nSTAMPS\n00:00 - Intro\n00:06 - PlayStation Plus\n01:22 - Borderlands 3\n02:24 - God of War Ragnarok", "link": "https://www.youtube.com/watch?v=QtB2HG-Hco0", "date_published": "2022-04-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Evil Dead: The Game Captures The Horror And Humor Of Chainsawing Deadites", "description": "We played about an hour of Evil Dead: The Game with the developers recently and got a first-hand sense of how the game is balanced to capture the same feel of the movies and TV show--that the humans will kick Deadite ass, and that the Kandarian demon is an ancient force of frightening power. Both the human team, led by Bruce Cambell's iconic Ash Williams, and the demon Deadites are powerful but in very different ways, which creates an interesting challenge for turning the franchise into an asymetrical multiplayer horror game in Evil Dead: The Game. That fact led Evil Dead: The Game developer Saber Interactive to find a different way to balance its game; it still sees a group of four players facing off a horror controlled by a fifth, but both sides are active in different ways and putting up a serious fight.", "link": "https://www.youtube.com/watch?v=Jhwxm-thuyo", "date_published": "2022-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Gearbox PAX East 2022 Panel Livestream", "description": "Tune in for Gearbox Entertainment's PAX East 2022 Show, featuring a celebration of Borderlands and other exciting announcements from Gearbox Publishing.", "link": "https://www.youtube.com/watch?v=WTyqEl01SYA", "date_published": "2022-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Outriders Worldslayer Reveal Full Presentation", "description": "The “Worldslayer Reveal\" Broadcast is dedicated to unveiling Outriders Worldslayer and spotlighting the new content and systems being introduced. Get a glimpse of the new systems, locations, mechanics and more!\n\nOutriders is a 1-3 player co-op RPG shooter set in an original, dark and desperate sci-fi universe. As mankind bleeds out in the trenches of Enoch, you’ll create your own Outrider and embark on a journey across the hostile planet.\n\n#Outriders #Worldslayer", "link": "https://www.youtube.com/watch?v=DcmBrsXNHRc", "date_published": "2022-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Outriders: Worldslayer Preview", "description": "Outriders: Worldslayer is the first major expansion to People Can Fly and Square Enix's third-person shooter. Outriders: Worldslayer will include plenty of new content to the original game, including story elements with a new big bad in the form of Ereshkigal, beefed-up challenges with Apocalypse tiers, and much more. Outriders: Worldslayer expansion releases in 2022.\n\n#Outriders #WorldSlayer", "link": "https://www.youtube.com/watch?v=3UuFDJrxPbA", "date_published": "2022-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 Alpha Hands-On: Sojourn Abilities, Orisa + Bastion Rework, Push Impressions Feat Stylosa", "description": "Overwatch fans Lucy and Tamoor went hands-on with OW2 PvP and chat with their pal Stylosa about the game ahead of the upcoming Overwatch 2 beta. They discuss Sojourn, the Bastion and Orisa rework, as well as their impressions of the new mode, Push. #Overwatch2 #OW2 \n\nCheck out Stylosa's channel: https://www.youtube.com/stylosa\n\nActivision Blizzard continues to address allegations from a state of California lawsuit accusing parent company Activision Blizzard of fostering a \"frat boy culture\" of harassment and discrimination against women. For the latest on what's happening with regard to the ongoing legal action, take a look at our timeline of events:  https://www.gamespot.com/articles/activision-blizzard-lawsuits-and-investigations-timeline-of-events/1100-6494785/\n\n0:00 Introduction\n00:38 Overwatch 2 closed alpha impressions\n06:19 Sojourn abilities and how she feels to play\n12:03 Support hero changes\n12:31 Cassidy rework\n13:29 Doomfist rework\n15:50 Orisa rework\n17:11 Bastion rework\n18:40 Push mode impressions\n21:54 Should this be called Overwatch 2?\n\nWith the news that Overwatch 2 PvP is to be 'de-coupled' from PvE, Blizzard also announced that a closed beta for Overwatch 2 was in the works. GameSpot Overwatch fans Lucy and Tamoor played the closed alpha for a number of hours and roped in their pal and Overwatch content creator Stylosa to chat about the big changes coming to the game. \n\nFirst off the bat come the additions to the game, like new hero Sojourn, her abilities, and where she sits in the Overwatch damage heroes pool. Also discussed is the new mode Push, and whether or not it needs some tweaks before the game is launched, lest it goes the way of the 2cp game mode. The trio also discuss the changes Blizzard is making to heroes. Orisa, Bastion, and Doomfist have seen significant reworks, and other characters such as Cassidy have seen seemingly small, but meaningful changes. While there's no word on an Overwatch 2 release date just yet, the closed beta kicks off on April 26.", "link": "https://www.youtube.com/watch?v=KNF75PF6Mtw", "date_published": "2022-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "When You Can Play Warzone’s Godzilla & King Kong Event | GameSpot News", "description": "Godzilla And King Kong Are Coming To Call Of Duty: Warzone, Halo Infinite's Battle Royale-Like Last Spartan Standing Mode Revealed and Rocket League's New Knockout Bash Mode Turns The Game Into A Battle Royale. \n#GamingNews #Warzone #HaloInfinite\n\nActivision has revealed the Call of Duty Season 3 roadmap for both Vanguard and Warzone, which includes the Operation Monarch event centered around Godzilla and King Kong. Season 3 will arrive on April 27 and Operation Monarch releases May 11. The Vanguard update will go live on April 26 at 9 AM PT / 12 PM ET, and one for Warzone on April 27 at the same time.\n\n343 Industries provided a rundown of some of the new and returning modes fans can expect. This includes the battle royale-like Last Spartan Standing mode, which is all about fighting for survival. Last Spartan Standing will be available in Halo Infinite when Lone Wolves launches on May 3.\n\nRocket League is adding a new Limited Time Event called Knockout Bash on April 27, in which players will battle it out to be the last car standing. Hazards will also be in play, as spikes and laser grids can instantly KO any player caught by them. Knockout Bash will be live from April 27 to May 10. \n\nSTAMPS\n00:00 - Intro\n00:09 - Call of Duty\n01:27 - Halo Infinite\n02:30 - Rocket League", "link": "https://www.youtube.com/watch?v=-4jIS8NqEWs", "date_published": "2022-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]