[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends | Stories from the Outlands: Survive - Official Cinematic Trailer", "description": "The only rule Mara's mother ever gave her was to survive. In the ruins of the G.D.S. Vantage, that's a hard rule to follow. \n\nCheck out the newest Stories from the Outlands that follows Mara's journey into the ruins of the G.D.S Vantage.\n\n#ApexLegends #ApexLegendsHunted #ApexHunted", "link": "https://www.youtube.com/watch?v=mX7Qt-8mCbY", "date_published": "2022-07-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Black Panther Game Being Published By Electronic Arts | GameSpot News", "description": "Black Panther is getting a standalone game, Multiversus is really popular, and Xbox boot times are getting faster.\n #Gaming #BlackPanther #Marvel \n\n \n\nMovies are not the only thing Marvel fans have to look forward to. It seems a key Avenger is getting their own, single player game. That, plus Multiversus updates, on today’s GameSpot News.\n\nIt seems Wakanda Forever truly means it, because after the release of the film, we’ll be reportedly getting a Black Panther video game. Hot on the heels of the MCU film’s emotional trailer, Jeff Grubb of GameSpot sister site Giant Bomb has revealed a few details on this early in development title.\n\nThe game, codenamed Project Ranier, is said to be coming from a brand new studio based in Seattle founded by former Monolith Productions VP and studio head Kevin Stephens, published under Electronic Arts. Under Stephens, Monolith Productions created the two open-world Lord of the Rings titles Shadow of Mordor and Shadow of War, and that studio is now working on a Wonder Woman game that was revealed at last year’s Game Awards.\n\nTwo words that define that Wonder Woman title also pertain to Black Panther: single player and open-world. Grubb claims that the game will act as an origin story, the new Black Panther working to assume the mantle soon after the passing of its previous bearer. In nearly every popular iteration of the character, that is the passing of the mantle from Wakandan King T’Chaka to his son T’Challa, but Grubb could not confirm if that will be the case in this game. Perhaps this Black Panther game is set in the past or the future and follows one of T’Challa’s ancestors or predecessors, respectively?\n\nUnfortunately, don’t expect to learn any further details of this game any time soon, as Grubb claims it is in very early development.\n\nTo while away the time until more Black Panther video game news, maybe jump into the Multiversus open beta, which starts tomorrow after a week of early access. Despite being available to a limited number of people, the game has proved incredibly popular over the last week.\n\nAccording to eventshub.com, since the launch of the game in early access, the platform fighter has an average of over 38,000 Steam players online at any given time and an all-time peak of over 61,000. That average is higher than the near 29,000 average of the 13 next most popular fighting games on Steam from the last month.\n\nOf course, Multiversus’ success can be attributed to the fact that it is a taste of an upcoming release, plus the very robust marketing campaign Warner Bros. has put behind it, including partnering with streamers to promote the game. But even still, these numbers are very impressive considering that it wasn't available to everyone.\n\nWith early access now being lifted, it stands to reason that concurrent player count will only increase. Particularly as the open beta be adding Lebron James to the roster.\n\nNow, this is Lebron James the character from Space Jam: A New Legacy, not the actual basketball player Lebron James, much like Buzz Lightyear in Lightyear was the space explorer that the toy Buzz Lightyear was based off of. Hopefully that clears things up.\n\nThe best way to play the Multiversus open beta might be on Xbox, which is getting an awesome stealth update that cuts the Series X and S boot times by around 5 seconds. This is thanks to a shorter boot up animation sequence that is now available to Xbox Insiders.\n\nOf course, with a four second boot animation, that still means if you drop a piece of food on the floor at the exact time you turn on your Xbox, and it completes before you pick it up, I’m sorry, but you have to discard that food, and that’s the law.\n\nTIMESTAMPS: \n00:12 - Black Panther\n01:28 - Multiversus\n02:47 - Xbox", "link": "https://www.youtube.com/watch?v=hL2IEsNPlXU", "date_published": "2022-07-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "This Battlefield Realism Mod Might Just Be What You're Looking For", "description": "Battlefield 3 has a new Reality Mod that reworks the entire gameplay loop of Battlefield as you know it while retaining the classic maps and destruction gameplay mechanics. We break down all the significant changes and new tweaks that FPS fans.\n#Battlefield3 #RealityMod #VeniceUnleashed #Alpha \n\n If you're a battlefield fan, particularly a battlefield 3 fan, you may have heard about Venice Unleashed's reality mod. Although the build is incredibly rough around the edges and really punishing, there's also something kinda infectious if you have a proper squad. I'm gonna break down what makes the gameplay just so \"realistic\" in this mod and how it all works. Drop that like button and sub to the channel especially if you’re excited for future Call of Duty or Battlefield updates.\n\nThis mod was countless years in the making by some passionate and dedicated people, and I've been deep in the trenches trying to figure out how the gameplay loop works.  Fans of classic Battlefield or Call of Duty games – check your expectations at the door. I'm serious. You might feel more at home here if you come from Arma, Squad or Tarkov.\n\nIf there are some neat gameplay mechanics, I forgot to mention that if you enjoyed in this mod, feel free to hop into the comments! Again, this is a mode for players ready to go all in, role-play a bit, and may have some experience in games like Squad or Tarkov. That being said, if you've never played those games, maybe give this mod a shot, and who knows, you might just enjoy it.", "link": "https://www.youtube.com/watch?v=qZ345mCHaLs", "date_published": "2022-07-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Story Change That Broke The Forgotten City", "description": "When developer Modern Storytellers wanted to make its successful Skyrim mod The Forgotten City a full-fledged game, they planned for a two year reskin. What they didn't know is that the small decision would derail the game's development for years.\n\nThe Forgotten City is a murder mystery, stuck in a time loop, set in an intricately designed Roman City. It's so well realized, that if you didn't know, you might assume the game was built from the ground up to always be that way. In actuality, it started as a Skyrim mod set in an underground Dwarven city. \n\nThe original mod was a huge success, amounting in millions of downloads and garnered several writing awards including Best Interactive Media from the Australian Writers' Guild. Designer/writer Nick Pearce enjoyed making the mod so much that he left his established career as a lawyer to pursue game development full-time and bring the mod to life as a full-fledged standalone game. \n\nWhat was intended as a two year endeavor to remake the game in a Roman setting turned into a cascading list of problems that would cause Nick Pearce and his development team, Modern Storytellers, to rewrite and rebuild the game from the ground up.\n\nThis is the story of how changing the setting broke The Forgotten City.\n\n#gaming #forgottencity #gamespot #modernstoryteller #skyrim", "link": "https://www.youtube.com/watch?v=EwcfrBtRyiI", "date_published": "2022-07-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]