[{"source": "https://www.theguardian.com/world/rss", "title": "Javid backs Rishi Sunak, Sharma supports Boris Johnson and Penny Mordaunt is first to declare Tory leadership run – UK politics live", "description": "<p>Former health secretary backs former chancellor for PM; Cop26 president backs ex-PM; leader of the Commons announces candidacy</p><p>Meanwhile, two out of five maternity units in England are providing substandard care to mothers and babies, the NHS watchdog has warned.</p><p>“The quality of maternity care is not good enough,” the Care Quality Commission (CQC) said in its annual assessment of how health and social care services are performing.</p> <a href=\"https://www.theguardian.com/politics/live/2022/oct/21/uk-politics-live-liz-truss-resigns-tories-tory-leadership-race-new-pm-contest-rishi-sunak-boris-johnson-penny-mordaunt\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/live/2022/oct/21/uk-politics-live-liz-truss-resigns-tories-tory-leadership-race-new-pm-contest-rishi-sunak-boris-johnson-penny-mordaunt", "date_published": "2022-10-21 18:34:01+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Steve Bannon vows ‘very vigorous appeal’ to four-month prison sentence – live", "description": "<ul><li>Former lead Trump strategist sentenced to prison and $6,500 in fines</li><li>Bannon says ‘I fully respect’ judge’s decision but vows to appeal</li><li><a href=\"https://www.theguardian.com/info/2018/sep/17/guardian-us-morning-briefing-sign-up-to-stay-informed\">Sign up to receive First Thing – our daily briefing by email</a></li></ul><p><strong>Steve Bannon has just spoken with reporters outside the courthouse in Washington DC, telling them he “respects” the judge’s sentence, and veering off quickly into an attack on Joe Biden’s administration.</strong></p><p>In a brief, and chaotic appearance at the microphone, Bannon said of judge <strong>Carl Nichol</strong>’s four-month sentence:</p><p>The sentence he came down with today is his decision. I fully respect it, I’ve been totally respectful this entire process on the legal side.</p><p>I testified before the Mueller commission for more hours. I testified in front of [congressman Adam] Schiff in the House intelligence committee more than any other person in the Trump administration. I testified in front of the senate intelligence [committee], I think more than anybody, about the issues related to Russiagate, to all of that. The same process every time.</p><p>I had lawyers that were engaged, they worked through the issues of privilege. At that time, I went and testified. And this thing about I’m above the law is an absolute and total lie.</p><p>Today was my judgment day by the judge. And we’ll have a very vigorous appeals process. I’ve got a great legal team, and there’ll be multiple areas of appeal.</p><p>But as that sign says right there, vote. On November 8, there’s gonna have [sic] judgment on the illegitimate Biden regime and, quite frankly, <strong>Nancy Pelosi</strong> and the entire [January 6] committee. And we know which way that’s going.</p> <a href=\"https://www.theguardian.com/us-news/live/2022/oct/21/steve-bannon-sentencing-trump-jan-6-biden-student-loan-politics-latest\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/live/2022/oct/21/steve-bannon-sentencing-trump-jan-6-biden-student-loan-politics-latest", "date_published": "2022-10-21 18:30:59+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "White House denies talk of national security review of Elon Musk ventures", "description": "<p>Report cites concerns over foreign investors funding Twitter takeover and increasingly strategic role in Ukraine of Starlink</p><p>US officials are considering whether to subject some of Elon Musk’s business ventures to national security reviews, including his proposed acquisition of Twitter and his satellite internet company Starlink, according to a report.</p><p>Bloomberg wrote on Friday that Biden administration officials were concerned by the Tesla chief executive’s <a href=\"https://www.theguardian.com/technology/2022/oct/05/what-elon-musk-might-do-with-twitter-deal-buy\">plan to buy Twitter</a> in a deal part-funded by non-US investors and his recent <a href=\"https://www.theguardian.com/world/2022/oct/14/elon-musk-spacex-no-longer-fund-starlink-internet-ukraine\">threat to pull the plug on the Starlink service to Ukraine</a>, as well as the publication of a series of tweets <a href=\"https://www.theguardian.com/world/2022/oct/04/zelenskiy-hits-back-as-elon-musk-sets-up-twitter-poll-on-annexed-areas\">containing proposals over the Ukraine conflict favourable to the Putin regime</a>.</p> <a href=\"https://www.theguardian.com/technology/2022/oct/21/white-house-weighs-up-national-security-reviews-into-elon-musk-ventures\">Continue reading...</a>", "link": "https://www.theguardian.com/technology/2022/oct/21/white-house-weighs-up-national-security-reviews-into-elon-musk-ventures", "date_published": "2022-10-21 18:30:58+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Donald Trump formally subpoenaed by January 6 committee", "description": "<p>Former US president will be compelled to provide accounting under oath about his potential foreknowledge of the Capitol attack</p><p>The House January 6 select committee has formally transmitted a subpoena to <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a>, compelling the former president to provide an accounting under oath about his potential foreknowledge of the Capitol attack and his broader efforts to overturn the results of the 2020 election.</p><p>The subpoena made sweeping requests for documents and testimony, dramatically raising the stakes in the highly-charged congressional investigation and setting the stage for a constitutionally consequential legal battle that could ultimately go before the supreme court.</p> <a href=\"https://www.theguardian.com/us-news/2022/oct/21/trump-subpoena-testify-jan-6-committee\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/oct/21/trump-subpoena-testify-jan-6-committee", "date_published": "2022-10-21 18:15:58+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Parents of girl found in suitcase urge French politicians to stop exploiting death", "description": "<p>Family speak out after photo of 12-year-old, identified only as ‘Lola’, was displayed at far-right rally</p><p>The parents of a French schoolgirl whose death stunned the country have urged rightwing politicians to stop using her photograph for political ends.</p><p>A 24-year-old woman from Algeria with a history of psychiatric disorders was last week <a href=\"https://www.theguardian.com/world/2022/oct/18/woman-arrested-over-killing-of-girl-found-in-suitcase-in-paris\">charged with the rape and murder</a> last week of the girl, identified only as “Lola”.</p> <a href=\"https://www.theguardian.com/world/2022/oct/21/parents-of-murdered-girl-urge-french-politicians-to-stop-exploiting-her-death\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/21/parents-of-murdered-girl-urge-french-politicians-to-stop-exploiting-her-death", "date_published": "2022-10-21 18:05:52+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Russia-Ukraine war: US pledges ‘unwavering commitment’ to Ukraine; Zelenskiy accuses Russia of delaying grain ships – as it happened", "description": "<p><a href=\"https://www.theguardian.com/world/live/2022/oct/21/russia-ukraine-war-iran-directly-engaged-in-war-us-says-zelenskiy-warns-of-hydroelectric-plant-attack-live?filterKeyEvents=false&amp;page=with:block-63529a048f08de3dacfb80c3#block-63529a048f08de3dacfb80c3\">Lloyd Austin and Sergei Shoigu </a>also agree to maintain <a href=\"https://www.theguardian.com/world/live/2022/oct/21/russia-ukraine-war-iran-directly-engaged-in-war-us-says-zelenskiy-warns-of-hydroelectric-plant-attack-live?page=with:block-6352a9588f0895671b603798#block-6352a9588f0895671b603798\">lines of communication</a>; Ukrainian president says Russia delaying ships’ passage</p><ul><li><a href=\"https://www.theguardian.com/world/2022/oct/21/russia-ukraine-war-latest-what-we-know-on-day-240-of-the-invasion\">At a glance: what we know on day 240 of the invasion</a></li></ul><p><strong>Vitaliy Kim</strong>, governor of <strong>Mykolaiv</strong>, has no casualties to report in his daily update, although he has posted to Telegram to say that at 6.50am this morning the “coast of the Kutsurub community” was struck.</p><p>A series of explosions have also been reported in Ukraine’s south-eastern city of Zaporizhzhia.</p> <a href=\"https://www.theguardian.com/world/live/2022/oct/21/russia-ukraine-war-iran-directly-engaged-in-war-us-says-zelenskiy-warns-of-hydroelectric-plant-attack-live\">Continue reading...</a>", "link": "https://www.theguardian.com/world/live/2022/oct/21/russia-ukraine-war-iran-directly-engaged-in-war-us-says-zelenskiy-warns-of-hydroelectric-plant-attack-live", "date_published": "2022-10-21 18:04:49+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Boris Johnson gaining ground on Rishi Sunak in Tory leadership race", "description": "<p>Former PM’s allies say he will easily make threshold of 100 MPs, while critics warn of potential defections</p><ul><li><a href=\"https://www.theguardian.com/politics/live/2022/oct/21/uk-politics-live-liz-truss-resigns-tories-tory-leadership-race-new-pm-contest-rishi-sunak-boris-johnson-penny-mordaunt\">Tory leadership contest – latest updates</a></li></ul><p>Boris Johnson is gaining ground in his audacious bid to return to Downing Street despite critics warning he risks plunging the Conservatives into fresh chaos over the impending parliamentary inquiry into the Partygate scandal.</p><p>As the former prime minister raced back from his Caribbean holiday to drum up support among MPs, Rishi Sunak remained ahead and the favourite to win with nearly 80 publicly declared backers, including Dominic Raab and Sajid Javid.</p> <a href=\"https://www.theguardian.com/politics/2022/oct/21/boris-johnson-gaining-ground-on-rishi-sunak-in-tory-leadership-race\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/oct/21/boris-johnson-gaining-ground-on-rishi-sunak-in-tory-leadership-race", "date_published": "2022-10-21 17:58:32+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Far-right Giorgia Meloni appointed Italy’s first female prime minister", "description": "<p>President Mattarella gave Brothers of Italy leader mandate to govern with coalition members Silvio Berlusconi and Matteo Salvini</p><p>Giorgia Meloni has formed Italy’s new ruling coalition, giving the country its first far right-led government since the end of the second world war.</p><p>A presidential palace official announced that Meloni, set to become the first woman to serve as the country’s prime minister, and her cabinet would be sworn in on Saturday. Meloni’s Brothers of Italy, a party with neo-fascist roots, was the top vote-winner in <a href=\"https://www.theguardian.com/world/ng-interactive/2022/sep/25/italian-election-2022-live-official-results\">Italy’s national election</a> last month.</p> <a href=\"https://www.theguardian.com/world/2022/oct/21/giorgia-meloni-tells-italian-president-she-is-ready-to-become-pm-berlusconi-salvini\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/21/giorgia-meloni-tells-italian-president-she-is-ready-to-become-pm-berlusconi-salvini", "date_published": "2022-10-21 17:55:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Iranian climber Elnaz Rekabi reportedly under house arrest", "description": "<p>Reports say athlete who competed in South Korea not wearing headscarf pressured into ‘forced confession’</p><p>The Iranian climber who received a hero’s welcome on her return to Tehran after competing in South Korea without wearing a headscarf has reportedly been placed under house arrest.</p><p>Elnaz Rekabi competed last weekend in South Korea without wearing a headscarf, which is mandatory in Iran and a subject of nationwide protests after the death of Mahsa Amini, who was arrested by the country’s notorious morality police.</p> <a href=\"https://www.theguardian.com/world/2022/oct/21/iranian-climber-elnaz-rekabi-reportedly-under-house-arrest\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/21/iranian-climber-elnaz-rekabi-reportedly-under-house-arrest", "date_published": "2022-10-21 17:53:11+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "‘There is no safety net’: music festivals in UK raise ticket prices as costs soar", "description": "<p>Organisers grapple with increasing financial challenges amid ongoing effects of Brexit and the pandemic</p><p>British music fans expressed dismay this week as <a href=\"https://www.theguardian.com/music/2022/oct/18/glastonbury-2023-ticket-prices\">Glastonbury announced</a> that the cost of tickets for next year’s event will rise from £265 to £335.</p><p>Emily Eavis, co-organiser of the not-for-profit festival, said: “We have tried very hard to minimise the increase in price on the ticket but we’re facing enormous rises in the costs of running this vast show, while still recovering from the huge financial impact of two years without a festival because of Covid.”</p> <a href=\"https://www.theguardian.com/music/2022/oct/21/music-festivals-uk-raise-ticket-prices-costs-soar\">Continue reading...</a>", "link": "https://www.theguardian.com/music/2022/oct/21/music-festivals-uk-raise-ticket-prices-costs-soar", "date_published": "2022-10-21 17:45:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Angelina Jolie to play Maria Callas in Spencer director’s next biopic", "description": "<p>The Oscar-winner will play the opera singer in a film that explores the ‘tumultuous, beautiful, and tragic’ story of her life</p><p>Angelina Jolie is set to play opera singer Maria Callas in a new drama from Chilean film-maker Pablo Larraín.</p><p>Maria will tell “the tumultuous, beautiful and tragic story of the life of the world’s greatest opera singer, relived and re-imagined during her final days in 1970s Paris” with a script from Peaky Blinders creator Steven Knight, who last collaborated with Larraín for Princess Diana drama Spencer.</p> <a href=\"https://www.theguardian.com/film/2022/oct/21/angelina-jolie-maria-callas-biopic\">Continue reading...</a>", "link": "https://www.theguardian.com/film/2022/oct/21/angelina-jolie-maria-callas-biopic", "date_published": "2022-10-21 17:25:46+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Police investigate car buried in yard of Silicon Valley home in 1990s", "description": "<p>Car was discovered Thursday morning by landscapers in affluent town of Atherton with unused bags of concrete inside it</p><p>Police are investigating why someone buried a car in the yard of a multimillion-dollar northern <a href=\"https://www.theguardian.com/us-news/california\">California</a> home in the 1990s – and left unused bags of concrete inside.</p><p>The car was discovered on Thursday morning by landscapers in the affluent town of Atherton in Silicon Valley, police said in a <a href=\"https://www.ci.atherton.ca.us/CivicAlerts.aspx?AID=1024\">news release</a>.</p> <a href=\"https://www.theguardian.com/us-news/2022/oct/21/california-car-buried-yard-atherton-concrete\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/oct/21/california-car-buried-yard-atherton-concrete", "date_published": "2022-10-21 17:22:17+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Ex-Pakistan PM Imran Khan barred from elections for five years", "description": "<p>Election commission rules he misled officials about gifts received from foreign leaders while in office</p><p>The former prime minister of Pakistan Imran Khan has been disqualified from running for political office for five years, after the country’s election commission ruled that he misled officials about gifts he received from foreign leaders while in power.</p><p>The decision announced on Friday is another twist in political wrangling that began even before Khan’s ejection in April, and is one of several legal battles being fought by the former international cricket star and his Pakistan Tehreek-e-Insaf (PTI) party.</p> <a href=\"https://www.theguardian.com/world/2022/oct/21/ex-pakistan-pm-imran-khan-barred-elections-five-years\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/21/ex-pakistan-pm-imran-khan-barred-elections-five-years", "date_published": "2022-10-21 16:55:11+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Great save? Lower league clubs mull early kick-offs to cut energy bills", "description": "<p>With budgets always tight some smaller football clubs are looking to offset their soaring power costs</p><p>Shrewsbury Town’s fans had long since filed out of the Montgomery Waters Meadow stadium after the defender Chey Dunkley had scored an injury-time winner against Exeter, when Brian Caldwell looked angrily skyward. The League One club’s chief executive was unimpressed to see the ground’s floodlights still burning bright.</p><p>Caldwell is among the football executives trying to limit the financial pain from huge energy bills. Faced with an even bigger surge in his annual costs, Caldwell was forced to settle for a £100,000 increase, to £180,000, when signing a new energy contract in April. “It’s a massive dent in our finances. Football clubs are not normal businesses, they’re set up to break even and put the money you can into the playing budget,” he said.</p> <a href=\"https://www.theguardian.com/business/2022/oct/21/energy-bills-football-clubs-lights-kick-off-time\">Continue reading...</a>", "link": "https://www.theguardian.com/business/2022/oct/21/energy-bills-football-clubs-lights-kick-off-time", "date_published": "2022-10-21 16:35:37+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "After eight rounds, is there space for further EU sanctions on Russia?", "description": "<p>Baltic states and Poland have a long shopping list, but host of others seen as cautious of new measures</p><p>• <a href=\"https://www.theguardian.com/world/live/2022/oct/21/russia-ukraine-war-iran-directly-engaged-in-war-us-says-zelenskiy-warns-of-hydroelectric-plant-attack-live\">Russia-Ukraine war – latest news updates</a></p><p>Since Vladimir Putin launched his invasion of Ukraine, Russia has been subjected to the heaviest sanctions of any country in the world.</p><p>A fossil fuel superpower, Russia is no longer able to export coal to the European Union and will soon<a href=\"https://www.theguardian.com/world/2022/may/30/eu-nears-compromise-agreement-for-partial-ban-on-russian-oil\"> lose 90% of its oil sales to the bloc</a>. In the other direction, the EU has banned the export of hundreds of goods to Russia, from hi-tech military kit and semiconductors that could aid Russia’s military, to makeup, handbags and clothes that may turn a handsome profit for Russian entrepreneurs.</p> <a href=\"https://www.theguardian.com/world/2022/oct/21/further-russia-sanctions-eu-ukraine-poland-russia-eu-baltic-states-poland\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/21/further-russia-sanctions-eu-ukraine-poland-russia-eu-baltic-states-poland", "date_published": "2022-10-21 16:27:16+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Newsmax bans Lara Logan after QAnon-tinged on-air tirade", "description": "<p>Rightwing networks says war correspondent turned pundit will not be invited back in view of ‘reprehensible statements’</p><p>The rightwing US TV network Newsmax said it had no plans to interview Lara Logan again, after the award-winning war correspondent turned rightwing pundit launched a QAnon-tinged tirade on air.</p><p>Speaking to host Eric Bolling, Logan said “the open border is Satan’s way of taking control of the world” and claimed world leaders drank children’s blood.</p> <a href=\"https://www.theguardian.com/media/2022/oct/21/newsmax-lara-logan-qanon-conspiracy-theory\">Continue reading...</a>", "link": "https://www.theguardian.com/media/2022/oct/21/newsmax-lara-logan-qanon-conspiracy-theory", "date_published": "2022-10-21 16:11:59+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "France becomes latest country to leave controversial energy charter treaty", "description": "<p>Quitting the ECT, which protects fossil fuel investors from policy changes that might threaten their profits, was ‘coherent’ with Paris climate deal, Macron said</p><p>France has become the latest country to pull out of the controversial energy charter treaty (ECT), which protects fossil fuel investors from policy changes that might threaten their profits.</p><p>Speaking after an EU summit in Brussels on Friday, French president, Emmanuel Macron, <a href=\"https://www.bfmtv.com/politique/emmanuel-macron-annonce-que-la-france-a-decide-de-se-retirer-du-traite-de-la-charte-sur-l-energie_VN-202210210501.html\">said</a>: “France has decided to withdraw from the energy charter treaty.” Quitting the ECT was “coherent” with the Paris climate deal, he added.</p> <a href=\"https://www.theguardian.com/world/2022/oct/21/france-becomes-latest-country-to-leave-controversial-energy-charter-treaty\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/21/france-becomes-latest-country-to-leave-controversial-energy-charter-treaty", "date_published": "2022-10-21 16:08:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "‘Like being in a cult’: MPs on the seven days that brought down Liz Truss", "description": "<p>The mood among backbench Conservatives after PM’s resignation seems to be overwhelmingly one of relief</p><ul><li><a href=\"https://www.theguardian.com/politics/live/2022/oct/21/uk-politics-live-liz-truss-resigns-tories-tory-leadership-race-new-pm-contest-rishi-sunak-boris-johnson-penny-mordaunt\">Tory leadership contest – live updates</a></li></ul><p>There are countless indignities in becoming the briefest-serving UK prime minister of all time, and a new one arrived on Friday morning when a No 10 official was able to confirm that Liz Truss had moved into the Downing Street flat – but not whether she had had enough time to fully unpack.</p><p>Truss is spending the weekend at another prime ministerial residence, the country retreat of Chequers, where she will presumably reflect on the month and a half of chaos she visited on herself and the nation, a headily compressed incumbency that ended with Thursday’s <a href=\"https://www.theguardian.com/politics/2022/oct/20/liz-truss-resignation-speech-in-full\">89-second resignation speech</a>.</p> <a href=\"https://www.theguardian.com/politics/2022/oct/21/liz-truss-resignation-mps-seven-days-brought-down-prime-minister\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/oct/21/liz-truss-resignation-mps-seven-days-brought-down-prime-minister", "date_published": "2022-10-21 15:56:39+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Zelenskiy accuses Russia of plotting to blow up Ukrainian dam", "description": "<p>President says destruction of Nova Kakhovka dam would mean large-scale disaster for towns and cities</p><p>Ukraine’s president, Volodymyr Zelenskiy, has accused Russia of plotting to blow up the two-mile Nova Kakhovka dam in the south of the country, warning its destruction would cause “a large-scale disaster” affecting towns and cities.</p><p>The 30 metre-high dam, which holds back 18m cubic metres of water, straddles the Dnieper River upstream from Russian-held Kherson and is about 20 miles from advancing Ukrainian forces hoping to recapture both it and the occupied city.</p> <a href=\"https://www.theguardian.com/world/2022/oct/21/zelenskiy-accuses-russia-plot-blow-up-nova-kakhovka-dam-ukraine\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/21/zelenskiy-accuses-russia-plot-blow-up-nova-kakhovka-dam-ukraine", "date_published": "2022-10-21 15:54:36+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Almost 12,500 people arrested in Iran protest crackdown, says rights group", "description": "<p>Families struggle to contact relatives as opposition calls for movement to focus on plight of thousands in jail</p><p>Almost 12,500 people have been arrested and nearly 250 killed since the street protests began in Iran, according to a prominent human rights group, with thousands of anxious families struggling to make contact with loved ones who have gone missing and presumed to be in jail.</p><p>The news came as the commander of the Islamic Revolutionary Guards Corps, Maj Gen Hossein Salami, said security forces were close to snuffing out the remaining protests. He said: “Sedition is going through its last moments.”</p> <a href=\"https://www.theguardian.com/world/2022/oct/21/arrests-iran-protest-crackdown-plight-thousands-in-jail\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/21/arrests-iran-protest-crackdown-plight-thousands-in-jail", "date_published": "2022-10-21 14:50:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Barclays could be fined £50m for failing to disclose 2008 Qatari deal", "description": "<p>Provisional fine relates to £322m bank paid to Gulf state allegedly in exchange for £4bn investment to save lender from bailout</p><p>The City watchdog could fine Barclays up to £50m for failing to disclose a deal struck with Qatar at the height of the financial crisis, reviving a controversial episode that <a href=\"https://www.theguardian.com/business/2020/feb/28/three-former-barclays-executives-found-not-guilty-of-fraud\">failed to gain traction in UK courts</a>.</p><p>The provisional fine – which Barclays is in the process of appealing against – relates to the £322m the bank paid to Qatar in 2008, allegedly in exchange for the gas-rich Gulf state investing £4bn, helping save the lender from a UK government bailout.</p> <a href=\"https://www.theguardian.com/business/2022/oct/21/barclays-could-be-fined-50m-for-failing-to-disclose-2008-qatari-deal\">Continue reading...</a>", "link": "https://www.theguardian.com/business/2022/oct/21/barclays-could-be-fined-50m-for-failing-to-disclose-2008-qatari-deal", "date_published": "2022-10-21 12:54:08+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Airline hired for UK’s Rwanda deportations pulls out of scheme", "description": "<p>Exclusive: Privilege Style causes problem for Home Office as it bows to pressure from campaigners</p><p>A charter airline hired to remove people seeking refuge in the UK to Rwanda has pulled out of the scheme after pressure from campaigners.</p><p>A plane operated by Privilege Style first attempted to fly asylum seekers to the east African country in June but was grounded by an 11th hour ruling by the European court of human rights.</p> <a href=\"https://www.theguardian.com/uk-news/2022/oct/21/airline-hired-uk-rwanda-deportations-pulls-out-privilege-style\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2022/oct/21/airline-hired-uk-rwanda-deportations-pulls-out-privilege-style", "date_published": "2022-10-21 10:37:43+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Ontario mayor faces lone challenger – the brother he doesn’t speak to", "description": "<p>Charles Steele runs against estranged brother Bill in Port Colborne mayoral race – but siblings keep mum on source of conflict</p><p>When Charles Steele stepped on to a debate stage last week, it was the first time since the election campaign began that he’d confronted his lone opponent in a bitterly contested race to become mayor of a small Canadian town.</p><p>The encounter also marked the first time he’d spoken to his brother Bill – the incumbent mayor – in more than 30 years.</p> <a href=\"https://www.theguardian.com/world/2022/oct/21/canada-ontario-port-colborne-mayor-steele-brothers\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/21/canada-ontario-port-colborne-mayor-steele-brothers", "date_published": "2022-10-21 09:40:19+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "EnergyAustralia latest to be hit by cyber-attack as details of hundreds of customers exposed", "description": "<p>Electricity company says attack accessed information on 323 customers but ‘no evidence’ data was transferred elsewhere</p><ul><li>Get our <a href=\"https://www.theguardian.com/australia-news/2022/sep/23/morning-mail-newsletter-best-daily-news-email-guardian-australia-free-sign-up-inbox-subscribe?CMP=cvau_sfl\">morning</a> and <a href=\"https://www.theguardian.com/australia-news/2022/oct/13/afternoon-update-newsletter-best-daily-news-email-guardian-australia-free-sign-up?CMP=cvau_sfl\">afternoon</a> news emails, <a href=\"https://www.theguardian.com/technology/ng-interactive/2018/may/15/the-guardian-app?CMP=cvau_sfl\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></li></ul><p>EnergyAustralia has become the latest company to be targeted by a cyber-attack, with hundreds of customers’ details exposed.</p><p>In a statement released late on Friday, the electricity company said 323 residential and small business customers were affected by unauthorised access to their online platform, My Account.</p><p>Sign up for our free <a href=\"https://www.theguardian.com/australia-news/2022/sep/23/morning-mail-newsletter-best-daily-news-email-guardian-australia-free-sign-up-inbox-subscribe?CMP=copyembed\">morning newsletter</a> and <a href=\"https://www.theguardian.com/australia-news/2022/oct/13/afternoon-update-newsletter-best-daily-news-email-guardian-australia-free-sign-up?CMP=copyembed\">afternoon email</a> to get your daily news roundup</p> <a href=\"https://www.theguardian.com/australia-news/2022/oct/21/energyaustralia-latest-to-be-hit-by-cyber-attack-as-details-of-hundreds-of-customers-exposed\">Continue reading...</a>", "link": "https://www.theguardian.com/australia-news/2022/oct/21/energyaustralia-latest-to-be-hit-by-cyber-attack-as-details-of-hundreds-of-customers-exposed", "date_published": "2022-10-21 08:40:05+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Severe weather warning for NSW and Victoria – as it happened", "description": "<p>Victoria is expecting the worst flooding from Sunday as NSW braces for more extreme weather. This blog is now closed</p><ul><li>Get our <a href=\"https://www.theguardian.com/australia-news/2022/sep/23/morning-mail-newsletter-best-daily-news-email-guardian-australia-free-sign-up-inbox-subscribe?CMP=cvau_sfl\">morning</a> and <a href=\"https://www.theguardian.com/australia-news/2022/oct/13/afternoon-update-newsletter-best-daily-news-email-guardian-australia-free-sign-up?CMP=cvau_sfl\">afternoon</a> news emails, <a href=\"https://www.theguardian.com/technology/ng-interactive/2018/may/15/the-guardian-app?CMP=cvau_sfl\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></li></ul><p><strong>Plibersek</strong> is asked to explain a little bit more about the funding. Labor pledged a similar amount before the election, so is this new money? </p><p>This is additional because it’s in our first budget, so it’s delivering on the promise we made.</p><p>We agreed with that billion dollars of spending and <strong>we’re saying that’s not quite enough</strong>.</p><p>We need to spend $1.2bn over coming years and it’ll mean things like a new research centre in Gladstone, <strong>employing scientists</strong> to do really critical work on coastal ecosystems.</p><p>Well, it means that we can do important projects like stabilising riverbanks, replanting mangroves, reed beds and seagrass meadows <strong>to improve the water quality that’s coming from the land into the reef</strong>.</p><p>It means that we can <strong>work with traditional owners</strong> who are controlling crown-of-thorns starfish outbreaks.</p><p>Together we hope to these measures can start to turn around the health of the reef, it is a still a beautiful natural wonder of the world. We’ve got a little bit of a breathing space in the last couple of years. We’ve seen some of those corals come back because we’ve had cooler weather and we need to build on that to protect and restore.</p> <a href=\"https://www.theguardian.com/australia-news/live/2022/oct/21/australia-news-live-updates-eastern-states-brace-for-more-rain-floods-victoria-weather-politics-labor-plans-pacific-aid-boost-liz-truss\">Continue reading...</a>", "link": "https://www.theguardian.com/australia-news/live/2022/oct/21/australia-news-live-updates-eastern-states-brace-for-more-rain-floods-victoria-weather-politics-labor-plans-pacific-aid-boost-liz-truss", "date_published": "2022-10-21 08:06:59+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Weather tracker: Nigeria flooding and US blows hot and cold", "description": "<p>Authorities partly blamed after months of deadly flooding in African nation; jet stream causes temperature divide in US</p><p>Nigeria has found itself at the centre of <a href=\"https://www.theguardian.com/environment/2022/oct/20/flooding-world-climate-crisis-australia-venezuela-nigeria\">devastating floods</a> over the past week, with poor preparation from authorities partly blamed for the damage caused. At least 600 people have died across the west African nation, with two-thirds of states affected by the disaster.</p><p>An estimated 1.3 million people have been displaced, with up to a quarter of a million homes reportedly destroyed. The floods are a culmination of months of above average rainfall, with the first floods having occurred in summer.</p> <a href=\"https://www.theguardian.com/environment/2022/oct/21/weather-tracker-nigeria-flooding-us-jet-stream\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/oct/21/weather-tracker-nigeria-flooding-us-jet-stream", "date_published": "2022-10-21 08:00:18+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Australian women sue Qatar Airways over forced examinations at Doha airport", "description": "<p>Five women are seeking damages for ‘unlawful physical contact’ and mental health impacts over October 2020 incident</p><ul><li>Get our <a href=\"https://www.theguardian.com/australia-news/2022/sep/23/morning-mail-newsletter-best-daily-news-email-guardian-australia-free-sign-up-inbox-subscribe?CMP=cvau_sfl\">morning</a> and <a href=\"https://www.theguardian.com/australia-news/2022/oct/13/afternoon-update-newsletter-best-daily-news-email-guardian-australia-free-sign-up?CMP=cvau_sfl\">afternoon</a> news emails, <a href=\"https://www.theguardian.com/technology/ng-interactive/2018/may/15/the-guardian-app?CMP=cvau_sfl\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></li></ul><p>Five Australian women are suing Qatar Airways in the New South Wales supreme court over a 2020 incident in which they were forcibly removed from aeroplanes at gunpoint in Doha, and some intimately examined without explanation or their consent.</p><p>The women are seeking damages from both Qatar Airways and the Qatar Civil Aviation Authority – owned by the Qatari government – over the “unlawful physical contact” and mental health impacts, including depression and post-traumatic stress disorder.</p><p>Sign up for our free <a href=\"https://www.theguardian.com/australia-news/2022/sep/23/morning-mail-newsletter-best-daily-news-email-guardian-australia-free-sign-up-inbox-subscribe?CMP=copyembed\">morning newsletter</a> and <a href=\"https://www.theguardian.com/australia-news/2022/oct/13/afternoon-update-newsletter-best-daily-news-email-guardian-australia-free-sign-up?CMP=copyembed\">afternoon email</a> to get your daily news roundup</p> <a href=\"https://www.theguardian.com/australia-news/2022/oct/21/australian-women-sue-qatar-airways-over-forced-examinations-at-doha-airport\">Continue reading...</a>", "link": "https://www.theguardian.com/australia-news/2022/oct/21/australian-women-sue-qatar-airways-over-forced-examinations-at-doha-airport", "date_published": "2022-10-21 07:53:02+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "NSW and Queensland brace for severe storms and flooding as wild weather lashes eastern Australia", "description": "<p>Large parts of both states put on notice as emergency services forecast large hailstones and heavy rain</p><ul><li>Get our <a href=\"https://www.theguardian.com/australia-news/2022/sep/23/morning-mail-newsletter-best-daily-news-email-guardian-australia-free-sign-up-inbox-subscribe?CMP=cvau_sfl\">morning</a> and <a href=\"https://www.theguardian.com/australia-news/2022/oct/13/afternoon-update-newsletter-best-daily-news-email-guardian-australia-free-sign-up?CMP=cvau_sfl\">afternoon</a> news emails, <a href=\"https://www.theguardian.com/technology/ng-interactive/2018/may/15/the-guardian-app?CMP=cvau_sfl\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></li></ul><p>Severe thunderstorms will bring large hailstones and a flash-flood risk to large parts of New South Wales and Queensland, with coastal regions in both states to be hit by heavy rain belts.</p><p>“We’re bracing for significant rainfall right across NSW,” the NSW flood recovery minister, Steph Cooke, said.</p><p><a href=\"https://www.theguardian.com/australia-news/2022/sep/23/morning-mail-newsletter-best-daily-news-email-guardian-australia-free-sign-up-inbox-subscribe?CMP=copyembed\">Sign up to receive an email with the top stories from Guardian Australia every morning</a></p> <a href=\"https://www.theguardian.com/australia-news/2022/oct/21/nsw-and-queensland-brace-for-severe-storms-and-flooding-as-wild-weather-lashes-eastern-australia\">Continue reading...</a>", "link": "https://www.theguardian.com/australia-news/2022/oct/21/nsw-and-queensland-brace-for-severe-storms-and-flooding-as-wild-weather-lashes-eastern-australia", "date_published": "2022-10-21 06:17:09+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Bruce Lehrmann trial: jury sent home for weekend after not yet reaching unanimous verdict", "description": "<p>ACT supreme court chief justice urges jurors to avoid discussing case with others ahead of continued deliberations next week</p><ul><li><strong><a href=\"https://www.theguardian.com/australia-news/live/2022/oct/21/australia-news-live-updates-eastern-states-brace-for-more-rain-floods-victoria-weather-politics-labor-plans-pacific-aid-boost-liz-truss\">Follow our Australia news live blog for the latest updates</a></strong></li></ul><p>The jury in the Bruce Lehrmann trial will continue its deliberations on Monday, after spending another full day considering the case without reaching unanimous verdict.</p><p>The ACT supreme court chief justice, Lucy McCallum, sent the jury home again about 4pm Friday, urging them to avoid discussing the case with others.</p> <a href=\"https://www.theguardian.com/australia-news/2022/oct/21/bruce-lehrmann-trial-jury-sent-home-for-weekend-after-failing-to-reach-unanimous-verdict\">Continue reading...</a>", "link": "https://www.theguardian.com/australia-news/2022/oct/21/bruce-lehrmann-trial-jury-sent-home-for-weekend-after-failing-to-reach-unanimous-verdict", "date_published": "2022-10-21 05:45:45+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "More than 800 evacuated after fuel tanker crash sparks huge blaze in Mexico", "description": "<p>A dozen people were rescued from burning homes after a tanker truck crashed into a railway overpass in the central town of Aguascalientes</p><p>A huge blaze erupted in central Mexico after a fuel tanker truck crashed into an overpass by a rail line, scorching homes, engulfing the area in thick smoke and leading to a mass evacuation, but causing no fatalities, authorities said.</p><p>Video footage of the fire on social media showed a cargo train hurtling through the flames after Thursday’s accident in the city of Aguascalientes, as stunned drivers at the scene retreated from their cars holding children close.</p> <a href=\"https://www.theguardian.com/world/2022/oct/21/fuel-tanker-truck-crash-mexico-aguascalientes\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/21/fuel-tanker-truck-crash-mexico-aguascalientes", "date_published": "2022-10-21 05:33:50+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "More bodies, thought to be of Ethiopian migrants, found in mass grave in Malawi", "description": "<p>Bodies of four men, believed to be en route to South Africa, found less than a mile from where 25 bodies were exhumed in Mzimba</p><p>Authorities in Malawi have discovered four bodies in a forest close to where dozens more <a href=\"https://www.theguardian.com/world/2022/oct/19/malawi-police-discover-mass-grave-of-25-ethiopian-migrants\">were found in a mass grave</a> on Wednesday.</p><p>Police say the bodies were found yesterday morning, less than a mile from where 25 others were exhumed in Mtangatanga Forest Reserve in the northern district of Mzimba.</p> <a href=\"https://www.theguardian.com/global-development/2022/oct/21/bodies-thought-to-be-ethiopian-migrants-found-mass-grave-malawi\">Continue reading...</a>", "link": "https://www.theguardian.com/global-development/2022/oct/21/bodies-thought-to-be-ethiopian-migrants-found-mass-grave-malawi", "date_published": "2022-10-21 05:00:16+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Kumanjayi Walker inquest: senior NT constable justifies attending ‘drinks’ at Zachary Rolfe’s house after shooting", "description": "<p>Senior Constable Shane McCormack says he went to social gathering two days after Rolfe killed Walker because he was concerned for his welfare</p><ul><li><a href=\"https://www.theguardian.com/australia-news/live/2022/oct/21/australia-news-live-updates-eastern-states-brace-for-more-rain-floods-victoria-weather-politics-labor-plans-pacific-aid-boost-liz-truss\">Follow our Australia news live blog for the latest updates</a></li></ul><p>A senior Northern Territory police officer has told an inquest into the death of Kumanjayi Walker that he attended a gathering at the house of the officer who shot the Warlpiri teenager because he was concerned about his welfare.</p><p>Constable Zachary Rolfe shot 19-year-old Walker three times during an attempted arrest in Yuendumu, north-west of Alice Springs, in November 2019. Rolfe was <a href=\"https://www.theguardian.com/australia-news/2022/mar/11/zachary-rolfe-found-not-guilty-of-over-kumanjayi-walker-fatal-shooting\">found not guilty</a> of murder and two alternative charges after a six-week trial earlier this year.</p> <a href=\"https://www.theguardian.com/australia-news/2022/oct/21/kumanjayi-walker-inquest-senior-nt-constable-justifies-attending-drinks-at-zachary-rolfes-house-after-shooting\">Continue reading...</a>", "link": "https://www.theguardian.com/australia-news/2022/oct/21/kumanjayi-walker-inquest-senior-nt-constable-justifies-attending-drinks-at-zachary-rolfes-house-after-shooting", "date_published": "2022-10-21 04:46:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "US charges seven over alleged Beijing plot to forcibly repatriate ‘elite’ Chinese", "description": "<p>US attorney in New York criticises ‘outrageous violations of national sovereignty’ and alleges campaign of harassment against US resident</p><p>The United States has charged seven Chinese nationals it accuses of waging a surveillance and harassment campaign against a US resident and his family as part of a bid by Beijing to forcibly repatriate one of them back to China.</p><p>The eight-count <a href=\"https://www.justice.gov/usao-edny/pr/six-individuals-charged-conspiring-act-illegal-agents-peoples-republic-china-0\">indictment</a>, unsealed on Thursday in a US district court in Brooklyn, New York, is the latest case by the justice department targeting China’s global overseas campaign, known as “Operation Fox Hunt”.</p> <a href=\"https://www.theguardian.com/world/2022/oct/21/us-charge-seven-over-alleged-beijing-plot-to-forcibly-repatriate-elite-chinese\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/21/us-charge-seven-over-alleged-beijing-plot-to-forcibly-repatriate-elite-chinese", "date_published": "2022-10-21 01:51:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.theguardian.com/world/rss", "title": "Iran protests: democracies have ‘moral obligation’ to help, Canada foreign minister says", "description": "<p>Mélanie Joly tells meeting of female foreign ministers that they must help  ‘amplify the voices of women in Iran’</p><p>Canada’s foreign minister has said democracies have a “moral obligation” to help the “incredibly brave” women taking to the streets of Iran in protest, as she met other female foreign ministers to condemn the ongoing violence that has rocked the country for weeks.</p><p>“As women foreign ministers we have a responsibility to help amplify the voices of women in Iran,” Mélanie Joly told a gathering of 14 of her female counterparts, according to a readout of the event provided to the Guardian. “As women leaders from around the world, we can make a powerful statement of support for women’s rights in Iran, and by extension, women’s rights everywhere.”</p> <a href=\"https://www.theguardian.com/world/2022/oct/21/iran-protests-democracies-have-moral-obligation-to-help-canada-foreign-minister\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/oct/21/iran-protests-democracies-have-moral-obligation-to-help-canada-foreign-minister", "date_published": "2022-10-21 01:08:25+00:00", "persistent": false, "user": null, "language": "en-US"}]