[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call Of Duty: Modern Warfare 2 Campaign Review", "description": "Modern Warfare 2 had big shoes to fill, but the campaign includes a large serving of nostalgia and a fun variety of missions making it a worthy rebooted sequel.\n\n#callofduty #cod #gaming", "link": "https://www.youtube.com/watch?v=ZaNYqkXd0JY", "date_published": "2022-10-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Call of Duty: Warzone’s Guns PART 2", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down more of the weaponry of Call of Duty: Warzone, including the hideous Burger Town Classic, the knife/pistol hybrid, the Valois Revolver, and a disgusting pink-hued P90.\n\n00:00 - Opening\n00:39 - AN-94\n02:38 - Armaguerra 43\n04:16 - Cooper Carbine\n05:22 - LW3 - Tundra\n06:45 - Casanova\n07:53 - Gorenko Anti-Tank Rifle\n09:15 - Itra Burst\n10:52 - C58\n12:05 - EX1 Laser Gun\n13:13 - Burger Town Classic\n14:37 - FFAR 1\n15:43 - FN Scar 17\n17:24 - Valois Revolver\n18:26 - Whitley\n18:21 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Call of Duty: Warzone and compares them to their real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=WpO3wsLExcg", "date_published": "2022-10-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mario + Rabbids: Sparks of Hope Review", "description": "Mario + Rabbids: Sparks of Hope is an improvement over its predecessor in every way, and one of the best modern Mario spin-offs.", "link": "https://www.youtube.com/watch?v=LUmpw_Pfj9g", "date_published": "2022-10-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War Ragnarok Spoiler-Free Impressions After 5 Hours", "description": "We've been playing God of War Ragnarok on PlayStation 5, and here are our spoiler-free impressions of the game's opening, gameplay, story, and more. \n\n#godofwar #godofwarragnarok #gamespot #ps5 #playstation5 #gaming\n\nRagnarok is coming. It’s been a long four years since Kratos and Atreus blew us away in God of War (2018), and now it’s finally time to conclude their story. The GameSpot team has been playing God of War Ragnarok, and in the video above, give their spoiler-free impressions on its opening hours, and so far, so good. \n\nGod of War Ragnarok takes place a few years after the end of God of War, with Kratos, Atreus, and Mimir spending the years training and preparing for the impending Ragnarok. Tamoor, Lucy, and Jake discuss how the emotional opening sets up the rest of the game and how Ragnarok feels familiar but makes some subtle changes. \n\nFor more God of War Ragnarok, head over to gamespot.com to read Tamoor's impressions, and make sure to subscribe to YouTube.com/GameSpot for our God of War Ragnarok review.", "link": "https://www.youtube.com/watch?v=epIbDEGG3OI", "date_published": "2022-10-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Is Code Veronica Getting a Remake? | GameSpot News", "description": "Resident Evil producer opens up about a Code Veronica remake, Resident Evil 4 Remake gets a new gameplay trailer and Village gets a third person demo.\n#GamingNews #RE #ResidentEvil\n\nDuring an interview with Noisy Pixel, Resident Evil producer Yoshiaki Hirabayashi confirmed that Capcom currently has no plans to remake Resident Evil: Code Veronica. If you’re new to the Resident Evil games, Code Veronica is a cult classic that was first released as a Dreamcast exclusive, but eventually came to the PlayStation 2 with more cutscenes. The game is set between Resident Evil 2 and 3; games that had remakes released in 2019 and 2020 respectively. So it's only natural to wonder if Capcom plans to redo this middle story as well. \n\nLuckily for fans, that lack of plans doesn’t seem to be set in stone and Hirabayashi added that the opportunity for a Code Veronica remake hadn't been ruled out entirely. In the meantime, if you find yourself needing to play the game on current-gen hardware, you can check out the 2011 remaster on Xbox Series X|S via backward compatibility. \n\nWhile that Resident Evil game won't be getting a remake yet, one of the most beloved entries in the series will be getting a massive overhaul next year. Resident Evil 4 will arrive on PC, PS5, PS4, and Xbox Series X|S on March 24, 2023, and a new trailer showed off more of the game's big set piece moments and creepy monsters during Capcom's latest showcase.\n\nThere is currently an RE4 Remake hands-on preview on the GameSpot YouTube channel right now in which Kurt Indovina walks you through his time with the game.\n\nFull Video: https://youtu.be/6DXTWwxZeA4", "link": "https://www.youtube.com/watch?v=u_GEKFX_Jfg", "date_published": "2022-10-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokemon Scarlet And Violet: Big Changes Explained", "description": "This isn't Pokemon Legends: Arceus, but in some ways it's taking even bigger swings with the franchise formula.\n\nPokemon Scarlet and Violet are just around the corner and GameSpot's editor Steve Watts got to check it out for over an hour. Here are his thoughts on latest Pokemon adventure.\n\nPokemon Scarlet and Violet take place in the Paldea region. In these games players can challenge gym leaders in any order and tackle the story in any way they see fit. GameFreak has also announced a handful of new monsters for trainers to find and collect.\n\nScarlet and Violet come to the Nintendo Switch on November 18.\n\n#pokemon #gamespot #gaming", "link": "https://www.youtube.com/watch?v=mSXwpxVXgoY", "date_published": "2022-10-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]