[{"source": "https://www.theguardian.com/rss", "title": "Personality splash: five ways to be more ‘you’ at work", "description": "<p>From personalising your space to dressing to express, five experts in business culture and office design share their tips on how and why employees should bring more of themselves into the workplace</p><p>Depending on your line of work, expressing your personality at the office can feel awkward – or even unthinkable. But when employees are allowed to more fully express themselves in their workspace, it can make a big difference to their wellbeing, and to their work.</p><p>“The average person will spend a third of their life at work, and if you’re made to leave your personality at the door, that’s going to have a huge impact on your mental health, your identity and your self-confidence,” says Jessica Andrews, founder of branding consultancy <a href=\"http://rabbitandotherstories.com/\" rel=\"nofollow\">Rabbit &amp; Other Stories</a>. “In turn, your motivation, your productivity, and your results will suffer; and for a company, that’s not good news.”</p> <a href=\"https://www.theguardian.com/business-driving-another-way/2022/oct/21/personality-splash-five-ways-to-be-more-you-at-work\">Continue reading...</a>", "link": "https://www.theguardian.com/business-driving-another-way/2022/oct/21/personality-splash-five-ways-to-be-more-you-at-work", "date_published": "2022-10-21 12:48:46+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Business on the move: the new breed of company EV", "description": "<p>From virtual showrooms to cutting-edge tech, the all-electric CUPRA Born is showing what the next generation of business travel looks like</p><p>Looking at a new company car online and checking one out in a showroom have, up until now, been two very separate experiences – neither of which are ideal. Sitting at home in front of your computer screen will allow you to spec a vehicle. You might be able to give it a 360-degree spin if the manufacturer’s website features all the bells and whistles, but you won’t really get much of a feel for your potential new car; and you’ll have to go digging through the rest of the website to find answers to any specific questions you may have. Visiting a showroom, on the other hand, will get you up close and personal to the vehicle, but you have to physically get to the dealership in the first place. <br /><br />In a best-of-both worlds approach, CUPRA is combining the website and showroom experiences into one single process. In the market for a new company car, for example the Born all-electric vehicle? Then visit the new CUPRA <a href=\"https://www.cupraofficial.co.uk/about-cupra/virtual-showroom.html\" rel=\"nofollow\">Virtual Showroom</a> and you’ll be able to get a live tour of the car online – through your computer or phone – with a product expert showing you around the vehicle’s exterior and interior, taking you through its numerous features and answering all the questions you can think of. No waiting around, no wasted time: click the link, set up an appointment and a CUPRA agent will send you a message, connect you to an audio and video session, and you’re ready to go.</p><p>You can direct the agent through the car as you wish, and sessions can be as brief or as detailed as you need, lasting from just a few minutes to an hour. It’s totally up to you. And the experience itself is impressive. Being able to guide the agent around the car, essentially via a video call, allows you to see what you want to see of the vehicle in clear, close-up detail, as well as witnessing the interior tech being put to use in real time. In the modern hybrid working landscape, where Zoom calls are now the norm, the CUPRA Virtual Showroom has successfully plugged itself into the zeitgeist. <br /><br />“It’s pretty innovative,” says Martin Gray, CUPRA’s UK contract hire and leasing manager. “We’ve had great reactions from customers so far. It really works for the Born, as the car is so different from others in its class. Because of the way it looks, and because of its technology and the way the dashboard is set up, people really want to get a good look at it. And in a climate where supply of actual physical vehicles has become a real issue, this gives more people the opportunity to see the Born up close and personal.”</p> <a href=\"https://www.theguardian.com/business-driving-another-way/2022/oct/21/business-on-the-move-the-new-breed-of-company-ev\">Continue reading...</a>", "link": "https://www.theguardian.com/business-driving-another-way/2022/oct/21/business-on-the-move-the-new-breed-of-company-ev", "date_published": "2022-10-21 12:48:03+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Best fleet forward: seven things to consider when choosing your next company car", "description": "<p>Choosing a company car is not quite the same as deciding on a vehicle for yourself. Here, a fleet expert offers his tips on how to go about it</p><p>From budgeting to emissions to tax efficiency, there’s plenty to consider when you’re looking for your perfect company car. Stephen Briers, editor of industry bible Fleet News, explains the most important things to bear in mind before you sign on the dotted line.</p><p><strong>Purpose driven<br /></strong>The very first thing you need to do before deciding on a company car is to ask yourself a simple question: what do you actually need it to do?</p> <a href=\"https://www.theguardian.com/business-driving-another-way/2022/oct/21/best-fleet-forward-seven-things-to-consider-when-choosing-your-next-company-car\">Continue reading...</a>", "link": "https://www.theguardian.com/business-driving-another-way/2022/oct/21/best-fleet-forward-seven-things-to-consider-when-choosing-your-next-company-car", "date_published": "2022-10-21 12:46:52+00:00", "persistent": false, "user": null, "language": "en-UK"}]