[{"source": "https://feeds.feedburner.com/TheHackersNews", "title": "Emotet Botnet Distributing Self-Unlocking Password-Protected RAR Files to Drop Malware", "description": "The notorious Emotet botnet has been linked to a new wave of malspam campaigns that take advantage of password-protected archive files to drop CoinMiner and Quasar RAT on compromised systems.\nIn an attack chain detected by Trustwave SpiderLabs researchers, an invoice-themed ZIP file lure was found to contain a nested self-extracting (SFX) archive, the first archive acting as a conduit to launch", "link": "https://thehackernews.com/2022/10/emotet-botnet-distributing-self.html", "date_published": "2022-10-21 16:47:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://feeds.feedburner.com/TheHackersNews", "title": "Multiple Campaigns Exploit VMware Vulnerability to Deploy Crypto Miners and Ransomware", "description": "A now-patched vulnerability in VMware Workspace ONE Access has been observed being exploited to deliver both cryptocurrency miners and ransomware on affected machines.\n\"The attacker intends to utilize a victim's resources as much as possible, not only to install RAR1Ransom for extortion, but also to spread GuardMiner to collect cryptocurrency,\" Fortinet FortiGuard Labs researcher Cara Lin said", "link": "https://thehackernews.com/2022/10/multiple-campaigns-exploit-vmware.html", "date_published": "2022-10-21 14:56:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://feeds.feedburner.com/TheHackersNews", "title": "Hackers Started Exploiting Critical \"Text4Shell\" Apache Commons Text Vulnerability", "description": "WordPress security company Wordfence on Thursday said it started detecting exploitation attempts targeting the newly disclosed flaw in Apache Commons Text on October 18, 2022.\nThe vulnerability, tracked as CVE-2022-42889 aka Text4Shell, has been assigned a severity ranking of 9.8 out of a possible 10.0 on the CVSS scale and affects versions 1.5 through 1.9 of the library.\nIt's also similar to", "link": "https://thehackernews.com/2022/10/hackers-started-exploiting-critical.html", "date_published": "2022-10-21 11:03:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://feeds.feedburner.com/TheHackersNews", "title": "A Quick Look at the \"Strengthening America's Cybersecurity\" Initiative", "description": "Acknowledging that you have a problem is the first step to addressing the problem in a serious way. This seems to be the reasoning for the White House recently announcing its \"Strengthening America's Cybersecurity\" initiative.\nThe text of the announcement contains several statements that anyone who's ever read about cybersecurity will have heard many times over: increasing resilience, greater", "link": "https://thehackernews.com/2022/10/a-quick-look-at-strengthening-americas.html", "date_published": "2022-10-21 10:48:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://feeds.feedburner.com/TheHackersNews", "title": "Microsoft Confirms Server Misconfiguration Led to 65,000+ Companies' Data Leak", "description": "Microsoft this week confirmed that it inadvertently exposed information related to thousands of customers following a security lapse that left an endpoint publicly accessible over the internet sans any authentication.\n\"This misconfiguration resulted in the potential for unauthenticated access to some business transaction data corresponding to interactions between Microsoft and prospective", "link": "https://thehackernews.com/2022/10/microsoft-confirms-server.html", "date_published": "2022-10-21 10:12:00+00:00", "persistent": false, "user": null, "language": "en-US"}]