[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCNvzD7Z-g64bPXxGzaQaa4g", "title": "10 OVER THE TOP Missions in Video Games", "description": "Many video game missions and moments push the line, but few truly go over the top. Here are some of our favorite big video game moments.\nSubscribe for more: https://www.youtube.com/gameranxTV?sub_confirmation=1\n\n0:00 Intro\n0:16 Uncharted 3 - Stowaway\n2:31 Doom Eternal - Mars Core\n4:14 Marvel's Spider-man - Straw, Meet Camel\n5:31 Call of Duty: Black Ops 2 - Cordis Die \n7:05 Gears of War 2 - Intestinal Fortitude\n8:19 Saints Row: The Third - STAG Film\n9:58 Titanfall 2 - The Ark\n11:38 Grand Theft Auto 5 - Minor Turbulence\n12:53 Wolfenstein 2 - VENUS\n14:25 Guardians of the Galaxy - Into the Fire", "link": "https://www.youtube.com/watch?v=DJr54IsulMk", "date_published": "2022-03-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCNvzD7Z-g64bPXxGzaQaa4g", "title": "Elden Ring: 10 Optional Bosses You SHOULDN'T MISS", "description": "Elden Ring (PC, PS5, PS4, Xbox Series X/S/One) is a massive game filled with multiple bosses you can skip or avoid in the open world. Here are some of our favorites.\nSubscribe for more: https://www.youtube.com/gameranxTV?sub_confirmation=1\n\n#EldenRing\n\n10. Spirit-caller Snail - ROAD'S END CATACOMBS, found in eastern Liurnia south of the minor Erdtree\n\n9. Starscourge Radahn - found in Redmane Castle, in the Southern part of Caelid\n\n8. Godskin Apostle - Dominula, Windmill Village which is on the northern edge of the Altus Region\n\n7. Patches - found in Murkwater cave in the center of Limgrave, look for a cave entrance in the ravine filled with skeletons\n\n6. Mimic Tear - found in Nokron, which can only be accessed after defeating Starscourge Radahn and going down the giant hole in Limgrave formed by his comet, which is in South of Mistwood\n\n5. Wormface - the guardian of the Minor Erdtree at the center of Altus in the forest area\n\n4. Dragonkin Soldier of Nokstella - Found by exploring the ainsel river region, which can be accessed in the Liurnia region from the Ainsel River Well north of the Liurnia Divine tower\n\n3. Ancestor Spirit - found by lighting the fires at all of the monuments in the Siofra River area then going to Hallowhorn hall and interacting with the corpse. The area can be accessed from the Siofra River Well, which is found near the Minor Erdtree in Limgrave, in the mistwood forest.\n\n2. Ryckard - Found in the Volcano Manor at the top of Mt. Gelmir, which is in the western part of Atlus. Can only be accessed if you agree to help Lady Tanith and complete the questline there, a secret door can be found in the first room to the right after you've made enough progress with the quest. Kill the people she wants you to kill and talk to everyone and it should unlock.\n\n1. Astel - Found in the River of Rot, an area that can only be accessed by making a certain amount of progress in Ranni's Questline, which is too complicated to explain here - \nhttps://gameranx.com/features/id/290315/article/elden-ring-how-to-enter-the-lake-of-rot-secret-area-guide/\n\nBONUS \n\nMalenia - Found in Miquella's Haligtree, a location that can only be reached by finding 2 parts of the Haligtree Secret Medallion. 1 is found in Castle Sol in the Mountaintop of the Giants and one is in the Village of the Albinaurics, a town build under a mountain to the west in Liurnia. There's a villager disguised as a pot hiding there: attack them to reveal the ruse and talk to them to get 1 half of the haligtree secret medallion. When you have both you get an alternate option at the Grand Lift of Rold that takes you to the Consecrated Snowfield and eventually the Haligtree.", "link": "https://www.youtube.com/watch?v=uO7hMUz09Zw", "date_published": "2022-02-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCNvzD7Z-g64bPXxGzaQaa4g", "title": "Top 10 NEW Free Games of 2022", "description": "Looking a free game on PC, PS5, PS4, Xbox Series X/S/One or Nintendo Switch? We've got you covered with these NEW free to play games.\nSubscribe for more: https://www.youtube.com/gameranxTV?sub_confirmation=1\n\n#10 The Cycle: Frontier \n\nPlatform : PC\n\nRelease Date : 2022 \n\n\n#9 Spine \n\nPlatform : PC PS4 PS5 XSX|S XBOX ONE \n\nRelease Date : TBA \n\n\n#8 Gangstar New York \n\nPlatform : PC\n\nRelease Date : 2022  \n\n\n#7 Crowz \n\nPlatform : PC\n\nRelease Date : TBA \n\n\n#6 ExoMecha\n\nPlatform : PC XSX|S XBOX ONE \n\nRelease Date : 2022 \n\n\n#5 KartRider: Drift \n\nPlatform : PC PS4 XBOX ONE \n\nRelease Date : 2022\n\n#4 MultiVersus \n\nPlatform : PC PS4 PS5 XSX|S XBOX ONE \n\nRelease Date : 2022 \n\n\n#3 Overprime \n\nPlatform : PC \n\nRelease Date : 2022 \n\n\n#2 ARC Raiders \n\nPlatform : PC PS5 XSX|S \n\nRelease Date : TBA 2022 \n\n\n#1 Vampire: The Masquerade - Bloodhunt \n\nPlatform : PC PS5 \n\nRelease Date : 2022 \n\n\n\nBonus :- \n\n\n\nSCP: Nine-Tailed Fox \n\nPlatform : PC \n\nRelease Date : February 2, 2022, Early Access \n\n\n\nUndecember \n\nPlatform : PC \n\nRelease Date : 2022", "link": "https://www.youtube.com/watch?v=3vEPKiP-d2Y", "date_published": "2022-02-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]