[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Don't Miss These Xbox Game Pass Games", "description": "The Game Pass catalogue continues to grow new games like Madden NFL 22, Taiko No Tatsujin: The Drum Master!, and Telling Lies.\n\nThere's a lot of games to play on Xbox Game Pass, and with its catalog ever-growing, it can be a lot to keep track of. In this video, we go over some of the recent games to make their way to the service, like Telling Lies, or Madden NFL 22, as well as some hidden gems like Skul: The Hero Slayer, and Echo Generation. \n\n00:00 - Intro\n00:18 - Telling Lies\n01:11 - Madden NFL 22\n02:04 - Dreamscaper\n02:51 - The Pedestrian\n03:29 - Echo Generation\n04:03 - Neon Abyss\n04:44 - Skul: The Hero Slayer\n05:18 - Into the Pit\n05:54 - Lost Words: Beyond the Page\n06:28 - Mind Scanners\n07:10 - Taiko No Tatsujin: The Drum Master!", "link": "https://www.youtube.com/watch?v=xzbC6thOiXU", "date_published": "2022-03-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Beats Destiny 2 The Witch Queen | GameSpot News", "description": "Elden Ring is dominating Steam’s best seller list, Steam could team up with Game Pass, and Pokémon Scarlet and Violet are announced. \n\nThe list of best-selling games on Steam for the past week has been revealed, and unsurprisingly, From Software's massively anticipated Elden Ring topped the charts, while Destiny 2's Witch Queen expansion also performed well.\n\nSpeaking to PC Gamer, Newell said Valve is unlikely to create a similar service of its own, but working with Microsoft to add Game Pass to Steam might be something Valve would consider.\n\nThe Pokémon Company has announced the next generation of Pokémon games, Scarlet and Violet, and both are coming to Nintendo Switch later this year.\n\nSTAMPS\n00:00 - Intro\n00:06 - Elden Ring\n00:55 - Game Pass x Steam\n01:47 - Pokémon Gen 9", "link": "https://www.youtube.com/watch?v=rRlYd8IIJ9w", "date_published": "2022-03-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Creator Reacts To Difficulty Comments | GameSpot News", "description": "Elden Ring director comments on the game’s difficulty, Elden Ring PC mod lets you pause the game, and Xbox Game Pass for March includes Guardians Of The Galaxy.    \n\nFrom Software's Hidetaka Miyazaki, Elden Ring’s director, has weighed in on the discussion surrounding the game's difficulty. Speaking to The New Yorker, Miyazaki said he feels apologetic to those who are hesitant to play From Software's games due to their difficulty. \n\nModder TechieW's fix is easy to install and use in the PC version of Elden Ring, but you'll need to disable Easy Anti-Cheat to make it run smoothly. \nMod: https://www.nexusmods.com/eldenring/mods/43\nEasy Anti-Cheat: https://www.windowscentral.com/how-disable-anti-cheat-elden-ring\n\nGuardians of the Galaxy coming to Game Pass on March 10th! You can also look forward to the cloud version of Microsoft Flight Sim, Lightning Returns: Final Fantasy XIII, Kentucky Route Zero, and several other games this month.\n\nSTAMPS\n00:00 - Intro\n00:08 - Elden Ring difficulty  \n00:44 - Elden Ring Pause Mod\n01:31 - Elden Ring JoyCon Mod\n02:08 - Guardians of the Galaxy on Game Pass\n\n#EldenRing #GamePass", "link": "https://www.youtube.com/watch?v=Cc3nGknNWJU", "date_published": "2022-03-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Witch Queen Is Destiny 2's Best Campaign Yet (Opinion)", "description": "For the first time we have a complete, and exceptional campaign in Destiny 2. It's latest expansion, The Witch Queen, takes all of the best lessons learned from past Destiny games and offers a campaign that rivals those of Bungie's classic Halo games. Here's why.\n\nDestiny 2: The Witch Queen is live and numerous Guardians are eagerly flying into Savathun's Throne World right now. The expansion offers a huge glut of content, including a brand-new story campaign with a Legendary difficulty level, and a rework of what we've come to expect from Destiny 2 campaign missions.\n\nIn this video, David shares his opinion on how The Witch Queen has been one of, if not the, best campaigns in Destiny's history with strong callbacks to the heyday of Halo or even Doom. With new gameplay mechanics like the Deepsight Resonance and battling the new Hive sect known as the Lucent Brood. Destiny is triumphantly showing all the things Bungie has learned from its past releases.\n\nWe've  got plenty more coverage for Destiny 2 on GameSpot.com. Be sure to stay tuned for our Destiny 2: The Witch Queen review by Phil Hornshaw. If you're hungry for more Destiny content, we'll have links at the end of this video to some of our other breakdowns.\n\n#Destiny2", "link": "https://www.youtube.com/watch?v=ylZPCwfv2cM", "date_published": "2022-03-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Tiny Tina's Wonderlands Hands-On Impressions", "description": "So far, Tiny Tina's Wonderlands feels like Borderlands 3 channeling tabletop roleplaying culture on a surface level only. After spending time with the Stabbomancer and Graveborn classes, and fostering a goblin rebellion, we were left remembering what made Assault on Dragon Keep so special.", "link": "https://www.youtube.com/watch?v=gU8-SlwlAxo", "date_published": "2022-02-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]