[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Open Source Software has a funding problem.", "description": "Get 100$ credit for your own Linux and gaming server: https://www.linode.com/linuxexperiment \n\n150€ off the Slimbook Executive ultrabook with code executive-laptop-nick-friends: https://slimbook.es/en/executive-en\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n00:00 Intro\n00:44 Sponsor : 100$ credit on your Linux or gaming server\n01:56 Open Source doesn't mean \"free of charge\"\n03:51 The Web runs on Free and Open Source Software\n05:35 LOG4J, Faker and Colors\n08:25 Who needs to pay?\n10:56 The status quo isn't sustainable\n12:13 150€ off your next ultrabook!\n12:34 Support the channel\n\nA lot of people assume that open source, or free software is free of charge, but while that's generally the case, it's not an obligation. \n\nThis ends up with a paradox: user facing software that has a GUI and is used by regular users tends to have easier access to funding than server-side libraries that are used by giant companies that make billions each year, because basic users will part more easily with their cash, one dollar at a time, than a company that doesn't really know what they use to make their own stuff work.\n\nAnd this brings us to the second major point of the video: the modern web is heavily dependent on free and open source software.\n\nhttps://hostingtribunal.com/blog/linux-statistics/\n\nLinux isn't the only open source project underpinning the web. For a long while, the default stack for a server was LAMP: Linux, Apache, MySQL, and PHP. All open source projects. It's less true nowadays, with tons of new technologies being used to replace these various components, but most of these new technologies are open source.\n\nWith the rise of NPM, the Node Package Manager, it's easier than ever to access hundreds of thousands of libraries for your projects, most of them open source.\n\nRecent issues have showcased all of that. Let's begin with log4j.\n\nIt's one of the most popular logging libraries used online. It gives software developers a way to build a record of activity to be used for anything from troubleshooting to auditing,  data tracking, whatever else. \nCompanies such as Apple, IBM, Oracle, Cisco, Google and Amazon, all run Log4j. Except THIS library had a huge vulnerability that affected almost the entire web a few months ago.\n\nAnother recent issue with a very different outcome was with the very, very popular libraries colors, and faker.\n\n“Colors\" enables users to “get color and style in their node.js console.” It is downloaded over 23 million times per week and has nearly 19,000 projects that depend on it. “Faker,” creates fake, realistic data for testing purposes, and it's downloaded over 2.4 million times per week and has over 2,500 projects depending on it.\n\nExcept their developer got fed up of having super successful projects that didn't turn in any money, and were used by fortune 500 companies, so one day, he decided to push an update that borked the output of both libraries. \n\nFirst it would have been easier to spot the issue in log4j had companies that used that library implemented a code review process for open source code they want to use, and maybe contribute to improving said code.\n\nSecond, if companies decided that they wanted to make their own work depend on smaller open source projects, a monetary contribution doesn't seem so crazy.\n\nThe current model of web giants basing their own offerings on the shoulders of unpaid volunteers, and expecting all of that to work flawlessly without ever contributing to it, with code, or money, isn't really sustainable. As a project is used by bigger companies, it becomes a target for malicious hackers, and making sure that this code is secure can become a full time job that no one can expect an unpaid volunteer to do.", "link": "https://www.youtube.com/watch?v=FtI055VWhYY", "date_published": "2022-03-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]