[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "FKA twigs: Tiny Desk (Home) Concert", "description": "This year, NPR Music is celebrating Black Music Month with an array of brand new Tiny Desk concerts — both from home and from behind our beloved Desk. Together, these artists represent the past, present and future of Black music. This month of carefully curated shows is a celebration of Black artists expressing themselves in ways we've never seen before, and of the Tiny Desk's unique way of showcasing that talent.\n\nLaTesha Harris | June 10, 2022\nTo see her is to appreciate a rare portrait. To watch her dance and hear her sing is to fall, entranced, into an uncanny haze. Both snake and its charmer, British Jamaican multidisciplinary artist FKA twigs is a new-age priestess. Surrounded by flames of offering in the hallowed halls of London's St. Matthias Church, the Grammy-nominated artist and her three-piece supporting band deliver a sermon on the perils of devotion. In her three-song Tiny Desk (home) concert -- featuring soul-baring ballads like “home with you” and “cellophane” -- she honors the strength of vulnerability; her operatic soprano ignites and delivers catharsis. \n\nAfter working as a backup dancer with hopes of transitioning to singing, FKA twigs released two EPs before achieving widespread critical acclaim with her debut studio album, 2014’s LP1, and its lead single, “Two Weeks.” A classically trained singer, FKA twigs makes music that blends deceptively demure vocals with otherworldly trip-hop beats. She perfected this signature avant-garde sound on her sophomore album, 2019’s MAGDALENE, establishing herself as a direct musical descendent of iconic innovators like Kate Bush and Janet Jackson. Fresh off the success of her recent mixtape, CAPRISONGS, FKA Twigs blesses viewers with a performance of her latest song, “killer.” \n\nSET LIST\n“home with you”\n“killer”\n“cellophane”\n\nMUSICIANS\nFKA twigs: vocals\nKelly Nicole Moran: piano \nDamsel Elysium: double bass, violin\nLucinda Chua: cello\n\nCREDITS\nDirector: Aidan Zamiri\nProducer: Aidan Robert Brooks \nExecutive Producer: Morgan Clement \nPA: Fluer\nDirector of Photography: Jake Hunter \nAC: George Power\nAC: Mac Christie\nGaffer: Alex Cullen\nSpark: Ben Alder\nArt Director: Alan Scott\nArt Assistant: Tasneem Elnayal\nMusic Director: Bubbleman\nSound Engineer: Johnny Williams\nCreative Producer: Pia Ashcroft\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Joshua Bryant\nAudio Mastering: Josh Rogosin\nAnimation: Kaz Fantone\nTiny Production Team: Bob Boilen, Kara Frame, Michael Zamora, Maia Stern, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #tinydeskconcert #fkatwigs", "link": "https://www.youtube.com/watch?v=NNodeNnXWy0", "date_published": "2022-06-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]