[{"source": "https://businessinsider.com.pl/.feed", "title": "Upadek FTX. Część klientów ma odzyskać aktywa", "description": "Klienci FTX na całym świecie nie mogą uzyskać dostępu do swoich pieniędzy. Jednak Japoński oddział upadłej giełdy kryptowalut FTX zapowiedział w piątek, że zwróci aktywa swoim inwestorom.", "link": "https://businessinsider.com.pl/gielda/upadek-ftx-czesc-klientow-ma-odzyskac-aktywa/0glz36b", "date_published": "2022-12-30 20:50:46+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Ceny paliw. Za ile zatankujemy po Nowym Roku?", "description": "Wraz z nowym rokiem kończy się obniżka VAT na paliwa w ramach tarczy antyinflacyjnej. Wzrosną też akcyza i opłata paliwowa. Zdaniem analityków e-petrol.pl do niedawna wyglądało na to, że w rok 2023 wejdziemy w cenach zbliżonych do tych z ostatnich tygodni, ale najświeższe prognozy wskazują na inny scenariusz.", "link": "https://businessinsider.com.pl/gospodarka/ceny-paliw-za-ile-zatankujemy-po-nowym-roku/ysegxjb", "date_published": "2022-12-30 19:17:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Błędy na LinkedIn – rodzaje, jak ich unikać, sposoby na wyróżnienie się", "description": "Obecnie LinkedIn to jeden z popularniejszych portali zawodowych. Służy on przede wszystkim do stworzenia swojego oficjalnego, widocznego publicznie CV. Zamieszcza się tam informacje o swoim doświadczeniu zawodowym, wykształceniu czy umiejętnościach. Jest to jedno z narzędzi używanych przez headhunterów, poszukujących osób do pracy. Z tego względu warto postarać się o zrobienie jak najlepszego wrażenia i zadbanie o najlepszą jakość profilu. Jakie są popularne błędy na LinkedIn? Jak wyróżnić się w internecie?", "link": "https://businessinsider.com.pl/poradnik-finansowy/kredyty/bledy-na-linkedin-rodzaje-jak-ich-unikac-sposoby-na-wyroznienie-sie/jjrcx0z", "date_published": "2022-12-30 19:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Dziedziczenie środków z polisy na życie — jak to działa?", "description": "Dziedziczenie środków z polisy na życie może dotyczyć osób, które są faktycznie spokrewnione z ubezpieczonym, bądź tzw. uposażonych, czyli wyznaczonych przez płatnika składek osób z kręgu najbliższych znajomych. Jak przebiega przekazanie pieniędzy z polisy na życie? Czy obdarowany musi zapłacić podatek?", "link": "https://businessinsider.com.pl/poradnik-finansowy/ubezpieczenia/dziedziczenie-srodkow-z-polisy-na-zycie-zasady-opodatkowanie/nedc9t7", "date_published": "2022-12-30 19:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Obowiązkowe ubezpieczenia gospodarcze — o czym należy pamiętać?", "description": "Ubezpieczenia to zjawisko bardzo powszechne i dotyczące każdego. Konieczność ich uregulowania często bierze na siebie pracodawca, więc pracownik nie zawsze ma świadomość, ile różnych polis jest pokrywanych z jego kieszeni. A może być ich wiele, gdyż to dość złożony temat, który obejmuje wielu dziedzin życia. Aby móc go w pełni zgłębić, warto zadać sobie kilka pytań. Czym są ubezpieczenia gospodarcze? Które z nich są obowiązkowe?", "link": "https://businessinsider.com.pl/poradnik-finansowy/ubezpieczenia/istota-ubezpieczen-gospodarczych-kogo-dotycza-i-jaki-jest-ich-podzial/60dfrsj", "date_published": "2022-12-30 19:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Odsetki ustawowe – 2022 r. przynosi kolejne zmiany dla kredytobiorców", "description": "Termin \"odsetki ustawowe\" z pewnością nie jest obcy kredytobiorcom. Zwłoka w spłacie zobowiązań finansowych wiąże się z ponoszeniem dodatkowych opłat. Ich wysokość określana jest w umowie, więc każdy powinien ze szczególną uwagą czytać podpisywane dokumenty. Jednak modyfikacje dotyczące tego zagadnienia pojawiają się coraz częściej, dlatego zaleca się skrupulatnie śledzić postanowienia Rady Polityki Pieniężnej. Czym są odsetki ustawowe? Jakie zmiany zostały wprowadzone 7 września 2022 r.?", "link": "https://businessinsider.com.pl/twoje-pieniadze/prawo-i-podatki/odsetki-ustawowe-w-2022-r-jak-rysuja-sie-nowe-stawki/dcp10kb", "date_published": "2022-12-30 19:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Co obejmuje i ile kosztuje obowiązkowe ubezpieczenie dla lekarzy?", "description": "Zawód lekarza nieodłącznie wiąże się z ogromną odpowiedzialnością za ludzkie zdrowie i życie. Mimo wielu lat nauki i praktyki, każdy medyk może popełnić błąd wynikający z przepracowania bądź stresu. Niestety, skutki dla pacjenta bywają bardzo poważne. Z tego względu polskie prawo wymaga od lekarzy wykupywania obowiązkowego ubezpieczenia OC. Jakie koszty może ono pokryć? Ile kosztuje w 2022 r. obowiązkowe ubezpieczenie lekarzy?", "link": "https://businessinsider.com.pl/poradnik-finansowy/ubezpieczenia/ile-kosztuje-obowiazkowe-ubezpieczenie-dla-lekarzy-w-2022-r/ggsd3g4", "date_published": "2022-12-30 18:45:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Czy ZUS dyskryminuje wykluczonych cyfrowo? Znamy odpowiedź", "description": "Od 1 stycznia 2023 r. każda osoba prowadząca własną działalność musi mieć konto na platformie PUE. Rzecznik praw obywatelskich zwraca uwagę, że wiek i brak umiejętności cyfrowych może utrudniać rozliczanie się z ZUS i korespondowanie w formie elektronicznej. Wystąpił w tej sprawie do ZUS-u. Zakład w odpowiedzi na pytania Business Insidera tłumaczy, że część płatników nadal może składać papierowe dokumenty. Trzeba jednak uważać na korespondencję.", "link": "https://businessinsider.com.pl/prawo/praca/obowiazek-posiadania-konta-na-pue-zus-jak-skladac-dokumenty-jak-odbierac/e4y954k", "date_published": "2022-12-30 18:44:06+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Ubezpieczenie działki ROD – na czym polega?", "description": "Wypoczynek na działce od lat cieszy się wielką popularnością wśród Polaków. Własne miejsce na grilla lub do uprawy warzyw pozwala odpocząć od miejskiego zgiełku. Niestety, ze względu na swoją specyfikę, ogródki działkowe nie są objęte stałym nadzorem właścicieli, którzy nierzadko pozastawiają je na długie tygodnie. Z tego względu istnieje ryzyko włamań, dewastacji czy pożarów, które odkrywa się długo po fakcie. Jak ubezpieczenie ROD pomaga ochronić działkę? Ile ono kosztuje?", "link": "https://businessinsider.com.pl/poradnik-finansowy/ubezpieczenia/ubezpieczenie-dzialki-rod-koszt-zakres-i-specyfika-polisy/x4p37h4", "date_published": "2022-12-30 18:30:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Mieszkanie komunalne — co to jest i czy można je ubezpieczyć?", "description": "Niskie czynsze mieszkań komunalnych co roku zachęcają wielu obywateli Polski do składania wniosków, aby stać się najemcą jednego z takich lokali. Każda osoba, której udaje się przejść przez wszystkie procedury i otrzymać mieszkanie, ma zatem niebywałe szczęście. Co trzeba wiedzieć przed rozpoczęciem dopełniania formalności? Kto może ubiegać się o mieszkanie komunalne? Czy takie lokum da się ubezpieczyć?", "link": "https://businessinsider.com.pl/poradnik-finansowy/ubezpieczenia/mieszkanie-komunalne-co-to-jest-i-czy-mozna-je-ubezpieczyc/nmc1khl", "date_published": "2022-12-30 18:15:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Ubezpieczenie domu od czynników naturalnych – czy można zabezpieczyć się przed powodzią, pożarem lub gradem?", "description": "Ubezpieczenie domu to bardzo ważny element, o który warto zadbać, decydując się na własne lokum. Daje on ogromny komfort psychiczny, ponieważ gwarantuje zabezpieczenie finansowe w różnych niespodziewanych sytuacjach. W zakres podstawowej polisy zazwyczaj nie wchodzą jednak szkody wyrządzone przez żywioły. Z tego względu dobrym rozwiązaniem będzie zdecydowanie się na ubezpieczenie domu od czynników naturalnych. Jakie są zalety takiej polisy? Ile to kosztuje i w jakich sytuacjach może obowiązywać?", "link": "https://businessinsider.com.pl/poradnik-finansowy/ubezpieczenia/ubezpieczenie-domu-od-czynnikow-naturalnych-rodzaje-koszt-zakres-ochrony/98kh2wb", "date_published": "2022-12-30 18:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Operator musiał ograniczyć produkcję farm wiatrowych. Rzadka sytuacja", "description": "Takie sytuacje zdarzają się w polskiej energetyce dość rzadko. Polskie Sieci Elektroenergetyczne wydały polecenie ograniczenia produkcji farm wiatrowych. To już drugi raz w tym tygodniu. W ostatnich dniach doszło do splotu dwóch czynników – niskiego zapotrzebowania na prąd i wysokiej produkcji energii z farm wiatrowych.", "link": "https://businessinsider.com.pl/wiadomosci/operator-musial-ograniczyc-produkcje-farm-wiatrowych-rzadka-sytuacja/t003mz5", "date_published": "2022-12-30 17:44:50+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "To było rewolucyjne orzeczenie sądu ws. WIBOR-u. Teraz jest nagły zwrot akcji", "description": "To miało być tsunami na rynku kredytowym, które pogrąży banki. Gdy w listopadzie sąd wydawał zabezpieczenie polegające na \"odwiborowaniu\" kredytu złotowego, niektórzy odtrąbili rewolucję dla kredytobiorców. Teraz jednak mamy gwałtowny zwrot akcji, bo po zażaleniu banku Sąd Okręgowy w Katowicach tuż przed świętami cofnął postanowienie sprzed niespełna dwóch miesięcy.", "link": "https://businessinsider.com.pl/gospodarka/to-bylo-rewolucyjne-orzeczenie-ws-wibor-u-teraz-jest-zwrot-akcji/6rm99zg", "date_published": "2022-12-30 17:34:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kongres ujawnił zeznania podatkowe Trumpa. Problemem m.in. wydatki na fryzjera", "description": "Komisja finansów Izby Reprezentantów opublikowała w piątek zeznania podatkowe byłego prezydenta USA Donalda Trumpa i jego firm z lat 2015-2020. Już wcześniej komisja ujawniła, że Trump nie zapłacił praktycznie żadnego federalnego podatku dochodowego w trzech z sześciu lat. Odliczał sobie bowiem od niego wydatki na fryzjera czy charakteryzatorów.", "link": "https://businessinsider.com.pl/wiadomosci/kongres-ujawnil-zeznania-podatkowe-trumpa-problemem-min-wydatki-na-fryzjera/zpwh6w2", "date_published": "2022-12-30 16:40:11+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Podwyżki płacy minimalnej tu uderzą najmocniej. Nowe dane o mikrofirmach", "description": "Zatrudniają 1,9 mln osób, a pracuje w nich razem z właścicielami łącznie 4,4 mln. Mikrofirmy płacą skandalicznie mało. Oficjalnie. To tu podwyżki płacy minimalnej oznaczają największe trzęsienie ziemi. Ale mimo, że minimum szybko idzie w górę w ostatnich latach zyski mają coraz większe.", "link": "https://businessinsider.com.pl/gospodarka/podwyzki-placy-minimalnej-tu-uderza-najmocniej-nowe-dane-o-mikrofirmach/7mfdxy7", "date_published": "2022-12-30 16:33:08+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Panika podczas testu rakiety. Koreańczycy myśleli, że to UFO", "description": "Mieszkańcy Korei Południowej nie zostali uprzedzeni o próbnym locie kosmicznej rakiety. Nieznany obiekt wywołał niemal panikę. Pojawiły się obawy przed UFO. Niektórzy myśleli, że to rakieta wystrzelona przez Koreę Północną. Służby ratunkowe i policja otrzymały setki zgłoszeń.", "link": "https://businessinsider.com.pl/wiadomosci/korea-poludniowa-panika-w-kraju-podczas-testu-rakiety-czy-to-ufo-boje-sie/jt1j8nj", "date_published": "2022-12-30 16:13:10+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Mieszka tu tysiąc osób, ale będą mieli Biedronkę. Sieć stawia na małe miasta", "description": "Czerwińsk nad Wisłą to niewielka miejscowość, która prawa miejskie uzyskała tuż przed wybuchem pandemii koronawirusa. Mieszka w niej ok. 1 tys. osób. Biedronka właśnie poinformowała, że w ostatni dzień roku otworzy tam swój kolejny sklep.", "link": "https://businessinsider.com.pl/finanse/handel/mieszka-tu-tysiac-osob-ale-beda-mieli-biedronke-siec-stawia-na-male-miasta/m2e4jyr", "date_published": "2022-12-30 16:12:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Putin wysłał noworoczne życzenia. Wśród adresatów tylko jeden kraj UE", "description": "Władimir Putin wysłał tradycyjne noworoczne życzenia przywódcom 22 państw i terytoriów. Wśród nich znalazł się tylko jeden kraj Unii Europejskiej. To Węgry. Poza tym prezydent Rosji napisał do przywódców m.in. Turcji, Serbii, Chin, Indii i Brazylii.", "link": "https://businessinsider.com.pl/wiadomosci/putin-wyslal-noworoczne-zyczenia-wsrod-adresatow-tylko-jeden-kraj-ue/44dwhmw", "date_published": "2022-12-30 15:33:53+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Sądy decydowały o milionach z podatków. Oto ranking najważniejszych wyroków 2022 r.", "description": "Wśród setek wyroków podatkowych, jakie zapadły w 2022 r., najważniejsze są orzeczenia Trybunału Sprawiedliwości UE (głównie w sprawach VAT) i uchwały Naczelnego Sądu Administracyjnego. To od nich zależy, jak będą orzekały sądy administracyjne w \"zwykłych\" sprawach. Wybraliśmy te najistotniejsze. Wskazujemy orzeczenia sądów, w tym wojewódzkich, które miały istotny wpływ nie tylko na wysokość płaconych podatków przez osoby fizyczne i firmy, ale także na prowadzenie biznesu.", "link": "https://businessinsider.com.pl/prawo/podatki/sady-decydowaly-o-milionach-z-podatkow-oto-7-najwazniejszych-wyrokow-2022-r/3ly3vfd", "date_published": "2022-12-30 15:13:23+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Możliwe utrudnenia na Okęciu. To efekt dużej liczby zachorowań pracowników", "description": "Z uwagi na możliwe wydłużenie czasu oczekiwania do punktów kontroli bezpieczeństwa Lotnisko Chopina apeluje o wcześniejszy przyjazd na lotnisko przed podróżą. Opóźnienia wynikają z dużej liczby zachorowań pracowników kontroli.", "link": "https://businessinsider.com.pl/wiadomosci/mozliwe-utrudnenia-na-okeciu-to-efekt-duzej-liczby-zachorowan-pracownikow/5xnwe0k", "date_published": "2022-12-30 14:52:09+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Rząd już zapożyczył się na rok wyborczy. Ujawnił zaskakującą liczbę", "description": "Stan środków na rachunkach budżetowych na koniec roku będzie przekraczał 100 mld zł — poinformował w piątkowym komentarzu wiceminister finansów Sebastian Skuza. To oznacza, że resort zdołał już pożyczyć nawet 40 proc. tego, co będzie mu potrzebne na rok wyborczy. Ekonomiści nieoficjalnie spodziewali się na koniec roku ok. 30-35 proc.", "link": "https://businessinsider.com.pl/gospodarka/rzad-juz-zapozycza-sie-na-przyszly-rok-ujawnil-zaskakujaca-liczbe/8d92333", "date_published": "2022-12-30 14:44:36+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Chytry pomysł rządu. Zamiast pieniędzy rozdają obligacje", "description": "Pomysł jest sprytny. Zamiast sprzedawać obligacje na przetargach i potem pozyskanymi pieniędzmi wspierać państwowe instytucje, można od razu przekazać tym instytucjom obligacje. To zmniejszy podaż na przetargach, poprawiając wycenę i obniżając koszt obsługi długu dla budżetu państwa, a obdarowani niech sami sobie organizują płynne środki.", "link": "https://businessinsider.com.pl/gospodarka/obligacje-zamiast-pieniedzy-rzad-wpadl-na-sprytny-pomysl/8wbzs7l", "date_published": "2022-12-30 14:31:44+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Zrozumieć AI. Odc. 10 – AI Act, czyli unijne regulacje prawne dotyczące AI [podcast]", "description": "Sztuczna inteligencja daje nam ogromne możliwości i wspiera nas zarówno w życiu prywatnym, jak i biznesie. Ale wykorzystanie AI w pewnych przypadkach budzi coraz większe obawy etyczne, a także narusza naszą prywatność i może stanowić dla nas zagrożenie.", "link": "https://businessinsider.com.pl/technologie/nowe-technologie/zrozumiec-ai-odc-10-ai-act-czyli-unijne-regulacje-prawne-dotyczace-ai-podcast/2w28wl5", "date_published": "2022-12-30 14:08:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Znika najstarsza pizzeria w Warszawie. \"Mam prawie 80 lat, nie mam już siły tego ciągnąć\"", "description": "Inflacja i rosnące koszty działalności \"zjadły\" kolejny już lokal na gastronomicznej mapie Polski. Najstarsza pizzeria w Warszawie, zlokalizowana na Starym Mieście, przestaje istnieć. Lokal jest do wynajęcia, a właściciel nie chce zaczynać od nowa, w innym miejscu. - Mam prawie 80 lat, nie mam już energii, żeby codziennie pracować – mówi. I dodaje: \"Wszystkie możliwe czynniki działają na naszą niekorzyść\".", "link": "https://businessinsider.com.pl/wiadomosci/znika-kultowy-lokal-w-warszawie-przychodzily-do-nas-trzy-pokolenia/bhqvy56", "date_published": "2022-12-30 14:00:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Ile wynosi wynagrodzenie członka zarządu?", "description": "Przedsiębiorcy w Polsce, wybierając formę prawną swojej firmy, coraz częściej decydują się na założenie spółki. Jak wskazuje Związek Przedsiębiorstw Finansowych w Polsce, w lutym 2021 r. w KRS zarejestrowanych było aż 412 tysięcy spółek z ograniczoną odpowiedzialnością, 8,4 tysiąca spółek akcyjnych oraz 2,9 tysiąca spółek komandytowo-akcyjnych.", "link": "https://businessinsider.com.pl/poradnik-finansowy/wynagrodzenie-czlonka-zarzadu-ile-mozna-zarobic-na-tym-stanowisku/fdfjjlz", "date_published": "2022-12-30 14:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Tańszy prąd jednak nie dla wszystkich gospodarstw domowych. Duży sprzedawca znalazł furtkę", "description": "Niektórzy klienci jednego z dużych sprzedawców energii elektrycznej, firmy E.ON Polska, zostali poinformowani, że nie znajdują się w grupie odbiorców uprawnionych do korzystania od 1 stycznia z zamrożonych ustawowo cen energii. Chodzi o klientów, którzy korzystają z taryfy dla gospodarstw domowych G i jednocześnie pod swoim adresem mają zarejestrowaną działalność gospodarczą. Co z klientami PGE Obrót, Tauron Sprzedaż i Enea?", "link": "https://businessinsider.com.pl/twoje-pieniadze/podwyzki-cen-pradu-w-2023-r-niektorzy-klienci-eon-polska-zaplaca-wiecej/d43y7t3", "date_published": "2022-12-30 13:32:21+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "KRRiT chce ukarać TVN. Za reportaż o Macierewiczu i komisji smoleńskiej", "description": "Przewodniczący Krajowej Rady Radiofonii i Telewizji Maciej Świrski wszczął z urzędu postępowanie w sprawie ukarania nadawcy TVN S.A — poinformowała w komunikacie Rada. Chodzi o reportaż telewizji na temat Antoniego Macierewicza i działań jego podkomisji smoleńskiej.", "link": "https://businessinsider.com.pl/biznes/krrit-chce-ukarac-tvn-za-reportaz-o-macierewiczu-i-komisji-smolenskiej/d50pzzd", "date_published": "2022-12-30 12:58:23+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Rosja testuje dwa nowe bombowce za 500 mln dol. Jest nagranie", "description": "Rosja może testować dwa nowe bombowce Tu-160M. Tamtejszym siłom zbrojnym maszyny zostały przekazane przez United Aircraft Corporation, czyli część państwowego Rosteku.", "link": "https://businessinsider.com.pl/wiadomosci/rosja-ma-dwa-nowe-bombowce-kosztowaly-500-mln-dol/37flxl7", "date_published": "2022-12-30 12:46:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kursy walut z końca roku ustalone. Fundusz zbrojeniowy stracił około miliarda złotych", "description": "Od ostatniego kursu walutowego roku zależy wiele rzeczy. Między innymi zysk NBP, z którego potem zasilany będzie fundusz na zbrojenia. Kilka groszy w kursie walut może przełożyć się na miliardy złotych różnicy w późniejszej wpłacie z banku.", "link": "https://businessinsider.com.pl/gielda/wiadomosci/kursy-walut-z-konca-roku-ustalone-fundusz-zbrojeniowy-stracil-okolo-miliarda-zlotych/x0ee6be", "date_published": "2022-12-30 12:45:19+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Tajna rozmowa Zełenskiego. Tak załatwiał pieniądze dla Ukrainy", "description": "Zełenski dzwonił w tajemnicy do senatora Mitcha McConnella. Namawiał go, by przyjął przepisy, które pozwolą Ukrainie przejąć majątki rosyjskich oligarchów.", "link": "https://businessinsider.com.pl/wiadomosci/tajna-rozmowa-zelenskiego-tak-zalatwial-pieniadze-dla-ukrainy/bk32cs6", "date_published": "2022-12-30 12:37:07+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kanye West zapadł się pod ziemię. Prawnicy nie mogą go odnaleźć", "description": "Gdzie jest Kanye West? Prawnicy, którzy zrezygnowali z jego obrony po antysemickich tyradach, nie mogą go zlokalizować, żeby powiedzieć mu, że odchodzą.", "link": "https://businessinsider.com.pl/lifestyle/kanye-west-zapadl-sie-pod-ziemie-prawnicy-nie-moga-go-odnalezc/p5z7z3e", "date_published": "2022-12-30 12:11:02+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Ekspert zapowiada przyszły rok. \"Jesteśmy na dnie i będziemy po nim szorować\"", "description": "W 2023 r. rynek kredytów mieszkaniowych będzie rekordowo słaby, sprzedaż będzie szorować po dnie, a nowy rządowy program mieszkaniowy nie wywoła dodatkowego popytu. To prognoza Jacka Furgi, przewodniczącego Komitetu ds. Finansowania Nieruchomości Mieszkaniowych ZBP.", "link": "https://businessinsider.com.pl/gospodarka/ekspert-prognozuje-przyszly-rok-jestesmy-na-dnie-i-bedziemy-po-nim-szorowac/mznbkqj", "date_published": "2022-12-30 11:38:36+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Zielone inwestycje mogą pomóc uratować polską gospodarkę", "description": "Inwestycje w zieloną gospodarkę mogą okazać się kołem zamachowym polskiego wzrostu gospodarczego w najbliższych latach, pomagając niwelować negatywne skutki wysokiej inflacji oraz spodziewanej recesji w Europie i USA — pisze dla Business Insider Polska Jacek Leonkiewicz, prezes zarządu TDJ.", "link": "https://businessinsider.com.pl/gospodarka/zielone-inwestycje-moga-pomoc-uratowac-polska-gospodarke/rgnnd9g", "date_published": "2022-12-30 11:37:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Rosjanie uciekli przed wojną w ciepło. Wynajmują mieszkania na długie miesiące", "description": "Rosjanie znaleźli się w czołówce odwiedzających Tajlandię późną jesienią. Wielu z nich przybyło tam z zamiarem zostania na dłużej niż tylko urlop. Tajowie oferują im pomoc w wymianie waluty lub przelewie pieniędzy po korzystniejszym kursie.", "link": "https://businessinsider.com.pl/wiadomosci/rosjanie-uciekli-przed-wojna-do-tajladnii-wynajmuja-mieszkania-na-dlugie-miesiace/cq1q0rm", "date_published": "2022-12-30 11:14:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Oto gdzie powstaje polski PKB. Najszybciej rozwija się Pomorze", "description": "Gdzie powstaje polski PKB? Ponad połowa w tylko czterech na 12 województw. W najsilniejszym gospodarczo województwie mazowieckim wypracowywana jest prawie co czwarta złotówka w gospodarce. To m.in. efekt koncentracji siedzib wielkich firm na stolicy.", "link": "https://businessinsider.com.pl/gospodarka/oto-gdzie-powstaje-polski-pkb-najszybciej-rozwija-sie-pomorze/fj339dw", "date_published": "2022-12-30 11:08:12+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Koszula rozkłada się 6 miesięcy, wełniana skarpeta 5 lat, lycra wieki. Oto najbrudniejszy sekret branży modowej", "description": "Każdego roku przemysł odzieżowy wytwarza ponad 100 mld sztuk odzieży – co wystarcza, aby każdy mieszkaniec Ziemi otrzymał 14 nowych sztuk odzieży rocznie, ponad dwukrotnie więcej niż w 2000 r. Nasze przyzwyczajenie do kupowania i zwracania zakupów powoduje, że wiele z tych ubrań jest odsyłanych do sprzedawców. Wbrew temu, co sądzi wiele osób, większość oddawanych ubrań nie wraca do magazynu, nie jest przerabiana ani ponownie wykorzystywana, tylko trafia do śmieci.", "link": "https://businessinsider.com.pl/wiadomosci/rozklad-bawelnianej-koszuli-zajmuje-szesc-miesiecy-a-welniana-skarpeta-moze-rozlozyc/dq9y3ye", "date_published": "2022-12-30 10:43:24+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Masz mieszkanie lub dom? Tyle zapłacisz za nieruchomość w 2023 r.", "description": "Nowy rok to nowe stawki podatku od nieruchomości. We wszystkich miastach wojewódzkich podjęto już decyzje o podniesieniu podatków od nieruchomości. I to niemało.", "link": "https://businessinsider.com.pl/twoje-pieniadze/prawo-i-podatki/masz-dom-lub-mieszkanie-przygotuj-sie-na-koszty-tyle-zaplacisz-w-2023-r/cq9c5g7", "date_published": "2022-12-30 10:00:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Niekontrolowana sprzedaż udziałów w Rafinerii Gdańskiej? Resort Sasina przyznaje, że było takie ryzyko", "description": "Premier Mateusz Morawiecki podpisał rozporządzenie, które umieszcza Rafinerię Gdańską na specjalnej liście podmiotów podlegających ochronie. To oznacza, że gdyby Saudi Aramco chciało zbyć 30 proc. swoich udziałów w dawnym biznesie Lotosu, to musi uzyskać zielone światło dla nowego inwestora od Ministerstwa Aktywów Państwowych. Resort kierowany przez Jacka Sasina przyznał jednocześnie, że taki ruch był podyktowany \"potencjalnym ryzykiem niekontrolowanego, dalszego zbycia udziałów\" przez Saudyjczyków. W Business Insider Polska informowaliśmy o takim zagrożeniu już w połowie listopada, gdy ujawnialiśmy, że z umów z Saudyjczykami wypadły dwie ważne klauzule.", "link": "https://businessinsider.com.pl/wiadomosci/sprawa-rafinerii-gdanskiej-map-zaprzeczyl-wlasnym-zaprzeczeniom/h43k8rv", "date_published": "2022-12-30 09:45:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "\"Ruski szampan\" nie będzie sylwestrowym hitem. Z Rosją łączy go tylko jedno", "description": "Jeszcze niedawno był jednym z \"kultowych\" trunków, którego nie mogło zabraknąć w sylwestrową noc. Szczególnie tam, gdzie cena była kryterium ważniejszym niż smak. Dziś jego popularność przygasa, a wypisana cyrylicą nazwa budzi negatywne skojarzenia. Sowietskoje Igristoje wbrew pozorom dziś niewiele ma wspólnego z Rosją, chociaż niektóre źródła wskazują na jego korzenie sięgające czasów stalinowskich, a nawet wcześniejszych.", "link": "https://businessinsider.com.pl/wiadomosci/ruski-szampan-nie-sprzedajemy-kultowy-trunek-popadl-w-nielaske/twr5qgz", "date_published": "2022-12-30 09:08:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Rocznie ubywa z rynku 150 tys. pracowników. Nie ma strachu o wzrost bezrobocia", "description": "Aktywność gospodarcza słabnie, ale to wcale nie oznacza, że bezrobocie pójdzie w górę. W grudniu zmalał Wskaźnik Rynku Pracy sygnalizujący przyszłe zmiany liczby osób bez pracy — poinformowało Biuro Inwestycji i Cykli Ekonomicznych. Jak podali analitycy, społeczeństwo się starzeje i co roku z powodu odejść na emeryturę ubywa na rynku 150 tys. pracowników.", "link": "https://businessinsider.com.pl/gospodarka/stopa-bezrobocia-nie-wzrosnie-biec-rocznie-ubywa-150-tys-pracownikow/p5s522e", "date_published": "2022-12-30 08:44:15+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Nałęczów chce zmienić status prawny wody mineralnej. Byłaby jak węgiel czy ropa", "description": "Gdyby woda mineralna byłaby uznawana za kopalinę, Nałęczów dostałby zastrzyk do budżetu. Gmina zamierza wnioskować o to w rządzie i u parlamentarzystów. To właśnie w tej Nałęczowie rozlewane są popularne wody Nałęczowianka i Cisowianka.", "link": "https://businessinsider.com.pl/gospodarka/naleczow-chce-zmienic-status-prawny-wody-mineralnej-bylaby-jak-wegiel-czy-ropa/bts9gxl", "date_published": "2022-12-30 08:42:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Wrócą wcześniejsze emerytury dla nauczycieli? Czarnek: należy rozpocząć dyskusję", "description": "Nie należy zaklinać rzeczywistości, tylko rozpocząć dyskusję na temat tego, jak przywrócić nauczycielom uprawnienie, które w 2009 r. zabrał im Donald Tusk, czyli wcześniejszą emeryturę po 20 latach pracy przy tablicy, i 30 latach pracy w ogóle — powiedział w piątek minister edukacji i nauki Przemysław Czarnek.", "link": "https://businessinsider.com.pl/wiadomosci/wzesniejsze-emerytury-dla-nauczycieli-czarnek-nalezy-rozpoczac-dyskusje/c602tyg", "date_published": "2022-12-30 08:24:58+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Wrócą wcześniejsze emerytury dla nauczycieli? Czarnek: należy rozpocząć dyskusję", "description": "Nie należy zaklinać rzeczywistości, tylko rozpocząć dyskusję na temat tego, jak przywrócić nauczycielom uprawnienie, które w 2009 r. zabrał im Donald Tusk, czyli wcześniejszą emeryturę po 20 latach pracy przy tablicy, i 30 latach pracy w ogóle — powiedział w piątek minister edukacji i nauki Przemysław Czarnek.", "link": "https://businessinsider.com.pl/wiadomosci/wczesniejsze-emerytury-dla-nauczycieli-czarnek-nalezy-rozpoczac-dyskusje/c602tyg", "date_published": "2022-12-30 08:24:58+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kurs franka 30 grudnia powyżej 4,75", "description": "Frank szwajcarski powyżej 4,75 zł. W piatek rano 30 grudnia 2022 r. kurs tej waluty wobec polskiego złotego wynosi 4,7629.", "link": "https://businessinsider.com.pl/gielda/kursy-walut/kurs-franka-frank-szwajcarski-chfpln-30-grudnia-2022/hc8y4f3", "date_published": "2022-12-30 08:02:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kurs dolara 30 grudnia w okolicach 4,4", "description": "Kurs dolara w okolicach 4,4. W piątek rano 30 grudnia 2022 r. kurs USD/PLN wynosi 4,4041.", "link": "https://businessinsider.com.pl/gielda/kursy-walut/kurs-dolara-usdpln-notowania-walut-30-grudnia-2022/wffd45l", "date_published": "2022-12-30 08:00:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kurs euro 30 grudnia poniżej 4,7", "description": "Kurs euro poniżej 4,7. W piątek rano 30 grudnia 2022 r. kurs EUR/PLN wynosił 4,6883 zł.", "link": "https://businessinsider.com.pl/gielda/kursy-walut/kurs-euro-eurpln-notowania-walut-30-grudnia-2022/g99hwew", "date_published": "2022-12-30 07:58:21+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Frankowicze nie bardzo chcą mediować z bankami. Zdecydowanie wolą sale sądowe", "description": "Frankowicze niechętnie godzą się na mediacje z bankami. Eksperci komentujący te dane przekonują, że takie porozumienia są z reguły korzystne głównie dla instytucji, a nie dla kredytobiorców.", "link": "https://businessinsider.com.pl/twoje-pieniadze/frankowicze-nie-bardzo-chca-mediowac-z-bankami-zdecydowanie-wola-sale-sadowe/r3e5jm5", "date_published": "2022-12-30 07:17:13+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Gwarancja ubezpieczeniowa dla firmy - co to jest i gdzie znajduje zastosowanie?", "description": "Wiele mówi się o gwarancji ubezpieczeniowej. Nie każdy jednak wie, czym ona tak naprawdę jest. Gdzie znajduje zastosowanie i kogo obowiązuje? Dotyczy wyłącznie firm czy osoby prywatne również mogą z niej skorzystać? Na wszystkie te pytania należy sobie odpowiedzieć, decydując się na zakup polisy ubezpieczeniowej.", "link": "https://businessinsider.com.pl/poradnik-finansowy/ubezpieczenia/gwarancja-ubezpieczeniowa-dla-firmy-co-to-jest-i-gdzie-znajduje-zastosowanie/41nl93z", "date_published": "2022-12-30 07:15:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Podatek liniowy 2022 – co to jest, jak można go obliczyć i kto go płaci?", "description": "Podatek liniowy to jedna z form opodatkowania dostępnych dla przedsiębiorców. Bez względu na wysokość dochodów zawsze wynosi on 19 proc., a więc jest wyższy od bazowej stawki skali podatkowej wynoszącej 12 proc. Ma on również pewne ograniczenia. Kiedy podatek liniowy okazuje się bardziej opłacalny niż podatek progresywny? Kto może go płacić i jakie są ograniczenia? Do kiedy należy zgłosić chęć płacenia podatku liniowego?", "link": "https://businessinsider.com.pl/poradnik-finansowy/oszczedzanie/czym-jest-podatek-liniowy-i-w-jaki-sposob-go-obliczyc/j3nd2k4", "date_published": "2022-12-30 07:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kolejny sponsor kończy współpracę z PZPN", "description": "Współpracę z PZPN po siedmiu latach kończy natomiast producent wody mineralnej Ustronianka — informuje serwis wirtualnemedia.pl.", "link": "https://businessinsider.com.pl/finanse/handel/ustronianka-konczy-wspolprace-z-pzpn/j5hdx7r", "date_published": "2022-12-30 06:53:45+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kwota wolna od podatku 2022 – próg, warunki, obliczanie", "description": "Kwota wolna od podatku to zagadnienie, które interesuje wiele osób. Prawie każdy bowiem woli ponosić jak najmniejsze koszta, jeśli tylko jest to możliwe. Tego typu ulga niestety nie przysługuje jednak wszystkim podatnikom. Warto zatem wiedzieć, jak opodatkowane są zarobki obywateli Polski oraz w jakich sytuacjach można skorzystać z opcji zwolnienia z opłat. Ile wynosi kwota wolna od podatku w 2022 r.? Co trzeba wiedzieć na ten temat?", "link": "https://businessinsider.com.pl/poradnik-finansowy/kwota-wolna-od-podatku-w-2022-r-ile-wynosi-i-co-warto-wiedziec/2xjyp4q", "date_published": "2022-12-30 06:45:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Znana polska sieć sklepów na sprzedaż. Syndyk zapowiada atrakcyjną cenę", "description": "W styczniu syndyk masy upadłościowej spółki Krakowski Kredens ma ogłosić konkurs na sprzedaż delikatesów, które ogłosiły upadłość w 2021 r. Cena wywoławcza będzie niższa od wartości rynkowej — pisze portal wiadomoscihandlowe.pl.", "link": "https://businessinsider.com.pl/firmy/znana-polska-siec-sklepow-na-sprzedaz-syndyk-zapowiada-atrakcyjna-cene/rvbxdcb", "date_published": "2022-12-30 06:38:10+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "VAT nie taki groźny dla cen paliw. Gorszy może znów okazać się Putin i konsekwencje jego wojny", "description": "Podwyżka VAT na paliwa od stycznia nie powinna drastycznie wpłynąć na ceny na stacjach. Większym problemem może się okazać embargo na rosyjskiego diesla. Nie będzie już także z czego obniżać marż.", "link": "https://businessinsider.com.pl/gospodarka/vat-nie-taki-grozny-dla-cen-paliw-gorszy-moze-znow-okazac-sie-putin-i-konsekwencje/m6qfxwh", "date_published": "2022-12-30 06:11:48+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "W styczniu niektóre wypłaty będą wyższe nawet o 300 zł", "description": "Zmieniają się zasady odliczania kwoty zmniejszającej podatek, co może korzystnie wpłynąć na pensje — powiedział w wywiadzie dla \"Rzeczpospolitej\" wiceminister finansów Artur Soboń.", "link": "https://businessinsider.com.pl/twoje-pieniadze/w-styczniu-niektore-wyplaty-beda-wyzsze-nawet-o-300-zl/t1bn2xv", "date_published": "2022-12-30 06:05:35+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Lokata dla dziecka – gdzie i jak oszczędzać na przyszłe potrzeby?", "description": "Wielu rodziców postanawia zadbać o przyszłość pociechy, gromadząc dla niej środki finansowe. Na rynku istnieje sporo produktów, które umożliwiają oszczędzanie. Jednym z nich jest lokata dla dziecka. To bezpieczny sposób odkładania pieniędzy, z którego zazwyczaj korzystają osoby niemogące dokonywać regularnych wpłat. Lokata pozwala na ulokowanie jednorazowo większej sumy pieniędzy, czyli tzw. nadwyżek. Co warto wiedzieć, wybierając lokatę dla dziecka? Jakimi kryteriami się kierować?", "link": "https://businessinsider.com.pl/poradnik-finansowy/oszczedzanie/w-jaki-sposob-wybrac-lokate-dla-dziecka-i-na-co-zwrocic-uwage/hr95f7e", "date_published": "2022-12-30 06:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Ubezpieczenie oszczędnościowe — na czym polega? Jakie wybrać?", "description": "Ubezpieczenie oszczędnościowe nie dość, że zapewnia wsparcie finansowe bliskim w sytuacji, gdy dojdzie do śmierci płatnika składek, to jeszcze pozwala na zgromadzenie oszczędności na przyszłość, np. na emeryturę lub studia dla dzieci. Czym różni się polisa oszczędnościowa od innych klasycznych produktów ubezpieczeniowych? Jak działa i ile kosztuje?", "link": "https://businessinsider.com.pl/poradnik-finansowy/ubezpieczenia/ubezpieczenie-oszczednosciowe-na-czym-polega-jakie-wybrac/njpvq9v", "date_published": "2022-12-30 06:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Ciekawe czy złoty znów osłabi się na koniec roku?", "description": "Ostatni roboczy dzień w roku, dziś więc okaże się, po jakich kursach walutowych firmy przeliczać będą pozycje wyrażone w walutach obcych w swoich bilansach rocznych. To samo zrobi NBP z wartością rezerw walutowych, dziś więc ważny dzień w kontekście ewentualnego zysku NBP i budżetu państwa. Do tego znamy już plany budowy dróg na przyszły rok oraz plany dotyczące czternastej emerytury, a także plany firm dotyczące podwyżek cen i podwyżek płac. Pojawiła się też nowa data dotycząca uwolnienia firm energetycznych od kopalni i elektrowni węglowych. Oto pięć najciekawszych wydarzeń w gospodarce teraz.", "link": "https://businessinsider.com.pl/gospodarka/piec-najciekawszych-wydarzen-w-gospodarce-teraz-30122022/2rfrynr", "date_published": "2022-12-30 05:46:53+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Zmiany w sklepowych \"cenówkach\". Nowe przepisy od stycznia", "description": "Obowiązek uwidaczniania, obok ceny i ceny jednostkowej, również informacji o obniżonej cenie towaru lub usługi zakłada rozporządzenie Ministra Rozwoju i Technologii dotyczące uwidaczniania cen towarów i usług. Rozporządzenie wchodzi w życie 1 stycznia 2023 r.", "link": "https://businessinsider.com.pl/twoje-pieniadze/zmiany-w-sklepowych-cenowkach-nowe-przepisy-od-stycznia/h9pp01g", "date_published": "2022-12-30 05:38:20+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Polska z systemem blokującym złodziei tożsamości. Jedyna w UE", "description": "Powstanie państwowy rejestr zastrzeżeń. Dzięki wpisowi swojego numeru PESEL w bazie przestępca nie weźmie na nas kredytu — pisze \"Rzeczpospolita\".", "link": "https://businessinsider.com.pl/wiadomosci/polska-z-systemem-blokujacym-zlodziei-tozsamosci-jedyna-w-ue/08d909j", "date_published": "2022-12-30 05:37:46+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "\"Nowy Rok świętować będziemy z obawami\". Prezes Banku Pekao o wyzwaniach dla Polski i świata", "description": "Nowy Rok świętować będziemy z obawami o skalę spowolnienia gospodarczego, które oczekiwane jest na początku roku i poziom inflacji, której rekordowy odczyt spodziewany jest w lutym. W kolejnych miesiącach sytuacja gospodarcza powinna się poprawiać, a inflacja obniżać, osiągając nawet jednocyfrowy poziom w grudniu 2023 r. Zagadką jest to, jak szybko ta poprawa gospodarcza będzie następowała – napisał w opinii dla Business Insider Polska prezes Banku Pekao Leszek Skiba.", "link": "https://businessinsider.com.pl/finanse/nowy-rok-swietowac-bedziemy-z-obawami-prezes-banku-pekao-o-wyzwaniach-dla-polski-i/kdz46fr", "date_published": "2022-12-30 05:22:17+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Biden podpisał ustawę budżetową. 45 mld dla Ukrainy", "description": "Prezydent Joe Biden podpisał w czwartek ustawę budżetową na kolejny rok. Przewiduje ona wydatki w wysokości prawie 1,7 bln dolarów, w tym 45 mld dolarów pomocy gospodarczej i wojskowej dla Ukrainy i sojuszników z NATO.", "link": "https://businessinsider.com.pl/wiadomosci/biden-podpisal-ustawe-budzetowa-45-mld-dla-ukrainy/ctj252e", "date_published": "2022-12-30 05:20:54+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Fajerwerki to biznes wart miliony, a Polska jest w nim gigantem. \"Odżyliśmy\"", "description": "Rynek fajerwerków w Polsce to pod względem wielkości ścisła światowa czołówka warta grube miliony. Producenci spodziewają się, że ten rok będzie nadzwyczaj dobry, nawet pomimo podwyżek cen rzędu kilkudziesięciu procent. Podkreślają, że opór przeciwników fajerwerków jest mniejszy, a część sprzedawców dostosowuje się np. do oczekiwań miłośników zwierząt.", "link": "https://businessinsider.com.pl/biznes/fajerwerki-to-biznes-wart-miliony-a-polska-jest-w-nim-gigantem-odzylismy/4d0q1tx", "date_published": "2022-12-30 05:10:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Szczecin coraz szybciej rozwija się po drugiej stronie granicy. Czy to już polsko-niemiecka aglomeracja?", "description": "Jeszcze przed wejściem Polski do Unii Europejskiej nie brakowało obaw, że Niemcy będą \"wykupywali\" Szczecin. Stało się raczej coś odwrotnego – szczecinianie coraz częściej przeprowadzają się na \"niemieckie\" przedmieścia. Polskie firmy nie boją się inwestować w przygranicznych miejscowościach. Ostatnio zaś bliskość Szczecina przyciągnęła znane światowe marki, by otwierać wielkie fabryki w niedużych miejscowościach. Można więc już mówić, że Szczecin stał się centrum polsko-niemieckiej aglomeracji? Słychać to coraz częściej, ale na pewno nie z ust polskich polityków. \"Aglomeracja\" to dla nich prawdziwy gorący kartofel.", "link": "https://businessinsider.com.pl/gospodarka/czy-szczecin-staje-sie-polsko-niemiecka-aglomeracja/txd3v7x", "date_published": "2022-12-30 05:00:00+00:00", "persistent": false, "user": "rumpel", "language": "pl-PL"}]