[{"source": "https://www.dailywire.com/feeds/rss.xml", "title": "WATCH: Father Of Idaho Murder Victim Weighs In After Suspect Is Arrested", "description": "Steve Goncalves, the father of Idaho murder victim Kaylee Goncalves, said Friday that the news that a suspect had been arrested in the case brought him the first bit of joy that he has had in a while. It had been more than a month since Kaylee GonCalves, 21; Ethan Chapin, 20; Xana Kernodle, 20; ...", "link": "https://www.dailywire.com/news/watch-father-of-idaho-murder-victim-weighs-in-after-suspect-is-arrested", "date_published": "2022-12-30 22:23:47+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "BREAKING: Barbara Walters, Legendary ABC News Journalist, Dies", "description": "Barbara Walters, a journalist at ABC News who helped forge the way for women to appear on news broadcasts, has died. She was 93 years old. ABC News broke the story on her death, but provided no details or any statements from her family. Walters joined ABC News in 1976, where she was the first ...", "link": "https://www.dailywire.com/news/breaking-barbara-walters-legendary-abc-news-journalist-dies", "date_published": "2022-12-30 21:59:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Judge Jeanine Pirro: ‘Genealogical DNA’ Was Used To Lead Police To Suspect In Idaho Murders Case", "description": "Fox News&#8217;s Judge Jeanine Pirro, who previously served as a district attorney in New York, said Friday that sources revealed to her one of the pieces of evidence that were used to lead law enforcement officials to arrest a 28-year-old suspected of killing four college students in Idaho last month. It had been more than ...", "link": "https://www.dailywire.com/news/judge-jeanine-pirro-genealogical-dna-was-used-to-lead-police-to-suspect-in-idaho-murders-case", "date_published": "2022-12-30 21:45:17+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "ICE Deportations Lag Another Year As Agents Deployed To Border Crisis", "description": "Assisting with a record flood of people crossing the U.S. southern border strained Immigration and Customs Enforcement (ICE) resources as the number of deportations conducted by the agency lagged again in fiscal year 2022. ICE deployed more than a thousand of its agents to the southern border throughout the year to supplement Customs and Border ...", "link": "https://www.dailywire.com/news/ice-deportations-lag-another-year-as-agents-deployed-to-border-crisis", "date_published": "2022-12-30 20:10:04+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Lawyer For Gabby Petito’s Parents Makes Explosive Accusation About Alleged Killer’s Mom: ‘Burn After Reading’", "description": "An attorney for Gabby Petito&#8217;s family suggested that the mother of alleged killer Brian Laundrie knew that her son killed Petito and offered him assistance in disposing of her body. Pat Reilly, the attorney for the Petito family, wrote a letter to Matt Luka, the attorney for the Laundrie family, earlier this month informing him of ...", "link": "https://www.dailywire.com/news/lawyer-for-gabby-petitos-parents-makes-explosive-accusation-about-alleged-killers-mom-burn-after-reading", "date_published": "2022-12-30 19:55:47+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Nancy Pelosi Permits Massive Raises For House Staffers That Will Allow Them To Make More Than Lawmakers", "description": "House Speaker Nancy Pelosi (D-CA) issued a directive on Friday that will allow House members to pay their staff a salary higher than that of many lawmakers in the nation&#8217;s capital. &#8220;As you know, our hard-working, patriotic Congressional staffers are integral to the functioning of the House of Representatives: ensuring this institution can effectively carry ...", "link": "https://www.dailywire.com/news/nancy-pelosi-permits-massive-raises-for-house-staffers-that-will-allow-them-to-make-more-than-lawmakers", "date_published": "2022-12-30 19:34:12+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Ray Epps Told Nephew He ‘Orchestrated’ January 6", "description": "Ray Epps, a mysterious January 6 figure some theorized to be a federal informant, told his nephew that he &#8220;orchestrated&#8221; what transpired that day in 2021. The bombastic assertion was revealed in a lightly redacted transcript released Thursday by the House January 6 Committee. Claiming he made a poor choice of words to his nephew, ...", "link": "https://www.dailywire.com/news/ray-epps-told-nephew-he-orchestrated-january-6", "date_published": "2022-12-30 18:40:36+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Man Accused Of Murdering 4 Idaho College Students Is A Former School Security Guard: Report", "description": "The 28-year-old man accused of murdering four University of Idaho students last month is a former school security guard who studied psychology and was pursuing a graduate degree in criminology. It had been more than a month since Kaylee GonCalves, 21; Ethan Chapin, 20; Xana Kernodle, 20; and Madison Mogen, 21, were murdered in their ...", "link": "https://www.dailywire.com/news/man-accused-of-murdering-4-idaho-college-students-is-a-former-school-security-guard-report", "date_published": "2022-12-30 17:44:53+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Tom Cruise And ‘Top Gun: Maverick’ Can Take Another Victory Lap After Debut On Paramount+", "description": "Tom Cruise and all involved in &#8220;Top Gun: Maverick&#8221; can take another victory lap after the movie&#8217;s premiere on Paramount+ became the most-watched film to ever debut on the streaming site in the U.S. Brian Robbins, President and CEO of Paramount Pictures and Chief Content Officer, Movies and Kids &amp; Family, Paramount+ called the release ...", "link": "https://www.dailywire.com/news/tom-cruise-and-top-gun-maverick-can-take-another-victory-lap-after-debut-on-paramount", "date_published": "2022-12-30 17:33:40+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Biden Grants Full Pardons To Six Individuals, Including Woman Convicted Of Killing Husband", "description": "President Joe Biden gave full pardons to six individuals Friday who had already served their sentences for the crimes that they committed. The end of the year pardons were given to individuals who were convicted of crimes ranging from murder to drug-related charges. Beverly Ann Ibn-Tamas, 80, was convicted of murder in the second degree ...", "link": "https://www.dailywire.com/news/biden-grants-full-pardons-to-six-individuals-including-woman-convicted-of-killing-husband", "date_published": "2022-12-30 17:29:03+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "ObamaCare Website Signups Soar To New Record Under Biden", "description": "President Joe Biden announced that health insurance signups via HealthCare.Gov surged to a new record this year. Created by the Affordable Care Act, a signature Obama administration legislative package often referred to as ObamaCare, the website facilitated more than 11.5 million Americans seeking insurance between November 1 and December 15, marking an 18% increase since ...", "link": "https://www.dailywire.com/news/obamacare-website-signups-soar-to-new-record-under-biden", "date_published": "2022-12-30 17:23:23+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Sam Bankman-Fried Visited Biden White House Four Times Ahead Of His Arrest", "description": "Former FTX CEO Sam Bankman-Fried visited senior advisers of President Joe Biden at least four times this year before his cryptocurrency empire imploded last month. The digital asset exchange filed for bankruptcy after users learned that the company was intertwined with sister firm Alameda Research; both were controlled by Bankman-Fried and other young business leaders ...", "link": "https://www.dailywire.com/news/sam-bankman-fried-visited-biden-white-house-four-times-ahead-of-his-arrest", "date_published": "2022-12-30 16:29:22+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "BREAKING: Idaho Police Release Details On Arrest Of Suspect In University Of Idaho Quadruple Homicide", "description": "Police in Moscow, Idaho, released additional details about the arrest of a man in Pennsylvania for the murders of four University of Idaho students in mid-November. During a press conference Friday afternoon, Moscow Police Chief James Fry confirmed the arrest of a 28-year-old man, who was detained in Monroe County, Pennsylvania, some 2,400 miles east of ...", "link": "https://www.dailywire.com/news/breaking-idaho-police-release-details-on-arrest-of-suspect-in-university-of-idaho-quadruple-homicide", "date_published": "2022-12-30 16:15:03+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘I Am A Recovering Alcoholic’: Anthony Hopkins Marks Huge Sobriety Milestone", "description": "Hollywood star Anthony Hopkins shared an inspiring video with followers about how he&#8217;s a &#8220;recovering alcoholic&#8221; as he celebrated 47 years of sobriety. In a video posted to Twitter on Thursday, the 84-year-old actor talked about his battle with alcoholism and sent words of encouragement to those who might be struggling with addiction of their ...", "link": "https://www.dailywire.com/news/i-am-a-recovering-alcoholic-anthony-hopkins-marks-huge-sobriety-milestone", "date_published": "2022-12-30 16:09:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Babylon’ Failed Because We’re All Sick Of Excess And Depravity In Real Life", "description": "With so much promotion, so many A-list actors, and even a few coveted Golden Globe nominations, it makes no sense that the epic period comedy-drama “Babylon” was such an epic flop.  Except, the failure of screenwriter/director Damien Chazelle to lure audiences with his story of “decadence, depravity, and outrageous excess [that] lead to the rise ...", "link": "https://www.dailywire.com/news/babylon-failed-because-were-all-sick-of-excess-and-depravity-in-real-life", "date_published": "2022-12-30 16:01:49+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Kirk Cameron, Publisher Say Thousands Flocked To His Story Hour After Library Reportedly Backtracks Opposition", "description": "Kirk Cameron and the publisher of his new children&#8217;s book said thousands flocked to his story hour after one of the libraries that initially refused to host him over his new faith-based children&#8217;s book reportedly reversed course, something the library is disputing. Brave Books and the 52-year-old actor shared a clip on Instagram showing what they said ...", "link": "https://www.dailywire.com/news/kirk-cameron-publisher-claim-thousands-flocked-to-his-story-hour-after-library-reportedly-backtracks-opposition", "date_published": "2022-12-30 15:55:44+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘A Dangerous New Political Weapon’: House Republicans Lay Out Dissent On Democrats Releasing Trump Taxes", "description": "Republican members of the House Ways and Means Committee blasted Democratic colleagues for publishing the tax returns of former President Donald Trump. The powerful body voted along party lines last week to release the tax returns after the Supreme Court spurned the former commander-in-chief’s request to bar the IRS from giving the records to lawmakers. ...", "link": "https://www.dailywire.com/news/a-dangerous-new-political-weapon-house-republicans-lay-out-dissent-on-democrats-releasing-trump-taxes", "date_published": "2022-12-30 15:34:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Bahamas Holding $3.5 Billion Of FTX’s Cryptocurrency For ‘Safekeeping’", "description": "The government of the Bahamas seized $3.5 billion of cryptocurrency assets belonging to FTX, the defunct exchange formerly led by Sam Bankman-Fried, after the company’s collapse. FTX filed for bankruptcy last month after users learned that the venture was intertwined with sister firm Alameda Research; both were controlled by Bankman-Fried and other amateur business leaders ...", "link": "https://www.dailywire.com/news/bahamas-holding-3-5-billion-of-ftxs-cryptocurrency-for-safekeeping", "date_published": "2022-12-30 14:39:03+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Save Situation: Hall Of Famer Dennis Eckersley Seeks Custody Of Homeless Daughter’s Christmas Baby", "description": "Baseball Hall of Fame pitcher Dennis Eckersley is seeking guardianship of the grandson his homeless and troubled daughter delivered Christmas night in a tent in New Hampshire. The baseball great and his wife released a statement Friday expressing their sorrow for Alexandra Eckersley and their intention to seek custody of the newborn. The baby was ...", "link": "https://www.dailywire.com/news/save-situation-hall-of-famer-dennis-eckersley-seeks-custody-of-homeless-daughters-christmas-baby", "date_published": "2022-12-30 14:22:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Trans New Yorker Charged With Murdering Dad, Critically Wounding Sister, After Claiming Home Invasion", "description": "The son of a Brooklyn deliveryman has been charged with the murder of his father and the critical wounding of his sister after claiming the attack was the result of a home invasion. Nikki Secondino, 22, a biological man who identifies as a woman, has been charged with the murder of his father, Carlo Secondino, ...", "link": "https://www.dailywire.com/news/trans-new-yorker-charged-with-murdering-dad-critically-wounding-sister-after-claiming-home-invasion", "date_published": "2022-12-30 14:07:44+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "SEE IT: Chinese Fighter Jet Flies Within 20 Feet Of U.S. Air Force Plane", "description": "A Chinese fighter jet came within 20 feet of a U.S. Air Force plane in the South China Sea last week, once again showing China&#8217;s aggressive military posture. The U.S. Air Force RC-135 aircraft had to take evasive action on December 21 to avoid a collision with a Navy  J-11 fighter jet from the People&#8217;s ...", "link": "https://www.dailywire.com/news/see-it-chinese-fighter-jet-flies-within-20-feet-of-u-s-air-force-plane", "date_published": "2022-12-30 13:48:19+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Buttigieg Sends Brutal Letter To Southwest CEO Demanding Airline Follow Through With Reimbursing Travelers", "description": "Transportation Secretary Pete Buttigieg blasted Southwest Airlines CEO Bob Jordan in a Thursday letter, demanding that the company take immediate action to reimburse stranded passengers. The carrier, which announced plans to resume normal operations beginning on Friday, canceled roughly two-thirds of flights during the busy Christmas travel season, even after severe winter weather conditions that ...", "link": "https://www.dailywire.com/news/buttigieg-sends-brutal-letter-to-southwest-ceo-demanding-airline-follow-through-with-reimbursing-travelers", "date_published": "2022-12-30 12:49:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Twitter Employees Brought Their Own Toilet Paper To Work After Janitor Services Ended As Company Slashes Costs: Report", "description": "Twitter is closing down an office in Seattle, Washington, according to a report, appearing to coincide with the company’s push to slash costs. Elon Musk, the new owner of the social media platform, has dismissed roughly over half of the company&#8217;s employees since he assumed control two months ago in a $44 billion deal. The ...", "link": "https://www.dailywire.com/news/twitter-employees-brought-their-own-toilet-paper-to-work-after-janitors-laid-off-as-company-slashes-costs-report", "date_published": "2022-12-30 12:34:48+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "BREAKING: Person Taken Into Custody In Connection With Murders Of Four University Of Idaho Students", "description": "A person has been taken into custody in connection to the murders of four University of Idaho students, law enforcement officials say. The person was taken into custody in Monroe County, Pennsylvania, NBC News correspondent for investigations Tom Winter reported on Twitter. Winter added that police in Moscow, Idaho, have not confirmed the arrest, but have announced ...", "link": "https://www.dailywire.com/news/breaking-person-taken-into-custody-in-connection-with-murders-of-four-university-of-idaho-students", "date_published": "2022-12-30 11:22:11+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Police Bringing Cleaning Crew To House Where Four University Of Idaho Students Were Murdered", "description": "More than six weeks after four University of Idaho students were murdered in Moscow, Idaho, police are bringing a cleaning crew to the off-campus residence where the crime occurred. &#8220;Starting Friday morning we&#8217;re going to be bringing in a professional cleaning crew to go to the residence,&#8221; Moscow Police Chief James Fry said in a video statement ...", "link": "https://www.dailywire.com/news/police-bringing-cleaning-crew-to-house-where-four-university-of-idaho-students-were-murdered", "date_published": "2022-12-30 11:04:06+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "House Committee Releases Trump Tax Returns After Years Of Legal Battles", "description": "The House Ways and Means Committee released the tax returns of former President Donald Trump on Friday following a lengthy legal battle to keep the documents sealed. The powerful committee voted along party lines last week to release the tax returns after the Supreme Court rejected the former commander-in-chief’s request to block the IRS from ...", "link": "https://www.dailywire.com/news/house-committee-releases-trump-tax-returns-after-years-of-legal-battles", "date_published": "2022-12-30 10:51:58+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Lorenzo Lamas Says He’s ‘Excited’ That His 23-Year-Old Daughter Is ‘Smitten’ With Leonardo DiCaprio, Even Though She’s ‘Very Young’", "description": "Actor Lorenzo Lamas isn’t upset about his 23-year-old daughter Victoria hanging out with Leonardo DiCaprio, 48.  &#8220;I know she likes him very much,&#8221; the actor told the New York Post after his daughter was spotted leaving a club with DiCaprio. &#8220;I think they met last month. I’m not sure of the circumstances, but that’s what ...", "link": "https://www.dailywire.com/news/lorenzo-lamas-says-hes-excited-that-his-23-year-old-daughter-is-smitten-with-leonardo-dicaprio-even-though-shes-very-young", "date_published": "2022-12-30 10:36:47+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "One Of Eight Teen Girls Who Allegedly Stabbed Man To Death In Toronto Released On Bail", "description": "One of the eight teenage girls charged with surrounding a man in Toronto, Canada, and stabbing him to death has been granted bail. The teenager, whose name has not been released because she is a minor, has been required to surrender her passport, give up her cellphone, stay in Ontario, and only leave the house ...", "link": "https://www.dailywire.com/news/one-of-eight-teen-girls-who-allegedly-stabbed-man-to-death-in-toronto-released-on-bail", "date_published": "2022-12-30 10:18:38+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "$1.7M In Crypto Vanishes From Bankman-Fried-Linked Firm Days After His Release On Bail", "description": "Some $1.7 million in cryptocurrency vanished from a trading firm linked to FTX founder Sam Bankman-Fried just days after he was released on bail, according to reports. Thirty cryptocurrency wallets linked to Alameda Research, the bankrupt firm run by Bankman-Fried’s ex-paramour, suddenly became active on Dec. 28 following four weeks of inactivity, according to cryptocurrency ...", "link": "https://www.dailywire.com/news/1-7m-in-crypto-vanishes-from-bankman-fried-linked-firm-days-after-his-release-on-bail", "date_published": "2022-12-30 10:04:41+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Jack The Ripper’ Artifact Rediscovery Excites Researchers As Clue To His Identity", "description": "A historical artifact that was recently rediscovered may offer a penetrating clue to the identity of the infamous Jack the Ripper, who mutilated and murdered five women in London in 1888 but was never caught. Many theories have been propounded as to the murderer’s identity, and little if any evidence has been found as to ...", "link": "https://www.dailywire.com/news/jack-the-ripper-artifact-rediscovery-excites-researchers-as-clue-to-his-identity", "date_published": "2022-12-30 09:46:46+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Hunter Biden’s Baby Mama Files Petition: Change Our Child’s Last Name To Biden", "description": "The woman whose daughter was fathered by Hunter Biden while he was in a relationship with his brother’s widow has submitted a petition to a court asking their child’s last name to be changed to Biden. Lunden Alexis Roberts, who reportedly worked as a stripper at a club in Washington, D.C., when she met Biden, ...", "link": "https://www.dailywire.com/news/hunter-bidens-baby-mama-files-petition-change-our-childs-last-name-to-biden", "date_published": "2022-12-30 09:10:36+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Biden Signs $1.7 Trillion Spending Package Backed By 18 Senate Republicans And 9 House Republicans", "description": "President Joe Biden signed the $1.7 trillion spending package into law on Thursday after a bipartisan group of senior lawmakers hustled the 4,155-page bill through Congress just days after introducing it. Biden signed the bill while on vacation in the U.S. Virgin Islands, and the omnibus was flown to the Caribbean island for the president&#8217;s ...", "link": "https://www.dailywire.com/news/biden-signs-1-7-trillion-spending-package-backed-by-18-senate-republicans-and-9-house-republicans", "date_published": "2022-12-30 08:21:17+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Aerosmith’s Steven Tyler Accused Of Child Sexual Abuse In New Lawsuit", "description": "A woman who has long claimed Aerosmith singer Steven Tyler made her abort their baby in the 1970s when she was just 17 has sued the rock star under a California law that expires Saturday. The suit, filed by Julia Holcomb in Los Angeles and first reported by Rolling Stone, does not name Tyler, but quotes ...", "link": "https://www.dailywire.com/news/aerosmiths-steven-tyler-accused-of-child-sexual-abuse-in-new-lawsuit", "date_published": "2022-12-30 08:09:36+00:00", "persistent": false, "user": null, "language": "en-US"}]