[{"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Białoruś: Rzekomo miał obrażać Łukaszenkę. Obywatel Łotwy skazany na cztery lata więzienia", "description": "Obywatel Łotwy Dmitrijs Mihailovs został skazany na Białorusi na cztery lata więzienia - przekazał portal Radio Svoboda. Jak powiadomiono, mężczyzna został oskarżony o obrazę Alaksandra Łukaszenki, rzekome podżeganie do nienawiści i nawoływanie do nałożenia sankcji na Białoruś.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-30/bialorus-rzekomo-mial-obrazac-lukaszenke-obywatel-lotwy-skazany-na-cztery-lata-wiezienia/", "date_published": "2022-12-30 21:13:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Pakistan: Sąd uwolnił gwałciciela po tym, jak zgodził się poślubić swoją ofiarę", "description": "Sąd w Pakistanie zdecydował o uwolnieniu skazanego gwałciciela, który zgodził się poślubić swoją ofiarę. Mężczyzna miał odbyć karę dożywotniego więzienia.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-30/pakistan-sad-uwolnil-gwalciciela-po-tym-jak-zgodzil-sie-poslubic-swoja-ofiare/", "date_published": "2022-12-30 21:04:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Rosja: Były naczelny rabin radzi Żydom, by opuścili kraj. \"Zanim zrobi się z nich kozły ofiarne\"", "description": "- Kiedy patrzymy wstecz na historię Rosji, zawsze, gdy system polityczny był w niebezpieczeństwie, widzieliśmy, jak rząd próbuje przekierować gniew i niezadowolenie mas na społeczność żydowską - powiedział w rozmowie z Guardianem Pinchas Goldschmidt, były naczelny rabin Moskwy. - Widzieliśmy to w czasach carskich i pod koniec reżimu stalinowskiego - stwierdził.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-30/rosja-byly-naczelny-rabin-radzi-zydom-by-opuscili-kraj-zanim-zrobi-sie-z-nich-kozly-ofiarne/", "date_published": "2022-12-30 18:42:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Ukraina: Skradziony przez Rosjan szop został przyjęty na studia", "description": "Szop skradziony przez Rosjan z zoo w Chersoniu został przyjęty na studia. Jak przekazał Biełsat, w nagraniu zamieszczonym przez przedstawicieli uczelni w okupowanym Melitopolu, można się dowiedzieć, że zwierzę samo złożyło dokumenty na dwa kierunki. Kolejny rosyjski festiwal absurdów - ocenił portal.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-30/ukraina-skradziony-przez-rosjan-szop-zostal-przyjety-na-studia/", "date_published": "2022-12-30 17:55:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "USA: Mieszkaniec Buffalo okrzyknięty bohaterem. Uratował 24 osoby podczas burzy śnieżnej", "description": "Podczas ataku zimy w USA jeden z mieszkańców Buffalo utknął swoim samochodem na drodze. Mężczyzna nie mógł znaleźć schronienia w okolicznych domach, dlatego włamał się do budynku szkoły. Wcześniej wyciągnął z aut innych ludzi, którzy utknęli w śniegu. Dzięki jego inwencji w szkolnej stołówce atak zimy przetrwały razem z nim 24 osoby.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-30/usa-mieszkaniec-buffalo-okrzykniety-bohaterem-po-tym-jak-uratowal-24-osoby-podczas-burzy-snieznej/", "date_published": "2022-12-30 17:08:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Brazylia: Znamy datę pogrzebu \"króla futbolu\". Pele spocznie na wyjątkowym cmentarzu", "description": "W poniedziałek na stadionie klubu FC Santos rozpoczną się ceremonie pogrzebowe legendarnego piłkarza Pele. We wtorek król futbolu zostanie pochowany. Spocznie na najwyższym cmentarzu świata - Memoriał Necrópole Ecumênica.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-30/brazylia-znamy-date-pogrzebu-krola-futbolu-pele-spocznie-na-wyjatkowym-cmentarzu/", "date_published": "2022-12-30 16:25:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Kreml obawia się o zdrowie Władimira Putina. Spotkania z dziennikarzami będą wyglądały inaczej", "description": "Władimir Putin nie będzie się spotykać z dziennikarzami na takich zasadach jak do tej pory - powiadomił w piątek rzecznik Kremla. Według Dmitrija Pieskowa, wprowadzane zmiany mają związek z pandemią. - Zdrowie prezydenta jest kwestią bezpieczeństwa państwa - oświadczył rzecznik.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-30/rosja-kreml-obawia-sie-o-zdrowie-wladimira-putina-spotkania-beda-wygladaly-inaczej/", "date_published": "2022-12-30 16:02:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Turcja: Wybuch w restauracji. Są zabici i ranni", "description": "Co najmniej siedem osób zginęło, a cztery zostały ranne na skutek wybuchu w restauracji w mieście Aydin w Turcji - przekazały w piątek lokalne media. Według władz, wśród ofiar śmiertelnych są dzieci.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-30/turcja-wybuch-w-restauracji-sa-zabici-i-ranni/", "date_published": "2022-12-30 15:23:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Wielka Brytania. Zaskakujące odkrycie policji. Tak mógł wyglądać Kuba Rozpruwacz", "description": "Jeden z najsłynniejszych seryjnych zabójców w historii doczekał się zdemaskowania po ponad wieku od popełnienia swych zbrodni. Odkryty przez brytyjską policję artefakt rzucił nowe światło na sprawę nieuchwytnego Kuby Rozpruwacza. Jak sądzą służby, mrożąca krew w żyłach podobizna złoczyńcy została wyrzeźbiona w drewnianej rączce laski, która należała kiedyś do detektywa szukającego śladów mordercy.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-30/wielka-brytania-zaskakujace-odkrycie-policji-tak-mogl-wygladac-kuba-rozpruwacz/", "date_published": "2022-12-30 14:59:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Watykan: Nowe informacje o stanie zdrowia papieża emeryta. Benedykt XVI w stabilnym stanie", "description": "Stan 95-letniego papieża emeryta Benedykta XVI pozostaje stabilny - podała w piątek agencja Ansa, na podstawie źródeł w Watykanie. Nie ujawniono żadnych dalszych szczegółów poza tym, że Benedykt XVI koncelebrował rano mszę w swoim pokoju.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-30/watykan-nowe-informacje-o-stanie-zdrowia-papieza-emeryta-benedykt-xvi-w-stabilnym-stanie/", "date_published": "2022-12-30 13:56:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Wielka Brytania: Pomyłka szpitala. Wysłano wiadomość o nieuleczalnym raku zamiast życzeń na święta", "description": "Setki osób korzystających z usług brytyjskiego szpitala z okolic Doncaster otrzymało w wigilię wiadomość, że mają nieuleczalnego raka, a ich lekarz stara się o specjalne świadczenia dla nich. Partner jednego z pacjentów pojechał do placówki, gdzie powiedziano mu, że doszło do pomyłki. Szpital przed Bożym Narodzeniem chciał jedynie życzyć wesołych świąt.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-30/wielka-brytania-pomylka-szpitala-wyslal-wiadomosc-o-nieuleczalnym-raku-zamiast-zyczen-na-swieta/", "date_published": "2022-12-30 13:02:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Propagandysta Putina ostrzega Polskę. Mówi o wkroczeniu wojsk do Warszawy", "description": "Poplecznik Putina i jeden z najwierniejszych Kremlowi propagandystów grozi Zachodowi atakiem rosyjskich sił. Jako uzasadnienie takiego ruchu podał braki sprzętu obronnego w tych państwach, które najwięcej pomagały Ukrainie. W swoim programie na antenie reżimowej telewizji nie wykluczył nawet wkroczenia sił specjalnych do stolicy Polski.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-30/propagandysta-putina-ostrzega-polske-mowi-o-wkroczeniu-wojsk-do-warszawy/", "date_published": "2022-12-30 11:22:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Afganistan: Profesor podarł dyplomy na antenie telewizji. \"Ten kraj to nie miejsce na edukację\"", "description": "- Jeśli moja siostra i mama nie mogą się uczyć, to nie akceptuję takiej edukacji - powiedział w programie na żywo afgański profesor, sprzeciwiając się zakazaniu kobietom studiowania na uczelniach. Taką decyzję podjęli talibowie, twierdząc chociażby, że panie - zamiast nosić tradycyjny, islamski ubiór, zakładały sukienki jak na ślub. Protestują także sami studenci i dyplomaci niektórych krajów.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-30/afganistan-profesor-podarl-dyplomy-na-antenie-telewizji-ten-kraj-to-nie-miejsce-na-edukacje/", "date_published": "2022-12-30 10:55:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Rumunia: Andrew Tate zatrzymany za handel ludźmi. Wpadł, bo nagrał wideo do Grety Thunberg", "description": "Influencer Andrew Tate słynie z niechęci do kobiet i obelg kierowanych w ich stronę. Nie przejmuje się też zmianami klimatu, bo we wpisie do Grety Thunberg pochwalił się kolekcją paliwożernych aut. Odpowiedź aktywistki stała się hitem internetu, ale to nie koniec historii. Tate chciał postawić kropkę i nagrał wideo, na którym zdradził, gdzie jest. I przez to został zatrzymany za handel ludźmi.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-30/rumunia-andrew-tate-zatrzymany-za-handel-ludzmi-wpadl-bo-nagral-wideo-do-grety-thunberg/", "date_published": "2022-12-30 06:10:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}]