[{"source": "https://sekurak.pl/rss", "title": "LastPass – o co chodzi w wycieku haseł z tego managera i jaki jest koszt złamania wszystkich Twoich haseł?", "description": "<p>Ostatnio spływają coraz bardziej ponure informacje o managerze haseł LastPass. Niedawno donosiliśmy, że hackerzy uzyskali dostęp do >>zaszyfrowanych&#60;&#60; baz z hasłami. Nietechniczne osoby (i media) rozumieją to często w ten sposób: wyciekły wszystkie moje hasła z LastPass. No niekoniecznie, ale i tak sytuacja nie jest ciekawa: 1. Dobry manager haseł...</p>\n<p>Artykuł <a href=\"https://sekurak.pl/lastpass-o-co-chodzi-w-wycieku-hasel-z-tego-managera-i-jaki-jest-koszt-zlamania-wszystkich-twoich-hasel/\" rel=\"nofollow\">LastPass &#8211; o co chodzi w wycieku haseł z tego managera i jaki jest koszt złamania wszystkich Twoich haseł?</a> pochodzi z serwisu <a href=\"https://sekurak.pl\" rel=\"nofollow\">Sekurak</a>.</p>", "link": "https://sekurak.pl/lastpass-o-co-chodzi-w-wycieku-hasel-z-tego-managera-i-jaki-jest-koszt-zlamania-wszystkich-twoich-hasel/", "date_published": "2022-12-30 21:38:57+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://sekurak.pl/rss", "title": "Punktowy wyciek danych kupujących na Allegro. Dane wystawiono na sprzedaż. Incydent nie ma charakteru masowego.", "description": "<p>Na jednym z polskich forów pojawiło się takie ogłoszenie: Rekordy zawierają dane: Login Imię/Nazwisko Telefon kupującego Nr przesyłki (InPost lub innej kurierskiej) Adres dostawy Zakupiony towar / kwota Data/godzina transakcji Dane nie zawierają więcej informacji o użytkownikach (np. ich haseł). Przed publikacją poprosiliśmy Allegro o ustosunkowanie się do tematu. Niedługo...</p>\n<p>Artykuł <a href=\"https://sekurak.pl/punktowy-wyciek-danych-kupujacych-na-allegro-dane-wystawiono-na-sprzedaz-incydent-nie-ma-charakteru-masowego/\" rel=\"nofollow\">Punktowy wyciek danych kupujących na Allegro. Dane wystawiono na sprzedaż. Incydent nie ma charakteru masowego.</a> pochodzi z serwisu <a href=\"https://sekurak.pl\" rel=\"nofollow\">Sekurak</a>.</p>", "link": "https://sekurak.pl/punktowy-wyciek-danych-kupujacych-na-allegro-dane-wystawiono-na-sprzedaz-incydent-nie-ma-charakteru-masowego/", "date_published": "2022-12-30 17:16:47+00:00", "persistent": false, "user": null, "language": "pl-PL"}]