{"entries": [{"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/19/harvey-weinstein-trial-guilty-los-angeles", "title": "Harvey Weinstein found guilty of rape and sexual assault in Los Angeles trial", "date_published": "2022-12-19 23:57:29+00:00", "description": "<p>The downfall of the former movie magnate played out over a six-week trial that included testimony from Jennifer Siebel Newsom </p><p>A Los Angeles jury has found Harvey Weinstein guilty of rape and sexual assault, five years after dozens of women spoke out against the Hollywood producer and galvanized the #MeToo movement.</p><p>After more than nine days of deliberation, the jury convicted Weinstein of three counts of rape and sexual assault against one woman, a European model who testified anonymously as “Jane Doe 1”, while remaining divided on three other charges of rape and sexual assault by two other accusers, including Jennifer Siebel Newsom, the wife of California’s governor.</p> <a href=\"https://www.theguardian.com/world/2022/dec/19/harvey-weinstein-trial-guilty-los-angeles\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/19/gerwyn-price-fights-back-to-beat-luke-woodhouse-as-steve-beaton-crashes-out", "title": "Gerwyn Price fights back to beat Luke Woodhouse as Steve Beaton crashes out", "date_published": "2022-12-19 23:22:41+00:00", "description": "<ul><li>World No 1 secures 3-1 win, Beaton loses to Danny van Trijp</li><li>David Cameron stuns Ritchie Edhouse with epic comeback</li></ul><p>Gerwyn Price suffered an early scare in his PDC world championship opener against Luke Woodhouse, but fought back to win the match 3-1 at Alexandra Palace.</p><p>Woodhouse, the current world No 50, made a blistering start as he took the first set with an average of 104.95, with Price missing five doubles and struggling for rhythm. Price took out an 83 finish to level the match at 1-1, and broke his opponent’s throw in the third leg of the next set, despite missing six more darts at doubles.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/19/gerwyn-price-fights-back-to-beat-luke-woodhouse-as-steve-beaton-crashes-out\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/music/2022/dec/19/terry-hall-the-self-assured-eye-of-the-specials-storm", "title": "Terry Hall was the self-assured eye of the Specials storm", "date_published": "2022-12-19 22:42:56+00:00", "description": "<p>As the pioneering 2 Tone band’s lead singer, Hall’s impassive style made him a star – and helped him weather the vicissitudes of fame, the changing charts and British decline</p><p>• <a href=\"https://www.theguardian.com/music/2022/dec/19/terry-hall-lead-singer-of-the-specials-dies-aged-63\">Terry Hall: lead singer of the Specials dies aged 63</a><br />• <a href=\"https://www.theguardian.com/music/gallery/2022/dec/20/the-specials-terry-hall-a-life-in-pictures\">Terry Hall: a life in a pictures</a></p><p>As the credits roll on <a href=\"https://en.wikipedia.org/wiki/Dance_Craze\">Dance Craze</a>, the impossibly exciting 1981 concert film shot at the height of the 2 Tone movement, the Specials perform Nite Klub. It’s a noticeably different version of the song to the one that appears on their eponymous 1979 debut album. The intro is long and slow, reflecting songwriter Jerry Dammers’ increasing interest in jazz and easy listening, which would controversially infect the Specials’ second album More Specials. Then the song erupts into frantic ska and the band’s members suddenly spring into life, leaping up and down, rushing backwards and forwards across the stage. Except for Terry Hall, who continues to stand more or less stock still, his face impassive, an occasional nod his solitary concession to what’s happening around him. As the song progresses, audience members start to climb on stage and dance, swamping the band. Dammers gleefully dives into their midst, but Hall has retreated to the rear of the stage, by the drums. He keeps singing about the awfulness of provincial nightlife – “Is this the place to be? What am I doing here?” – while staring balefully at the mayhem before him. The song ends and the screen goes black as Hall emits a mirthless laugh.</p><p>It was a very Terry Hall moment. Everyone remembers the Specials in their prime as a thrilling mass of cartoonish kinetic energy – when the comedy show Not the Nine O’Clock News hamfistedly <a href=\"https://www.youtube.com/watch?v=HnpY2vCwvU0\">attempted to parody</a> them, it was with a song called I Like Bouncing – but Hall was invariably the eye of the storm: he might occasionally move in time to the music (and at one point in Dance Craze he climbs down from the stage and sings directly into the rowdy front row) but in comparison with his bandmates, he was a statue, fixing the crowd or the viewer at home with an unblinking, mournful stare.</p> <a href=\"https://www.theguardian.com/music/2022/dec/19/terry-hall-the-self-assured-eye-of-the-specials-storm\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/19/trump-criminal-charges-jan-6-panel-capitol-attack", "title": "House January 6 panel recommends criminal charges against Donald Trump", "date_published": "2022-12-19 22:41:26+00:00", "description": "<p>The referral marks the first time in US history that Congress has taken such action against a former president</p><p>The January 6 committee has referred Donald Trump to the justice department to face criminal charges, accusing the former president of fomenting an insurrection and conspiring against the government over his attempt to subvert the outcome of the 2020 election, and the bloody attack on the US Capitol.</p><p>The committee’s referrals approved by its members on Monday are the first time in American history that Congress has recommended charges against a former president. They come after 18 months of investigation by the bipartisan House of Representatives panel tasked with understanding Trump’s plot to stop Joe Biden from taking office.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/19/trump-criminal-charges-jan-6-panel-capitol-attack\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/music/2022/dec/19/terry-hall-lead-singer-of-the-specials-dies-aged-63", "title": "Terry Hall: lead singer of the Specials dies aged 63", "date_published": "2022-12-19 22:41:10+00:00", "description": "<p>Having survived a tough childhood in Coventry, Hall became one of pop’s defining voices at the turn of the 80s, chronicling British decline and disfranchised youth with the 2 Tone band</p><p>• <a href=\"https://www.theguardian.com/music/2022/dec/19/terry-hall-the-self-assured-eye-of-the-specials-storm\">Alexis Petridis: ‘Terry Hall was the self-assured eye of the Specials storm’</a><br />• <a href=\"https://www.theguardian.com/music/gallery/2022/dec/20/the-specials-terry-hall-a-life-in-pictures\">Terry Hall: a life in a pictures</a></p><p>Terry Hall, the lead singer of <a href=\"https://www.theguardian.com/music/the-specials\">the Specials</a> and a former member of Fun Boy Three and the Colourfield, has died aged 63, his bandmates in the Specials have confirmed.</p><p>“It is with great sadness that we announce the passing, following a brief illness, of Terry, our beautiful friend, brother and one of the most brilliant singers, songwriters and lyricists this country has ever produced,” <a href=\"https://twitter.com/thespecials/status/1604969543184564234\">the band tweeted</a>.</p> <a href=\"https://www.theguardian.com/music/2022/dec/19/terry-hall-lead-singer-of-the-specials-dies-aged-63\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/business/2022/dec/19/sam-bankman-fried-ftx-us-extradition-fraud-charges", "title": "FTX founder Sam Bankman-Fried to face fraud charges after US extradition", "date_published": "2022-12-19 21:55:49+00:00", "description": "<p>Lawyers for the fallen cryptocurrency mogul said he had wanted to see the indictment against him before agreeing to the extradition</p><p>Fallen crypto mogul Sam Bankman-Fried has now decided to agree to be extradited to the United States to face fraud charges, two of his lawyers said on Monday, just hours after one of them told a Bahamas judge the FTX founder wanted to see the US indictment against him before consenting.</p><p>On Monday afternoon, Jerone Roberts, Bankman-Fried’s criminal defense lawyer in the Bahamas, told media outlets including the New York Times that his client had agreed to be voluntarily extradited and that he hoped Bankman-Fried would be back in court later this week.</p> <a href=\"https://www.theguardian.com/business/2022/dec/19/sam-bankman-fried-ftx-us-extradition-fraud-charges\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/uk-news/2022/dec/19/second-person-dies-after-brixton-concert-crush", "title": "Second person dies after Brixton concert crush", "date_published": "2022-12-19 21:52:04+00:00", "description": "<p>Gaby Hutchinson, 23, was working in security role at London venue on night of Asake gig</p><p>A security guard has become the second person to die after a crowd crush at the O2 Academy Brixton last week.</p><p>Gaby Hutchinson, 23, was working as a contracted security provider at a performance on Thursday by the Nigerian Afrobeats singer-songwriter Asake.</p><p>A previous version of this story was launched on Monday 19 December 2022. This version reflects updated information released by the Metropolitan police.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/19/second-person-dies-after-brixton-concert-crush\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/19/toronto-shootings-gunman", "title": "Gunman in Toronto slayings had history of harassing neighbours", "date_published": "2022-12-19 21:39:13+00:00", "description": "<p>Francesco Velli, 73, claimed apartment building made him sick before killing three members of the condo board and two others</p><p>The man who <a href=\"https://www.theguardian.com/world/2022/dec/19/toronto-shooting-gunman-kills-five-residential-unit-vaughan-canada\">shot and killed five people at a suburban Toronto condominium</a> on Sunday evening had spent years harassing his neighbours and threatening the building’s condo board over a belief that the building’s electrical room was making him sick.</p><p>At a news conference on Monday, York region police chief James MacSween identified the gunman in Sunday night’s attack in the city of Vaughn as Francesco Velli.</p> <a href=\"https://www.theguardian.com/world/2022/dec/19/toronto-shootings-gunman\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/19/the-january-6-committee-just-gave-a-final-blow-to-trumps-very-bad-year", "title": "The January 6 committee just gave a final blow to Trump’s very bad year | Lloyd Green", "date_published": "2022-12-19 20:47:29+00:00", "description": "<p>The committee referred Trump for possible criminal prosecution. And politically he looks like a loser</p><p>This year was bad for the 45th president. 2023 may even be worse. Criminal prosecutions may be forthcoming. Beyond that, the legacy of 6 January 2021, combined with the results of the recent midterms, left Donald Trump politically vulnerable.</p><p>Stripped of the veneer of invincibility and inevitability, he looks like a loser. On Monday, the House committee on the January 6 attacks concluded that the evidence warranted referral to the justice department for possible prosecution.</p><p>Lloyd Green is an attorney in New York and served in the US Department of Justice from 1990 to 1992</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/19/the-january-6-committee-just-gave-a-final-blow-to-trumps-very-bad-year\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/19/germany-pauses-buying-puma-tanks-after-mass-breakdown", "title": "Germany pauses buying Puma tanks after mass breakdown", "date_published": "2022-12-19 20:39:41+00:00", "description": "<p>All 18 tanks on exercises suffer problems in blow to German contribution to January Nato force</p><p>The German government has said it will pause purchases of new Puma tanks after a mass breakdown during exercises, lamenting a “harsh setback” as <a href=\"https://www.theguardian.com/world/2022/feb/27/germany-set-up-fund-boost-military-strength-ukraine-putin\">Berlin seeks to overhaul its military.</a></p><p>The armoured infantry vehicles – which were supposed to form part of Germany’s contribution to a Nato force – suffered problems that left all 18 of those in the exercises unfit for operations.</p> <a href=\"https://www.theguardian.com/world/2022/dec/19/germany-pauses-buying-puma-tanks-after-mass-breakdown\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/19/the-winner-is-qatar-project-hard-football-power-world-cup-2022", "title": "The winner is … Qatar: curtain comes down on Project Hard Football Power", "date_published": "2022-12-19 20:00:27+00:00", "description": "<p>It was costly, carbon-heavy, bloodstained and corruption-shadowed but this micromanaged power play couldn’t have gone much better for the hosts</p><p>“And the winner is … Qatar!” It all began with those words, read out in a tone of strangled gaiety by Sepp Blatter on stage at Fifa house. Twelve years on Qatar 2022 has now concluded with the same phrase hanging in the air.</p><p>Project Hard Football Power is complete. And it reallycouldn’t have gone any better, a micromanaged power play, from the pharaonic-scale nation-building project, to the painted backdrop sets, to the regional visibility that helped see Qatar through the blockade years, to the chance at the death to parade Lionel Messi around the winners’ enclosure like a beaming Guy Fawkes dummy. The winner is ... Qatar!</p> <a href=\"https://www.theguardian.com/football/2022/dec/19/the-winner-is-qatar-project-hard-football-power-world-cup-2022\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/19/objection-by-drc-sours-paradigm-changing-cop15-biodiversity-deal", "title": "Objection by DRC sours ‘paradigm-changing’ Cop15 biodiversity deal", "date_published": "2022-12-19 19:57:14+00:00", "description": "<p>The Democratic Republic of the Congo’s last-minute bid for additional funds was dismissed on a legal technicality</p><p>It was almost a special moment in the early hours of Monday morning in the Palais des congrès in Montreal. China and Canada, two squabbling adversaries, had united for the good of the planet to help the world at Cop15 forge a <a href=\"https://www.cbd.int/doc/c/e6d3/cd1d/daf663719a03902a9b116c34/cop-15-l-25-en.pdf\">once-in-a-decade deal</a> to halt the destruction of Earth’s ecosystems.</p><p>From the emphasis on indigenous rights to conserving 30% of Earth for nature, there is good reason to believe the Kunming-Montreal agreement could be a truly historic, hopeful turning point in humanity’s relationship with nature after decades of destruction and warnings of mass extinctions.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/19/objection-by-drc-sours-paradigm-changing-cop15-biodiversity-deal\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/19/we-didnt-accept-it-drc-minister-laments-forcing-through-of-cop15-deal-aoe", "title": "‘We didn’t accept it’: DRC minister laments forcing through of Cop15 deal", "date_published": "2022-12-19 19:32:03+00:00", "description": "<p>Democratic Republic of the Congo’s environment minister says country has not agreed to ‘30 by 30’ deal</p><p>The Democratic Republic of the Congo’s environment minister has said her country has not agreed to a <a href=\"https://www.cbd.int/doc/c/e6d3/cd1d/daf663719a03902a9b116c34/cop-15-l-25-en.pdf\">deal</a> to halt the destruction of the Earth’s ecosystems, prompting behind-the-scenes diplomatic efforts to keep the agreement alive just hours after it was adopted.</p><p>Ève Bazaiba, the DRC’s environment minister, said her country would be writing to the UN secretary general, António Guterres, and the Convention on Biological Diversity to express the DRC’s position on the final text. It comes after the Chinese Cop15 president, Huang Runqiu, appeared to force through the agreement in the final plenary just moments after the DRC negotiator had said did not support the deal, which is typically negotiated by consensus. His interventions prompted further objections from Uganda and Cameroon.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/19/we-didnt-accept-it-drc-minister-laments-forcing-through-of-cop15-deal-aoe\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/19/trump-attempt-coup-jan-6-panel-executive-summary", "title": "A very American coup attempt: Jan 6 panel lays bare Trump’s bid for power", "date_published": "2022-12-19 19:26:54+00:00", "description": "<p>Executive summary of report released by House panel investigating January 6 details a failed self-coup </p><p>It was, all in all, a very American attempt at a coup. Or self-coup to be exact.</p><p>The world watched its denouement dumbfounded on 6 January 2021 as thousands of Donald Trump’s supporters stormed the heart of US democracy, the Capitol in Washington, with cries to hang the vice-president, in an attempt to overturn an election and keep Trump in power.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/19/trump-attempt-coup-jan-6-panel-executive-summary\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/politics/2022/dec/19/jo-johnson-resigns-from-binance-advisory-role", "title": "Jo Johnson resigns from Binance advisory role", "date_published": "2022-12-19 19:11:05+00:00", "description": "<p>The former Tory MP and universities minister stepped back as scrutiny over the cryptocurrency exchange grows</p><p>Boris Johnson’s younger brother, Jo, has resigned from a role advising Binance, the world’s largest cryptocurrency exchange, which hopes to launch in the UK.</p><p>Lord Johnson of Marylebone took the role on the UK advisory board of Bfinity, a payments business founded by Binance, in September, the Telegraph reported.</p> <a href=\"https://www.theguardian.com/politics/2022/dec/19/jo-johnson-resigns-from-binance-advisory-role\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/business/nils-pratley-on-finance/2022/dec/19/elon-musk-needs-to-realise-twitter-is-a-hobby-and-tesla-is-his-priority", "title": "Elon Musk needs to realise Twitter is a hobby and Tesla is his priority | Nils Pratley", "date_published": "2022-12-19 18:52:10+00:00", "description": "<p>Whether or not his poll was genuine, Musk would be wise to take a step back from the social media site </p><p>There are two theories about Elon Musk’s <a href=\"https://www.theguardian.com/technology/2022/dec/19/elon-musk-says-step-down-twitter-ceo-poll-tesla\">latest online poll</a>. One says he was genuinely interested in whether Twitter users think he should step down as chief executive of the social media site. A second says he has already accepted that he’ll have to give up day-to-day management and, in usual attention-seeking style, was creating fake drama around the event. The second idea sounds more plausible.</p><p>Musk can surely see – as many shareholders of Tesla have been saying in recent weeks – that there are risks in tying his personal brand so closely to Twitter’s. The job of designing, producing and selling electric vehicles is not made easier if the public face of the car company is also at the centre of storms over who Twitter is banning or <a href=\"https://www.theguardian.com/technology/2022/dec/17/elon-musk-reinstates-twitter-accounts-of-suspended-journalists\">unbanning this week</a>. “Customers don’t want their cars to be controversial. They want to be proud as hell to drive them – not embarrassed,” said Gary Black, managing partner of Future Fund, whose biggest investment is Tesla, last week. Quite.</p> <a href=\"https://www.theguardian.com/business/nils-pratley-on-finance/2022/dec/19/elon-musk-needs-to-realise-twitter-is-a-hobby-and-tesla-is-his-priority\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/19/eu-energy-ministers-agreement-deal-gas-price-cap", "title": "EU energy ministers reach agreement on gas price cap", "date_published": "2022-12-19 18:39:05+00:00", "description": "<p>Months of talks end with ‘dynamic cap’ deal after Germany persuaded by global reference-price condition</p><p>EU ministers have agreed a plan to cap the price of gas, ending months of argument over how to handle the cost of soaring energy prices after Russia cut gas supplies to Europe.</p><p>“Mission accomplished,” said the Czech minister for trade and industry, Jozef Síkela, who chaired talks between energy ministers, adding that negotiations had not been easy.</p> <a href=\"https://www.theguardian.com/world/2022/dec/19/eu-energy-ministers-agreement-deal-gas-price-cap\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/19/dolphins-may-suffer-from-alzheimers-disease-say-researchers-in-scotland", "title": "Dolphins may suffer from Alzheimer’s disease, say researchers in Scotland", "date_published": "2022-12-19 18:34:00+00:00", "description": "<p>Bottlenose dolphin, a long-finned pilot whale and a third species found to have markers of the degenerative disease</p><p>Three species of cetacean stranded off the coast of Scotland, including a bottlenose dolphin and a long-finned pilot whale, have been found to have the classic markers of Alzheimer’s disease, according to a <a href=\"https://onlinelibrary.wiley.com/doi/abs/10.1111/ejn.15900\">study</a>.</p><p>Although types of dementia have been fairly widely detected in other animals, Alzheimer’s disease has not been found to occur naturally in species other than humans.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/19/dolphins-may-suffer-from-alzheimers-disease-say-researchers-in-scotland\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/19/new-england-coach-steve-borthwick-players-are-hurting-after-recent-run", "title": "‘Players are hurting’: Steve Borthwick targets England revival in Six Nations", "date_published": "2022-12-19 18:29:45+00:00", "description": "<ul><li>New head coach signs five-year contract after leaving Leicester</li><li>Borthwick: ‘I don’t think anyone thinks the timing is ideal’</li></ul><p>England’s new head coach, Steve Borthwick, says his players are “hurting” as a consequence of poor recent results under his predecessor Eddie Jones, and has vowed to channel that pain into a strong Six Nations campaign.</p><p>The 43-year-old Borthwick was confirmed in the role at Twickenham on Monday, signing a five-year contract after leaving Leicester Tigers, with Kevin Sinfield also departing Welford Road to become England’s defence coach. Borthwick is planning to recruit the rest of his backroom team in the coming weeks.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/19/new-england-coach-steve-borthwick-players-are-hurting-after-recent-run\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/19/peru-nazca-plain-ancient-art-new-designs-discovered", "title": "More than 100 new designs discovered in Peru’s ancient Nazca plain", "date_published": "2022-12-19 18:29:32+00:00", "description": "<p>Findings this month of geoglyphs, which date back more than 2,000 years, are smaller and can be seen from the ground</p><p>More than 100 new designs discovered in and around Peru’s ancient Nazca plain and surrounding areas could bring new information to light about the mysterious pre-Columbian artworks that have intrigued scientists and visitors for decades.</p><p>Following two years of field surveys with aerial photos and drones, Peruvian and Japanese researches from Yamagata University earlier this month reported the discovery of 168 new designs at the Unesco World Heritage site on Peru’s southern Pacific coast.</p> <a href=\"https://www.theguardian.com/world/2022/dec/19/peru-nazca-plain-ancient-art-new-designs-discovered\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/picture/2022/dec/19/martin-rowson-on-the-new-winter-of-discontent-cartoon", "title": "Martin Rowson on the new winter of discontent – cartoon", "date_published": "2022-12-19 18:09:41+00:00", "description": "<a href=\"https://www.theguardian.com/commentisfree/picture/2022/dec/19/martin-rowson-on-the-new-winter-of-discontent-cartoon\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/19/canada-abramovich-company-ukraine-sanctions-granite-capital-holdings", "title": "Canada targets Abramovich company for Ukraine sanctions seizure", "date_published": "2022-12-19 18:04:36+00:00", "description": "<p>Government plans to seize C$26m from Granite Capital Holdings, owned by sanctioned former Chelsea FC owner</p><p>Canada plans to seize C$26m (US$19m) from a company owned by the sanctioned Russian oligarch Roman Abramovich, the <a href=\"https://www.canada.ca/en/global-affairs/news/2022/12/canada-starts-first-process-to-seize-and-pursue-the-forfeiture-of-assets-of-sanctioned-russian-oligarch.html\">federal government said on Monday</a>.</p><p>The pursuit of Abramovich’s Granite Capital Holdings marks a first attempt by Ottawa to seize assets belonging to a sanctioned individual and reflects a broader strategy to punish Russia and its wealthy elite for the invasion of Ukraine.</p> <a href=\"https://www.theguardian.com/world/2022/dec/19/canada-abramovich-company-ukraine-sanctions-granite-capital-holdings\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/19/government-strikes-tories-rightwing-press", "title": "The only course left for Sunak's friendless government is to settle these strikes now | Polly Toynbee", "date_published": "2022-12-19 18:00:24+00:00", "description": "<p>The Tories have even lost the support of their cheerleaders in the rightwing press. But can they bear to back down?</p><p>Week one was a win for the nurses. The government banked on public anger when they walked out, but instead <a href=\"https://www.theguardian.com/uk-news/2022/dec/17/public-support-nurses-strike-pressure-sunak-tories\">public support rose</a>. It must rattle No 10 when even the Express splashes front pages backing the nurses day after day: “Give nurses a deal and stop this madness,” screamed one. “For nurses, for Britain, sit down and sort this out,” another. Today, the paper quoted a poll showing that 68% of the public support their strike. </p><p>According to <a href=\"https://bit.ly/3G260DH\">another new poll</a>, 50% of voters want the government to negotiate with <em>all</em> of the public sector to pay them more, with just 23% backing implacability. Destined to climb down, the government would be wise to do it right now, as every week of escalating strikes exposes the inadequacy of Rishi Sunak’s response and brings more calls from Tory MPs for settlement.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/19/government-strikes-tories-rightwing-press\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/19/frances-karim-benzema-announces-retirement-from-international-football", "title": "France’s Karim Benzema announces retirement from international football", "date_published": "2022-12-19 17:33:09+00:00", "description": "<ul><li>Benzema, 35, was injured on eve of the World Cup and left squad</li><li>2022 Ballon d’Or winner scored 37 times in 97 France games</li></ul><p>The France striker Karim Benzema has announced his retirement from international football – on his 35th birthday – a day after Les Bleus lost against Argentina on penalties in the World Cup final.</p><p>The Ballon d’Or winner, who scored 37 times in 97 appearances, was expected to lead the line for France in Qatar but missed the tournament after sustaining a thigh injury in training the day before it started.</p> <a href=\"https://www.theguardian.com/football/2022/dec/19/frances-karim-benzema-announces-retirement-from-international-football\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/politics/2022/dec/19/human-rights-activist-complains-to-tory-party-after-mp-tells-him-to-go-back-to-bahrain", "title": "Human rights activist complains to Tory party after MP tells him to ‘go back to Bahrain’", "date_published": "2022-12-19 17:30:15+00:00", "description": "<p>Exclusive: In video footage, Bob Stewart MP heard telling Sayed Alwadaei ‘you’re taking money off my country’</p><p>A human rights activist has complained to the Conservative party after a confrontation with Tory MP Bob Stewart, where he was told to “go back to Bahrain” and that he was “taking money off my country”.</p><p>In video footage passed to the Guardian, Sayed Alwadaei, the director of the Bahrain Institute for Rights and Democracy, confronts Stewart outside a reception hosted by the Bahraini embassy.</p> <a href=\"https://www.theguardian.com/politics/2022/dec/19/human-rights-activist-complains-to-tory-party-after-mp-tells-him-to-go-back-to-bahrain\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/19/argentina-world-cup-victory-celebrations-buenos-aires", "title": "Blue and white euphoria grips Buenos Aires after Argentina’s World Cup win", "date_published": "2022-12-19 17:19:43+00:00", "description": "<p>More than a million people were in the streets of Buenos Aires celebrating the victory, according to estimates from authorities</p><p>Around the Obelisk in Buenos Aires, revelers in football shirts, hats, wigs and face-paint in the Argentinian colours danced long into the night to drums and sound systems blaring cumbia and reggaeton.</p><p>Young people climbed fences, light posts, and the giant BA sign at the foot of the monument. It was an ecstatic tribute to <a href=\"https://www.theguardian.com/football/2022/dec/18/world-cup-final-argentina-france-match-report\">a World Cup victory</a> this country had been waiting for ever since this football-mad nation last carried the trophy home in 1986.</p> <a href=\"https://www.theguardian.com/world/2022/dec/19/argentina-world-cup-victory-celebrations-buenos-aires\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/film/2022/dec/19/amber-heard-johnny-depp-legal-settlement", "title": "Amber Heard settles defamation case with Johnny Depp", "date_published": "2022-12-19 17:17:38+00:00", "description": "<p>Heard had previously been ordered to pay more than $10m in damages to Depp, while he was ordered to pay her $2m</p><p>Amber Heard has agreed to a legal settlement with her ex-husband and fellow actor Johnny Depp, who sued her for defamation after she suggested he abused her in a 2018 Washington Post <a href=\"https://www.washingtonpost.com/opinions/ive-seen-how-institutions-protect-men-accused-of-abuse-heres-what-we-can-do/2018/12/18/71fd876a-02ed-11e9-b5df-5d3874f1ac36_story.html\">op-ed</a>.</p><p>Heard, 36, had previously been ordered pay more than $10m in damages to Depp, 56. Depp, meanwhile, was ordered to pay Heard $2m after she filed a countersuit accusing him of defamation after his lawyer, Adam Waldman, called her abuse claims a “hoax”.</p> <a href=\"https://www.theguardian.com/film/2022/dec/19/amber-heard-johnny-depp-legal-settlement\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/19/emiliano-martinez-shootouts-controversy-and-world-cup-success", "title": "Emiliano Martínez: Shootouts, controversy and World Cup success", "date_published": "2022-12-19 17:10:52+00:00", "description": "<p>Argentina goalkeeper has previous form saving from the spot, and however contentious, is the ultimate difference-maker</p><p>Only Aurelién Tchouaméni knows for certain whether Emiliano Martínez got into his head. With France on the back foot after the Argentina goalkeeper had saved from Kingsley Coman, it was the 22-year-old midfielder’s turn in the shootout to determine the winners of the World Cup.</p><p>Alone with his thoughts, Tchouaméni made the long walk from the centre-circle while Martínez stood in wait, ball in hand as he whipped the crowd behind the goal into a frenzy. Rather than hand the ball to Tchouaméni, he tossed it to one side, forcing the youngster into an unwanted detour as he reached the penalty spot. As if to say: “I’m calling the shots here but you have to take one.”</p> <a href=\"https://www.theguardian.com/football/2022/dec/19/emiliano-martinez-shootouts-controversy-and-world-cup-success\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/politics/2022/dec/19/evgeny-lebedev-house-of-lords-attendance-among-least-active", "title": "Evgeny Lebedev’s 1% attendance makes him among least active in House of Lords", "date_published": "2022-12-19 16:49:31+00:00", "description": "<p>Evening Standard owner among a series of peers who appear to play a minimal role without a formal leave of absence from Lords</p><p>Evgeny Lebedev has turned up to little more than 1% of Lords sessions since Boris Johnson made him a peer, Guardian analysis shows, making him among the seemingly least active members of the chamber over the past three years.</p><p>Of 318 possible sittings since he formally entered the Lords in November 2019, the billionaire newspaper proprietor and friend of Johnson attended four times up to 7 December, attendance records show, 1.25% of the total.</p> <a href=\"https://www.theguardian.com/politics/2022/dec/19/evgeny-lebedev-house-of-lords-attendance-among-least-active\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/fashion/2022/dec/19/how-can-you-spot-a-vibe-shift-that-transforms-popular-culture-ask-me-i-literally-invented-the-term", "title": "How can you spot a ‘vibe shift’ that transforms popular culture? Ask me! I literally invented the term", "date_published": "2022-12-19 16:48:43+00:00", "description": "<p>Another day, another dozen micro-trends. Here’s how to tell what matters from the latest sea shanty craze or ice bucket challenge</p><p>In late 2019, I started spotting them in New York. Trucker hats. Everywhere. Worn by conspicuously youthful young men and often with tight, flared, dark denim jeans and black leather jackets, they looked out of time when everyone still thought streetwear – fancy trainers and expensive sportswear collaborations – was the future of fashion.</p><p>I appreciated their commitment to the mid-00s aesthetic. It made them look like a band. Two years later, my suspicions were confirmed when I met some trucker-hat wearers at a party. They were a band: the Hellp. In the intervening two years they went from looking out of time to looking right on time, and would prefigure “the vibe shift”,<a href=\"https://www.theguardian.com/commentisfree/2022/jan/26/gen-z-indie-sleaze-camden\"> “indie sleaze,”</a><strong> </strong>or even simply<strong> </strong>“the return of rock” – whatever you might call it.</p> <a href=\"https://www.theguardian.com/fashion/2022/dec/19/how-can-you-spot-a-vibe-shift-that-transforms-popular-culture-ask-me-i-literally-invented-the-term\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/19/swedish-court-blocks-extradition-journalist-turkey-nato-bulent-kenes", "title": "Swedish court blocks extradition of journalist sought by Turkey in Nato deal", "date_published": "2022-12-19 16:36:54+00:00", "description": "<p>Handing over of Bülent Keneş is one of Ankara’s key demands in exchange for ratifying Sweden’s membership</p><p>Sweden’s supreme court has blocked the extradition of an exiled Turkish journalist, which was a key demand by Ankara to <a href=\"https://www.theguardian.com/world/2022/nov/01/finland-and-sweden-call-on-hungary-and-turkey-to-ratify-nato-applications\">ratify Stockholm’s Nato membership</a>.</p><p>The court said on Monday there were “several hindrances” to sending back Bülent Keneş, a former editor-in-chief of the Zaman daily, who Turkey accuses of being involved in a 2016 attempt to topple President Recep Tayyip Erdoğan.</p> <a href=\"https://www.theguardian.com/world/2022/dec/19/swedish-court-blocks-extradition-journalist-turkey-nato-bulent-kenes\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/blog/2022/dec/19/football-qatar-world-cup-fifa-must-do-better-for-2026-anita-asante", "title": "The football in Qatar was great but Fifa had a stinker. It must do better for 2026 | Anita Asante", "date_published": "2022-12-19 16:33:59+00:00", "description": "<p>Argentina deserved to win the World Cup and it was lovely to see Morocco do well but the world’s governing body must learn from the lessons</p><p>So this is it. Qatar 2022 has been and gone and there is a lot to reflect on. In terms of the football it was a great tournament with <a href=\"https://www.theguardian.com/football/2022/dec/18/world-cup-final-argentina-france-match-report\">a great final</a>. Argentina were deserved winners for the way they dominated such a large part of the final against France. You could see how they were up for it from the start, with their body language, their tackles, their transitions and the way they used the crowd to create energy.</p><p>And so Lionel Messi got to crown his career with the one trophy he did not have, the big one, and it is what his great career deserves (says someone who has always been on his side in the big Messi-Ronaldo debate).</p> <a href=\"https://www.theguardian.com/football/blog/2022/dec/19/football-qatar-world-cup-fifa-must-do-better-for-2026-anita-asante\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/film/2022/dec/19/robert-de-niro-christmas-presents-shanice-aviles-arrested", "title": "Woman allegedly tries to steal presents under Robert De Niro’s Christmas tree", "date_published": "2022-12-19 16:30:57+00:00", "description": "<p>Shanice Aviles, 30, arrested after allegedly spotted entering actor’s New York City home at 2.45am </p><p>A woman accused of trying to steal actor Robert De Niro’s Christmas presents from under the actor’s Christmas tree in his New York apartment has been arrested, according to local media.</p><p>Police arrested Shanice Aviles, 30, after she was allegedly spotted entering De Niro’s East 65th Street home at 2.45am in Manhattan and charged her with burglary, the ABC7 TV news station <a href=\"https://abc7ny.com/robert-de-niro-robbery-upper-east-side-townhouse-robbed/12589853/\">reported</a>.</p> <a href=\"https://www.theguardian.com/film/2022/dec/19/robert-de-niro-christmas-presents-shanice-aviles-arrested\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/business/2022/dec/19/girl-7-raped-at-thai-factory-supplying-clothes-for-tesco-while-mother-worked", "title": "Girl, 7, raped at Thai factory supplying clothes for Tesco while mother worked", "date_published": "2022-12-19 16:16:47+00:00", "description": "<p>Exclusive: Woman recounts 2018 attack as landmark lawsuit is brought against retailer on behalf of 130 Burmese former workers</p><ul><li><a href=\"https://www.theguardian.com/business/2022/dec/19/how-big-brands-like-tesco-are-drawn-to-wild-west-of-global-supply-chain\">Analysis: How big brands like Tesco are drawn to ‘wild west of global supply chain’</a></li></ul><p>A seven-year-old girl was raped in insecure accommodation at a factory producing clothes for Tesco in Thailand while her mother sewed F&amp;F jeans late in the evening, it has been revealed.</p><p>Her mother said she had been working unpaid overtime until 10pm, after which she returned to her room to find her daughter bleeding and in distress, having been raped by a colleague.</p> <a href=\"https://www.theguardian.com/business/2022/dec/19/girl-7-raped-at-thai-factory-supplying-clothes-for-tesco-while-mother-worked\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/19/rwanda-deportation-scheme-legal-shameful-britain-asylum-seekers", "title": "The Rwanda deportation scheme might be legal, but it remains deeply shameful | Michela Wrong", "date_published": "2022-12-19 16:03:54+00:00", "description": "<p>Britain’s plan to send asylum seekers to Rwanda has got the go-ahead just as the African country edges towards ‘pariah state’ territory</p><p>So the game is on, once again. Six months after a last-minute intervention by the European court of human rights <a href=\"https://www.theguardian.com/uk-news/2022/jun/14/european-court-humam-right-makes-11th-hour-intervention-in-rwanda-asylum-seeker-plan\">prevented a flight</a> carrying seven migrants from taking off for Kigali, the Home Office’s Rwanda asylum-processing deal is back in play, thanks to today’s ruling <a href=\"https://www.theguardian.com/uk-news/2022/dec/19/asylum-seekers-rwanda-uk-plan-legal-high-court\">in favour of the scheme</a> by Lord Justice Lewis and Mr Justice Swift.</p><p>A summer of political turmoil – which saw the exits of both the scheme’s originator, Priti Patel, and its enthusiastic supporter Boris Johnson – had offered the government a precious chance to shelve the policy, which even some Conservative stalwarts regard as <a href=\"https://www.theguardian.com/uk-news/2022/sep/04/refugees-minister-refused-endorse-rwanda-policy-quits-richard-harrington\">morally distasteful</a> and legally questionable.</p><p>Michela Wrong is the author of Do Not Disturb: The Story of a Political Murder and an African Regime Gone Bad, published by HarperCollins</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/19/rwanda-deportation-scheme-legal-shameful-britain-asylum-seekers\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/politics/2022/dec/19/ppe-medpro-uk-government-issues-breach-of-contract-proceedings", "title": "PPE Medpro: UK government issues breach of contract proceedings", "date_published": "2022-12-19 16:03:47+00:00", "description": "<p>Firm that Michelle Mone lobbied for says case over supply of sterile gowns will be ‘rigorously defended’</p><p>The UK government has commenced legal action to recover more than £100m from the company that was awarded two large PPE contracts after the Conservative peer Michelle Mone lobbied ministers.</p><p>The claim, confirmed by the Department of Health and Social Care (DHSC), is for the full £122m paid to the company, PPE Medpro, under a contract for it to supply 25m sterile surgical gowns that was awarded in June 2020. The DHSC is also seeking to recover the costs of storing and disposing of the gowns, which its officials rejected after an inspection when they arrived at the NHS depot in Daventry.</p> <a href=\"https://www.theguardian.com/politics/2022/dec/19/ppe-medpro-uk-government-issues-breach-of-contract-proceedings\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/19/male-mason-wasps-genital-spines-thwart-predators-study", "title": "Male mason wasps use genital spines to thwart predators, study reveals", "date_published": "2022-12-19 16:00:22+00:00", "description": "<p>Wasps seen piercing the mouth or other parts of tree frogs with their sharp weapon when being attacked</p><p>Kipling might well have believed that the female of the species is more deadly than the male, but when it comes to mason wasps, the latter have quite the weapon.</p><p>Researchers in Japan have discovered that male mason wasps use sharp spines on their genitalia to resist being swallowed by predators.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/19/male-mason-wasps-genital-spines-thwart-predators-study\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/19/didier-deschamps-deserves-credit-despite-france-losing-world-cup-final-qatar-2022", "title": "Didier Deschamps deserves credit despite France losing World Cup final", "date_published": "2022-12-19 15:58:30+00:00", "description": "<p>Given all of the upheaval France faced before and during the tournament, the coach helped his team to exceed expectations</p><p>By <a href=\"https://twitter.com/_adam_white_\">Adam White</a> for <a href=\"https://www.getfootballnewsfrance.com/\">Get French Football News</a></p><p>Eric Cantona once dismissed Didier Deschamps as a<em> </em>“water carrier”. Michel Platini, meanwhile, suggested he was so lucky he must have been “blessed by holy water at birth”. After a chaotic buildup to the World Cup, an abject opening 80 minutes to the final and a heavy reliance on Kylian Mbappé’s brilliance to drag France <a href=\"https://www.theguardian.com/football/2022/dec/18/world-cup-final-argentina-france-match-report\">to a barely deserved penalty shootout</a>, it might be easy to dismiss Deschamps and his team in similar terms. However, the tournament only proved that France are a match for any side and their manager understands international football as well as anyone.</p><p>The final did expose structural weaknesses in this version of Deschamps’ team, which was heavily affected by injuries that had been clear to see throughout the tournament but sidestepped in previous games. These issues will need to be worked on, as – much like <a href=\"https://www.theguardian.com/football/2022/dec/10/england-france-world-cup-quarter-final-match-report\">England’s considered control</a> and <a href=\"https://www.theguardian.com/football/2022/dec/14/france-morocco-world-cup-semi-final-match-report\">Morocco’s ferocity</a> in previous rounds – Argentina’s early intensity meant France were unable to impose their gameplan.</p> <a href=\"https://www.theguardian.com/football/2022/dec/19/didier-deschamps-deserves-credit-despite-france-losing-world-cup-final-qatar-2022\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/uk-news/2022/dec/19/second-woman-dies-after-brixton-asake-concert-crush", "title": "Second woman dies after Brixton concert crush", "date_published": "2022-12-19 15:50:35+00:00", "description": "<p>Gabrielle Hutchinson, 23, was working in security role at venue, police say</p><p>A second woman has died after a crowd crush last week outside the O2 Academy Brixton.</p><p>Gabrielle Hutchinson, 23, was working in a security role at the venue on the night of an Asake gig, the Metropolitan police said.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/19/second-woman-dies-after-brixton-asake-concert-crush\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/19/joe-kennedy-iii-northern-ireland-us-economic-envoy", "title": "Joe Kennedy III named as US economic envoy to Northern Ireland", "date_published": "2022-12-19 15:47:26+00:00", "description": "<p>Appointment of former congressman and grandson of Robert Kennedy comes amid transatlantic tension over post-Brexit trade</p><p>Joe Kennedy III, the 42-year-old scion of one of America’s most famous political families, has agreed to serve as the special envoy to Northern Ireland for economic affairs, the US state department announced on Monday.</p><p>The former Massachusetts congressman and grandson of US attorney general Robert F Kennedy is replacing Mick Mulvaney, a former White House chief of staff under Donald Trump, who stepped down from the role last year.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/19/joe-kennedy-iii-northern-ireland-us-economic-envoy\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/19/messi-inter-miami-transfer-world-cup", "title": "Messi to Miami: an MLS masterstroke or Beckham’s biggest gamble?", "date_published": "2022-12-19 15:30:42+00:00", "description": "<p>The MLS side is reportedly confident of landing Argentina’s World Cup hero this summer. But is signing the 35-year-old right for Inter Miami and the league? </p><p>While Lionel Messi was busy completing his career odyssey in the most dramatic fashion, David Beckham watched from the stands, hopeful his Inter Miami team could land its very own unicorn.</p><p>The Major League Soccer franchise is <a href=\"https://www.thetimes.co.uk/article/lionel-messi-set-to-agree-deal-to-join-inter-miami-next-season-9nmgt3dd7\">reportedly</a> “confident” of signing Messi following the 2022-23 European season, and “close” to a deal making him the highest-paid player in MLS history.</p> <a href=\"https://www.theguardian.com/football/2022/dec/19/messi-inter-miami-transfer-world-cup\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/19/my-balance-is-on-zero-young-europeans-on-their-first-experience-of-inflation", "title": "‘My balance is on zero’: young Europeans on their first experience of inflation", "date_published": "2022-12-19 15:30:22+00:00", "description": "<p>High rents, low pay and spiralling food costs have left younger workers  struggling to make ends meet and worried about the future</p><p>In May 2021, while much of the world was still navigating Covid-19, the <a href=\"https://www.oecd.org/employment/youth/The-Updated-OECD-Youth-Action-Plan.pdf\">OECD warned</a> that young people were being disproportionately hit by the crisis and that there was a risk of “long-term scarring” on their careers and on their economic outcomes. <a href=\"https://www.oecd.org/coronavirus/policy-responses/delivering-for-youth-how-governments-can-put-young-people-at-the-centre-of-the-recovery-92c9d060/\">It also found</a> that many young people were suffering from increased instances of depression and anxiety about jobs and personal finances. These worries have not gone away but the inflated cost of living rather than the pandemic, appears now to be acting as the main drag on younger lives. Across the continent, under-30s find their ambitions frustrated by worsening economic conditions. Some of them spoke about the pressures they face in making ends meet, often while juggling work and studies. </p> <a href=\"https://www.theguardian.com/world/2022/dec/19/my-balance-is-on-zero-young-europeans-on-their-first-experience-of-inflation\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/games/2022/dec/19/fortnite-epic-games-pay-fine-ftc-privacy-billing", "title": "Fortnite video game maker to pay $520m over privacy and billing claims", "date_published": "2022-12-19 15:29:00+00:00", "description": "<p>Epic Games agrees with FTC to pay $275m fine for collecting data on children and refund customers $245m for deceptive practices</p><p>The video game company Epic Games will pay a total of $520m in penalties and refunds to settle complaints involving children’s privacy and methods that tricked players into making purchases, US federal regulators said on Monday.</p><p>The Federal Trade Commission (FTC) said that it had secured the record-breaking settlements for two cases from Epic Games, which makes the popular game Fortnite.</p> <a href=\"https://www.theguardian.com/games/2022/dec/19/fortnite-epic-games-pay-fine-ftc-privacy-billing\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/19/fifa-qatar-lionel-messi-football-emir-bisht-world-cup", "title": "I hate that Fifa and Qatar exploited Lionel Messi’s genius. But I’ll cherish the football | Mihir Bose", "date_published": "2022-12-19 15:28:05+00:00", "description": "<p>The cloaking of Argentina’s hero in a bisht was a public rebuke to critics. But we’ll forget that, and celebrate the amazing World Cup games</p><p>The World Cup has left us with two images of Lionel Messi. One is of him in his Argentinian team shirt, holding up the trophy. The other is of the <a href=\"https://www.theguardian.com/football/2022/dec/18/qatar-2022-dishes-up-sporting-surprise-and-a-coronation-for-lionel-messi\">emir of Qatar</a>, Sheikh Tamim bin Hamad al-Thani, putting the traditional Arab men’s cloak, the black <em>bisht</em>, round Messi, just before he receives the trophy. The second image showed the rich state, which had bought the World Cup, rubbing in the world’s noses in it. It should always be an indelible reminder us of what happens when sports organisations give in to the power of money.</p><p>But the other image tells a story we can all associate with. In <a href=\"https://www.theguardian.com/football/2022/dec/18/world-cup-final-argentina-france-match-report\">a final</a> that ranks as the greatest ever, the greatest player finally wins the one trophy missing from his collection and joins the pantheon of the game’s legends, Pelé and Maradona. The climaxing of the competition reminded us that football can still produce magic, mystery and enthralling drama, and provide the most unexpected twists and turns that uplift us, and, for a few brief hours, make us connect us with strangers.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/19/fifa-qatar-lionel-messi-football-emir-bisht-world-cup\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/tv-and-radio/2022/dec/19/ncuti-gatwa-vintage-doctor-who-look-shows-60-year-history", "title": "Ncuti Gatwa’s vintage Doctor Who look honours show’s 60-year history", "date_published": "2022-12-19 15:11:54+00:00", "description": "<p>New Time Lord pairs brown chequered suit with a bright orange jumper and tan brogues</p><p>In a dapper suit and colourful jumper, the latest Doctor looks like he could have stepped straight off a Gucci runway. <br /><br />Introducing the 15th doctor, played by Ncuti Gatwa, the first images from the BBC have been released.</p><p>Gatwa, who takes control of the Tardis in 2023, pairs his brown chequered suit with a bright orange jumper and tan coloured brogues, all colours with vintage appeal that give a nod to the show’s 60-year history. <br /><br />With flowy outerwear key to the Doctor’s look, Gatwa’s costume honours the Time Lord’s roots.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/19/ncuti-gatwa-vintage-doctor-who-look-shows-60-year-history\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/news/gallery/2022/dec/19/celebrations-in-buenos-aires-and-hanukkah-monday-best-photos-in-pictures", "title": "Celebrations in Buenos Aires and Hanukkah: Monday’s best photos – in pictures", "date_published": "2022-12-19 15:00:57+00:00", "description": "<p>The Guardian’s picture editors select photo highlights from around the world</p> <a href=\"https://www.theguardian.com/news/gallery/2022/dec/19/celebrations-in-buenos-aires-and-hanukkah-monday-best-photos-in-pictures\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/19/climate-goal-15c-gasping-breath-un-head-antonio-guterres", "title": "Climate goal of 1.5C is ‘gasping for breath’, says UN head", "date_published": "2022-12-19 15:00:21+00:00", "description": "<p>António Guterres announces a climate ambition summit to confront ‘existential threat’ facing the planet</p><p>The goal of limiting global heating to 1.5C is “gasping for breath”, the UN secretary general has said as he announced a “climate ambition summit” for September.</p><p>António Guterres said the summit would challenge leaders of governments and businesses to come up with “new, tangible and credible climate action to accelerate the pace of change” and confront the “existential threat” of the climate crisis.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/19/climate-goal-15c-gasping-breath-un-head-antonio-guterres\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/19/dutch-pm-apologises-for-netherlands-role-in-slave-trade", "title": "Dutch PM apologises for Netherlands’ role in slave trade", "date_published": "2022-12-19 14:59:36+00:00", "description": "<p>Mark Rutte says Dutch state ‘enabled, encouraged and profited from slavery’ for centuries</p><p>Mark Rutte has offered a formal apology on behalf of the Dutch state for the Netherlands’ historical role in the slave trade, saying slavery must be recognised in “the clearest terms” as “a crime against humanity”.</p><p>In a speech at the national archives in The Hague on Monday, the Dutch prime minister acknowledged that the past “cannot be erased, only faced up to”. But for centuries, he said, the Dutch state had “enabled, encouraged and profited from slavery”.</p> <a href=\"https://www.theguardian.com/world/2022/dec/19/dutch-pm-apologises-for-netherlands-role-in-slave-trade\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/society/2022/dec/19/patients-in-north-west-england-have-to-get-themselves-to-ae-during-ambulance-strikes", "title": "Patients in north-west England have to get themselves to A&E during strikes", "date_published": "2022-12-19 14:43:50+00:00", "description": "<p>Exclusive: NWAS letter says  ambulance will come only if a patient is having a cardiac arrest or if there is immediate risk of them dying</p><ul><li><a href=\"https://www.theguardian.com/politics/live/2022/dec/19/union-leaders-dismiss-talks-avert-ambulance-strike-nhs-uk-politics-live\">UK politics live – latest news updates</a></li></ul><p>Sick patients across the north-west of England will have to get themselves to A&amp;E or take a taxi from GP surgeries, walk-in centres and care homes during this week’s ambulance strike.</p><p>In a letter on Monday, the <a href=\"https://www.nwas.nhs.uk/about/who/\">North West Ambulance Service (NWAS)</a> has warned GPs and hospitals that the loss of so many of its crews as a result of the pay dispute walkout will significantly restrict the service it can offer to the public.</p> <a href=\"https://www.theguardian.com/society/2022/dec/19/patients-in-north-west-england-have-to-get-themselves-to-ae-during-ambulance-strikes\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/19/violent-misogynic-fantasies-meghan-jeremy-clarkson-sun", "title": "Violent misogynistic fantasies like Jeremy Clarkson’s are not new – but the Sun gleefully publishing them is | Zoe Williams", "date_published": "2022-12-19 14:31:48+00:00", "description": "<p>The diatribe against Meghan shows how low the rightwing media is willing to go</p><p>What good can possibly come of reacting to Jeremy Clarkson? It is his manifest purpose, his life’s work to rile the right-thinking, so that he can laugh at humourless libtards. It was all for this that he <a href=\"https://www.theguardian.com/media/2022/dec/18/jeremy-clarkson-condemned-meghan-column-the-sun\">wrote in the Sun</a> of his “cellular level” loathing for the Duchess of Sussex; trotted out a tired Game of Thrones cliche, fantasising about her being paraded naked down the street, while people hurled excrement at her; described her marital relationship as her hand in “her ginger glove puppet”.</p><p>He seemingly pinballed from one sexist, racist trope to another – the implication from his column being that Meghan is the manipulator, the voodoo priestess, the narcissist, the liar, the bewitcher, the polluter – for one purpose, which was to get people up in arms. Many public figures – from <a href=\"https://twitter.com/carolvorders/status/1604381985203519488?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet\">Carol Vorderman</a> to Philip Pullman – took to social media to express their horror at these essentially violent fantasies.</p><p>Zoe Williams is a Guardian columnist</p><p><em><strong>Do you have an opinion on the issues raised in this article? If you would like to submit a response of up to 300 words by email to be considered for publication in our <a href=\"https://www.theguardian.com/letters\">letters</a> section, please <a href=\"mailto:mailto:guardian.letters@theguardian.com?body=Please%20include%20your%20name,%20full%20postal%20address%20and%20phone%20number%20underneath%20your%20letter.%20Letters%20are%20usually%20published%20with%20the%20author’s%20name%20and%20city/town/village.%20The%20rest%20of%20the%20information%20is%20for%20verification%20only%20and%20to%20contact%20you%20if%20your%20letter%20is%20used.\">click here</a>.</strong></em></p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/19/violent-misogynic-fantasies-meghan-jeremy-clarkson-sun\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/food/2022/dec/19/why-drink-eggnog-when-you-could-eat-it-10-deliciously-custardy-recipes-from-eggnog-ice-cream-to-eggnog-brownies", "title": "Why drink eggnog when you could eat it? 10 deliciously custardy recipes, from eggnog ice-cream to eggnog brownies", "date_published": "2022-12-19 14:29:42+00:00", "description": "<p>What do you get when you cook with eggs, cream and the occasional shot of booze? That’s right – Christmas on a plate</p><p>Unless you’re American, eggnog is a tough sell. Necking raw egg, albeit sweetened and mixed with cream, is something you can probably only do if you’ve been brought up in a very specific culture (or you happen to be on an absurd protein kick). Things get even less appealing when alcohol is involved, as eggnog often comes spiked with some amount of brown spirit, because then it becomes a hellish hybrid of booze and hangover cure in one. But maybe nog newcomers are going in too hot. After all, what is eggnog if not a weird sort of custard? And what is custard, if not a woefully underused recipe ingredient? That’s right: forget about drinking eggnog. This year I want you to eat it. And here’s how.</p> <a href=\"https://www.theguardian.com/food/2022/dec/19/why-drink-eggnog-when-you-could-eat-it-10-deliciously-custardy-recipes-from-eggnog-ice-cream-to-eggnog-brownies\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/19/machu-picchu-american-tourists-peru-protests", "title": "Americans among tourists trapped at Machu Picchu by Peru protests", "date_published": "2022-12-19 14:07:38+00:00", "description": "<p>Helicopter evacuation from Inca citadel in Andes planned as supporters of ousted president Pedro Castillo block train tracks</p><p>Scores of tourists in <a href=\"https://www.theguardian.com/world/peru\">Peru</a> are trapped in and around the Inca citadel of Machu Picchu after political protesters blocked trains that run to the Andes city of Cuzco from the site.</p><p>Travelers, including some Americans, were trapped after train tracks were blocked with rocks, according to eyewitness accounts. “The Government of Peru is organizing an evacuation via four helicopters of the most vulnerable foreign tourists from Aguas Calientes/Machu Picchu Village,” the US embassy in Lima said on Saturday.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/19/machu-picchu-american-tourists-peru-protests\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/media/2022/dec/19/rupert-murdoch-ipso-chair-despite-complaints-jeremy-clarkson-meghan", "title": "Murdoch was due to host Ipso chair despite complaints about Clarkson’s Meghan comments", "date_published": "2022-12-19 14:04:44+00:00", "description": "<p>Exclusive: Lord Faulks oversees regulator that will ultimately have to rule on whether Sun broke guidelines</p><p>Rupert Murdoch was due to host the UK’s chief press regulator for a private dinner at his Mayfair flat on Monday night, despite thousands of people registering formal complaints about Jeremy Clarkson’s column in the Sun.</p><p>Edward Faulks had been due to attend the soiree with Murdoch and other executives from his News UK company at the billionaire’s flat in central London, according to sources. This was despite Lord Faulks’s role as chair of the Independent Press Standards Organisation (Ipso), the organisation that regulates Murdoch’s newspapers.</p> <a href=\"https://www.theguardian.com/media/2022/dec/19/rupert-murdoch-ipso-chair-despite-complaints-jeremy-clarkson-meghan\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/society/2022/dec/20/its-never-too-late-how-to-live-better-with-menopause", "title": "It’s never too late: how to live better with menopause | Natalie Parletta", "date_published": "2022-12-19 14:00:22+00:00", "description": "<p>The onset of menopause comes with a myriad of symptoms that affect many women differently. But even a difficult transition will eventually settle down</p><p></p><p>As sure as the sun sets each day, every woman who enters her fifth decade will experience menopause, if she hasn’t <a href=\"https://theconversation.com/it-changed-who-i-felt-i-was-women-tell-of-devastation-at-early-menopause-diagnosis-176015\">hit it</a> already. For this new life stage, the ovaries run out of eggs and no longer need to produce the hormones that prepare our bodies for making babies. But the effects reach far beyond reproduction.</p><p>“We call them sex hormones: our oestrogen, our testosterone and progesterone,” says <a href=\"https://www.verawomenswellness.com.au/dr-peta-wright\">Dr Peta Wright</a>, a gynaecologist, “but it’s kind of crazy that we call them that because they actually have an effect everywhere in the body, which every woman who has gone through menopause, or in fact has a menstrual cycle, will be able to tell you about”.</p> <a href=\"https://www.theguardian.com/society/2022/dec/20/its-never-too-late-how-to-live-better-with-menopause\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/live/2022/dec/19/jan-6-hearing-trump-criminal-charges-referral-committee-vote-live-updates", "title": "January 6 panel to hold final public hearing and vote on referrals against Trump – live", "date_published": "2022-12-19 13:38:00+00:00", "description": "<p>Panel to vote to recommend referral to the justice department for criminal charges against the former president</p><ul><li><a href=\"https://www.theguardian.com/info/2018/sep/17/guardian-us-morning-briefing-sign-up-to-stay-informed\">Sign up to receive First Thing – our daily briefing by email</a></li></ul><p><strong>Good morning blog readers, for what promises to be a momentous day in US politics.</strong></p><p>It’s a long-awaited moment of reckoning for <strong>Donald Trump</strong> as the January 6 House panel investigating his efforts to overturn his 2020 election defeat <a href=\"https://www.theguardian.com/us-news/2022/dec/18/january-6-committee-last-meeting-donald-trump\">meets in public for the final time</a>, and votes to recommend referral to the justice department for criminal charges against the former president.</p><p>Chief of the Capitol police <strong>Thomas Manger</strong> testifies on the security of Congress members at an afternoon meeting of the Senate’s rules and administration committee.</p><p><strong>Joe Biden</strong> meets with Ecuador’s president <strong>Guillermo Lasso</strong> at lunchtime.</p><p>White House press secretary <strong>Karine Jean-Pierre</strong> will brief reporters at 2.30pm.</p> <a href=\"https://www.theguardian.com/us-news/live/2022/dec/19/jan-6-hearing-trump-criminal-charges-referral-committee-vote-live-updates\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/19/new-jersey-republican-daughter-absentee-ballot-tom-baio", "title": "New Jersey Republican seeks to throw out daughter’s absentee ballot for rival", "date_published": "2022-12-19 13:19:51+00:00", "description": "<p>Tom Baio, an incumbent member of the Mendham township committee, lost his bid by three votes to Democrat Laura Spirig</p><p>A local Republican elected officeholder from New Jersey is looking to throw out the absentee ballot of his daughter who voted for his Democratic opponent, according to a recent <a href=\"https://www.newjerseyhills.com/observer-tribune/news/mendham-twp-committee-ballots-filed-by-dems-and-questioned-by-republicans-include-one-from-gop/article_8d39c762-7cbc-11ed-976e-cf022fb2e645.html\">report</a>.</p><p>On Friday, the Observer-Tribune reported that Tom Baio, an incumbent member of New Jersey’s Mendham township committee, lost his bid by three votes to Laura Spirig, his <a href=\"https://www.theguardian.com/us-news/democrats\">Democratic</a> challenger during the 8 November midterm elections.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/19/new-jersey-republican-daughter-absentee-ballot-tom-baio\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/19/cricket-pakistan-england-third-test-day-three-report", "title": "Rehan Ahmed makes history as England power towards clean sweep in Pakistan", "date_published": "2022-12-19 13:04:37+00:00", "description": "<ul><li><a href=\"https://www.theguardian.com/sport/cricket/match/2022-12-19/england-cricket-team\">Third Test, day three: Pakistan 304 &amp; 216; England 354 &amp; 112-2</a></li><li>Spinner becomes youngest to take five-for on men’s Test debut</li></ul><p>On a tour of Pakistan that has thrown up an abundance of magical moments for England’s rejuvenated Test team, it may well be that the sight of Rehan Ahmed dropping to the dusty soil of Karachi to offer a prayer of thanks topped the lot.</p><p>At 18 years and 128 days, Ahmed had just broken the record held by Australia’s Pat Cummins and become the youngest Test cricketer in history to take a five-wicket haul on debut. Some 48 hours on from <a href=\"https://www.theguardian.com/sport/2022/dec/17/history-maker-rehan-ahmed-calls-england-debut-the-best-day-of-my-life\">hailing the best day of his life</a>, the leg-spinner had a new contender for the title and with it, more importantly, set his team on course for what would be a first series clean sweep in Pakistan.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/19/cricket-pakistan-england-third-test-day-three-report\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/food/2022/dec/19/brandy-prune-fool-chocolate-bark-recipe-thomasina-miers", "title": "Thomasina Miers' recipe for brandy and prune fool with chocolate bark | The new flexitarian", "date_published": "2022-12-19 13:00:18+00:00", "description": "<p>A festive glassful featuring prunes soaked in armagnac, then pureed, layered with vanilla and brandy cream, and topped with chocolate shards</p><p>The French have long been wise to the pleasures of prunes but in Britain we seem to overlook them. Growing up, my mother would work wonders with Agen prunes, gently poaching them for various glorious concoctions. Cut to a French exchange in Paris when I had a prunes and armagnac ice-cream alongside a scoop of dark chocolate, from a shop on Île Saint-Louis. The flavours are still etched in my memory, and inspired this delectable pudding.</p> <a href=\"https://www.theguardian.com/food/2022/dec/19/brandy-prune-fool-chocolate-bark-recipe-thomasina-miers\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/19/world-cup-2022-team-of-the-tournament-martinez-mbappe", "title": "From Martínez to Mbappé: a World Cup 2022 team of the tournament", "date_published": "2022-12-19 12:39:49+00:00", "description": "<p>We select an XI, in a 4-3-3, that includes three players from surprise semi-finalists Morocco and one from England</p><p><a href=\"https://www.theguardian.com/football/2022/dec/12/sliding-doors-moment-has-taken-bono-to-the-brink-of-world-cup-immortality\">Bono</a> and <a href=\"https://www.theguardian.com/football/2022/dec/13/dominik-livakovic-ready-to-repeat-heroics-against-argentina-world-cup\">Dominik Livakovic</a> can count themselves unlucky to miss out. Ultimately Martínez came through in the big moments for the winners. There was the last-gasp save against Australia, shootout heroics against France and the Netherlands, and a huge stop to deny Randal Kolo Muani in the last minute of the final.</p> <a href=\"https://www.theguardian.com/football/2022/dec/19/world-cup-2022-team-of-the-tournament-martinez-mbappe\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/books/2022/dec/19/the-big-idea-why-we-need-to-make-the-world-a-darker-place", "title": "The big idea: Why we need to make the world a darker place", "date_published": "2022-12-19 12:30:18+00:00", "description": "<p>It’s not just bats and other animals that suffer the effects of light pollution – humans need darkness too</p><p>Every year, deep in certain Swedish mines, the bat population is recorded. Each time I take part in the count, I turn out the light for a moment inside the darkness of the mountain to experience the unique sensation of stillness. I’ve started to try to bring that experience with me out of the mine and into my everyday life. Whenever I get the chance, I switch off for a little while and sit in the dark. In an armchair, in the garden, or in the forest. It’s rare that the darkness is as dense and compact as it is in the underworld of the mine passages, but a dark room or an unlit forest path grants the same kind of rest. Darkness is a pause from the constant flood of impressions, it’s a visual silence – and a sort of primitive experience – in the otherwise too well-illuminated modern world.</p><p>For bats, darkness isn’t a form of respite: it’s essential. This animal, which has looked roughly the same for at least 55 million years, has always been nocturnal. None of the 1,400 bat species alive today have acclimatised to the brightest hours of daytime. Darkness is their security, and their senses are formed accordingly. For humans, it’s the opposite: we’re a highly diurnal animal, dependent on sense impressions; light is our safety. Being afraid of the dark is woven deep within our genetic and cultural inheritance and it isn’t strange that today we light up the gardens of our houses, industrial areas and carparks. Humanity has extended the day past dusk and into the night, all the while squeezing out those that seek the darkest corners.</p> <a href=\"https://www.theguardian.com/books/2022/dec/19/the-big-idea-why-we-need-to-make-the-world-a-darker-place\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/19/the-football-daily-christmas-awards-2022", "title": "The Football Daily Christmas Awards 2022", "date_published": "2022-12-19 12:29:46+00:00", "description": "<p><a href=\"https://www.theguardian.com/info/2016/jan/05/the-fiver-email-sign-up\">Give the one you love something special this year: a free subscription to Football Daily. The gift that never starts giving</a></p><p><strong>Welcome to the very first Football Daily Christmas Awards.</strong> This is the bit where, in our old guise, we would bang on about becoming so jaded that we’d lost count of how many years we’d been churning out this old tat. Hmm, all of a sudden, the penny’s beginning to drop. So OK, here we are, refreshed and ready to go! Pour yourself a pint of wine, throw your boots up on the desk, decompress, de-depress, and <a href=\"https://www.youtube.com/watch?v=CK6jKL2qWxo\">sing along</a>: <em>♫♪ It feels like the first time, it feels like the very first time … ♫♪♫</em></p> <a href=\"https://www.theguardian.com/football/2022/dec/19/the-football-daily-christmas-awards-2022\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/uk-news/2022/dec/19/rail-strikes-christmas-eve-trains-network-rail-end-departures", "title": "Rail strikes: Christmas Eve passenger trains to end by 3pm, says Network Rail", "date_published": "2022-12-19 12:23:19+00:00", "description": "<p>Long-distance departures between many big cities will leave in the morning</p><p>Passenger trains on Christmas Eve will finish by 3pm because of strikes, Network Rail has warned, with the last long-distance departures between many big cities leaving in the morning.</p><p>The last train from Edinburgh to London will leave at 8am, and from Manchester to London at 12.15pm. No trains will connect the capital and Nottingham or Sheffield on Christmas Eve.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/19/rail-strikes-christmas-eve-trains-network-rail-end-departures\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/19/belarus-ukraine-war-putin-meets-lukashenko", "title": "Fears Belarus will be drawn into Ukraine war as Putin meets Lukashenko", "date_published": "2022-12-19 12:02:03+00:00", "description": "<p>Belarusian leader stresses country’s independence as Russian president makes first visit since 2019</p><ul><li><a href=\"https://www.theguardian.com/world/live/2022/dec/19/russia-ukraine-war-live-news-drone-strike-on-kyiv-uk-to-announce-new-artillery-package\">Russia-Ukraine war: latest updates</a></li></ul><p>Vladimir Putin travels to Belarus on Monday to meet the Belarusian leader, Alexander Lukashenko, as fears grow in Kyiv that Moscow is pushing its closest ally to join a new ground offensive against Ukraine.</p><p>In the run-up to the meeting, which will be Putin’s first visit to Belarus since 2019, Lukashenko said the two leaders would discuss the “military-political situation” in the region as well as economic cooperation.</p> <a href=\"https://www.theguardian.com/world/2022/dec/19/belarus-ukraine-war-putin-meets-lukashenko\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/19/steve-borthwick-england-rugby-union-head-coach-replace-eddie-jones", "title": "England appoint Steve Borthwick as new head coach to replace Eddie Jones", "date_published": "2022-12-19 12:00:47+00:00", "description": "<ul><li>Former captain was England’s forwards coach under Jones</li><li>Kevin Sinfield joins national setup as defence coach</li></ul><p>Steve Borthwick has been appointed as England’s new head coach following the dismissal of Eddie Jones, with Kevin Sinfield joining the national setup as his defence coach.</p><p>A former England captain, the 43-year-old Borthwick has been head coach at Leicester Tigers since February 2020, and <a href=\"https://www.theguardian.com/sport/2022/jun/18/leicester-saracens-premiership-final-freddie-burns\">led the club to the Premiership</a> title in the 2021-22 season. He was the RFU’s No 1 target after the exit of Jones and it has taken a seven-figure deal compensation package for the Tigers to secure his services.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/19/steve-borthwick-england-rugby-union-head-coach-replace-eddie-jones\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/film/2022/dec/19/best-movies-of-2022-in-the-us-no-5-rrr", "title": "Best movies of 2022 in the US: No 5 – RRR", "date_published": "2022-12-19 12:00:17+00:00", "description": "<p>An epic tale of two Indian revolutionaries told in all its plot-twisting, tiger-fighting, action-packed glory makes for a joyous, often ludicrous movie of air-punching brilliance</p><ul><li><a href=\"https://www.theguardian.com/film/2022/dec/06/the-50-best-movies-films-of-2022-in-the-us\">50 best movies of 2022 in the US</a></li><li><a href=\"https://www.theguardian.com/culture/series/2022-in-culture\">More on the best culture of 2022</a></li></ul><p>Sometimes, quantity can be quality. This bracing Indian epic is told in such massive strokes, it made every other action movie this year look timid and unambitious. Where else could you find an anticolonialist dance number, a prison breakout involving a man wielding two rifles while being carried on his friend’s shoulders, or a hero ambushing his enemies’ palace by crashing a truck through the gates and leaping out the back, a flaming torch in each hand, alongside a menagerie of tigers, leopards and other wild animals – in slow motion? The movie is jam-packed with surreally bonkers yet brilliantly orchestrated moments like this, and it’s an utter joy.</p><p>Nothing about RRR is small: the size of the crowd scenes, the scale of the battles, the sadistic villainy of the British, the three-hour running time. It was the most expensive Indian movie ever made (an estimated $72m) and it shows. The story is set in the 1920s, during the British Raj, and parallels the journeys of two men who are opposed politically, yet similar in their unbreakable determination and superheroic athleticism. One is Komaram Bheem (NT Rama Rao Jr), who goes to Delhi in search of a girl stolen from his village by the British. The other is Alluri Sitarama Raju (Ram Charan), an Indian Imperial Police officer who is determined to rise to the top – by finding Bheem. In their dual quests, both men assume secret identities and – irony of ironies – they become best buddies! But the bromance is destined not to last.</p> <a href=\"https://www.theguardian.com/film/2022/dec/19/best-movies-of-2022-in-the-us-no-5-rrr\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/19/how-jess-carter-met-ann-katrin-berger-as-far-as-i-knew-i-thought-i-was-straight", "title": "How Jess Carter met Ann-Katrin Berger: ‘As far as I knew I thought I was straight’", "date_published": "2022-12-19 12:00:17+00:00", "description": "<p>Carter, 25 and Berger, 32, met when they both played for Birmingham City in 2016. They were flatmates before things got more serious and now live together in London</p><p>Ann-Katrin Berger met Jess Carter when she joined Birmingham City FC in May 2016. Despite being teammates, they didn’t speak much during the first six months. “At the beginning, I thought she was arrogant, but as I got to know her, I found myself really drawn into her character,” says Ann-Katrin.</p><p>At the time, Jess was living at home with her family in Barford, Warwickshire, but was keen to spread her wings. “By 2017 I wanted to move out, and found out that Ann was looking for a housemate,” says Jess. “In February, we moved in together in Solihull.” They quickly became great friends, sharing their passion for football and films. “Jess was chilled and there was no drama at all,” says Ann-Katrin. “We like all the same TV shows, so there’s never any fighting over the remote.”</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/19/how-jess-carter-met-ann-katrin-berger-as-far-as-i-knew-i-thought-i-was-straight\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/tv-and-radio/2022/dec/19/true-crime-podcasts-mandy-matney-murdaugh-murders-hedley-thomas-teachers-pet-interview", "title": "‘There are so many unsolved murders’: the true-crime podcasters reviving cold cases", "date_published": "2022-12-19 11:55:17+00:00", "description": "<p>Mandy Matney’s Murdaugh Murders and Hedley Thomas’s The Teacher’s Pet have recently seen the subjects of their investigations jailed. But why are podcasts doing the work of police, and can the legal system keep up?</p><p>Mandy Matney is tired. It is late November, and she is busy finishing up the 69th episode of her podcast <a href=\"https://murdaughmurderspodcast.com/\">Murdaugh Murders</a>, a true-crime investigation she began in 2019, and which has now evolved into a complex puzzle of unsolved deaths, insurance fraud, drugs, power and murder. The previous day, a jury in Charleston, South Carolina delivered the first guilty verdict related to the case, and Matney was of course there to cover it. “It was super exciting, and really felt like a huge sigh of relief,” she says. “It’s been a crazy couple of weeks.”</p><p>Hedley Thomas knows this feeling well. Earlier this year, he experienced a similar vindication when his 2018 podcast series <a href=\"https://podcasts.apple.com/gb/podcast/the-teachers-pet/id1385379989\">The Teacher’s Pet</a> led to the conviction of former high school PE teacher Chris Dawson for the murder of his wife, Lynette, who disappeared from the couple’s Sydney home 40 years ago. For the past year, Thomas has also been reporting on the murder of another Queensland woman, Shandee Blackburn, and the failings of a DNA laboratory, in <a href=\"https://podcasts.apple.com/gb/podcast/shandees-story/id1589336606\">Shandee’s Story</a>.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/19/true-crime-podcasts-mandy-matney-murdaugh-murders-hedley-thomas-teachers-pet-interview\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/19/lionel-scaloni-transformed-argentina-2022-world-cup-winners-qatar", "title": "Shape-shifting, energy and youth: how Scaloni transformed Argentina", "date_published": "2022-12-19 11:46:53+00:00", "description": "<p>Faced with a crisis after losing the opening game to Saudi Arabia, Argentina’s manager made bold changes which paid off</p><p>Lionel Messi was the first through, cradling the trophy he had barely let go since he set eyes on it. And why not? It is some sight up close, the kind of thing you could hold for ever, that completes you and, in his case, <a href=\"https://www.theguardian.com/football/blog/2022/dec/18/lionel-messi-authors-dramatic-ending-to-the-greatest-story\">completes football too</a>. Next came Rodrigo De Paul. Then the rest, still in their kits, singing and thudding and bouncing and barging into each other, the partition walls almost caving in. Lautaro Martínez had got a fluffy mic from somewhere and was singing into it. Champagne or something fizzy was sprayed around.</p><p>“It doesn’t matter what those fucking journalists say,” they sang as they bounded past those journalists and out of there. “Because here is the national team.” Not just any national team: <a href=\"https://www.theguardian.com/football/2022/dec/18/world-cup-final-argentina-france-match-report\">the world champions</a>. “I had felt it was going to be,” Messi said. “You have to enjoy it.” Over the last month he has done so, more than ever before, which is part of what had brought them to the final although Messi admitted that they had suffered too. But then as Nico Tagliafico insisted: “If you don’t suffer it doesn’t count.”</p> <a href=\"https://www.theguardian.com/football/2022/dec/19/lionel-scaloni-transformed-argentina-2022-world-cup-winners-qatar\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/technology/2022/dec/19/elon-musk-says-step-down-twitter-ceo-poll-tesla", "title": "Elon Musk’s Twitter poll: 10 million say he should step down", "date_published": "2022-12-19 11:42:24+00:00", "description": "<p>Billionaire chief executive of Tesla insists there is no successor in the wings at social media platform</p><ul><li><a href=\"https://www.theguardian.com/business/live/2022/dec/19/elon-musk-polls-twitter-users-over-stepping-down-as-ceo-business-live\">Business live: full coverage and reaction</a></li></ul><p>More than 10 million people have voted in favour of Elon Musk stepping down as the chief executive of Twitter in a poll he posted on the site late on Sunday.</p><p>However, the billionaire, who bought the company and installed himself as its head only 50 days ago, has insisted there is no successor in the wings. “No one wants the job who can actually keep Twitter alive,” <a href=\"https://twitter.com/elonmusk/status/1604628761395138561\">he said</a> on the social network. “There is no successor.”</p> <a href=\"https://www.theguardian.com/technology/2022/dec/19/elon-musk-says-step-down-twitter-ceo-poll-tesla\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/politics/2022/dec/19/jeremy-hunt-spring-budget-plan-15-march", "title": "Jeremy Hunt sets out plan for spring budget on 15 March", "date_published": "2022-12-19 11:40:07+00:00", "description": "<p>Chancellor asks OBR to prepare forecast for first full budget, after post-Truss autumn statement</p><p>Jeremy Hunt is to deliver his first full budget on 15 March next year, giving him the chance to respond to what is expected to be a recession-hit winter for the UK economy.</p><p>The chancellor said on Monday that he had asked the Office for Budget Responsibility to prepare a comprehensive set of forecasts as he sought to further restore the Conservative party’s reputation for financial orthodoxy.</p> <a href=\"https://www.theguardian.com/politics/2022/dec/19/jeremy-hunt-spring-budget-plan-15-march\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/19/arsenal-vivianne-miedema-ruptures-acl-miss-world-cup-injury", "title": "Arsenal’s Vivianne Miedema ruptures ACL and says she will miss World Cup", "date_published": "2022-12-19 11:37:31+00:00", "description": "<ul><li>Netherlands striker ‘absolutely gutted’ and needs surgery </li><li>Arsenal’s Beth Mead also out for long term with cruciate injury </li></ul><p>Arsenal’s Vivianne Miedema has announced she has ruptured an anterior cruciate ligament and has ruled herself out of the Women’s World Cup.</p><p>The Dutch striker was carried off on a stretcher in tears after landing awkwardly during last Thursday’s Champions League game <a href=\"https://www.theguardian.com/football/2022/dec/15/arsenal-through-despite-lyon-loss-but-wait-anxiously-on-miedema-injury\">against Lyon</a>.</p> <a href=\"https://www.theguardian.com/football/2022/dec/19/arsenal-vivianne-miedema-ruptures-acl-miss-world-cup-injury\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/books/2022/dec/19/poem-of-the-week-grey-evening-by-dh-lawrence", "title": "Poem of the week: Grey Evening by DH Lawrence", "date_published": "2022-12-19 11:23:32+00:00", "description": "<p>The desolation of losing a lover inspires a forceful and imaginative lament for their loss</p><p>When you went, how was it you carried with you<br />My missal book of fine, flamboyant Hours?<br />My book of turrets and of red-thorn bowers,<br />And skies of gold, and ladies in bright tissue?<br /><br />Now underneath a blue-grey twilight, heaped<br />Beyond the withering snow of the shorn fields<br />Stands rubble of stunted houses; all is reaped<br />And trodden that the happy summer yields.<br /><br />Now lamps like yellow echoes glimmer among<br />The shadowy stubble of the under-dusk;<br />As farther off the scythe of night is swung<br />Ripe little stars come rolling from their husk.<br /><br />And all the earth is gone into a dust<br />Of greyness mingled with a fume of gold,<br />Timeless as branching lichens, pale as must,<br />Since all the sky has withered and gone cold.<br /><br />And so I sit and scan the book of grey,<br />Feeling the shadows like a blind man reading,<br />All fearful lest I find the last words bleeding:<br />Nay, take this weary Book of Hours away.</p> <a href=\"https://www.theguardian.com/books/2022/dec/19/poem-of-the-week-grey-evening-by-dh-lawrence\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/19/in-2022-i-decided-to-get-away-from-screens-and-read-more-books-it-was-wonderful", "title": "In 2022, I decided to get away from screens and read more books. It was wonderful | Nancy Jo Sales", "date_published": "2022-12-19 11:08:16+00:00", "description": "<p>I set a goal to read 50 books. I almost made it, and once I started it was easier than I thought</p><p>The digital age is changing us in ways we would never expect. If you had told me 20 years ago that I would one day stop reading books, I would have said you were crazy. I’ve always been a reader; from the time I was little, I would hide away somewhere with a book and devour it, often in one sitting. Cut to 2021, when I realized I had only read five books that year, and the previous year, only eight.</p><p>I didn’t have to wonder why. I already knew it was my phone. We see our phone’s own calculation of how many hours we’ve spent on it each day, and we can’t quite believe it. <em>What?</em> Hours, I realized, that I used to spend reading books. So I made a New Year’s resolution for 2022: more books, less phone. I set a goal for myself of fifty books. And I almost made it.</p><p>Nancy Jo Sales is a writer at Vanity Fair and the author of American Girls: Social Media and the Secret Lives of Teenagers and Nothing Personal: My Secret Life in the Dating App Inferno</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/19/in-2022-i-decided-to-get-away-from-screens-and-read-more-books-it-was-wonderful\">Continue reading...</a>", "persistent": true, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/19/co2-emission-figures-road-transport-uk-government-blocks-release", "title": "UK government blocks release of CO2 figures behind transport plan", "date_published": "2022-12-19 11:06:52+00:00", "description": "<p>Exclusive: DfT refuses to publish emission figures, which campaigners say could make new road projects unviable</p><p>The UK government is refusing to release the carbon emission figures behind its transport decarbonisation plan, which campaigners say could make proposed road schemes financially unviable.</p><p>The Department for Transport (DfT) is blocking academics from seeing the figures, which include data on how much car use would have to be reduced in order to reach net zero commitments.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/19/co2-emission-figures-road-transport-uk-government-blocks-release\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/19/social-housing-affordable-secure-accommodation-shortages-stigma", "title": "We had no idea we could get social housing, but it has changed our lives | Nicholas Fearn", "date_published": "2022-12-19 11:03:43+00:00", "description": "<p>My partner and I needed affordable, secure accommodation at a hard time. Too many are missing out due to shortages and stigma</p><p>After living in a cramped bedroom at my parents’ house during the difficult months of lockdown, my partner and I decided we wanted to get a place of our own in early 2021. But, as is the case for so many other young people, there was no way we’d be able to get a mortgage and buy our own property. Neither of us had savings or great credit scores, and I was constantly in and out of work due to poor mental health. When many banks decided to scrap 5% mortgages owing to economic turmoil, saving up for a deposit became impossible.</p><p>At the time, our only viable option seemed to be privately renting, but finding a place wasn’t easy – properties were snapped up before we could make an offer, and the prices were steep. And as someone with autism and anxiety disorder, the possibility of finding the perfect place and then being asked by the landlord to move out caused my anxiety to spiral.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/19/social-housing-affordable-secure-accommodation-shortages-stigma\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/19/california-elderly-prison-losing-memory-release", "title": "An elderly woman in prison is losing her memory. Why won’t California release her?", "date_published": "2022-12-19 11:00:16+00:00", "description": "<p>The parole board’s refusal to free Janet Carter, 69, is part of what advocates warn is a growing humanitarian crisis across the US</p><p>Prison guards stood by as Janet Carter, 69, sat in her wheelchair and tried to explain the gaps in her memory. It was May 2022 and her third time appearing before the California parole board, which would decide whether to free her after 25 years.</p><p>“I can’t remember a whole lot of stuff,” she said when a commissioner asked why she couldn’t articulate what she’d learned in prison programs. Her lawyer later pointed to a doctor’s report that documented some causes: Parkinson’s disease, early dementia, a neurocognitive disorder, chemotherapy and a head injury.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/19/california-elderly-prison-losing-memory-release\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/food/2022/dec/19/rachel-roddy-recipe-zabaione", "title": "Rachel Roddy’s recipe for zabaione", "date_published": "2022-12-19 11:00:16+00:00", "description": "<p>Also known as zabaglione or even sambayon, this boozy, whipped dessert hits the right festive note every time</p><p>What expands but doesn’t fill, and disappears immediately? Zabaione! I have spent far too much time this week thinking about how to riddle what may be my favourite pudding: a boozy, warm, puffed cream. Riddles that turned into terrible jokes after reading Sophia Loren’s wonderful, frisky description of how, in southern Italy, there is a custom of giving newlyweds a good stiff zabaione, “the implication being that the young bride and groom will need all the strength they can get as they put their backs into the first days of wedlock”. </p><p>I made zabaione recently, with a friend who lives in paradise, in a house surrounded by a wild garden, on the edge of <a href=\"https://en.wikipedia.org/wiki/Lake_Maggiore\">Lago Maggiore</a>. While it can be made in advance (and kept in the fridge), we agree it is best made and eaten immediately. So, after a meal of gnocchi and vitello tonnato (which I will write about one day), we stood at her stove in our socks, very Sophia Loren, and set up a double boiler and mixed yolk, sugar and fortified wine.</p> <a href=\"https://www.theguardian.com/food/2022/dec/19/rachel-roddy-recipe-zabaione\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/uk-news/2022/dec/19/asylum-seekers-rwanda-uk-plan-legal-high-court", "title": "Suella Braverman restates Rwanda deportation goal after court ruling", "date_published": "2022-12-19 10:38:36+00:00", "description": "<p>Judges rule policy is legal but rebuke Home Office over attempt to deport eight people in June</p><ul><li><strong><a href=\"https://www.theguardian.com/politics/live/2022/dec/19/union-leaders-dismiss-talks-avert-ambulance-strike-nhs-uk-politics-live\">UK politics live – latest news updates</a></strong></li></ul><p>Suella Braverman has reaffirmed her commitment to sending people seeking refuge in the UK on a one-way ticket to Rwanda after the high court ruled on Monday that the policy was lawful. </p><p>In a judgment that could have major ramifications for Rishi Sunak’s government, an application from asylum seekers, aid groups and a border officials’ union to stop the Conservative government from acting on a deportation agreement with the central African country has been dismissed.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/19/asylum-seekers-rwanda-uk-plan-legal-high-court\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/gallery/2022/dec/19/world-cup-game-by-game-remarkable-photos-qatar-2022", "title": "The World Cup, game by game: remarkable photos from Qatar 2022", "date_published": "2022-12-19 10:23:34+00:00", "description": "<p>We’ve received more than half a million photographs during the tournament – with 30,000 from the World Cup final alone. Our sport photo editor has selected his favourite image from each fixture</p> <a href=\"https://www.theguardian.com/football/gallery/2022/dec/19/world-cup-game-by-game-remarkable-photos-qatar-2022\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/politics/live/2022/dec/19/union-leaders-dismiss-talks-avert-ambulance-strike-nhs-uk-politics-live", "title": "Union leaders dismiss chances of last-minute talks being able to avert ambulance strike – UK politics live", "date_published": "2022-12-19 10:05:56+00:00", "description": "<p>Leaders say ‘there’s no trust left’ between unions and the government as they play down prospect of meaningful talks</p><p></p><p>Labour has renewed its call for the government to open talks with the health unions on pay. <strong>Jonathan Ashworth</strong>, the shadow work and pensions secretary, told Times Radio this morning:</p><p>I think everybody is deeply concerned about NHS staff on strike and the impact that will have on patient care. That is why we want these strikes averted.</p><p>That is why it is incumbent upon ministers to actually engage now in a meaningful negotiation in order to avoid these strikes.</p><p>If someone has a life and limb emergency, they should call 999. And if it’s not that kind of emergency, they will be told to seek different advice.</p><p>If they think they’ve got the kind of emergency where they would usually call 111, then they should do that, or they should consult a GP or pharmacist. They must use the usual routes available to them and take that advice. There may well be alternative advice available to them that wouldn’t ordinarily be the case.</p><p>This is going to be an incredibly challenging and disrupted week, not only because we have the ambulance service coming out on strike across nearly every region, but also because we’ve got these sequential strikes.</p><p>So we’ve got nurses’ industrial action on Tuesday, and then ambulance services on Wednesday, and I think one will impact the other.</p> <a href=\"https://www.theguardian.com/politics/live/2022/dec/19/union-leaders-dismiss-talks-avert-ambulance-strike-nhs-uk-politics-live\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/19/abortion-rights-votes-ballot-initiatives-republican-stop-referendum", "title": "How Republicans are trying to block voters from having a say on abortion", "date_published": "2022-12-19 10:00:16+00:00", "description": "<p>Ballot initiatives have proven a winning strategy for abortion rights activists – but Ohio Republicans want to make it harder for voters </p><p>Ohio advocates hoping to replicate a string of abortion rights victories<strong> </strong>fear being stymied by Republican lawmakers who are attempting to make it harder to pass citizen-initiated constitutional amendments.</p><p>Ballot initiatives put directly to voters have proven a winning strategy for abortion rights activists since Roe v Wade was overturned this summer, with <a href=\"https://www.theguardian.com/world/2022/nov/09/vermont-abortion-vote-first-us-state-constitution\">six referendums</a> delivering favorable results for pro-choice advocates. </p> <a href=\"https://www.theguardian.com/world/2022/dec/19/abortion-rights-votes-ballot-initiatives-republican-stop-referendum\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/19/i-unwrapped-dads-terrible-gift-and-went-off-like-a-catherine-wheel-the-christmas-present-ill-never-forget", "title": "I unwrapped Dad’s terrible gift and went off like a catherine wheel – the Christmas present I’ll never forget", "date_published": "2022-12-19 10:00:16+00:00", "description": "<p>He’d brought a Sainsbury’s carrier bag full of gifts. I can’t stress how unusual this was – ‘out of character’ doesn’t begin to cover it</p><p>It was 2001 and my second and final stepmother was, I think, still trying to civilise my siblings and me – an unbelievably stupid aim. We ranged in age between 10 and 22 when we met her and were already pretty well baked, even the 10-year-old. We spoke to our dad the way we spoke to him, which was to ask him for money and berate him for historical wrongs. It was just our way of saying hello.</p><p>He, in turn, constantly replenished the stock of wrongs, forgetting it was Christmas and falling asleep in taramasalata. Once he walked out of a party with all of my 21st birthday presents because he saw a bag with a bottle of vodka in it and didn’t check whether there was anything else in there. I remember calling him from a phone box, saying: “Did you seriously steal my <em>eye shadow</em>?”</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/19/i-unwrapped-dads-terrible-gift-and-went-off-like-a-catherine-wheel-the-christmas-present-ill-never-forget\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/culture/2022/dec/19/winter-culture-long-dark-carol-cate-blanchett-grouper-orlando", "title": "Iced gems: art, books, music and more to keep the home fires burning this winter", "date_published": "2022-12-19 10:00:16+00:00", "description": "<p>From storm-tossed seascapes to skating on the Thames, our cultural critics select wintry wonders for the season’s dark days</p><p><br />Cate Blanchett and Rooney Mara play secret lovers in Carol, Todd Haynes’s sumptuous 2015 adaptation of Patricia Highsmith’s semi-autobiographical novel The Price of Salt. In 1950s Manhattan, Therese (Mara) is an aspiring photographer working in the toy section of a department store for the Christmas season. There, she meets the glamorous Carol (Blanchett), who is buying a doll for her daughter. Their chemistry is instant; an excuse to further meet is proffered when Carol leaves behind a pair of leather gloves. They share furtive, longing glances across the snow, have tête-à-têtes in the booths of cosy diners and reflect on failing relationships with men at holiday parties. The romance is slow burning and exquisite, the city blanketed with snow and lashed with rain, the cold-weather costuming immaculate. <em>Rebecca Liu</em></p> <a href=\"https://www.theguardian.com/culture/2022/dec/19/winter-culture-long-dark-carol-cate-blanchett-grouper-orlando\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/19/new-york-rats-eric-adams-meera-joshi", "title": "New York’s deputy mayor leads the charge against the city’s rat population", "date_published": "2022-12-19 10:00:16+00:00", "description": "<p>The ‘Rat Tsar’ that the city posted a job listing for will report to Meera Joshi, who shares Eric Adams’ hatred of the vermin</p><p>Late last month, New York City posted a job listing for a new “director of rodent mitigation”, a title that was soon slimmed down to “Rat Tsar”, to work under the direction of the Mayor Eric Adams and his deputy mayor for operations, Meera Joshi.</p><p>Taking on New York’s rat population, the listing said, would take someone who is “highly motivated and somewhat bloodthirsty” and possessed of both “stamina and stagecraft”. The new Rat Tsar, it added would need a “swashbuckling attitude, crafty humor and general aura of badassery”.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/19/new-york-rats-eric-adams-meera-joshi\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/music/2022/dec/19/the-50-best-albums-of-2022-no-5-rosalia-motomami", "title": "The 50 best albums of 2022: No 5 – Rosalía: Motomami", "date_published": "2022-12-19 10:00:15+00:00", "description": "<p>An experimental album that draws on so many contradictory styles might embarrass a lesser artist – but her third LP showed the Spanish singer has the pop smarts to pull it off</p><ul><li><a href=\"https://www.theguardian.com/music/2022/dec/06/the-50-best-albums-of-2022\">The 50 best albums of 2022</a></li><li><a href=\"https://www.theguardian.com/music/2022/dec/05/the-20-best-songs-of-2022\">The best songs of 2022</a></li><li><a href=\"https://www.theguardian.com/culture/series/2022-in-culture\">More of the best culture of 2022</a></li></ul><p>“Yo soy muy mía, yo me transforma,” sings <a href=\"https://www.theguardian.com/music/rosalia\">Rosalía</a>, on <a href=\"https://www.theguardian.com/music/2022/mar/20/rosalia-motomami-review-energy-and-heartbreak-from-a-first-class-voice\">Motomami</a>’s opening track – I’m very much me, I transform – before going on to compare her shapeshifting abilities to those of a butterfly, a drag queen, a “sex siren” and the night sky during a meteor shower. Given that she’s singing all this over a backing track where jazzy drums and free piano improvisation crash into a reggaeton beat nicked from Daddy Yankee and Wisin’s 2004 hit Saoco, and a synth so filthily distorted it could find a home on a Nine Inch Nails album, it’s a lyric that amounts to stating the obvious, albeit very entertainingly.</p><p>It’s not a collection of sounds that many mainstream pop stars would chose to open the follow-up to their 2m-selling international breakthrough album. But Rosalía’s third album delights in flinging diverse, even contradictory styles together – dembow, hip-hop, dubstep, salsa, industrial, bachata, the experimental electronics of Arca, R&amp;B, flamenco, pure radio-ready pop – and presenting the results to the listener with an insouciant take-it-or-leave-it shrug. It’s the work of an artist who clearly sees her success as a platform that enables you to do what you want rather than an end itself. “Es mala amante la fama y no va a quererme de verdad,” as <a href=\"https://www.theguardian.com/music/the-weeknd\">the Weeknd</a> puts it on their collaboration La Fama: fame’s a lousy lover and won’t ever love you for real. Better to exploit it to your own ends than chase it.</p> <a href=\"https://www.theguardian.com/music/2022/dec/19/the-50-best-albums-of-2022-no-5-rosalia-motomami\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/19/royal-mail-strike-christmas-cards-posties-gig-economy", "title": "Yes, this Royal Mail strike means fewer Christmas cards – but posties are fighting for their survival | Dan Bradley", "date_published": "2022-12-19 10:00:15+00:00", "description": "<p>The company seems hellbent on destroying the 400-year heritage of this vital service and making it into a gig-economy courier</p><ul><li>Dan Bradley is a writer and a former Royal Mail postal worker</li></ul><p>After a year of spiralling costs and political upheaval, most of us are now looking forward to the distraction of Christmas celebrations: feelgood pop songs, festive markets and time off to see family and friends. But the window for posting cards and presents has become much shorter this year. Although many people will be frustrated about the last Christmas posting date being brought forward by a week, things are terrible for postal workers – which is why Royal Mail posties are out there now, <a href=\"https://www.theguardian.com/business/2022/dec/09/royal-mail-workers-christmas-strikes-protest-conditions-pay\">striking for their survival</a>.</p><p>After four days of strike action in late August and early September, with more than 98% of Communication Workers Union (CWU) members voting to back a second round of strikes, the situation has only got worse. Union members have been carrying out six days of <a href=\"https://www.theguardian.com/politics/2022/nov/17/december-royal-mail-strike-action-to-include-christmas-eve\">strike action</a> over the weeks leading up to Christmas. And they aren’t the only ones: rail workers, university staff, teachers, civil servants, ambulance workers and the Royal College of Nursing (RCN) have all been <a href=\"https://www.theguardian.com/uk-news/2022/dec/12/uk-strike-days-calendar-the-public-service-stoppages-planned-for-december\">striking this month</a>.</p><p>Dan Bradley is a writer and a former Royal Mail postal worker</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/19/royal-mail-strike-christmas-cards-posties-gig-economy\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/19/cyril-ramaphosa-re-elected-as-leader-of-anc-in-south-africa", "title": "Cyril Ramaphosa re-elected as leader of ANC in South Africa", "date_published": "2022-12-19 09:59:21+00:00", "description": "<p>Country’s president wins second five-year term as party leader after campaign dogged by Farmgate scandal</p><p>The South African president, Cyril Ramaphosa, has been re-elected as leader of the governing African National Congress in a party leadership contest.</p><p>Ramaphosa had been widely tipped to secure re-election for a second five-year term, but his campaign was dogged by the Farmgate scandal that broke in June involving large sums of foreign currency found hidden at his private game farm.</p> <a href=\"https://www.theguardian.com/world/2022/dec/19/cyril-ramaphosa-re-elected-as-leader-of-anc-in-south-africa\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/19/cop15-key-points-of-nature-deal-at-a-glance-aoe", "title": "Cop15: key points of the nature deal at a glance", "date_published": "2022-12-19 09:56:54+00:00", "description": "<p>Main points of the historic agreement signed in Montreal to halt the destruction of Earth’s ecosystems</p><ul><li><a href=\"https://www.theguardian.com/environment/2022/dec/19/cop15-historic-deal-signed-to-halt-biodiversity-loss-by-2030-aoe\">Cop15: historic deal struck to halt biodiversity loss by 2030</a></li></ul><p>The Kunming-Montreal pact <a href=\"https://www.cbd.int/conferences/2021-2022/cop-15/documents\">is a series of agreements</a> that range from scientific cooperation to human-wildlife conflict. Here are the main points at a glance in the <a href=\"https://www.cbd.int/doc/c/e6d3/cd1d/daf663719a03902a9b116c34/cop-15-l-25-en.pdf\">once-in-a-decade deal to halt the destruction</a> of Earth’s ecosystems.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/19/cop15-key-points-of-nature-deal-at-a-glance-aoe\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/19/cop15-historic-deal-signed-to-halt-biodiversity-loss-by-2030-aoe", "title": "Cop15: historic deal struck to halt biodiversity loss by 2030", "date_published": "2022-12-19 09:37:45+00:00", "description": "<p>Agreement on ’30 by 30’ target forced through by Chinese president, ignoring objections from African states</p><ul><li><a href=\"https://www.theguardian.com/environment/2022/dec/19/cop15-key-points-of-nature-deal-at-a-glance-aoe\">Cop15: key points of the nature deal at a glance</a></li></ul><p>Governments appear to have signed a <a href=\"https://www.cbd.int/doc/c/e6d3/cd1d/daf663719a03902a9b116c34/cop-15-l-25-en.pdf\">once-in-a-decade deal</a> to halt the destruction of Earth’s ecosystems, but the agreement seems to have been forced through by the Chinese president, ignoring the objections of some African states.</p><p>After more than four years of negotiations, repeated delays due to the Covid-19 pandemic and talks into the night on Sunday in Montreal, nearly 200 countries – <a href=\"https://www.theguardian.com/environment/2022/dec/17/cop15-us-biodiversity-cbd\">but not the US or the Vatican</a> – signed an agreement at the biodiversity Cop15, which was co-hosted by Canada and China, to put humanity on a path to living in harmony with nature by the middle of the century.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/19/cop15-historic-deal-signed-to-halt-biodiversity-loss-by-2030-aoe\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/fashion/2022/dec/19/alva-claire-i-dont-do-things-by-halves-the-rise-of-one-of-fashions-top-models", "title": "Alva Claire: ‘I don’t do things by halves’", "date_published": "2022-12-19 09:29:14+00:00", "description": "London-born, Brooklyn-based Alva Claire has established herself as one of fashion’s hottest models. But, she says, it’s been a long time coming<p>Even via a computer screen, Alva Claire is luminous. Her skin has the sheen and glow of someone with a diet rich in omegas and antioxidants, her smile is campaign-ready, her cleavage, cartoonishly framed by a tight, black peekaboo top, is magnificent and cheering on a dull autumn afternoon in my kitchen. I’m pretty confident Claire won’t mind me saying that. Not only is the London-born 30-year-old model in possession of a wicked sense of humour and a contagious cackle, she knows the power clothes have to attract and provoke. “We tell stories when we get dressed in the morning,” she says later. “Whether you like it or not, we’re all telling a story.”</p><p>It is mid-October and Claire is in her apartment in Brooklyn, where she lives when she’s not in London. She’s been in town for a week, the longest she’s been in one spot since the summer. Fashion month happened in September; Claire walked in 14 shows in New York, London, Milan and Paris. “I feel like I’ve been on tour,” she says, “but without the lovely singing voice.”</p> <a href=\"https://www.theguardian.com/fashion/2022/dec/19/alva-claire-i-dont-do-things-by-halves-the-rise-of-one-of-fashions-top-models\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/society/2022/dec/19/ambulance-staff-strike-pay-union", "title": "Ambulance staff need firm promise on pay to call off strike, says union", "date_published": "2022-12-19 09:20:47+00:00", "description": "<p>Mere commitment to discuss pay, so far refused by health secretary, would now be insufficient</p><ul><li><a href=\"https://www.theguardian.com/politics/live/2022/dec/19/union-leaders-dismiss-talks-avert-ambulance-strike-nhs-uk-politics-live\">UK politics live – latest news updates</a></li></ul><p>Ambulance staff would require a definite commitment from ministers on pay rather than just a promise of talks to call off their planned strike on Wednesday, according to a union leader who said trust had largely broken down with the government.</p><p>Christina McAnea, the general secretary of Unison, one of three unions involved in the strike by ambulance crews in England, Wales and Northern Ireland, said even a commitment to discuss pay, thus far refused by the health secretary, Steve Barclay, would now be insufficient.</p> <a href=\"https://www.theguardian.com/society/2022/dec/19/ambulance-staff-strike-pay-union\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/19/taliban-prisoners-in-pakistan-overpower-guards-and-take-hostages", "title": "Taliban prisoners in Pakistan overpower guards and take hostages", "date_published": "2022-12-19 08:59:06+00:00", "description": "<p>Militants seize counter-terrorism compound in Khyber Pakhtunkhwa province</p><p>Taliban detainees overpowered their guards at a counter-terrorism centre in north-western Pakistan, snatching police weapons and taking control of the facility, officials have said.</p><p>The militants at the detention facility in Bannu, a district in the Khyber Pakhtunkhwa province and part of a former tribal region, also took police and others inside the compound hostage, according to Mohammad Ali Saif, a spokesperson for the provincial government.</p> <a href=\"https://www.theguardian.com/world/2022/dec/19/taliban-prisoners-in-pakistan-overpower-guards-and-take-hostages\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/business/live/2022/dec/19/elon-musk-polls-twitter-users-over-stepping-down-as-ceo-business-live", "title": "Elon Musk polls Twitter users over stepping down as CEO – business live", "date_published": "2022-12-19 08:11:27+00:00", "description": "<p>Elon Musk says he will honour the results of a Twitter poll asking whether the should resign as head of the social media platform</p><p><strong>Dan Ives, a managing director of equity research at US investment firm Wedbush Securities, says Musk’s willingness to step back may be linked to the fact that controversies linked to Twitter have started to damage his “golden child\": Tesla.</strong> </p><p>Ives told BBC Radio 4’s Today programme this morning that while Musk has not necessarily followed through with the decisive calls of Twitter polls in the past, this time is different: </p><p>The last few weeks, few months, [have] been a black eye for Musk and a black eye for Tesla, and I think ultimately that’s the golden child: that 90% plus of his wealth. </p><p>And that’s why I think the writings on the wall, and I think ultimately in the next 24 hours, Musk will probably name a temporary CEO of Twitter.</p><p>He can build rockets and create electric cars. That’s why he is who he is. But when it comes to social media and to Twitter, I think this is a diff type of animal, and he’s realised he can’t balance this as well as Tesla and Space X. </p><p>And I think the writing’s on the wall that he cannot be CEO of Twitter. </p><p>I think the pressure was building, I think ultimately, probably in the next 5-6 hours, it’s going to be the end of Musk reining as CEO of Twitter. </p> <a href=\"https://www.theguardian.com/business/live/2022/dec/19/elon-musk-polls-twitter-users-over-stepping-down-as-ceo-business-live\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/culture/2022/dec/19/pakistan-art-pop-culture-joyland-ms-marvel", "title": "Superheroes, jazz, queer art: how Pakistan’s transgressive pop culture went global", "date_published": "2022-12-19 08:01:12+00:00", "description": "<p>Freed from the shadow of 9/11, the country’s artists are building on a rich heritage – to international acclaim</p><p>In August, Pakistan’s three censor boards cleared Saim Sadiq’s award-winning film Joyland for release. Shot in Lahore, the film is about a young married man from a conservative family who finds work at a dance theatre and falls in love with a trans woman struggling to land her moment on stage. It was the first Pakistani film to screen at Cannes and it won the Un Certain Regard prize, receiving a standing ovation nearly10 minutes long. </p><p>Even though the film was then subject to various <a href=\"https://www.theguardian.com/world/2022/nov/14/joyland-pakistan-bans-oscar-contender-film-about-trans-love-affair\">bans in Pakistan</a>, after being accused of pushing an LGTBQ+ agenda and misrepresenting Pakistani culture, it finally appeared in Pakistani cinemas in November, with Malala Yousafzai signing on as executive producer.</p> <a href=\"https://www.theguardian.com/culture/2022/dec/19/pakistan-art-pop-culture-joyland-ms-marvel\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/19/horror-kharkiv-ukrainian-reporter-war-ukraine", "title": "I helped one man in this picture escape the horrors of Kharkiv. The other man? I may never know | Nataliya Gumenyuk", "date_published": "2022-12-19 08:00:14+00:00", "description": "<p>As a Ukrainian reporter, sometimes I can’t bear to find out what has happened to people I spoke to in the early days of war</p><ul><li>Nataliya Gumenyuk is a Ukrainian journalist, and co-founder of the Reckoning Project</li><li>What was the image on your phone that defined 2022?<br /><a href=\"https://www.theguardian.com/commentisfree/series/snapshot-of-2022\">Writers give their perspectives</a></li></ul><p></p><p>It had only been three weeks since the invasion, but it felt as if the war had lasted a lifetime. We were exhausted and overwhelmed. By mid-March, the city of Kharkiv, situated 25 miles from the Russian border, looked unreachable from Kyiv, where I live. Ukrainians were adjusting to this new life. Under the constant shelling, hotels and shops were not able to offer any kind of normal service. We were not sure whether petrol stations were open. Yet the second-biggest city in Ukraine, where around 2 million people were living, was too important to stay away from. I had close friends who could host me. So I went.</p><p>It was my friends who had <a href=\"https://www.theguardian.com/commentisfree/2022/feb/24/kyiv-putin-bombs-invasion-airstrikes-ukraine-russia\">said</a>, in the early hours of the morning of 24 February, that “Kharkiv is being bombed”, confirming our worst fears. I had visited them in January, before the war, reporting on the mood in the city, and visited their newly bought apartment on the top floor of an old house in the centre. Kharkiv was the first place in Ukraine to have its city centre shelled. It was heartbreaking in March to see part of that street destroyed by rockets, though their house survived.</p><p>Nataliya Gumenyuk is a Ukrainian journalist, and co-founder of the Reckoning Project</p><p><em><strong>Do you have an opinion on the issues raised in this article? If you would like to submit a response of up to 300 words by email to be considered for publication in our <a href=\"https://www.theguardian.com/letters\">letters</a> section, please <a href=\"mailto:mailto:guardian.letters@theguardian.com?body=Please%20include%20your%20name,%20full%20postal%20address%20and%20phone%20number%20underneath%20your%20letter.%20Letters%20are%20usually%20published%20with%20the%20author’s%20name%20and%20city/town/village.%20The%20rest%20of%20the%20information%20is%20for%20verification%20only%20and%20to%20contact%20you%20if%20your%20letter%20is%20used.\">click here</a>.</strong></em><br /><br /></p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/19/horror-kharkiv-ukrainian-reporter-war-ukraine\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/19/new-england-patriots-embarrassing-loss-las-vegas-raiders", "title": "The Patriots’ humiliating loss at Las Vegas lays bare how far they’ve fallen", "date_published": "2022-12-19 08:00:14+00:00", "description": "<p>If there were ever a moment that made it undeniably clear the Patriots Dynasty was ancient history, New England’s jaw-dropping loss to the Raiders on Sunday may have been it</p><p>Sometimes when watching sports, one witnesses a play so ridiculous and inexplicable that one’s brain cannot even properly process what exactly has just happened. Case in point: the bizarre final sequence of the New England Patriots’ backbreaking 30-24 road loss to the Las Vegas Raiders on Sunday. If there ever were a moment that laid bare how the Patriots Dynasty was officially in the rear-view mirror, we may have just witnessed it.</p><p>Officially, the game ended with Raiders defensive end Chandler Jones picking off a lateral thrown by Patriots receiver Jakobi Meyers and rumbling into the end zone for the game-winning touchdown. In the official game stats, it went down as a fumble recovery. But none of this quite captures the chaos that rapidly unfolded in the game’s final seconds.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/19/new-england-patriots-embarrassing-loss-las-vegas-raiders\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/blog/2022/dec/19/tiger-woods-charlie-woods-golf-comment", "title": "Will Charlie Woods become the new Tiger, or will the hype make him back away? | Ewan Murray", "date_published": "2022-12-19 08:00:14+00:00", "description": "<p>Tiger is a protective father but the decision to catapult his son into public view at the PNC Championship is an interesting one</p><p>Nobody who owns a yacht named Privacy is likely to pursue publicity. Tiger Woods has made the keeping of secrets an art form despite spending the majority of his life as one of the most recognisable people on earth. Hank Haney, the golf coach, once told the story of being chastised by his star client for giving a television executive a nod towards Woods’s likely schedule. Any member of the media who claims they properly <em>know </em>Woods is spoofing; there is deliberate, visible distance kept between the 15-times major winner and all but those within his inner sanctum. So many questions, so few answers.</p><p>Against this backdrop, the profile given to 13-year-old Charlie Woods – and at his father’s own volition – is intriguing. The PNC Championship in Orlando ordinarily provides a bit of hit-and-giggle for high-profile golfing families but the now routine involvement of Team Woods raises interest levels significantly. Including to the point where it can make for uncomfortable reading or listening. This weekend, we have seen Charlie’s divot pattern assessed. Every pose and swing is likened to his iconic father. This is a child, subject to the kind of scrutiny that would be deemed unhealthy by plenty of onlookers. How does Charlie seamlessly return to the classroom having been plastered all over the Golf Channel for 72 hours?</p> <a href=\"https://www.theguardian.com/sport/blog/2022/dec/19/tiger-woods-charlie-woods-golf-comment\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/19/can-i-get-the-no-makeup-look-using-the-pros-patchwork-method", "title": "Can I get the ‘no makeup’ look using the pro’s patchwork method?", "date_published": "2022-12-19 08:00:13+00:00", "description": "<p>Not putting foundation over your whole face works for celebs and professional makeup artists – and for me too</p><p><strong>The hack</strong><br />Ever wonder how celebrities look as though they’re not wearing makeup? Applying skincare and base products like “patchwork” could be the key.</p><p><strong>The test</strong><br /><a href=\"https://www.glamourmagazine.co.uk/article/patchwork-skin-makeup-trend\" title=\"\">Patchwork skin</a>, a term coined by makeup artist Lisa Eldridge, is how professional makeup artists create a flawless base that looks like bare skin. The strategy? Use products only where you need them, rather than treating your face like one giant canvas.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/19/can-i-get-the-no-makeup-look-using-the-pros-patchwork-method\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/music/2022/dec/19/say-she-she-prism-review", "title": "Say She She: Prism review – boundary-busting discodelic soul", "date_published": "2022-12-19 08:00:13+00:00", "description": "<p><strong>(Karma Chief)<br /></strong>The Brooklyn trio conspire to produce an idiosyncratic album that ranges from drum- machine funk to small-hours sublimity</p><p>You can imagine Brooklyn-based trio Say She She’s “discodelic soul” fitting neatly into New York’s early-80s post-punk, post-disco world. That’s not to say that their sound is self-consciously retro – in fact, there’s something very 2022 about its warm, lo-fi, bedroom pop-adjacent production – more to suggest that, as with a lot of artists of the early 80s scene, there’s something appealingly idiosyncratic and boundary-busting about their sound. It stirs together everything from budget electronics to soft Philly soul and the echoing space of dub and tops it off with beautiful vocal harmonies: all three members – London-born Piya Malik and Americans Nya Parker Gazelle and Sabrina Cunningham – started out as classical singers.</p><p>A little less spiky than their singles Forget Me Not and Norma, which were inspired by feminist activists the Guerrilla Girls and the overturning of Roe v Wade, respectively, Prism offers an embarrassment of fabulous songs. Pink Roses deals with grief via spindly bargain-basement disco. The title track throws up off-centre, drum-machine-driven funk – if you want a recherché comparison, its rhythm vaguely recalls Voggue’s post-disco hit Dancin’ the Night Away – while the beatless, weightless closer, Better Man, is an exercise in small-hours sublimity.</p> <a href=\"https://www.theguardian.com/music/2022/dec/19/say-she-she-prism-review\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/global-development/2022/dec/19/this-world-cup-should-be-remembered-for-its-racism-but-qatar-is-not-the-victim", "title": "This World Cup should be remembered for its racism. But Qatar is not the victim | Pete Pattisson", "date_published": "2022-12-19 08:00:13+00:00", "description": "<p>The misery of migrant workers involved in staging the tournament is plain to see. No amount of spin can cover up the structural racism involved</p><p>When Nasser al-Khater, Qatar’s World Cup chief, was asked last week about the recent death of a migrant worker, his <a href=\"https://www.theguardian.com/football/2022/dec/08/qatar-launches-investigation-after-reported-death-of-worker-at-world-cup-site\">response</a> was both shocking and revealing. “We’re in the middle of a World Cup and we have a successful World Cup. And this is something you want to talk about right now? I mean death is a natural part of life,” he said, before going on to offer condolences to the family of the deceased.</p><p>First, a sense of outrage and indignation that anyone would challenge Qatar’s narrative about the World Cup and then a callous indifference for the workers who made it possible.</p> <a href=\"https://www.theguardian.com/global-development/2022/dec/19/this-world-cup-should-be-remembered-for-its-racism-but-qatar-is-not-the-victim\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/society/2022/dec/19/us-poor-bereavement-policies", "title": "Three days to grieve your spouse: finding privilege in life and in death", "date_published": "2022-12-19 08:00:13+00:00", "description": "<p>Bereavement policies in the US are dismal, leaving workers without time or pay to grieve</p><p>I distinctly remember reading the bereavement leave policy in the employee handbook when I started my new job as a 22-year-old recent graduate. Three days seemed short to me, but if paired with a couple of sick days it would probably be enough to take a week off to support my family, help with arrangements and travel to a memorial service if an older extended family member passed away.</p><p>“I can make that work,” I thought to myself, hopeful that it wouldn’t be necessary. Less than two years later, when I was 24, my spouse Eli died suddenly and unexpectedly in an accident. I don’t remember much from that night, except that I ran to the bathroom after his death was confirmed; nausea was the first symptom of shock. I was shaking so harshly that all I could hear were my teeth chattering as they knocked together uncontrollably.</p> <a href=\"https://www.theguardian.com/society/2022/dec/19/us-poor-bereavement-policies\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/tv-and-radio/2022/dec/19/unofficial-science-home-alone-james-acaster-guz-khan-sky-interview-comedy", "title": "‘Don’t blowtorch my head!’ The Home Alone recreation that nearly fried James Acaster and Guz Khan", "date_published": "2022-12-19 08:00:12+00:00", "description": "<p>Swinging paintcans, electrified sinks, a drop from a zipwire … in The Unofficial Science of Home Alone, the comics undergo the Christmas classic’s booby traps – to see what would <em>really</em> happen</p><p>In a grey corner of Borehamwood in deepest Hertfordshire, a film set is coming alive with one of Christmas’s most magical traditions: cartoonish ultraviolence. Bags of unopened marbles lie ready to shatter someone’s vertebrae. A blowtorch is rigged to incinerate the first person to step through a doorway. Piles of dented paint tins are freshly bent out of shape from being swung into torsos. And everywhere there is tinsel, fake snow and twinkling fairy lights. ‘Tis the season to be jolly, all right – jolly badly hurt.</p><p>This is the set of a new show celebrating one of the all-time classic Christmas movies. The Unofficial Science of Home Alone is a look at what would happen if you actually subjected someone to the film’s booby traps. To do so, they’ve created an exact recreation of the set and the pranks – with a couple of exceptions. First (presumably for legal reasons) the staircase is lined with photos of a family that looks like (but is not) the McCallisters, including a fake Macaulay Culkin whose blazer and dodgy bow-tie make him a closer match to a young Niles Crane. Also, as far as we can remember, the original movie did not star comedians <a href=\"https://www.theguardian.com/culture/2022/apr/29/james-acaster-josh-widdicombe-hypothetical\">James Acaster</a> and <a href=\"https://www.theguardian.com/stage/2022/sep/13/guz-khan-comedian-man-like-mobeen\">Guz Khan</a> as the Wet Bandits.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/19/unofficial-science-home-alone-james-acaster-guz-khan-sky-interview-comedy\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/19/weather-tracker-temperatures-set-to-plunge-across-us-states", "title": "Weather tracker: temperatures set to plunge across US states", "date_published": "2022-12-19 07:42:23+00:00", "description": "<p>Arctic airmass heading south, reaching Texas and even Florida with some areas  facing temperatures of up to 45 degrees below normal</p><p>While the UK is getting less cold this week in the run-up to Christmas, temperatures in the lower 48 states of the US will be taking a major plunge. Over the course of the weekend, an Arctic airmass that was sitting over northern Canada, characterised by extremely low temperatures and strong high pressure, slid to the south across Alberta and Saskatchewan into eastern states of the Pacific north-west. Temperatures across these regions averaged about -23C at around midday on Sunday.</p><p>Through the week, this airmass will slowly spread southward across central states, with temperatures ranging from 10-30 degrees below average. Later in the week, the airmass will extend to the south, reaching Texas and even Florida, with some areas possibly reaching up to 45 degrees below normal. This cold airmass is likely going to interact with an area of low pressure across the eastern half of the country towards the end of the week, threatening significant snowfall to states such as Minnesota, Wisconsin, Iowa and Illinois.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/19/weather-tracker-temperatures-set-to-plunge-across-us-states\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/travel/2022/dec/19/a-car-free-break-around-exeter-devon-dartmoor-exmouth-appledore", "title": "Steam trains, shipwrecks and Tarka the otter: a car-free break around Exeter, Devon", "date_published": "2022-12-19 07:00:12+00:00", "description": "<p>River cruises, rural buses and scenic rail routes come into their own when exploring the bracing shores, gorges and wildlife of this stunning area</p><p>The moon makes a silver path over Tor Bay. It’s framed by clouds of steam, glowing lilac in the train’s floodlights. This is the view from my toasty carriage on the Dartmouth Steam Railway’s Train of Lights. It’s one of many things I would have missed if I’d come in summer.</p><p>In winter, Devon’s trains, hotels and beaches are generally emptier. There are thousands of wading birds, crisp coastal walks to pubs, bracing moorland and Christmas lights, all easy to reach by rail if you avoid the strikes.</p> <a href=\"https://www.theguardian.com/travel/2022/dec/19/a-car-free-break-around-exeter-devon-dartmoor-exmouth-appledore\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/music/2022/dec/19/luke-evans-honest-playlist", "title": "‘I want That’s All Folks played at my funeral’: Luke Evans’s honest playlist", "date_published": "2022-12-19 07:00:12+00:00", "description": "<p>The Welsh singer and actor grew up on Roberta Flack and loved Kylie, but which soul legend does he credit for his love of singing?</p><p><strong>The first song I remember hearing </strong><br />My very early years of one to three years old, I lived in a little village called Crumlin in south Wales. My great auntie, who was in her 90s, used to sing me (How Much Is) That Doggie in the Window? by Patti Page.</p><p><strong>The first single I bought </strong><br />I was a huge fan of Kylie Minogue as Charlene in Neighbours, so when she became a pop star, I ran to buy I Should Be So Lucky from Woolworths in the local town of Bargoed, next to the village of Aberbargoed where I lived. I can still picture her on the cover.</p> <a href=\"https://www.theguardian.com/music/2022/dec/19/luke-evans-honest-playlist\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/film/2022/dec/19/republic-of-silence-review-syria-assad-documentary-film", "title": "Republic of Silence review – fragments from the beating heart of Syria’s trauma", "date_published": "2022-12-19 07:00:11+00:00", "description": "<p>Ambitious documentary pieces together snatches of public and private history since the uprising against Assad</p><p>Diana El Jeiroudi’s film is a complex and sprawling curation of images, sequences and ideas orbiting the central subject of Syria and its anti-Assad uprising: this ambitious work is something between a conventional contemporary documentary (and by that token without a voiceover that would introduce or explain things), a video diary, an installation piece where clips filmed years apart are presented randomly or free-associatively. It perhaps has the procedural aesthetic of YouTube (where many people under siege in Homs uploaded their own searing footage of lives under attack), with videos queued up to be played by the user.</p><p>One of the many questions the viewer might have is about the meaning of the title: is the Syrian republic silent in that its tyrannical government shuts down dissenting voices? Or is it that the silence is elsewhere in the rest of the world, which is unsure how or if to respond? The film is sited partly in Syria itself, where the film-maker’s friend, geneticist Rami Abou Jamra, is carrying out medical research about inherited learning difficulty; there are dramatic scenes of demonstrations, attacks and some brutal images of torture scars and bullet wounds. It also shows the director’s home life in Berlin, where she lives in exile with fellow film-maker and partner Orwa Nyrabia who, like El Jeiroudi, is a director of the Dox Box documentary film festival back in Syria (where he briefly went missing) and also the director of the Amsterdam documentary film festival.</p> <a href=\"https://www.theguardian.com/film/2022/dec/19/republic-of-silence-review-syria-assad-documentary-film\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/uk-news/2022/dec/19/the-have-i-got-news-for-you-2022-quiz-of-the-year", "title": "The Have I Got News for You 2022 quiz of the year", "date_published": "2022-12-19 07:00:11+00:00", "description": "<p>It was another big year for bizarre news stories, but how good is your recall? Test your knowledge, from Partygate to Ukraine</p><p>Extracted from <em>Have I Got News for You: The Quiz of 2022</em> (Little, Brown, £14.99). To support the <em>Guardian</em> and <em>Observer</em> order your copy at <a href=\"https://guardianbookshop.com/have-i-got-news-for-you-the-quiz-of-2022-9781408727102\">guardianbookshop.com</a>. Delivery charges may apply</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/19/the-have-i-got-news-for-you-2022-quiz-of-the-year\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/19/toronto-shooting-gunman-kills-five-residential-unit-vaughan-canada", "title": "Toronto shooting: gunman kills five in residential unit", "date_published": "2022-12-19 06:39:03+00:00", "description": "<p>Police in Canada shoot dead suspect after receiving reports of an active male shooter in Vaughan on Sunday night </p><p>Five people have been shot and killed in a residential unit in a Toronto suburb before the gunman was killed by police, authorities have said.</p><p>Police were called to a residential building in Vaughan, Ontario, at about 7.20pm on Sunday to reports of an active male shooter who had shot several victims at a condo in Vaughan, Ontario.</p> <a href=\"https://www.theguardian.com/world/2022/dec/19/toronto-shooting-gunman-kills-five-residential-unit-vaughan-canada\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/live/2022/dec/19/russia-ukraine-war-live-news-drone-strike-on-kyiv-uk-to-announce-new-artillery-package", "title": "Russia-Ukraine war live news: drone strike on Kyiv; UK to announce new artillery package", "date_published": "2022-12-19 06:12:57+00:00", "description": "<p>Nine Iranian-made drones <a href=\"https://www.theguardian.com/world/live/2022/dec/19/russia-ukraine-war-live-news-drone-strike-on-kyiv-uk-to-announce-new-artillery-package?page=with:block-639fcff88f085e6820542d89#block-639fcff88f085e6820542d89\">shot down in capital</a>, say officials; Rishi Sunak to unveil <a href=\"https://www.theguardian.com/world/live/2022/dec/19/russia-ukraine-war-live-news-drone-strike-on-kyiv-uk-to-announce-new-artillery-package?page=with:block-639fd2a68f0816e812ef2908#block-639fd2a68f0816e812ef2908\">£250m in military support</a> during leaders’ meeting in Latvia</p><ul><li><a href=\"https://www.theguardian.com/world/2022/dec/19/russia-ukraine-war-at-a-glance-what-we-know-on-day-299-of-the-invasion\">At a glance: what we know on day 299 of the invasion</a></li></ul><p>The UK is set to announce a major new artillery package for Ukraine as British prime minister Rishi Sunak <a href=\"https://www.theguardian.com/politics/2022/dec/18/rishi-sunak-to-meet-uk-troops-in-estonia-and-attend-baltic-summit-russia\">prepares to meet with his Nordic, Baltic and Dutch counterparts</a> in Riga, Latvia, on Monday. </p><p>According to a statement issued by the prime minister’s office and as cited by Agence France-Presse, he will announce Britain’s intention to supply “hundreds of thousands of rounds of artillery ammunition next year under a £250m ($304m) contract that will ensure a constant flow of critical artillery ammunition to Ukraine throughout 2023”.</p><p>From the Arctic Circle to the Isle of Wight, the UK and our European allies have been in lockstep in our response to the invasion of <a href=\"https://www.theguardian.com/world/ukraine\">Ukraine</a>, and we remain steadfast in our ambition for peace in Europe once again,” Sunak said ahead of the visit.</p><p>But to achieve peace, we must deter aggression and our deployments across the region together are vital in ensuring we are able to respond to the gravest of threats. I know this Joint Expeditionary Force summit will only underline our close friendships and unwavering support for Ukraine.”</p><p>Infrastructure objects and private houses were damaged as a result of a night drone attack in the Kyiv region … two victims. People are given help - they are under the supervision of doctors.”</p> <a href=\"https://www.theguardian.com/world/live/2022/dec/19/russia-ukraine-war-live-news-drone-strike-on-kyiv-uk-to-announce-new-artillery-package\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/media/2022/dec/19/simon-cowell-joins-investors-in-music-tv-streaming-service-roxi", "title": "Simon Cowell joins investors in music TV streaming service Roxi", "date_published": "2022-12-19 06:00:12+00:00", "description": "<p><strong>Exclusive: </strong>X Factor creator will curate playlists as service prepares to launch in North America next year</p><p>Simon Cowell has become the latest investor in the music TV streaming service Roxi, which aims to offer a <a href=\"https://www.theguardian.com/music/2020/dec/07/uk-music-streaming-startup-backed-by-kylie-secures-13m-funding\">Spotify-meets-MTV experience</a>, as the British company embarks on expansion to the US.</p><p>Roxi, which had already attracted investors including Kylie Minogue, Robbie Williams and the record labels Universal, Sony and Warner, has signed up the creator of the X Factor and Got Talent TV franchises as a curator of exclusive music video playlists for its users.</p> <a href=\"https://www.theguardian.com/media/2022/dec/19/simon-cowell-joins-investors-in-music-tv-streaming-service-roxi\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/19/tsa-intercepted-record-number-of-guns-airports-this-year", "title": "TSA intercepted record number of guns at airports in 2022 and 88% were loaded", "date_published": "2022-12-19 06:00:12+00:00", "description": "<p>Agency said it anticipates preventing a total of 6,600 from entering secure area of airports by end of year, a nearly 10% jump from 2021</p><p>The Transportation Security Administration has intercepted a record number of guns at airport safety checkpoints this year, and an overwhelming majority of them were loaded.</p><p>In a statement released late last week, TSA revealed that as of 16 December, its officers had intercepted 6,301 firearms. Out of those, 88% were loaded. The number marks an increase of more than 300 from the 5,972 firearms that were detected in 2021. About 86% of the firearms confiscated last year were <a href=\"https://www.tsa.gov/news/press/releases/2022/11/14/tsa-stops-pennsylvania-resident-loaded-gun-philadelphia\">loaded</a>.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/19/tsa-intercepted-record-number-of-guns-airports-this-year\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/19/january-6-panel-trump-house-committee-explainer", "title": "What has the January 6 House panel done so far – and what’s next?", "date_published": "2022-12-19 06:00:12+00:00", "description": "<p>The final meeting will determine if Trump will be criminally referred to the US justice department</p><p>The US House committee investigating the January 6 attack on the US Capitol is holding a final public meeting on Monday, when it’s expected to decide whether to issue criminal referrals for former president Donald Trump and his allies.</p><p>The event, which comes just before the release of the committee’s final report, marks the end of a panel which has led the inquiry into the riots since the January day when more than 2,000 rioters breached the US Capitol building.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/19/january-6-panel-trump-house-committee-explainer\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/global-development/2022/dec/19/we-are-all-exposed-to-it-the-human-face-of-indias-asbestos-timebomb", "title": "‘We are all exposed to it’: the human face of India’s asbestos timebomb", "date_published": "2022-12-19 06:00:12+00:00", "description": "<p>Experts say country’s vulnerability to asbestos-related diseases is putting the health of millions of people at risk</p><p>For 40 years, Mohammad Younus worked at a factory that manufactured asbestos sheets in the southern Indian city of Coimbatore. By the time he was in his 50s, his body started giving up.</p><p>Asbestos dust had clogged his lungs, doctors told his family. Younus had tuberculosis and lung cancer. He died in 2021, aged 59. His wife and two sisters, who lived with Younus in a company apartment at the factory, have been diagnosed with asbestosis.</p> <a href=\"https://www.theguardian.com/global-development/2022/dec/19/we-are-all-exposed-to-it-the-human-face-of-indias-asbestos-timebomb\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/19/earthworms-may-have-declined-by-a-third-in-uk-study-reveals", "title": "Earthworms may have declined by a third in UK, study reveals", "date_published": "2022-12-19 06:00:11+00:00", "description": "<p>Scientists say loss may be as significant as ‘insectaggedon’ in terms of impact on soil, birds and ecosystems</p><p>Populations of earthworms in the UK may have fallen by about a third in the past 25 years, an assessment has shown.</p><p>Earthworms are vital for the healthy soil that underpins all ecosystems and scientists said a large decline would sit alongside concerns about “<a href=\"https://www.theguardian.com/environment/2017/oct/18/warning-of-ecological-armageddon-after-dramatic-plunge-in-insect-numbers\">insectaggedon</a>” and the global <a href=\"https://www.theguardian.com/environment/2022/oct/13/almost-70-of-animal-populations-wiped-out-since-1970-report-reveals-aoe\">destruction of wildlife</a>.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/19/earthworms-may-have-declined-by-a-third-in-uk-study-reveals\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/19/how-isy-suttie-met-elis-james-it-was-the-funniest-time-in-the-bedroom-id-ever-had", "title": "How we met: ‘There was a carton of Ribena between my legs and I had to brake suddenly’", "date_published": "2022-12-19 06:00:11+00:00", "description": "<p>Elis, 42, had seen fellow comedian Isy, 44, in Peep Show before they both performed at a gig in 2009. Engaged since 2016, they have two children and live in London</p><p>When comedians Isy and Elis met at a standup gig in Barnstaple in 2009, the first thing she noticed wasn’t his humorous charm, but his Ribena-soaked jacket. “I was excited to be booked alongside Isy because I’d seen her on Peep Show,” says Elis. But while driving from his home in Cardiff, disaster had struck. “There was a carton of Ribena between my legs and I had to brake suddenly,” he laughs.</p><p>They had a brief chat before going on stage, and Elis thought she was “really funny and pretty” while Isy noticed he was “fun, if a bit haphazard”. After the gig, Elis accidentally left the jacket behind. Isy was “pleased to have an excuse to see him again” and found his details on their booking email so she could let him know. “Now I wonder if he did it on purpose!” she says.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/19/how-isy-suttie-met-elis-james-it-was-the-funniest-time-in-the-bedroom-id-ever-had\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/business/2022/dec/19/unheard-voices-of-the-uk-cost-of-living-crisis-a-photo-essay", "title": "Unheard voices of the UK cost of living crisis – a photo essay", "date_published": "2022-12-19 06:00:11+00:00", "description": "<p>The photographer <strong>Kirsty Mackay</strong> interviewed people around the country who are in work or retired and struggling with the cost of living, or who help those struggling</p><p><em>“I think this story is really important because the voices of working-class people, those on benefits and low incomes is largely missing </em><em>from the cost of living newspaper coverage. I have photographed people here in a way as to not further victimise people who are </em><em>bearing the brunt of this crisis” – Kirsty Mackay.</em></p><p>Sarah Jade: ‘One income certainly isn’t enough to live on.’</p> <a href=\"https://www.theguardian.com/business/2022/dec/19/unheard-voices-of-the-uk-cost-of-living-crisis-a-photo-essay\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/19/harry-and-meghan-racism-britain-netflix-documentary", "title": "What do the elite woes of Harry and Meghan tell us about racism in Britain? Virtually nothing | Nesrine Malik", "date_published": "2022-12-19 06:00:11+00:00", "description": "<p>Minorities need better policing and healthcare. What they get is a discussion about the hurt feelings of the rich and famous</p><p>You probably won’t remember this, considering everything that followed, but when Harry and Meghan <a href=\"https://www.theguardian.com/uk-news/2018/may/19/royal-wedding-harry-meghan-windsor-gospel-power-pageantry\">got married</a>, there was a popular view in the media that their union was a watershed moment for British race relations. The wedding, we were told, cast a spell on black, white and mixed-race people alike, enchanted by the nods to Meghan’s Afro-American cultural heritage during the ceremony. “A new era dawns,” a <a href=\"https://www.nytimes.com/2018/05/19/world/europe/meghan-markle-prince-harry-wedding.html\">New York Times</a> headline read. “Modern” was a word often used to describe the pair. A modern wedding, for a modern couple, in a modern Britain.<br /><br />This new era did not dawn. But the prophecies of it are useful to revisit, because they should remind us that it didn’t matter then, and it doesn’t matter now. Because the country that Harry and Meghan married in was one that, just a few months before their wedding, declared Paulette Wilson, who had lived in Britain for 50 years, “removable to Jamaica” and detained her in Yarl’s Wood. The Windrush scandal was also “modern” Britain.</p><p>The diversity and inclusion struggles of rich, famous people say little about the country as a whole outside the lives of those rich, famous people. But even though they are tiny in number, they are gigantic in influence. Their ability to amplify their grievances means that we plot the racial history of this country via the journeys of its least relevant protagonists, such as princes and Hollywood actors. <strong> </strong>These figures inhabit such a different universe that not even their publicists are grounded enough to tell them that complaining in a Netflix documentary that the ceilings of their temporary palace cottage were too low is not something they should be attempting to solicit sympathy for.</p><p>Nesrine Malik is a Guardian columnist</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/19/harry-and-meghan-racism-britain-netflix-documentary\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/live/2022/dec/19/cricket-pakistan-england-third-test-day-three-live", "title": "Pakistan v England: third Test, day three – live", "date_published": "2022-12-19 05:20:31+00:00", "description": "<ul><li>Updates from the third day’s play in Karachi</li><li>And you can <a href=\"mailto:taha.hashim.casual@theguardian.com\">email Taha</a> or <a href=\"https://twitter.com/tahahash\">tweet him here</a></li></ul><p><strong>13th over: Pakistan 43-0 (Masood 22, Shafique 17)</strong> Wood continues to fly in and send them short. But my word this pitch is dead, with barely any carry as the ball eventually finds Ben Foakes’ gloves. Shafique nails a pull from the penultimate ball of the over, the ball whacking short leg’s shoulder before falling just short of Ben Stokes at square leg. Ollie Pope, the man hit, seems like he’s OK. </p><p><strong>12th over: Pakistan 41-0 (Shafique 15, Masood 22)</strong> Two slips in for Masood as Root continues from around the wicket. He tosses one up and Masood comes down the pitch to whack it all the way for six! The left-hander is showing his Yorkshire teammate very little respect this morning. </p> <a href=\"https://www.theguardian.com/sport/live/2022/dec/19/cricket-pakistan-england-third-test-day-three-live\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/19/escape-from-iran-protesters-regroup-in-iraq-after-perilous-journey", "title": "Escape from Iran: protesters regroup in Iraq after perilous journey", "date_published": "2022-12-19 05:00:09+00:00", "description": "<p>Daily shows of dissent against repressive 43-year clerical rule continue, with exiled demonstrators asking for help from the west</p><p>In late October, Paiman, an Iranian protester from the restive city of Mahabad lay in a hospital ward, guarded by regime officials who had gunned him down during anti-government demonstrations.</p><p>Buckshot from a shotgun blast riddled his legs and torso, and blows to his head with wooden clubs had left him dazed and in agony.</p> <a href=\"https://www.theguardian.com/world/2022/dec/19/escape-from-iran-protesters-regroup-in-iraq-after-perilous-journey\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/19/thai-warship-sinks-heavy-seas-sailors-rescued-missing-htms-sukhothai", "title": "Thai warship sinks in heavy seas with dozens feared missing", "date_published": "2022-12-19 04:36:29+00:00", "description": "<p>Thirty-three crew thought to be missing as army recruits three ships and two helicopters to rescue effort</p><p>A flagship Royal Thai Navy warship sank amid strong waves and high winds on Sunday, with dozens of sailors still missing on Monday.</p><p>More than 100 sailors were rescued on Sunday evening from HTMS Sukhothai – one of just seven navy corvettes – after high winds made the boat tilt sharply toward the water, navy spokesperson Pokkrong Monthatphalin<strong> </strong>said in a statement.</p> <a href=\"https://www.theguardian.com/world/2022/dec/19/thai-warship-sinks-heavy-seas-sailors-rescued-missing-htms-sukhothai\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/19/england-west-indies-women-fourth-t20-report", "title": "Sophie Ecclestone spins into record books as England beat West Indies again", "date_published": "2022-12-19 04:15:33+00:00", "description": "<ul><li>Bowler takes international wicket tally to 56 this year</li><li>England take 4-0 T20 series lead with 49-run win in Bardbados</li></ul><p>England took their T20 success on tour in the West Indies to four from four on Sunday, winning the second-last game by 49 runs as spinner Sophie Ecclestone claimed a new women’s cricket record.</p><p>The 23-year-old has taken 56 international wickets this year, the most any woman has ever taken in a calendar year.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/19/england-west-indies-women-fourth-t20-report\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/19/china-covid-waves-winter-cities-quiet", "title": "China’s cities fall quiet amid warning of three Covid waves over winter", "date_published": "2022-12-19 03:47:52+00:00", "description": "<p>Chief epidemiologist says China is in the first of an expected three waves of Covid cases, despite official figures showing low numbers</p><p>Streets in major Chinese cities were eerily quiet on Sunday as people opted to stay home to protect themselves from a surge in Covid-19 cases that has hit urban centres from north to south as officials warn of more waves to come.</p><p>The latest official figures continue to show a relatively low number of new daily cases, however concerns linger over the accuracy of the data amid reports of over-burdened funeral homes and crematoriums.</p> <a href=\"https://www.theguardian.com/world/2022/dec/19/china-covid-waves-winter-cities-quiet\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/australia-news/2022/dec/19/child-in-queensland-hospital-after-dingo-attack-near-camping-ground-on-kgari", "title": "Child in Queensland hospital after ‘terrifying’ dingo attack near camping ground on K’gari", "date_published": "2022-12-19 03:12:47+00:00", "description": "<p>Father able to stop the attack on the five-year-old boy, who was bitten multiple times while playing on a beach</p><ul><li><strong><a href=\"https://www.theguardian.com/australia-news/live/2022/dec/19/australia-news-live-pitch-invaders-dingo-housing-health-economy-politics-floods-albanese-dutton-vic-qld-nsw\">Follow our Australia news live blog for the latest updates</a></strong></li><li><strong>Get our <a href=\"https://www.theguardian.com/australia-news/2022/oct/29/email-newsletters-guardian-australia-best-daily-news-emails-newsletter-free-sign-up-inbox-subscribe-headlines?CMP=cvau_sfl\">morning and afternoon news emails</a>, <a href=\"https://www.theguardian.com/technology/ng-interactive/2018/may/15/the-guardian-app?CMP=cvau_sfl\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></strong></li></ul><p>A young boy who is in hospital after being attacked by a dingo in Queensland is stable and “doing well”, a spokesperson from Hervey Bay hospital has said.</p><p>The child, aged five, was bitten on the head, arm, and buttocks at the remote Ocean Lake camping area in K’gari (Fraser Island) on Sunday afternoon.</p> <a href=\"https://www.theguardian.com/australia-news/2022/dec/19/child-in-queensland-hospital-after-dingo-attack-near-camping-ground-on-kgari\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/news/audio/2022/dec/19/three-prime-ministers-and-a-funeral-marina-hydes-political-year", "title": "Three prime ministers and a funeral: Marina Hyde’s political year", "date_published": "2022-12-19 03:00:06+00:00", "description": "<p>The Guardian’s award-winning columnist Marina Hyde picks over the political year</p><p>For political satire writers, such as the Guardian’s <strong>Marina Hyde, </strong>there can scarcely have been a more plentiful year of source material than 2022. The UK burned through two prime ministers before settling on Rishi Sunak. But only after a self-inflicted financial meltdown to rival that of 2008.</p><p>All of this before the supporting cast is mentioned. Marina tells <strong>Nosheen Iqbal </strong>that, as well as the revolving door in Downing Street, we saw Matt Hancock relaunch his political career in the Australian jungle between mouthfuls of cow anus. And there was Suella Braverman’s pop at the Guardian-reading wokerati before being fired and then re-hired. It’s a high bar for 2023 to top.</p> <a href=\"https://www.theguardian.com/news/audio/2022/dec/19/three-prime-ministers-and-a-funeral-marina-hydes-political-year\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/19/hawaii-flight-turbulence-injures-20-passengers-11-seriously", "title": "Hawaii flight turbulence injures 20 passengers, 11 seriously", "date_published": "2022-12-19 01:59:26+00:00", "description": "<p>A 14-month-old among those taken to hospital after severe turbulence on flight from Arizona to Hawaii</p><p></p><p>Eleven people were seriously injured when a flight to Hawaii was rocked by severe turbulence about 30 minutes outside Honolulu, emergency services have said.</p><p>Nine others were transported in a stable condition, the Honolulu Emergency Medical Services said in a statement.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/19/hawaii-flight-turbulence-injures-20-passengers-11-seriously\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/19/freak-wave-kills-three-at-south-african-beach", "title": "‘Freak wave’ kills three at South African beach", "date_published": "2022-12-19 01:39:29+00:00", "description": "<p>The wave reportedly swept a group of beachgoers against the pier, emergency services said</p><p>Three people have died after they were hit by a large wave at a beach in South Africa’s coastal city of Durban on Sunday, emergency officials said.</p><p>The emergency medical services “responded to reports of a freak wave that swept a group of beachgoers against the pier causing multiple injuries” at North Beach, spokesperson Njabulo Dlungele said in a <a href=\"https://twitter.com/njabulodlungele/status/1604352902113497089\">statement</a> on Sunday night.</p> <a href=\"https://www.theguardian.com/world/2022/dec/19/freak-wave-kills-three-at-south-african-beach\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/artanddesign/2022/dec/19/pope-francis-orders-parthenon-marbles-held-by-vatican-be-returned-to-greece", "title": "Pope Francis orders Parthenon marbles held by Vatican be returned to Greece", "date_published": "2022-12-19 00:51:14+00:00", "description": "<p>Three 2,500-year-old pieces will be ‘donated’ to Greece’s Archbishop Ieronymos II amid wider conversation about future of Parthenon marbles held by Britain</p><p>Pope Francis has decided to return to Greece three 2,500-year-old pieces of the Parthenon that have been in the papal collections of the Vatican Museums for two centuries.</p><p>The Vatican said in a brief statement that the pope was giving them to Archbishop Ieronymos II, the head of the Greek Orthodox Church and Greece’s spiritual leader, as a “donation” and “a concrete sign of his sincere desire to follow in the ecumenical path of truth”.</p> <a href=\"https://www.theguardian.com/artanddesign/2022/dec/19/pope-francis-orders-parthenon-marbles-held-by-vatican-be-returned-to-greece\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/19/russia-ukraine-war-at-a-glance-what-we-know-on-day-299-of-the-invasion", "title": "Russia-Ukraine war at a glance: what we know on day 299 of the invasion", "date_published": "2022-12-19 00:27:18+00:00", "description": "<p>Britain to announce major new artillery package for Ukraine; Ukraine says Russian shelling targeted Kherson as its forces continue to hold on to Bakhmut</p><ul><li><strong><a href=\"https://www.theguardian.com/world/ukraine\">See all our Ukraine war coverage</a></strong></li></ul> <a href=\"https://www.theguardian.com/world/2022/dec/19/russia-ukraine-war-at-a-glance-what-we-know-on-day-299-of-the-invasion\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/19/pdc-darts-aspinall-flies-past-krcmar-after-heta-beats-former-champion-lewis", "title": "PDC darts: Aspinall flies past Krcmar after Heta beats former champion Lewis", "date_published": "2022-12-19 00:03:31+00:00", "description": "<ul><li>No 10 seed Aspinall shows career threatening injury behind him</li><li>Woodhouse beats Omelchenko to set up Price meeting</li></ul><p>Nathan Aspinall got his PDC World Darts Championship campaign up and running with a 3-1 win over Boris Krcmar.</p><p>The 32-year-old 10th seed from Stockport, who less than a year ago suffered a wrist injury which left him fearing for his career, overcame a slow start for an ultimately comfortable victory. Aspinall, a two-time semi-finalist at Alexandra Palace, took the first set from two legs down thanks largely to some dodgy finishing from his Croatian opponent.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/19/pdc-darts-aspinall-flies-past-krcmar-after-heta-beats-former-champion-lewis\">Continue reading...</a>", "persistent": false, "language": "en-US"}], "source": {"url": "https://www.theguardian.com/international/rss", "title": "The Guardian - International"}}