[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best PlayStation Plus Games December 2022", "description": "Brought to you by PlayStation Plus. The holidays are coming and there's plenty of gaming to be done. Here's your rundown of everything coming to PS+ this month. \n\nWe’re approaching the end of the year, and for many, that means work is winding down and we get to go home and hang out with family and friends for the holidays. It also gives us time to play a bunch of video games. If you're not sure what to play, then don't worry, we've got you covered with our rundown of everything coming to PS+ this month, as well as our recommendations for games to play with your loved ones this month.\n\nOn top of monthly games like Mass Effect Legendary Edition, Divine Knockout, and Biomutant, PlayStation Plus is adding numerous titles to its growing Games and Classics Catalog. Take to the ring in WWE2K22, stop a cult leader Far Cry 5, and hunt some orcs in Middle-earth Shadow of Mordor and War. There are also a number of Yakuza titles joining the Game Catalog, including Judgment and Like A Dragon. \n\nThe Classics Catalog is also getting some love, with Ridge Racer 2, Heavenly Sword, Oddworld Abe’s Exoddus and more joining the roster. We also list our recommendations for co-op games to play with your friends and family over the holidays. Some, like Brothers: A Tale of Two Sons will bring you together, and others, like Overcooked 2, might tear you apart, but at least it'll all be a fun time. \n\nThere are new games coming to PS Plus every month, so to keep up to date, make sure to subscribe to GameSpot.\n\n#playstationplus #psplus #gaming", "link": "https://www.youtube.com/watch?v=_y7kQsXXoXA", "date_published": "2022-12-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Biggest Xbox Games Coming In 2023 And Beyond", "description": "Xbox has had quite the year. But, 2023 is a new start with some very anticipated games coming out. Here are some of the biggest games you have to look forward to in 2023 and beyond. \n\nFrom Starfield to Hollow Knight to Vin Diesel on a dinosaur, Xbox has some exciting games coming out in 2023 and beyond. Dave Klein takes us through the most anticipated Xbox games of the coming year. \n#gaming #xbox #gamespot #starfield #hollowknight #redfall \n\nTimestamps:\n00:00 Intro\n00:26 Starfield\n01:13 Redfall\n02:09 Planet of Lana\n02:43 Hollow Knight: Silk Song\n04:04 Forza Motorsport\n04:36 S.T.A.L.K.E.R. 2\n05:30 ARK 2\n06:26 Fable\n07:22 Senua's Saga: Hellblade II\n08:11 Outro", "link": "https://www.youtube.com/watch?v=wP_YMCVyiIA", "date_published": "2022-12-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "DualSense Edge Hand-On Preview", "description": "PlayStation is leaping into the world of prosumer controllers with the DualSense Edge.\n#GameSpot #PS5 #DualSenseEdge\n\nThe DualSense Edge feels and looks nearly identical to the DualSense controller. DualSense Edge lead product manager Tomomasa Mizuno assured me that this was an intentional decision so as to not alienate players who've already spent hundreds of hours with the standard DualSense. If you've held a PlayStation 5 controller before, then you know what the Edge will feel like in your hands. The biggest changes to the ergonomics are the new, rubbery grips on the back of the controller, the two function buttons, the trigger stops, and the customizable paddle buttons in the back.\n\nThe most useful additions to the DualSense Edge are the two function buttons located just below the analog sticks. Holding one down brings up a menu that allows you to quickly switch controllers profiles, adjust headset volume, and pop into a menu to tweak your controller settings. The function buttons feel like a natural extension of the DualSense that makes it easier to access key features you're likely to need in a gaming session. Their location makes them hard to misclick during heated moments, yet they are easy to access mid-game.\n\nLike the Elite, the controller, along with the charging cable, swappable stick caps, back buttons, and a cord lock are all packaged in a white hardshell carrying case with a hole in the back for easy charging. Overall, the DualSense Edge feels like a nice option for PlayStation owners that might have been looking at Xbox's offerings with pro-controller envy. For $200, you'll get a controller that has a familiar form factor, improved ergonomics, some new feature options, and a good level of customizability.", "link": "https://www.youtube.com/watch?v=I_laa7b6gU8", "date_published": "2022-12-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "23 Best Free PC Games to Play in 2022", "description": "Gaming isn't a cheap hobby unless you're prepared to get dirty while scratching at the bottom of a bargain bin. Fortunately there are plenty of games that'll appeal to anyone who has to juggle a tight budget. The current landscape of video games is overflowing with free-to-play titles from Fortnight to Apex Legends to Overwatch 2, so here’s our list of the best free PC Games to play in 2022.\n\nTimestamps: \n\n0:00 - Intro\n0:35 - Apex Legends\n1:15 - Call of Duty: Warzone 2\n2:01 - Multiversus\n2:50 - Marvel Snap\n3:35 - Overwatch 2\n4:18 - Bleakshore\n5:00 - Counter-Strike: Global Operations\n5:33 - Dauntless\n6:03 - Destiny 2\n6:50 - Dota 2\n7:22 - Fortnite\n8:00 - Genshin Impact\n8:38 - Guild Wars 2\n9:11 - GWENT\n10:00 - Hearthstone\n10:30 - League of Legends\n11:09 - Path of Exile\n11:35 - Planetside 2\n12:08 - Smite\n12:33 - Team Fortress 2\n13:07 - Rocket League\n13:39 - Valorant\n14:05 - Warframe\n14:44 - Outro", "link": "https://www.youtube.com/watch?v=e4qOtEjEgR8", "date_published": "2022-12-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Biggest PlayStation Games Coming in 2023 and Beyond", "description": "2023 promises to bring new entries from the biggest and best in PlayStation’s library, as well as new experiences that are sure to pique your interest. \n\nFrom stand-out AAA experiences like God of War Ragnarok to smaller titles that stole my heart like Stray, we've had a great year on the PlayStation family of consoles in 2022. But now, I want to look ahead to 2023 and the promise that the future of PlayStation gaming holds. These are the biggest PlayStation games coming out in 2023 and beyond. \n\nTimestamps:\n00:00 Intro\n00:36 Final Fantasy XVI\n01:09 Spider-Man 2\n01:31 Final Fantasy VII Rebirth\n02:07 Rise Of The Ronin\n02:52 Forspoken\n03:25 Silent Hill 2\n04:00 Horizon Call Of The Mountain\n04:24 PSVR 2 Lineup\n04:49 Last Of Us Multiplayer \n05:21 Lost Soul Aside\n06:03 Wolverine\n06:24 Stellar Blade \n06:59 DS2\n07:26 KOTOR Remake\n07:52 Outro", "link": "https://www.youtube.com/watch?v=K51kw5-KoWg", "date_published": "2022-12-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Assassin’s Creed Jade Gameplay Leaks | GameSpot News", "description": "Gameplay of Assassin’s Creed Codename: Jade has reportedly surfaced online and features the game’s combat and traversal as well as a cutscene.\n#GamingNews #AssassinsCreed #Leak\n\nCodename Jade is set in China, but fans won’t be seeing the return on AC Chronicles: China protagonist Shoa Jun. Jade will feature a completely new character who is reportedly fully customizable. At this time the game does not have any type of release date information available, but if I were to guess based on the alleged gameplay, I’d guess it's not super far off at this point.  \n\nDon’t recall Jade even getting announced? Well that might be because it was stuffed into an AC Showcase earlier this year alongside the announcement of AC Mirage, Codename Red and Codename Hexe. Red will take place in Japan, while Hexe remains more of a mystery. None of these game have release information either, but earlier this month there were rumors of Mirage looking at an August launch. According to Insider Gaming, the game has already been delayed internally twice, but Ubisoft planned for it to come out earlier in 2023. \n\nWhile you wait for those AC experiences to become available, why not jump into Witcher 3 Wild Hunt. The 2015 game just got its highly anticipated next-gen update that added ray tracing, a photo mode, new camera options and more. Unfortunately for PC players, the update was a bit broken, causing many to revert their version of the game to a previous version. CD Projekt Red promised to solve the issues and today the game has received its first post hot fix on PC since release of the 4.0 update. This fix weighs in at around 2GB on Steam and on Twitter the dev said it should “ improve the overall stability and performance, and fix GOG & Steam overlays. The game version won’t change.”", "link": "https://www.youtube.com/watch?v=e9mSHQ2JshQ", "date_published": "2022-12-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]