{"entries": [{"source": "https://www.pcworld.com/index.rss", "link": "https://www.pcworld.com/article/1439495/shipment-makes-call-of-duty-modern-warfare-2s-worst-parts-fun.html", "title": "Shipment makes Call of Duty: Modern Warfare 2’s worst parts fun", "date_published": "2022-12-19 20:29:58+00:00", "description": "<div id=\"link_wrapped_content\">\n<section class=\"wp-block-bigbite-multi-title\"><div class=\"container\"></div></section>\n\n\n\n<p>I spent the last full weekend before Christmas doing two things: Baking approximately a bajillion cookies with my kid and girlfriend, and relentlessly playing <em><a href=\"https://go.redirectingat.com/?id=111346X1569483&amp;url=https://www.callofduty.com/modernwarfare2/pc&amp;xcust=2-1-1439495-1-0-0&amp;sref=https://www.pcworld.com/feed\" rel=\"nofollow\">Call of Duty: Modern Warfare 2</a></em>&rsquo;s brand-new Shipment map with my squad. (Shoutout HOPO crew!) It couldn&rsquo;t have come at a better time, because its sheer glorious insanity papers over my deepest grievances with the ultra-popular shooter.</p>\n\n\n\n<p><em>COD </em>vets will be intimately familiar with Shipment, a close-quarters map that has shipped in several iterations of the game. While the other, larger 6-vs.-6 maps in <em>MW2</em> feature a mixture of close-, mid-, and long-range action, the boxed-in Shipment map forces constant in-your-face action. You often respawn already in enemy sights. Heck, you can even respawn in the midst of a hail of gunfire or explosions, getting mowed down before you even have a chance to get your gun up.</p>\n\n\n\n<p>But here&rsquo;s the thing: Those terrible respawns work on Shipment. I needed the breath of fresh air after struggling with <em>COD:MW2</em>&rsquo;s atrocious respawn system on all the other maps.</p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n\n</div></figure>\n\n\n\n<p>Head over to the <em>MW2 </em>subreddit&mdash;or simply play the game for a few matches&mdash;and you&rsquo;ll witness endless complaints about this version&rsquo;s terrible respawn system. Activision Blizzard clearly switched to a respawn system that favors proximity to your teammates over safe entry. As a result, you&rsquo;ll often wind up spawning to an enemy mowing down a teammate directly in front of you, then you immediately after. It&rsquo;s especially bad if the game&rsquo;s just-as-terrible matchmaking feature pairs you up against a squad of bunny-hopping esports wannabes decked-out in CDL skins who are able to lock your team down in your respawn area.</p>\n\n\n\n<p>The respawns are straight <em>infuriating</em> on the larger maps&mdash;Activision deeply needs to consider reworking the mechanic, because it&rsquo;s trash&mdash;but in Shipment, all you can do is laugh and hop back into it. Grinding the Shipment 24/7 playlist over the weekend helped take the sting out of the all-too-occasionally wonky spawns you encounter in larger maps. It&rsquo;s brought joy to <em>Call of Duty: Modern Warfare 2 </em>at a time when I was starting to feel burnt out.</p>\n\n\n\n<p>The specific way Activision introduced Shipment last week helped alleviate some of my other complaints, too.</p>\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img alt=\"COD:MW 2 Shipment map\" class=\"wp-image-1439503\" height=\"675\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/12/MWII-S01-SHIPMENT-007.jpg?quality=50&amp;strip=all&amp;w=1200\" width=\"1200\" /></figure><p class=\"imageCredit\">Activision Blizzard</p></div>\n\n\n\n<p><em>Call of Duty: Modern Warfare 2</em>&rsquo;s matchmaking system feels overly punishing in its quest to keep all players around a 1:1 kill:death ratio. Woe unto you if you have a few good games, because you&rsquo;ll be cast into hell with those sweaty CDL wannabes for several rounds and get absolutely stomped. It&rsquo;s another massive complaint on <em>MW2</em> forums&mdash;but Shipment is so utterly <em>nuts</em> that you don&rsquo;t feel its effects whatsoever. When everyone is spawning in with enemies in sight, everyone dies <em>all the time</em>, regardless of skill level. It&rsquo;s a hoot.</p>\n\n\n\n<p>Launching Shipment on a double XP weekend also helped me with a part of the game I especially dislike&mdash;weapons attachments. I usually stick to shotguns and light machine guns in game. I don&rsquo;t care about trying to level up every weapon in every category. But in <em>MW2</em>, some of the stat-boosting attachments for your guns only unlock if you level up <em>entirely different types</em> of weapons. It sucks. I don&rsquo;t want to level up assault rifles just to get a snazzy laser for my one-hit-kill Lockwood shottie setup. I just want eviscerate folks with my shotgun. Rather than force myself to play with weapons I don&rsquo;t like, I&rsquo;ve simply sighed and accepted I won&rsquo;t have the attachments I&rsquo;d like to have.</p>\n\n\n\n<p>Enter Shipment.</p>\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img alt=\"Weapons attachments in COD:MW2\" class=\"wp-image-1439507\" height=\"675\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/12/20221219151003_1.jpg?quality=50&amp;strip=all&amp;w=1200\" width=\"1200\" /><figcaption><p>Each weapon in <em>COD:MW2</em> features several attachment slots with multiple unlockable items for each slot&mdash;but leveling up your particular chosen weapons alone won&rsquo;t unlock all of them.</p> </figcaption></figure><p class=\"imageCredit\">Brad Chacos/IDG</p></div>\n\n\n\n<p>Again, <em>COD </em>vets are used to grinding gun camos on Shipment&mdash;but it was spectacular for finally unlocking those missing attachments too. Shipment is so gloriously wild that <em>any </em>gun is fun on it. So I tuned my class to maximize experience gains via decoy grenades and scorestreaks over skill streaks, loaded up select weapons that offered the specific attachments I wanted (and previously thought I&rsquo;d never get), and went absolutely ham. Since Thursday I&rsquo;ve maxed out all my shotguns, all my LMGs, a couple sniper rifles, several starter assault rifles that unlocked additional LMGs at higher levels, and then <em>those </em>LMGs, hoovering up endless glorious attachments in the process.</p>\n\n\n\n<p>Shipment is so small that decoy grenades give you XP when your teammates kill enemies basically anywhere on the map. With scorestreaks active and double XP, I was getting anywhere from 4 to 8 levels on my primary gun <em>per match</em>. I could take a fresh gun and max it out over lunch. Yes, please.</p>\n\n\n\n<p>Of course, while Shipment&rsquo;s chaotic existence papers over <em>MW2</em>&rsquo;s most egregious flaws, it doesn&rsquo;t actually <em>fix</em> any of them, and you&rsquo;ll feel the pain during regular matchmaking. (Shipment also drives home how deeply broken Riot Shields are when you use the Overkill perk to keep one protecting your back.) There&rsquo;s still a lot of work to be done. But all that said, playing Shipment 24/7 during double XP weekend was an absolute blast&mdash;the best time I&rsquo;ve had in <em>Call of Duty: Modern Warfare 2</em> since its opening weekend.</p>\n\n\n\n<p>A special Christmas Shipment map opens on December 21 and lasts through January 4. Bring on the Christmas noobs&mdash;I&rsquo;m feeling reinvigorated and my laser-like Lockwood 300 is <em>hungry</em>.</p>\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img alt=\"COD:MW 2 Shipment map\" class=\"wp-image-1439497\" height=\"675\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/12/MWII-S01-SHIPMENT-005.jpg?quality=50&amp;strip=all&amp;w=1200\" width=\"1200\" /></figure><p class=\"imageCredit\">Activision Blizzard</p></div>\n\nGaming</div>", "persistent": false, "language": "en-US"}, {"source": "https://www.pcworld.com/index.rss", "link": "https://www.pcworld.com/article/1439096/nvidia-will-shut-down-gamestream-for-the-shield-soon.html", "title": "RIP GameStream: Nvidia’s Shield TV will stop playing games from your PC", "date_published": "2022-12-19 15:33:52+00:00", "description": "<div id=\"link_wrapped_content\">\n<section class=\"wp-block-bigbite-multi-title\"><div class=\"container\"></div></section>\n\n\n\n<p>Seven years after its initial launch, the <a href=\"https://www.techhive.com/article/584131/nvidia-shield-tv-2019-review.html\">Nvidia Shield TV</a> is still held up as one of the best premium set-top boxes on the market. That&rsquo;s mostly due to its streaming video prowess, but there&rsquo;s also the <a href=\"https://go.redirectingat.com/?id=111346X1569483&amp;url=https://www.nvidia.com/en-us/shield/support/shield-tv/gamestream/&amp;xcust=2-1-1439096-1-0-0&amp;sref=https://www.pcworld.com/feed\" rel=\"nofollow\" target=\"_blank\">GameStream system</a>, which let gamers stream PC games from a local Nvidia-powered laptop or desktop. Despite heavily advertising the technology since the original Shield Portable, Nvidia will shut down the streaming service in February. </p>\n\n\n\n<p>The Shield TV&rsquo;s GameStream feature runs on a local network, and needs a powerful PC in the same building in order to work. <a href=\"https://www.pcworld.com/article/630335/geforce-now-review.html\" rel=\"noreferrer noopener\" target=\"_blank\">It shouldn&rsquo;t be confused with Nvidia GeForce Now</a>, the cloud gaming service which streams PC games from an Nvidia data center (and which charges for its most premium features). The latter seems to be the focus of Nvidia&rsquo;s streaming strategy going forward, and doesn&rsquo;t appear to be in danger of disappearing at the time of writing. </p>\n\n\n\n<p>GameStream <a href=\"https://www.pcworld.com/article/443949/nvidia-shields-gamestream-pc-streaming-is-a-tantalizing-taste-of-the-future.html\" rel=\"noreferrer noopener\" target=\"_blank\">began its life on the original Shield</a>, the chunky, Android-powered portable that debuted in 2013. At the time it was the best option on the market for low-latency streaming PC games from a desktop to a portable device, even if it did require high-end network equipment to work well. The Shield Portable never got a second-generation device (ditto for the Shield Tablet) but the GameStream service remained a banner feature as Nvidia transitioned the brand into a powerful gaming-focused set-top box. </p>\n\n\n\n<p>The market is in a different place today. GameStream will disappear with a device update in February 2023. The short email doesn&rsquo;t give a reason for the shutdown, but it&rsquo;s a safe guess that the company is transitioning resources from a product feature that&rsquo;s probably seldom-used into GeForce Now, and the potential subscription revenue it might generate. That&rsquo;s understandable, but GeForce Now isn&rsquo;t a one-to-one replacement for GameStream: its library is limited (with some publishers like Activision absent entirely) and users can&rsquo;t adjust most graphical settings. </p>\n\n\n\n<p>In its announcement email, Nvidia suggests gamers replace GameStream with <a href=\"https://www.pcworld.com/article/403427/steam-link-anywhere-lets-you-play-your-steam-library-on-the-go.html\" rel=\"noreferrer noopener\" target=\"_blank\">Steam Link</a>, which works well on the Android TV-powered device. Other services like <a href=\"https://www.pcworld.com/article/406860/how-to-stream-pc-games-anywhere.html\" rel=\"noreferrer noopener\" target=\"_blank\">Moonlight</a> also fit that particular niche. </p>\n\nGaming PCs</div>", "persistent": false, "language": "en-US"}, {"source": "https://www.pcworld.com/index.rss", "link": "https://www.pcworld.com/article/1434534/roccat-kone-pro-gaming-mouse-review.html", "title": "Roccat Kone Pro review: Lightweight gaming with speed and precision", "date_published": "2022-12-19 14:48:50+00:00", "description": "<div id=\"link_wrapped_content\">\n<section class=\"wp-block-bigbite-multi-title\"><div class=\"container\"></div></section>\n\n\n<div class=\"review\" id=\"review-body\"><img alt=\"Editors' Choice\" class=\"review-logo\" src=\"https://www.pcworld.com/wp-content/uploads/2021/09/PC-ED-CHOICE.png\" /><span class=\"review-title\">At a glance</span><h3 class=\"review-subTitle\" id=\"experts-rating\">Expert's Rating</h3><div class=\"starRating\"></div>\n<div><div class=\"review-columns\"><div class=\"review-column\"><h3 class=\"review-subTitle\" id=\"pros\">Pros</h3><ul class=\"pros review-list\"><li>The 19,000 DPI sensor is very precise, and the buttons are quick and clicky </li><li>An ingenious design elevates your trigger finger ready to fire</li><li>A lightweight body adds to its speed and precision and prevents fatigue  </li></ul></div><div class=\"review-column\"><h3 class=\"review-subTitle\" id=\"cons\">Cons</h3><ul class=\"cons review-list\"><li>No dedicated DPI button means you can&rsquo;t as easily switch DPI settings </li><li>Wired connectivity only, so you&rsquo;ll need to plug it in to play</li><li>The mouse wheel lacks lateral left / right clicks</li></ul></div></div></div><h3 class=\"review-subTitle review-subTitle--borderTop\" id=\"our-verdict\">Our Verdict</h3><p class=\"verdict\">The Roccat Kone Pro is a formidable gaming mouse with a lightweight design that makes it quick off the mark on your mouse mat. It also has impressively fast buttons and looks very stylish thanks to two dazzling RGB lighting zones.</p>\n</div>\n\t\t\t\t<h3 class=\"review-best-price\" id=\"best-prices-today-roccat-kone-pro\">\n\t\t\tBest Prices Today: ROCCAT Kone Pro\t\t</h3>\n\t\t\t\t<div class=\"wp-block-price-comparison price-comparison \">\n\t\t\t<div class=\"price-comparison__record price-comparison__record--header\">\n\t\t\t\t<div>\n\t\t\t\t\t<span>Retailer</span>\n\t\t\t\t</div>\n\t\t\t\t<div class=\"price-comparison__price\">\n\t\t\t\t\t<span>Price</span>\n\t\t\t\t</div>\n\t\t\t</div>\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div class=\"price-comparison__record\">\n\t\t\t\t\t\t\t<div class=\"price-comparison__image\">\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<img alt=\"Amazon\" src=\"https://www.pcworld.com/wp-content/themes/idg-base-theme/dist/static/img/amazon-logo.svg\" />\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div class=\"price-comparison__price\">\n\t\t\t\t\t\t\t\t<span>$39.99</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<a class=\"price-comparison__view-button\" href=\"https://go.redirectingat.com/?id=111346X1569483&amp;url=https://www.amazon.com/dp/B091BLFTT2?tag=pcworld02-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;xcust=2-1-1434534-2-1434528-0&amp;sref=https://www.pcworld.com/feed\" rel=\"nofollow\" target=\"_blank\">View Deal</a>\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div class=\"price-comparison__record\">\n\t\t\t\t\t\t\t<div class=\"price-comparison__image\">\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>ROCCAT</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div class=\"price-comparison__price\">\n\t\t\t\t\t\t\t\t<span>$39.99</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<a class=\"price-comparison__view-button\" href=\"https://go.redirectingat.com/?id=111346X1569483&amp;url=https://www.roccat.com/products/kone-pro&amp;xcust=2-1-1434534-2-1434528-0&amp;sref=https://www.pcworld.com/feed\" rel=\"nofollow\" target=\"_blank\">View Deal</a>\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t<div class=\"price-comparison__record price-comparison__record--footer\">\n\t\t\t\t\t<span class=\"price-comparison__footer-text\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tPrice comparison from over 24,000 stores worldwide\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\n\n\n<p>Weighing just 66 grams, the right-hand-centric, wired Roccat Kone Pro sports one of Roccat&rsquo;s iconic &ldquo;Kone&rdquo; designs, eschewing the symmetry of the company&rsquo;s Burst lineup for more curves and arguably a lot more user control.</p>\n\n\n\n<p>Accordingly, it has wave-shaped grooves on its flanks that provide plenty of grip, and up top, a gentle left-to-right slant poises your trigger finger at the highest point ready to fire. Add to those winning traits, a very precise 19,000 DPI optical sensor and extremely quick optical switches, and by virtue, then, the Kone Pro is an extremely effective gaming mouse for FPS gamers.</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><em>This review is part of our ongoing roundup of the <a href=\"https://www.pcworld.com/article/452384/best-gaming-mice.html\">best gaming mice</a>. Go there to learn about competing products, what to look for in a gaming mouse, and buying recommendations.</em></p></blockquote>\n\n\n\n<h3 id=\"roccat-kone-pro-design-and-build\">Roccat Kone Pro: Design and build</h3>\n\n\n\n<p>Its main merits established, there&rsquo;s a lot more to like about the Kone Pro&rsquo;s design. In fact, you could say it&rsquo;s the mouse&rsquo;s best asset, providing the right amount of comfort without compromising on performance. Size-wise, the 4.94 x 1.57 x 2.83 inches are smack-on to fit large to medium hands, and the shape works perfectly with any of the three main grip types.</p>\n\n\n\n<p>The modest eight-button selection is also ideal for quick action games where you have only a few commands to remember&mdash;so fans of the <em>Call of Duty</em>, <em>Battlefield</em>, or similar franchises, are well advised to take note. In addition to the two main clicks, you get two buttons on the left-hand side and a mouse wheel with forward, backward, and downward functionality. An extra button on the underside switches between your onboard profiles.</p>\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img alt=\"\" class=\"wp-image-1434563\" height=\"900\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/12/Red-image-1.jpg?quality=50&amp;strip=all&amp;w=1200\" width=\"1200\" /><figcaption><p>The Roccat Kone Pro&rsquo;s top has a slight left-to-right slant that poises your index finger ready to click.&nbsp;</p>\n</figcaption></figure><p class=\"imageCredit\">Dominic Bayley / IDG</p></div>\n\n\n\n<p>The main buttons are generously proportioned, such that I could easily get two whole fingers on the right one. To my delight, I found that using an extra digit here gave me millisecond-faster aiming that made a big impact on my gaming.</p>\n\n\n\n<p>Roccat has done extremely well giving the Kone Pro a thin plastic coating. As well as enabling its 66-gram weight, this outer shell is largely responsible for its stunning looks. The Kone Pro has just two RBG zones at the front beneath the main clicks but the thin casing lets just enough light pass through it to create a mesmerizing glow effect.</p>\n\n\n\n<p>This dazzling RGB bathes your fingers in colorful light, ensuring you always get a spectacle when you look down, no matter whether you&rsquo;ve opted for the black or the white color option at the checkout.</p>\n\n\n\n<p>Simple wired connectivity is another way Roccat has achieved such a lightweight design. By comparison the wireless version, the Kone Pro Air, weighs an extra nine grams. But the 1.8-meter USB-A to USB-C cable doesn&rsquo;t feel cheap, being both very flexible and strong. It also comes with a useful cap to prevent dust and moisture getting inside.</p>\n\n\n\n<h3 id=\"roccat-kone-pro-software\">Roccat Kone Pro: Software</h3>\n\n\n\n<p>Swarm is Roccat&rsquo;s supporting software app where, among other things, you can assign functions to the eight programmable buttons, make changes to the RGB lighting, and build out its five onboard memory profiles. The text in Swarm can be a little small and difficult to read at times, but to its credit the app goes above and beyond in regard to what you can modify.</p>\n\n\n\n<p>For the button assignment, for instance, you can expand the generic eight commands to 16 by making one of the Kone Pro&rsquo;s buttons an Easy Shift [+] trigger. Doing this allowed me to play (and stand a chance in) RPG and MMO games where a bigger command bank is an asset, so making this change was definitely worth the hassle.</p>\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-full\"><img alt=\"\" class=\"wp-image-1434570\" height=\"664\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/12/Kone-Pro-Button-assignment.png\" width=\"1024\" /><figcaption><p>You can increase the number of commands with Roccat&rsquo;s Easy-Shift [+] setting.&nbsp;</p>\n</figcaption></figure><p class=\"imageCredit\">Dominic Bayley / IDG</p></div>\n\n\n\n<p>The options for assigning DPI are also very thorough. You can set values between 50 to 19,000 in increments of 50 units, or else make use of a calibration tool that sets you an approximate DPI based on your movements. Regrettably, however, the Kone Pro lacks a dedicated DPI button, so you can&rsquo;t simply switch between DPI settings at will in games without setting up another button in Swarm to do so beforehand, or else changing profiles.</p>\n\n\n\n<p>That said, if you&rsquo;re the kind of gamer that likes to just set and forget, you may find yourself spending a lot more time in Swarm than you would otherwise want to, which can get a little tedious.</p>\n\n\n\n<h3 id=\"roccat-kone-pro-performance\">Roccat Kone Pro: Performance</h3>\n\n\n\n<p>The Kone Pro sports the same 19,000 DPI Owl-Eye optical sensor as the <a href=\"https://www.pcworld.com/article/1418294/roccat-burst-pro-air-wireless-gaming-mouse-review.html\">Roccat Burst Pro Air</a>&mdash;another of our recent PCWorld reviews. Consequently, it can track movement at 400 IPS (inches per second) and has an adjustable liftoff distance&mdash;a feature that pro gamers especially will find useful.</p>\n\n\n\n\t\t<div class=\"wp-block-product-widget-block product-widget is-half-width is-float-right\">\n\t\t\t<div class=\"product-widget__block-title-wrapper\">\n\t\t\t\t<h4 class=\"product-widget__block-title\" id=\"mentioned-in-this-article\">\n\t\t\t\t\tmentioned in this article\t\t\t\t</h4>\n\t\t\t</div>\n\n\t\t\t<div class=\"product-widget__content-wrapper\">\n\t\t\t\t\t\t\t\t\t<div class=\"product-widget__title-wrapper\">\n\t\t\t\t\t\t<h3 class=\"product-widget__title\" id=\"roccat-burst-pro-air\">ROCCAT Burst Pro Air</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div class=\"product-widget__image-outer-wrapper\">\n\t\t\t\t\t\t<div class=\"product-widget__image-wrapper\">\n\t\t\t\t\t\t\t<img alt=\"ROCCAT Burst Pro Air\" class=\"product-widget__image\" height=\"3024\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/11/Lead.jpg?quality=50&amp;strip=all\" width=\"4032\" />\n\t\t\t\t\t\t</div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div class=\"review product-widget__review-details\">\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div class=\"product-widget__rating-and-review-link\">\n\t\t\t\t\t\t\t\t<div class=\"product-widget__review-details--rating\">\n\t\t\t\t\t\t\t\t\t\t\t<div class=\"starRating\"></div>\n\t\t\t\t\t\t\t\t\t\t</div>\t\t\t\t\t\t\t\t\t<a class=\"product-widget__review-link\" href=\"https://www.pcworld.com/article/1418294/roccat-burst-pro-air-wireless-gaming-mouse-review.html\" target=\"_blank\">Read our review</a>\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t<div class=\"product-widget__information\">\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t<div class=\"product-widget__pricing-details  \">\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span class=\"product-widget__pricing-details--label\">\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span class=\"product-widget__pricing-details--links-wrapper\">\n\t\t\t\t\t\t\t\t<a class=\"product-widget__pricing-details--link\" href=\"https://go.redirectingat.com/?id=111346X1569483&amp;url=https://www.amazon.com/dp/B09WX3MNYM?tag=pcworld02-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;xcust=2-1-1434534-5-1418255-0&amp;sref=https://www.pcworld.com/feed\" rel=\"nofollow\" target=\"_blank\">$65.77 at  Amazon</a>\t\t\t\t\t\t\t\t\t\t\t<span class=\"amp-bar\"> | </span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<a class=\"product-widget__pricing-details--link\" href=\"https://bestbuy.7tiv.net/c/321564/633495/10014?prodsku=6508305&amp;u=https%3A%2F%2Fapi.bestbuy.com%2Fclick%2F-%2F6508305%2Fpdp&amp;intsrc=CATF_4831&amp;subid1=2-1-1434534-5-1418255-0\" rel=\"nofollow\" target=\"_blank\">$74.99 at  Best Buy</a>\t\t\t\t\t\t\t\t\t\t\t<span class=\"amp-bar\"> | </span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<a class=\"product-widget__pricing-details--link\" href=\"https://go.redirectingat.com/?id=111346X1569483&amp;url=https://www.roccat.com/products/burst-pro-air?variant=41502004215966&amp;xcust=2-1-1434534-5-1418255-0&amp;sref=https://www.pcworld.com/feed\" rel=\"nofollow\" target=\"_blank\">79.99 at  ROCCAT</a>\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t</div>\n\t\t</div>\n\n\t\t\n\n\n<p>As this wasn&rsquo;t my first rodeo with this sensor, I was less interested in how it performed (it&rsquo;s a ripper) and more interested in how it could perform in a completely different design. To that end, I fired up <em>Call of Duty: Black Ops</em> to compare performance between the Kone Pro and the Burst Pro Air.</p>\n\n\n\n<p>My playtesting proved the Kone Pro to be the quicker, more precise gaming mouse, which I attribute to the Kone Pro&lsquo;s more generous PTFE glide skates on its underside, including around the sensor itself, which allowed for a smoother motion on my neoprene mouse mat.</p>\n\n\n\n<p>At just 66 grams, the Kone Pro also required much less effort to wield compared to the Pro Air, which is a full 15 grams heavier. This meant I could make much lighter and more precise movements and additionally play for longer than I could with the Burst Pro Air, without any uncomfortable tension in my wrist. Considering the Kone Pro currently ships for $35 cheaper, it seems overwhelmingly like the better value option.</p>\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img alt=\"\" class=\"wp-image-1434564\" height=\"900\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/12/Roccat-Kone-Pro-hand.jpg?quality=50&amp;strip=all&amp;w=1200\" width=\"1200\" /><figcaption><p>The RGB lighting zones sit underneath the main clicks, so they bathe your fingers in a dazzling RGB glow.&nbsp;</p>\n</figcaption></figure><p class=\"imageCredit\">Dominic Bayley / IDG</p></div>\n\n\n\n<p>The Kone Pro&rsquo;s buttons, which are powered by Titan Optical switches, also deserve praise. They actuated instantly and never mis-clicked. In fact, at times they were so quick that I found I&rsquo;d already relaxed for the countdown to respawn, only to find that I&rsquo;d come up trumps in firefights. Roccat rates them for 100 million clicks, so they should also be quite durable.</p>\n\n\n\n<p>The benefit of the sloping top also can&rsquo;t be emphasized enough. It provided the perfect leverage for my trigger finger, thereby allowing me to get a slight speed advantage when firing. A bonus for me was that the buttons also felt tactile and surprisingly cool to the touch on hot days, which added to my comfort in a big way when the temperature in my gaming den was pushing 86 degrees.</p>\n\n\n\n<h3 id=\"should-you-buy-the-roccat-kone-pro\">Should you buy the Roccat Kone Pro?</h3>\n\n\n\n<p>With the Kone Pro you get an attractive, lightweight, and affordable RGB gaming mouse with a precise sensor and very quick optical switches. True, it may lack a dedicated DPI button, and wireless connectivity, but a superb design that orientates your fingers for the quickest possible response more than makes up for these shortcomings. Consequently, if precision and speed are on your gaming-mouse wish list, then the Roccat Kone Pro is an excellent choice.</p>\n\nGaming Accessories, Mice</div>", "persistent": false, "language": "en-US"}, {"source": "https://www.pcworld.com/index.rss", "link": "https://www.pcworld.com/article/1438480/sae-40-on-this-razer-mechanical-gaming-keyboard.html", "title": "Save $40 on this luxurious Razer mechanical gaming keyboard", "date_published": "2022-12-19 14:45:35+00:00", "description": "<div id=\"link_wrapped_content\">\n<section class=\"wp-block-bigbite-multi-title\"><div class=\"container\"></div></section>\n\n\n\n<p>When it comes to gaming, switching to a mechanical keyboard makes a world of difference. I made the switch about a year ago and I&rsquo;ll never look back. From the pleasant click-clack sound of the keys to the colorful RGB lighting, it&rsquo;s a lot of fun to use, especially when I&rsquo;m gaming or writing. If you&rsquo;re looking for a mechanical keyboard, then you&rsquo;re in luck. Best Buy&rsquo;s currently selling the luxurious <a href=\"https://shop-links.co/link/?url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Frazer-huntsman-v2-full-size-wired-optical-red-linear-switch-gaming-keyboard-with-chroma-rgb-backlighting-black%2F6475696.p%3FskuId%3D6475696&amp;publisher_slug=pcworld&amp;exclusive=1&amp;article_name=pcworld&amp;article_url=https%3A%2F%2Fwww.pcworld.com%2Ffeed\" rel=\"nofollow\">Razer Huntsman V2 wired mechanical gaming keyboard for $159.99</a>, which saves you $40.  This keyboard has a lot to offer.</p>\n\n\n\n<p>The Razer Huntsman V2 has red linear switches, RGB lighting, and dedicated multimedia keys. According to Razer, the red linear switch has an actuation point of 1.2mm. That means you don&rsquo;t have to apply much force for a key stroke to register. The reviewers on Best Buy also claim that this keyboard is relatively silent, which is great news if you&rsquo;re not a big fan of clicky switches. </p>\n\n\n\n<p>This is a fantastic deal, but you better act now, as the holidays will be here and gone before you know it.</p>\n\n\n<p class=\"cta wp-block wp-block-button\"><a class=\"cta__btn\" href=\"https://shop-links.co/link/?url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Frazer-huntsman-v2-full-size-wired-optical-red-linear-switch-gaming-keyboard-with-chroma-rgb-backlighting-black%2F6475696.p%3FskuId%3D6475696&amp;publisher_slug=pcworld&amp;exclusive=1&amp;article_name=pcworld&amp;article_url=https%3A%2F%2Fwww.pcworld.com%2Ffeed\" rel=\"nofollow\" target=\"_blank\">Get the Razer Huntsman V2 wired mechanical gaming keyboard for $159.99</a></p>\nMice</div>", "persistent": false, "language": "en-US"}, {"source": "https://www.pcworld.com/index.rss", "link": "https://www.pcworld.com/article/1433015/microsofts-wins-fails-and-wtf-moments-of-2022.html", "title": "Microsoft’s wins, fails, and WTF moments of 2022", "date_published": "2022-12-19 11:45:00+00:00", "description": "<div id=\"link_wrapped_content\">\n<section class=\"wp-block-bigbite-multi-title\"><div class=\"container\"></div></section>\n\n\n\n<p>It&rsquo;s not unexpected to think that, after two years of a global pandemic that bounced employees and workers and supply chains around like billiard balls, that 2022 would be a little weird. And for Microsoft, it was: confusing, a bit random, but full of some unexpected successes.</p>\n\n\n\n<p>Microsoft&rsquo;s Surface division? Dull, but with a few sparks of life. Windows? Unexpectedly strange. As for the rest of it&hellip;yes, we definitely scratched our heads. As we sit next to our glowing monitor, a glass of (fortified?) egg nog next to our mousepad, here&rsquo;s the wins, fails, and <em>WTF?</em> moments of Microsoft&rsquo;s 2022.</p>\n\n\n\n<h2 id=\"surface-pro-9-5g-win\">Surface Pro 9 (5G): WIN</h2>\n\n\n\n<p>We were one of the few publications that actually <em>liked</em> the <a href=\"https://www.pcworld.com/article/1357826/microsoft-surface-pro-9-5g-review-an-arm-tablet-worth-buying.html\">Surface Pro 9 (5G)</a>, an Arm tablet that still suffers from some of the compatibility issues of its forebears. But the Surface-on-Arm premise has always been to power a few key Microsoft apps: Edge, Office, Teams, and so on. In this, the Surface Pro 9 (5G) performs well enough to earn our seal of approval.</p>\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img alt=\"Microsoft Surface Pro 9 (5G)\" class=\"wp-image-1359614\" height=\"922\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/10/primary-edited-copy-final.jpg?quality=50&amp;strip=all&amp;w=1200\" width=\"1200\" /></figure><p class=\"imageCredit\">Mark Hachman / IDG</p></div>\n\n\n\n<p>We&rsquo;ve criticized <em>Windows</em> on Arm devices before because of their performance issues, in part because if you wander too far afield, the anemic processor performance combined with compatibility issues can deliver a subpar experience. It&rsquo;s a little weird to reserve the 5G option for just the Arm platform, but the choice doesn&rsquo;t really diminish the Surface Pro 9 experience.</p>\n\n\n\n<h2 id=\"arm-v-qualcomm-fail\">Arm v Qualcomm: FAIL</h2>\n\n\n\n<p>Underneath the Surface Pro 9 (5G), however, is a head-scratching mess. Qualcomm, the so-far exclusive provider of Windows-on-Arm PC hardware, is currently <a href=\"https://www.pcworld.com/article/1063248/arm-qualcomm-suit-stresses-windows-on-arms-future.html\">embroiled in a patent suit with its IP provider, Arm</a>, which <em>still</em> hasn&rsquo;t been settled. </p>\n\n\n\n<p>Qualcomm Snapdragon processors don&rsquo;t have a sparkling reputation in the PC space &mdash; see the Surface Pro 9 (5G) above. The next-gen Arm designs that Nuvia brought with them are being challenged in court by Arm, which says they&rsquo;re not covered by Qualcomm&rsquo;s license agreement. Those <a href=\"https://www.pcworld.com/article/695069/qualcomm-signals-delay-in-nuvia-processor-development.html\">Nuvia chips are due in late 2023</a>, anyway, months after Intel and AMD are scheduled to ship mobile processors that will probably drastically outperform the new Snapdragon chips. Qualcomm still has its stellar phone business to fall back on, but for Windows on Arm? A real catastrophe in the making.</p>\n\n\n\n<h2 id=\"surface-laptop-5-it-exists\">Surface Laptop 5: It exists.</h2>\n\n\n\n<p>We also <a href=\"https://www.pcworld.com/article/1357810/microsoft-surface-laptop-5-review-for-surface-fans-only.html\">reviewed the Surface Laptop 5 positively</a>, if only because it doesn&rsquo;t fall flat on many fronts, if at all. But the Surface Laptop 5 is the laptop version of an EA Sports game, largely unchanged from generation to generation, with few names changed to justify its premium price. Sure, there are some welcome upgrades. We&rsquo;re a fan of Thunderbolt 4 ports (for a new <a href=\"https://www.pcworld.com/article/1346567/microsoft-audio-dock-presenter-plus-your-new-teams-gadgets.html\">Microsoft Audio Dock, hurray!)</a> Basically, tossing out the Surface Dock in favor of Thunderbolt hardware is a plus. But we just don&rsquo;t see the effort that a Dell or an HP add to their laptops within the Surface Laptop line.</p>\n\n\n\n<h2 id=\"surface-laptop-go-2-fail\">Surface Laptop Go 2: FAIL</h2>\n\n\n\n<p>Microsoft keeps taking swings at budget laptops and they keep coming up a little short. At $799.99, the <a href=\"https://www.pcworld.com/article/796333/microsoft-surface-laptop-go-2-review.html\">Surface Laptop Go 2 </a>couldn&rsquo;t quite deliver what an Asus or Acer can in terms of a quality budget laptop. But it&rsquo;s also unfair to say that it fell dramatically short of what those other manufacturers offered. But Microsoft did include a full-fledged version of Windows in it, added a (last-generation) 11th-gen Core chip, <em>and</em> eventually dropped the price to $649.99 for the holidays. </p>\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img alt=\"front screen\" class=\"wp-image-804508\" height=\"675\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/07/Microsoft-Surface-Laptop-Go-2_review_8.jpg?quality=50&amp;strip=all&amp;w=1200\" width=\"1200\" /></figure><p class=\"imageCredit\">Dominik Tomaszewski / Foundry</p></div>\n\n\n\n<p>We still think that consumers would be best served to look elsewhere, but Microsoft knows what it needs to accomplish in this space and seems to be working toward addressing it. We think it&rsquo;s a bit late for our purposes, but if Microsoft can keep taking cost out, it&rsquo;s likely the Surface Laptop Go 3 will be a true winner.</p>\n\n\n\n<h2 id=\"surface-laptop-se-fail\">Surface Laptop SE: FAIL</h2>\n\n\n\n<p>The <a href=\"https://www.pcworld.com/article/550773/microsofts-new-surface-laptop-se-is-shockingly-cheap-at-249.html\">Surface Laptop SE</a> was yet <em>another</em> attempt to take on a budget PC or a Chromebook. Microsoft said that it would ship the Laptop SE in early 2022 alongside some similar third-party hardware and a simplified version of Windows 11, Windows 11 SE. Though a handful of sites reviewed Microsoft&rsquo;s new laptop, it vanished into a black hole afterwards. Or maybe it was the Bermuda Triangle?</p>\n\n\n\n<h2 id=\"xbox-adaptive-pc-peripherals-win\">Xbox Adaptive PC peripherals: WIN</h2>\n\n\n\n<p>I don&rsquo;t need to use Microsoft&rsquo;s Adaptive PC Peripherals. But it&rsquo;s wonderful that Microsoft continues to think about, accommodate, and design for those people who need some assistance in playing PC games. That&rsquo;s where the <a href=\"https://www.pcworld.com/article/698280/microsofts-new-adaptive-pc-peripherals-are-some-of-its-coolest-ever.html\">Microsoft Adaptive Mouse, Microsoft Adaptive Hub, and Microsoft Adaptive Buttons</a> come in.</p>\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img alt=\"Microsoft Adaptive Button Microsoft Adaptive Hub Microsoft Adaptive Mouse\" class=\"wp-image-699227\" height=\"800\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Microsoft-adaptive-accessories-2.jpg?quality=50&amp;strip=all&amp;w=1200\" width=\"1200\" /></figure><p class=\"imageCredit\">Microsoft</p></div>\n\n\n\n<p>Microsoft&rsquo;s hasn&rsquo;t said so, but designing for disabilities is reminiscent of the space race: By solving problems that you&rsquo;d normally ignore, you learn more than you otherwise would. Take the Adaptive Mouse, for example&ndash; by swapping the thumb support, you can turn a right-handed mouse into one for lefties. That&rsquo;s simply impressive. </p>\n\n\n\n<h2 id=\"microsoft-hololens-fail\">Microsoft HoloLens: FAIL</h2>\n\n\n\n<p>Microsoft&rsquo;s HoloLens began dying the moment the company migrated away from the consumer to the enterprise &mdash; sorry, Microsoft. But 2022 was apocalyptic as far as Microsoft&rsquo;s AR headset was concerned: after delays pushed back operational testing from 2021 to May 2022, a Defense Department report <a href=\"https://go.redirectingat.com/?id=111346X1569483&amp;url=https://www.theregister.com/2022/10/13/us_army_report_microsoft_hololens/&amp;xcust=2-1-1433015-1-0-0&amp;sref=https://www.pcworld.com/feed\" rel=\"nofollow\">concluded</a> that the devices needed further refinement before they could be used by the U.S. Army. That could put Microsoft&rsquo;s $22 billion contract on hold. </p>\n\n\n\n<p>And while early 2022 was spent playing he-said, she-said over whether the <a href=\"https://www.pcworld.com/article/611416/report-microsoft-hololens-is-dead-as-its-mixed-reality-vision-implodes.html\">HoloLens 3 would be cancelled</a>, it certainly didn&rsquo;t help that HoloLens lead Alex Kipman was said to have <a href=\"https://go.redirectingat.com/?id=111346X1569483&amp;url=https://gizmodo.com/hololens-alex-kipman-microsoft-sexual-harassment-ar-vr-1849034693&amp;xcust=2-1-1433015-1-0-0&amp;sref=https://www.pcworld.com/feed\" rel=\"nofollow\">inappropriately behaved toward women</a>.  Kipman is no longer with the company. With Kipman gone and the DoD contact on the ropes, the HoloLens is one major headache for Microsoft &mdash; ironically, one of the DoD&rsquo;s chief complaints against using it.</p>\n\n\n\n<h2 id=\"playing-games-within-microsoft-teams-wtf\">Playing games within Microsoft Teams: WTF</h2>\n\n\n\n<p>Playing games? Great. Playing games with friends? Even better. But playing games over Microsoft Teams? Er, what? Yes, if multiplayer <em>Minesweeper</em> is your thing, you can now <a href=\"https://www.pcworld.com/article/1382410/now-you-can-play-games-within-microsoft-teams.html\">play multiplayer games while your next Teams conference call</a> takes place. (You know Elon Musk would use this as a training exercise and fire the engineer who tripped over the bomb.) And yes, you can even break the whole concept of a solitary Solitaire and play that with your friends, too. Are the Teams team out of ideas?</p>\n\n\n\n<p>The free consumer version of Teams continues to fail, by the way. <a href=\"https://www.pcworld.com/article/1428443/microsoft-teams-aims-to-be-a-rather-dull-discord.html\">Communities just won&rsquo;t save it</a>. </p>\n\n\n\n<h2 id=\"microsoft-clipchamp-win\">Microsoft Clipchamp: WIN</h2>\n\n\n\n<p>Windows 10 entered the market on the shoulders of an ambitious creative effort, with everything from mixed reality to a dynamic mobile platform to a whole host of creative apps &mdash; all of which largely bombed. Shell-shocked, Microsoft returned to its winning strategy, productivity apps that just make money. </p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n\n</div></figure>\n\n\n\n<p>In 2021, however, <a href=\"https://go.redirectingat.com/?id=111346X1569483&amp;url=https://www.microsoft.com/en-us/microsoft-365/blog/2021/09/07/microsoft-acquires-clipchamp-to-empower-creators/&amp;xcust=2-1-1433015-1-0-0&amp;sref=https://www.pcworld.com/feed\" rel=\"nofollow\">Microsoft bought Clipchamp</a>, a Web-based video-editing platform &mdash; and boy, what a breath of fresh air it has been. <a href=\"https://www.pcworld.com/article/708192/how-to-use-clipchamp-microsofts-video-editor.html\">I adore Clipchamp</a>. It&rsquo;s simple, fun, powerful, and a joy to use. It&rsquo;s a tool and an approach that needs to be tried to be appreciated, and should be used to signal to Microsoft that we need to seed Windows and Microsoft 365 with even more creativity. This is clearly one of Microsoft&rsquo;s biggest successes of 2022, and one I hope that the company can build upon going forward. </p>\n\n\n\n<h2 id=\"microsoft-designer-win\">Microsoft Designer: WIN</h2>\n\n\n\n<p>And build upon they did. The rise of AI art (and AI in general) has been as fundamentally unsettling as it has been rapid, with major potential changes coming to art, design, writing, and even the <a href=\"https://www.pcworld.com/article/1424421/ai-text-generation-is-moving-mainstream.html\">structure of the Internet</a> as a whole. But what AI art excels at is simply offering up a custom piece of art on spec. The downside? It doesn&rsquo;t always deliver as promised, and there are usually limits (or an outright price) attached to how many requests you can make.</p>\n\n\n\n<p>Designer takes AI and integrates it into the creative process, quickly and efficiently. Our <a href=\"https://www.pcworld.com/article/1419066/microsoft-designer-is-almost-a-masterpiece-already.html\">preview of Microsoft Designer</a> shows that Microsoft built AI art neatly into its workflow &mdash; and does it with (from what we&rsquo;ve seen) virtually no limits on the generative process. If you want to try out 100 different images in your brochure, feel free. About the only thing you can&rsquo;t do yet is simply generate AI art outside the creative workflow &mdash; but you will, with <a href=\"https://www.pcworld.com/article/1358985/this-is-what-microsofts-new-ai-art-generator-will-look-like.html\">Image Creator for Microsoft Edge</a>. (Image creator probably isn&rsquo;t quite live yet, but <a href=\"https://go.redirectingat.com/?id=111346X1569483&amp;url=https://bing.com/create&amp;xcust=2-1-1433015-1-0-0&amp;sref=https://www.pcworld.com/feed\" rel=\"nofollow\">you can check</a>.) </p>\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img alt=\"Microsoft Designer drifting e-book\" class=\"wp-image-1419116\" height=\"614\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/11/Drifting-design.png?w=1200\" width=\"1200\" /></figure><p class=\"imageCredit\">Mark Hachman / IDG</p></div>\n\n\n\n<p>We haven&rsquo;t used the ink-first version of OneNote, <a href=\"https://www.pcworld.com/article/394107/meet-microsofts-new-ink-first-app-journal.html\">Microsoft Journal</a>, extensively. But rave reviews at the Microsoft Store imply that there&rsquo;s a creative renaissance going on within Redmond.</p>\n\n\n\n<h2 id=\"windows-11-2022-update-push\">Windows 11 2022 Update: PUSH</h2>\n\n\n\n<p>It&rsquo;s not bad, anyway. After years of being fed next to nothing, Microsoft took a swing at a substantial update&hellip; and drew a walk.  Most of the nifty features of the <a href=\"https://www.pcworld.com/article/827065/windows-11-22h2-review-subtle-improvements-but-not-where-it-should.html\">Windows 11 October 2022 Update</a> lie underneath the surface, with Live Captions providing a genuinely noteworthy accessibility feature and the Snap Bar reworking Snap for multiple monitors. Clipchamp rocks. So does Windows Spotlight. But, seriously, does dragging and dropping a file onto the taskbar actually work for anyone else? </p>\n\n\n\n<p>The fact that Microsoft had to issue an update to the Update to deliver additional features, though&hellip;.</p>\n\n\n\n<h2 id=\"windows-11s-feature-timetable-wtf\">Windows 11&rsquo;s feature timetable: WTF</h2>\n\n\n\n<p>At one time, Microsoft felt quite strongly about delivering new features to Windows on a strict timetable: April and September. Businesses depended on a strict schedule that they could plan for and consumers liked to know when a new feature would roll out so that they could plan for or block it. </p>\n\n\n\n<p>Microsoft, however, has given all of that up. Now, Microsoft will <a href=\"https://www.pcworld.com/article/1069779/windows-11-will-add-new-features-whenever-it-wants.html\">add new Windows features whenever it feels like it</a>, on its own schedule. Twice a year? A dozen times a year? Who knows? Furthermore, the company is simply <a href=\"https://www.pcworld.com/article/611767/meet-the-new-ways-in-which-microsoft-is-quietly-adding-features-to-windows.html\">quietly pushing them out to Windows PC</a>s, without fanfare. Don&rsquo;t get us wrong, we&rsquo;re fans of new features and innovation for innovation&rsquo;s sake. But if you&rsquo;re going to change how a PC works, why not tell people about it? Most app developers use a changelog to inform users of new updates. Microsoft? Nah.</p>\n\n\n\n<h2 id=\"windows-11s-october-moment-wtf\">Windows 11&rsquo;s October Moment: WTF</h2>\n\n\n\n<p>Microsoft issued its first <a href=\"https://www.pcworld.com/article/827065/windows-11-22h2-review-subtle-improvements-but-not-where-it-should.html\">patch to the Windows 11 2022 Update</a> this past October, which normally would be called the Windows 11 October Update (22H2) except that the name was already taken, except that it wasn&rsquo;t. Nor did Microsoft stick to the &ldquo;moment&rdquo; moniker that apparently is being used internally to describe the new features. Instead, they&rsquo;re being referred to as &ldquo;experiences.&rdquo;</p>\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img alt=\"Windows 11 Tabbed File Explorer\" class=\"wp-image-1430360\" height=\"776\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/12/Tabbed-File-explorer-2.png?w=1200\" width=\"1200\" /></figure><p class=\"imageCredit\">Mark Hachman / IDG</p></div>\n\n\n\n<p>It all feels like an English teacher cooped up their apartment during quarantine, simply turning on the screen reader on a PDF for a Zoom call and calling it a day. (Yes, that was indeed curiously specific.) But these weren&rsquo;t <em>new</em> features, just a set of makeup features that the Windows team apparently submitted for course credit. </p>\n\n\n\n<p>Hey, we like them &mdash; tabbed File Explorer browsing is actually quite useful, though simple &mdash; but we&rsquo;d appreciate a bit more formality to the whole process. Just semi-randomly launching stuff sounds like something we might see at Twitter, not a corporation run by adults. <a href=\"https://www.pcworld.com/article/1069153/windows-10-continue-until-2025-microsoft.html\">At least you have until 2025 to run Windows 10</a>. Or maybe <a href=\"https://www.pcworld.com/article/811274/windows-12-2024-microsoft-windows-11-features.html\">Windows 12</a>?</p>\n\n\n\n<p>We kid, we kid. Happy holidays to Microsoft and to all of you, from PCWorld. Here&rsquo;s to 2023!</p>\n\nWindows, Windows 11</div>", "persistent": false, "language": "en-US"}, {"source": "https://www.pcworld.com/index.rss", "link": "https://www.pcworld.com/article/1428773/get-244-hours-of-top-rated-training-in-popular-coding-languages-for-25.html", "title": "Get 244 hours of top-rated training in popular coding languages for $25", "date_published": "2022-12-19 08:00:00+00:00", "description": "<div id=\"link_wrapped_content\">\n<section class=\"wp-block-bigbite-multi-title\"><div class=\"container\"></div></section>\n\n\n\n<p>If you&rsquo;re an analog person living in a digital world, it&rsquo;s easy to fear that you might get left behind in the future. So, don&rsquo;t let that happen. Learning to code is easier than ever, thanks to resources like this&nbsp;<a href=\"https://shop.pcworld.com/sales/the-2023-premium-learn-to-code-certification-bundle?utm_source=pcworld.com&amp;utm_medium=referral&amp;utm_campaign=the-2023-premium-learn-to-code-certification-bundle&amp;utm_term=scsf-458399&amp;utm_content=a0x1P000004YrVOQA0&amp;scsonar=1%27\" rel=\"noreferrer noopener\" target=\"_blank\">14-part code training bundle</a>. And with this end-of-year special, you can get this updated program for 2023 for just $24.99.</p>\n\n\n\n<p>This bundle includes 14 courses from some of the web&rsquo;s leading instructors, including&nbsp;<a href=\"https://go.redirectingat.com/?id=111346X1569483&amp;url=https://www.linkedin.com/company/zenva/&amp;xcust=2-1-1428773-1-0-0&amp;sref=https://www.pcworld.com/feed\" rel=\"nofollow\" target=\"_blank\">Zenva Academy</a>&nbsp;(4.4/5-star instructor rating), Tony Staunton (4.6/5-star rating), and Joe Ghal (4.6/5-star rating).</p>\n\n\n\n<p>The massive bundle covers a wide array of coding topics, from the basics of Python to machine learning and everything in between. Along the way, you&rsquo;ll learn full-stack web development with JavaScript libraries and MongoDB, Google Go programming, mobile app development with SwiftUI, and much more. In addition, through the practical training, you&rsquo;ll get experience building coding projects first-hand, so your education really clicks.</p>\n\n\n\n<p>If you want to learn to code, look no further than&nbsp;<a href=\"https://shop.pcworld.com/sales/the-2023-premium-learn-to-code-certification-bundle?utm_source=pcworld.com&amp;utm_medium=referral&amp;utm_campaign=the-2023-premium-learn-to-code-certification-bundle&amp;utm_term=scsf-458399&amp;utm_content=a0x1P000004YrVOQA0&amp;scsonar=1\" rel=\"noreferrer noopener\" target=\"_blank\">The 2023 Premium Learn to Code Certification Bundle</a>. For a limited time, it&rsquo;s further reduced from $39.99 to just $24.99.</p>\n\n\n\n<p><a href=\"https://shop.pcworld.com/sales/the-2023-premium-learn-to-code-certification-bundle?utm_source=pcworld.com&amp;utm_medium=referral-cta&amp;utm_campaign=the-2023-premium-learn-to-code-certification-bundle&amp;utm_term=scsf-458399&amp;utm_content=a0x1P000004YrVOQA0&amp;scsonar=1\" rel=\"noreferrer noopener\" target=\"_blank\">&nbsp;</a></p>\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image\"><img alt=\"\" src=\"https://cdnp2.stackassets.com/e2d6b353339e0877dd7521ace40ab2b6c8f88e62/store/5c315b940db75442a02e50d9c5a121c0d5861870e4810a5e44ce65f8d9cd/sale_316236_primary_image.jpg\" /></figure></div>\n\n\n\n<p><strong>The 2023 Premium Learn to Code Certification Bundle &ndash; $24.99</strong></p>\n\n\n\n<p><a href=\"https://shop.pcworld.com/sales/the-2023-premium-learn-to-code-certification-bundle?utm_source=pcworld.com&amp;utm_medium=referral-cta&amp;utm_campaign=the-2023-premium-learn-to-code-certification-bundle&amp;utm_term=scsf-458399&amp;utm_content=a0x1P000004YrVOQA0&amp;scsonar=1\" rel=\"noreferrer noopener\" target=\"_blank\">Get 200+ Hours of Coding Training</a></p>\n\n\n\n<p><em>Prices subject to change.</em></p>\n\nCertifications</div>", "persistent": false, "language": "en-US"}], "source": {"url": "https://www.pcworld.com/index.rss", "title": "PC world"}}