[{"source": "https://www.dailywire.com/feeds/rss.xml", "title": "US Military Restart Onsite Weapons Inspections In Ukraine", "description": "U.S. Defense officials told Pentagon reporters Monday that military forces in Ukraine have restarted onsite inspecting Ukrainian troops to corroborate the $17 billion in weapons American officials have provided are used to defend its territory against Russia. According to The Associated Press, the official who spoke did not say where U.S. troops are conducting such ...", "link": "https://www.dailywire.com/news/us-military-restarts-onsite-weapons-inspections-in-ukraine", "date_published": "2022-10-31 22:32:57+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Gavin Newsom Blames Fox News Host For ‘Aiding And Abetting’ Paul Pelosi Attack", "description": "California Governor Gavin Newsom (D) called out Fox News host Jesse Watters, blaming him personally for &#8220;aiding and abetting&#8221; the alleged violent attack against House Speaker Nancy Pelosi&#8217;s husband, Paul Pelosi. Newsom argued that Watters, among others, had &#8220;dehumanized&#8221; Speaker Pelosi — and he claimed that had helped to foster a climate where political violence ...", "link": "https://www.dailywire.com/news/gavin-newsom-blames-fox-news-host-for-aiding-and-abetting-paul-pelosi-attack", "date_published": "2022-10-31 20:52:57+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "All Over But The Shouting: Blacks, Hispanics Flooding To GOP As 2022 Campaign Winds Down", "description": "In the last mid-term elections in 2018, Democrats crushed Republicans among black voters. They won 92% of the black vote, compared to just 6% for the GOP. That same year, Democrats enjoyed a lopsided majority among Hispanic voters, 72% to 25%, according to exit polling data studied by Pew Research. But things are changing fast ...", "link": "https://www.dailywire.com/news/all-over-but-the-shouting-blacks-hispanics-flooding-to-gop-as-2022-campaign-winds-down", "date_published": "2022-10-31 20:36:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Raphael Warnock Diverted Campaign Funds To Pay Child Support: Report", "description": "Senator Raphael Warnock (D-GA) appears to have funneled over $60,000 in campaign funds into childcare, according to a report based on his Federal Election Commission (FEC) filings. Warnock&#8217;s campaign, according to the filings, spent a total of $61,959.40 for items listed as &#8220;childcare&#8221; — with several payments going directly to specific childcare providers and a ...", "link": "https://www.dailywire.com/news/raphael-warnock-diverted-campaign-funds-to-pay-child-support-report", "date_published": "2022-10-31 20:18:44+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Welcome To The Republican Party,’ Kid Rock To Maher When HBO Host Slams Woke Push In Schools", "description": "Superstar Kid Rock appeared on Bill Maher&#8216;s latest podcast and &#8220;welcomed&#8221; him to the &#8220;Republican Party&#8221; after the HBO host slammed the woke push in schools. During &#8220;Club Random with Bill Maher&#8221; podcast on Sunday, the podcast host told the 51-year-old singer — born Robert James Ritchie — that he would be a bad parent ...", "link": "https://www.dailywire.com/news/welcome-to-the-republican-party-kid-rock-to-maher-when-hbo-host-slams-woke-push-in-schools", "date_published": "2022-10-31 19:28:14+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Kentucky Officials Make Move To Purge Woke Investing From The State", "description": "Officials in Kentucky asked managers of the commonwealth’s pension funds to ensure that environmental, social, and governance investing, also known as ESG, has no place in the management of taxpayer dollars. Several conservative states have been opposing the investment methodology over concerns that the approach mingles left-wing political causes with the maximization of profits. Kentucky ...", "link": "https://www.dailywire.com/news/kentucky-officials-make-move-to-purge-woke-investing-from-the-state", "date_published": "2022-10-31 18:57:39+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Only 1% Of Hispanics Prefer The So-Called Gender-Neutral Term ‘Latinx’: Report", "description": "To underscore the unpopularity of the so-called gender-neutral term &#8216;Latinx,&#8217; a pair of national polls found that only 1% of Hispanics prefer the representation that woke politicians and pundits force on a culture that has survived without since its foundation. &#8220;Latinx&#8221; emerged in recent years as an alternative to preferred identifiers such as Hispanic and ...", "link": "https://www.dailywire.com/news/only-1-of-hispanics-prefer-the-so-called-gender-neutral-term-latinx-report", "date_published": "2022-10-31 17:51:49+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Clarence Thomas: ‘I’ve Heard The Word Diversity’ And ‘I Don’t Have A Clue What It Means’", "description": "Justice Clarence Thomas expressed skepticism that racial diversity has a salient impact on educational outcomes on Monday as the Supreme Court weighed arguments regarding affirmative action in university admissions. Students for Fair Admissions, a legal advocacy group which opposes providing applicants an advantage because of their racial identity, has filed complaints against both Harvard University ...", "link": "https://www.dailywire.com/news/clarence-thomas-ive-heard-the-word-diversity-and-i-dont-have-a-clue-what-it-means", "date_published": "2022-10-31 17:48:41+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Levi’s Pushed Her Out When She Spoke Up Against COVID Madness, But Jennifer Sey Isn’t Done Talking (Part 1)", "description": "Jennifer Sey was a leading candidate to head multi-billion-dollar corporation Levi Strauss &amp; Co., until she veered outside the acceptable Left-wing narrative on COVID policies and refused to shut up. The well-liked liberal executive was pushed out at Levi’s in February 2022, after her vetting for CEO was derailed by social media posts and activism ...", "link": "https://www.dailywire.com/news/levis-pushed-her-out-when-she-spoke-up-against-covid-madness-but-jennifer-sey-isnt-done-talking-part-1", "date_published": "2022-10-31 17:21:25+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Report: FDA Does Not Support Providers Giving Out Abortion Pills To Women Who Aren’t Pregnant", "description": "The U.S. Food and Drug Administration (FDA) has called out providers who are giving out abortion pills to patients who are not pregnant.  “The FDA is concerned about the advance prescribing of mifepristone for this use,” an anonymous FDA spokesperson told POLITICO on Friday. “Mifepristone is not approved for advance provision of a medical abortion.” ...", "link": "https://www.dailywire.com/news/report-fda-does-not-support-providers-giving-out-abortion-pills-to-women-who-arent-pregnant", "date_published": "2022-10-31 17:07:49+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Need To Zip It’: Country Star Jason Aldean And Wife Brittany Troll Maren Morris And Left With Halloween Video", "description": "Country star Jason Aldean and wife Brittany Aldean dressed as fictional anchors Ron Burgundy and Veronica Corningstone as they trolled singer Maren Morris and the left with their Halloween costume video. In a clip shared on Instagram on Monday by the 45-year-old country star, fans see the couple sporting wigs as the two read pretend ...", "link": "https://www.dailywire.com/news/need-to-zip-it-country-star-jason-aldean-and-wife-brittany-troll-maren-morris-and-left-with-halloween-video", "date_published": "2022-10-31 17:01:44+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Tucking And Binding Are Trendy With Gender Dysphoric Kids. Pediatricians Warn They’re Not Harmless.", "description": "As more and more children are exposed to the concept of gender identity, many youngsters are experimenting with using clothing to smash down body parts they don&#8217;t like. A growing number of children and teens are turning to &#8220;tucking&#8221; their male genitals or &#8220;binding&#8221; their female breasts as a way to get relief from gender ...", "link": "https://www.dailywire.com/news/tucking-and-binding-are-trendy-with-gender-dysphoric-kids-pediatricians-warn-theyre-not-harmless", "date_published": "2022-10-31 16:49:53+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Shanghai Disney Shuts Down Over COVID, Traps Visitors Inside", "description": "Shanghai’s Disneyland resort was shut down on Monday due to COVID-19 protocols and is not allowing people to leave the park until they have tested negative for the virus. Shortly before noon local time, the location said it would abruptly close its park and nearby areas to go along with attempts to cut down on ...", "link": "https://www.dailywire.com/news/shanghai-disney-shuts-down-over-covid-traps-visitors-inside", "date_published": "2022-10-31 16:34:31+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Lindsay Lohan Throws Support Behind Power Of Social Media Following Struggles With Paparazzi", "description": "Lindsay Lohan threw her support behind the power of social media to &#8220;control&#8221; one&#8217;s &#8220;own narrative&#8221; following her struggles with the paparazzi during her career. During a wide-ranging interview with Cosmopolitan, the 36-year-old actress admitted she is a &#8220;little jealous&#8221; that stars now have a way to fight back when pictures appear on gossip sites. ...", "link": "https://www.dailywire.com/news/lindsay-lohan-throws-support-behind-power-of-social-media-following-struggles-with-paparazzi", "date_published": "2022-10-31 16:26:21+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "San Francisco Restaurant Serves Dogs Multi-Course Healthy Meals", "description": "A California restaurant is serving dogs filet mignon and other decadent food in what is considered to be the first eatery designed only for canines.  The San Francisco location is called Dogue, and launched in September in the Mission District.  Meals including several courses cost $75 per dog and include a mimosa and pastry for ...", "link": "https://www.dailywire.com/news/san-francisco-restaurant-serves-dogs-multi-course-healthy-meals", "date_published": "2022-10-31 16:23:25+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "The Supreme Court May Kill Affirmative Action. Here’s What You Need To Know.", "description": "The Supreme Court heard two cases on Monday that could lead justices to rule against affirmative action, a policy by which universities promote individuals of various minority groups in admissions processes. Students for Fair Admissions, a legal advocacy group which opposes affirmative action, has filed complaints against both Harvard University and the University of North ...", "link": "https://www.dailywire.com/news/the-supreme-court-may-kill-affirmative-action-heres-what-you-need-to-know", "date_published": "2022-10-31 16:18:09+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "USA Today Opinion Piece: I Watched With ‘Pride And Admiration’ As Fetterman Debated Oz, Who ‘Belittled And Bullied’ Him", "description": "An opinion piece in USA Today lauded Democratic candidate John Fetterman for his performance against Republican rival Mehmet Oz, who the author claimed &#8220;belittled and bullied&#8221; his opponent in the only debate ahead of the contentious Pennsylvania Senate election. Fetterman, the commonwealth’s lieutenant governor who has struggled with cognition following a stroke in May, floundered ...", "link": "https://www.dailywire.com/news/usa-today-opinion-piece-i-watched-with-pride-and-admiration-as-fetterman-debated-oz-who-belittled-and-bullied-him", "date_published": "2022-10-31 16:06:13+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Suspect Who Attacked Paul Pelosi Is An Illegal Immigrant, Report Says", "description": "The man accused of breaking into House Speaker Nancy Pelosi&#8217;s (D-CA) home and attacking her husband with a hammer during the early morning hours on Friday is reportedly in the United States illegally. Fox News correspondent Bill Melugin reported Monday afternoon: &#8220;Per ICE source, David DePape, the suspect accused of beating Paul Pelosi in his ...", "link": "https://www.dailywire.com/news/breaking-suspect-who-attacked-paul-pelosi-is-an-illegal-immigrant-report-says", "date_published": "2022-10-31 16:02:54+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Not A Chance: Atlantic Writer Begs For ‘Pandemic Amnesty,’ Forgiveness For COVID Tyranny", "description": "Are you ready to forgive and forget the COVID nuts who wanted to lock down the whole country, mentally stunted an entire generation of students, practically killed small businesses, and accused you of premeditated murder because you wouldn&#8217;t do things like wear a mask while raking leaves by yourself? Probably not, but a writer for ...", "link": "https://www.dailywire.com/news/not-a-chance-atlantic-writer-begs-for-pandemic-amnesty-forgiveness-for-pandemic-tyranny", "date_published": "2022-10-31 15:50:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Pretty Evil’: Trans Activist Dylan Mulvaney Calls Out Caitlyn Jenner For Public Criticism", "description": "Trans-identifying activist Dylan Mulvaney formulated a response for fellow trans-identifying celebrity Caitlyn Jenner after Jenner criticized the social media influencer publicly. Fresh off a meeting with President Joe Biden at the White House, Mulvaney specifically addressed the video to Jenner.  “We are two of the most privileged trans women in America at the moment,” the ...", "link": "https://www.dailywire.com/news/pretty-evil-trans-activist-dylan-mulvaney-calls-out-caitlyn-jenner-for-public-criticism", "date_published": "2022-10-31 15:25:27+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Hochul Says GOP Has ‘Conspiracy’ To Make Americans Feel Unsafe", "description": "New York Democratic Governor Kathy Hochul, who dismissed criticism of bail reform by insisting to GOP gubernatorial opponent Lee Zeldin, “I don&#8217;t know why that&#8217;s so important to you,” said on Sunday that the GOP had created a “conspiracy” to make Americans feel they are less safe. Hochul made her remarks when she was interviewed ...", "link": "https://www.dailywire.com/news/hochul-says-gop-has-conspiracy-to-make-americans-feel-unsafe", "date_published": "2022-10-31 15:09:01+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Twitter Blows Up At Professor After Demanding ‘Pandemic Amnesty’ in Atlantic Op-Ed", "description": "Twitter blew up Monday over Brown University Professor Emily Oster&#8217;s op-ed calling for &#8220;a pandemic amnesty&#8221; to forgive each other for what we did and said during the earliest part of the COVID pandemic. The piece published by The Atlantic is headlined, &#8220;LET&#8217;S DECLARE A PANDEMIC AMNESTY: We need to forgive one another for what ...", "link": "https://www.dailywire.com/news/twitter-blows-up-at-professor-after-demanding-pandemic-amnesty-in-atlantic-op-ed", "date_published": "2022-10-31 14:53:53+00:00", "persistent": true, "user": null, "language": "en-US", "tags": ["pandemic amnesty", "twitter", "covid"]}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Costume Party: Democrats Dress Up As Moderates As Election Day Approaches", "description": "It&#8217;s Halloween and we’re just a little over a week away from Election Day. Maybe that’s why so many Democrats have decided to dress up as moderates. Haunted by their radical records, Democrats are trying to trick voters into thinking they’re not the left-wing partisans their records suggest. But these Democrats are as extreme as ...", "link": "https://www.dailywire.com/news/costume-party-democrats-dress-up-as-moderates-as-election-day-approaches", "date_published": "2022-10-31 14:23:03+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Democrat Senator Calls For Investigation To See If Twitter Is Influenced By Saudis", "description": "Senator Chris Murphy (D-CT) called for an investigation into Twitter since a Saudi Arabian company linked to the nation’s ruling family is now the second-largest shareholder. Kingdom Holding Company and the private investment office of Prince Alwaleed Bin Talal announced last week that the organizations hold nearly 35 million shares in Twitter even after Elon ...", "link": "https://www.dailywire.com/news/democrat-senator-calls-for-investigation-to-see-if-twitter-is-influenced-by-saudis", "date_published": "2022-10-31 14:20:08+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "WSJ Editorial Board Blasts Whitmer On Education: ‘Few Did More To Unlevel It Than She Did’", "description": "The Wall Street Journal pulled no punches in a Sunday editorial on Gov. Gretchen Whitmer (D-MI). In a piece headlined “Michigan’s Education Failure,” the newspaper’s editorial board criticized Whitmer as “one of the country’s most aggressive pandemic lockdown enforcers” whose policies negatively affected the educational outcomes for Michigan’s children, especially in minority communities. The article ...", "link": "https://www.dailywire.com/news/wsj-editorial-board-blasts-whitmer-on-education-few-did-more-to-unlevel-it-than-she-did", "date_published": "2022-10-31 14:00:59+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Cotton Fiercely Condemns The Left, Dems For Sabotaging American Power", "description": "Arkansas GOP senator Tom Cotton, who fiercely condemned the riots ensuing after George Floyd’s death and also has harshly criticized the Democrats for their support of the Iran nuclear deal, condemned the Democratic Party and the American Left for their repeated attempts to sabotage American power in a multitude of ways. Cotton appeared on Fox ...", "link": "https://www.dailywire.com/news/cotton-fiercely-condemns-the-left-dems-for-sabotaging-american-power", "date_published": "2022-10-31 13:53:05+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘I Didn’t Pay Enough Attention’: Sylvester Stallone Reflects On Prioritizing Career Over Fatherhood", "description": "Sylvester Stallone is fresh off a marriage reconciliation and is reflecting on how he handled the balance of career and family responsibilities in the past. The 76-year-old “Rocky” star opened up to Sunday Times about the current state of his familial relationships during a recent interview. He and his wife of 25 years, Jennifer Flavin, ...", "link": "https://www.dailywire.com/news/i-didnt-pay-enough-attention-sylvester-stallone-reflects-on-prioritizing-career-over-fatherhood", "date_published": "2022-10-31 13:50:02+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Report: At Least 10,000 Fewer Legal Abortions Have Occurred Since Overturn Of Roe", "description": "At least 10,000 fewer legal abortions occurred in the U.S. in the two months following the Supreme Court decision to overturn Roe v. Wade, according to a report by FiveThirtyEight. The study, compiled by the pro-abortion non-profit #WeCount, part of the Society for Family Planning (SFP), noted that 10,570 fewer abortions took place in July and ...", "link": "https://www.dailywire.com/news/report-at-least-10000-fewer-legal-abortions-have-occurred-since-overturn-of-roe", "date_published": "2022-10-31 13:41:43+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Michigan State Suspends 4 Players As Police Investigate Post-Game Tunnel Fight", "description": "Four Michigan State football players have been suspended while police investigate an altercation in a stadium tunnel after a 29-7 loss to the Michigan Wolverines on Saturday. The incident occurred at Michigan Stadium, home of the Wolverines, which is nicknamed &#8220;The Big House.&#8221; The suspensions were announced after footage of Spartan players beating a University ...", "link": "https://www.dailywire.com/news/michigan-state-suspends-4-players-as-police-investigate-post-game-tunnel-fight", "date_published": "2022-10-31 13:06:23+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Americans Who Have Worse Finances Since Biden Was Elected Overwhelmingly Blame Democrats", "description": "Americans who report tighter financial conditions after the election of President Joe Biden largely blame the commander-in-chief and his legislative allies, according to a new midterm election survey from Bankrate. Republicans have significant projected leads over Democrats with respect to economic issues as voters are expected to be driven to the polls by soaring inflation, ...", "link": "https://www.dailywire.com/news/americans-who-have-worse-finances-since-biden-was-elected-overwhelmingly-blame-democrats", "date_published": "2022-10-31 12:37:21+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Machine Gun Kelly And Megan Fox Halloween Pic Showing Him Doing Hard Drugs Has Some Fans Crying Foul", "description": "Singer Machine Gun Kelly and his fiancée, actress Megan Fox, invited all sorts of reactions on social media after sharing their very realistic Halloween costumes. Fox posted a series of photos to her Instagram account with the caption, “But are these even costumes.” The pair were dressed as former celebrity couple Tommy Lee and Pamela ...", "link": "https://www.dailywire.com/news/machine-gun-kelly-and-megan-fox-halloween-pic-showing-him-doing-hard-drugs-has-some-fans-crying-foul", "date_published": "2022-10-31 12:25:51+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Police Won’t Release Probable Cause Affidavit For Man Arrested In Connection To Delphi Murders", "description": "Police on Monday formally announced the arrest of Richard Allen, 50, for the 2017 murders of two Delphi, Indiana, teenagers. In announcing the arrest, however, Delphi police said they would not be releasing the probable cause affidavit leading to Allen’s arrest, nor would they discuss any information relating to the investigation or arrest. &#8220;This investigation ...", "link": "https://www.dailywire.com/news/police-wont-release-probable-cause-affidavit-for-man-arrested-in-connection-to-delphi-murders", "date_published": "2022-10-31 12:21:47+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "WATCH: Neighbor Veers From Media Narrative When Asked About Politics Of Pelosi’s Alleged Attacker", "description": "A neighbor of alleged Paul Pelosi attacker David DePape described the home where he lived as nest of left-wing kooks &#8212; a turn from the narrative coming from some Democratic politicians and legacy media outlets. The 42-year-old reportedly assaulted Pelosi, husband of House Speaker Nancy Pelosi (D-CA), with a hammer when police arrived at the San Francisco ...", "link": "https://www.dailywire.com/news/watch-neighbor-veers-from-media-narrative-when-asked-about-politics-of-pelosis-alleged-attacker", "date_published": "2022-10-31 12:10:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Have To Look For An Alternative’: MLB’s Manfred Says Oakland Should Consider Moving To Vegas", "description": "MLB Commissioner Rob Manfred said that the Oakland Athletics, whose attendance in 2022 plunged to the lowest level of any team in 18 years, would have to consider moving to Las Vegas. The Athletics’ lease at the RingCentral Coliseum expires in 2024. Speaking of the A’s and the Tampa Bay Rays, interviewer Chris Russo asked ...", "link": "https://www.dailywire.com/news/have-to-look-for-an-alternative-mlbs-manfred-says-oakland-should-consider-moving-to-vegas", "date_published": "2022-10-31 11:56:06+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Pittsburgh’s Top Newspaper Endorses Oz, Sees Through Fetterman’s Blue-Collar Branding", "description": "The Pittsburgh Post-Gazette endorsed Republican Dr. Mehmet Oz over Democrat John Fetterman in the heated Pennsylvania Senate race that has garnered nationwide attention. The endorsement from the Steel City’s largest newspaper comes one week after Fetterman, the commonwealth’s lieutenant governor who has struggled with cognition following a stroke in May, floundered during a debate between the ...", "link": "https://www.dailywire.com/news/pittsburghs-top-newspaper-endorses-oz-sees-through-fettermans-blue-collar-branding", "date_published": "2022-10-31 11:51:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Bikini Baristas Win Case Against City Barring Them From Provocative Attire", "description": "Bikini baristas in Everett, Washington, won their long-standing case against a city ordinance that would bar them from baring skin while bearing beverages. Seattle's bikini baristas WIN case allowing skimpy coffeeshop outfits https://t.co/P1If2xq42w via @MailOnline &mdash; Bo Snerdley (@BoSnerdley) October 31, 2022 While the court rejected a claim the city law violated the First Amendment ...", "link": "https://www.dailywire.com/news/bikini-baristas-win-case-against-city-barring-them-from-provocative-attire", "date_published": "2022-10-31 11:41:02+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Taken For Granted’: Why Conservatives Can Win Over Undecided Hispanic Voters Ahead Of Midterms", "description": "As the midterms approach, the Democrats are bracing for what should be a red wave, at least in the House if not the Senate as well. The accuracy of polls can be fickle, but there is one trend the polls are most likely getting right — the shift in Hispanic voters moving more and more ...", "link": "https://www.dailywire.com/news/taken-for-granted-why-conservatives-can-win-over-undecided-hispanic-voters-ahead-of-midterms", "date_published": "2022-10-31 11:17:10+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Like Bone To Marrow’: Actor Stayed In Character For Jeffrey Dahmer Role For Months, He Says", "description": "Evan Peters, the actor who played serial killer Jeffrey Dahmer in the recently released Netflix drama series, said he took great pains to stay in character for months in preparation for the role. “Dahmer: Monster” was a huge success for the streaming platform, quickly becoming the second-most streamed show of all time by mid-October. Part ...", "link": "https://www.dailywire.com/news/like-bone-to-marrow-actor-stayed-in-character-for-jeffrey-dahmer-role-for-months-he-says", "date_published": "2022-10-31 11:12:03+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Modernist Mondrian Painting Has Been Hanging Upside Down For 75 Years, Museum Discovers", "description": "A modernist painting by Piet Mondrian has been hanging upside down for more than seven decades, museum curators have discovered. The painting is called &#8220;New York City I&#8221; and combines geometric shapes with a primary color palette, which the Dutch artist is known for. Mondrian made several paintings as part of the “New York” series ...", "link": "https://www.dailywire.com/news/modernist-mondrian-painting-has-been-hanging-upside-down-for-75-years-museum-discovers", "date_published": "2022-10-31 11:03:13+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Staff At Biden’s Top Financial Regulator Keep Quitting. Republicans Want To Know Why.", "description": "As staff at the Securities and Exchange Commission depart at elevated levels amid a surge in rulemaking, Republican lawmakers are pressing SEC Chair Gary Gensler for an explanation. Under the Biden administration, the regulatory agency is pursuing new rule changes at a much faster pace than in past years, with a proposal to force climate ...", "link": "https://www.dailywire.com/news/staff-at-bidens-top-financial-regulator-keep-quitting-republicans-want-to-know-why", "date_published": "2022-10-31 10:57:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Here’s Why MLB Ruled Albert Pujols’ Bat Illegal In Hands Of Astros Catcher", "description": "A baseball bat that is perfectly fine for future Hall of Famer Albert Pujols to use is illegal in the hands of a Houston Astros catcher Martin Maldonado. Pujols gave a batch of his custom-made AP-5 bats to Maldonado when they were teammates with the Los Angeles Angels back in 2017. Maldonado had been using ...", "link": "https://www.dailywire.com/news/heres-why-mlb-ruled-albert-pujols-bat-illegal-in-hands-of-astros-catcher", "date_published": "2022-10-31 10:53:38+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Colorado GOP Leader Hugh McKean Dies Suddenly At 55", "description": "Colorado House Minority Leader Hugh McKean (R) died suddenly on Sunday morning in his home. McKean passed away from a heart attack at the age of 55, according to the Larimar County Coroner&#8217;s Office. &#8220;It is with great sadness we announce the sudden passing of House Minority Leader Hugh McKean. Hugh was fiercely passionate about ...", "link": "https://www.dailywire.com/news/colorado-gop-leader-hugh-mckean-dies-suddenly-at-55", "date_published": "2022-10-31 10:38:05+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Luke Bryan Shows Signs Of Cracking To Social Media Mob After DeSantis Appears On Stage", "description": "Country music singer Luke Bryan showed signs of cracking to the online outrage mob over the weekend after leftists fumed over his decision to let Florida Governor Ron DeSantis (R) appear on stage with him at a concert late last week to benefit victims of Hurricane Ian. Bryan’s concert in Jacksonville, Florida, which was part ...", "link": "https://www.dailywire.com/news/luke-bryan-shows-signs-of-cracking-to-social-media-mob-after-desantis-appears-on-stage", "date_published": "2022-10-31 08:38:21+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "Musk Faces Widespread Backlash Over His New Plans For Twitter: ‘A Terrible Idea On So Many Levels’", "description": "New Twitter CEO Elon Musk faced widespread backlash online Sunday afternoon after a report revealed that his company will now move to charge users nearly $20 a month to be verified. The Verge reported that the “directive is to change Twitter Blue, the company’s optional, $4.99 a month subscription that unlocks additional features, into a more ...", "link": "https://www.dailywire.com/news/musk-faces-widespread-backlash-over-his-new-plans-for-twitter-a-terrible-idea-on-so-many-levels", "date_published": "2022-10-31 08:30:57+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "title": "‘Now We’re Sexualizing Kids Animations’: Kendall Jenner Slammed For Racy ‘Toy Story’ Costume", "description": "Fashion model Kendall Jenner decided to celebrate Halloween by dressing as a character from the iconic “Toy Story” children’s films, but catalyzed harsh criticism for her costume transforming the character from innocent to racy. Jenner, who boasts 262 million Instagram followers, posted photos of herself as the cowgirl Jessie, but instead of wearing the character’s ...", "link": "https://www.dailywire.com/news/now-were-sexualizing-kids-animations-kendall-jenner-slammed-for-racy-toy-story-costume", "date_published": "2022-10-31 07:07:07+00:00", "persistent": false, "user": null, "language": "en-US"}]