[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Ludovico Einaudi: Tiny Desk Concert", "description": "Kara Frame | July 15, 2022\nLudovico Einaudi was on a North American tour, playing before audiences in the thousands, when he stopped by the NPR office to play a far more intimate setting: a Tiny Desk set. It’s the first tour for the Italian pianist and composer since the beginning of the pandemic, following the release of his 2022 album, Underwater. It’s an album that captures how many have felt in the pandemic — feeling underwater, or trapped in another world. \n\nIt’s that relatable feeling — like we’re treading water trying to remain above the surface, powering through the adversity of the last two years — that makes Einaudi’s music so emotional and reflective. The pulsating strings of the opening song to his Tiny Desk concert, the track “Experience” from his 2013 album In A Time Lapse, demand attention, captivating the audience. The fact that the song recently went viral due to a TikTok trend only proves how welcoming Einaudi’s music is — and why he is the most-streamed classical pianist of all time.\n\nLudovico Einaudi’s presence at the piano keeps you waiting for more. His fingers glide over the keys effortlessly, but he never seems rushed. As he plays, his eyes are closed. And in this concert, you can tell his music moves him as much as it does his audience.\n\nSET LIST\n“Experience”\n“Fly”\n“Flora”\n“Low Mist”\n\nMUSICIANS\nLudovico Einaudi: piano\nFederico Mecozzi: violin\nRedi Hasa: cello\nFrancesco Arcuri: percussion\n\nTINY DESK TEAM\nProducer/Director: Kara Frame\nAudio Engineer: Josh Rogosin\nDirector: Joshua Bryant\nCreative Director: Bob Boilen\nSeries Producer: Bobby Carter\nEditor: Kara Frame\nVideographers: Kara Frame, Joshua Bryant, Michael Zamora, Pierre Kattar\nProduction Assistant: Jill Britton, Joby Tanseco\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #ludovicoeinaudi", "link": "https://www.youtube.com/watch?v=2oyZ9OM-neM", "date_published": "2022-07-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Curse Of Lono: Tiny Desk (Home) Concert", "description": "Bob Boilen | July 14, 2022\nThe resonant voice of Felix Bechtolsheimer has me obsessed with his band Curse of Lono. For the group's Tiny Desk (home) concert, the six musicians set up shop in the office at Bechtolsheimer's house above his home studio in South London. They begin their set as they do their evocative 2022 album, People In Cars, with the song \"Let Your Love Rain Down On Me.\" Bechtolsheimer's baritone is set against the dreamy wail of the pedal steel as he sings, \"I'm gonna make my move, hear the engine roar / Roll the windows down, slam my foot to the floor / Now I'm driving hard in this big machine / When they kill the pain, we'll all get clean.\" All that angst leads to the chorus which, for me, offers one of the few glimmers of hope: \"Let your love rain down on me.\" This isn't hope-filled, uplifting music; these are dark songs written following the losses of Felix's father, uncle and former girlfriend. That former partner is the subject of the final spine-chilling song. \"So Damned Beautiful\" tells the tale of her drug-filled weekend affair that ends in tragedy. It's the first duet Felix Bechtolsheimer has written; originally recorded with Tess Parks, it's sung here with Bo Lucas of the Brighton duo Lucas & King. The fragile characters and cinematic storytelling make their impact thanks to a band that knows how to delicately weave its sound and pulsing textures with an underpinning of drama and plenty of open space that leaves me mesmerized.\n\nSET LIST\n\"Let Your Love Rain Down On Me\"\n\"Steppin' Out\"\n\"So Damned Beautiful\"\n\nMUSICIANS\nFelix Bechtolsheimer: vocals, guitars\nBo Lucas: vocals\nJoe Harvey Whyte: pedal steel\nTom Sansbury: bass, vocals\nChris Jones: drums, percussion\nCarlos de los Santos: keys, vocals\n\nCREDITS\nVideo by Babysweet\nAudio by Toby Hulbert\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Joshua Bryant\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Kara Frame, Joshua Bryant, Michael Zamora, Maia Stern, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#TinyDesk #NPRMusic #CurseOfLono", "link": "https://www.youtube.com/watch?v=Wl9j4OP9DKc", "date_published": "2022-07-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]