[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Bayonetta 3: Everything We Know So Far", "description": "Bayonetta 3 had a spicy new trailer revealing the official release date for the game. In this video we break down everything you need to know about the latest Nintendo Switch exclusive.\n\n#gaming #bayonetta3 #gamespot\n\nBayonetta 3 has been one of the most-anticipated games for Nintendo Switch for several years. It was announced way back in 2017 at The Game Awards and since then all we’ve gotten were ports of the first two games. We finally got to see the game in action in Summer 2021, assuring us that it wasn’t vaporware, but still most of the game's features remained a complete mystery.\n\nThat is until recently when Bayonetta 3 finally got a release date and some shiny new info for fans to feast on.    \n\nIn Bayonetta 3, the Umbra Witch teams up some familiar faces, as well as a new one named Viola, in order to put an end to the terror of the mysterious evil known as Homunculi. These new baddies are considered man-made bioweapons and according to Viola, hope for defeating them lies with a scientist named Sigurd. As far as who Viola is, very little is still known, but the release date trailer does hint at a connection between the character and Luka. But I’m sure we’ll have plenty of time to uncover everything about Viola as she is a playable character that wields a sword and has a cat companion named Cheshire.   \n\nAside from Luka, some of those other familiar faces you can expect to see include: Jeanne, Rodin, and Enzo. \n\nAnd that’s pretty much all we’ve been given in terms of plot, as developer Platinum Games has remained tight-lipped about many details for years. However, we can confirm some of the locations players will visit in Bayonetta 3 include Tokyo and China. As for why the game’s main character is taking out enemies in the middle of the Shibuya District, fans have their theories, but we’ll have to wait for the official word from Platinum before diving into all of that.\n\nTimestamps: \n0:00 Intro\n0:35 Plot\n1:43 Gameplay\n2:56 Development Team\n3:57 Release", "link": "https://www.youtube.com/watch?v=I1Td5VTLJKU", "date_published": "2022-07-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Exoprimal Hands-On Preview", "description": "Capcom's third-person multiplayer game is a thoughtful cooperative shooter that puts a premium on teamwork and team composition.\n#gaming #capcom #exoprimal \n\nWe played about three hours of Exoprimal during its recent closed network test, which gave a sense of some of its multiplayer modes and the mech suit character classes you can use within them. While matches involve fighting off waves of prehistoric creatures, your actual goal is to beat another team of exosuit-wearing dino hunters.\n\nThough we only played for a few hours and saw only a small portion of what Exoprimal has to offer, overall, the game offered a lot of goofy, over-the-top fun in this technical test. Developer Capcom's approach to team-based gameplay uses a lot of tried-and-true ideas borrowed from other games to great effect, and fighting huge dinosaurs is just as cool and pulse-pounding as it sounds. The PvP aspects might not be quite as solid when it comes to class mechanics, but they can definitely be just as exciting and engaging, especially with a smart, communicative team. \n\nExoprimal is a surprisingly fun and smart team-based shooter with a lot that works--it'll be fascinating to see just how well the game works when all its components are offered to players.\n\n\nTimestamps:\n00:00 - Intro\n00:48 - Dino Survival mode\n01:45 - Exosuits\n03:19 - T-Rex and Triceratops\n04:50 - PvP battles\n08:44 - Neo T-Rex", "link": "https://www.youtube.com/watch?v=MEIkK11k09U", "date_published": "2022-07-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God Of War Ragnarök Collector's Editions Snatched Up By Resellers | GameSpot News", "description": "God of War Ragnarok Collector's Editions are hard to come by, Secret Lab creates an Assassin's Creed chair, and gaming merch for your cat is incoming.\n\n#Gaming #GodofWarRagnarok #AssassinsCreed \n\nThe God of War: Ragnarök collector’s editions are on sale, but can you get your hands on one? Plus, more stuff to buy, including a new Secret Lab chair and Stray merch for your cat. All this on today’s GameSpot News.\n\nEarlier today, the Collector’s and Jötnar editions of God of War: Ragnarök went on sale at various retailers, but in traditional limited edition fashion, it seems like they’ve sold out fast. While inventory has fluctuated across various retailers, many would-be purchasers are reporting that they’re unable to acquire the highly coveted physical collections.\n\nOf course, where there’s thunder, there’s lighting, AKA resellers, with listings of the most premium Jötnar edition listed for hundreds of dollars more on eBay.\n\nThinking of putting down the money on one of the two deluxe releases? Here’s what you need to know. The Collector’s Edition retails for $200, including a 1:1 scale replica of Thor’s hammer Mjölnir, Dwarven Dice, Vanir Carvings, and a steelbook case. The $260 Jotnar edition includes all that, plus a 7 inch vinyl of the game’s soundtrack, a cloth map of the in-game world, a ring, and a pin set. Both versions include the same digital, in-game cosmetics, and while both have the steelbook case, the copy of the game provided is a digital one.\n\nIf you wish to purchase either the Collector’s Edition or the Jötnar Edition of the game, we heavily advise you to not do it through a reseller and try your luck with an official retailer. God (of War) speed to you.\n\nIf you find yourself out of luck with that, and you have money burning a hole in your pocket, perhaps a new gaming chair will scratch your retail therapy itch. Themed around Assassin’s Creed for your Ass’s need, Secret Lab has partnered with Ubisoft to create this limited edition gaming chair for the series’ 15th anniversary. A Titan Evo model, which GameSpot named best gaming chair of 2022, the white, red, and grey seat is adorned with a spherical diagram on the back detailing the evolution of the Assassin’s Creed logo.\n\nAnd if you’re looking to do a full upgrade of your gaming space, Secret Lab is also producing an Assassin’s Creed version of its Magnus desk, which is adorned with numerous magnets to hold things in place such as your cable management system and desk mat.\n\nUbisoft is celebrating the 15th anniversary of Assassin’s Creed all year long, with in-game events and new cosmetics for Valhalla, and an upcoming future of the franchise presentation happening in September.\n\nTIME CODES: \n00:18 - God of War Ragnarök Collector's Editions being resold\n01:35 - Secret Lab x Assassin's Creed gaming chair\n02:29 - Stray gaming merchants for your cat", "link": "https://www.youtube.com/watch?v=Dv8eh_Rkl-8", "date_published": "2022-07-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PowerWash Simulator Is Surprisingly Great | GameSpot After Dark Episode 153", "description": "This week we let the GameSpot Magic 8 Ball determine our future. Lucy and Tam have been cleaning up the streets in PowerWash Simulator, and Jordan is here to tell you if you play Escape Academy solo, you're PLAYING IT WRONG GREG MILLER!\n\n#gaming #powerwashsimulator #gamespotafterdark", "link": "https://www.youtube.com/watch?v=jFTyDF26nk0", "date_published": "2022-07-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Campaign Network Co-Op Gameplay Flight Preview Full Presentation", "description": "Join the team at 343 Industries for a first look at Campaign Network 4 player co-op gameplay. Featuring developers from the Campaign team, get an early look at Campaign Network Co-Op, Mission Replay, and learn more about the upcoming flight.\n\nTimestamps\n0:00 Introduction\n5:40 How Co-Op in Halo Infinite Works\n10:02 4 Player Co-Op Gameplay\n22:10 Mission Replay\n35:39 Conservatory Co-Op Gameplay\n59:58 Outro\n\n#haloinfinite #gaming", "link": "https://www.youtube.com/watch?v=_sjYHktyfB4", "date_published": "2022-07-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PlayStation Announces Stars Reward Program | GameSpot News", "description": "PlayStation Stars rewards you for playing, Skate is going free-to-play, Multiversus is getting an open beta, and Rumbleverse gets a launch date.\n#Gaming #PlayStation #PS5 \n\nI’m seeing Stars! PlayStation Stars! Learn all about PlayStation’s new rewards program, as well as Multiversus, Skate, and Rumbleverse updates on today’s GameSpot News.\n\nIn its latest attempt to match Xbox’s offerings, PlayStation is instituting a rewards program it is dubbing PlayStation Stars. Think of it like challenges in a video game. Simply logging on and playing will get you rewards, but there will be specific campaigns and activities you’ll be able to complete for greater winnings. These bounties can then be cashed in for things like PSN wallet funds or items in the PlayStation Store. PS Plus subscribers will also receive points for making digital purchases.\n\nPlayStation will also be offering digital collectibles, which in this day and age, sounds a lot like NFTs, but Sony’s PlayStation Network head Grace Chen assures us they’re not. Chen told the Washington Post, “It's definitely not NFTs. Definitely not. You can't trade them or sell them. It is not leveraging any blockchain technologies and definitely not NFTs.\"\n\nWow, three definitely nots! It sounds like players have successfully scared off Sony from going anywhere near the blockchain. We did it! Great job, gamers!\n\nPlayStation Stars early tests are being conducted as we speak, with a full rollout for every user coming later this year.\n\nThe next Skate is going to launch as a free-to-play title. In an interview with GameSpot, the game’s creative directors explained that the choice to move to that model was made in order to remove barriers to entry for anyone who wants to experience the game. Skate will be supported over time with content drops such as new gameplay elements and seasonal events. And yes, it will be cross play and progression on PC and console, both current and previous gen, as well as an eventual mobile version of the game.\n\nThe interview goes on to explain how this new live-service version of Skate retains the spirit of the original titles, as well as how it’s evolved. A link to the interview is in the description below.\n\nTIME CODES: \n00:13 - PlayStation Stars\n01:23 - Skate free-to-play\n02:01 - Multiversus open beta\n02:56 - Rumbleverse release date", "link": "https://www.youtube.com/watch?v=DQUd8qY1AwE", "date_published": "2022-07-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]