[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "Podcast Highlight Weak-ly News: Pregnancy Centers Are Evil and Democrats Turn Against Biden", "description": "The Babylon Bee's Adam Yenser Yinsinger yeets the week’s news through your skull—news like Nancy Pelosi calling crisis pregnancy centers evil and recent polling numbers that suggest Democrats don’t want President Joe Biden to run again in 2024. Weird!\n\nHow could you possibly work at the Bee without enjoying cartoons?\n\nCheck out the full podcast here: \n\nAlso, be sure to give Adam's Youtube channel a follow: https://www.youtube.com/user/adamyenser\n\nBecome a premium subscriber:  https://babylonbee.com/plans\n\nThe Official The Babylon Bee Store:  https://shop.babylonbee.com/\n\nFollow The Babylon Bee:\nWebsite: https://babylonbee.com/\nTwitter: https://twitter.com/thebabylonbee\nFacebook: https://www.facebook.com/TheBabylonBee\nInstagram: http://instagram.com/thebabylonbee", "link": "https://www.youtube.com/watch?v=WxXkgJy7XSc", "date_published": "2022-07-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "The Bee Weekly: Top Ten Cartoons with Tuttle Twins Voice Actor Alex Elkin!", "description": "Kyle and Adam are joined by guest host, Comedian and Tuttle Twins voice actor Alex Elkin, to dive deep into hard hitting issues like Jill Biden comparing “latinx” to “breakfast tacos,” Hunter Biden’s leaked iCloud messages (why is no one covering this?), and more! We also list our top 10 cartoons OF ALL TIME, thanks mostly to hate mail saying that grown men shouldn’t watch cartoons. And don’t miss out on this week’s Sizzler Fact!\n\nBee Radio w/ Austin Robertson and Weakly News w/ Adam Yenser strike back at fake news by being even faker. The Babylon Bee talks to Glen Scrivener about his new book The Air We Breathe where he suggests people are believers without even knowing it. Hmm?! \n\nThe Air We Breathe: https://www.amazon.com/Air-We-Breathe-Kindness-Christian/dp/1784987492\n\nIn the subscriber portion, the crew reads subscriber headlines, the classic article of the week, bonus hate mail, and then comedian Alex Elkin answers the ten questions.\n\nCheck out Alex Elkin’s stand-up tour dates: http://alexelkin.com\n\nKyle and Joel’s new book The Postmodern Pilgrim’s Progress is out. Get it now on Amazon. \n\nBecome a premium subscriber:  https://babylonbee.com/plans\n\nThe Official The Babylon Bee Store:  https://shop.babylonbee.com/\n\nFollow The Babylon Bee:\nWebsite: https://babylonbee.com/\nTwitter: https://twitter.com/thebabylonbee\nFacebook: https://www.facebook.com/TheBabylonBee\nInstagram: http://instagram.com/thebabylonbee", "link": "https://www.youtube.com/watch?v=VQENNHwxyzE", "date_published": "2022-07-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]