[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Kingdom Hearts 4 Trailer Sparks Star Wars Speculation | GameSpot News", "description": "Kingdom Hearts 4 has been announced along with a new mobile game called Kingdom Hearts: The Missing Link. \n#GamingNews #KingdomHearts\n\nSquare Enix has announced that development is underway on Kingdom Hearts IV. The trailer showcases some brief glimpses of gameplay as Sora squares off against a giant shadow monster in the new location of Quadratum. \n\nThere's no word on what platforms KHIV will be available for, although Kingdom Hearts 3 was eventually released for PC, Xbox One, PS4, and Nintendo Switch, with the latter being a cloud-streaming version. Likewise, there's also no release date shared.\n\nAs seen in the Kingdom Hearts IV trailer, the AT-ST's foot seems to make a quick cameo at around 0:34 in the trailer, in a location that could be the forest moon of Endor:\n\nIn more Kingdom Hearts news, Square Enix also announced a new mobile game called Kingdom Hearts: The Missing-Link, which will have its first closed beta later this year.\n\nSTAMPS\n00:00 - Intro\n00:04 - Kingdom Hearts 4 \n01:23 - Star Wars? \n02:22 - Kingdom Hearts Missing Link", "link": "https://www.youtube.com/watch?v=F7HOKd1UAHM", "date_published": "2022-04-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Nintendo Switch Sports Preview", "description": "Nintendo is finally bringing its motion-controlled sports series to the Switch. Here's what we thought of it based on a hands-on preview.\n\nNintendo Switch Sports is the long awaited return to the motion controlled sports series that was kicked off 16 years ago with Wii Sports. In that time, the series was seldom seen with the exception of Wii Sports Resorts, and the HD remaster of Wii Sports for the Wii U. Nintendo Switch Sports is a welcome return to classics like Tennis and Bowling, but with the addition of new sports such as Soccer, Volleyball, Badminton, and Chambara. GameSpot's Kurt Indovina (and self-proclaimed Wii Sports enthusiast) got 45 minutes of hands-on time with the game, getting a look at all six sports. Watch the above video to hear about his first-hand experience.\n\n#SwitchSports", "link": "https://www.youtube.com/watch?v=Drv_QigzItw", "date_published": "2022-04-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Here's What Other Games Should Steal From Elden Ring", "description": "From Software's games have always had a somewhat niche audience, but with the release of Elden Ring, the size of that audience seems to have exploded. The Soulsborne formula works exceedingly well when applied to the template for open-world games, it turns out. In fact, you could argue that it's exploring a strange and enormous world, rather than the usual Souls-style difficulty and mechanics, that makes Elden Ring so fun.\n\nThe open-world genre is pretty expansive, and as with major winners before it, like Ubisoft's Assassin's Creed games or Nintendo's The Legend of Zelda: Breath of the Wild, Elden Ring is sure to leave a mark on the field. The question is, what should the rest of the open-world genre learn from Elden Ring?", "link": "https://www.youtube.com/watch?v=GXiTqw3sQM4", "date_published": "2022-04-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "KINGDOM HEARTS 4 REVEAL AND KINGDOM HEARTS 20th ANNIVERSARY TRAILER", "description": "Check out the announcement trailer for Kingdom Hearts IV as well as some trailers to celebrate the 20th anniversary for the series.\n\n0:00 Intro\n4:04 Kingdom Hearts IV Reveal Trailer", "link": "https://www.youtube.com/watch?v=Xs-AUVLCMA8", "date_published": "2022-04-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]