[{"source": "https://www.theguardian.com/rss", "title": "Soaring childcare costs in UK to hit hard-up parents this summer", "description": "<p>Families face stressful holidays with fewer providers, higher prices or deciding to keep their children at home while they work</p><p>The cost of childcare over the holidays is likely to be the highest on record this summer as providers of activity camps and other paid-for care are forced to put up prices, while others have gone out of business altogether.</p><p>A leading national charity concerned with childcare and family issues said that a cocktail of rising costs, including higher utility bills, food prices and national insurance contributions is contributing to pressures on holiday care providers.</p> <a href=\"https://www.theguardian.com/money/2022/jul/17/soaring-childcare-costs-in-uk-to-hit-hard-up-parents-this-summer\">Continue reading...</a>", "link": "https://www.theguardian.com/money/2022/jul/17/soaring-childcare-costs-in-uk-to-hit-hard-up-parents-this-summer", "date_published": "2022-07-17 11:00:35+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Penny Mordaunt pledges to create ‘millions of green jobs’ if elected Tory leader", "description": "<p>Exclusive: Conservative leadership candidate sets out her views on climate change and the environment</p><ul><li><a href=\"https://www.theguardian.com/politics/live/2022/jul/17/tory-leadership-debate-rishi-sunak-penny-mordaunt-liz-truss-conservatives-next-pm#maincontent\">Politics live: latest updates</a></li></ul><p>Penny Mordaunt has told <a href=\"https://www.theguardian.com/politics/2022/jul/15/uk-net-zero-goal-tory-leadership-race\">Conservative critics of net zero</a> that “environmentalism and conservatism go hand in hand” as she vowed to create “millions of green jobs” if elected leader.</p><p>The MP for Portsmouth North is the only Tory leadership candidate so far to properly set out views on climate change and the environment.</p> <a href=\"https://www.theguardian.com/politics/2022/jul/17/penny-mordaunt-pledges-to-create-millions-of-green-jobs-if-elected-tory-leader\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/jul/17/penny-mordaunt-pledges-to-create-millions-of-green-jobs-if-elected-tory-leader", "date_published": "2022-07-17 08:51:11+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The big picture: inside a quilombo religious house in Brazil", "description": "<p>Tamara Merino’s image of a priest from the Afro-Brazilian Candomblé religion in<em> </em>a community built by formerly enslaved people has a poignant sense of nostalgia and melancholy</p><p>For three years beginning in 2014, the photographer <a href=\"https://www.tamaramerino.com/\">Tamara Merino</a> made a study of the people still living in <em>quilombos</em>, hinterland settlements in Brazil originally formed in the 18th and 19th centuries by people who had escaped slavery. Most of the families in these communities are direct descendants of those people. Before abolition in the country in 1888, more slaves were trafficked from Africa to Brazil – <a href=\"https://www.slavevoyages.org/assessment/estimates\">about 5.8 million</a> – than to any other nation. It is estimated that 16 million Brazilians are <em>quilombolas</em>. They were <a href=\"https://www.theguardian.com/world/2018/mar/05/descendants-of-slaves-celebrate-brazil-land-rights-victory\">granted rights to appeal for land titles in 1988</a>, but the process has been painfully slow and politically fraught.</p><p>In the time she spent in these communities, Merino identified a particular spirit among the people she photographed, what she calls “a deep emotional state of nostalgia and a profound melancholy” expressed in the Portuguese word <em>saudade</em>. “This constant feeling of <em>saudade</em> is actually a poetic way to describe missing one’s homeland,” she says in her introduction to her pictures, now on display at the <a href=\"https://www.bronxdoc.org/\">Bronx Documentary Center</a> in New York as part of the <a href=\"https://www.bronxdoc.org/events/latin-american-foto-festival-2/detail\">Latin American Foto festival</a>. “It is the very same engine that kept their people alive for so many centuries, during sadness and torture… It has been transmitted almost as if it were genetic, generation after generation, into the present day.”</p> <a href=\"https://www.theguardian.com/artanddesign/2022/jul/17/the-big-picture-tamara-merino-candomble-water-goddess-brazil\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/2022/jul/17/the-big-picture-tamara-merino-candomble-water-goddess-brazil", "date_published": "2022-07-17 06:00:29+00:00", "persistent": false, "user": null, "language": "en-UK"}]