[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "pH-1, Mndsgn and Audrey Nuna: AAPI Heritage Month Tiny Desk (Home) Concert", "description": "This year, NPR Music's Tiny Desk is celebrating Asian American and Pacific Islander Heritage Month with a Tiny Desk (home) concert featuring performances from pH-1, Mndsng and Audrey Nuna. These artists represent just a sliver of the cultural diversity that exists within the Asian American and Pacific Islander community, and each is performing a Tiny Desk concert for the first time.\n\nAlex Ramos | May 20, 2022\nKorean-American rapper pH-1 radiates much of the same visual warmth of his setting. It disperses around him, highlighting his bandmates, who are planted in the fringes of an intense blue backdrop. The contrast lends a sentimentality that's emphasized by the opening lines of his 2018 hit, \"Homebody.\" Perhaps the setting — a nod to his parents who, after immigrating to the United States, found stable work in a dry cleaning business — makes the artist just a bit more wistful than usual. The song builds around its hook with cascading keys and airy guitars, insisting that hanging out at home is just as fulfilling as going out to party.\n\nThis tenderness anchors all three performances for the Asian American and Pacific Islander (AAPI) Heritage Month edition of the Tiny Desk (home) concert series.\n\nAfter pH-1 raps about staying in, Mndsgn (pronounced \"mind design\") argues for the opposite course in his song \"Medium Rare.\" But the core idea of self-care rings true all the same. \"Fear is just a comfy queen-size bed,\" he sings from a home studio, surrounded by framed art, records and plush animals. The Los Angeles producer and songwriter's voice is soft, floating above a spiral of dreamy, psychedelic instrumentation. It's hypnotic, but the message doesn't fade into the haze; you can start your quest for love and freedom at home anytime, he argues. Just follow two simple steps: \"Get up, and start your day.\"\n\nFinally, Audrey Nuna takes a raw cut from the deluxe edition of her 2021 album, A Liquid Breakfast, and builds on top of it. \"molars\" narrates the push and pull of Nuna's emotions, which \"come crawling back\" even after she tries to stifle them. Her voice distorts with the chorus, pushing down hurt. Covers of 1990s Korean magazines line the four walls that surround the artist, as if to reflect remnants of the past while centering her current self. And when Nuna asks, \"Now who's emotional?\" it's not only a challenge, but also a declaration of self-preservation.\n\nSET LIST\npH-1: \"Homebody\" \nMndsgn: \"Medium Rare\"\nAudrey Nuna: \"molars\"\n\nMUSICIANS\npH-1:\npH-1: vocals\nJetti: keys\nseungq: drums\nCëS: bass\nsungjunpvrk: guitar\n\nMndsgn:\nMndsgn: vocals, keys\nSwarvy: bass, vocals\nWill Logan: drums\nLionmilk: keys\n\nAudrey Nuna:\nAudrey Nuna: vocals\nEnmanuel Mendez: keys, MD\nMarcus Semaj: vocals\nReysha Rami: vocals\n\nCREDITS\nProduction: Julie Rene Tran and Đặc Biệt\n\npH-1\nVideo: THECUT Studio\nAudio: Jam Session, MOL Studio\nBand Tech: Sound Factory\n\nMndsgn\nProducer: Shane Sakanoi\nDirector of Photography: Rich Hama\nEditor: Noah Weisfogel\nAudio Engineering: Swarvy and Mndsgn \n\nAudrey Nuna\nVideo: John Liwag\nAudio: Enmanuel Mendes\nAudio Mix: Mike Piazza\nSet Design: Xkylar\nSet Design Assists: Danielle King & Tiffany Ribeiro\nProduction: Jane Kim\nSpecial Thanks: Anwar Sawyer, SMG Ent, Willow Rothbart \n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Michael Zamora\nAnimator: Kaz Fantone\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Joshua Bryant, Kara Frame, Maia Stern, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n\n#NPRMusic #TinyDesk #pH1 #MNDSGN #AudreyNuna", "link": "https://www.youtube.com/watch?v=O2Twk386qm4", "date_published": "2022-05-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]