[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "How Games Get Sniper Rifles Wrong - Loadout", "description": "Virtual sniping comes in such a spectrum of flavours, from Call of Duty quickscopes, and Counter-Strike: Global Offensive AWP picks, to measuring your range and bullet drop in games like ARMA 3 and Sniper Elite 5. But games don’t always get the humble sniper rifle quite right. With the help of Jonathan Ferguson, Keeper of Firearms & Artillery at the Royal Armouries Museum in the UK, we break down the differences between the virtual sniper rifle and its real counterparts.\n\n0:00 - Intro\n01:07 - History of Sniper Rifles\n04:37 - Range & Bullet Drop\n06:45 - Scope Glint\n08:23 - Quickscoping\n09:19 - Bolt Action vs. Semi-Auto Rifles\n10:26 - Anti-Materiel Rifles\n11:34 - Realistic Gaming Sniper Rifles\n12:48 - Variety of Virtual Sniping Playstyles\n15:10 - Ending\n\nIn this episode of Loadout, Dave Jewitt visits the Royal Armouries to talk to Keeper of Firearms & Artillery Jonathan Ferguson to chat about gaming’s obsession with the humble Sniper Rifle, and how sniper rifles in video games measure up to reality.\n\nYou can check out more episodes of Loadout right here. - https://www.youtube.com/watch?v=yzSrmGkpWKk&list=PLpg6WLs8kxGMzIemU1gyyLmg5VlKI2UvC\nYou can check out our Firearms Expert Reacts series here. - https://www.youtube.com/watch?v=5FVzcoRjoN4&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/", "link": "https://www.youtube.com/watch?v=BxwttKn3fjc", "date_published": "2022-11-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Wild West Expert Reacts to More Of Red Dead Redemption 2", "description": "Danny Michael, associate curator at the Buffalo Bill Center of the West museum, breaks down Rockstar's western epic.\n\nRed Dead Redemption 2 saw Rockstar return to the frontiers of the Wild West for a prequel to the seminal Red Dead Redemption. Rockstar went out of their way to make Red Dead Redemption 2 feel and look authentic. We brought Danny in to see if Rockstar delivered on that promise.\n\nIn this video Danny breaks down old western towns and cities, hunting, train robberies, firearms, and architecture. Part 2 of this series is on the way so make sure to subscribe to GameSpot to see more in the future.\n\n00:00 - Intro\n00:51 - Train Robberies\n03:20 - Plague Town\n04:03 - Catalogues and Shopping\n05:57 - Hunting\n10:54 - The Mauser\n13:05 - House Building\n15:38 - Outro\n\nCenter of the West: https://centerofthewest.org/\nCody Firearms Museum: https://centerofthewest.org/our-museums/firearms/\nCody Firearms Museum Twitter: https://twitter.com/codyfirearms\nCody Firearms Museum Instagram: www.instagram.com/codyfirearmsmuseum\nARMAX: https://www.armaxjournal.org/\nHistory Unloaded: https://historyunloaded.podbean.com/\n\n#reddead2 #reddeadredemption #gaming", "link": "https://www.youtube.com/watch?v=CRhxQpotdCM", "date_published": "2022-11-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "15 Things I Wish I Knew In Pokemon Scarlet & Violet", "description": "Pokemon Scarlet and Violet are finally out and they mark a number of changes for the mainline series. Here are 15 ways to make the most of your time in Paldea!\n#gaming #gamename #gamespot", "link": "https://www.youtube.com/watch?v=Wx8XKS-Jnc8", "date_published": "2022-11-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best PlayStation Plus Games November 2022", "description": "Brought to you by PlayStation Plus. There are plenty of awesome games joining PlayStation Plus this month, including Kingdom Hearts, Skyrim, Rainbow Six Siege, and a bunch of Ratchet and Clank titles. Here's your rundown of everything coming to PS+ this month. \n\nThe nights are getting longer, the weather’s getting colder, and your family is hitting you up about your plans for the holidays. So you know what that means: time to park yourself in front of the telly and get some gaming going. Here’s what’s coming to PlayStation Plus this month, and my recommendations for some cozy games to play from the Game Catalog.\n\nIf you're a PlayStation Plus Extra member, you can play through the entire Dark Seeker saga as Kingdom Hearts 1.5+2.5 ReMix, Kingdom Hearts 3, and Melody of Memory join the Game Catalog. Team up with your friends in Rainbow Six Siege or The Division 2, or become the Dragonborn and adventure to your heart's content in Skyrim. There are also fantastic indies like What Remains of Edith Finch and The Gardens Between to dig into. If you're a PlayStation Plus Premium member, five more Ratchet and Clank games are joining the Classics Catalog to celebrate the series' 20th anniversary. We also list our five favorite cozy games from the Game Catalog.\n\nThere are so many more games coming to PS Plus, so to keep up to date, make sure to subscribe to GameSpot.\n\n#playstation #psplus #gaming", "link": "https://www.youtube.com/watch?v=RP_S7Hudzts", "date_published": "2022-11-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Call of Duty: Modern Warfare 2 (2022)’s Guns PART 2", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down more of the weaponry of Call of Duty: Modern Warfare 2 (2022), including the PP-19 Bizon 2, the SA-25 PILA missile launcher, and a Glock with a FAB Defence chassis.\n\n00:00 - Opening\n00:40 - FightLite MCR\n01:53 - Browning Citori 725\n02:45 - Steyr AUG HBAR T\n04:10 - PP-19 Bizon 2\n05:46 - HK932A2\n07:21 - SA-25 PILA\n09:16 - Glock with FAB Defence chassis\n10:32 - RPK\n12:03 - SCAR 17S\n15:11 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down more of the guns of Call of Duty: Modern Warfare 2 (2022) and compares them to their real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=K75aarJ-Vxs", "date_published": "2022-11-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]