[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Natural immunity protects", "description": "Download free high-res PDFs of the posters, download free copies of my two text books. Any donations using this link help the work of campbell teaching.\nhttps://drjohncampbell.co.uk/\n\nI taught bespoke health care as a fundamental principle for decades.\n\nDoes natural and hybrid immunity obviate the need for frequent vaccine boosters against SARS-CoV-2 in the endemic phase?\n\nhttps://pubmed.ncbi.nlm.nih.gov/36366946/\n\nhttps://onlinelibrary.wiley.com/doi/10.1111/eci.13906\n\nStefan Pilz   John PA Ioannidis \n\nThe coronavirus disease 2019 (COVID-19) pandemic has entered its endemic phase\n\nWe observe significantly declining infection fatality rates due to severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2). \n\nNow\n\nIt is crucial but challenging to define current and future vaccine policy,\n\nin a population with a high immunity against SARS-CoV-2,\n\nconferred by previous infections and/or vaccinations. \n\nVaccine policy must consider the magnitude of the risks conferred by new infection(s),\n\nwith current and evolving SARS-CoV-2 variants, \n\nhow these risks vary in different groups of individuals, \n\nhow to balance these risks against the apparently small, but existent, risks of harms of vaccination, \nand the cost-benefit of different options. \n\nMore evidence from randomized controlled trials,\n\nand continuously accumulating national health data is required,\n\nto inform shared decision-making with people who consider vaccination options. \n\nVaccine policy makers should cautiously weight what vaccination schedules are needed, \n\nand refrain from urging frequent vaccine boosters unless supported by sufficient evidence.\n\nThe key issue\n\nWhether and how to consider natural immunity after SARS-CoV-2 infections, and hybrid immunity\n\nIt is very likely that the large majority of the global population has been infected with SARS-CoV-2,\n\nat least once by late 2022\n\n(Excluding China)\n\nPeople who have never been infected have probably become a rarity. \n\nIt is well established that previous SARS- CoV-2 infections induce a significant and long-lasting protection against reinfections, \n\nand even more so against severe COVID-19.3-6 \n\nLets check the evidence\n\nhttps://pubmed.ncbi.nlm.nih.gov/35904405/\n\nRisk of reinfection and disease after SARS-CoV-2 primary infection: Meta-analysis\n\n91 studies, n = 15,034,624\n\nInfections n = 158,478 reinfections\n\nDuring the first 3 months of Omicron wave, \n\nthe reinfection rates reached 3.31%. \n\nOverall rates of severe/lethal COVID-19 were very low,\n\n(2-7 per 10,000),\n\nand were not affected by strain predominance.\n\nConclusions\n\nA strong natural immunity follows the primary infection and may last for more than one year, \n\nsuggesting that the risk and health care needs of recovered subjects might be limited. \n\nAlthough the reinfection rates considerably increased during the Omicron wave, \n\nthe risk of a secondary severe or lethal disease remained very low. \n\nThe risk-benefit profile of multiple vaccine doses for this subset of population needs to be carefully evaluated.\n\nBack to Pilz, PA loannidis paper\n\nCompared to vaccination by two doses, \n\nnatural immunity was associated with a significantly higher protection against SARS-CoV-2 infections before the emergence of Omicron, \n\nwhen identical times have elapsed since the last immune conferring event.\n\nDenmark\n\nLittle viral spread until late 2021,\n\nand then massive infections with Omicron,\n\nensued in a population that had been widely vaccinated. \n\nOmicron infection fatality rate (IFR) until mid-March 2022, \n\n6.2 per 100,000 infections,\n\namong apparently healthy people 17-72 years\n\nCompared to previous infection waves in Denmark, there was a very significant decline in IFR\nOmicron wave\nIn populations with substantial prior exposure to SARS-CoV-2, \nre-infections, less than a quarter of the hospitalization risk,\nand one-tenth the mortality\nVojvodina, Serbia\n1% of re-infections required hospitalization\nCase fatality for re-infections was 0.15%\nAccounting for non- ascertained infections, \nthis suggests that IFR for re-infections,\nmay be less than 0.05%, (even in people who have not been vaccinated)", "link": "https://www.youtube.com/watch?v=VjTsQ2Ufi4U", "date_published": "2022-11-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "G20 and the next pandemic", "description": "G20 Bali Leaders’ Declaration\n\nArgentina, Australia, Brazil, Canada, China, France, Germany, Japan, India, Indonesia, Italy, Mexico, Russia, South Africa, Saudi Arabia, South Korea, Turkey, United Kingdom, United States, and European Union.\n\nhttps://www.consilium.europa.eu/en/press/press-releases/2022/11/16/g20-bali-leaders-declaration/\n\nhttps://www.whitehouse.gov/briefing-room/statements-releases/2022/11/16/g20-bali-leaders-declaration/\n\nPart 22\n\nWe recognize that the extensive COVID-19 immunization is a global public good\n\nSection 23\n\nWe recognize the need for strengthening local and regional health product manufacturing capacities\n\nWe support the WHO mRNA Vaccine Technology Transfer hub\n\nWe acknowledge the importance of shared technical standards and verification methods, \nto facilitate seamless international travel, \n\ninteroperability, and recognizing digital solutions and non-digital solutions, \n\nincluding proof of vaccinations. \n\nEstablishment of trusted global digital health networks,\n\nthat should capitalize and build on the success of the existing standards and digital COVID-19 certificates. \n\nPart 24\n\nThe COVID-19 pandemic has accelerated the transformation of the digital ecosystem and digital economy. \n\nWe recognize the importance of digital transformation in reaching the SDGs. \n\nWe also reaffirm the role of data for development, economic growth and social well-being. \n\nG20 update\n\nhttps://www.g20.org/wp-content/uploads/2022/11/2022-G20-Bali-Update.pdf\n\n“Endeavour to move towards interoperability of systems including mechanisms that validate proof of vaccination, \n\nwhilst respecting the sovereignty of national health policies, \n\nand relevant national regulations such as personal data protection and data-sharing.” \n\nIndonesia’s Minister of Health Budi Gunadi Sadikin \n\nhttps://twitter.com/TimHinchliffe/status/1592232822483419138\n\nG20 countries should adopt digital health certificate using WHO standards\n\nLet’s have a digital health certificate acknowledged by WHO — if you have been vaccinated or tested properly — then you can move around\n\n(next World Health Assembly in Geneva) \n\nWHO seem to be on it already\n\nhttps://www.who.int/publications/i/item/WHO-2019-nCoV-Digital_certificates-vaccination-2021.1\n\nDigital documentation of COVID-19 certificates: vaccination status: technical specifications and implementation guidance, 27 August 2021\n\nUse of scan codes\n\nKlaus Schwab, World Economic Forum (WEF) Chair\n\nAttended\n\nFrom a doctor in Austria\n\nIt is currently a very emotional situation in my hospital \n\n(and in general in hospitals in Austria) \n\nbecause many of us in the health care sector are more or less forced to get a fourth vaccine dose. \n\nEven in my case as a physician who has received three doses and one infection just 6 months ago. \n\nThe rule is that if the last vaccination is more than one year and/or the last infection is more than 6 months ago you either have to test all 72 hours or to get an additional vaccine dose; \n\nif not you are at risk of having to pay 500 to 3600 Euros and may even get fired.\n\nVaccine passports\nhttps://lc.org/newsroom/details/111722-world-leaders-agree-to-implement-vaccine-passports-1", "link": "https://www.youtube.com/watch?v=zVBcITMAqnM", "date_published": "2022-11-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]