[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCHnyfMqiRRG1u-2MsSQLbXA", "title": "The world depends on a strange collection of items. They're not cheap", "description": "This government warehouse keeps our entire society up to standard. Part of this video was sponsored by Google Domains. Take the first step to get online with a domain name from Google Domains - go to domains.google/veritasium to get 20% off your first year. #GoogleDomains\n\n▀▀▀\nThanks to Rich Press and NIST for the great visit. \nThanks to Dr. Steve Choquette, Dr. Ben Place, and Dr. Johanna Camara for teaching us about the world of Standard Reference Materials.\nYou can check out all the cool work going on at NIST here: https://www.nist.gov/\n\n▀▀▀\nReferences:\n\nNIST (2022). Standard Reference Materials. – https://ve42.co/WhyStandard2022 \n\nMontgomery, R. & Bercik, I. (2022). NIST Standard Reference Materials 2022 Catalog. – https://ve42.co/SRMCatalog\n\nVincent, J. (2022). Made to measure: why we can’t stop quantifying our lives. The Guardian –\nhttps://ve42.co/Vincent2022\n\nProffitt, A. (2022). NIST Develops Monkeypox Reference Materials, Sees Growing Role in Outbreak Response. Diagnostics World. – https://ve42.co/Proffitt2022\n\n▀▀▀\nSpecial thanks to our Patreon supporters:\nJames Sanger, Louis Lebbos, Elliot Miller, Brian Busbee, Jerome Barakos M.D., Amadeo Bee, TTST, Balkrishna Heroor, Chris LaClair, John H. Austin Jr., OnlineBookClub.org, Matthew Gonzalez, Eric Sexton, John Kiehl, Diffbot, Gnare, Dave Kircher, Burt Humburg, Blake Byers, Evgeny Skvortsov, Meekay, Bill Linder, Paul Peijzel, Josh Hibschman, Mac Malkawi, Mike Schneider, John Bauer, Jim Buckmaster, Juan Benet, Sunil Nagaraj, Richard Sundvall, Lee Redden, Stephen Wilcox, Marinus Kuivenhoven, Michael Krugman, Cy 'kkm' K'Nelson, Sam Lutfi\n\n▀▀▀\nWritten by Derek Muller & Emily Zhang\nEdited by Trenton Oliver\nAnimation by Ivy Tello & Mike Radjabov\nFilmed by Derek Muller, Trenton Oliver, and Emily Zhang\nAdditional video/photos supplied by Pond5 & Getty Images\nMusic from Epidemic Sound \nProduced by Derek Muller, Petr Lebedev, and Emily Zhang", "link": "https://www.youtube.com/watch?v=esQyYGezS7c", "date_published": "2022-11-19 14:00:24+00:00", "persistent": false, "user": null, "language": "en-US"}]