[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Everything to Know About Stray", "description": "Stray, the game that lets you finally live every gamer’s dream of being a kitty in a cyberpunk world, is nearly upon us. So to prepare you for the latest game from renowned publisher Annapurna Interactive and developer BlueTwelve Studios, here’s everything you need to know about Stray.\n\nIn terms of gameplay, Stray, like our feline friends in general, defies simple explanation; being a mashup of platforming, exploration, and puzzle solving. As well as a cat simulator, which we all know is the main reason we’re all going to play the game.\n\nFirst and foremost, the game comes with a dedicated button that lets you meow. So don’t worry, the game has you covered there. You can even do it during cinematics, truly putting you into the mindset of a cat who doesn’t care for such arbitrary concerns like story and plot.\n\nBut, more importantly, while the game does contain platforming elements, most of the jumping and hopping around is triggered by button prompts rather than player control as you explore the city. The real focus is to have you explore the city, with the challenge coming from figuring out where to go, rather than how to navigate it. Initially, the game’s level start pretty straightforward and linear, but also contains more open-ended larger segments for your feline form to explore and uncover where you need to go.\n\nFurther, stray contains puzzle-elements, forcing you to try to figure out how to navigate through its world, such as pushing over plants as every cat does, or utilizing pulley systems to access new areas.\n\nHowever, these exploration and navigation segments are not all lackadaisical. At certain points in the game, you’ll be put into a chase sequence, where you’ll have to make split second choices about where and when to jump, forcing you to time exactly when you need to take a path. At the same time, you won’t be able to engage in combat, so your only choice will be to escape. You’ll need to think quickly and make precise movement choices adding to the pressure. Is that adrenaline you’re feeling or just catnip talking.\n\n0:00 - Intro\n0:19 - Plot & Setting\n0:45 - Gameplay\n3:34 - Platforms\n4:05 - Release Date & Price\n4:54 - Outro", "link": "https://www.youtube.com/watch?v=vpT_NRGCdn0", "date_published": "2022-07-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mass Effect And More Games Free For Prime Day | GameSpot News", "description": "A ton of games are free for Prime Day, more Call of Duty leaks, and a new Kirby game is announced.\n#Gaming #CallofDuty #primeday \n\nLooking for something to play this summer? Prime gaming has you covered with some awesome free games! Plus, Modern Warfare 2 leaks and a new Kirby title, all on today’s installment of GameSpot News!\n\nIt’s time to get your sci-fi on. Prime gaming is giving away a bunch of free titles, including Mass Effect Legendary Edition, Star Wars Jedi Knight 1 and 2, as well as Republic Commando, all four of which are some of the best science fiction video games ever.\n\nPlease go play Republic Commando and then go pester Lucasfilm to make another. It’s so, so good.\n\nIf that’s not your speed, maybe these racing titles will be. Need for Speed Heat and Grid Legends, a game that only came out a few months ago, are also included in the free Prime Gaming bundle, among a selection of other titles. You can check out the full list, as well as all the best Prime Day gaming deals at GameSpot.com\n\nCall of Duty games just can’t stop leaking, this time for the upcoming Modern Warfare II releasing this fall. While nothing has been confirmed, the images shared as a part of this new leak have been taken down via copyright claims.\n\nThe leak includes a list of killstreaks, perks, field upgrades, and modes that players can expect to find in the game, many of which have been featured in previous series’ entries. The biggest revelation is a variant of the massive scale Ground War mode, which features 64 players duking it out on large maps with vehicular combat. The alternate version of the mode, entitled Ground War Bomb, will reportedly feature alongside the standard Ground War, which is making its return to Call of Duty for the first time since 2019’s Modern Warfare.\n\nTIME CODES: \n00:16 - Prime Day games\n01:06 - Modern Warfare II leaks\n01:58 - Kirby's Dream Buffet", "link": "https://www.youtube.com/watch?v=DSe7V7Bgz7c", "date_published": "2022-07-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Where is Titanfall 3? Apex Legends Dev Working On New FPS Game | GameSpot News", "description": "Apex Legends developers Respawn Entertainment is reportedly working on a new single-player game, a Last of Us Part 1 remake animator responds to price point backlash and Blizzard officially ends Heroes of the Storm content development. \n#GamingNews #ApexLegends #titanfall3 \n\nAccording to recent job listings, the company is currently looking to hire for an \"Apex Universe FPS Incubation Title\" that seems to be aiming for single-player experience. The open positions include: a Senior Systems Engineer that will design, build, and maintain technology that enables the team to create engaging gameplay and fantastic experiences.\" As well as a Hard Surface Artist to “help build a brand new Respawn single-player adventure.\"\n\nSince the lead up to the release of PS5 and Xbox Series X|S, $70 price tags have been a bit of a heated conversation amongst gamers. Following the reveal of The Last of Us Part 1 remake at Summer Game Fest last month, many fans questioned if the high price tag is worth it for an old game that already got a remastered version last generation. \n\nRobert Morrison, one of the animators that worked on the remake, took to Twitter to address claims that the PS5 version is just a cash grab and said, “The price of the game is out of my control and worth is subjective to each individual. You can decide for yourself if you want it or not. All I’m saying is I am in awe of the work that an amazing group of people did on the project. A tremendous amount of passion was put into it.”\n\n\nBlizzard has announced that it is officially ending the development of new content for its MOBA Heroes of the Storm. However that doesn’t mean the game as a whole is coming to an end. Blizzard said its focus will become making sure the game continues to run smoothly with bug fixes, balance updates and more.\n\nSTAMPS\n00:00 - Intro\n00:11 - Apex Legends / Titanfall\n01:19 - The Last of Us Part 1 Remake\n02:27 - Heroes of the Storm", "link": "https://www.youtube.com/watch?v=lHWsOOwFkE4", "date_published": "2022-07-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]