{"entries": [{"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/18/anthony-davis-foot-injury-time-out-los-angeles-lakers", "title": "Lakers’ Anthony Davis to miss multiple weeks with foot injury, sources say", "date_published": "2022-12-18 23:44:19+00:00", "description": "<ul><li>Lakers star Davis set to miss several weeks with foot injury</li><li>Eight-time All-Star leads team in points and rebounds per game</li></ul><p>Anthony Davis of the Los Angeles Lakers has a right foot injury that’s expected to keep him sidelined for several weeks, according to a person with knowledge of the matter.</p><p>The severity of the injury was still being determined Sunday and that was keeping the team from forming a specific timetable for his return, said the person who spoke to the Associated Press on condition of anonymity because neither Davis nor the Lakers had released any information publicly.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/18/anthony-davis-foot-injury-time-out-los-angeles-lakers\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/18/nfl-week-15-round-up-game-reports", "title": "NFL round-up: Cowboys thwarted by Jaguars on Jenkins’ walk-off pick-six", "date_published": "2022-12-18 22:31:08+00:00", "description": "<ul><li>Jaguars intercept Prescott, stun Cowboys 40-34 in OT</li><li>McKinnon’s 26-yard run in OT lifts Chiefs over Texans 30-24</li><li>Hurts runs for 3 TDs as Eagles squeeze by Bears 25-20</li></ul><p>Rayshawn Jenkins intercepted Dak Prescott’s bobbled pass and returned it 52 yards for a touchdown that gave the Jacksonville Jaguars a 40-34 victory over the Dallas Cowboys in overtime Sunday.</p><p>Noah Brown failed to secure Prescott’s low throw, and Jenkins made a shoelace grab and went untouched the other way to end Jacksonville’s 20-game skid against NFC teams. It’s an NFL record.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/18/nfl-week-15-round-up-game-reports\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/politics/2022/dec/18/rishi-sunak-to-meet-uk-troops-in-estonia-and-attend-baltic-summit-russia", "title": "Rishi Sunak to meet UK troops in Estonia and attend Baltic summit", "date_published": "2022-12-18 22:30:01+00:00", "description": "<p>UK prime minister joins Nordic and Baltic leaders at summit on countering Russian aggression</p><ul><li><a href=\"https://www.theguardian.com/world/live/2022/dec/18/russia-ukraine-war-power-restored-to-6-million-ukrainians-after-strikes-says-zelenskiy-live\">Russia-Ukraine war – latest news updates</a></li></ul><p>Rishi Sunak will meet UK troops in Estonia and Nordic and Baltic leaders at a summit on <a href=\"https://www.theguardian.com/world/2022/dec/18/our-weapons-are-computers-ukrainian-coders-aim-to-gain-battlefield-edge\">countering Russian aggression</a>, where he will say leaders must sustain or exceed their lethal aid support to Ukraine and their political backing.</p><p>Monday’s meeting will come after the UK prime minister was reported to have unnerved some in Whitehall by asking for a “Goldman Sachs dashboard” on the progress of the war and how UK military supplies are used, <a href=\"https://www.bbc.co.uk/news/uk-politics-64006121\">according to the BBC</a>.</p> <a href=\"https://www.theguardian.com/politics/2022/dec/18/rishi-sunak-to-meet-uk-troops-in-estonia-and-attend-baltic-summit-russia\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/18/lionel-messi-wants-to-keep-playing-for-argentina-after-world-cup-win", "title": "Lionel Messi wants to keep playing for Argentina after World Cup win", "date_published": "2022-12-18 22:23:43+00:00", "description": "<ul><li>Messi led side to shootout victory over France after epic final</li><li>‘I want to enjoy a couple more matches being world champion’</li></ul><p>Lionel Messi will not retire immediately from international football after finally capping an extraordinary career with Argentina’s first World Cup since 1986, preferring to soak up the glory for at least a while longer.</p><p>On a dizzying night in Lusail it seemed more than once that Messi could be denied the fulfilment of a lifelong dream at the fifth attempt. But he added to his two goals and virtuoso all-round performance in regulation time with a penalty during a successful shootout against France and afterwards confirmed his 172nd cap was not his last.</p> <a href=\"https://www.theguardian.com/football/2022/dec/18/lionel-messi-wants-to-keep-playing-for-argentina-after-world-cup-win\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/audio/2022/dec/18/the-greatest-world-cup-final-ever-football-daily", "title": "The greatest World Cup final ever? - Football Daily", "date_published": "2022-12-18 22:10:06+00:00", "description": "<p><a href=\"https://twitter.com/maxrushden\">Max Rushden</a> is joined by <a href=\"https://twitter.com/bglendenning\">Barry Glendenning</a>, <a href=\"https://twitter.com/larssivertsen\">Lars Sivertsen</a>, <a href=\"https://twitter.com/PhilippeAuclair\">Philippe Auclair</a> and <a href=\"https://twitter.com/barneyronay\">Barney Ronay</a> as Argentina lift the 2022 World Cup</p><p><strong>Rate, review, share on <a href=\"https://itunes.apple.com/podcast/football-weekly-the-guardian/id188674007?mt=2\">Apple Podcasts</a>, <a href=\"https://soundcloud.com/guardianfootballweekly\">Soundcloud</a>, <a href=\"https://audioboom.com/channel/football-weekly\">Audioboom</a>, <a href=\"https://www.mixcloud.com/guardianfootballweekly/\">Mixcloud</a>, <a href=\"https://www.acast.com/footballweekly\">Acast</a> and <a href=\"http://www.stitcher.com/podcast/guardianuk/football-weekly\">Stitcher</a>, and join the conversation on <a href=\"https://www.facebook.com/GuardianPodcasts/\">Facebook</a>, <a href=\"https://twitter.com/guardianaudio\">Twitter</a> and <a href=\"mailto:footballweekly@theguardian.com\">email</a>.</strong></p><p>Today; it looked like a somewhat anticlimatic match, Argentina appeared to be winning it comfortably but it came alive after 80 minutes – the panel ask, did we just watch the greatest World Cup final ever?</p> <a href=\"https://www.theguardian.com/football/audio/2022/dec/18/the-greatest-world-cup-final-ever-football-daily\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/18/mixed-reaction-as-lionel-messi-draped-in-arab-cloak-before-lifting-world-cup", "title": "Mixed reaction as Lionel Messi draped in Arab cloak before lifting World Cup", "date_published": "2022-12-18 21:30:16+00:00", "description": "<ul><li>Qatar’s emir places black bisht on Argentina’s captain </li><li>Praise on social media in region but criticism in west</li></ul><p>It was the big payback moment for Qatar’s $220bn investment: images of Lionel Messi being draped in a black bisht – a traditional men’s cloak in the Arab world – by the emir of Qatar, Sheikh Tamim bin Hamad al-Thani, as Argentina’s captain prepared to lift the trophy. </p><p>The bisht covered part of Messi’s Argentina shirt, including the national badge, during the ceremony – ensuring that iconic images of the trophy lift will remain a reminder of whose World Cup this was. Fifa’s president, Gianni Infantino, watched on smiling as the garment was put in place.</p> <a href=\"https://www.theguardian.com/football/2022/dec/18/mixed-reaction-as-lionel-messi-draped-in-arab-cloak-before-lifting-world-cup\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/blog/2022/dec/18/lionel-messi-authors-dramatic-ending-to-the-greatest-story", "title": "Messi emulates Maradona in fairytale ending to a  story like no other | Sid Lowe", "date_published": "2022-12-18 21:28:57+00:00", "description": "<p>Argentina’s maestro followed his hero in leading his country to the World Cup and completed his collection of titles</p><p>Lionel Messi completed football here, the greatest story ever told. The 26th and last match of his World Cup journey was <a href=\"https://www.theguardian.com/football/2022/dec/18/world-cup-final-argentina-france-match-report\">the final to end all finals</a>, a moment that’s never been equalled before and probably never will be again. So wild that none of it made any sense until he was standing there waving to the stands smiling, and then it all did. It was hard to comprehend what he and they had gone through – an entire career, the most accomplished of all, packed into one absurd evening – but there was closure at last.</p><p>It was done. The world had the ending it wanted – Didier Deschamps had said that even some of the French were on Messi’s side – just don’t ask how. Eventually, from somewhere up there, Messi’s mum found her way down to embrace the boy who left home, Argentina, at 13 and the man who had now taken them – or had they taken him? – to the title the most devotional of football fans desperately wanted. Together, they cried. Everyone did. Ángel Di María had spent the evening torn and in tears.</p> <a href=\"https://www.theguardian.com/football/blog/2022/dec/18/lionel-messi-authors-dramatic-ending-to-the-greatest-story\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/18/didier-deschamps-claims-illness-affected-france-in-world-cup-final", "title": "Didier Deschamps claims illness affected France in World Cup final", "date_published": "2022-12-18 21:14:46+00:00", "description": "<ul><li>Head coach refuses to discuss future after defeat by Argentina</li><li>‘We have faced a tricky situation, there was some tiredness’</li></ul><p>Didier Deschamps suggested France had felt the “physical or psychological impact” of an illness-affected run-up to their extraordinary World Cup final defeat against Argentina, although he stopped short of saying it contributed to the outcome.</p><p>France were overrun until two goals in 97 seconds from Kylian Mbappé turned a procession for their opponents into a wild, see-sawing affair that went the distance. A <a href=\"https://www.theguardian.com/football/2022/dec/16/varane-konate-and-coman-train-apart-virus-france-world-cup-final\">virus had stretched an already depleted squad</a>, with three players missing the semi-final against Morocco and at least two others affected in the subsequent days. All involved were passed fit for the match on Sunday but Deschamps highlighted a flatness that noticeably dogged his team for much of the game.</p> <a href=\"https://www.theguardian.com/football/2022/dec/18/didier-deschamps-claims-illness-affected-france-in-world-cup-final\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/18/harlequins-racing-92-champions-cup-rugby-union-match-report", "title": "Esterhuizen try secures narrow victory for Harlequins as Racing disappoint", "date_published": "2022-12-18 20:47:30+00:00", "description": "<ul><li>Pool A: Harlequins 14-10 Racing 92</li><li>Head and Esterhuizen score tries for Harlequins</li></ul><p>You might expect a feast of attacking rugby when two of Europe’s great entertainers lock horns but this was a famine – played out in a flood.</p><p>Harlequins will not care, for this was a gritty victory, delivered by André Esterhuizen’s second-half try and founded on defensive resilience, against a thoroughly disappointing Racing 92 side. Equally, however, it was the sort of evening that makes you long for spring.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/18/harlequins-racing-92-champions-cup-rugby-union-match-report\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/technology/2022/dec/18/twitter-to-remove-accounts-promoting-other-social-platforms", "title": "Twitter to remove accounts promoting other social platforms", "date_published": "2022-12-18 20:32:43+00:00", "description": "<p>Move will affect content from Facebook, Instagram, Mastodon, Truth Social, Tribel, Nostr and Post</p><p>Twitter has announced that it will remove accounts created solely for the purpose of promoting other social platforms and content that contains links to them or usernames featured on them.</p><p>The platform said the move would affect content from numerous social media websites, including Meta Platforms’ Facebook and Instagram, Mastodon, Truth Social, Tribel, Nostr and Post, but would allow cross-content posting.</p> <a href=\"https://www.theguardian.com/technology/2022/dec/18/twitter-to-remove-accounts-promoting-other-social-platforms\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/18/monkeys-imported-us-from-cambodia-carried-deadly-pathogens", "title": "US public not warned that monkeys imported from Cambodia carried deadly pathogens", "date_published": "2022-12-18 20:27:03+00:00", "description": "<p>Documents reveal that pathogenic agents, zoonotic bacteria and viruses, including one deemed bioterrorism risk, entered US but ‘no indication CDC has been transparent’</p><p>Animal activists are calling for the US government to stop the importation of non-human primates for laboratory use after documents from the American Centers for Disease Control and Prevention (CDC) reveal that deadly pathogenic agents, zoonotic bacteria and viruses – including one deemed to be a bioterrorism risk – entered the country with monkeys imported from Asia between 2018 and 2021.</p><p>Documents obtained by People for the Ethical Treatment of Animals (Peta) and seen exclusively by the Guardian, along with a case report by the American Association for Laboratory Animal Science, reveal that there have been six cases of Burkholderia pseudomallei identified in primates imported from Cambodia to the US.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/18/monkeys-imported-us-from-cambodia-carried-deadly-pathogens\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/blog/2022/dec/18/kylian-mbappe-leads-french-frenzy-after-didier-deschamps-rolls-the-dice", "title": "Kylian Mbappé leads French frenzy after Didier Deschamps rolls the dice | Jacob Steinberg", "date_published": "2022-12-18 20:09:53+00:00", "description": "<p>Striker exploded into life to drag his side back into the contest – but the madcap game was proof that France’s plan had failed</p><p>It was never part of the plan for Didier Deschamps to unveil a gambler’s instinct. France’s manager reads from a pragmatic playbook. When he was putting the finishing touches to his tactical preparations for this contest, Deschamps never could have imagined that Kylian Mbappé would have been standing over a penalty with two minutes of extra-time remaining, readying himself to rescue France for a second time and become the first player to score a hat-trick in a men’s World Cup final since Sir Geoff Hurst in 1966.</p><p>Everything had spiralled out of control, Argentina’s emotion trumping French cool. Caution? Organisation? Waiting for moments to strike on the break? Forget it. Lionel Messi had given Argentina a 3-2 lead and France needed something extraordinary.</p> <a href=\"https://www.theguardian.com/football/blog/2022/dec/18/kylian-mbappe-leads-french-frenzy-after-didier-deschamps-rolls-the-dice\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/18/qatar-2022-dishes-up-sporting-surprise-and-a-coronation-for-lionel-messi", "title": "Qatar 2022 dishes up sporting surprise and a coronation for Lionel Messi | Barney Ronay", "date_published": "2022-12-18 20:07:00+00:00", "description": "<p>Messi’s sublime brilliance elevated divisive World Cup into one of the great sports stories as France lost on penalties</p><p>After 12 years, shredded schedules and a whirl of geopolitics; after death and ghosts and suffering; after armbands, hard power, the Davos in the desert vibe; after 64 games of the Qatar 2022 World Cup, the Lusail Stadium dished up a purely sporting surprise.</p><p>This was the greatest Fifa World Cup final. It was also a third World Cup victory for Argentina, who beat France on penalties at the end of a wildly oscillating 3-3 draw.</p> <a href=\"https://www.theguardian.com/football/2022/dec/18/qatar-2022-dishes-up-sporting-surprise-and-a-coronation-for-lionel-messi\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/18/like-paradise-argentina-erupts-in-celebration-of-world-cup-win", "title": "‘Like paradise’: Argentina erupts in celebration of World Cup win", "date_published": "2022-12-18 20:03:32+00:00", "description": "<p>Streets of central Buenos Aires are a cacophony of yelling and horns after shootout victory against France </p><ul><li><a href=\"https://www.theguardian.com/world/2022/dec/18/cant-begrudge-messi-parisians-react-france-lose-world-cup-final\">Paris reaction: ‘You can’t begrudge Messi’</a></li><li><a href=\"https://www.theguardian.com/football/2022/dec/18/world-cup-final-argentina-france-match-report\">Match report: how Argentina won it</a></li></ul><p>If there’s one thing Argentina fans have learned in this World Cup, it’s that you can’t rest on your laurels when you’re 2-0 up. But after a dramatic penalty shootout, there was delight in Buenos Aires that Argentina will be bringing home football’s most coveted trophy.</p><p>In La Puerta Roja, a bar in the downtown San Telmo district, so many people packed in early to watch the final that there was a queue outside an hour and a half before kickoff. The air smelled of adrenaline and the commentators could barely be heard over the din of yelling, hands banging on tables, and the occasional glass smashing.</p> <a href=\"https://www.theguardian.com/world/2022/dec/18/like-paradise-argentina-erupts-in-celebration-of-world-cup-win\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/18/cop15-negotiators-close-to-agreeing-nature-deal-as-talks-draw-to-end", "title": "Cop15 negotiators close to agreeing nature deal as talks draw to end", "date_published": "2022-12-18 19:35:14+00:00", "description": "<p>Final agreement could bring better protection for vital ecosystems and big reforms to agriculture </p><p>A potentially <a href=\"https://www.cbd.int/doc/c/7a5e/1d9a/f8718d1a5dd9828dba764053/cop-15-item9a-nonpaper-president-en.pdf\">transformational agreement for nature is close</a> to being reached at Cop15 in Montreal, which could bring better protection for Earth’s vital ecosystems such as the Amazon and Congo basin rainforests, big reforms to agriculture and better protection of indigenous territories and rights.</p><p>After four years of negotiations and 12 years since the last biodiversity targets were agreed in Japan, the Chinese president of Cop15 put forward its recommendations for a final agreement after two weeks of intense negotiations at the UN biodiversity summit in Canada.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/18/cop15-negotiators-close-to-agreeing-nature-deal-as-talks-draw-to-end\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/18/us-anti-abortion-priest-frank-pavone-defrocked-by-vatican", "title": "Anti-abortion US priest Frank Pavone defrocked by Vatican", "date_published": "2022-12-18 19:14:56+00:00", "description": "<p>Pavone had been investigated for placing an aborted foetus on an altar and posting a video of it online</p><p>The Vatican has defrocked the anti-abortion US priest Frank Pavone for what it said were “blasphemous communications on social media” as well as “persistent disobedience” of his bishop.</p><p>A letter to US bishops from the Vatican ambassador to the US, Archbishop Christophe Pierre, said the decision against Pavone, who heads the anti-abortion group Priests for Life, had been taken and that there was no chance for an appeal.</p> <a href=\"https://www.theguardian.com/world/2022/dec/18/us-anti-abortion-priest-frank-pavone-defrocked-by-vatican\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/gallery/2022/dec/18/world-cup-final-2022-argentina-win-thriller-against-france-in-pictures", "title": "World Cup final 2022: Argentina win thriller against France – in pictures", "date_published": "2022-12-18 19:06:46+00:00", "description": "<p>The best images from an utterly incredible match in Qatar as Lionel Messi finally won the biggest prize in football</p> <a href=\"https://www.theguardian.com/football/gallery/2022/dec/18/world-cup-final-2022-argentina-win-thriller-against-france-in-pictures\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/business/2022/dec/18/workers-in-thailand-who-made-ff-jeans-for-tesco-trapped-in-effective-forced-labour", "title": "Workers in Thailand who made F&F jeans for Tesco ‘trapped in effective forced labour’", "date_published": "2022-12-18 19:00:01+00:00", "description": "<p>Exclusive: Supermarket faces landmark lawsuit in the UK from 130 former workers alleging negligence</p><ul><li><a href=\"https://www.theguardian.com/world/2022/dec/18/workers-tell-of-sweatshop-conditions-at-thai-factory-used-by-tesco\">Workers tell of sweatshop conditions at Thai factory used by Tesco</a></li></ul><p>Burmese workers that produced F+F jeans for Tesco in Thailand report being trapped in effective forced labour, working 99-hour weeks for illegally low pay in appalling conditions, a Guardian investigation has found.</p><p>Tesco faces a landmark lawsuit in the UK from 130 former workers at VK Garment Factory (VKG), who are suing them for alleged negligence and unjust enrichment. The workers made jeans, denim jackets and other F&amp;F clothes for adults and children for the Thai branch of Tesco’s business between 2017 and 2020.</p><p>Being paid as little as £3 a day to work from 8am to 11pm with just one day off a month.</p><p>Detailed records kept by supervisors seen by the Guardian show the majority of workers on their lines were paid less than £4 a day and only according to how much they could make. The Thai minimum wage then was £7 for an 8-hour day.</p><p>Having to work through the night for 24 hours at least once a month to fulfil large F&amp;F orders, and becoming so exhausted they fell asleep at their sewing tables.</p><p>Some reported serious injuries; one man described slicing open his arm carrying a dangerously heavy interlocker machine, requiring 13 stitches. Another said he lost the tip of his index finger after slicing it in a button machine while making F&amp;F denim jackets.</p><p>Many said they were shouted at and threatened by managers within the factory if they did not keep working overtime and meet targets.</p><p>More than a dozen of the workers interviewed said the factory opened bank accounts for them and then confiscated the cards and passwords so they could make it appear they were paid minimum wage while paying much less in cash.</p><p>Most workers relied on VKG for their immigration status and some said their immigration documents were held by the factory, leaving them in debt bondage. </p><p>Factory accommodation within the compound consisted of overcrowded rooms with concrete floors to sleep on and dirty pond water in a bucket to wash. Workers say most rooms had no door, just a curtain.</p> <a href=\"https://www.theguardian.com/business/2022/dec/18/workers-in-thailand-who-made-ff-jeans-for-tesco-trapped-in-effective-forced-labour\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/18/argentina-3-3-france-world-cup-final-player-ratings", "title": "Argentina 3-3 France (aet, 4-2 on pens): World Cup final player ratings | Nick Ames", "date_published": "2022-12-18 18:59:40+00:00", "description": "<p>Kylian Mbappé mesmerised, Emi Martínez was magnificent, but it was Lionel Messi’s magic that will go down in history</p><p><strong>Emiliano Mart</strong><strong>ínez (GK)</strong> Huge late saves at end of normal and extra time, then the biggest from Coman. Booked. <strong>9</strong></p> <a href=\"https://www.theguardian.com/football/2022/dec/18/argentina-3-3-france-world-cup-final-player-ratings\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/18/joe-manchin-democratic-party-doesnt-intend-to-leave-party", "title": "Joe Manchin says he doesn’t intend to leave Democratic party for now", "date_published": "2022-12-18 18:40:24+00:00", "description": "<p>Remarks comes after fellow centrist Kyrsten Sinema announced she was leaving party and becoming an independent</p><p>The centrist Democratic senator <a href=\"https://www.theguardian.com/us-news/joe-manchin\">Joe Manchin</a> does not intend to change his party affiliation – at least for now, he said Sunday.</p><p>Manchin’s remarks on CBS’s Face the Nation came after fellow centrist senator Kyrsten Sinema sent shock waves through Congress by announcing that she was leaving the Democratic party and listing herself as an independent.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/18/joe-manchin-democratic-party-doesnt-intend-to-leave-party\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/media/2022/dec/18/jeremy-clarkson-condemned-meghan-column-the-sun", "title": "Jeremy Clarkson condemned over Meghan column in the Sun", "date_published": "2022-12-18 18:03:02+00:00", "description": "<p>Outcry after presenter writes he is ‘dreaming of the day when she is made to parade naked through the streets’</p><p>A Jeremy Clarkson column in the Sun about the Duchess of Sussex has provoked outcry online, with social media users labelling it “vile”, “horrific” and “abusive”.</p><p>In an article for the paper published on Friday, Clarkson wrote that he loathed Meghan “on a cellular level”. He said he was “dreaming of the day when she is made to parade naked through the streets of every town in Britain while the crowds chant, ‘Shame!’ and throw lumps of excrement at her”.</p> <a href=\"https://www.theguardian.com/media/2022/dec/18/jeremy-clarkson-condemned-meghan-column-the-sun\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/18/world-cup-final-argentina-france-match-report", "title": "Argentina beat France on penalties to win World Cup after stunning final", "date_published": "2022-12-18 17:56:39+00:00", "description": "<p>It was a consecration, the spiritual overtones entirely appropriate. Lionel Messi not only emulated the deity of Argentinian football, Diego Maradona, by leading the nation to World Cup glory, he finally plugged the burning gap on his CV, winning the one trophy that has eluded him – at the fifth time of asking, surely the last time. In the process, he gilded his claim to being recognised as the greatest player of all time.</p><p>When it was over – after the most outlandish of Kylian Mbappé‑inspired France comebacks, the defending champions punching back from the brink not once but twice – when Gonzalo Montiel had dispatched the winning penalty, Messi sank to his knees in the centre circle, engulfed by his teammates.</p> <a href=\"https://www.theguardian.com/football/2022/dec/18/world-cup-final-argentina-france-match-report\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/tv-and-radio/2022/dec/18/hamza-yassin-touted-as-possible-successor-to-david-attenborough", "title": "Hamza Yassin: Strictly winner being touted as next David Attenborough", "date_published": "2022-12-18 17:18:38+00:00", "description": "<p>Wildlife TV presenter tipped for success after capturing country’s heart on path to Strictly victory</p><p>He may have come from relative obscurity but 2023 is predicted to be a big year for the Strictly Come Dancing champion <a href=\"https://www.theguardian.com/tv-and-radio/2022/nov/10/id-rather-face-a-polar-bear-than-step-on-the-dancefloor-strictlys-hamza-yassin-on-salsa-scotland-and-singledom\">Hamza Yassin</a>, who <a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/17/hamza-yassin-wins-strictly-come-dancing-with-partner-jowita-przysta\">lifted the glitterball trophy with his dance partner Jowita Przystał</a> on Saturday night.</p><p>He pipped fellow finalists Helen Skelton, Fleur East and Molly Rainford to the title in a tense final and insiders are now predicting big things for the wildlife expert, who said he was “over the moon” to win.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/18/hamza-yassin-touted-as-possible-successor-to-david-attenborough\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/18/january-6-panel-schiff-evidence-criminally-charge-trump-efforts-overturn-2020-election", "title": "Schiff: ‘Sufficient evidence’ to criminally charge Trump over efforts to overturn election", "date_published": "2022-12-18 17:08:02+00:00", "description": "<p>Dramatic statement comes one day before January 6 panel set to release outline of its investigative report on US Capitol attack</p><p>California congressman Adam Schiff said Sunday that he believes there is “sufficient evidence” to criminally charge <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> in relation to his efforts to overturn the 2020 election.</p><p>Schiff’s dramatic statement on CNN’s State of the Union came one day before the House January 6 select committee to which he belongs is <a href=\"https://www.theguardian.com/us-news/2022/dec/18/january-6-committee-last-meeting-donald-trump\">poised to release</a> an outline of its extensive investigative report on the US Capitol attack, which has been linked to nine deaths, including the suicides of traumatized law enforcement officers.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/18/january-6-panel-schiff-evidence-criminally-charge-trump-efforts-overturn-2020-election\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/games/2022/dec/18/simon-parkin-top-5-five-best-games-2022", "title": "Games: Simon Parkin’s five best of 2022", "date_published": "2022-12-18 17:00:54+00:00", "description": "<p>From Sherlockian murder mystery to Hollywood missing person via the mystical Lands Between, it’s been a gripping year</p><ul><li><a href=\"https://www.theguardian.com/culture/series/observer-critics--review-of-2022\">Read the Observer critics’ review of 2022 in full</a></li></ul><p>1. <strong><a href=\"https://www.theguardian.com/games/2022/feb/23/elden-ring-review-an-unrivalled-masterpiece-of-design-and-inventiveness\">Elden Ring</a><br />FromSoftware/Bandai Namco<br /></strong>Hidetaka Miyazaki’s <a href=\"https://en.bandainamcoent.eu/elden-ring/elden-ring\">expansive fantasy game</a>, conceived in collaboration with <em>Game of Thrones</em> author George RR Martin, brings to fruition the themes and ideas explored in his previous games in the <em>Dark Souls</em> series. Mystical, challenging and often intimidatingly open-ended, this is a sumptuous world that rewards curiosity, inspires resilience and promotes collaboration with strangers.</p><p>2. <strong><a href=\"https://www.theguardian.com/games/2022/sep/10/immortality-review-sam-barlow-half-mermaid-fmv-her-story-an-irresistible-plunge-into-a-hollywood-mystery\">Immortality</a><br />Sam Barlow; Half Mermaid</strong><br />An intoxicating blend of film and game, <em><a href=\"https://halfmermaid.co/\">Immortality</a></em> tells its complex, decades-spanning story via a series of disparate but interconnected clips snipped from three unreleased Hollywood films. The movies share a lead, an apparently ageless actor whose identity and fate you must uncover. Best played with a notepad and pen, you assume the role of a cinematic gumshoe in an editing suite. Groundbreaking work.</p> <a href=\"https://www.theguardian.com/games/2022/dec/18/simon-parkin-top-5-five-best-games-2022\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/18/mikaela-shiffrin-st-moritz-super-g-record-chase", "title": "Shiffrin bags 77th career World Cup win at St Moritz to inch toward Vonn record", "date_published": "2022-12-18 16:52:17+00:00", "description": "<ul><li>Shiffrin takes 77th win to move within five of Vonn’s mark</li><li>Italy’s Curtoni and France’s Miradoli fill out rest of podium</li></ul><p>Mikaela Shiffrin’s first speed race weekend of the women’s World Cup season went so well, she believes it might make her even faster in her core technical events, too.</p><p>The four-time overall champion won a super-G Sunday to top off her weekend with career win No 77.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/18/mikaela-shiffrin-st-moritz-super-g-record-chase\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/18/us-major-winter-storm-expected-christmas", "title": "Major winter storm expected to hit much of US before Christmas", "date_published": "2022-12-18 16:30:42+00:00", "description": "<p>Heavy snow, powerful winds, and bitterly cold temperatures will potentially snarl holiday travel</p><p>A <a href=\"https://www.theguardian.com/us-news/us-weather\">massive winter storm</a> system is expected to strike much of the US days before Christmas, potentially snarling holiday travel as motorists and air travelers contend with <a href=\"https://www.theguardian.com/us-news/2022/nov/12/weather-tracker-unusual-cold-and-snow-spreading-across-north-america\">heavy snow</a>, powerful winds, and bitterly cold temperatures across several regions.</p><p>This sprawling storm system coincides with the arrival of an Arctic air mass that will consume much of the country “this upcoming week”, <a href=\"https://twitter.com/NWS?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\">according to the National Weather Service</a>. Between Tuesday and Saturday, temperature highs are expected to average from 10 to 35F below normal from the north-west to the eastern two-thirds of the US.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/18/us-major-winter-storm-expected-christmas\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/society/2022/dec/18/film-maker-revisits-her-homeless-past-to-show-plight-of-rough-sleepers", "title": "Film-maker revisits her homeless past to show rough sleepers’ plight", "date_published": "2022-12-18 16:17:57+00:00", "description": "<p>Lorna Tucker says not enough is being done to help Britain’s homeless people, and what is being done is not working</p><p>The film-maker Lorna Tucker was once a teenage runaway, sleeping rough in London for 18 months. Twenty-five years later, she has relived the harrowing experience for a documentary, returning to her former haunts and speaking to homeless people at a time when record numbers are living on Britain’s streets.</p><p>She was reunited with some of those she left behind, including “Darren”, who has been on the streets since his alcoholic mother was unable to care for him. “Darren sleeps where I used to sleep under Waterloo Bridge,” she said. “He still has the same eyes he had as a 15-year-old boy. He’s still got this beauty, but obviously he’s been very affected by it.”</p> <a href=\"https://www.theguardian.com/society/2022/dec/18/film-maker-revisits-her-homeless-past-to-show-plight-of-rough-sleepers\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/18/growing-up-in-a-different-culture-doesnt-mean-you-cant-love-christmas-too", "title": "Growing up in a different culture doesn’t mean you can’t love Christmas too", "date_published": "2022-12-18 16:00:53+00:00", "description": "<p>Family traditions are what you make them, Christmas means honouring the people dearest to you</p><p>It’s Christmas Eve. The tree lights are off, pine needles dropping on to presents crammed beneath. Cold air seeps in through the window panes and I pull the duvet up tighter around my ears. As I begin to drift off to sleep, I hear the soft click of the door handle, footsteps padding into the room. I freeze, hold my breath, squeeze my eyes shut. A rustle at the end of the bed and then the footsteps retreat. The next morning, I wake to find a stocking – well, not quite a stocking, it’s a pillow case – stuffed with treats. Among the little gifts is a bag of chocolate coins that I tear into, discarding gold and silver foil as I go. This was my first stocking. I was 19 years old.</p><p>It was my mother-in-law who thought to creep into the room of a young adult on that first Christmas which I spent with my now husband and his family. Her name is Snezana, which means Snow White in Serbian. Her parents emigrated to the UK before she was born. She was there when my husband and I met at university two decades ago and still tells the story of how she saw a spark between us and was convinced that I would be her son’s wife. For her, Christmas represents honouring those you love, and it was important to her to knit me into the tapestry of her family as she sees each new family member as a gift. It is unsurprising, then, that she takes great joy in making this time of year as magical as possible.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/18/growing-up-in-a-different-culture-doesnt-mean-you-cant-love-christmas-too\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/politics/2022/dec/18/i-am-very-scared-refugees-await-judgment-on-uks-rwanda-policy", "title": "‘I am very scared’: refugees await judgment on UK’s Rwanda policy", "date_published": "2022-12-18 15:42:13+00:00", "description": "<p>Law courts will deliver their verdict on Monday on whether plans to export asylum seekers are lawful</p><p>It has been more than three months since two of the UK’s most senior judges sifted through thousands of pages of evidence and heard opposing arguments from some of the country’s lawyers about whether or not the government’s controversial plans to send asylum seekers to Rwanda are lawful. On Monday at 10.30am, at the Royal Courts of Justice, they will deliver their judgment.</p><p>The government’s plan to export asylum seekers from one of the world’s richest countries to one of the world’s poorer nations, 4,000 miles away, is so radical that no other country has attempted anything like it.</p> <a href=\"https://www.theguardian.com/politics/2022/dec/18/i-am-very-scared-refugees-await-judgment-on-uks-rwanda-policy\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/18/kyiv-mayor-says-heating-restored-in-capital-after-latest-russian-strikes", "title": "Kyiv mayor says heating restored in capital after latest Russian strikes", "date_published": "2022-12-18 14:39:38+00:00", "description": "<p>Moscow unveils plans to deploy musicians to  frontline in bid to boost morale among Russian troops</p><ul><li><a href=\"https://www.theguardian.com/world/live/2022/dec/18/russia-ukraine-war-power-restored-to-6-million-ukrainians-after-strikes-says-zelenskiy-live\">Russia-Ukraine war – latest news updates</a></li></ul><p>Heating has been fully restored to Kyiv after the latest Russian bombardment, the city’s mayor has said, as Moscow unveiled plans to deploy musicians to the frontline in Ukraine in a drive to boost morale among its troops.</p><p>Vitali Klitschko said on Sunday morning the capital was successfully “restoring all services after the latest shelling” and that “in particular, the capital’s heating supply system is fully restored. All sources of heat supply work normally.”</p> <a href=\"https://www.theguardian.com/world/2022/dec/18/kyiv-mayor-says-heating-restored-in-capital-after-latest-russian-strikes\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/18/our-weapons-are-computers-ukrainian-coders-aim-to-gain-battlefield-edge", "title": "‘Our weapons are computers’: Ukrainian coders aim to gain battlefield edge", "date_published": "2022-12-18 14:11:20+00:00", "description": "<p>Delta software developed to help collect and disseminate information about enemy’s movements</p><ul><li><a href=\"https://www.theguardian.com/world/series/ukraine-live/latest\">Russia-Ukraine war – latest updates</a></li></ul><p>In a nondescript office building on the outskirts of Zaporizhzhia, Ukrainian soldiers have been honing what they believed will be a decisive weapon in their effort to roll back the Russian invasion.</p><p>Inside, the weapon glows from a dozen computer screens – a constantly updated portrayal of the evolving battlefield to the south. With one click on a menu, the map is populated with hordes of orange diamonds, showing Russian deployments. They reveal where tanks and artillery have been hidden, and intimate details of the units and the soldiers in them, gleaned from social media. Choosing another option from the menu lights up red arrows across the southern Zaporizhzhia region, showing the progression of Russian columns. Zooming in shows satellite imagery of the terrain in sharp detail.</p> <a href=\"https://www.theguardian.com/world/2022/dec/18/our-weapons-are-computers-ukrainian-coders-aim-to-gain-battlefield-edge\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/news/gallery/2022/dec/18/a-christmas-swim-tintoretto-and-a-charity-santa-run-the-weekends-best-photos", "title": "A Christmas swim, Tintoretto and a charity Santa run – the weekend’s best photos", "date_published": "2022-12-18 14:03:31+00:00", "description": "<p>The Guardian’s picture editors select photo highlights from around the world</p> <a href=\"https://www.theguardian.com/news/gallery/2022/dec/18/a-christmas-swim-tintoretto-and-a-charity-santa-run-the-weekends-best-photos\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/19/a-day-at-the-beach-ive-had-many-crocodile-encounters-over-the-years-but-none-as-close", "title": "A day at the beach: ‘I’ve had many crocodile encounters over the years but none as close’", "date_published": "2022-12-18 14:00:52+00:00", "description": "<p>Visiting a billabong for a Sunday afternoon fishing session, Northern Territory MLA Bill Yan found himself stranded up a tree with a giant reptile glaring at him</p><ul><li><a href=\"https://www.theguardian.com/newsletters/2019/oct/18/saved-for-later-sign-up-for-guardian-australias-culture-and-lifestyle-email?CMP=cvau_sfl\">Get our weekend culture and lifestyle email</a></li></ul><p>I grew up on the river flats around Wangaratta in Victoria, where I fished almost daily. It was a stark contrast when I moved to Alice Springs in 1990, at 21. There’s not a lot of fishing here, so any opportunity I get to fish, I grab it. I keep a fishing rod in my Darwin office for such occasions.</p><p>I’ve marshalled at the Barra Classic on the Daly River for the last nine years. I’ve had many crocodile encounters over the years, but none as close as on Sunday 9 October 2022.</p><p><strong><a href=\"https://www.theguardian.com/newsletters/2019/oct/18/saved-for-later-sign-up-for-guardian-australias-culture-and-lifestyle-email?CMP=copyembed\">Sign up for the fun stuff with our rundown of must-reads, pop culture and tips for the weekend, every Saturday morning</a></strong></p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/19/a-day-at-the-beach-ive-had-many-crocodile-encounters-over-the-years-but-none-as-close\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/19/menopause-shouldnt-be-a-secret-or-mystery-and-you-shouldnt-have-to-put-up-with-it-in-silence", "title": "Menopause shouldn’t be a secret or mystery, and you shouldn’t have to put up with it in silence | Svetlana Stankovic", "date_published": "2022-12-18 14:00:52+00:00", "description": "<p>This week we publish stories on how to live better with menopause, the impact it has on Australia’s labour market, alongside some personal experiences</p><p>When I was in my early teens, my mother went through stages of being uncharacteristically angry and sometimes tearful for no apparent reason after a lifetime of being pretty mild-mannered and cheerful. She would walk around fanning her face, complaining about how <em>hot</em> and <em>stuffy</em> it was. It was the middle of winter and we lived in the Black Forest in Germany. I put it down to just one more weird thing parents did and never thought to ask her what was going on.</p><p>I forgot all about this over the years as I had children myself. I stopped menstruating after getting ​​an IUD in my early 40s and felt the liberation that comes with one less item of body maintenance.</p><p>We have pain on a cycle for years and years and years, and then just when you feel you are making peace with it all, what happens? The menopause comes. The fucking menopause comes and it is the most … wonderful fucking thing in the world. Yes, your entire pelvic floor crumbles and you get fucking hot and no one cares, but then you’re free. No longer a slave, no longer a machine with parts. You’re just a person. In business.”</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/19/menopause-shouldnt-be-a-secret-or-mystery-and-you-shouldnt-have-to-put-up-with-it-in-silence\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/18/love-football-watching-my-job-world-cup-boycott", "title": "I love football so much that watching it is my job - was my World Cup boycott worth it? | Anonymous", "date_published": "2022-12-18 14:00:51+00:00", "description": "<p>I missed great games and endured awkward conversations about my decision, but I’m proud I stood by my principles </p><p>When I was growing up, the World Cup always felt like the pinnacle of football. The sticker albums, the wallcharts, the opportunities to relive the greatest moments while having a kickabout with friends. Trying to replicate Ray Houghton’s lofted strike against Italy in 1994; Dennis Bergkamp’s ridiculous pull down and volley against Argentina in 98; or, for when you really didn’t want to be in goal, David Seaman’s desperate backwards flailing against Brazil in 2002.</p><p>While I wasn’t a bad player, the dawning realisation that I’d never get close to doing it professionally didn’t diminish my enthusiasm as a fan, or my interest in finding a career related to football. At university, I sat in the press box at Lincoln City covering matches, and eventually found myself working on one of the longest-running and most successful football video games – one I’d played religiously from my early teens.</p><p>The author is a football fan living in the south of England</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/18/love-football-watching-my-job-world-cup-boycott\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/18/readers-reply-would-airport-security-be-less-efficient-if-the-people-passing-through-were-treated-politely", "title": "Readers reply: would airport security be less efficient if the people passing through were treated politely?", "date_published": "2022-12-18 14:00:51+00:00", "description": "<p>The long-running series in which readers answer other readers’ questions on subjects ranging from trivial flights of fancy to profound scientific and philosophical concepts</p><p>Would airport security be less efficient if people passing through security were treated politely – eg, an occasional “please” or “thank you” instead of barked orders and incivility, or even hostility. I can’t think of any other aspect of public life where law-abiding, paying citizens are treated with such rudeness and disrespect – just because they’re taking a plane. <strong>Stella O’Shea</strong></p><p><em>Send new questions to </em><strong><a href=\"mailto:nq@theguardian.com\">nq@theguardian.com</a></strong><em>. Notes and queries returns in the new year.</em></p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/18/readers-reply-would-airport-security-be-less-efficient-if-the-people-passing-through-were-treated-politely\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/18/radical-community-groups-austerity-hope", "title": "This dire winter feels like wartime. But hope lies with communities helping themselves | John Harris", "date_published": "2022-12-18 13:53:58+00:00", "description": "<p>From radical local energy projects to transport to volunteer libraries, incredible people are taking action into their own hands</p><p>I am standing on a muddy patch of land nudging the Severn Estuary, in the company of an inspirational community activist called Mark Pepper. We are here to look at building work on what will soon be not only the <a href=\"https://www.theguardian.com/environment/2022/apr/16/bristol-community-secures-funding-to-build-tallest-wind-turbine-in-england\">tallest wind turbine in England</a>, but a crucial source of help for people at the financial sharp end. Thanks to a deal with a renewable energy company, the electricity the turbine produces will be sold to the National Grid, generating funds that will be used to subsidise the bills of vulnerable people who live a five-minute drive away.</p><p>Pepper is one of the founders of <a href=\"https://www.ambitionlw.org/\">Ambition Lawrence Weston</a>, a grassroots community group based seven miles from the middle of Bristol. A decade ago, spending cuts began to eat into the few amenities that local people had, and he and a handful of others decided they had to act.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/18/radical-community-groups-austerity-hope\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/18/pope-francis-reveals-he-wrote-resignation-letter-in-2013-in-case-of-ill-health", "title": "Pope Francis reveals he wrote resignation letter in 2013 in case of ill-health", "date_published": "2022-12-18 13:44:32+00:00", "description": "<p>Pontiff admits to having already signed renunciation if he should become impaired for medical reasons</p><p>Pope Francis has revealed he wrote a resignation letter shortly after being elected pontiff in 2013 in case medical problems prevented him from carrying out his duties.</p><p>Francis told the Spanish newspaper ABC he had “already signed my renunciation” when asked in an interview what would happen if health issues or an accident left a pope unable to carry out his duties.</p> <a href=\"https://www.theguardian.com/world/2022/dec/18/pope-francis-reveals-he-wrote-resignation-letter-in-2013-in-case-of-ill-health\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/blog/2022/dec/18/england-rugby-union-eddie-jones-analysis", "title": "Missed chance will define Jones’s England era but timing of his departure was wrong | Luke McLaughlin", "date_published": "2022-12-18 13:44:16+00:00", "description": "<p>Beating the All Blacks in 2019, losing the final and his untimely dismissal leave Eddie Jones wondering what might have been</p><p>Of all the things Eddie Jones said during his seven years as England coach, and there were plenty of them, one particular idea seemed to strike a jarring note.</p><p>It was in the immediate aftermath of England’s masterful victory over the All Blacks in the <a href=\"https://www.theguardian.com/sport/2019/oct/26/england-new-zealand-rugby-world-cup-semi-final-match-report\">2019 World Cup semi-final</a>, when they were one second-half defensive error away from “nilling” the greatest rugby team on the planet. Jones was bubbling, quite rightly, after witnessing the plan he had lovingly constructed transformed into reality in such dominant fashion.</p> <a href=\"https://www.theguardian.com/sport/blog/2022/dec/18/england-rugby-union-eddie-jones-analysis\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/live/2022/dec/18/argentina-france-world-cup-2022-final-live", "title": "Argentina v France: World Cup 2022 final – live", "date_published": "2022-12-18 13:30:30+00:00", "description": "<ul><li>Live World Cup final updates from 3pm UK time</li><li><a href=\"https://www.theguardian.com/football/2022/dec/16/world-cup-final-lionel-messi-kylian-mbappe-argentina-france-qatar\">Jacob Steinberg: Qatar the winner regardless</a></li><li>And you can <a href=\"mailto:Scott%20Murray%20%3Cscott.murray.casual@theguardian.com%3E\">email Scott</a> with your thoughts</li></ul><p><strong>The Fifa World Cup roll of honour.</strong> Should Argentina win, they’ll become the first country from outside Europe to lift the trophy since Brazil, 20 years ago in Japan. Should France prevail, they’ll be the first side to retain the trophy since Brazil, 60 years ago in Chile. Either way, someone will be winning their third World Cup, which will fill the currently vacant <strong>3</strong> slot on this list, therefore making it more structurally pleasing to the eye.</p><p><em><strong>5:</strong> Brazil (1958, 1962, 1970, 1994, 2002)<br /><strong>4:</strong> Italy (1934, 1938, 1982, 2006), Germany (1954, 1974, 1990, 2014)<br /><strong>2:</strong> Uruguay (1930, 1950), Argentina (1978, 1986), France (1998, 2018)<br /><strong>1:</strong> England (1966), Spain (2010)</em></p> <a href=\"https://www.theguardian.com/football/live/2022/dec/18/argentina-france-world-cup-2022-final-live\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/society/2022/dec/18/guardian-and-observer-charity-telethon-raises-nearly-80000", "title": "Guardian and Observer charity telethon raises nearly £80,000", "date_published": "2022-12-18 13:30:07+00:00", "description": "<p>Journalists including Marina Hyde and John Crace help raise sum in aid of groups tackling cost of living crisis</p><ul><li><a href=\"https://guardian.ctdonate.org/?utm_source=gdnwb&amp;utm_medium=editorial&amp;utm_campaign=CharityAppeal2022EditorialArticles&amp;CMP_TU=editorial&amp;CMP_BUNIT=edtrl\">Please donate to the appeal here</a></li></ul><p>Generous Guardian and Observer readers gave more than £78,000 over the phones during our annual charity telethon in aid of grassroots voluntary groups helping people who are struggling with the cost of living crisis.</p><p>A roster of star journalists including Marina Hyde, John Crace, Polly Toynbee, Owen Jones, Jonathan Freedland, Tim Dowling, and Zoe Williams were on hand in the Guardian offices on Saturday to take calls and chat to readers as phones rang constantly over the eight hour event.</p> <a href=\"https://www.theguardian.com/society/2022/dec/18/guardian-and-observer-charity-telethon-raises-nearly-80000\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/uk-news/2022/dec/18/man-charged-people-smuggling-four-die-trying-cross-channel", "title": "Man, 19, charged with people-smuggling after four die trying to cross Channel", "date_published": "2022-12-18 13:07:35+00:00", "description": "<p>Ibrahima Bah charged with facilitating attempted illegal entry into UK after incident this week</p><p>A teenager has been charged with people-smuggling after four people died while attempting to cross the Channel.</p><p>Ibrahima Bah, 19, of no fixed address, has been charged with facilitating attempted illegal entry into the UK after four people died and 39 were rescued when a boat capsized in the Channel this week, Kent police have said.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/18/man-charged-people-smuggling-four-die-trying-cross-channel\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/18/cricket-pakistan-england-third-test-day-two-report", "title": "Harry Brook hits third century of tour as England edge into lead over Pakistan", "date_published": "2022-12-18 13:04:12+00:00", "description": "<ul><li><a href=\"https://www.theguardian.com/sport/cricket/match/2022-12-18/england-cricket-team\">Third Test, day two: Pakistan 304 &amp; 21-0; England 354</a></li><li>England lead hosts by 29 runs at stumps in Karachi</li></ul><p>In a winter where a T20 World Cup was added to England’s white-ball trophy cabinet and a historic series victory in Pakistan was secured, it may yet be that the thing referenced most heavily in years to come is how it witnessed the emergence of Harry Brook.</p><p>Hyperbole? Possibly. And yet such thoughts were hard to escape on an absorbing second day in Karachi as the 23-year-old finessed his third century of the tour – a sublime 111 from 150 balls – that helped his side secure a precious first-innings lead of 50 runs in their quest for a first clean sweep on Pakistani soil.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/18/cricket-pakistan-england-third-test-day-two-report\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/science/2022/dec/18/the-10-biggest-science-stories-of-2022-chosen-by-scientists", "title": "The 10 biggest science stories of 2022 – chosen by scientists", "date_published": "2022-12-18 13:00:50+00:00", "description": "<p>From moon missions to fast-charging batteries and AI-sourced antibiotics, in no particular order, the year’s significant scientific developments</p><p>The year opened with a bang. Or rather, it didn’t. The successful film <em>Don’t Look Up</em>, in which a comet is found to be on a collision course with Earth, had been released just before Christmas 2021. In the bleak days of post-festive gloom, the news media were on an adrenaline high, chasing any and every story about potential asteroid collisions to cheer us all up. Five asteroids were to pass close to the Earth in January alone! Happily for the health and wellbeing of humanity, none was predicted to come within a whisker of hitting the planet. Nonetheless, the possibility of an asteroid colliding with Earth is a reality – the globe is covered in craters from previous impacts, and it is well known that 65m years ago, dinosaurs became extinct following the impact of an asteroid about 10km across. Can anything be done about saving us from this existential extraterrestrial threat? Fortunately, the international space community has taken the first steps towards reducing the risk of an asteroid catching us unawares. The <a href=\"https://www.esa.int/Space_Safety/Hera/DART\">joint Nasa- Esa mission Dart</a> (Double Asteroid Re-Direction Test) was an ambitious attempt to alter the trajectory of a small asteroid (Dimorphos) as it orbited a slightly larger asteroid (Didymos), by sending a spacecraft to crash into it. In October, we learned that the mission had been even more successful than anticipated, and that <a href=\"https://www.theguardian.com/science/2022/oct/11/nasa-dart-spacecraft-asteroid-successful\">the orbit of Dimorphos had changed</a> – showing that we could, if given sufficient time, alter the path of an asteroid if it were on a collision course with Earth.</p> <a href=\"https://www.theguardian.com/science/2022/dec/18/the-10-biggest-science-stories-of-2022-chosen-by-scientists\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/18/pakistan-climate-crisis-floods", "title": "A newborn held aloft in Pakistan sums up the sheer injustice of the climate crisis | Fatima Bhutto", "date_published": "2022-12-18 12:28:15+00:00", "description": "<p>My brother organised a medical camp after the summer’s deadly floods – a disaster caused by powerful nations</p><ul><li>Fatima Bhutto is an author of fiction and nonfiction</li><li>What was the image on your phone that defined 2022?<br /><a href=\"https://www.theguardian.com/commentisfree/series/snapshot-of-2022\">Writers give their perspectives</a></li></ul><p>This summer, intense monsoon rains combined with glacial melt caused <a href=\"https://www.theguardian.com/world/2022/sep/06/we-screamed-our-hearts-out-for-help-homeless-escape-pakistan-floods\">super-floods</a> across Pakistan. We are home to the second largest <a href=\"https://www.washingtonpost.com/world/asia_pacific/pakistan-has-more-glaciers-than-almost-anywhere-on-earth-but-they-are-at-risk/2016/08/11/7a6b4cd4-4882-11e6-8dac-0c6e4accc5b1_story.html\">number of glaciers</a> after the polar regions and, thanks to global heating, they are melting at unprecedented, terrifying speed. This is the year the climate emergency came home to me, and this is a photo that haunts me.</p><p>The floods wiped out approximately a million livestock, decimated crops, displaced 30 to 50 million Pakistanis, destroyed thousands of kilometres of roads – and months later, the damage is still going on. Stagnant water means farmers cannot plant new crops – those who could not plant rice in October, with water in certain parts remaining thigh high, will have no harvest to reap come March.</p><p>Fatima Bhutto is a Pakistani author of fiction and nonfiction</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/18/pakistan-climate-crisis-floods\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/18/steve-borthwick-england-rugby-union-head-coach-monday", "title": "Steve Borthwick to be confirmed as new England head coach on Monday", "date_published": "2022-12-18 12:15:40+00:00", "description": "<ul><li>Leicester head coach agrees deal to replace Eddie Jones</li><li>Borthwick worked under Jones with England and Japan</li></ul><p>Steve Borthwick will be confirmed by the Rugby Football Union as England’s new head coach on Monday after a deal was finalised on Sunday morning.</p><p>The 43-year-old has been recruited from Leicester where he has been the head coach since 2020, steering the club out of the doldrums as they won last season’s Premiership title. Borthwick worked as an assistant coach under his predecessor, Eddie Jones, over eight years with Japan and England.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/18/steve-borthwick-england-rugby-union-head-coach-monday\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/18/i-wanted-a-space-rocket-so-my-dad-built-me-a-wooden-apollo-11-in-his-garage-the-christmas-present-ill-never-forget", "title": "I wanted a space rocket so my dad built me a wooden Apollo 11 in his garage – the Christmas present I’ll never forget", "date_published": "2022-12-18 12:00:49+00:00", "description": "<p>My parents weren’t rich but they always made me feel I could have exactly what I dreamed of</p><p>I was three and Christmas 1969 was approaching. Neil Armstrong walked on the moon that summer and I wanted what millions of kids must have wanted for Christmas: the <a href=\"https://www.theguardian.com/science/apollo-11-moon-landing\">Apollo 11</a> rocket. I announced this and went off to listen yet again to my favourite record: Puff, the Magic Dragon.</p><p>Our house on a nice new estate in Wrexham was full of craft furniture. My dad, who taught woodwork at the town’s grammar school, made our tables and chairs and the abstract copper-wire artworks on the walls. The space age was happening on television but our Wales was still in the days of oak.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/18/i-wanted-a-space-rocket-so-my-dad-built-me-a-wooden-apollo-11-in-his-garage-the-christmas-present-ill-never-forget\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/food/2022/dec/18/how-to-make-the-perfect-chocolate-roulade-recipe-felicity-cloake", "title": "How to make the perfect chocolate roulade – recipe | Felicity Cloake's How to make the perfect...", "date_published": "2022-12-18 12:00:48+00:00", "description": "<p>It’s the fudgy crumb, crackly casing and luxuriant cream centre that elevate this French showstopper above the workaday swiss roll</p><p>I try to embark on these columns with an open mind: to engage the spirit of strict scientific neutrality in pursuit of culinary perfection. Yet, this week, as I rolled roulade after roulade, whipped cream softly spilling on to the counter in front of me, I realised that I was not only striving towards perfection, but attempting to recreate a very specific, decades-old sensory memory. The first mention of chocolate roulade in the British Newspaper Archive comes in 1976, but references peak in the late 1990s, when they also seemed to pop up at every special occasion I attended as a greedy teenager, often accompanied by an equally modish fruit coulis.</p><p>Strictly speaking, of course, a roulade simply refers to anything rolled –<a href=\"https://www.jamieoliver.com/features/beef-olives-true-comfort-food/\"> beef olives</a> are roulades, as are<a href=\"https://www.greatitalianchefs.com/recipes/chicken-involtini-recipe\"> involtini</a> and that <a href=\"https://www.boursin.com/\">French cream cheese flavoured with herbs and garlic</a> – but these roulades were always both sweet and rich enough to react badly with the ill-advised glasses of wine taken beforehand. They were also so delicious that we didn’t care. But even if you don’t have the same fond memories, a roulade has several things to recommend it as a festive dessert: it’s best made ahead of time, it’s often gluten-free and it looks great. So embrace the retro this Christmas – it’s a classic for a reason.</p> <a href=\"https://www.theguardian.com/food/2022/dec/18/how-to-make-the-perfect-chocolate-roulade-recipe-felicity-cloake\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/science/2022/dec/18/return-of-the-northern-white-rhino-back-from-extinction", "title": "Return of the rhino: can we bring the northern white back from extinction?", "date_published": "2022-12-18 12:00:48+00:00", "description": "An enthralling project to save the northern white rhino is raising challenging questions as scientists debate the ethics of de-extinction<p>When Dr Natalie Cooper, a scientist at the Natural History Museum, met Sudan, the last surviving northern white male rhino, in Kenya before he died aged 45, she understandably feared the subspecies’ extinction was certain – mostly due to poaching fuelled by human greed for the prized horn. “The sense of enormity when staring extinction right in the eye is difficult to comprehend,” she reflects on that 2013 encounter. “It was fairly obvious by that point that the breeding programme wasn’t going to work – the subspecies seemed doomed, it was just a matter of time.”</p><p>But almost a decade later, the world’s rarest large mammal could be on the brink of an astonishing return from functional extinction. The growing efforts to save extant, but seriously threatened, species come alongside a controversial wider de-extinction movement that seeks to bring versions of lost animal breeds, such as woolly mammoths, back to life.</p> <a href=\"https://www.theguardian.com/science/2022/dec/18/return-of-the-northern-white-rhino-back-from-extinction\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/18/afghanistan-fuel-tanker-explodes-tunnel-deaths", "title": "Many killed after fuel tanker explodes in tunnel in Afghanistan", "date_published": "2022-12-18 11:49:27+00:00", "description": "<p>Blast in Salang Tunnel, a key route linking north and south of country, killed at least 19 people, says official</p><p>At least 19 people were killed and 32 injured when a fuel tanker exploded in a tunnel north of the Afghan capital, Kabul, a local official has said.</p><p>The Salang Tunnel, about 80 miles (130km) north of Kabul, was originally built in the 1960s to assist the Soviet invasion. It is a key route linking the country’s north and south.</p> <a href=\"https://www.theguardian.com/world/2022/dec/18/afghanistan-fuel-tanker-explodes-tunnel-deaths\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/18/brazil-indigenous-ministry-sonia-guajajara-activist", "title": "Sônia Guajajara hails Brazil’s Indigenous ministry after Bolsonaro ‘turmoil’", "date_published": "2022-12-18 11:45:48+00:00", "description": "<p>The activist for native peoples says she will work to overturn the ‘catastrophic legacy’ from Jair Bolsonaro’s presidency</p><p>The activist tipped to become Brazil’s first-ever minister for native peoples has vowed to make the demarcation of Indigenous lands and the battle against environmental crime top priorities in an attempt to overcome Jair Bolsonaro’s <a href=\"https://www.theguardian.com/environment/2021/jul/14/amazon-rainforest-will-collapse-if-bolsonaro-remains-president\">“catastrophic legacy”</a> of Amazon devastation and violence.</p><p>Sônia Guajajara, a key member of Brazil’s burgeoning <a href=\"https://www.theguardian.com/world/2021/sep/10/indigenous-warrior-women-brazil-ancestral-lands-protest\">Indigenous rights movement</a>, is widely expected to be named head of the ministry, which president-elect Luiz Inácio Lula da Silva promised to create during his campaign.</p> <a href=\"https://www.theguardian.com/world/2022/dec/18/brazil-indigenous-ministry-sonia-guajajara-activist\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/18/french-prosecutors-investigate-lyon-fire-in-which-10-people-died", "title": "French prosecutors investigate Lyon fire in which 10 people died", "date_published": "2022-12-18 11:21:12+00:00", "description": "<p>Inquiry launched into ‘wilful damage leading to death’ after six adults and four children perished on Friday</p><p>French prosecutors have opened an investigation into “wilful damage leading to death” after a <a href=\"https://www.theguardian.com/world/2022/dec/16/ten-people-including-five-children-killed-in-apartment-fire-near-lyon-french-authorities-say\">pre-dawn blaze</a> killed 10 people in a rundown seven-storey block of flats outside Lyon.</p><p>The Lyon public prosecutor’s office said six adults and four children died in the fire on Friday in Vaulx-en-Velin and 24 people had been injured, four of whom remained in a serious condition in hospital. Initial reports said five adults and five children were killed.</p> <a href=\"https://www.theguardian.com/world/2022/dec/18/french-prosecutors-investigate-lyon-fire-in-which-10-people-died\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/music/2022/dec/18/rightwing-twitter-rant-napalm-death-mick-harris-ageing-rockers", "title": "Go out in flames or fade away? Rightwing Twitter rant rekindles dilemma for ageing rockers", "date_published": "2022-12-18 11:00:48+00:00", "description": "<p>Former Napalm Death drummer Mick Harris has sparked  debate among musicians about how to tackle senior years</p><p>The world of rock is a dangerous place to stay, with veteran musicians either damaged by the lifestyle or growing more out of touch with every passing year. This is the view of some of Britain’s well-known performers, responding to a rightwing Twitter rant from a one-time rock radical.</p><p>The drummer Mick Harris, an original member of Napalm Death, launched an angry attack last week on “dole scroungers” and “benefit cheats” in a short video, full of crude language. This led to a lively online debate among 90s rockers about the best way for ageing musicians to tackle their senior years.</p> <a href=\"https://www.theguardian.com/music/2022/dec/18/rightwing-twitter-rant-napalm-death-mick-harris-ageing-rockers\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/music/2022/dec/18/kitty-empire-10-best-pop-and-rock-albums-of-2022-music", "title": "Music: Kitty Empire’s 10 best albums of 2022", "date_published": "2022-12-18 11:00:48+00:00", "description": "<p>Non-stop dance parties, retro beats and dreamy vignettes vied with slacker rock, flamenco-inflected R&amp;B and no end of heartbreak</p><ul><li><a href=\"https://www.theguardian.com/culture/series/observer-critics--review-of-2022\">Read the Observer critics’ review of 2022 in full</a></li></ul><p>1. <strong><a href=\"https://www.theguardian.com/music/2022/aug/06/beyonce-renaissance-review-a-breathtaking-maximalist-tour-de-force\">Beyoncé – Renaissance</a></strong> <strong><br /></strong><strong>Parkwood Entertain</strong><strong>ment/Columbia</strong><strong>;</strong><strong> July</strong><br />This 16-track non-stop party album went higher and harder than many of the pandemic dance albums that preceded it. Full of love and catharsis, <em>Renaissance</em> paid tribute to the queer Black underground scenes from which Beyoncé drew, and to the therapeutic value of the dancefloor no matter who you are.</p><p>2. <strong><a href=\"https://www.theguardian.com/music/2022/aug/13/danger-mouse-and-black-thought-codes-review-an-out-and-out-hip-hop-masterpiece\">Danger Mouse and Black Thought – Cheat Codes</a></strong> <strong><br /></strong><strong>BMG</strong><strong>;</strong><strong> August</strong><br />Luxuriantly retro, this all-killer, no-filler pairing of A-list beat-maker Danger Mouse with rapper Black Thought from the Roots made good on a 20-year-old pledge. With Danger Mouse lining up crate-digger samples and tailored beats, one of hip-hop’s premier lyrical giants let rip at a rigged system.</p> <a href=\"https://www.theguardian.com/music/2022/dec/18/kitty-empire-10-best-pop-and-rock-albums-of-2022-music\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/books/2022/dec/18/cinderella-fairytale-glass-slipper-joke-royalty-louis-xiv", "title": "Think Cinderella’s a fairytale? Fabled glass slipper is revealed as a joke on royalty", "date_published": "2022-12-18 11:00:48+00:00", "description": "<p>The footwear at the heart of the age-old panto tale is a satirical jibe at fashionista king Louis XIV’s obsession with ornamental glass and impractical aristocratic styles</p><p>For hundreds of years, the glass slipper has been synonymous with the tale of Cinderella and her midnight dash home from the ball. Now an academic has traced its 17th-century origins and uncovered a connection to the creation of the <a href=\"https://www.theguardian.com/news/gallery/2022/may/24/high-tides-and-a-versailles-fancy-dress-ball-tuesdays-best-photos\" title=\"\">Hall of Mirrors at the Palace of Versailles</a> and the impractical fashions and fads of French aristocrats.</p><p>“The glass slipper is a witty joke,” said Genevieve Warwick, professor of the history of art at the University of Edinburgh. It was intended to be a “literary mascot of French economic modernity” and a tongue-in-cheek reference to Louis XIV’s love of extravagant and often quixotic French fashion, especially in regard to shoes, she told the <em>Observer</em>. “No one could actually walk, let alone dance, in shoes made of glass.”</p> <a href=\"https://www.theguardian.com/books/2022/dec/18/cinderella-fairytale-glass-slipper-joke-royalty-louis-xiv\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/18/violent-protests-in-peru-evoke-memories-of-darkest-days-of-civil-war", "title": "Violent protests in Peru evoke memories of darkest days of civil war", "date_published": "2022-12-18 11:00:48+00:00", "description": "<p>At least 20 people have been killed in demonstrations against the ousting of Pedro Castillo, a flashback to a past many hoped they had left behind</p><ul><li><a href=\"https://www.theguardian.com/world/2022/dec/14/peru-explainer-what-is-happening\">What is happening in Peru and why are people angry?</a></li></ul><p>Huamanga, a picturesque Andean city of cobbled streets and whitewashed plazas, was eerily silent. Shop doors were bolted, and the tiny taxis known as <em>ticos</em> were absent in the aftermath of the worst violence it has seen in decades.</p><p>A day earlier, soldiers had opened fire on stone-throwing protesters, who tried to storm the local airport’s runway, killing at least eight and injuring more than 70 in running battles, as helicopters rained teargas canisters and bullets over the city.</p> <a href=\"https://www.theguardian.com/world/2022/dec/18/violent-protests-in-peru-evoke-memories-of-darkest-days-of-civil-war\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/society/2022/dec/18/hospice-cyprus-british-couple-david-hunter-jail", "title": "‘It could all have been so different’: how a hospice in Cyprus comes too late for one British couple", "date_published": "2022-12-18 11:00:48+00:00", "description": "<p>A year after he helped his terminally ill wife die, David Hunter is still in jail</p><p>In the hills above Paphos, at the end of a cul-de-sac in the village of Tala, Chris Jones is giving a guided tour of what has become his life’s work: transforming a two-storey villa into a palliative care facility.</p><p>As the late afternoon sun shimmers over the sea beyond, Jones, a retired headmaster, points out the areas that will soon become the hospice’s lift and nurses’ station, oxygen and buzzer systems.</p> <a href=\"https://www.theguardian.com/society/2022/dec/18/hospice-cyprus-british-couple-david-hunter-jail\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/books/2022/dec/18/whose-desk-is-it-anyway-a-literary-quiz", "title": "Whose desk is it anyway? A literary quiz", "date_published": "2022-12-18 11:00:47+00:00", "description": "<p>Can you match the seven famous writers to the photographs of where they work?</p><p>Perhaps you have their books sitting on your own shelves, but could you identify your favourite writers just by their desks?</p><p>Seven of the nation’s most beloved scribes have let us peer behind the curtains into their private writing lives. Can you tell which desk belongs to Scottish crime-writing supremo Val McDermid, “tartan noir” writer of the Wire in the Blood series and co-founder Harrogate crime writing festival? Or former children’s laureate and <em>We’re Going on a Bear Hunt</em> author Michael Rosen? What knick-knacks might hint at the presence of Nigerian-born, London based Inua Ellams, author of the sellout play <em>Barber Shop Chronicles</em>, the epic story <em>The Half God of Rainfall</em>, and the poetry collection <em>The Actual</em>?</p> <a href=\"https://www.theguardian.com/books/2022/dec/18/whose-desk-is-it-anyway-a-literary-quiz\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/18/parents-healing-after-losing-child-gun-violence", "title": "‘Some scars are for ever’: the grief of losing a child to gun violence during the holidays", "date_published": "2022-12-18 11:00:47+00:00", "description": "<p>End of the year can be painful for those who have lost loved ones to firearm crime, but forming new traditions can help ease trauma</p><p>Ramon Price makes sure he’s working on Thanksgiving and Christmas.</p><p>He’s a counselor at a funeral home in Oakland, California, where for the past 18 years he’s helped hundreds of families navigate grief, death certificates, insurance and casket selections. About half of them lost loved ones in a homicide, usually with a firearm.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/18/parents-healing-after-losing-child-gun-violence\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/uk-news/2022/dec/18/uk-government-will-stay-resolute-on-nurses-pay-says-oliver-dowden-strikes", "title": "UK government will stay ‘resolute’ on nurses’ pay, says Oliver Dowden", "date_published": "2022-12-18 10:38:37+00:00", "description": "<p>Minister defends refusal to override pay offer despite threat of further industrial action in January</p><p>Oliver Dowden has said the UK government will remain “resolute” on pay for nurses despite the potential for further strikes in January, as the NHS confederation chief said it was inevitable patients will be harmed by the strikes.</p><p>The Royal College of Nursing has said there will be “more hospitals and more nurses taking part than at present” in strikes throughout January, unless ministers backs down by Thursday.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/18/uk-government-will-stay-resolute-on-nurses-pay-says-oliver-dowden-strikes\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/18/fa-confirms-gareth-southgate-is-carrying-on-as-england-manager", "title": "‘We are delighted’: FA confirms Gareth Southgate staying as England manager", "date_published": "2022-12-18 10:33:57+00:00", "description": "<ul><li>Southgate questioned future after World Cup defeat by France</li><li>He has ‘always had our full support’, says Mark Bullingham</li></ul><p>The Football Association’s chief executive, Mark Bullingham, has spoken of his “delight” at Gareth Southgate’s decision to continue as England’s manager and lead the team into qualifying for Euro 2024.</p><p>After a week of soul-searching that followed the heartbreak of England’s 2-1 <a href=\"https://www.theguardian.com/football/2022/dec/10/england-france-world-cup-quarter-final-match-report\">defeat by France</a> in the quarter-finals of the World Cup, Southgate has concluded there is no reason for him to quit before his contract ends in December 2024.</p> <a href=\"https://www.theguardian.com/football/2022/dec/18/fa-confirms-gareth-southgate-is-carrying-on-as-england-manager\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/food/2022/dec/18/nigel-slater-recipes-beetroot-and-feta-filo-pie-and-white-chocolate-lemon-truffles", "title": "Nigel Slater’s recipes for beetroot and feta filo pie, and white chocolate and lemon truffles", "date_published": "2022-12-18 10:30:46+00:00", "description": "This Christmas, try a festive filo pie followed by irresistible lemony truffles<p>I can hear the church bells from the kitchen, even more so if it’s a fine Christmas morning and the doors are open on to the garden. I will send the smell of roast duck with baked apples and potatoes cooked slowly in more of the bird’s glorious fat out into the garden to tease the neighbourhood foxes. I will also be making a beetroot pie. To balance the roots’ earthy sweetness I will crumble salty white feta into the filling and include the beetroot leaves, too. The pastry will be crisp and buttery filo.</p><p>Actually, I will roast two ducks, the second for tearing to pieces the next day, the cold meat to be eaten with pickled cabbage and slices of the cold beetroot and feta pie. (Little cooking goes on during Boxing Day, though I usually get a pot of bean soup on to simmer.)</p> <a href=\"https://www.theguardian.com/food/2022/dec/18/nigel-slater-recipes-beetroot-and-feta-filo-pie-and-white-chocolate-lemon-truffles\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/18/gareth-southgate-staying-as-england-manager-why-and-what-next-euro-2024", "title": "Gareth Southgate is staying as England manager: why and what next?", "date_published": "2022-12-18 10:13:02+00:00", "description": "<p>With the FA confirming Southgate will stay on, we look at the key reasons and how his plans for Euro 2024 in Germany could shape up</p><p>When Southgate held court with a group of journalists after England’s shattering World Cup quarter-final <a href=\"https://www.theguardian.com/football/2022/dec/10/england-france-world-cup-quarter-final-match-report\">defeat against France</a>, he spoke <a href=\"https://www.theguardian.com/football/2022/dec/11/gareth-southgate-feels-conflicted-over-england-job-future-after-recent-lows\">about feeling “conflicted”</a> as to whether to continue. He cited the principal cause: “The night at Wolves.” The team’s <a href=\"https://www.theguardian.com/football/2022/jun/14/england-hungary-nations-league-match-report\">4-0 loss to Hungary</a> at Molineux in June was a horrible low. The venom of the crowd shocked Southgate and the Football Association and it led him to think that the World Cup in Qatar would be his last dance. Southgate always reads the room. He had also said that he would <a href=\"https://www.theguardian.com/football/2022/jun/10/gareth-southgate-england-manager-nations-league-italy\">not outstay his welcome</a>. He worried he was approaching that point. But during his soul-searching since the France game last Saturday, Southgate surely reminded himself of how he has approached adversity. In 2016, the prospect of a baying mob and personal upset had led him to turn down the England job. He would go on to accept it after Sam Allardyce’s departure and he did so with the words of a close friend in mind. Chris Coleman, his former Crystal Palace teammate, had felt his confidence dented by a dismissal at club level. As Southgate had. But Coleman still stepped up to enjoy success with Wales. Southgate would watch Coleman giving a victorious post-match interview. “Chris spelled it out very simply: ‘Don’t be frightened of going for things in life,’” Southgate said. “It felt like he was talking directly to me.” The sentiment retains its resonance.</p> <a href=\"https://www.theguardian.com/football/2022/dec/18/gareth-southgate-staying-as-england-manager-why-and-what-next-euro-2024\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/18/global-heating-helps-turns-icy-sweden-into-unique-wine-making-territory", "title": "Global heating helps turns icy Sweden into unique wine-making territory", "date_published": "2022-12-18 10:00:48+00:00", "description": "<p>As the climate warms, and with up to 23 hours of summer sun to ripen innovative varieties, commercial wineries are booming</p><p>Across most of the northern hemisphere, the grape harvest finished months ago. But in a small vineyard not far from Stockholm, in temperatures of -8C and 15cm of snow, it’s only just begun.</p><p>“It’s perfect,” said Göran Amnegård, whose <a href=\"https://www.blaxstawine.se/\" title=\"\">Blaxsta</a> winery claims to be one of the world’s most northerly vineyards, as they started the harvest last week.</p> <a href=\"https://www.theguardian.com/world/2022/dec/18/global-heating-helps-turns-icy-sweden-into-unique-wine-making-territory\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/artanddesign/2022/dec/18/eric-gill-museum-artist-sexual-abuser", "title": "Airbrushing claim as ‘Eric Gill museum’ shuns legacy of artist and sexual abuser", "date_published": "2022-12-18 10:00:47+00:00", "description": "<p>The master craftsman was once lauded in Ditchling, Sussex. Now, as the grotesque truth of his life is acknowledged, all that has changed</p><p>Eric Gill was one the most celebrated British artists of the 20th century – and for decades his work held pride of place in the small museum based in the village where he once lived.</p><p>But after his death, details emerged of his grotesque sexual conduct – including sustained abuse of two of his daughters and his younger sister – and there has been increasing clamour since for his work not to be shown.</p> <a href=\"https://www.theguardian.com/artanddesign/2022/dec/18/eric-gill-museum-artist-sexual-abuser\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/18/canada-medically-assisted-death-delay", "title": "Canada delays right to physician-assisted death for mentally ill people", "date_published": "2022-12-18 10:00:47+00:00", "description": "<p>Clinicians say there is concern that the country’s healthcare system is inadequate to protect most vulnerable</p><p>Canada is delaying plans which would allow people with mental illness to access <a href=\"https://www.theguardian.com/world/2022/may/11/canada-cases-right-to-die-laws\">medically assisted death</a> amid concern from some clinicians that the healthcare system is not prepared to handle the complicated cases.</p><p>Starting March 2023, Canada is expected to become one of the few countries in the world to allow physician-assisted death for chronic mental disorders.</p> <a href=\"https://www.theguardian.com/world/2022/dec/18/canada-medically-assisted-death-delay\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/travel/2022/dec/18/isle-of-skye-scotland-food-whisky-walks-scotland-hebrides-wildlife", "title": "‘A land of fairy pools and exquisite light’: escape to the wilds of Skye", "date_published": "2022-12-18 10:00:47+00:00", "description": "<p>Discover breathtaking views, superb food and utter peace on this popular  island on the west coast of Scotland</p><p>However fraught your journey (ours is seven hours, fretting as our electric car battery dwindles), reaching Kinloch Lodge is a joyful corrective. As you cross the bridge to Skye, it’s instantly apparent you’ve escaped the grind – soft ranges of peaks, each fainter and hazier than the last, in shades of lavender and smoke. The sea is everywhere, lapping wild, seaweed-strewn shorelines and filling rock pools. This is why Skye attracts 650,000 visitors a year – it’s legendarily beautiful, a land of fairy pools and exquisite light. In late autumn, however, on the gentle Sleat peninsula in the south, tucked away down a private track, Kinloch has an extra asset: absolute peace. As we get out of the car, stiffly, a shaft of sun pierces the clouds and the sea loch glitters. There’s a smell of damp peat and brine; the only sounds are waves and curlews calling.</p><p>The lodge looks sturdily approachable, not grand. Inside there’s a crackling fire and a welcome glass of fizz in the tiny bar. Staff are smiley and utterly relaxed about our crumpled, crumb-covered appearance. It’s miles away from my childhood Hebridean holidays in spartan self-catering cottages, but also from the constipated jacket-and-tie stuffiness of traditional country house hotels. In the lounge, people curl quietly on fat sofas, doze, eat cake and gaze outside, books forgotten on laps. Our calm, cosseting room has the view, too, from two window seats overlooking the loch. It’s haute comfort; nothing cold, fussy or intimidating.</p> <a href=\"https://www.theguardian.com/travel/2022/dec/18/isle-of-skye-scotland-food-whisky-walks-scotland-hebrides-wildlife\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/18/mike-pence-trump-lite-politeness-republicans", "title": "Can Pence’s Trump-lite blend of policy and politeness convince Republicans?", "date_published": "2022-12-18 10:00:46+00:00", "description": "<p>Former vice-president strikes a delicate balance between praise and condemnation of his old boss as he considers a 2024 run</p><p>There were servings of croissants, macarons and copies of a book entitled <a href=\"https://www.simonandschuster.com/books/So-Help-Me-God/Mike-Pence/9781982190330\">So Help Me God</a>. There were reporters but it could not be described as a stampede; one front row seat was nabbed by the Guardian while others assigned to the media were eventually given to regular audience members.</p><p>Mike Pence, the former US vice-president, walked into the auditorium at the <a href=\"https://www.aei.org/events/so-help-me-god-a-conversation-with-vice-president-mike-pence-on-his-new-book/\">American Enterprise Institute (AEI)</a> thinktank in Washington last week. It was the latest stop on a lengthy book tour that is ostensibly promoting his memoir while also testing the water for a presidential run in 2024.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/18/mike-pence-trump-lite-politeness-republicans\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/18/the-tories-santa-tax-has-brought-christmas-to-its-knees", "title": "The Tories’ Santa tax has brought Christmas to its knees | Stewart Lee", "date_published": "2022-12-18 10:00:46+00:00", "description": "<p>What good is goodwill, say the Conservatives, if it can’t be monetised?</p><p>It seems there is no depth to which the current crop of Conservatives will not sink, monetising every aspect of modern life in an attempt to create backdoor pathways to funnel any available wealth into their own pockets and those of their donors and cronies, the rivers and seas fouled with excrement, the bodies piled high on gurneys. Brexit Britain resembles nothing more than Russia in the dying days of the Soviet Union, with politicians and their friends in business trying to make off with as much money as they can before the edifice crumbles behind them. But even after the unravelling financial scandals that have enriched everyone from Michelle Mone to <a href=\"https://www.theguardian.com/politics/2021/dec/01/matt-hancock-says-labours-covid-contract-claims-rubbish\">Matt Handcock’s pub landlord</a>, the Tories have surely reached a new low with the revelation of plans to asset-strip the very concept of Christmas itself. And, as an investigation by the <em>Guardian</em> revealed, they are nothing new.</p><p>Unable to sleep on Christmas Eve 1983, after eating an entire and excessively rich duck confit at one sitting, the disarrayed chancellor of the exchequer, Nigel Lawson, was exiting the toilet in his vast Gascony mansion when he encountered what he assumed was one of his servants in a Father Christmas costume in a tapestried hall. The chancellor simply pantomimed the act of holding his nose and declared: “I’d leave that one a while if I were you.” Then Lawson realised – he was addressing the actual Father Christmas.</p><p>Stewart Lee’s standup shows <em>Snowflake</em> and <em>Tornado</em> are both currently available <a href=\"https://www.bbc.co.uk/iplayer/episodes/m001bvpn/stewart-lee\">on the BBC iPlayer</a>. Basic Lee tour dates are <a href=\"https://www.stewartlee.co.uk/live-dates/\">booking now</a></p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/18/the-tories-santa-tax-has-brought-christmas-to-its-knees\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/live/2022/dec/18/world-cup-2022-countdown-to-argentina-v-france-final-live", "title": "World Cup 2022: latest news and countdown to Argentina v France in the final – live", "date_published": "2022-12-18 09:34:47+00:00", "description": "<ul><li>Team news, previews and more before 3pm (GMT) match</li><li>And you can <a href=\"https://twitter.com/Will_Unwin\">email Will</a> or tweet <a href=\"https://twitter.com/Will_Unwin\">@Will_Unwin</a></li></ul><p><strong>Buenos Aires is primed.</strong></p><p><strong>Let’s have a look at two key individuals in today’s match.</strong></p> <a href=\"https://www.theguardian.com/football/live/2022/dec/18/world-cup-2022-countdown-to-argentina-v-france-final-live\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/18/class-not-parents-place-of-birth-determines-life-chances-of-first-generation-locals", "title": "Class, not parents’ place of birth, determines the life chances of ‘first-generation locals’ | Torsten Bell", "date_published": "2022-12-18 09:30:46+00:00", "description": "A Danish study shows that children of migrants do better than ‘natives’ when socioeconomic background is applied<p>How should we refer to the children of immigrants? The traditional answer is “second-generation immigrants”, yet “first-generation locals” is far more accurate, as a new <a href=\"https://cep.lse.ac.uk/_NEW/PUBLICATIONS/abstract.asp?index=9646\" title=\"\">research paper</a> co-authored by Alan Manning, one of the UK’s top economists, points out.</p><p>It has more to offer than linguistic improvements. In the US, first-generation locals generally do better than the children of locals. But that’s prompted a puzzle, because in European countries that is often not the case, with the children of migrants having below average educational and labour market outcomes. This has prompted worries from the left about discrimination and from the right about a lack of integration.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/18/class-not-parents-place-of-birth-determines-life-chances-of-first-generation-locals\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/culture/2022/dec/18/on-my-radar-michelle-visage-cultural-highlights", "title": "On my radar: Michelle Visage’s cultural highlights", "date_published": "2022-12-18 09:30:46+00:00", "description": "<p>The broadcaster and Drag Race judge on Baz Luhrmann’s triumphant Elvis, Molly Shannon’s inspiring biography, and a very cosy restaurant</p><p>Born in New Jersey in 1968, Michelle Visage is a judge on <em><a href=\"https://www.theguardian.com/tv-and-radio/rupaul\">RuPaul’s Drag Race</a></em><a href=\"https://www.theguardian.com/tv-and-radio/rupaul\"> </a>and has won <a href=\"https://www.emmys.com/bios/michelle-visage\">three Emmy awards</a> as a producer of the show. In the 80s she was part of vocal trio Seduction and reached the top of the dance charts as part of the R&amp;B group the S.O.U.L. S.Y.S.T.E.M. She appeared on <em>Celebrity Big Brother</em> in 2015 and on 2019’s <em>Strictly Come Dancing</em>. Her <a href=\"https://www.bbc.co.uk/programmes/m001955m\">BBC Radio 2 show</a> is on Fridays from 7-9pm and her <em>Fabulous New Year Party</em> is on 31 December, 10pm-1am. <em><a href=\"https://www.bbc.co.uk/programmes/m0015dn0\">Michelle Visage’s Rule Breakers</a></em> is available now on BBC Sounds. </p> <a href=\"https://www.theguardian.com/culture/2022/dec/18/on-my-radar-michelle-visage-cultural-highlights\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/gallery/2022/dec/18/watching-the-world-cup-in-pictures-qatar-2022", "title": "Fans around the world watch the 2022 World Cup – in pictures", "date_published": "2022-12-18 09:30:45+00:00", "description": "<p>An estimated 3.58bn people watched matches at the 2018 World Cup, and the signs are that the 2022 final will top the figure of 1.12bn that tuned in for France’s final win over Croatia in Moscow. Here we take a look around the globe to see the different ways that fans watched their favourite team</p> <a href=\"https://www.theguardian.com/football/gallery/2022/dec/18/watching-the-world-cup-in-pictures-qatar-2022\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/18/seamas-oreilly-the-advent-calendar-has-taught-our-boy-valuable-lessons", "title": "The Advent calender has taught our boy valuable lessons", "date_published": "2022-12-18 09:30:45+00:00", "description": "He has discovered self-restraint, and also maths<p>My son only has one struggle with numbers, and that’s the ones on his Advent calendar. His issue is not with the maths involved, but rather that he wants to open every single window at once and eat them all right now. It dispenses a small chocolate for each day of December and he’s keenly aware that going beyond his daily allotment would betray this pact.</p><p>He hovers over the forbidden windows, paralysed. Finally, he waves his hand to signal I can take it out of his sight, in the manner of a king bored by a meddlesome subject. He keeps to its plan, not out of fear of our authority, or the treacly spectre of heart disease, but out of respect for the numbers themselves. He wants to eat the chocolates, but not as much as he wants the world to know his command of numbers, and their order. Torn between avarice for chocolate and fealty to maths, his respect for the numbers wins.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/18/seamas-oreilly-the-advent-calendar-has-taught-our-boy-valuable-lessons\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/film/2022/dec/18/steven-spielberg-tells-of-guilt-jaws-film-sharks", "title": "Spielberg tells of guilt over harm hit film Jaws may have done to sharks", "date_published": "2022-12-18 09:29:07+00:00", "description": "<p>Director tells BBC’s Desert Island Discs he regrets the ‘frenzy of sport fishing’ that followed 1975 thriller’s release<br /></p><p>All it takes to conjure an instant sense of danger in anyone who has watched <em><a href=\"https://www.theguardian.com/film/2012/jun/17/jaws-review-steven-spielberg\" title=\"\">Jaws</a></em> is two notes, a semitone apart, ingeniously deployed to indicate the impending threat of a great white shark.</p><p>But now, nearly half a century on, director Steven Spielberg has conceded that perhaps the Oscar-winning 1975 thriller was too effective at conjuring fear of the defamed creatures, admitting he is “truly regretful” for any influence he has had on the world’s rapidly shrinking shark population.</p> <a href=\"https://www.theguardian.com/film/2022/dec/18/steven-spielberg-tells-of-guilt-jaws-film-sharks\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/18/elon-musk-is-jekyll-and-hyde-character-and-as-head-of-twitter-hyde-is-winning", "title": "Elon Musk is a Jekyll and Hyde character. And as head of Twitter, Hyde is winning | John Naughton", "date_published": "2022-12-18 09:00:46+00:00", "description": "On the one hand, he’s a creative genius. On the other, he’s destroying a key debating chamber<p>Watching what’s going on at Twitter is like watching a guy losing his mind in slow motion. The guy in question is Elon Musk, who once upon a time was the world’s richest man and now isn’t. (That slot is apparently occupied by <a href=\"https://www.ibtimes.com/30-facts-about-bernard-arnault-new-richest-person-world-3647939\" title=\"\">Bernard Arnault</a>, the luxury goods mogul.)</p><p>Musk is in a hole but apparently doesn’t know Denis Healey’s First Law of Holes: when you’re in one, stop digging. The funny thing is that he dug the hole himself. First, he paid way over the odds for Twitter. Then, when Tesla shares (the main source of his wealth) tanked, and Twitter’s share price dropped, he tried to get out of the deal. That failed, so he was forced to borrow a lot of money – incurring interest payments of around a billion dollars a year – thereby becoming the reluctant owner of a loss-making company. And he hasn’t the faintest idea of how to make it work.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/18/elon-musk-is-jekyll-and-hyde-character-and-as-head-of-twitter-hyde-is-winning\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/culture/2022/dec/18/mark-kermode-10-best-films-of-2022", "title": "Film: Mark Kermode’s 10 best of 2022", "date_published": "2022-12-18 09:00:46+00:00", "description": "<p>From Hindi crime drama to medieval teen empowerment, Graceland to Bradford to Iran, the year was rich in unforgettable performances</p><ul><li><a href=\"https://www.theguardian.com/culture/series/observer-critics--review-of-2022\">Read the Observer critics’ review of 2022 in full</a></li></ul><p>1. <strong><a href=\"https://www.theguardian.com/film/2022/nov/20/aftersun-review-charlotte-wells-luminous-father-daughter-drama-paul-mescal\">Aftersun</a><br />Released in the UK in </strong><strong>November</strong><br />Charlotte Wells’s Bifa-winning debut feature is an astonishing, understated father-daughter coming-of-age movie that mutates into a mesmerising meditation on memory, love and loss. Superb performances by Paul Mescal and Frankie Corio lend naturalistic heft, but there’s a poetry in Wells’s film-making that evokes the finest works of Lynne Ramsay. Electrifying and heartbreaking.</p><p>2. <strong><a href=\"https://www.theguardian.com/film/2022/jun/26/elvis-review-blistering-turbocharged-chronicle-of-the-king\">Elvis</a><br />June</strong><br />Austin Butler breathes uncanny life into one of the greatest pop icons of the 20th century, but director Baz Luhrmann’s film isn’t just glitz and glamour. Instead, it’s an astute and often witty reading of Presley’s life and times masquerading as a garish bump-and-grind sideshow. Tom Hanks brings a touch of Elmer Fudd to carnival-huckster/narrator Colonel Tom Parker, who plays Salieri to Elvis’s Mozart.</p> <a href=\"https://www.theguardian.com/culture/2022/dec/18/mark-kermode-10-best-films-of-2022\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/books/2022/dec/18/juana-the-mad-a-short-story-by-tessa-hadley", "title": "Juana the Mad: a short story by Tessa Hadley", "date_published": "2022-12-18 09:00:46+00:00", "description": "<p>A chance encounter at a Christmas party churns up buried memories in this exclusive tale by the prize-winning novelist</p><p>It was at a Christmas party in the 1980s. I was very young then, living with my first husband and our three children – the youngest still breastfeeding – in an oversized, dilapidated Victorian house with orange and purple wallpaper, and nylon carpets which gave the children electric shocks. We were supposed to be doing the house up, but that was a joke, partly because we didn’t have any money and partly because my husband was working all hours, trying to get his architectural practice off the ground. At the end of each day I was gratified if I’d managed to get meals on the table, the washing into the machine and out of it again, and all the children into bed. The doing-up anyhow was his idea; I hated DIY and was no good at it. In the evenings, when the children were asleep at last, I turned my back on the wallpaper’s swirling fronds, huddled for warmth under a blanket in one corner of our broken-springed sofa, and read books, which were my salvation. There was a theory in our marriage that I had a career too, as a journalist and reviewer, which I would at some point pick up again. But that was beginning to recede into myth, like the spires of a serene city on the horizon in a painting, ever more distant from the ship I’d sailed in.</p><p>This party was in another oversized dilapidated house, further down the same street, belonging to friends of ours, and I was counting on getting a lot out of it; I was wearing a new red stretch-jersey dress with a full skirt. I didn’t have any exaggerated idea of my attractiveness – I was like those birds the birdwatchers don’t count, a little brown job, and plumper after three children – but I thought that the red dress suited me. I’d had a couple of glasses of strong punch already, and was roaming the party in a state of anticipation that was almost predatory. I wanted life! I wanted to live more.</p> <a href=\"https://www.theguardian.com/books/2022/dec/18/juana-the-mad-a-short-story-by-tessa-hadley\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/18/british-sculptor-turner-prize-tony-cragg-turkish-gallery-istanbul", "title": "Top British sculptor hits back in censorship row over loan to Turkish gallery", "date_published": "2022-12-18 09:00:46+00:00", "description": "<p>Turner prize-winner Tony Cragg defends decision to lend to Istanbul museum after criticism from leading Turkish artist </p><p>One of Britain’s leading sculptors, Sir Tony Cragg, has defended his decision to loan a work to Istanbul’s top art museum following criticism from a prominent Turkish artist of the country’s restrictions on freedom of expression.</p><p>After four years in construction, the new five-storey, 15,000 sq metre Istanbul Modern will open this year, with Cragg’s white sculpture, entitled <em>Runner</em>, in a prime spot at its entrance.</p> <a href=\"https://www.theguardian.com/world/2022/dec/18/british-sculptor-turner-prize-tony-cragg-turkish-gallery-istanbul\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/18/good-news-for-the-worlds-autocrats-eu-sleaze-is-a-huge-own-goal-for-democracy", "title": "Good news for the world’s autocrats – EU sleaze is a huge own goal for democracy", "date_published": "2022-12-18 09:00:45+00:00", "description": "<p>The Qatargate scandal shows how insider corruption, influence-peddling and money-politics can erode public trust</p><p>It’s the betrayal that hurts most. Democracy is a vulnerable plant, easily neglected and weakened by parasites. It has faced overt, sometimes lethal attacks in 2022 from autocrats in places as far apart as the US, Brazil, China, Russia, Iran and Turkey. Yet when democracy is silently corrupted and subverted from within – that’s the real killer.</p><p>In any international democracy league table, Europe’s parliament of 27 nations might be expected to score well. Likewise, a vice-president of that august body should surely be beyond reproach. And it may be that <a href=\"https://www.theguardian.com/world/2022/dec/14/greek-mep-eva-kaili-at-centre-of-qatar-corruption-inquiry-has-hearing-postponed\" title=\"\">Eva Kaili, a Greek Socialist MEP</a> who was sacked from her VP post and arrested last week is wrongly accused – as she maintains.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/18/good-news-for-the-worlds-autocrats-eu-sleaze-is-a-huge-own-goal-for-democracy\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/food/2022/dec/18/annalisa-barbieri-notes-on-chocolate-the-shop-that-makes-copenhagen-wonderful", "title": "Notes on chocolate: the shop that makes Copenhagen even more wonderful", "date_published": "2022-12-18 09:00:45+00:00", "description": "The marzipan is exquisite at Alida Marstrand<p>Since there’s very little point telling you about chocolate that won’t get to you in time for Christmas, I’m going to tell you the story of a chocolatier I found in Copenhagen. I was on the way to the <a href=\"https://designmuseum.dk/en/\" title=\"\">Danish Design Museum</a>, the first half of which seemed more about philosophical questions rather than design (‘Should you be able to order your own death?’). There, half peaking out on to the pavement was a little chocolate shop. It was the sort you had to commit to, walking down the stairs, into… the unknown. </p><p>So I went to the Design Museum first and Googled the shop – <strong><a href=\"http://www.marstrandchokolade.dk/#/\" title=\"\">Alida Marstrand</a></strong><a href=\"http://www.marstrandchokolade.dk/#/\" title=\"\"> </a>– and it seemed really promising. On the way back we ventured in.</p> <a href=\"https://www.theguardian.com/food/2022/dec/18/annalisa-barbieri-notes-on-chocolate-the-shop-that-makes-copenhagen-wonderful\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/18/after-a-year-when-the-only-certainty-was-tory-chaos-could-2023-be-even-worse", "title": "After a year when the only certainty was Tory chaos, could 2023 be even worse? | Andrew Rawnsley", "date_published": "2022-12-18 08:30:44+00:00", "description": "Britain has become trapped in a doom loop of perpetual crisis under the Conservatives<p>Doctors assessing people for signs of dementia have traditionally asked their patients: “Who is the prime minister?” Some health professionals report that they stopped using that question this year. There has been so much manic mayhem at the apex of politics that it has been a struggle to keep up even for those in full possession of their faculties.</p><p>2022 was the year of two leadership coups, three prime ministers, four chancellors, five education secretaries, six fiscal events and more than 30 exits from the cabinet. The doors of Whitehall revolved so fast that ministers barely had time to hang up their coats before it was time to leave the building. The only certainty was chaos. I would call it laughable were not the consequences so dismal. A year of <a href=\"https://www.theguardian.com/politics/2022/jul/01/scandal-timeline-tory-sleaze-boris-johnson\" title=\"\">cascading scandals</a> and <a href=\"https://www.theguardian.com/politics/2022/oct/20/from-fighter-to-quitter-timeline-of-liz-trusss-premiership\" title=\"\">whipsawing policies</a> has also been 12 months in which vital public services have come dangerously close to collapse and food banks haven’t been able to cope with the demand for their help.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/18/after-a-year-when-the-only-certainty-was-tory-chaos-could-2023-be-even-worse\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/18/im-hosting-my-first-christmas-does-that-make-me-an-adult", "title": "This year, it’s Christmas round at mine | Eva Wiseman", "date_published": "2022-12-18 08:30:44+00:00", "description": "Despite nudging into my 40s and having two children, I am finally hosting my first Christmas. Does this mean that I am finally an adult?<p>For the first time in my life, this year I am hosting Christmas. I know – this is usually something a person does when they are half my age, when they have recently moved out of home and have a boxfresh roasting tin and are keen to impress their adulthood on a parent or aunt. Not when they are, like me, a rattled 40-odd-year-old who should surely have already shifted long ago into the maternal role befitting of her gait and shoe style.</p><p>But no, until now, I have gladly remained a child, slipping gratefully into the familiar well in my parents’ sofa, beside the cat, beside the radiator. “Can I help?” I whisper without guts or commitment towards the kitchen, occasionally heaving myself up to shush some sprouts around a pan or dangle a toy above a baby, the telly on, the sandwiches coming, ideally a little <em><a href=\"https://www.theguardian.com/tv-and-radio/poirot\" title=\"\">Poirot</a></em> with my tea.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/18/im-hosting-my-first-christmas-does-that-make-me-an-adult\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/society/2022/dec/18/global-surrogacy-agency-accused-of-putting-women-at-risk-with-unethical-medical-procedures", "title": "Global surrogacy agency accused of putting women at risk with ‘unethical’ medical procedures", "date_published": "2022-12-18 08:00:46+00:00", "description": "<p>Overseas branches of UK-registered firm also let clients pick their baby’s sex, investigation finds</p><p>Women recruited by an international surrogacy agency to carry babies for wealthy clients are being asked to undergo “unethical” medical procedures that increase their risk of serious complications, an investigation suggests.</p><p>New Life Global claims to have brokered more than 7,000 cross-border deals between clients mostly based in the UK, western Europe and North America and surrogates in countries including Mexico, Colombia, India, Ukraine and Georgia.</p> <a href=\"https://www.theguardian.com/society/2022/dec/18/global-surrogacy-agency-accused-of-putting-women-at-risk-with-unethical-medical-procedures\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/18/power-to-the-people-the-neighbours-turning-their-london-street-into-a-solar-power-station", "title": "Power to the people: the neighbours turning their London street into a solar power station", "date_published": "2022-12-18 08:00:45+00:00", "description": "<p>Lynmouth Road, Walthamstow, is about to become its own power station, with solar energy for 30 homes. Now the artists responsible want us all to change how we heat our homes</p><p>Lynmouth Road appears unremarkable. It consists largely of redbrick Victorian terraces. There are similar streets throughout the area, in Walthamstow, northeast London. Some houses are pebble-dashed. Some have doors painted in contemporary grey. There are wind chimes, geraniums in boxes, wheelie bins and the occasional cat sitting on a gate post. The only unusual feature is the number of windows displaying an A4 poster with the words “Power Station” printed in the font used by polling stations.</p><p>Power, in the sense of the energy, is at the forefront of everyone’s mind. Energy bills have reached record highs and are still rising, with the war in Ukraine highlighting how fragile energy supplies can be. This year’s <a href=\"https://www.theguardian.com/environment/cop27\" title=\"\">Cop27 </a>climate conference promised money to poorer countries to assist with damage caused by climate change, yet no agreement was reached on phasing out fossil fuels. The idea of cleaner power, generated closer to home, should feel like an obvious goal. But, at the moment, there are no large-scale programmes dedicated to making it happen. Instead, there are people like Dan Edelstyn and Hilary Powell.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/18/power-to-the-people-the-neighbours-turning-their-london-street-into-a-solar-power-station\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/18/strikes-baleful-legacy-of-12-year-obsession-with-tax-cuts-and-small-state", "title": "The strikes are a baleful legacy of a 12-year obsession with tax cuts and a small state | Will Hutton", "date_published": "2022-12-18 08:00:45+00:00", "description": "David Cameron first took aim at public sector workers in 2010. Continued Conservative policies have brought them to their knees<p>The anger, despair, hardship and sense of being trapped that drove last week’s nurses’ strike, the first in the history of the Royal College of Nursing, with ambulance workers and other large parts of the NHS joining them this Wednesday, did not come out of a clear blue sky. They have been years in the making, as has the industrial action blighting rail, the tube and the post office and those planned in schools and the civil service early in the new year.</p><p>For contemporary Tory governments are singularly bad and unsympathetic employers. Although Liz Truss and Kwasi Kwarteng have been dispatched, their libertarian hostility to the state, to taxes and to the very concept of public endeavour is shared, if less moronically, by Rishi Sunak and Jeremy Hunt.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/18/strikes-baleful-legacy-of-12-year-obsession-with-tax-cuts-and-small-state\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/18/unsolved-quadruple-killing-grips-university-idaho-investigation", "title": "‘Everyone’s on edge’: unsolved quadruple killing grips Idaho college town", "date_published": "2022-12-18 08:00:45+00:00", "description": "<p>A month after four university students were stabbed to death, the case remains unsolved and the killer, or killers, at large</p><p>Christmas looms, but an eerie and decidedly nonfestive mood haunts the snowy college town of Moscow, Idaho. Locksmiths’ vans have replaced roving carolers. Some request pepper spray or guns as Christmas gifts. Businesses close early. Few walk alone, especially at night.</p><p>More than a month after four local university students were inexplicably stabbed to death in the same home, the case remains unsolved and the killer, or killers, at large. Police have named no suspect, found no murder weapon, and offered no motive.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/18/unsolved-quadruple-killing-grips-university-idaho-investigation\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/18/world-cup-final-argentina-messi-maradona-victory-france", "title": "‘Your life depends on whether Argentina wins’: Buenos Aires at fever pitch as Messi’s team face France", "date_published": "2022-12-18 08:00:45+00:00", "description": "<p>In the capital, where Maradona is worshipped as a god, World Cup victory would take on a spiritual dimension</p><p>In June, Tomás Kuklis visited family in his native Argentina from his home in New York. When conversation turned to the upcoming World Cup, it brought back the happiest memories of his childhood. He was rocked by a wave of nostalgia for friends and food, but especially for his lifelong passion: football.</p><p>So, he took a bold decision: he would sell all his things and move back to Buenos Aires to watch the tournament. It was a choice some might consider radical. But in this South American country where football is arguably a spiritual experience, it felt like keeping the faith.</p> <a href=\"https://www.theguardian.com/world/2022/dec/18/world-cup-final-argentina-messi-maradona-victory-france\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/film/2022/dec/18/avatar-the-way-of-water-james-cameron-3d-sequel-review-damp-squib-return-to-pandora", "title": "Avatar: The Way of Water review – a thunderously underwhelming damp squib of a return", "date_published": "2022-12-18 08:00:44+00:00", "description": "<p>James Cameron’s long-awaited Avatar sequel is a lumbering three-hour slog featuring characters seemingly designed by a stoned sixth former</p><p>Astonishing! Enthralling! Exciting! Immersive! None of these words could sensibly be applied to the three-and-a-quarter-hour Wet Smurfahontas stodgeathon that is <em>Avatar: The Way of Water</em>. A lumbering, humourless, tech-driven damp squib of a movie, this long-awaited (or dreaded?) sequel to one of the highest grossing films of all time builds upon the mighty flaws of its predecessor, delivering a patience-testing fantasy dirge that is longer, uglier and (amazingly) even more clumsily scripted than its predecessor, blending trite characterisation with sub-<a href=\"https://www.theguardian.com/music/gallery/2015/oct/21/roger-dean-somewhere-near-here-prog-rock-album-covers-in-pictures\">Roger Dean</a> 70s album-cover designs and thunderously underwhelming action sequences. In water.</p><p>We pick up several years after the wholly forgettable antics of 2009’s <em><a href=\"https://www.theguardian.com/film/2009/dec/20/avatar-review\">Avatar</a></em>. On the distant world Pandora, Jake Sully (Sam Worthington) has gone native, raising a family with Neytiri (Zoe Saldaña) after shedding his human skin to inhabit his alien avatar (see previous film). When the “sky people” of Earth come looking for a fight, among other things, the forest-friendly Sullys are forced to flee to distant archipelagos where the water-tribes dwell. Here, they must abandon their tree-hugging lifestyle and learn the ways of the reef people, who have thicker tails and are a bit more turquoise. Really.</p> <a href=\"https://www.theguardian.com/film/2022/dec/18/avatar-the-way-of-water-james-cameron-3d-sequel-review-damp-squib-return-to-pandora\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/18/january-6-committee-last-meeting-donald-trump", "title": "January 6 committee to use last meeting to refer Trump to justice department", "date_published": "2022-12-18 08:00:44+00:00", "description": "<p>Lawmakers expected to outline findings and vote to issue criminal and civil referrals on Monday</p><p>The House January 6 select committee plans to use its final meeting on Monday to refer <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a>, among others, to the justice department for conduct connected to the former president’s efforts to overturn the 2020 election.</p><p>As it prepares to release its voluminous investigative report, the panel is expected to use its meeting, announced for 1pm, to take several conclusive steps. These include outlining an executive summary of its findings and legislative recommendations, voting to formally adopt the report, and then voting to issue criminal and civil referrals.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/18/january-6-committee-last-meeting-donald-trump\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/18/league-of-the-lexicon-the-ultimate-word-game-exclusive-christmas-quiz", "title": "League of the Lexicon: the ultimate word game – exclusive Christmas quiz", "date_published": "2022-12-18 08:00:44+00:00", "description": "<p>Test your knowledge of language with these seasonal teasers devised by the creator of League of the Lexicon, the most-backed word game ever on Kickstarter</p><p><a href=\"https://www.waterstones.com/product/league-of-the-lexicon/5070000675800\">League of the Lexicon is available in-store at Waterstones</a></p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/18/league-of-the-lexicon-the-ultimate-word-game-exclusive-christmas-quiz\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/18/cosmetic-surgeon-botox-fillers-instagram-generation-safety-concerns", "title": "‘They’ve lost the plot’: leading cosmetic surgeon says under-30s are overdoing Botox and fillers", "date_published": "2022-12-18 08:00:44+00:00", "description": "<p>Instagram generation views ‘tweakments’ as a status symbol says King of Botox, but safety concerns won’t go away</p><p>A leading cosmetic doctor known as the “king of Botox” claims young people have “lost the plot” by overdoing treatments in an attempt to recreate filtered social media aesthetics in real life. He also criticised colleagues, some of whom he said have had so much work done he no longer recognises them, for fuelling the trend.</p><p>While Botox and fillers were once most popular among older patients seeking discreet anti-ageing solutions, Dr Michael Prager said that a “visibly enhanced” look had become a fashion trend among under-30s who wanted the work to show.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/18/cosmetic-surgeon-botox-fillers-instagram-generation-safety-concerns\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/18/ukraine-museums-scythian-gold-russian-looters-putin", "title": "Ukraine’s museums keep watch over priceless gold in bid to halt Russian looters", "date_published": "2022-12-18 08:00:43+00:00", "description": "<p>Experts monitoring the loss of Scythian artefacts have been shocked at scale of theft by Putin’s forces</p><p>The people the Greeks called Scythians were formidable warriors and nomads who dominated the Eurasian steppe for more than 1,000 years from about 800BC – long before the creation of national borders.</p><p>The fabulous gold weapons and ornaments they left behind ended up in museums across the region, many of them in Ukraine. Since Russian troops invaded Ukraine in February, however, much Scythian gold – along with millions of other priceless artefacts – has been looted or “evacuated”.</p> <a href=\"https://www.theguardian.com/world/2022/dec/18/ukraine-museums-scythian-gold-russian-looters-putin\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/who-scored-blog/2022/dec/18/argentina-france-world-cup-finalists-messi-alvarez-fernandez-martinez-mbappe-giroud-griezmann-lloris", "title": "Argentina v France: rating the two World Cup finalists | Ben McAleer", "date_published": "2022-12-18 07:30:43+00:00", "description": "<p>Who will win: Messi, Álvarez, Fernández, Acuña and Martínez or Mbappé, Giroud, Griezmann, Hernández and Lloris?</p><p>By <a href=\"https://twitter.com/BenMcAleer1\">Ben McAleer</a> for <a href=\"http://www.whoscored.com/\">WhoScored</a></p><p>So, the World Cup final is set. Argentina will play France on Sunday in Doha. Both sides are trying to become champions for the third time, with France aiming to become the third country – after Italy in 1938 and Brazil in 1962 – to retain the trophy. Which team has the best line-up?</p> <a href=\"https://www.theguardian.com/football/who-scored-blog/2022/dec/18/argentina-france-world-cup-finalists-messi-alvarez-fernandez-martinez-mbappe-giroud-griezmann-lloris\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/18/i-understand-why-joanna-lumley-says-women-must-be-tougher-they-already-are", "title": "I understand why Joanna Lumley says women must be tougher. The thing is, they already are | Emma John", "date_published": "2022-12-18 07:30:43+00:00", "description": "Calling out sexual harassment is not soft or ‘being a victim’, whatever the actress may claim<p>Sometimes, being absolutely fabulous isn’t enough to save you from the backlash. So Joanna Lumley discovered last week, after making some scathing remarks on what she perceives as a fashion for victimhood.</p><p>Asked in an interview whether she considered herself a role model for feminism, Lumley nimbly dodged the question, before catching herself on the edge of it and tumbling into a deep hole. She told <em>Prospect</em> magazine that women “were a lot tougher” when she was young and that “it didn’t matter” when you got whistled at in the street back then. “If someone was groping, we slapped their hands,” said Lumley. “We were quite tough and looked after ourselves.”</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/18/i-understand-why-joanna-lumley-says-women-must-be-tougher-they-already-are\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/18/qatar-2022-shifting-sands-where-the-real-and-the-almost-real-collide-world-cup", "title": "Qatar 2022: Shifting sands where the real and almost-real collide", "date_published": "2022-12-18 07:30:43+00:00", "description": "<p>Fifa have rolled out the ersatz green carpet for the parody World Cup featuring goal actualisations and constant posing</p><p>It is one of the strangest minor stories of the strangest of World Cups. Shortly before the opening game, <a href=\"https://www.theguardian.com/football/2022/nov/20/qatar-ecuador-world-cup-match-report\" title=\"\">Qatar versus Ecuador</a>, a group of men in uniform Qatari team-coloured T-shirts emerged en masse into a vacant area behind the goal and started making noise, doing choreographed dances and leaping about with apparently genuine excitement, something they kept up through the game irrespective of what was happening on the pitch.</p> <a href=\"https://www.theguardian.com/football/2022/dec/18/qatar-2022-shifting-sands-where-the-real-and-the-almost-real-collide-world-cup\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/18/world-cup-2022-diary-final-trip-to-truly-terrible-al-bayt-stadium-qatar-2022", "title": "World Cup 2022 diary: a final trip to the truly terrible Al Bayt Stadium", "date_published": "2022-12-18 07:30:43+00:00", "description": "<p>France take on Morocco at the boring house of pain, plus stray cats, more Infantino and a heavy bout of Doha flu</p><p>Sick. Sad. Drained. Coughing up screeds of green phlegm. The morning after <a href=\"https://www.theguardian.com/football/2022/dec/10/england-france-world-cup-quarter-final-match-report\" title=\"\">England’s defeat by France</a> coincides with a heavy case of Doha flu. This has been a place of coughs and chills. Doctors say Doha has basically never had this many people in it and people = germs. Descriptions from sufferers range from being run over by a truck to my own strain, which feels like being expertly beaten up by special service agents using bludgeons, snooker cues and socks full of wet sand. My flatmate Jonathan Wilson asks a woman in the lobby for help finding a doctor. She marches upstairs, squeezes my arm and says firmly, yes, you have a fever, you will be fine, drink one cup of coffee. OK, thanks. So … you’re a doctor? “No,” she says. “But I am Indian.”</p> <a href=\"https://www.theguardian.com/football/2022/dec/18/world-cup-2022-diary-final-trip-to-truly-terrible-al-bayt-stadium-qatar-2022\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/18/football-australia-vows-to-weed-out-fans-who-stormed-pitch-during-melbourne-derby", "title": "Police vow to prosecute A-League pitch invaders as FA pledges to ‘weed’ them out of game", "date_published": "2022-12-18 07:24:17+00:00", "description": "<ul><li>‘Angry and irritated’ FA boss declares ‘there is no place in our sport for this’</li><li>Governing body issues show cause notice to Victory and vows to identify, name and sanction fans</li><li><a href=\"https://www.theguardian.com/football/2022/dec/17/melbourne-a-league-derby-abandoned-as-fans-storm-pitch-and-keeper-attacked\">Melbourne A-League derby abandoned as fans storm pitch</a></li><li><a href=\"https://www.theguardian.com/australia-news/live/2022/dec/18/australia-live-news-update-fa-investigation-melbourne-derby-fans-fotball-recall-spinach-source-flights-qantas-twitter-covid-cases\">Follow our Australia news live blog for the latest updates</a></li></ul><p>Victoria police is reviewing footage of the pitch invasion during Saturday’s A-League Men’s Melbourne derby and has vowed officers will be “knocking on doors very soon”.</p><p>Three alleged assaults are under investigation – to City’s goalkeeper, Thomas Glover, a referee and a Channel Ten camera operator.</p><p><strong><a href=\"https://www.theguardian.com/australia-news/2022/oct/29/email-newsletters-guardian-australia-best-daily-news-emails-newsletter-free-sign-up-inbox-subscribe-headlines?CMP=copyembed\">Sign up for Guardian Australia’s free morning and afternoon email newsletters for your daily news roundup</a></strong></p> <a href=\"https://www.theguardian.com/football/2022/dec/18/football-australia-vows-to-weed-out-fans-who-stormed-pitch-during-melbourne-derby\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/18/australia-south-africa-first-test-day-two-report", "title": "Australia enter history books with Test victory over South Africa inside two days", "date_published": "2022-12-18 07:20:02+00:00", "description": "<ul><li>Australia 152 and 99; South Africa 218 and 35-4 </li><li>First time since 1931 that a Test in Australia has ended in two days</li></ul><p>The last time Pat Cummins played South Africa, he toiled for 46.5 overs out of Australia’s 241.5, prising out nine wickets in the match while being set 612 runs to win and beaten by almost as many. It was Johannesburg in 2018, and punishment for the sandpaper debacle was first levied on the field. “We don’t always have to finish a Test in four days,” smiled South Africa’s future captain Dean Elgar. </p><p>In their next meeting in Brisbane this week, Cummins bowled a breezy 25 overs across two innings, picking up seven wickets on his way to starting this three-match series by captaining a win. </p> <a href=\"https://www.theguardian.com/sport/2022/dec/18/australia-south-africa-first-test-day-two-report\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/stage/2022/dec/18/new-york-broadway-museum-times-square", "title": "‘It’s kind of crazy there wasn’t one’: inside the new Museum of Broadway", "date_published": "2022-12-18 07:04:42+00:00", "description": "<p>A splashy museum in New York pays tribute to the city’s long relationship with theatre from West Side Story to Hamilton</p><p>It is a patchwork of colour and craft, its 8in squares celebrating productions from the 1980s – Annie, Cats, Chess, Carousel, Les Misérables, Macbeth, Me and My Girl, Oh! Calcutta!, Starlight Express. One square, for the musical The Rink, is signed by stars Liza Minnelli and Chita Rivera.</p><p>But the Aids quilt, among more than a thousand objects and photographs displayed at the <a href=\"https://www.themuseumofbroadway.com/\">Museum of Broadway</a> in New York, is also a mourning shroud. It was handcrafted by wardrobe teams of various productions to express grief and support for a generation of artists devastated by the HIV epidemic.</p> <a href=\"https://www.theguardian.com/stage/2022/dec/18/new-york-broadway-museum-times-square\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/18/russia-may-try-to-re-enact-its-early-invasion-plans-of-ukraine-on-anniversary-of-war", "title": "Russia ‘may try to re-enact its early invasion plans of Ukraine on anniversary of war’", "date_published": "2022-12-18 07:00:44+00:00", "description": "<p>Military commander warns Moscow may again try to seize Kyiv after invading from Belarus in the north</p><p>Russia may attempt to re-enact a version of its original invasion plans, Ukrainian military officials believe, as Volodymyr Zelenskiy warned this weekend Vladimir Putin still has enough missiles to order more heavy strikes.</p><p>The Ukrainian president was speaking in the aftermath of the latest wave of missiles to target his country’s critical energy infrastructure after <a href=\"https://www.theguardian.com/world/2022/dec/16/russia-begins-mass-air-strike-in-apparent-move-to-destroy-ukraines-power-grid\">Russia launched 98 rockets at 20 cities and towns on Friday.</a></p> <a href=\"https://www.theguardian.com/world/2022/dec/18/russia-may-try-to-re-enact-its-early-invasion-plans-of-ukraine-on-anniversary-of-war\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/18/workable-proposals-no-immigration-policy-theatre-of-cruelty", "title": "Workable proposals? No, western immigration policy is a theatre of cruelty | Kenan Malik", "date_published": "2022-12-18 07:00:44+00:00", "description": "Another week and more drownings in the Channel. Politicians’ words of regret are hypocritical: they chose not to prevent them<p>A decade ago, on 3 October 2013, a boat carrying migrants caught fire and sank off the Italian island of Lampedusa; <a href=\"https://www.theguardian.com/world/2014/mar/22/lampedusa-boat-tragedy-migrants-africa\" title=\"\">366 people died</a>. It was not the first migrant disaster in the Mediterranean – at least 12,000 migrants had drowned in the previous 20 years. But the sheer scale of the Lampedusa tragedy generated widespread horror.</p><p>The Italian government declared a national day of mourning. “I hope that this will be the last time we see a tragedy of this kind,” said Jean-Claude Mignon, head of the Council of Europe’s parliamentary assembly.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/18/workable-proposals-no-immigration-policy-theatre-of-cruelty\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/tv-and-radio/2022/dec/18/clive-myrie-we-need-solace-wherever-we-can-get-it", "title": "Clive Myrie: ‘We need solace wherever we can get it’", "date_published": "2022-12-18 07:00:43+00:00", "description": "<p>The Mastermind host on why this year we need Christmas more than ever, his admiration for the Ukrainian president and the reason we all love quizzes</p><p>Clive Myrie has just emerged from having his photograph taken – the <em><a href=\"https://www.bbc.co.uk/programmes/b006mk1s\">Mastermind</a></em> chair, tangled up in tinsel, has turned sleigh, yanked along by cuddly reindeer. I meet him as he is having fake snow dusted from his hair and is, in his good-humoured way, getting into the Christmas spirit, singing: “Let it snow, let it snow, let it snow…” under his breath. Myrie is a top-notch journalist and a good sport. He is 58 and has worked for more than 30 years at the BBC, familiar to viewers as a distinguished foreign correspondent and as the quizmaster <a href=\"https://www.theguardian.com/media/2021/mar/22/clive-myrie-to-replace-john-humphrys-as-mastermind-host\">who took over in 2021</a> on <em>Mastermind</em>. Now he is briskly changing out of his Christmas trousers and back into mufti: “You don’t mind, do you?” Not at all, I say, and launch into quizzing him about quizzes: how far do quizzes go back in human history? “Erm… Roman times? I don’t know. Victorians loved a quiz… didn’t they?” A comically stumped moment follows. He sits down. Is this “pass” or double fail – I can’t answer my own question (over to you, readers)?</p><p>All right, then: why do we love quizzes so much? “We like to be reminded how smart we are and, because we’re a self-effacing nation, we’re not embarrassed by not getting something right… My whole family would watch <em>University Challenge</em> and <em>Mastermind</em> and if you got a few answers right, you’d think: ‘Hey!’ If you didn’t, it’s only telly – it’s a bit of fun.” I’d have thought the fun was more complicated and had been about to explore the minor mortifications of quizzes. For it is surely no accident that <em>Mastermind</em>, which recently <a href=\"https://www.theguardian.com/tv-and-radio/2022/sep/14/from-a-gestapo-interrogation-to-the-spice-girls-how-mastermind-has-thrilled-quizzers-for-50-years-bbc\">celebrated its 50th anniversary</a>, has a torture chamber of a set with inquisitorial chair, impenetrable darkness and a pitiless searchlight on the quizee (if such a word may be allowed).</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/18/clive-myrie-we-need-solace-wherever-we-can-get-it\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/18/cop15-brokers-talk-up-hopes-for-nature-deal-as-conference-enters-home-straight-aoe", "title": "Cop15 brokers talk up hopes for nature deal as conference enters final stretch", "date_published": "2022-12-18 07:00:43+00:00", "description": "<p>Agreement will need to strike consensus over sources and mechanisms to fund conservation</p><p>The French president, Emmanuel Macron, has called on countries to “go big” in negotiations at Cop15, as the talks to secure the next decade of targets to stop the destruction of nature reach the final stages.</p><p>“The most vulnerable countries are home to biodiversity treasures. We need to increase our funding to support them, with no expense spared! France will double its funding to 1 billion euros per year. COP 15 stakeholders: get on board and join the fight!” he tweeted.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/18/cop15-brokers-talk-up-hopes-for-nature-deal-as-conference-enters-home-straight-aoe\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/artanddesign/2022/dec/18/the-big-picture-young-priests-having-a-ball-in-the-snow", "title": "The big picture: trainee priests having a ball in the snow", "date_published": "2022-12-18 07:00:43+00:00", "description": "<p>Photographer Mario Giacomelli’s 1960s shot taken during a rare snowfall on the Adriatic coast captures the distractions of the contemplative life</p><p>It doesn’t snow very often on the Adriatic coast of Italy, perhaps two or three days a year. The rarity of the event helps to explain some of the joy of Mario Giacomelli’s famous pictures of young priests in his home town of Senigallia, enjoying some winter fun in the early 1960s. Scenes like this one were something of a gift for Giacomelli, who loved the possibilities of silhouette, the graphic simplicities of true black and white. The contrast, accentuated by the photographer’s slow shutter speeds and hand printing, gives the pictures their otherworldly dimension, as if the young priests are floating in the air.</p><p>The image is a natural fit in a new collection of photographs exploring the idea of “presence”. Its ethereal quality is given substance, grounded by the surprising informality of the young men’s interaction. Giacomelli spent a couple of years winning the trust of the trainee priests, so that he could capture something of the intimacy of their community. His ambition, he said, was to discard “the conventional rules in my treatment of the subject, to reveal the naked man”.</p><p><em><a href=\"https://aperture.org/books/presence-the-photography-collection-of-judy-glickman-lauder/\">Presence: The Photography Collection of Judy Glickman Lauder</a></em><a href=\"https://aperture.org/books/presence-the-photography-collection-of-judy-glickman-lauder/\"> is published by Aperture (£40)</a></p> <a href=\"https://www.theguardian.com/artanddesign/2022/dec/18/the-big-picture-young-priests-having-a-ball-in-the-snow\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/politics/2022/dec/18/anger-brexit-tories-red-wall-conservatives-reform-uk-party-immigration", "title": "‘We didn’t vote for this’: anger over Brexit failures is haunting the Tories", "date_published": "2022-12-18 07:00:42+00:00", "description": "<p>All along the red wall, those who gave the Conservatives their election victory in 2019 feel betrayed, with some turning to the Reform UK party to deliver on policies such as immigration</p><p>• Read more: <a href=\"https://www.theguardian.com/politics/2022/dec/18/labour-voters-tories-failures-conservative-brexit\">Labour needs more than voters’ anger</a></p><p></p><p>Three years ago last week, Boris Johnson stormed to victory in an election fought by the Conservatives under the simple slogan: <a href=\"https://www.theguardian.com/politics/2019/dec/13/bombastic-boris-johnson-wins-huge-majority-on-promise-to-get-brexit-done\" title=\"\">“Get Brexit done.</a>” The morning after, the then prime minister urged everyone to “find closure” on the European question that had split his party and country for so long.</p><p>He called on the British people to unite, to “let the healing begin” and to focus on the NHS. The Tories had <a href=\"https://www.theguardian.com/politics/2019/dec/13/labours-red-wall-demolished-by-tory-onslaught\" title=\"\">broken through the “red wall”</a>. They seemed all-powerful. It was Labour that faced existential questions.</p> <a href=\"https://www.theguardian.com/politics/2022/dec/18/anger-brexit-tories-red-wall-conservatives-reform-uk-party-immigration\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/18/sunday-with-singer-olly-murs-i-am-obsessed-with-crunchy-nut-cornflakes", "title": "Sunday with Olly Murs: ‘I’m obsessed with Crunchy Nut cornflakes at the moment’", "date_published": "2022-12-18 06:45:42+00:00", "description": "The singer on his Bake Off-themed Sundays, box at Manchester United and prima donna dog<p><strong>Sunday morning?</strong> I try to lie in, but me and the Mrs are always out of bed by 8.30am, after probably an hour of lazing about.</p><p><strong>Sunday food?</strong> It’s my cheat day. I eat clean and train all week, so this is my release. I’m obsessed with Crunchy Nut cornflakes at the moment, so that’s breakfast. Lunch is a loaf of tiger bread with ham, cheese and crisps. And then I have whatever is on <em>Bake Off</em> for dinner.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/18/sunday-with-singer-olly-murs-i-am-obsessed-with-crunchy-nut-cornflakes\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/18/israel-deports-palestinian-french-human-rights-lawyer-salah-hamouri", "title": "Israel deports Palestinian-French human rights lawyer Salah Hamouri", "date_published": "2022-12-18 06:36:15+00:00", "description": "<p>Hamouri, a Jerusalem resident without Israeli citizenship, was detained under administrative detention without charge in March</p><p>Israel has deported French-Palestinian human rights lawyer Salah Hamouri, accusing him of security offences against the state of Israel, the Israeli interior ministry said in a statement.</p><p>Hamouri was escorted early on Sunday morning to the airport, where he boarded a flight to France, with his campaign saying there was no legal recourse for him to take.</p> <a href=\"https://www.theguardian.com/world/2022/dec/18/israel-deports-palestinian-french-human-rights-lawyer-salah-hamouri\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/live/2022/dec/18/russia-ukraine-war-power-restored-to-6-million-ukrainians-after-strikes-says-zelenskiy-live", "title": "Russia-Ukraine war: power restored to 6 million Ukrainians after strikes, says Zelenskiy – live", "date_published": "2022-12-18 06:32:25+00:00", "description": "<p>Move follows wave of Russian strikes on power grid as Putin met with top military commanders overseeing the country’s invasion of Ukraine</p><ul><li><a href=\"https://www.theguardian.com/world/2022/dec/18/russia-ukraine-war-at-a-glance-what-we-know-on-day-298-of-the-invasion\">What we know on day 298 of the invasion</a></li></ul> <a href=\"https://www.theguardian.com/world/live/2022/dec/18/russia-ukraine-war-power-restored-to-6-million-ukrainians-after-strikes-says-zelenskiy-live\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/18/photo-taken-by-rabbis-wife-in-1931-symbolising-jewish-defiance-of-the-nazis-comes-home", "title": "Photo taken by rabbi’s wife in 1931 symbolising Jewish defiance of the Nazis comes home", "date_published": "2022-12-18 06:30:42+00:00", "description": "<p>Image was among the possessions the Posner family fled Kiel with and now returns to the city as part of an exhibition</p><p>When she used her compact camera to capture the view from her window in the German city of Kiel one December afternoon in 1931, Rosi Posner was doing more than just taking a snapshot. In the foreground is a brass menorah, the candlestick used to mark the Jewish festival of Hanukah; in the near background, the chilling image of a swastika flag flying prominently from the Nazi headquarters that had opened up opposite her flat earlier that year.</p><p>“Most Jews, after the rise of the Nazis, pulled their curtains shut so that the chanukiah (menorah) couldn’t be seen from the street. But she was determined to show she and her husband were not afraid,” says Nava Gilo, Rosi’s granddaughter.</p> <a href=\"https://www.theguardian.com/world/2022/dec/18/photo-taken-by-rabbis-wife-in-1931-symbolising-jewish-defiance-of-the-nazis-comes-home\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/uk-news/2022/dec/18/us-accused-of-abduction-of-lockerbie-bomb-suspect-from-libya", "title": "US accused of illegal abduction of Lockerbie bomb suspect from Libya", "date_published": "2022-12-18 06:00:43+00:00", "description": "<p>Ex-intelligence officer’s family say he was ‘kidnapped’ by militia before being secretly flown out of country</p><p>The abduction of a former Libyan intelligence operative accused of preparing the bomb that brought down <a href=\"https://www.theguardian.com/uk/lockerbie\" title=\"\">Pan Am flight 103 over Lockerbie</a>, Scotland, in 1988 and his transfer into US custody raises concerns about a renewed willingness in Washington to flout international law to hunt alleged terrorist fugitives.</p><p>The family of <a href=\"https://www.theguardian.com/uk-news/2022/dec/12/lockerbie-bomb-suspect-masud-us-custody\" title=\"\">Mohammed Abouagela Masud</a>, who appeared in a US courtroom last week, have described how the 71-year-old was “kidnapped” from his home in Tripoli’s Abu Salem neighbourhood around 1am on 17 November by armed gunmen sent by a notorious local militia commander. He was then held by another militia for two weeks before being handed over to US agents.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/18/us-accused-of-abduction-of-lockerbie-bomb-suspect-from-libya\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/18/trump-politically-dead-sort-of", "title": "Is Trump finally politically dead? Sort of | Robert Reich", "date_published": "2022-12-18 06:00:42+00:00", "description": "<p>Republican lawmakers know Trump is unpopular – but some feverishly pro-Trump voters have the party in a bind</p><p>As Congress ends its first post-Trump term, the biggest political question hanging over America is: When will the Republican party finally reach its anti-Trump tipping point – when a majority of Republican lawmakers disavow him?</p><p>Again and again, it looks like the tipping point is near but the party remains under Trump’s thumb.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/18/trump-politically-dead-sort-of\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/music/2022/dec/18/live-and-let-die-james-bond-theme-paul-mccartney", "title": "Live and let fly: the tall tale of Paul McCartney’s 007 theme song is revealed", "date_published": "2022-12-18 06:00:42+00:00", "description": "<p>Newly discovered archive material shows former Beatle was always producers’ choice to sing during credits for Live and Let Die</p><p>It had always seemed inconceivable that the James Bond producers wanted to replace Paul McCartney with another singer for <em>Live and Let Die</em>, particularly as his title song for the 1973 Roger Moore classic became a massive hit.</p><p>But the story told by Beatles record producer George Martin, and repeated by McCartney, was that the 007 producers thought McCartney’s recording with his band Wings was just a demo and they wanted a female voice.</p> <a href=\"https://www.theguardian.com/music/2022/dec/18/live-and-let-die-james-bond-theme-paul-mccartney\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/18/ask-philippa-perry-why-am-i-always-so-angry", "title": "Why am I always so angry?", "date_published": "2022-12-18 06:00:42+00:00", "description": "Learning to control impulsivity does not come naturally, says Philippa Perry. The key is in developing the right skill sets<p><em><strong>The question </strong>I’m a single woman in my </em><em>40s. I have a career and I own my flat, but I’m continually unhappy. I’ve been taking all sorts of antidepressants </em><em>on and off </em><em>for the past 20 years and have seen </em><em>different types of </em><em>therapists, doctors, psychiatrists and have attended anger management and mindfulness courses, retreats, yoga. Nothing works. My brain scans are normal.</em></p><p><em>My siblings are all happily married with kids. I’ve always wanted a family, but I’ve never had a healthy, functioning relationship with a man. My intimate relationships have been extremely volatile. I have loads of friends, but no close ones. They’ve told me they never know when I’ll kick off.</em></p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/18/ask-philippa-perry-why-am-i-always-so-angry\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/18/egyptians-face-peril-at-sea-in-dangerous-new-exodus-to-europe", "title": "‘Life is ebbing away’: Egyptians face peril at sea in dangerous new exodus to Europe", "date_published": "2022-12-18 06:00:41+00:00", "description": "<p>Poverty puts thousands into the grip of people smugglers plying a deadly trade in the Mediterranean</p><p>Youssef initially doesn’t want to remember the treacherous boat journey that took him from Egypt, then to Tobruk in Libya and finally to Italy, but he knows clearly why he left.</p><p>A young man in his 20s, Youssef is recently married and expecting a baby in a few months, and fears about the increasing cost of living in Egypt overwhelmed him. He gave in and contacted a people smuggler on the internet, using a Facebook group where those looking to migrate can post information about crossings.</p> <a href=\"https://www.theguardian.com/world/2022/dec/18/egyptians-face-peril-at-sea-in-dangerous-new-exodus-to-europe\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/live/2022/dec/18/pakistan-v-england-third-test-day-two-live", "title": "Pakistan v England: third Test, day two – live", "date_published": "2022-12-18 04:43:42+00:00", "description": "<ul><li>Updates from the second day of play in Karachi</li><li>And you can <a href=\"mailto:Taha%20Hashim%20%3Ctaha.hashim.casual@guardian.co.uk%3E\">email Taha</a> or tweet <a href=\"https://twitter.com/tahahash\">@tahahash</a></li></ul><p><strong>Now, look, I don’t want people to leave me here.</strong> But there’s some madness going on at the Gabba. </p><p>Scott Boland – that Test average is still absolutely ridiculous. </p> <a href=\"https://www.theguardian.com/sport/live/2022/dec/18/pakistan-v-england-third-test-day-two-live\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/18/england-win-third-t20-to-claim-touring-series-against-west-indies", "title": "England win third T20 to claim touring series against West Indies", "date_published": "2022-12-18 04:00:09+00:00", "description": "<ul><li>England 157-6; West Indies 140-8 | England win by 17 runs</li><li>Captain Heather Knight scores quickfire 43 off 27 balls </li></ul><p>England have added a T20 series victory to go with their ODI sweep after defeating the West Indies by 17 runs in Bridgetown.</p><p>Touring captain Heather Knight won the toss and elected to bat, contributing a quickfire 43 off 27 balls herself with able assistance from fellow right-handed batter Sophie Dunkley who collected six boundaries in her 44.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/18/england-win-third-t20-to-claim-touring-series-against-west-indies\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/18/fiji-elections-2022-bainimarama-loses-parliamentary-majority-as-count-finalised", "title": "Fiji elections 2022: Bainimarama loses parliamentary majority as count finalised", "date_published": "2022-12-18 03:25:43+00:00", "description": "<p>Sodelpa negotiating with government and People’s Alliance on who it will support with its balance of power</p><p>Fiji’s prime minister, Frank Bainimarama, has lost his parliamentary majority with the election’s final ballot count being returned.</p><p>The former opposition Social Democratic Liberal Party (Sodelpa) is in negotiations with the FijiFirst government and People’s Alliance over which it will support with its balance of power.</p> <a href=\"https://www.theguardian.com/world/2022/dec/18/fiji-elections-2022-bainimarama-loses-parliamentary-majority-as-count-finalised\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/18/north-korea-fires-ballistic-missile-off-east-coast-says-seouls-military", "title": "North Korea fires two ballistic missiles, says Seoul’s military", "date_published": "2022-12-18 03:25:39+00:00", "description": "<p>Launches come days after Pyongyang said it tested a new ‘high-thrust’ motor as it seeks to advance its nuclear and missile programmes</p><p>North Korea fired two ballistic missiles, Seoul’s military said, days after Pyongyang announced a successful test of a solid-fuel motor for a new weapons system.</p><p>Military tensions on the Korean peninsula have risen sharply this year as Pyongyang has carried out an unprecedented blitz of weapons tests, including the launch of its most advanced intercontinental ballistic missile ever last month.</p> <a href=\"https://www.theguardian.com/world/2022/dec/18/north-korea-fires-ballistic-missile-off-east-coast-says-seouls-military\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/18/russia-ukraine-war-at-a-glance-what-we-know-on-day-298-of-the-invasion", "title": "Russia-Ukraine war at a glance: what we know on day 298 of the invasion", "date_published": "2022-12-18 01:09:57+00:00", "description": "<p>Almost 6 million Ukrainians have power restored after Russian missile blitz; Putin consults his military chiefs</p><ul><li><a href=\"https://www.theguardian.com/world/ukraine\">See all our Ukraine war coverage</a></li></ul> <a href=\"https://www.theguardian.com/world/2022/dec/18/russia-ukraine-war-at-a-glance-what-we-know-on-day-298-of-the-invasion\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/18/world-cup-2022-briefing-qatar-argentina-france-final", "title": "World Cup 2022 briefing: Qatar’s big show comes to an end", "date_published": "2022-12-18 00:45:10+00:00", "description": "<p>Despite the grimness surrounding Fifa’s often tawdry but carefully buffed spectacle, the tournament has shone on one front</p><p>If nothing else, you’d imagine idle curiosity will probably get the better of him, but even if it doesn’t he’ll find out soon enough. Whether he elects to go out walking the dog, sits at home watching the ITV4 Midsomer Murders double bill or is cloistered somewhere with his Liverpool teammates sitting with ear buds in and his back to the screen all the better to studiously ignore it, Virgil van Dijk will discover who has won the World Cup at around the same time as the rest of us who have followed it.</p> <a href=\"https://www.theguardian.com/football/2022/dec/18/world-cup-2022-briefing-qatar-argentina-france-final\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/live/2022/dec/18/australia-vs-south-africa-cricket-live-updates-score-first-test-day-two-latest-scores-aus-v-sa", "title": "Australia v South Africa: first Test, day two – live", "date_published": "2022-12-18 00:41:51+00:00", "description": "<ul><li>Updates as the three-Test cricket series continues at the Gabba</li><li>Start time in Brisbane is 10:20am/11:20am AEDT/12:20am GMT</li><li>Any thoughts? <a href=\"mailto:geoff.lemon@theguardian.com\">Get in touch with Angus on email</a></li></ul><p><strong>37th over: Australia 174-5 (Head 89, Green 14)</strong></p><p>Head plunders his way past 2000 Test runs off Rabada’s second ball, a short wide ball on the offside. He steals another three runs to move to 89 and when Green moves calmly onto the front foot to pump Rabada down the ground for another boundary, Dean Elgar sends the signal for Marco Jansen to warm-up for an early blast. Rabada has woken up on the wrong side and cost his side five runs an over so far. </p> <a href=\"https://www.theguardian.com/sport/live/2022/dec/18/australia-vs-south-africa-cricket-live-updates-score-first-test-day-two-latest-scores-aus-v-sa\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/australia-news/2022/dec/18/spinach-recall-extends-to-most-of-australia-with-child-hospitalised-in-queensland", "title": "Spinach recall extends to most of Australia with child hospitalised in Queensland", "date_published": "2022-12-18 00:19:35+00:00", "description": "<p>Authorities say spinach contaminated with ‘unsafe plant material’ is from a ‘single source’ and has caused delirium and hallucinations</p><p>A Queensland child admitted to hospital is among more than 100 people believed to have suffered symptoms after consuming spinach amid a widespread recall of fresh food items contaminated with “unsafe plant material”.</p><p>Authorities say <a href=\"https://www.foodstandards.gov.au/industry/foodrecalls/recalls/Pages/Baby-spinach-recall.aspx\">the recalled spinach</a>, thought to be from one source, has caused delirium and hallucinations.</p><p><a href=\"https://www.foodstandards.gov.au/industry/foodrecalls/recalls/Pages/Riviera-Fresh-Baby-Spinach.aspx\">Riviera Fresh – Riviera Farms Baby​ Spinach</a></p><p><a href=\"https://www.foodstandards.gov.au/industry/foodrecalls/recalls/Pages/Fresh-Salad-Co-Fresh-and-Fast-Stir-Fry-.aspx\">Fresh Salad Co – Fresh and Fast Stir Fry</a></p><p><a href=\"https://www.foodstandards.gov.au/industry/foodrecalls/recalls/Pages/Woolworths-Chicken-Cobb-Salad-and-Chickpea-Falafel-Salad.aspx\">Woolworths – Chicken Cobb Salad and Chickpea Falafel Salad</a></p><p>​<a href=\"https://www.foodstandards.gov.au/industry/foodrecalls/recalls/Pages/Coles-Spinach-Products.aspx\">Coles – Spinach, Chef Blend Tender Leaf, Baby Leaf Blend, Kitchen Green Goddess Salad, Kitchen Chicken BLT Salad Bowl, Kitchen Roast Pumpkin, Fetta &amp; Walnut Salad, Kitchen Smokey Mexican Salad, Kitchen Egg and Spinach Pots</a></p> <a href=\"https://www.theguardian.com/australia-news/2022/dec/18/spinach-recall-extends-to-most-of-australia-with-child-hospitalised-in-queensland\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/18/why-swearing-is-a-christmas-stress-buster", "title": "Why swearing is a Christmas stress-buster", "date_published": "2022-12-18 00:05:34+00:00", "description": "It may be the season of goodwill to all, but research shows that a burst of colourful swearing relieves stress and promotes bonding. Happy effing Christmas!<p>I’m sitting in a polite home in southeast London shouting, “Go piss up a rope ya fuckstick,” at a sofa cushion. This odd ejaculation is at the behest of Australian singing teacher Sam, who’s part of today’s four-woman therapeutic “cursing circle”, a group therapy trend that emerged, like all things in fringe therapeutics, on the west coast of America.</p><p>Sam, our group leader today, sees her compatriots’ reputation as experts of the profane as a form of honest discourse that might help uptight Britons improve our intimate relationships and let off steam. And it’s something that could be especially helpful at this time of year: a way of venting after a festive overload of troublesome relatives or office Christmas parties. Perhaps best not to vent in company, though, as Sam recommends hollering therapeutic profanities at volume towards inanimate objects when you are alone. This year, try dreaming of a blue Christmas rather than a white one.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/18/why-swearing-is-a-christmas-stress-buster\">Continue reading...</a>", "persistent": false, "language": "en-US"}], "source": {"url": "https://www.theguardian.com/international/rss", "title": "The Guardian - International"}}