[{"source": "https://www.engadget.com/rss.xml", "title": "Riot Games wants a court to end its ‘League of Legends’ sponsorship deal with FTX", "description": "<p>Riot Games is trying to extricate itself from its <a href=\"https://www.engadget.com/league-of-legends-esports-lol-rebrand-logo-global-150019678.html\"><ins>League of Legends Championship Series</ins></a> partnership with FTX. On Friday, the studio filed a motion with the court overseeing FTX’s bankruptcy case to end the seven-year sponsorship agreement the two companies <a href=\"https://www.coindesk.com/markets/2021/08/04/ftx-strikes-7-year-deal-with-league-of-legends-riot-games/\"><ins>signed last August</ins></a>.</p><p>In a brief spotted by crypto critic and <em>Web3 is Going Just Great </em>creator <a href=\"https://twitter.com/molly0xFFF/status/1603922405952573442?s=20&amp;t=FOujha2EKItuqoISrzKSbA\"><ins>Molly White</ins></a> (via <a href=\"https://www.pcgamer.com/riot-files-to-terminate-relationship-with-failed-crypto-exchange-ftx/?utm_medium=social&amp;utm_campaign=socialflow&amp;utm_source=twitter.com\"><em><ins>PC Gamer</ins></em></a>), Riot says the exchange still owes half of the 12.5 million it agreed to pay in 2022 for the studio to display FTX branding at LCS events. Riot adds the disgraced firm will owe it another nearly $13 million in 2023, with the first quarterly payment of the year due on January 2nd. FTX’s yearly payments to Riot are scheduled to increase through the end of their agreement in 2028.</p><span id=\"end-legacy-contents\"></span><div id=\"6438ced7fc124eb78592e06171d68f51\"><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Riot Games just filed a motion in the FTX bankruptcy case to end their deal, pertaining to the League of Legends Championship series.<br /><br />FTX still owes $6.25M (about half the payment) for 2022, and will owe $12.875M for 2023. Per the agreement, the payments escalate through 2028.</p>— Molly White (@molly0xFFF) <a href=\"https://twitter.com/molly0xFFF/status/1603922405952573442?ref_src=twsrc%5Etfw\">December 17, 2022</a></blockquote></div><p>Riot also has a personal stake in the case. More than a year before he was <a href=\"https://www.engadget.com/ftx-sam-bankman-fried-criminal-and-civil-charges-200410951.html\"><ins>arrested on fraud charges</ins></a>, FTX founder and former CEO Sam Bankman-Fried <a href=\"https://twitter.com/SBF_FTX/status/1357123557122187265?s=20&amp;t=aEmou9CHOyV8qToezEpXwg\"><ins>admitted</ins></a> he was “(in)famous for playing <em>League of Legends</em> while on phone calls.” SBF’s gaming habit became something of a joke when it came out that he <a href=\"https://kotaku.com/sbf-ftx-crypto-scam-league-legends-bronze-rank-vayne-1849782021\"><ins>wasn’t very good at the game</ins></a>.</p><p>“Images of Mr. Bankman-Fried playing <em>League of Legends </em>were displayed alongside text describing his cavalier attitude towards investor meetings and irresponsibility with corporate funds. These images created a public narrative that Mr. Bankman Fried’s interest in <em>League of Legends, </em>once relatable and human, was now reckless and juvenile,&quot; Riot states. “Even Mr. Bankman-Fried’s ranking in <em>League of Legends </em>has been the subject of online commentary with public figures <a href=\"https://kotaku.com/aoc-league-of-legends-crypto-ranked-bronze-sbf-ftx-1849791131\"><ins>Alexandria Ocasio-Cortez</ins></a> and Elon Musk weighing in.”</p><p>If you think Riot is ready to swear off crypto because of one high-profile implosion, think again. The reason the studio wants a court to void its agreement with FTX is so that it can move forward with a new sponsorship. “The longer Riot is prevented from commercializing the crypto exchange sponsorship category and the broadcast assets currently owned by FTX, the more damages Riot incurs.” Here's hoping the studio doesn't find itself in a similar situation sometime in the future.</p>", "link": "https://www.engadget.com/riot-games-files-motion-to-end-ftx-sponsorship-deal-213121253.html?src=rss", "date_published": "2022-12-18 21:31:21+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "Apple is reportedly working on a new Pro Display XDR monitor", "description": "<p>Apple fans disappointed by the <a href=\"https://www.engadget.com/apple-studio-display-review-mac-monitor-154504997.html\"><ins>Studio Display</ins></a> could soon have a few more options from the company. According to <a href=\"https://www.bloomberg.com/news/newsletters/2022-12-18/when-will-apple-aapl-release-the-apple-silicon-mac-pro-with-m2-ultra-chip-lbthco9u?sref=10lNAhZ9\"><em><ins>Bloomberg’s</ins></em><ins> Mark Gurman</ins></a>, Apple is developing “multiple new external monitors,” including a refresh of its 32-inch <a href=\"https://www.engadget.com/2019-06-03-apple-retina-6k-display.html\"><ins>Pro Display XDR</ins></a> from 2019. Details on the upcoming screens are sparse, but Gurman suggests they’ll incorporate built-in Apple Silicon chipsets like the Studio Display, which features a dedicated A13 Bionic processor. He adds that the updated Pro Display XDR could ship after the M2 Mac Pro arrives (more on the computer in a moment).</p><p>It’s unclear if Apple’s slate of new monitors could include a Studio Display refresh. As <a href=\"https://www.macrumors.com/2022/12/18/updated-pro-display-xdr-gurman/\"><em><ins>MacRumors</ins></em><ins> points out</ins></a>, display analyst Ross Young tweeted in October that the company was preparing to release a monitor with a <a href=\"https://www.macrumors.com/2022/10/06/apple-mini-led-display-q1-2023/\"><ins>27-inch mini-LED panel</ins></a> in the first quarter of 2023. Based on the specs Young shared, it looked like Apple was planning to update the Studio Display with its ProMotion technology.</p><span id=\"end-legacy-contents\"></span><p>Gurman also provides an update on the long-rumored M2 refresh of the Mac Pro. In October, <a href=\"https://www.engadget.com/apple-mac-pro-m2-ultra-extreme-report-215731047.html\"><ins>he reported</ins></a> the computer would ship with an optional “Extreme” variant of the company’s M2 chipset that was reportedly slated to feature a processor with up to 48 cores and 256GB of memory. Since then, Gurman says Apple has abandoned those plans.</p><p>“Based on Apple's current pricing structure, an M2 Extreme version of a Mac Pro would probably cost at least $10,000 — without any other upgrades — making it an extraordinarily niche product that likely isn't worth the development costs, engineering resources and production bandwidth it would require,&quot; Gurman writes.</p><p>As things stand, the remaining model will reportedly feature an M2 Ultra chipset with up to 24 CPU cores, 76 GPU cores and at least 192GB of RAM. Additionally, Gurman says the new Mac Pro retains the current model’s expandability, including the option to add more memory. It will be interesting to see how Apple offers that kind of upgradability since the company’s current chips <a href=\"https://www.macrumors.com/2021/04/06/m1-mac-ram-and-ssd-upgrades-possible/\"><ins>feature soldered RAM</ins></a>.</p><p>Apple was supposed to finish transitioning its computer lineup to Apple Silicon two years after the release of its first M1 chip. According to Gurman, feature tweaks and a change in Apple’s manufacturing plans are among the reasons why it’s taken the company so long to announce a new Mac Pro. Barring any additional delays, the new model will likely arrive sometime next year, though Gurman did not speak to a specific timeline.</p>", "link": "https://www.engadget.com/apple-reportedly-developing-new-pro-display-xdr-monitor-194353294.html?src=rss", "date_published": "2022-12-18 19:43:53+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "Twitter bans links and username mentions relating to Facebook, Instagram and other rivals", "description": "<p>While many people were turning to Twitter on Sunday to watch the World Cup finals unfold, the company <a href=\"https://twitter.com/TwitterSupport/status/1604531261791522817?s=20&amp;t=wZVbz0iUccI1-PA8HC6uaA\">introduced</a> a new policy banning &quot;free promotion&quot; of competing social media websites. Moving forward, Twitter says it will remove links to Facebook, Instagram, Mastodon, Tribel, Post, Nostr and Donald Trump's Truth Social from accounts whose &quot;main purpose&quot; is to promote content on those platforms. As a result of the policy, users can no longer use their Twitter bio to link to their other social media profiles, nor can they post tweets that invite their followers to follow them elsewhere. Additionally, the company is restricting the use of third-party aggregators like Linktree and Link.bio.&nbsp;&nbsp;</p><div id=\"8b11433c6ae74977b0c74a4efdc57552\"><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">We recognize that many of our users are active on other social media platforms. However, we will no longer allow free promotion of certain social media platforms on Twitter.</p>— Twitter Support (@TwitterSupport) <a href=\"https://twitter.com/TwitterSupport/status/1604531261791522817?ref_src=twsrc%5Etfw\">December 18, 2022</a></blockquote></div><p>Developing...&nbsp;</p><span id=\"end-legacy-contents\"></span>", "link": "https://www.engadget.com/twitter-bans-free-promotion-of-competing-platforms-182712974.html?src=rss", "date_published": "2022-12-18 18:27:12+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "Apple's AirPods Pro are back on sale for $200", "description": "<p>If you haven't finished your Christmas shopping yet, look to Amazon. The retailer has discounted <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9BcHBsZS1HZW5lcmF0aW9uLUNhbmNlbGxpbmctVHJhbnNwYXJlbmN5LVBlcnNvbmFsaXplZC9kcC9CMEJESFdEUjEyP3RoPTEmdGFnPWdkZ3QwYy1wLW8tZGwtMjAiLCJjb250ZW50VXVpZCI6IjBhOWRiYjQ2LTIyMjAtNDI0NC05ZGFlLWQzNTk1NWQ2ZjkxZCJ9&amp;signature=AQAAAYjqWM6fnuH9h1u6OAeOlHEYqVucxFs4gXQOSOb6yRT0&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FApple-Generation-Cancelling-Transparency-Personalized%2Fdp%2FB0BDHWDR12%3Fth%3D1\">Apple's second-generation AirPods Pro</a>. Right now, you can buy the earbuds for $200, down from $249. Not only is that the best price Engadget has seen for the AirPods Pro since they went on sale for Black Friday, but Amazon says it also will deliver the headphones before Christmas for customers who order today. So act fast if you have a friend or family member who you think will appreciate them as a gift.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p><a class=\"athena-button rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=shopnow-button&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9BcHBsZS1HZW5lcmF0aW9uLUNhbmNlbGxpbmctVHJhbnNwYXJlbmN5LVBlcnNvbmFsaXplZC9kcC9CMEJESFdEUjEyP3RoPTEmdGFnPWdkZ3QwYy1wLW8tZG0tMjAiLCJjb250ZW50VXVpZCI6IjBhOWRiYjQ2LTIyMjAtNDI0NC05ZGFlLWQzNTk1NWQ2ZjkxZCJ9&amp;signature=AQAAAS1Aadx4OaGnqPeIGkG0c9J_HsFO5OhFf7G3Ca5mnP_A&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FApple-Generation-Cancelling-Transparency-Personalized%2Fdp%2FB0BDHWDR12%3Fth%3D1\" id=\"2b308669eee94b8597143d591007154a\">Buy Apple AirPods Pro at Amazon - $200 </a><p>The 2022 AirPods Pro may not look different than their <a href=\"https://www.engadget.com/2019-11-06-apple-airpods-pro-review.html\">2019 predecessor</a>, but they're a big upgrade. <br /> Engadget Senior Editor Billy Steele awarded the second-generation earbuds a <a href=\"https://www.engadget.com/airpods-pro-review-second-generation-130048218.html\">score of 88</a> when he had a chance to review them earlier this year. They offer improved audio quality, an even better transparency mode and the addition of touch volume controls. Apple also redesigned the accompanying charging case to make it sweat- and water-resistant and add a built-in speaker to make finding the case easier to find if you ever misplace it. About the only area where the 2022 AirPods Pro disappoint is battery life. You can expect about six hours of use from the earbuds on a single charge. That's more than you could get out of the first-generation model, but less than some competing options offer. Still, the AirPods Pro are among the best earbuds you can pair with an iPhone, and a $50 discount makes them even more compelling.&nbsp;</p><span id=\"end-legacy-contents\"></span><p><em>Follow </em><a href=\"https://twitter.com/EngadgetDeals\"><em>@EngadgetDeals</em></a><em> on Twitter and </em><a href=\"https://subscription.yahoo.net/Newsletter/Preference/sub?b=engadgetdeals&amp;src\"><em>subscribe to the Engadget Deals newsletter</em></a><em> for the latest tech deals and buying advice.</em></p>", "link": "https://www.engadget.com/apple-airpods-pro-sale-amazon-162120383.html?src=rss", "date_published": "2022-12-18 16:21:20+00:00", "persistent": false, "user": null, "language": "en-US"}]