[{"source": "https://www.gamespot.com/feeds/mashup", "title": "Best Mobile Games 2022", "description": "<img height=\"480\" src=\"https://www.gamespot.com/a/uploads/square_medium/1352/13527689/4078616-gs-boty-2022-best-mobile.jpg\" width=\"480\" /> 2022 has been another big step forward for mobile games across iPhone and Android, as developers have used the medium to craft unique experiences, put fresh twists on familiar genres, and improve on established games with feature-packed upgrades.", "link": "https://www.gamespot.com/videos/best-mobile-games-2022/2300-6460268/", "date_published": "2022-12-18 18:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Best Live-Service Games Of 2022", "description": "<p><img src=\"https://www.gamespot.com/a/uploads/scale_large/1597/15971423/4078176-1559498475-407750.jpeg\" /><br /><h3><p dir=\"ltr\">Live-service games continue to become increasingly prominent. Sony has signaled its intentions to <a href=\"https://www.gamespot.com/articles/sony-projects-launching-12-live-service-games-by-2025/1100-6503924/\">move into the space in a major way</a>, including with its acquisition of Destiny 2 developer Bungie earlier this year. Thatgamecompany's Jenova Chen sees them as the <a href=\"https://www.gamespot.com/articles/thatgamecompanys-jenova-chen-sees-live-service-games-as-the-healthiest-way-to-make-games/1100-6506042/\">healthiest way to make games</a>. <a href=\"https://www.gamespot.com/articles/far-cry-7-is-a-live-service-game-similar-to-assassins-creed-infinity-report/1100-6497943/\">Far Cry</a> and <a href=\"https://www.gamespot.com/articles/assassins-creed-infinity-everything-we-know-about-ubisoft-game-hub/1100-6503702/\">Assassin's Creed</a> may be headed in this direction, too. But as these types of games seek to dominate more and more of their players' free time, which are doing the best job of adding new content, making changes, and responding to the community?</p><p dir=\"ltr\">With that question in mind, GameSpot's team has named its top five live-service games of 2022. If you were with us for last year's awards, you'll likely notice more than a few familiar names. And while it can be a challenge to have enough time to play as many live-service games as we'd all like, it's a testament to our choices that, for another year, we walked away very happy with how these games evolved and maintained our attention.</p></h3></p><br />     <p><h2>Destiny 2</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1597/15971423/4077132-king_s_fall_center_16-9.jpeg\" /><br /><h3><p dir=\"ltr\">2022 saw the release of multiple new seasons for Destiny 2, but more notably, The Witch Queen expansion introduced some major advancements from the game on a number of fronts.</p><p dir=\"ltr\">Narratively, the years-in-the-making threat of Savathun, the titular Witch Queen, paid off, as we finally encountered her and learned more about her back story and motivations. Subsequent stories, particularly that of <a href=\"https://www.gamespot.com/articles/how-destiny-2-unexpectedly-became-a-game-about-dealing-with-trauma/1100-6504642/\">Season of the Haunted, which unexpectedly delved into trauma</a>, were also strong. Bungie increasingly has a strong grasp on consistent live-game storytelling over long periods of time.</p><p dir=\"ltr\">The Witch Queen also revamped the structure of campaign missions, offering a higher difficulty and reason to replay them--easily the game's best story missions yet. There was also the new weapon-crafting setup and other systems that provide players with more control over the types of rewards they're working toward obtaining at any time. Although weapon crafting is not without its faults--far from it--Bungie has continued to evolve numerous aspects of the game, perhaps best demonstrated by the Stasis-style overhauls to the other three elemental subclasses that provide far more customization and build-crafting options than ever before.</p><p>With a great new raid and dungeon launching this year (plus a reprised version of the beloved King's Fall raid, which remains wonderful, and another <a href=\"https://www.gamespot.com/articles/destiny-2-spire-of-the-watcher-dungeon-guide/1100-6509966/\">brand-new dungeon</a> I'm eager to play), there was a lot of terrific new high-level content to sink our teeth into. PvP even finally got some love with changes to Iron Banner. Bungie still has work to do in ensuring the second half of seasons don't lose all of their steam--and generally ensuring seasons don't feel too formualic and predictable--but it's nevertheless doing arguably the best job in the space of telling a compelling live-game story. -- <em>Chris Pereira</em></p></h3></p><br />     <p><h2>Sea of Thieves</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1597/15971423/4077082-0247586213-362345.jpeg\" /><br /><h3><p>With Sea of Thieves sailing toward its fifth anniversary, it's arguably just had its best calendar year since launch. This year's major updates to Rare's pirate PvPvE sandbox brought some incredible features to the game, both those that have been long-awaited by fans as well as some fun surprises. Sea of Thieves has always been a game that suits many playstyles, and in 2022, Rare has done well to enhance the experience no matter the kind of player you are.</p><p dir=\"ltr\">For those short on time, it's gotten more user-friendly with the introduction of Sea Forts, which play out like Skeleton Forts but need much less time to complete while still doling out a hefty reward. No longer does a valuable voyage require a few free hours. For the PvP community, Season 8 added on-demand PvP that takes place inside the same Adventure mode as other players. This smartly doesn't partition the game's combat-focused players like Arena mode once did, and it even benefits the passive players too, as hardcore PvPers can get their fix in minutes rather than seek out other would-be targets.</p><p>The addition of limited-time Adventures has led to Sea of Thieves becoming more like an appointment series, inviting players back in every month or two to unfold the next compelling chapter that tells the overarching story of the wicked Captain Flameheart's return to prominence. These major tentpole changes have, as always, been flanked by routine quality-of-life updates, fabulous new cosmetics, and, for the first time ever, a world-changing event that is still unfolding today and will soon see one of the game's outposts redesigned as its debut port town. The winds are still strong on the sails of Sea of Thieves. <em>-- Mark Delaney</em></p></h3></p><br />     <p><h2>Fortnite</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1597/15971423/4077085-6521772698-40715.jpg\" /><br /><h3><p dir=\"ltr\">As I write this, Fortnite has just recently kicked off its fourth chapter, and I know it'll sound like recency bias, but it already feels like it's never been better. The new island that always comes with a chapter launch is, this time, arguably the best one ever in Fortnite, with more-intricate landing spots, more-interesting high and low points around the world, and the incredibly fun new addition of dirtbikes, which, for me, have turned the battle royale experience into a part-time stunt showcase.</p><p dir=\"ltr\">With Chapter 4, the game also received an upgrade to Unreal Engine 5.1, becoming the first console game to use Epic's proprietary Lumen lighting technology, and the results can't be overlooked. The world is even more stunning now, with more-realistic lighting for every environment. But Fortnite's great year didn't come on just this late. It's been an awesome year all along. Epic has leaned into story a lot more lately, making meaningful progress in its central thread of The Seven versus the Imagined Order, with a few existential threats coming from The Last Reality along the way.</p><p>If you're not playing for the plot, you likely still had a great time with fun new Fortnite toys such as Med Mist--the best healing item in the game--the Shockwave Hammer, and Chrome Splash, as well as great new crossovers, such as Dragon Ball Z, The Witcher, and more athletes, like Chloe Kim and Patrick Mahomes. Of course, the biggest thing that happened this year was the introduction of Zero Build mode, which removed the one (literal) barrier preventing many players from giving it a try--and is now considered the premier mode by a great number of fans. In 2022, Fortnite was reimagined, retooled, and reignited to dominate the live-service space once again.<em> -- Mark Delaney</em></p></h3></p><br />     <p><h2>Final Fantasy XIV: Endwalker</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1597/15971423/4077088-untitled%281%29.png\" /><br /><h3><p> </p><p dir=\"ltr\">By now, most people have heard of the critically acclaimed MMORPG Final Fantasy 14. With an expanded free trial and everything, you know the whole deal at this point. More importantly, though, this year was when we all finally walked to the end. The game's fourth major expansion, Endwalker, released and wrapped up a decade-long story in the making. A story that has taken us from protecting our own homes all the way to the literal edge of the universe, and I know it's not one I am going to forget anytime soon. We got all of this along with a bunch of new features and content to carry us through the whole year.</p><p dir=\"ltr\">You could argue that the most-important thing for an MMO to have is tons of content to keep players busy, and even though Endwalker may have seen more space between updates, those updates have been wonderful. New alliance raids with interesting theming, great boss designs, and amazing music have all been highlights. Even with the slightly more difficult savage raids, I know my group has been having a fun time clearing out the tiers. Where else can I have a great time beating up a sexy vampire theater nerd with seven of my best friends while an amazing boss theme plays that includes silly little surf-rock breakdowns? That's Final Fantasy 14 Online, baby! This also isn't even mentioning the new Adventurer Plate system, the PvP rework, and Overwatch-like payload mode that is a blast to play. Or even the survival game and Animal-Crossing-like Island Sanctuary mode that lets you relax and gather materials while building up your own Island. The development team has been busy trying to give us a lot of things to do, and it shows how much they care.</p><p>The biggest thing for me, though, even so long after it came out, is the story. The game nailed how we wrapped up a decade-long tale and started up a brand-new adventure. The themes and moments that took us to the end really left a big impact on me, and they all hit especially hard after the outstanding expansion before it, Shadowbringers. I am not going to spoil anything because I still think FFXIV is a game that everyone needs to experience, but it is something to see how far this game has come in all the years I have been playing it. Storylines and characters that follow you through your whole journey grow and change, and to see that all come together in a wonderfully emotional final zone is something I won't forget. It does a lot to go beyond just asking things to your character and will sometimes even directly ask you, as the player, to reflect on your journey and what it meant to you. It's a story about ends, accepting that death is inevitable, and even though things can get rough or seem impossible, it's always important to do your best, not lose hope, and forge ahead. The sorrow of a thousand worlds weighs heavy, and yet we can all walk on. -- <em>Ben Janca</em></p></h3></p><br />     <p><h2>Apex Legends</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1597/15971423/4077089-4837404078-40591.jpg\" /><br /><h3><p>In 2022, Respawn added four new playable characters--Mad Maggie, Newcastle, Vantage, and Catalyst--to Apex Legends, further fleshing out one of the most-diverse rosters of characters in a AAA shooter. The first two characters pulled a lot of narrative weight in the first half of the year, creating intriguing connections to long-ignored characters in Apex Legends' story, like Octane and Bangalore. All four are ridiculously fun to play as, too, with all making minor shifts to how players approach bunkering.</p><p dir=\"ltr\">The four new faces have been a bright spot in what's been a somewhat rough year for Apex Legends. 2022 didn't deliver a Quest anyway on par with 2021's The Legacy Antigen or 2020's The Broken Ghost, meaning the battle royale's normally strong narrative focus has been absent this year. The new Broken Moon map isn't as enjoyable an addition to the battle royale's lineup compared to the likes of Storm Point or Olympus either, and not adding <em>any </em>new guns has made the meta somewhat stagnant.</p><p dir=\"ltr\">Apex Legends has partially made up for these shortcomings with two excellent limited-time modes, Control and Gun Run, which have intermittently popped up a few times throughout the year. Control and Gun Run are the best new modes to come to Apex Legends since Arenas. Control's team deathmatches create a space to enjoy Apex Legends without the do-or-die pressure of a battle royale. Meanwhile, Gun Run is a lot of chaotic fun and incorporates a Throwing Knife, leading to some silly fun in a firearm-focused game.</p><p>And even if the Apex Legends' experience has been a bit inert this year, it doesn't change that the battle royale continues to be one of the best first-person shooter experiences out there. The bones of Apex Legends remain strong even four years later, rewarding strong teamwork and skilled gunplay in enjoyably tense matches. Plus, we've gotten some banger additions to the continuously superb soundtrack in 2022, especially the musical themes for the four new characters. <em>-- Jordan Ramée</em></p></h3></p><br />", "link": "https://www.gamespot.com/gallery/best-live-service-games-of-2022/2900-4540/", "date_published": "2022-12-18 17:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "STG 44: How Games Embraced The World’s First Assault Rifle", "description": "<img height=\"480\" src=\"https://www.gamespot.com/a/uploads/square_medium/1571/15719603/4077502-stg44_site.jpg\" width=\"480\" /> Often called the world’s first Assault Rifle, the Sturmgewehr 44 is an essential addition to many second world war movies, TV shows and video games. The rifle has been a huge influence on firearms history, as well as having a recurring role in World War 2 games like Medal of Honor and Call of Duty. And while often one of the most powerful entries in the arsenal of those video games, does the truth of this historic weapon match up to its on-screen legacy, and does its appearance in games today still kick up", "link": "https://www.gamespot.com/videos/stg-44-how-games-embraced-the-worlds-first-assault-rifle/2300-6460255/", "date_published": "2022-12-18 15:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "The Best Mobile Games Of 2022", "description": "<p><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4075122-img_3870.jpg\" /><br /><h3><p dir=\"ltr\">From assembling Avenger cards in Marvel Snap to discovering the joy of embroidery in Stitch, these five mobile games were some of the best entertainment you could access straight from your pocket.</p><p dir=\"ltr\">If you've got a smartphone in your pocket or a tablet device on charge, then you're more than ready to enter a world of mobile gaming that has grown in leaps and bounds over the last couple of years. 2022 has been another big step forward for mobile games across iPhone and Android, as developers have used the medium to craft unique experiences, put fresh twists on familiar genres, and improve on established games with feature-packed upgrades.</p><p dir=\"ltr\">One of the biggest shifts in this space was Netflix's entry into the mobile gaming market, as the streaming giant is laying the foundation for its future by offering its subscribers access to some of the best games on the market.<a href=\"https://www.gamespot.com/articles/netflix-is-developing-55-games-currently/1100-6508438/\"> With 55 games in development</a>, the construction of a<a href=\"https://www.gamespot.com/articles/netflix-is-opening-new-mobile-game-studio/1100-6507820/\"> brand-new studio in Finland</a>, and development on a<a href=\"https://www.gamespot.com/articles/netflix-is-hiring-for-a-brand-new-aaa-pc-game/1100-6509465/\"> \"AAA\" game</a> having kicked off, Netflix is betting big on interactive entertainment.</p><p dir=\"ltr\">Elsewhere this year, Microsoft continued to improve on its cloud gaming initiative with more day-one releases through its Game Pass subscription service and improved touch controls, Apple Arcade continued to be good value for money, and Google announced that its<a href=\"https://www.gamespot.com/articles/google-stadia-is-shutting-down-on-january-18-2023/1100-6507919/\"> Stadia platform will be shutting down</a> in early 2023. We've seen plenty of great games released between the headlines this year, while revenue from the Google Play and Apple App Store has reached new record-breaking highs.</p><p dir=\"ltr\">For the best mobile games of 2022, we've looked at those games which look, play, and feel best on this platform (excluding any cloud-based games). These are games that are designed to be accessible, provide quick bursts of fun, and deliver imaginative ideas that you may not see on PC or console.</p><p> </p></h3></p><br />     <p><h2>Marvel Snap</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4075129-marvel-snap.jpg\" /><br /><h3><p dir=\"ltr\">The beauty of Marvel Snap is that it intelligently streamlines the appeal of assembling a deck of cards and seeing how it stacks up against an opponent. A free-to-play digital card game that draws inspiration from the mighty Marvel universe, Marvel Snap manages to simplify the deck-building genre without feeling like a dumbed-down approach. This makes for an incredibly easy-to-play game--one filled with countless ways to win and complex strategies, thanks to the use of unique zones that add a wide variety of modifiers in any given round.</p><p dir=\"ltr\">Want to use a field advantage to summon multiple Thors, transform Bucky into the Winter Soldier instantly, or risk the wrath of the Time Variance Authority and force a match to end two turns early? All that and more can happen in Marvel Snap, a game that knows its audience and provides incredibly authentic entertainment one card at a time. With a flexible deck, some quick thinking, and a little forward planning, you'll soon find yourself losing hours of your time to a game that draws you in with its fine-tuned mechanics and slick presentation.</p><p dir=\"ltr\">The best part though? Each match is a digestible showdown between similarly matched players, seldom lasting more than a few minutes. In a fast-paced world where time is valuable, Marvel Snap is a delightful distraction that's always pushing you to try out new cards and tactics while you're on the go.</p><p dir=\"ltr\">\"The advent of digital collectible card games has led to an explosion of different approaches to the genre. Mostly, though, new games have adapted the fundamentals of physical CCGs. With Marvel Snap, Hearthstone veteran studio Second Dinner has reduced the collectible card game to its most essential pieces and reimagined them, creating a combination of systems that are elegantly simple without ever feeling simplistic.\" -- <em>Steve Watts</em></p><div><div class=\"norewrite\" title=\"\">           <a href=\"https://play.google.com/store/apps/details?id=com.nvsgames.snap&amp;hl=en_us&amp;gl=US\">See on the Google Play Store</a> </div></div><div><div class=\"norewrite\" title=\"\">           <a href=\"https://apps.apple.com/ph/app/marvel-snap/id1592081003\">See on the App Store</a> </div></div><p dir=\"ltr\"> </p></h3></p><br />     <p><h2>Stitch</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4075126-stitch.jpg\" /><br /><h3><p dir=\"ltr\">Some of the best mobile gaming experiences come from the unlikeliest of places, and it's a good bet that few people were expecting digital embroidery to be as captivating as it is in Stitch. Stitch takes the art of embroidery and uses it as a foundation to create a delightful game that plays like Picross fused together with intricate stitchwork. It is delightfully easy to find your footing in, and with Lumen developer Lykke Studios at the helm, the controls are easy-to-grasp and intuitive.</p><p dir=\"ltr\">The real joy in Stitch comes from the breathtaking attention to detail on display. Every thread, button, and stitch is on full display here, and weaving them together into a unique creation feels blissfully relaxing as you combine your resources to slowly transform your canvas into a work of art. While there are tricky moments that will make you think twice before you make your next move, Stitch feels consistently relaxing and makes clever use of its touchscreen controls to deliver needlework catharsis.</p><div><div class=\"norewrite\" title=\"\">           <a href=\"https://apps.apple.com/us/app/stitch/id1581052096?ign-itscg=30800&amp;ign-itsct=stitch\">See on the App Store</a> </div></div><p dir=\"ltr\"> </p></h3></p><br />     <p><h2>Knotwords</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4075125-knotwords.jpg\" /><br /><h3><p dir=\"ltr\">With games like Wordle reigniting a hunger for pure logical fun, we've seen a rebirth in games that test your mental might. Knotwords is a great example here, as while it may look like your standard crossword puzzle given a new coat of paint, it manages to put a fresh spin on one of the longest-running brain-teaser activities still in print circulation today. A mix of word and logic puzzles, Knotwords kicks the traditional crossword clues to the curb and arranges the available letters into a \"knot\" that can then form valid words.</p><p dir=\"ltr\">It's a deceptively simple formula during the first few games that grows devilishly more challenging the more you play and are forced to shake your brain for the right answers. It's essentially a more complex game for anyone that finds Wordle too simple for their tastes, and with an eye-catching design, a generous number of puzzles to work through, and an extra-challenging mode for anyone looking to spend all day staring at their screen while every cog in their head turns, Knotwords is a terrific whetstone to sharpen your mind with.</p><div><div class=\"norewrite\" title=\"\">           <a href=\"https://play.google.com/store/apps/details?id=com.noodlecake.knotwords\">See on the Google Play Store</a> </div></div><p dir=\"ltr\"> </p><div><div class=\"norewrite\" title=\"\">           <a href=\"https://apps.apple.com/us/app/knotwords/id1598756238\">See on the App Store</a> </div></div></h3></p><br />     <p><h2>Into The Breach: Advanced Edition</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4075124-into-the-breach.jpg\" /><br /><h3><p dir=\"ltr\">Imagine if Pacific Rim met chess and you'd have a good idea of what to expect from Into The Breach. One of the best games on PC since its release back in 2018, Into The Breach finally made its long-awaited debut on mobile this year with an Advanced Edition that throws an entire timeline's worth of extra content into the original's mechanized frame. It's still an elegant game of tactical positioning, situational awareness, and making some very hard decisions in the heat of battle, but enhanced with thoughtful tweaks and additional content that deepens an already thrilling experience.</p><p dir=\"ltr\">The sheer joy of canceling the apocalypse with a rocket-propelled fist or lining up kaiju in a row before you atomize them with a laser is still there, but the options for a deeper strategic experience--one with new squads, pilots, abilities, and modes--is on full display with this well-optimized mobile version. Whether you're using a tablet or a phone, Into The Breach shines on these smaller screens with its quirky pixel art and freedom to plan every single step you'll take in your turn. If you have a Netflix subscription, it's an essential download that'll keep you entertained for weeks and months to come.</p><p dir=\"ltr\">\"Into the Breach is a game of epiphanies and triumphs just like that one. By limiting the size of maps and the number of units and actions you have, it avoids ever becoming overwhelming, while still giving you a wide-enough possibility space that your path forward is full of potential, rather than feeling preordained. All of this holds true in the new, Netflix-exclusive mobile version, which controls well and never feels cramped, even when played on a much smaller screen than ever before.\" -- <em>Chris Pereira</em></p><div><div class=\"norewrite\" title=\"\">           <a href=\"https://play.google.com/store/apps/details?id=com.netflix.NGP.IntoTheBreach&amp;hl=en_us&amp;gl=US\">See on the Google Play Store</a> </div></div><div><div class=\"norewrite\" title=\"\">           <a href=\"https://apps.apple.com/us/app/into-the-breach/id1616542180\">See on the App Store</a> </div></div><p dir=\"ltr\"> </p></h3></p><br />     <p><h2>Poinpy</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4075123-poinpy.jpg\" /><br /><h3><p dir=\"ltr\">A prime example of Netflix making all the right moves as it establishes a library of original games, Poinpy offers maximum entertainment and requires just a single digit of interaction from you. Onwards and upwards is the theme of this game, as you propel your bounce-happy protagonist through cleverly-designed levels in an attempt to escape the gigantic maw below you that hungrily gobbles up anything of nutritional value that falls into its digestive abyss.</p><p dir=\"ltr\">To escape the Blue Beast, all you need is a downward swipe that propels your blob away from danger and into some nearby fruit that will calm the monster below you. It's an easy-to-learn mechanic that's also challenging to master, and with each level regularly throwing new obstacles at you, Poinpy remains a tense race against time as you climb toward the finish line. It's effortlessly charming and not too demanding with its simple one-handed gameplay, making this fun and vibrant puzzle-platformer perfect for some cozy gaming on a cold night.</p><p dir=\"ltr\">\"Poinpy represents my favorite kind of mobile game. Bouncing Poinpy around is a simple, repeatable, and fun mechanic, and I never once had to think about currency of any kind. It can be played with one hand and is both rewarding and challenging without demanding too much input from the player. With its soft ending, it is clear this is not a game you are expected to play forever.\" -- <em>Kyle Hilliard</em></p><div><div class=\"norewrite\" title=\"\">           <a href=\"https://play.google.com/store/apps/details?id=com.netflix.NGP.Poinpy&amp;hl=en_us&amp;gl=US\">See on the Google Play Store</a> </div></div><div><div class=\"norewrite\" title=\"\">           <a href=\"https://apps.apple.com/us/app/netflix-poinpy/id1615093407\">See on the App Store</a> </div></div><p dir=\"ltr\"> </p><p dir=\"ltr\"> </p></h3></p><br />", "link": "https://www.gamespot.com/gallery/the-best-mobile-games-of-2022/2900-4522/", "date_published": "2022-12-18 14:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]