{"entries": [{"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/sport/szymon-marciniak-poprowadzil-final-mundialu-w-katarze-tyle-zarobil/kf0rs81", "title": "Szymon Marciniak poprowadził finał mundialu w Katarze. Tyle zarobił", "date_published": "2022-12-18 18:07:00+00:00", "description": "Szymon Marciniak był sędzią głównym podczas finału Argentyna-Francja w Katarze. To duże wyróżnienie i duża odpowiedzialność. Ile zarobił polski arbiter za udział w najważniejszym meczu mundialu?", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/sport/gigantyczne-pieniadze-dla-argentynczykow-za-zwyciestwo-na-mundialu/qf8vpzr", "title": "Gigantyczne pieniądze dla Argentyńczyków za zwycięstwo na mundialu", "date_published": "2022-12-18 17:59:17+00:00", "description": "42 milionów dolarów — tyle za wygraną na mundialu w Katarze dostaną piłkarze reprezentacji Argentyny. Ogromne pieniądze trafią też do Francuzów, którzy co prawda przegrali, ale ostatecznie na turnieju zajęli drugie miejsce.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/sport/argentyna-mistrzem-swiata-po-karnych-koniec-mundialu/0xs6x5c", "title": "Argentyna mistrzem świata po karnych. Koniec mundialu", "date_published": "2022-12-18 17:54:49+00:00", "description": "Argentyna wygrywa z Francją i zostaje mistrzem świata w piłce nożnej. W niedzielny wieczór zwycięzcę rozstrzygnęły dopiero rzuty karne.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/ziobro-nie-znam-umowy-o-zbyciu-udzialow-w-rafinerii-gdanskiej-ale-jestem-zwolennikiem/h54m5ry", "title": "Ziobro: nie znam umowy o zbyciu udziałów w Rafinerii Gdańskiej, ale jestem zwolennikiem jawności", "date_published": "2022-12-18 12:17:45+00:00", "description": "Nie znam faktów w sprawie sprzedaży udziałów w Rafinerii Gdańskiej, nie mówię, czy jest dobra, czy zła, bo nie byłem jej stroną, ale warto poznawać tego rodzaju umowy. Jestem zwolennikiem transparentności – powiedział minister sprawiedliwości Zbigniew Ziobro.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/amerykanscy-piloci-testuja-starzejacego-sie-a-10-warthoga-moze-byc-on-wykorzystywany/bb8k9m1", "title": "Amerykańscy piloci testują starzejącego się A-10 Warthoga. Może być on wykorzystywany w misjach przeciwko bardziej zaawansowanym wrogom", "date_published": "2022-12-18 12:09:19+00:00", "description": "A-10 Warthog zyskał sławę jako maszyna do niszczenia czołgów, ale teraz Siły Powietrzne testują 50-letni samolot pod kątem nowych zadań: wystrzeliwania wabików do ochrony innych samolotów.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/30-procentowy-wzrost-kradziezy-w-sklepach-winna-inflacja/0ww6r2b", "title": "30-procentowy wzrost kradzieży w sklepach. \"Kradną wszystko jak leci\"", "date_published": "2022-12-18 11:11:32+00:00", "description": "Od stycznia do października stwierdzono o 30 proc. więcej kradzieży w sklepach niż rok wcześniej — informuje ekspert rynku handlu detalicznego Maciej Tygielski, powołując się na dane policji. Ocenia, że jedną z głównych przyczyn jest inflacja. W sklepach giną produkty żywnościowe i szybko zbywalne.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/poczucie-sensu-jest-podstawa-dobrego-samopoczucia-w-miejscu-zatrudnienia/ckep9x8", "title": "Pokolenie Z nie musi szukać nowego zatrudnienia, chcąc odnaleźć w pracy sens i cel", "date_published": "2022-12-18 11:02:59+00:00", "description": "Biuro naczelnego lekarza USA opublikowało niedawno raport, w którym wymienia \"poczucie sensu w pracy\" jako jeden z pięciu podstawowych filarów dobrego samopoczucia w środowisku zawodowym.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/lifestyle/12-bledow-popelnianych-przez-poczatkujacych-narciarzy-tak-mozna-ich-uniknac/vyxmkfz", "title": "12 błędów popełnianych przez początkujących narciarzy. Tak można ich uniknąć", "date_published": "2022-12-18 10:06:00+00:00", "description": "Chcesz rozpocząć przygodę z nartami, ale nie wiesz, od czego zacząć? Najlepiej od poznania podstawowych błędów. Narciarka z wieloletnim stażem mówi, jak ich uniknąć.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/nasa-wyjasnia-dlaczego-od-50-lat-nie-odbyl-sie-zaden-lot-na-ksiezyc/khv283e", "title": "Minęło 50 lat od ostatniego lotu na Księżyc. NASA wyjaśnia, dlaczego człowiek tam jeszcze nie wrócił", "date_published": "2022-12-18 09:20:46+00:00", "description": "Zdaniem astronautów i zarządu NASA, główny powód, dla którego rozpoczęcie nowej misji na Księżyc trwało tak długo, nie ma nic wspólnego z nauką czy technologią. Największymi przeszkodami okazał się brak pieniędzy i woli politycznej.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/myslisz-o-wlasnej-firmie-oto-10-pomyslow-na-pewny-biznes-w-2023-r/kd14rcd", "title": "Myślisz o własnej firmie? Oto 10 pomysłów na pewny biznes w 2023 r.", "date_published": "2022-12-18 09:05:55+00:00", "description": "Własna firma to świetny sposób na zarabianie pieniędzy, ale tylko pod warunkiem, że postawimy na odpowiednią branżę i taki rodzaj usług, który niemal na pewno znajdzie odbiorców i, co za tym idzie, przyniesie pieniądze. Podrzucamy garść pomysłów, które nie powinny wymagać ani dużych inwestycji, ani wąskich specjalizacji i które możemy zrealizować w każdym miejscu oraz w dowolnym momencie.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/duza-fala-covid-19-rozlewa-sie-po-chinach-media-pisza-o-zgonach-ktorych-nie-ma-w/20eb4r7", "title": "Duża fala Covid-19 rozlewa się po Chinach. Media piszą o zgonach, których nie ma w oficjalnym bilansie", "date_published": "2022-12-18 08:58:06+00:00", "description": "Po nagłym zniesieniu surowych restrykcji pandemicznych po Chinach rozlewa się pierwsza tak duża fala Covid-19 w tym kraju. Według zachodnich mediów w Pekinie pojawiły się już oznaki wzrastającej liczby zgonów, choć nie widać tego w oficjalnych statystykach.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/firmy/robert-maklowicz-rozkreca-nowy-biznes-powstanie-spolka-maklowicz-i-synowie/625g2gh", "title": "Robert Makłowicz rozkręca nowy biznes. Powstanie spółka Makłowicz i Synowie", "date_published": "2022-12-18 08:44:14+00:00", "description": "Robert Makłowicz wchodzi w nowy biznes. Powstaje spółka Makłowicz i Synowie. Wniosek w tej sprawie do Urzędu Ochrony Konkurencji i Konsumentów złożyły firmy Pamapol i Propinquus.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/biznes/produktami-tej-slodkiej-rodziny-zajada-sie-caly-swiat-sekrety-kolanskich/9m5z1hw", "title": "Produktami tej \"słodkiej rodziny\" zajada się cały świat. Zaczęli od małego biznesu w Piątku Wielkim", "date_published": "2022-12-18 08:15:46+00:00", "description": "\"Wtedy modne było takie dokładanie. Niektórzy dokładali — eksport, import. My do tego zioła dołożyliśmy pex i w ten sposób powstał Ziołopex\" — wspominał w jednym z wywiadów Jan Kolański. Z czasem firma zaczęła jednak podbijać rynki zagraniczne, a nazwa wymyślona w latach 90. stała się zbyt trudna do wymówienia. W kolejnych latach Barbara i Jan Kolański zauważyli także, że \"sam biznes przyprawowy nie jest aż tak wielki\", postanowili więc zainwestować w słodycze i tak stali się \"najsłodszym małżeństwem\" w Polsce.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/lifestyle/podroze/na-malcie-coraz-wiecej-polakow-minister-turystyki-tak-wyglada-turysta-z-polski-wywiad/xm23n8v", "title": "Na Malcie coraz więcej Polaków. Minister turystyki: tak wygląda turysta z Polski [WYWIAD]", "date_published": "2022-12-18 07:58:45+00:00", "description": "Malta chce przyciągnąć do siebie turystów z Polski. W tym celu otworzyła w Warszawie biuro swojej organizacji turystycznej. — Nie chcemy rywalizować w oparciu o cenę. Chcemy zachęcać i przyciągać turystów tym, co możemy im zaoferować na miejscu — mówi w rozmowie z Business Insider Polska Clayton Bartolo, minister turystyki Malty.", "persistent": false, "language": "en-US"}], "source": {"url": "https://businessinsider.com.pl/.feed", "title": "Business insider"}}