{"entries": [{"source": "http://rss.cnn.com/rss/cnn_world.rss", "link": "https://www.cnn.com/2022/12/18/asia/afghanistan-fuel-tanker-tunnel-fire-intl/index.html", "title": "Fuel tanker tunnel fire kills at least 19 in Afghanistan", "date_published": "2022-12-18 14:26:02+00:00", "description": "At least 19 people have been killed and 32 others were injured when a fuel tanker caught fire in a tunnel north of the Afghan capital of Kabul, a local official said Sunday.", "persistent": false, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/cnn_world.rss", "link": "https://www.cnn.com/2022/12/18/tech/headphones-design/index.html", "title": "Move over Airpods: These headphones are having a moment", "date_published": "2022-12-18 13:55:42+00:00", "description": "When Huawei recently teased a new smartwatch in a promotional video, it featured an unusual design: the watch face flipped open to reveal a secret compartment where a pair of magnetic earbuds sat inside charging.", "persistent": false, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/cnn_world.rss", "link": "https://www.cnn.com/travel/article/peru-tourists-stranded-protest-panic/index.html", "title": "Mother of a stranded tourist in Peru hopes her daughter makes it home for Christmas, as hundreds grounded amid protests", "date_published": "2022-12-18 01:43:34+00:00", "description": "It's only a week until Christmas, and Mechelle Lutsko is holding onto hope that her daughter, one of the hundreds of tourists stranded in Peru, will make it home in time.", "persistent": false, "language": "en-US"}, {"source": "http://rss.cnn.com/rss/cnn_world.rss", "link": "https://www.cnn.com/2022/12/17/politics/us-military-officials-afghanistan-assistance/index.html", "title": "First on CNN: Retired top military officials push for bill to help Afghans", "date_published": "2022-12-18 00:28:08+00:00", "description": "Roughly two dozen former leaders of the US military -- including retired chairmen of the Joint Chiefs of Staff, a former Supreme Allied commander of NATO and several former commanders in Afghanistan -- sent a letter to US congressional leaders Saturday evening urging them to act quickly to save Afghan allies who currently run the risk of deportation.", "persistent": false, "language": "en-US"}], "source": {"url": "http://rss.cnn.com/rss/cnn_world.rss", "title": "CNN World"}}