{"entries": [{"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-18/usa-policja-szuka-11-latki-matka-nie-zglosila-zaginiecia/", "title": "USA. Policja szuka 11-latki. Matka nie zgłosiła zaginięcia", "date_published": "2022-12-18 21:33:00+00:00", "description": "Matka i ojczym 11-letniej Madaline Cojocari, która zaginęła kilka tygodni temu, zostali aresztowani w sobotę za rzekome niezgłoszenie jej zaginięcie policji.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-18/argentyna-wygrala-mundial-w-katarze-to-bylo-najwieksze-pilkarskie-wydarzenie-ostatnich-lat/", "title": "Argentyna wygrała mundial w Katarze. \"To było największe piłkarskie wydarzenie ostatnich lat\"", "date_published": "2022-12-18 21:21:00+00:00", "description": "- To, co dziś pokazały jedenastki Argentyny i Francji, było niesamowite - powiedział Sebastian Staszewski, dziennikarz Interii Sport w Polsat News. - Sześć bramek, dogrywka i karne - to była piłkarska uczta - dodał. Argentyna zwyciężyła w niedzielnym finale mundialu w Katarze i trzeci raz w historii została mistrzem świata w piłce nożnej.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-18/anglia-policja-znalazla-cialo-dziecka-w-ogrodku-w-zwiazku-ze-sprawa-zatrzymano-dwie-osoby/", "title": "Anglia. Policja znalazła ciało dziecka w ogródku. W związku ze sprawą zatrzymano dwie osoby", "date_published": "2022-12-18 20:40:00+00:00", "description": "Zakopane ciało dziecka zostało znalezione w przydomowym ogrodzie po tygodniowych poszukiwaniach prowadzonych przez policję. Służby potwierdziły, że w związku ze sprawą zatrzymano dwie osoby. Są one oskarżone o spowodowanie lub dopuszczenie do śmierci dziecka.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-18/szwajcaria-skradziono-800-kilogramowa-kule-z-ginem-z-dna-jeziora-bodenskiego/", "title": "Szwajcaria. Skradziono 800-kilogramową kulę z ginem z dna Jeziora Bodeńskiego", "date_published": "2022-12-18 17:09:00+00:00", "description": "Po szwajcarskiej stronie jeziora doszło do nietypowej kradzieży - z dna zbiornika podniesiono ważącą 800 kilogramów, wypełnioną 230 litrami specjalnie przygotowanego ginu kulę ze stali nierdzewnej - czytamy na łamach portalu switzerlandtimes.ch.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-18/marek-budzisz-putin-odwiedzi-bialorus-bo-chce-aby-lukaszenko-zaatakowal-ukraine/", "title": "Marek Budzisz: Putin odwiedzi Białoruś, bo chce, aby Łukaszenka zaatakował Ukrainę", "date_published": "2022-12-18 15:34:00+00:00", "description": "- Intencje jutrzejszej (poniedziałkowej - przyp. red.) wizyty Władimira Putina na Białorusi są oczywiste - powiedział w Polsat News ekspert ds. wschodnich Marek Budzisz. - To presja na Mińsk, aby zaangażował się w wojnę. Łukaszenko zaś ma świadomość, że bezpośrednie wejście w ten konflikt jest złe dla jego reżimu - dodał.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-18/rosja-eksplozje-w-miescie-bielgorod-zginela-jedna-osoba/", "title": "Rosja: Eksplozje w mieście Biełgorod. Zginęła co najmniej jedna osoba", "date_published": "2022-12-18 13:00:00+00:00", "description": "Jedna osoba zginęła, a osiem zostało rannych w wyniku eksplozji w rosyjskim Biełgorodzie - poinformował gubernator okręgu cytowany przez AFP. Bilans ofiar podawany przez niezależnych dziennikarzy jest wyższy. Media kontrolowane przez Kreml informują, że zadziałał system obrony przeciwlotniczej. Biełgorod leży około 40 kilometrów od granicy z Ukrainą.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-18/francja-nie-zyje-kolejny-rosyjski-oligarcha-spadl-ze-schodow/", "title": "Francja. Nie żyje kolejny rosyjski oligarcha. \"Spadł ze schodów\"", "date_published": "2022-12-18 12:18:00+00:00", "description": "Były właściciel największego rosyjskiego koncernu developerskiego miał zginąć we Francji wskutek nieszczęśliwego wypadku. Według włoskiej gazety Il Messagero przebywający we francuskim mieście Antibes na wybrzeżu Morza Śródziemnego Dmitrij Zelenow spadł ze schodów i zmarł. To 21. przypadek tajemniczego zgonu rosyjskiego bądź związanego z Rosją oligarchy lub menadżera w 2022 roku.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-18/watykan-papiez-podpisal-swoja-rezygnacje-list-do-tej-pory-nie-zostal-uzyty/", "title": "Watykan: Papież podpisał swoją rezygnację. List do tej pory nie został użyty", "date_published": "2022-12-18 09:29:00+00:00", "description": "Papież Franciszek, który w sobotę ukończył 86 lat, ujawnił, że gdy tylko został wybrany na głowę Kościoła katolickiego w 2013 roku, podpisał list rezygnacyjny. Miał on zostać wykorzystany w przypadku, gdyby kiedykolwiek doznał ciężkiego i trwałego problemu zdrowotnego, który uniemożliwiłby mu sprawowanie posługi. Franciszek przyznał, że nie wie, kto teraz posiada ten dokument.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-18/rakiety-korei-polnocnej-spadly-do-morza-blisko-wod-japonii-perspektywa-proby-jadrowej/", "title": "Rakiety Korei Północnej spadły do morza blisko wód Japonii. Perspektywa próby jądrowej", "date_published": "2022-12-18 07:24:00+00:00", "description": "Korea Północna wystrzeliła w niedzielę dwie kierowane rakiety, które przeleciały 550 km - podał japoński resort obrony. Spadły do Morza Japońskiego poza strefą ekonomiczną Tokio. Początkowo agencja Reutera informowała, że pociski naruszyły przestrzeń Kraju Kwitnącej Wiśni. Eksperci mówią o bezprecedensowej liczbie testów. Od kilku tygodni mówi się, że Pjongjang może przeprowadzić próbę jądrową.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-18/wojna-w-ukrainie-prezydent-zelenski-reaguje-na-zmasowane-ostrzaly-ukrainy-pilny-apel-do-zachodu/", "title": "Wojna w Ukrainie. Prezydent Zełenski reaguje na zmasowane ostrzały Ukrainy. Pilny apel do Zachodu", "date_published": "2022-12-18 05:38:00+00:00", "description": "Po ostatnich zmasowanych atakach na ukraińskie miasta prezydent Wołodymyr Zełenski zaapelował do zachodnich przywódców o systemy obrony przeciwlotniczej dla broniącego się przed rosyjską agresją kraju. Kluczowe decyzje wciąż czekają na zatwierdzenie i implementację - powiedział w wieczornym wystąpieniu wideo w sobotę ukraiński lider.", "persistent": false, "language": "pl-PL"}], "source": {"url": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Polsat News"}}