[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Switch to these open source apps if you're stuck on Windows or Mac OS!", "description": "Download Safing's Portmaster, or subscribe to the SPN, and take control of your network traffic: https://safing.io/portmaster \n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\nVideo credits: \nGIMP: Davies Media Design: https://www.youtube.com/watch?v=sbyGYmZzl1I\nKrita: SaraTepes: https://www.youtube.com/watch?v=aMHJFdgRjYk\nInkscape: TJ Free: https://www.youtube.com/watch?v=E7HwLTQu2FI\nBlender: Polyfjord: https://www.youtube.com/watch?v=-2HCxy4Kh4E\nDarktable: Davies Media Design: https://www.youtube.com/watch?v=iXyrPT0pFug\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\nYou can also protect your privacy by using this extension from Startpage, each install helps the channel with a small commission: https://add.startpage.com/en/protection/?campaign=4&source=aff \n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:33 Sponsor: Stay private on the internet with Safing\n01:28 Why use Open Source Software?\n02:57 Graphics, 3D work, photo editing\n03:04 GIMP: Alternative to Photoshop\n04:06 Krita: Alternative to Photoshop\n05:09 Inkscape: Alternative to Illustrator\n06:01 Blender: 3D Modeling\n06:46 Darktable: Alternative to Lightroom\n07:37 Media Tools\n07:40 VLC: Video player\n08:21 Audacity: Audio Editing\n09:07 Productivity Apps\n09:09 LibreOffice: Office Suite\n10:05 OnlyOffice: Office Suite\n10:48 Video production\n10:51 Kdenlive: Video Editor\n11:48 Handbrake: Video Converter\n12:38 More Apps!\n13:42 Sponsor: Get your Linux laptop or desktop\n14:19 Support the channel\n\nGIMP\n\nIt's an amazing piece of software, that I personally use for all my design needs, for mockups at my freelance job, for youtube thumbnails, or for quick photo edits. \n\nhttps://github.com/Diolinux/PhotoGIMP\n\nKrita\n\nIf you're more into digital painting, Krita is what you're looking for. It's super flexible, again, with panels you can move around to suit your workflow, it has tons of brushes, and you can further extend that by downloading new ones.\n\nInkscape\n\nFor vector graphics, the go-to open source app is Inkscape. Whether you want to mockup an application or a website, or design an icon, or just draw something, Inkscape can do it all!\n\nBlender\n\nFor 3D modelling, your probably already know about Blender. One might argue it's THE best tool for the job, used by animators, VFX artists and modelers all around the world.\n\nDarktable\n\nDarktable lets you edit your photos non destructively, and your original images are preserved.\n\nVLC\n\nFor video playback, you can't find something as versatile as VLC. It's not the prettiest, but it will play virtually anything, even badly damaged files, that it can even repair.\n\nAudacity\n\nAnother example of an app that doesn't look good at all, but that lets you do a TON of stuff. It's a powerful audio recording and editing station. It can digitize anything, import and export virtually any format, and even combine audio files.\n\n\nLibreOffice\n\nLibreOffice: if you've ever used OpenOffice, forget all about it, because LibreOffice is where it's at. It's faster, it looks better, it's more stable, and it's extremely customizable to let you work with either a toolbar and menubar, or with a more modern ribbon.\n\nOnlyOffice\n\nAnother solution is OnlyOffice. Its compatibility is better than LibreOffice, and I've been using it for a year or so, now, trading files back and forth with people using MS Office, without any issues whatsoever.\n\nKdenlive\n\nFor video editing, Kdenlive will probably be your go-to. It's a wonderful non linear video editor, with very powerful features to organize your media, edit your project, and render it in a format of your choosing.\n\nHandbrake\n\nFor converting video into other formats, handbrake is what you need. It can rip DVDs into a single file, convert any format to any other, using any codec you might want for audio, and for video, and any container format you prefer.", "link": "https://www.youtube.com/watch?v=uundIaRNJ6A", "date_published": "2022-04-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]