[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "5 Shooters To Play That Aren't Call of Duty", "description": "Call of Duty, and Battlefield have stumbled out the gates and fans are starting to look elsewhere for FPS and 3rd Person Shooter games. Here's a list of 5 must play games you should check out.\n\nCall of Duty and Battlefield 2042 were both games that were primed to hit all the usual high notes expected of a solid AAA shooter. Unfortunately both games received a lukewarm reception, with 2042 having a swath of stability issues and glitches at launch while fielding criticisms from its community over the handling of specialists instead of the original class system. Call of Duty: Vanguard on the other hand lacked excitement, with that community fragmented between Warzone, and those who preferred older games like Modern Warfare 2019, or Cold War. In this video we break down and share six shooting games that you definitely need to check out if you’re in the market for something different.\n\nWe’ve got a solid variety here with games like Splitgate pushing the needle into experimental territory fusing two classic games in Halo and Portal. There’s also excellent live-service games like Destiny 2 which recently had its Witch Queen expansion. Reviewer Phil Hornshaw called it the best iteration Destiny 2 has seen yet. Be sure to like and subscribe and go to the comments, sharing your thoughts on what games you’re currently playing and what you think should make our part two list.", "link": "https://www.youtube.com/watch?v=at84ajc-H4Y", "date_published": "2022-04-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Item Causes Ban From Game - Be Careful | GameSpot News", "description": "An item in Elden Ring is causing 180 day bans, Let Me Solo Her becomes a summon mod and Battlefield 2042’s 4.0 update gets patch notes and a release date\n#GamingNews #EldenRing #Battlefield2042\n\nThese forbidden undies are a piece of leg armor called the Deathbed Smalls. The item reportedly belongs to a set alongside the Deathbed Dress, but unlike the dress, the panties are unobtainable through a quest and seems to have been cut from the game’s final release. One of those players, ironically named Pantsu Dealer, is invading other worlds and leaving the cursed item behind for unsuspecting players. This has resulted in tons of 180-day ban reports from players on the Elden Ring subreddit. \n\nThe famous Let Me Solo Her, is now an NPC summon thanks to a mods from Gardebn of Eyes. This Elden celebrity is a pot-head hero who has been soloing Malenia, one of the game’s hardest bosses, and helping other players who are having trouble taking her down themselves. This mod replaces the games Lone Wolf ashes and can take Malenia out pretty quickly.\n\nThere are a lot of changes coming to Battlefield 2042 Tuesday, April 19; over 400 changes in total, including big changes for weapon attachments, voice chat functionality, and improvements for the end-of-round menu.\n\nPatch Notes: https://www.gamespot.com/articles/battlefield-2042-patch-notes-for-big-4-0-update-have-arrived-see-all-the-changes/1100-6502547/\n\nSTAMPS\n00:00 - Intro\n00:09 - Elden Ring Item\n01:06 - Let Me Solo Her\n01:43 - Battlefield 2042 Update 4.0\n02:57 - COD Warzone", "link": "https://www.youtube.com/watch?v=_nzUex9RaMg", "date_published": "2022-04-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Star Wars Game From Uncharted Creative Director, For Real This Time | GameSpot News", "description": "A new Star Wars game is announced from Uncharted writer following her canceled EA Star Wars game, Crazy Taxi and Jet Set Radio are reportedly getting reboots, and a Game Boy emulator leaks for Switch.\n#GamingNews #StarWars #Switch\n\nSkydance New Media has announced that it is working with Lucasfilm Games on a new Star Wars action-adventure game that will feature an original story. The project is led by Uncharted director Amy Hennig who joined Visceral Games in 2014 to work on another Star Wars game codenamed Project Ragtag. However, EA canceled the project alongside closing Visceral Games.\n\nAccording to a report from Bloomberg, it's still early days for both projects and either one could be scrapped, although it's claimed that the Crazy Taxi reboot has been in development for more than a year and could be released by 2025 at the latest.\n\nA Game Boy Advance emulator for Switch has reportedly leaked. As spotted by Twitter user Trashbandatcoot, files containing emulators in development by Nintendo Europe Research and Development originally leaked onto 4Chan. Dozens of titles have been tested so far and include a number of classic Nintendo games and hidden gems.\n\nSTAMPS\n00:00 - Intro\n00:09 - New Star Wars Game\n01:11 - Crazy Taxi and Jet Set Radio\n02:07 - GBA on Switch\n03:10 - Snoop Dogg\n03:18 - Elden Ring", "link": "https://www.youtube.com/watch?v=xi80GyIN0gc", "date_published": "2022-04-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "World of Warcraft Dragonflight Expansion Reveal and Breakdown Showcase", "description": "Learn more about the latest expansion coming to the World of Warcraft, Dragonflight in this latest showcase. We get a glimpse of a brand new reveal cinematic trailer, as well as deep dives on how the story comes together, looks at the various areas and regions to explore, the new class Dracthyr Evoker, the revamped talent system, and professions update.\n\n#WorldofWarcraft #Dragonflight\n\n0:00 Intro\n6:34 Dragonflight Expansion Reveal Cinematic\n11:53 Dragonflight Expansion Breakdown\n21:09 Wrath of the Lich King Cinematic Trailer\n22:34 Wrath of the Lich King Breakdown\n26:46 Weaving the Story of Dragonflight\n33:02 Waking Shores and Ohn’ahran Plains Preview\n39:24 Azure Span and Thaldraszus Preview \n44:43 Dracthyr Evoker & Dragonriding Preview\n50:19 Talent Tree System Revamp and User Interface Updates\n56:06 Professions Revamp Breakdown", "link": "https://www.youtube.com/watch?v=lINxx-5nzOY", "date_published": "2022-04-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "World of Warcraft Dragonflight Official Announce Cinematic Trailer", "description": "Revel in the power of dragons of this new cinematic trailer for the newest expansion for World of Warcraft, Dragonflight. Some of the new things to be ready for are listed below.\n \n- New Race & Class: Dracthyr Evoker\n- Talent System & Professions Revamp\n- New Feature: Dragonriding\n- User Interface Update\n- New Zones, Dungeons, & Raids\n\n#WorldofWarcraft", "link": "https://www.youtube.com/watch?v=14g6HjctkLA", "date_published": "2022-04-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "World of Warcraft Expansion Reveal Livestream", "description": "Tune in at 9am PDT to see what's next for World of Warcraft in this latest expansion reveal livestream.\n\n#WorldofWarcraft", "link": "https://www.youtube.com/watch?v=eVR_7LAhmdM", "date_published": "2022-04-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Playdate Console Review", "description": "The Playdate is a tiny little handheld filled with wonder and games you can't find anywhere else. Understated 1-bit black and white visuals and quirky crank-turning gameplay give the Playdate a unique charm. But this isn't just a novelty device; the Playdate feels like it has lasting power thanks to its stellar design and open and inviting approach to game development that will undoubtedly lead to many more cool and interesting games after the first season wraps.\n\nYou can read the full written Playdate review by Steven Petite on GameSpot.", "link": "https://www.youtube.com/watch?v=drRSz-bbw1E", "date_published": "2022-04-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]