[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Minutes of Like a Dragon: Ishin! Gameplay", "description": "Check out 10 of gameplay from the upcoming remake, Like a Dragon: Ishin, showing off a cutscene and open world gameplay.\n\nLike a Dragon: Ishin is a remake of the 2014 game, Ryū ga Gotoku Ishin! It's a  spin off of the Yakuza series, taking place in the late Edo Period of Japan. Major characters of the franchise play the role of historical figures such a Kiryu Kazuma as Sakamoto Ryōma. The remake will also include familiar faces from Yakuza 0 and Yakuza Like a Dragon.\n\n#gaming #likeadragonishin #tgs", "link": "https://www.youtube.com/watch?v=NsDNe6Aimhw", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "COD Modern Warfare II Multiplayer & Warzone 2.0 Official Reveal Trailer | COD Next Showcase 2022", "description": "Get your first look at Call of Duty: Modern Warfare 2's Warzone 2.0, as well as a look at multiplayer. Dive into the future of Call of Duty in this latest trailer that was showcased during the Call of Duty Next Showcase.\n\nCall of Duty: Modern Warfare II releases on October 28, 2022. You can play the campaign a week early if you pre-order the game.\n\n#cod #callofduty #gaming", "link": "https://www.youtube.com/watch?v=2NTAi7uP3LM", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "COD Next Showcase Livestream | Call of Duty: Modern Warfare II", "description": "Presented by Infinity Ward, Call of Duty Next will provide in-depth information on Call of Duty: Modern Warfare II Multiplayer, the next Call of Duty: Warzone, and Call of Duty Warzone: Mobile.\r\n\r\n#gaming #callofduty #modernwarfare2", "link": "https://www.youtube.com/watch?v=0sbfyD79j4Q", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "COD Warzone 2.0 New Gulag & Map Explained | GameSpot News", "description": "Call of Duty: Warzone fans have been hungry for more information about the game’s sequel Warzone 2.0. Fortunately they got a big plate of food at today’s Call of Duty Next event that included a reveal of the game’s map, how it differs from the original Warzone and launch details. \n\nLet’s start with the new location. Call of Duty: Warzone 2.0's map is called Al Mazrah, and it takes place in the desert of a fictional region of Western Asia. Some of the points of interest include: Quarry, Airport, Taraq Village and Al Mazrah City just to name a few. This new map features a river that runs through the middle, offering seasoned Warzone players a new way to traverse a Call of Duty BR. \n\nNew ways to move around the map will really come in handy when the circle starts to close or better yet, when the circles start to close.  \n\nWarzone 2.0 will have a brand-new circle mechanic for Al Mazrah, with multiple circles appearing and changing end-game scenarios when they eventually combine into one again. \n\nWhen you happen to fall victim to the gas or an enemy player, you’ll be greeted with the game’s revamped \"Gulag 2.0,\" where players must battle it out via 2v2 instead of the normal 1v1 arena. This new second chance Gulag will include the need to loot for weapons, deal with something called \"The Jailer,\" and more.\n\nAl Mazrah will also feature areas that are controlled by an AI faction; these sections are called Strongholds. The developer says this addition of AI is meant to add higher stakes and more realistic combat scenarios to the Warzone experience. \n\nSTAMPS\n00:00 - Intro\n00:19 - Map\n01:57 - DMZ\n02:13 - Raids\n02:42 - Anti-Cheat", "link": "https://www.youtube.com/watch?v=LlZR_i7bQZs", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "COD: Modern Warfare II Invasion, Prisoner Breakout, and More Modes Overview | COD Next Showcase 2022", "description": "A brand new mode called Invasion is coming to CoD: MWII. While there's a clear objective, you won't have an announcer yelling at you, and the mode will include plenty of AI you'll be fighting against. 2 6v6 modes are on the way as well in Prisoner Rescue & Knockout. Prisoner Rescue is an attack and defend mode, where one team is trying to break a prisoner out. 3rd person mode is also coming to Call of Duty: Modern Warfare II.\n\n#cod #mw2 Gaming", "link": "https://www.youtube.com/watch?v=RkueQgPRQnQ", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty Next Full Showcase | COD Modern Warfare II", "description": "We learn more details about the future of Call of Duty with the COD Next 2022 Showcase. We learn more about the new mechanics coming to Call of Duty: Modern Warfare 2, the gunsmith, new maps, modes, 3rd person POV, and Warzone 2.0. See the timestamps below!\n\nTimestamps\n00:00 - Introduction\n00:30 - What's New, Water, Ledge Hanging, Gadgets\n10:15 - Gunsmith\n13:23 - Maps\n16:49 - Modes\n19:46 - 3rd Person POV Mode\n24:24 - Warzone 2.0\n37:04 - DMZ\n40:22 - COD Mobile\n\n#cod #callofduty #gaming", "link": "https://www.youtube.com/watch?v=wlSDqrPj48U", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Mobile Warzone Official Reveal Trailer | COD Next Showcase 2022", "description": "Get ready to drop in from wherever life takes you with classic Call of Duty: Mobile Warzone. It features 120 live players, and the return of the classic Battle Royale map Verdansk! COD Warzone Mobile is a world-class MOBILE-first experience, down to its core. \n\nPre-register now: https://bit.ly/GooglePlayWarzoneMobile \n\n#codmobile #cod #warzone #gaming", "link": "https://www.youtube.com/watch?v=Hdm64HTRhuQ", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Modern Warfare II Maps Overview | COD Next Showcase 2022", "description": "Joseph Cecot breaks down Sarrif Bay, one of Modern Warfare 2's biggest maps. as well as a smaller map called Mercado Las Almas during the Call of Duty Next Showcase.\n\n#cod #mw2 #gaming", "link": "https://www.youtube.com/watch?v=I0GtMjh59B0", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Modern Warfare II What's New Overview | COD Next Showcase 2022", "description": "Stephanie Snowden and Joseph Cecot explain how aquatic combat changes gameplay Modern Warfare 2's multiplayer as well as the addition of a ledge hang component, which is similar to a high mantle. Also we learn more about underwater combat.\n\n#cod #callofduty #mw2 #gaming\n\nTimestamps\n0:00 Introduction\n1:00 Under Water Combat\n2:07 High Mantle and Ledge Hang", "link": "https://www.youtube.com/watch?v=Lh7u2sT4zgs", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Warzone 2.0 Map, New Gulag, DMZ, Release Date and More | COD Next Showcase 2022", "description": "Call of Duty: Warzone 2.0's new map Al Mazrah features wide variety of points of interest like Quarry, Rohan Oil, and Al Mazrah City. Some new changes include: proximity chat, new looting, an all new gulag, circle splitting and an AI mode called Strongholds. An all new Sandbox experience is coming to COD Warzone 2.0, DMZ - which is Call of Duty's Extraction Mode. In DMZ you can control your own win condition. Warzone 2.0 comes out Free to Play November 16, 2022.\n\n#cod #callofduty #gaming \n\nTimestamp\n0:00 Introduction\n1:15 Shared Universe\n2:00 Brand New Map Al Mazrah\n4:58 What's New in Warzone 2.0\n6:07 New Vehicles and Player Mechanics\n9:37 New Circle Mechanics\n11:30 Strongholds Breakdown\n12:37 DMZ\n14:46 Warzone 2.0 Launch Date", "link": "https://www.youtube.com/watch?v=a86BtVdz3yY", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Capcom Online Program Full Presentation | TGS 2022", "description": "Check out news from Monster Hunter Rise: Sunbreak, Exoprimal, Resident Evil Village Gold Edition, Resident Evil 4, and Street Fighter 6.\n\n0:00 Introduction\n1:24 Monster Hunter Rise: Sunbreak\n8:21 Resident Evil Village and Resident Evil 4 Updates\n15:31 Exoprimal\n23:28 Megaman Battle Network Legacy Collection\n26:27 Street Fighter 6 Character Reveals, Battle Hub, Fighting Ground\n\n#capcom #tgs2022 #gaming", "link": "https://www.youtube.com/watch?v=VtiwUu31uuA", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Capcom Online Program TGS 2022 Livestream", "description": "Tune in for news on the latest titles from Capcom including, Street Fighter 6, Exoprimal, Mega Man Battle Network Legacy Collection, Resident Evil Village Gold Edition, and Monster Hunter Rise: Sunbreak Title Update 2.\r\n\r\n#capcom #TGS #gamespot", "link": "https://www.youtube.com/watch?v=Rug0nUT2vrA", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Crisis Core Final Fantasy VII Reunion Gameplay | TGS 2022", "description": "Check out over 9 minutes of gameplay from Crisis Core Final Fantasy VII Reunion captured on a PlayStation 5. \n\nIn the first part of the gameplay we fight the Vadjradhara mini boss. The hard part is we have to deal with two at the same time! Watch as we fight them both with various combat mechanics, including traditional melee combat to using our materia.\n\nThe second boss fight we get to show off is a fight against Ifrit the Fire Summon. Will we defeat this tough and dangerous foe? Find out in this latest gameplay clip from TGS 2022 for Crisis Core Final Fantasy VII Reunion.\n\nCrisis Core Final Fantasy VII Reunion follows the story of Zack Fair, a young warrior admired by the boy destined to save the world, trusted by men renowned as heroes of legend, and loved by the girl who holds the fate of the planet in her hands. Learn more about the tale of Zack in this grand saga that has broken the limits of an HD remaster.\n\n#ff7 #crisiscore #gaming \n\nTimestamps \n0:00 Intro\n0:10 Vadjradhara Fight\n5:06 Ifrit Fight", "link": "https://www.youtube.com/watch?v=KXq96lIiN0Q", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "GDoCExpo Direct 2022 - Indie Games Showcase Livestream", "description": "The GDoCExpo Direct returns with exclusive announcements and updates from your new favorite game creators. Brought to you by the Game Devs of Color Expo.\n\n#gaming #GDoCExpo #indies", "link": "https://www.youtube.com/watch?v=-9BUcLm5at0", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "NBA 2K23 Review", "description": "The annual NBA 2K installment is back with NBA 2K23, this time featuring Devin Booker on the standard cover, and NBA superstar Michael Jordan on the \"Michael Jordan Edition\" and \"Championship Edition\" covers. \n#nba2k23 #gamespot #nba2k \n\nFan favorite feature MyPlayer returns to NBA 2K23 featuring a storyline of your player getting drafted to an NBA team of your choice, but being boo'd by team fans as they were hoping your college rival, Shep Owens, would be drafted over you.\n\nMeanwhile, the game contains a blast from the past with MyNBA mode, which allows you to start your NBA career not only in modern times, but during classic eras in NBA history. From Larry vs. Bird, to the Jordan Era, to the Kobe Era. And that's not the last of Michael Jordan in NBA 2K23. NBA 2K11's The Jordan Challenge returns, this time completely revamped and with not just 10 classic Jordan games, but 15 classic games for you to play and relive, right along with interviews from major sports figures who were right alongside the action.\n\nWhile most of the game boasts major improvements, including in the way the game has tackled giving power back to strong finishers and slashers, modeling this after the play of Bucks forward Giannis Antetokounmpo, invasive microtransactions are still a major hurdle to overcome. The game's MyTeam mode is just as bad as comparable modes like Ultime Team in EA Sports games. It's essentially pay-to-win. Meanwhile, the game's MTX continue to dampen The City, with this Virtual Currency meaning you can dramatically improve your MyPlayer protagonist who can then use this player in PvP.\n\nMake sure to watch the full review for all of Mark Delaney's thoughts on NBA 2k23, and stay tuned to GameSpot for all things gaming.", "link": "https://www.youtube.com/watch?v=UZ6lQNsYWbI", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "One Piece Odyssey Official Release Date Trailer", "description": "Check out the release date trailer for One Piece Odyssey. You head on a new adventure with your powers stripped away from the team. How will Luffy and the Strawhats overcome this new journey.\n\nOne Piece Odyssey lands on PlayStation, XBOX and PC Digital on January 13, 2023.", "link": "https://www.youtube.com/watch?v=FgUlJzWw7nQ", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 Kiriko Official Gameplay Trailer | TGS 2022", "description": "Get a glimpse of Kiriko the newest Hero to join the Overwatch roster. You'll get to see her in action in this latest Overwatch 2 trailer. \n\n#overwatch #overwatch2 #gaming", "link": "https://www.youtube.com/watch?v=6j7uurcJG3w", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 Season 1 Official Trailer", "description": "New heroes join the fight and all-new rewards await in Overwatch 2 Season 1.\n\nLearn more about Overwatch’s most rewarding experience to date, including the Season 1 Battle Pass, which offers players 80 tiers of rewards through the season. \n\nAs a part of the free track, players can earn and unlock Overwatch 2’s new support hero “Kiriko”, Epic skins, and a collection of new cosmetic items. \n\n#overwatch2 #gaming", "link": "https://www.youtube.com/watch?v=HbElkgWy_Y0", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Palworld TGS 2022 Trailer", "description": "Check out a brand new trailer for Palworld from TGS 2022.\n\n#palworld #tgs #gaming", "link": "https://www.youtube.com/watch?v=7tVwvbv6GjE", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village Gold Edition and Resident Evil 4 Full Presentation | Capcom TGS Showcase 2022", "description": "Learn more about Resident Evil Village Gold Edition, Shadows of Rose, the cloud versions of Resident Evil coming to Switch, Resident Evil Village VR, and some information about Resident Evil 4.\n\nWe also find out there will be a Resident Evil showcase in October of 2022.\n\n#capcom #residentevil #tgs #gaming \n\nTimestamps\n0:00 Introduction\n0:25 Resident Evil Village Gold Edition\n1:30 Shadows of Rose DLC\n2:30 Winters Expansion Mercenaries Additional Orders\n3:32 Resident Evil coming to Macbook\n4:22 Resident Evil coming to Switch via Cloud\n5:30 Resident Evil Village VR\n6:00 Resident Evil 4 Update", "link": "https://www.youtube.com/watch?v=mw9wJM5YIOw", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Street Fighter 6 E. Honda, Blanka, Ken, Dhalsim 4K Reveal Trailer | Capcom TGS 2022", "description": "Get your first detailed look at World Tour in Street Fighter 6. Fully customize your avatar with robust options and equip the right gear for your playstyle. Hit the streets with Luke as your guide and learn from the Masters during your adventure. Bring that avatar into the Battle Hub to play online matches, partake in tournaments, or play classic Capcom games. \n\nPlay Street Fighter like never before with Extreme Battle, a party mode where you can set up unusual rules and gimmicks, making for battles than anyone can enjoy. Finally, Ken, Blanka, Dhalsim, and E. Honda join the ever-growing roster.\n\n#streetfighter6 #tgs #gaming", "link": "https://www.youtube.com/watch?v=0fK00krJ390", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Street Fighter 6 Full Presentation | Capcom Special Program TGS 2022 (Japanese Audio)", "description": "Check out a bunch of Street Fighter 6 news that came out of the Capcom Special Program at TGS 2022.\n\nWe get brand new character reveals for Ken, E. Honda, Dhalsim, and Blanka as well as a look at the World Tour, Fighting Ground and Battle Hub. Additionally, we get a new commentator reveal and a closed beta test announcement trailer.\n\n0:00 Introduction\n0:19 Ken, E. Honda, Dhalsim, Blanka Reveal Trailer\n4:19 Fighting Ground Breakdown\n7:28 New Commentator Joins the Battle\n9:42 World Tour Breakdown\n9:59 Character Customizer\n13:08 Closed Beta Announcement", "link": "https://www.youtube.com/watch?v=SHHFA2WummI", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Street Fighter 6 Ken, Blanka, Dhalsim, E. Honda Official Reveal Trailer | Capcom TGS 2022", "description": "Get your first detailed look at World Tour in Street Fighter 6. Fully customize your avatar with robust options and equip the right gear for your playstyle. Hit the streets with Luke as your guide and learn from the Masters during your adventure. Bring that avatar into the Battle Hub to play online matches, partake in tournaments, or play classic Capcom games. \n\nPlay Street Fighter like never before with Extreme Battle, a party mode where you can set up unusual rules and gimmicks, making for battles than anyone can enjoy. Finally, Ken, Blanka, Dhalsim, and E. Honda join the ever-growing roster.\n\n#streetfighter6 #tgs #gaming", "link": "https://www.youtube.com/watch?v=3WdBNkoDTfg", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Wo Long: Fallen Dynasty Game Overview | Xbox TGS 2022 Showcase", "description": "Get an overview of Wo Long: Fallen Dynasty with the developers during the Xbox TGS 2022 showcase. You'll learn more about various gameplay mechanics and more.\n\n#wolongdynasty #xbox #tgs #gaming", "link": "https://www.youtube.com/watch?v=Nebwa5FqZoE", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xbox Tokyo Game Show 2022 Full Showcase", "description": "Check out the full Xbox presentation at TGS 2022. We got to a story trailer for Exoprimal, learn more about Wo Long: Dynasty, as well as glimpses of upcoming games coming to Xbox Game Pass.\n\n#xbox #tgs #gaming \n\nTimestamps:\n0:00 Introduction with Phil Spencer\n3:29 Persona 5 The Royale\n5:01 Wo Long: Dynasty\n10:03 Exoprimal Story Trailer\n12:05 Blazblue Cross Tag Battle Special Edition\n13:33 Guilty Gear -Strive-\n15:22 Naraka Bladepoint \n18:59 Ni No Kuni 2 Revenant Kingdom\n20:31 New Dangaronpa v3\n21:54 New Overwatch 2 Hero\n24:22 Eiyuden Chronicle: Hundred Heroes\n28:45 Dyson Sphere Program\n30:08 Palworld\n33:23 Deathloop", "link": "https://www.youtube.com/watch?v=yC7kvgjz6VE", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xbox Tokyo Game Show 2022 Presentation Livestream", "description": "Tune to see updates on titles from Xbox Game Studios and developer partners coming to Japan, Asia, and the rest of the world.\r\n\r\n#xbox #TGS #gamespot", "link": "https://www.youtube.com/watch?v=qsa3PQu8hic", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War Ragnarok Gets A Story Trailer, DualSense Controller | GameSpot News", "description": "A new trailer and controller for God of War Ragnarök, hands-on with PSVR2 and a bunch of new Yakuza/Like a Dragon games.\n#Gaming #GodOfWarRagnarok #PSVR2 \n\nThe first limited edition DualSense controller, our first hands-on with PSVR 2, and more Yakuza games than you can shake a stick at. All this on today’s GameSpot News. \n\nAlongside a new trailer for God of War: Ragnarok during PlayStations recent State of Play also came the reveal of a branded DualSense controller. Featuring an icy white and blue style inspired by Midgard along with images of a bear (Kratos) and a wolf (Atreus).\n\nThe story trailer itself gives us our best look yet at the plot of the game. We get an extensive narration from Tyr, the Norse God of War, who crosses paths with Kratos and questions his Greek counterpart’s motivations. The trailer shows of an extensive breadth of different locales, as well as a bevy of new enemies, the developer having explained previously to Game Informer that the studio was focused on an increased variety of foes.\n\nThe trailer ends with two incredible moments. We first get Kratos and Atreus standing next to two large wolves staring up at an eclipse.\n\nI do want to point out, without proper eye protection. Remember, these are ancient gods, so don’t try this at home.\n\nSpoilers for God of War 2018, Atreus, who was revealed to be Loki at the end of the game, then shoots an arrow at the Moon, one of the wolves chasing it as it begins to move across the sky, tearing it as it goes. This likely indicates that the two wolves are Sköll and Hati, the sons of the wolf Fenrir, whom himself is the son of Loki.\n\nReally interested to see how they explain that in this game.\n\nIn the Norse myth, Sköll and Hati are fated to chase the Sun and the Moon, to then catch them in Ragnarok, plunging the world into darkness, so what we’re seeing in this trailer is potentially our first glimpse of the game’s take on the titular event.\n\nThe final shot of the trailer is then Kratos squaring off against Thor, as the former tosses the Leviathan Axe and the latter throws the hammer Mjolnir, the two colliding before their masters pull them back with magic toward their hands.\n\nMetal.\n\nTIMESTAMPS: \n00:12 - God of War Ragnarök\n02:04 - PSVR2\n02:48 - Like a Dragon", "link": "https://www.youtube.com/watch?v=ODWt-ofaa-A", "date_published": "2022-09-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "ID@Xbox Fall Showcase Livestream", "description": "Tune in for another ID@Xbox showcase, featuring updates and new announcements from indie games coming to Xbox, including Metal: Hellsinger, You Suck at Parking, and Ghostbusters: Spirits Unleashed.\r\n\r\n#xbox #gaming #gamespot", "link": "https://www.youtube.com/watch?v=s3L8TJDGhGA", "date_published": "2022-09-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PSVR2's Small Iterations Make For Impressive Changes", "description": "PlayStation VR 2 makes the most of the PS5, and Horizon Call of the Mountain is an excellent showcase of what the new headset will be able to do. Learn more about Tamoor Hussain's experience in this latest hands on preview for the PlayStation VR 2 and Horizon Call of the Mountain.\n\n#psvr2 #playstation #gaming", "link": "https://www.youtube.com/watch?v=L-dFKRiwbxw", "date_published": "2022-09-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Legend of Zelda: Tears of the Kingdom - Things You Might Have Missed", "description": "Max Blumenthal combs over the latest trailer from BOTW sequel, Tears of the Kingdom. From where these locations are referencing to how the name connects to the game, we breakdown what we might be looking forward to in the follow up game.\n\nThe Legend of Zelda: Breath of the Wild 2 finally dropped its official name, Tears of the Kingdom will be released May 12th of 2023. We’ll take a quick look at what we saw and put some more insight into things you might have missed during the trailer. \n\nWe open up to multiple scenes with multiple stone carvings. I won’t pretend to know everything about Zelda lore and history, but what I do know is that surface level connections can be made immediately to this creature and its Zonai origins, with these common designs seen over and over again, and another part we’ll see in another scene.  \n\nWe then see an incoming army with malice of the new long horned Bokoblins and Moblins defeating either Hylians or some other tribe we don't know yet. They obviously look human but this could be anything from Hylians, to Sheikah, to some Zonai tribe we haven’t seen yet. We will likely know in the future. Another thing I’d like to point out is that EVERY trailer so far has had some Ghibli reference thrown in again, this time from Nausicaa Valley of the Wind, where tapestries of an age long past were shown with somber piano music. We have shown this proof from Castle in the Sky with the floating land masses with roots growing through them, to how malice interacts with Link’s arm to Princess Mononoke, and more, and it’s cool that they’re keeping up with this motif.\n\n#thelegendofzelda #tearsofthekingdom #gaming", "link": "https://www.youtube.com/watch?v=zURG4RWnpjk", "date_published": "2022-09-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]