[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Lab viral origins report", "description": "The Lancet Commission on lessons for the future from the \nCOVID-19 pandemic, 14th September 2022\nhttps://www.thelancet.com/journals/lancet/article/PIIS0140-6736(22)01585-9/fulltext\n\nhttps://covid19commission.org\n\nViral origins\n\nThe proximal origin of SARS-CoV-2 remains unknown. \n\nThere are two leading hypotheses: \n\nthat the virus emerged as a zoonotic spillover from wildlife or a farm animal, \n\npossibly through a wet market, \n\nin a location that is still undetermined; \n\nor that the virus emerged from a research-related incident, \n\nduring the field collection of viruses,\n\nor through a laboratory-associated escape. \n\nNo independent, transparent, and science-based investigation has been carried out regarding the bioengineering of SARS-like viruses that was underway before the outbreak of COVID-19. \n\nThe laboratory notebooks, databases, email records, and samples of institutions involved in such research have not been made available to independent researchers. \n\nIndependent researchers have not yet investigated the US laboratories engaged in the laboratory manipulation of SARS-CoV-like viruses, \n\nnor have they investigated the details of the laboratory research that had been underway in Wuhan.\n\nUS National Institutes of Health (NIH) has resisted disclosing details of the research on SARS-CoV-related viruses that it had been supporting,\n\nproviding extensively redacted information only as required by Freedom of Information Act lawsuits.\n\nIn brief, there are many potential proximal origins of SARS-CoV-2, but there is still a shortfall of independent, scientific, and collaborative work on the issue. \n\nThe search for the origins of the virus requires unbiased, independent, transparent, and rigorous work by international teams in the fields of virology, epidemiology, bioinformatics, \n\nand other related fields, and supported by all governments.\n\nIn the absence of an unbiased, independent, and rigorous search for a natural origin by a multidisciplinary team of experts alongside an unbiased, independent, and rigorous investigation of the research-related hypotheses, \n\nthe public's trust in science will be imperilled, \n\nwith potentially grave long-term repercussions. \n\nIt is therefore crucial to investigate all hypotheses fully, \n\nnot only to ascertain the source of the pandemic and to protect against future emerging infectious diseases, \n\nbut also to ensure the integrity of science itself. \n\nThe perceived lack of transparency to date by leading scientific agencies and laboratories is troubling and needs to be addressed.\n\nStrategies to prevent research-related releases should include stronger international and national oversight of biosafety, \n\nbiosecurity, and biorisk management, \n\nincluding the strict regulation of gain of function research of concern.\n\nWhen investigating the origins of any novel pathogen, \n\npotential hypotheses should not be prematurely rejected to ensure that time-sensitive data—\n\nsuch as early case information and laboratory records—are collected.", "link": "https://www.youtube.com/watch?v=d0hpT00a8xg", "date_published": "2022-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Africa, low vaccination, covid over.", "description": "Despite very low vaccination rates, Uganda is now essentially over the pandemic. Do watch this video, we in the West can learn a lot.\n\nCheck out Wewafwa's channel for more great content from Uganda, https://www.youtube.com/c/WefwafwaAndrew\n\nSubscribing to this channel will help our community health work.\n\nVisit to Grandma Alice, light and validation of spending, https://www.youtube.com/watch?v=8Y5l8djeCFk&t=72s", "link": "https://www.youtube.com/watch?v=aYyoiFEUq-Y", "date_published": "2022-09-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Village health and disease", "description": "Direct link to original video, https://www.youtube.com/watch?v=ddRPIY4u50U\nFor more reports from Uganda, https://www.youtube.com/c/WefwafwaAndrew", "link": "https://www.youtube.com/watch?v=3hdF0tmcVyE", "date_published": "2022-09-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]