[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Patti LaBelle: Tiny Desk (Home) Concert", "description": "NPR Music's Tiny Desk series will celebrate Black History Month with Tiny Desk (home) concerts featuring legends in the world of R&B, jazz, gospel, and hip-hop. Each artist in this legacy lineup has helped to define Black music as we know it and will be performing a Tiny Desk concert for the first time.\n\nBobby Carter | February 23, 2022\nThe first song in Patti LaBelle's Tiny Desk (home) concert sets the tone and quickly sums up the entire 15-minute performance. \"Something Special (Is Gonna Happen Tonight)\" from her 1986 album Winner In You is a highlight from one of many chapters in her fabulous career. A backstage corner of a concert hall in Austin, Texas, is transformed into Patti's world, furnished with a throne, flowers and trunks full of shoes. Options are a must, given a knack for kicking off her shoes during shows. The entire band managed to fit onto the set: thirteen people, including fierce background vocals, keys, horns and more, to recreate some of the best from the Godmother of Soul.\n\nLaBelle and company go straight into hits mode after the first number. \"Love, Need and Want You\" is delivered with the same vibrancy as the 1983 original, with a wink to another hit, \"Dilemma,\" by Nelly, who sampled it 19 years later. The ballads continue with \"If Only You Knew.\" She closes with the anthem \"Lady Marmalade,\" which was also revived in the early 2000s by Christina Aguilera, Mya, Pink and Lil' Kim.\n\nMs. Patti had already made Black History with Cindy Birdsong, Sara Dash and Nona Hendryx as the powerhouse group Patti LaBelle and the Bluebelles (later Labelle). After the group disbanded, she forged through on her own as a pioneer in music, style and entrepreneurship. Sixty years and counting. Whether big stage or Tiny Desk, the standard-bearing icon continues to exude elegance and grace as a performer.\n\nSET LIST\n\"Something Special (Is Gonna Happen Tonight)\"\n\"Love, Need and Want You\"\n\"If Only You Knew\"\n\"Lady Marmalade\"\n\nMUSICIANS\nPatti LaBelle: vocals\nStan Lewis: keys/music director\nDanny Nixon: keys\nDaryl Robertson: keys\nEric Seats: drums\nAlex Evans: bass\nEric Dubose: guitar\nJeff Bradshaw: trombone\nMelvin Jones: trumpet\nMichael Burton: saxophone\nDebra Henry Ramsey: vocals\nBrenda Roy: Background vocals\nAnthony Williams Jr: vocals\nAja Marie Grant: vocals\n\nCREDITS\nVideo Director: Whitney Thomas\nAudio Engineer: Dwayne Jones\nRecording Engineer: Brandon Snell\nManagement: Zuri Edwards\nProduction Manager: Joe Falcon\nRoad Manager: Pamela Hobson\nGuitar Tech: Alfonso Perez\nBackline Tech: Gabriel Santana Falcon, GearHeadz Inc.\nTechnical Director: Blake Addyson\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Joshua Bryant\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Kara Frame, Maia Stern, Ashley Pointer, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=iX_ubL2-sfs", "date_published": "2022-02-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Buffalo Nichols: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nKara Frame || February, 21 2022\nIn a sparse, dimly lit Austin office building, Carl “Buffalo” Nichols stands in front of the mic stand with his steel guitar. As he finger picks into the first song “Living Hell,” the stark surroundings are juxtaposed against the warmth of his raspy vocals. \n\nHe performs his Tiny Desk (home) concert solo, a testament to the engaging storytelling of the blues, a genre he reclaims on his self-titled debut album. In his three-song set, Nichols sings about not making it into heaven, living in hell and the life of someone who is lost and lonesome. But these aren’t your run of the mill, down-and-out blues songs – Nichols is adamant about making the genre current and making it Black again. Originally from Wisconsin, he mentions that he moved to the Austin, Texas music scene at the beginning of the pandemic, a fitting preface to his next song that starts with, “If you see me in your town, looking tired with my head hanging down / You may wonder what went wrong, why am I always all alone.”\n\nBuffalo Nichols’ acoustic set represents all the best parts of Tiny Desk; a humble desk, a talented artist and music that speaks for itself. \n\nSET LIST\n“Living Hell”\n“Lost & Lonesome”\n“These Things”\n\nMUSICIANS\nBuffalo Nichols: vocals, guitar\n\nCREDITS\nDirected by: Aimée M. Everett\nRecorded by: Buffalo Nichols\nMixed by: Clay Jones\nCameras by: Brad Feeser\nEdited by: Max Taeuschel\n\nTINY DESK TEAM\nProducer: Kara Frame\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Joshua Bryant, Maia Stern, Ashley Pointer\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #buffalonichols", "link": "https://www.youtube.com/watch?v=FrXXLcx4dCw", "date_published": "2022-02-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]