[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Review", "description": "From Software's latest game Elden Ring is a masterpiece of open-world design that places exploration and player agency at the heart of the experience.\n\nTo read Tamoor Hussain's full review here: https://www.gamespot.com/reviews/elden-ring-review-in-progress-death-of-the-wild/1900-6417832/\n\n#EldenRing", "link": "https://www.youtube.com/watch?v=y4Q9130iMyA", "date_published": "2022-02-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "History of Soulsborne Games", "description": "To celebrate the launch of From Software's Elden Ring, we chart the history of the Soulsborne games, from the early success of Demon's Souls and breakout hit Dark Souls, as well as its sequels, to Bloodborne, a spin-off that is regarded as one of the best games ever made, and Elden Ring, a collaboration between Hidetaka Miyakazi and George R. R. Martin.  #eldenring \n\nIt’s hard to overstate the impact From Software has had on gaming. From birthing its own genre to acting as the inspiration for countless developers, the studio’s games have not only left their mark on how games are designed but also how players interact with them. To celebrate the release of the studio’s latest title, Elden Ring, here’s the history of Soulsborne games.\n\nIn the above video, we chart the history of From Software, and how Hidetaka Miyazaki took its games in bold new directions. Beginning with King's Field, the spiritual predecessor to the Souls games and then charting the course of the series from there. We also take an in-depth look at the creation of Demon's Souls and the daring ideas that Miyakazi brought to the game, which Sony deemed too difficult, and bombed at release, before coming a cult hit in the West. From there, we take a look at the enormous success of Dark Souls, Dark Souls II, and Dark Souls III, and the communities that sprung up to mine every last secret from the games. While we don't linger too long on Sekiro: Shadows Die Twice, as it's not typically considered a Soulsborne game, we do delve into Bloodborne, and chart the evolution of From Software's approach to game design and how it's changed over the years in the lead up to Elden Ring.\n\nElden Ring launches on February 25, 2022 on PlayStation 4, PlayStation 5, Xbox One, Xbox Series X/S, and PC. For more on the game, including our review, make sure to subscribe to GameSpot. \n\n00:25 - King’s Field (1994)\n01:20 - Demon’s Souls (2009)\n07:27 - Dark Souls (2011)\n11:51 - Dark Souls II (2014)\n14:27 - Bloodborne (2015)\n17:46 - Dark Souls III (2016)\n20:16 - Elden Ring (2022)", "link": "https://www.youtube.com/watch?v=Wnvom4-JTHw", "date_published": "2022-02-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Horizon Forbidden West Ending Explained", "description": "SPOLIER ALERT \n\nHorizon Forbidden West's massive story line may leave you with some questions. Join Lucy James as she explains the game's ending, as well as what the future may hold for the next Horizon title.\n\nFive years and one DLC later, Horizon Forbidden West has arrived along with its massive follow up story. If you're feeling a little behind after your journey through the Forbidden West, fear not. Lucy James is here to break down the ending and even discuss what may happen next. \n\nEven after an incredibly vast story, Horizon Forbidden West has loose ends involving everything from main characters, to the future world Aloy and company fought to save. The sentient program \"Nemesis\" is still active despite its creator's (the Far Zenith) absence. The far Zenith lost their chance to rule the forbidden west, and doing so leave Aloy and crew to fix Gaia AND implement Elizabet Sobek's plan to restart society on earth as it once was. Sylens is seen ready to leave earth and start anew on an all new terraformed planet, but at the last minute changes his mind. Despite this game coming to a happy close, the fight for earth is far from over. Make sure to check out GameSpot's review of Horizon Forbidden West as well as our story recap and combat tips videos. Horizon is available now on PS4 and PS5.\n\n#HorizonForbiddenWest", "link": "https://www.youtube.com/watch?v=3pPNrw3KtEc", "date_published": "2022-02-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Horizon Forbidden West: What Does A Zelda: BOTW Expert Think?", "description": "The open world format is constantly getting new entries and sequels, so how does Guerilla Games newest sequel, Horizon Forbidden West, hold up against Breath of the Wild?\n\nWhile these are two vastly different games, they share some similarities and some interesting design choices that caught our attention while playing. Things such as climbing, gliding, combat, the open world and tower system, have key differences that make each game unique.\n\nTIMESTAMPS:\n00:00 - Intro\n00:37 - Open World\n01:38 - Climbing\n02:31 - Gliding\n03:23 - Towers\n04:05 - Conversations\n04:39 - Advanced Combat\n05:12 - General Combat\n06:23 - Graphics\n07:16 - Spoiler Equipment\n08:27 - Outro\n\n\n#BoTW #HorizonForbiddenWest", "link": "https://www.youtube.com/watch?v=Vf8Fbx-iEZo", "date_published": "2022-02-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Destiny 2: The Witch Queen Launch Day Livestream", "description": "Join David, Jean-Luc, and Phil as they dive into day 1 of Destiny 2's latest expansion, The Witch Queen.", "link": "https://www.youtube.com/watch?v=kr2-doYITs0", "date_published": "2022-02-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Don’t Lose Your Bethesda.net Saves | GameSpot News", "description": "In today’s episode of GameSpot News, Persia talks about how you can transfer your Bethesda.net saves since the launcher is closing, the headset design for PlayStation VR 2 and more. \n\nBethesda has announced it is closing its PC storefront, the Bethesda.net Launcher, later this year. Anyone who owns games through the Bethesda.net Launcher can migrate them, along with any funds in their wallet, to Steam beginning in April. Most games will have their saves automatically transferred, too, though some will require manual transfers, and one title is not supported at all, Bethesda said. Additionally, the company clarified that all Bethesda.net accounts will remain accessible.\n\nSony has shown off the final design for its upcoming PSVR 2 headset and the accompanying Sense controllers, which feature a look similar to the PS5's design aesthetic. Other features of the headset include a focus on comfort, as the hardware has a lens adjustment dial for users to dial in the distance between their eyes and the lenses, a slight weight reduction when compared to the previous PSVR model, and a new vent design to prevent fogging.\n\nAccording to VGC, 2K Games signed a \"new multi-game partnership with Lego\" that will see the company producing a number of licensed titles, the first of which are a soccer game and an open-world racing game. The soccer game, planned for release this year, is reportedly being developed by Sumo Digital, while the racing game is in the works at 2K's own studio Visual Concepts.\n\nFor more information on today’s topics, please visit gamespot.com.\n\nTimestamps:\nIntro - 00:00\nBethesda - 00:06\nPlayStation VR2 - 01:04\n2K Lego - 01:57\nOutro - 02:58", "link": "https://www.youtube.com/watch?v=snTkzCC42-g", "date_published": "2022-02-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "ELDEN RING Official Launch Trailer", "description": "Though shattered, it shall guide thee. Though fractured, it yet calls. Enact thy will. Become Lord. Seek the Elden Ring.\n\nElden Ring is an upcoming action role-playing game developed by FromSoftware and published by Bandai Namco Entertainment.\n\nElden Ring will release on PlayStation 4, Xbox Series X and Series S, Xbox One, PlayStation 5, Microsoft Windows\n\n#ELDENRING launches February 25, 2022.", "link": "https://www.youtube.com/watch?v=AKXiKBnzpBQ", "date_published": "2022-02-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokemon Day 2022 Bringing New Announcements | GameSpot News", "description": "In today’s episode of GameSpot News, Persia talks about new Pokemon announcements heading our way, new content for Rainbow 6 Siege, and more. \n\nThe Pokemon Company announced its plans for the annual Pokemon Day fan celebration, and this year it's not limited to a single day. The company announced that instead we'll see a week of announcements \"from across the franchise\" leading up to the actual date on February 27.\n\nUbisoft is kicking off Rainbow Six’s first season of this year with a bang. Demon Veil, is adding a new map and permanent game mode to the competitive shooter, along with a new Operator who can rebuild defenses.\n\nAzami is a Defender. With medium speed and health, Azami is unremarkable save for her gadget, the Kiba Barrier. The Operator can throw kunai that release gas in a small circle where they land. That gas then solidifies into a bulletproof surface, providing quick cover.\n\nCapcom has officially announced Street Fighter 6, the next entry in its popular fighting series. A teaser trailer shows a very shredded-looking Ryu preparing to fight Luke, a DLC character from Street Fighter V. \n\nIn addition to Street Fighter 6, Capcom announced the Capcom Fighting Collection, which includes 10 classic fighting games. It launches June 24 for PlayStation, Xbox, Switch, and PC.\n\nFor more information on all of our topics, please visit gamespot.com.\n\nTimestamps:\nIntro - 00:00\nPokémon - 00:07\nRainbow 6 Siege - 01:00\nStreet Fighter 6 - 02:42\nOutro - 03:59", "link": "https://www.youtube.com/watch?v=uGzx_nVS4Lc", "date_published": "2022-02-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "What’s New in Destiny 2: The Witch Queen", "description": "Bungie is changing the game with Witch Queen, the latest expansion for Destiny 2 with Hive Guardians, the new Glaive weapon, revamped Void classes, weapon crafting, a new raid and so much more. All while we face our toughest foe yet, the Hive queen Savathun. (Presented by Bungie) \n\nFor more information on Destiny 2: The Witch Queen see more details here: https://bung.ie/3LJBPlH", "link": "https://www.youtube.com/watch?v=Cm8eq37APjI", "date_published": "2022-02-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]