{"entries": [{"source": "https://feeds.feedburner.com/TheHackersNews", "link": "https://thehackernews.com/2022/12/beware-cybercriminals-launch-new.html", "title": "Beware: Cybercriminals Launch New BrasDex Android Trojan Targeting Brazilian Banking Users", "date_published": "2022-12-20 14:33:00+00:00", "description": "The threat actors behind the Windows banking malware known as Casbaneiro has been attributed as behind a novel Android trojan called BrasDex that has been observed targeting Brazilian users as part of an ongoing multi-platform campaign.\nBrasDex features a \"complex keylogging system designed to abuse Accessibility Services to extract credentials specifically from a set of Brazilian targeted apps,", "persistent": false, "language": "en-US"}, {"source": "https://feeds.feedburner.com/TheHackersNews", "link": "https://thehackernews.com/2022/12/russian-hackers-target-major-petroleum.html", "title": "Russian Hackers Targeted Petroleum Refinery in NATO Country During Ukraine War", "date_published": "2022-12-20 12:55:00+00:00", "description": "The Russia-linked Gamaredon group attempted to unsuccessfully break into a large petroleum refining company within a NATO member state earlier this year amid the ongoing Russo-Ukrainian war.\nThe attack, which took place on August 30, 2022, is just one of multiple attacks orchestrated by the advanced persistent threat (APT) that's attributed to Russia's Federal Security Service (FSB).\nGamaredon,", "persistent": false, "language": "en-US"}, {"source": "https://feeds.feedburner.com/TheHackersNews", "link": "https://thehackernews.com/2022/12/a-guide-to-efficient-patch-management.html", "title": "A Guide to Efficient Patch Management with Action1", "date_published": "2022-12-20 12:42:00+00:00", "description": "It's no secret that keeping software up to date is one of the key best practices in cybersecurity. Software vulnerabilities are being discovered almost weekly these days. The longer it takes IT teams to apply updates issued by developers to patch these security flaws, the more time attackers have to exploit the underlying vulnerability. Once threat actors gain access to corporate IT ecosystems,", "persistent": false, "language": "en-US"}, {"source": "https://feeds.feedburner.com/TheHackersNews", "link": "https://thehackernews.com/2022/12/kmsdbot-botnet-suspected-of-being-used.html", "title": "KmsdBot Botnet Suspected of Being Used as DDoS-for-Hire Service", "date_published": "2022-12-20 12:24:00+00:00", "description": "An ongoing analysis of the KmsdBot botnet has raised the possibility that it's a DDoS-for-hire service offered to other threat actors.\nThis is based on the different industries and geographies that were attacked, web infrastructure company Akamai said. Among the notable targets included FiveM and RedM, which are game modifications for Grand Theft Auto V and Red Dead Redemption 2, as well as", "persistent": false, "language": "en-US"}, {"source": "https://feeds.feedburner.com/TheHackersNews", "link": "https://thehackernews.com/2022/12/ftc-fines-fortnite-maker-epic-games-275.html", "title": "FTC Fines Fortnite Maker Epic Games $275 Million for Violating Children's Privacy Law", "date_published": "2022-12-20 06:33:00+00:00", "description": "Epic Games has reached a $520 million settlement with the U.S. Federal Trade Commission (FTC) over allegations that the Fortnite creator violated online privacy laws for children and tricked users into making unintended purchases in the video game.\nTo that end, the company will pay a record $275 million monetary penalty for breaching the Children's Online Privacy Protection Act (COPPA) by", "persistent": true, "language": "en-US"}, {"source": "https://feeds.feedburner.com/TheHackersNews", "link": "https://thehackernews.com/2022/12/microsoft-details-gatekeeper-bypass.html", "title": "Microsoft Details Gatekeeper Bypass Vulnerability in Apple macOS Systems", "date_published": "2022-12-20 05:52:00+00:00", "description": "Microsoft has disclosed details of a now-patched security flaw in Apple macOS that could be exploited by an attacker to get around security protections imposed to prevent the execution of malicious applications.\nThe shortcoming, dubbed Achilles (CVE-2022-42821, CVSS score: 5.5), was addressed by the iPhone maker in macOS Ventura 13, Monterey 12.6.2, and Big Sur 11.7.2, describing it as a logic", "persistent": false, "language": "en-US"}], "source": {"url": "https://feeds.feedburner.com/TheHackersNews", "title": "The Hacker News"}}