{"entries": [{"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/conspiracy-theorist-mike-lindell-to-audit-desantis-historic-re-election-win-i-dont-believe-it", "title": "Conspiracy Theorist Mike Lindell To Audit DeSantis’ Historic Re-Election Win: ‘I Don’t Believe It’", "date_published": "2022-12-20 22:29:21+00:00", "description": "My Pillow CEO Mike Lindell, a noted conspiracy theorist and a diehard Trump loyalist, seemed to suggest without any evidence that Governor Ron DeSantis’ victory in Florida last month wasn’t on the up-and-up. DeSantis dominated his Democrat opponent in his midterm election blowout, winning by more than 1.5 million votes, a 19.4% margin of victory. ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/breaking-elon-musk-stepping-down-as-the-ceo-of-twitter-reveals-what-hell-do-next", "title": "BREAKING: Elon Musk Stepping Down As The CEO Of Twitter, Reveals What He’ll Do Next", "date_published": "2022-12-20 21:18:59+00:00", "description": "Twitter CEO Elon Musk said Tuesday that he is going to step down from his role at the company. Musk&#8217;s announcement comes after he conducted a poll at the start of the week asking Twitter users if he should “step down as head of Twitter.&#8221; &#8220;I will abide by the results of this poll,&#8221; Musk ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/breaking-house-democrats-vote-to-release-years-of-trumps-tax-returns", "title": "House Democrats Vote To Release Years Of Trump’s Tax Returns", "date_published": "2022-12-20 20:11:27+00:00", "description": "The House Ways and Means Committee voted along party lines on Tuesday to release years of former President Donald Trump’s tax returns. The Democratic-controlled committee outvoted a united Republican dissent. The move comes a day after GOP Reps. Liz Cheney of Wyoming and Adam Kinzinger of Illinois joined seven Democrats on the House January 6 ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/breaking-ex-broncos-star-running-back-ronnie-hillman-fighting-for-his-life-in-hospice-report-says", "title": "BREAKING: Ex-Broncos Star Running Back Ronnie Hillman Fighting For His Life In Hospice, Report Says", "date_published": "2022-12-20 19:58:26+00:00", "description": "Former Denver Broncos running back Ronnie Hillman, 31, is reportedly fighting for his life while in hospice care. Hillman&#8217;s former Broncos teammates, Derek Wolfe and Orlando Franklin, who both now work as hosts on 104.3 The Fan, made the disclosure Tuesday while on air. Hillman was reportedly in hospice care while battling liver cancer when ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/study-shows-pandemic-saw-rise-in-firearm-injuries-among-kids", "title": "Study Shows Pandemic Saw Rise In Firearm Injuries Among Kids", "date_published": "2022-12-20 19:46:20+00:00", "description": "A new study showed another disastrous effect of the pandemic on kids — a spike in gun injuries. The information comes alongside another study that showed the increasing homicide rates of kids. The study was published on Monday in JAMA Pediatrics and found that the rate of children with injuries from firearms going to children’s ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/new-twitter-files-shows-company-helped-the-military-battle-foreign-adversaries-trying-to-hurt-u-s", "title": "New ‘Twitter Files’ Shows Company Helped The Military Battle Foreign Adversaries Trying To Hurt U.S.", "date_published": "2022-12-20 19:06:10+00:00", "description": "A journalist from a far-left news organization published the latest installment of &#8220;The Twitter Files&#8221; Tuesday afternoon and sought to portray the U.S. Military in a negative light with the information that was released. The Intercept&#8217;s Lee Fang called his release of &#8220;The Twitter Files,&#8221; the eighth release in the series, &#8220;How Twitter Quietly Aided ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/dea-seized-enough-fentanyl-in-2022-to-kill-every-single-american-and-then-some", "title": "DEA Seized Enough Fentanyl In 2022 To Kill Every Single American, And Then Some", "date_published": "2022-12-20 19:00:33+00:00", "description": "The Drug Enforcement Administration said it seized enough fentanyl so far this year to kill every single American citizen. In a press release Tuesday, the DEA said it had seized some 50.6 million fake prescription pills laced with fentanyl, along with more than 10,000 pounds of fentanyl powder, with two weeks left in calendar year ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/megan-thee-stallion-deserves-justice-and-attention", "title": "Megan Thee Stallion Deserves Justice And Attention", "date_published": "2022-12-20 18:16:01+00:00", "description": "Megan Thee Stallion&#8217;s ongoing court case against rapper Tory Lanez in Los Angeles over a shooting incident that took place two years ago should be a top story everywhere. Instead, it is being swept under the rug while a potential victim of domestic abuse is mocked for standing up for herself. The case itself raises ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/mariah-careys-monster-holiday-hit-all-i-want-for-christmas-is-you-estimated-to-bring-singer-an-insane-amount-every-year", "title": "Mariah Carey’s Monster Holiday Hit ‘All I Want For Christmas Is You’ Estimated To Bring Singer An Insane Amount Every Year", "date_published": "2022-12-20 18:03:53+00:00", "description": "Mariah Carey&#8217;s monster holiday hit &#8220;All I Want For Christmas Is You&#8221; is estimated to bring in an insane amount for the singer every year, earning more than $1.55 million in 2021 alone. The 52-year-old singer&#8217;s 1994 Christmas song has truly become a classic along with the likes of Nat King Cole&#8217;s &#8220;The Christmas Song&#8221; ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/mars-insight-lander-sends-final-selfie-before-losing-power", "title": "Mars InSight Lander Sends Final Selfie Before Losing Power", "date_published": "2022-12-20 18:03:53+00:00", "description": "NASA&#8217;s InSight lander shared one final selfie posted on Monday before losing power, likely ending its mission that started in 2018. The most recent image may be InSight&#8217;s last, which comes shortly after recording the most powerful quake recorded on the red planet. &#8220;My power’s really low, so this may be the last image I ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/pride-centers-and-wax-museums-here-are-the-woke-projects-buried-in-congress-spending-bill", "title": "Pride Centers And A Wax Museum: Here Are The Woke Projects Buried In Congress’ Spending Bill", "date_published": "2022-12-20 17:03:46+00:00", "description": "Lawmakers on Capitol Hill touted a $1.7 trillion funding package on Tuesday — with both Democrats and Republicans claiming victories — which is designed to avert a government shutdown when the current funding expires at midnight on Friday. The text of the legislation is some 4,000 pages long, leaving very little hope for lawmakers — ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/massachusetts-supreme-court-rules-against-medically-assisted-death", "title": "Massachusetts Supreme Court Rules Against Medically-Assisted Death", "date_published": "2022-12-20 16:49:41+00:00", "description": "The Massachusetts Supreme Court ruled that medically-assisted death for patients with terminal illnesses is not protected under the state&#8217;s constitution. The state&#8217;s highest court released the ruling on Monday in the conclusion to a lawsuit originally filed by Dr. Roger Kligler and another doctor in 2016 over fears of being prosecuted if he prescribed life-ending ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/devin-nunes-reacts-to-doj-subpoenas-of-his-house-intel-staff-they-spied-on-us", "title": "Devin Nunes Reacts To DOJ Subpoenas Of His House Intel Staff: ‘They Spied On Us’", "date_published": "2022-12-20 16:48:03+00:00", "description": "Former Rep. Devin Nunes (R-CA) accused the Justice Department of spying on his team at a time when he was leading a congressional investigation into the FBI&#8217;s conduct during its Trump-Russia probe. Two senior House Intelligence Committee staffers were the subject of grand jury subpoenas sent to Google seeking personal email and phone data in ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/real-life-grinch-tries-to-steal-all-the-presents-from-under-robert-de-niros-tree", "title": "Real Life Grinch Tries To Steal All The Presents From Under Robert De Niro’s Tree", "date_published": "2022-12-20 15:52:51+00:00", "description": "A real-life Grinch was allegedly caught in the act trying to steal Christmas — or at least the presents from under the tree — from a townhouse that is being rented by actor Robert De Niro on the Upper East Side on Monday. Law enforcement sources shared the story with The New York Post, revealing that ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/a-trio-of-gop-senators-say-trump-has-a-serious-electability-problem-in-2024", "title": "A Trio Of GOP Senators Say Trump Has A Serious Electability Problem In 2024", "date_published": "2022-12-20 15:49:45+00:00", "description": "Donald Trump has all but disappeared after the dismal showing of the GOP during the midterm elections when Republicans barely took the House and failed to gain control of the Senate. Sure, the former president did pop up last week to offer NFTs to his fans for $99 (a move that prompted the biggest MAGAman in ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/james-cameron-admits-hes-in-discussion-to-relaunch-terminator-franchise-and-reveals-what-hed-do-different-this-time", "title": "James Cameron Admits He’s ’In Discussion’ To Relaunch ‘Terminator’ Franchise And Reveals What He’d Do Different This Time", "date_published": "2022-12-20 15:43:15+00:00", "description": "James Cameron admitted he&#8217;s &#8220;in discussion&#8221; to relaunch the &#8220;Terminator&#8221; franchise, which he started in 1984, after the last several sequels were box office flops. During the 68-year-old director&#8217;s appearance on the &#8220;Smartless&#8221; podcast, the director talked about the fate of the franchise after 2019&#8217;s &#8220;Terminator: Dark Fate,&#8221; from Tim Miller, failed to capture the ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/25-years-later-titanic-would-sink-not-soar-in-modern-america", "title": "25 Years Later: ‘Titanic’ Would Sink, Not Soar, In Modern America", "date_published": "2022-12-20 15:32:31+00:00", "description": "Hollywood can keep churning out movies month after month, year after year, but it’s unlikely another cultural phenomenon like James Cameron’s “Titanic” will ever happen again. There are many reasons to blame for this beyond the fact that the three hour and 30-minute drama revolves around a heterosexual white couple. It would be impossible to ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/97-year-old-former-nazi-secretary-convicted-as-accessory-to-10505-murders", "title": "97-Year-Old Former Nazi Secretary Convicted As Accessory To 10,505 Murders", "date_published": "2022-12-20 15:23:31+00:00", "description": "A 97-year-old woman who worked at a Nazi concentration camp was convicted on Monday after undergoing a trial that lasted longer than a year.  Between 1943 and 1945, when Irmgard Furchner was 18 and 19 years old, she worked as a secretary for Paul-Werner Hoppe, the Stutthof concentration camp&#8217;s commandant. Because of her age at ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/6-year-old-boy-found-dead-under-floorboards-mother-boyfriend-arrested", "title": "6-Year-Old Boy Found Dead Under Floorboards. Mother, Boyfriend Arrested.", "date_published": "2022-12-20 14:52:43+00:00", "description": "A 6-year-old boy was found dead beneath the floorboards of a Moro, Arkansas, home on Friday, and a man and woman have been arrested in connection with the crime. Ashley Roland, the 28-year-old mother of the child, and Nathan Bridges, 33, were arrested and charged with capital murder, abuse of a corpse, tampering with physical ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/a-culture-lacking-purpose-the-decline-of-religion-in-the-cradle-of-modern-christianity", "title": "A Culture Lacking Purpose: The Decline Of Religion In The Cradle Of Modern Christianity", "date_published": "2022-12-20 14:50:56+00:00", "description": "Fifteen centuries ago, Saint Gregory the Great sponsored a mission to the Angles, Saxons, and Jutes, the pagan peoples who had conquered the portion of southeastern Britain now known as England. The somewhat cowardly band of missionaries, which included the man who would soon become the first Archbishop of Canterbury, were surprised to find King ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/taliban-closes-afghan-universities-to-women", "title": "Taliban Closes Afghan Universities To Women", "date_published": "2022-12-20 14:50:56+00:00", "description": "The Taliban banned all women from universities in Afghanistan, the county&#8217;s Education Ministry said Tuesday. A letter, shared on Twitter by a spokesman for the ministry, made the announcement after a meeting of the Taliban government, according to the Associated Press. &#8220;You are all informed to immediately implement the mentioned order of suspending education of ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/film-critic-ridiculed-after-accusing-avatar-2-of-cultural-appropriation", "title": "Film Critic Ridiculed After Accusing ‘Avatar 2’ Of ‘Cultural Appropriation’", "date_published": "2022-12-20 14:39:29+00:00", "description": "Rotten Tomatoes film critic Kathia Woods was roundly mocked on Twitter after she claimed that the &#8220;Avatar&#8221; sequel was guilty of &#8220;cultural appropriation&#8221; of &#8220;people of color.&#8221; Woods, who writes for the Philadelphia Tribune and sometimes for NBC, called out James Cameron&#8217;s &#8220;Avatar: The Way of Water,&#8221; because of white actors playing the roles of ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/prince-harry-and-meghan-markle-announce-new-netflix-series-featuring-leftists-greta-thunberg-gloria-steinem-jacinda-ardern", "title": "Prince Harry And Meghan Markle Announce New Netflix Series Featuring Leftists Greta Thunberg, Gloria Steinem, Jacinda Ardern", "date_published": "2022-12-20 14:36:34+00:00", "description": "Prince Harry and Meghan Markle have another Netflix release coming out in December, but this time they’re focusing on “leaders.” The royal couple made headlines for their six-part documentary series “Harry &amp; Meghan,” which debuted on the streaming platform earlier this month. The limited series delved into the couple’s personal life and struggle with the ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/ohio-man-gets-life-in-prison-after-murdering-8-family-members", "title": "Ohio Man Gets Life In Prison After Murdering 8 Family Members", "date_published": "2022-12-20 14:36:11+00:00", "description": "A man was sentenced on Monday to life in prison without the possibility of parole after being convicted of killing eight members of an Ohio family in 2016. George Wagner IV sat in court as the victims&#8217; loved ones described their grief, with the former girlfriend of one of the slain individuals telling him to ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/democrats-say-they-will-return-3-million-donated-by-ftx-executives", "title": "Democrats Say They Will Return $3 Million Donated By FTX Executives", "date_published": "2022-12-20 14:28:00+00:00", "description": "The Senate Majority PAC, which exists to elect Democrats, announced Tuesday that it will return $3 million donated by former FTX executives Sam Bankman-Fried and Nishad Singh. The two disgraced entrepreneurs, who respectively served as chief executive officer and director of engineering for the bankrupt cryptocurrency company, had donated $1 million and $2 million to ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/court-rules-against-white-house-covid-vaccine-mandate-for-federal-contractors", "title": "Court Rules Against White House COVID Vaccine Mandate For Federal Contractors", "date_published": "2022-12-20 14:26:42+00:00", "description": "The Biden administration cannot enforce its COVID vaccine mandate on federal contractors, according to a ruling on Monday. A 5th Circuit Court of Appeals ruled against the mandate in a 2-1 decision. &#8220;The President’s use of procurement regulations to reach through an employing contractor to force obligations on individual employees is truly unprecedented,&#8221; the ruling ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/twitter-blows-up-over-christian-music-star-hosting-same-sex-wedding-for-her-niece", "title": "Twitter Blows Up Over Christian Music Star Hosting Same-Sex Wedding For Her Niece", "date_published": "2022-12-20 14:14:53+00:00", "description": "Christian music star Amy Grant drew a firestorm of commentary — some supportive and some critical — when reports began circulating that she planned to host a same-sex wedding for her niece. Grant spoke with The Washington Post for a recent profile ahead of her appearance at the Kennedy Center Honors — she was the ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/iranian-soccer-player-26-facing-death-penalty-after-protesting-for-womens-rights", "title": "Iranian Soccer Player, 26, Facing Death Penalty After Protesting For Women’s Rights", "date_published": "2022-12-20 14:03:04+00:00", "description": "A 26-year-old professional soccer player in Iran is facing the death penalty after protesting in support of women&#8217;s rights in the nation. Amir Nasr-Azadani was arrested back in November after participating in nationwide pro-women protests sparked by the death of Mahsa Amini, a 22-year-old woman arrested by the morality police for an alleged dress code ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/cancel-culture-in-catholic-church-has-got-to-be-exposed-defrocked-priest-who-ripped-biden-speaks-out", "title": "Cancel Culture In Catholic Church Has ‘Got To Be Exposed’: Defrocked Priest Who Ripped Biden Speaks Out", "date_published": "2022-12-20 13:58:05+00:00", "description": "Catholic priest Father Frank Pavone fired back Monday night after reportedly being defrocked by the Vatican for political reasons, charging that his dismissal was due to cancel culture in the Catholic Church that needs “to be exposed.” Pavone, who is the founder of Priests for Life, has become known for blasting President Biden and Democrats ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/some-families-with-no-one-working-can-receive-up-to-six-figures-of-welfare-in-three-states", "title": "Some Families With No One Working Can Receive Up To Six Figures Of Welfare In Three States", "date_published": "2022-12-20 13:35:23+00:00", "description": "Families of four with neither parent working can receive welfare benefits worth in excess of six figures per year in Washington, Massachusetts, and New Jersey, according to a study from the Committee to Unleash Prosperity. A previous analysis from the conservative think tank found that federal supplemental unemployment benefits, food stamp expansions, child tax credit ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/tiktok-ban-on-government-devices-included-in-1-7-trillion-spending-bill", "title": "TikTok Ban On Government Devices Included In $1.7 Trillion Spending Bill", "date_published": "2022-12-20 13:31:50+00:00", "description": "A TikTok ban on government devices is included in the latest version of the $1.7 trillion &#8220;omnibus&#8221; bill. The Tuesday draft follows the unanimous passage of the “No TikTok on Government Devices Act” in the Senate last week after it was introduced by Sen. Josh Hawley (R-MO). &#8220;Wonders never cease,&#8221; Hawley tweeted Tuesday, noting the ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/how-the-fbi-bought-twitter-long-before-musk-did-and-for-a-much-better-price", "title": "How The FBI Bought Twitter Long Before Musk Did, And For a Much Better Price", "date_published": "2022-12-20 13:29:43+00:00", "description": "Twitter cost Elon Musk $44 billion, but the FBI bought it for just $3.4 million. Before Monday&#8217;s bombshell edition of the Twitter Files, internal communications suggested that the FBI manipulated Twitter’s content cops through former G-men embedded inside the company, appeals to a warped sense of patriotism, and letting woke staffers feel like characters on ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/jimmy-stewart-a-world-at-war-and-why-its-a-wonderful-life-was-almost-a-little-less-wonderful-part-i", "title": "Jimmy Stewart, A World At War, And Why ‘It’s A Wonderful Life’ Was Almost A Little Less Wonderful: Part I", "date_published": "2022-12-20 13:27:54+00:00", "description": "The beloved Christmas classic film &#8220;It&#8217;s a Wonderful Life&#8221; was the movie that brought a beleaguered and combat-weary actor James &#8220;Jimmy&#8221; Stewart back to fans after the war — but it may have also been the movie that brought a desperate man back from the brink. James Maitland Stewart was preparing to go to war ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/transgender-accused-of-exposing-his-genitals-to-women-in-spa-arrested-after-fleeing-police-for-15-months", "title": "Transgender Person Accused Of Exposing His Genitals To Women In Spa Arrested After Fleeing Police For 15 Months", "date_published": "2022-12-20 13:20:05+00:00", "description": "The biological man, who claims to be a transgender woman and created a furor in Los Angeles by allegedly exposing his genitals to women and an underage girl at a spa, was arrested last week after fleeing authorities for over a year. Darren Agee Merager, 53, who is a registered sex offender, was charged with ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/massive-texas-national-guard-arrives-in-el-paso-as-illegals-prepare-to-surge", "title": "Massive Texas National Guard Contingent Arrives In El Paso As Illegals Prepare To Surge", "date_published": "2022-12-20 12:57:54+00:00", "description": "The Texas National Guard sent a huge number of troops to El Paso overnight to guard the border from the massive influx of illegal immigrants likely to surge there. The Biden administration was temporarily stifled by the Supreme Court on Monday in its attempt to end Title 42, which was implanted by former President Trump ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/pirates-of-the-caribbean-producer-said-hed-love-for-his-friend-johnny-depp-to-rejoin-the-franchise", "title": "‘Pirates Of The Caribbean’ Producer Said He’d ‘Love’ For His ‘Friend’ Johnny Depp To Rejoin The Franchise", "date_published": "2022-12-20 12:52:19+00:00", "description": "Even though Johnny Depp insists he’d never return to Disney’s “Pirates of the Caribbean” franchise, producer Jerry Bruckheimer just said he’d “love” for the actor to star in another sequel. Bruckheimer addressed the issue during a recent interview with The Hollywood Reporter. &#8220;I would love to have him in the movie. He&#8217;s a friend, a ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/full-video-of-idaho-murder-victims-reportedly-hours-before-slayings-released", "title": "Full Video Of Idaho Murder Victims Reportedly Hours Before Slayings Released", "date_published": "2022-12-20 12:27:19+00:00", "description": "Surveillance video believed to have been taken the night that four University of Idaho students were murdered in an off-campus residence has been fully released for the first time. The video, obtained by leaders of a Facebook group dedicated to solving the slayings and provided exclusively to Fox News, shows victims Kaylee Goncalves and Maddie ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/youre-not-american-thats-offensive-youre-a-u-s-citizen-stanford-u-declares", "title": "You’re Not ‘American.’ That’s Offensive. You’re A ‘U.S. Citizen,’ Stanford U Declares", "date_published": "2022-12-20 12:11:31+00:00", "description": "Liberals are so thin-skinned that words constantly wound them. Deeply. So they&#8217;re constantly redefining words to ease their pain. Enter Stanford University. The vaunted California institute of higher education has published an index of &#8220;harmful language&#8221; as part of an initiative to eliminate and replace words it deems offensive. The Elimination of Harmful Language Initiative ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/massive-snowstorm-expected-to-impact-christmas-travel-nationwide-airlines-brace-for-cancellations", "title": "Massive Snowstorm Expected To Impact Christmas Travel Nationwide, Airlines Brace For Cancellations", "date_published": "2022-12-20 11:47:50+00:00", "description": "Holiday travel and gift delivery could be severely disrupted by a winter storm expected to hit the center of the country from Wednesday to Sunday. Residents of the Midwest and the Great Lakes region will contend with an incoming Arctic front causing heavy snowfall, according to a forecast from the National Weather Service. Blizzard conditions ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/kristi-noems-health-secretary-retires-after-controversial-contract-with-transgender-group", "title": "Kristi Noem’s Health Secretary Retires After Controversial Contract With Transgender Group", "date_published": "2022-12-20 11:32:06+00:00", "description": "A South Dakota health official appointed by Republican Gov. Kristi Noem has retired following reports of a controversial state contract with a transgender activist group. Noem made the announcement on Monday and thanked Health Secretary Joan Adam for her service. “She has been able to put families first because she recognizes the importance of her ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/will-the-doj-move-to-indict-trump-on-j6-criminal-referrals-heres-what-experts-are-saying", "title": "Will The DOJ Move To Indict Trump On J6 Criminal Referrals? Here’s What Experts Are Saying.", "date_published": "2022-12-20 11:16:34+00:00", "description": "The January 6 Committee on Monday recommended to the Justice Department four criminal charges against former President Donald Trump: obstructing an official proceeding, conspiring to defraud the United States, conspiring to make false statements to the feds, and inciting an insurrection. The committee does not have the ability to charge Trump, but the group is ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/heading-into-2023-the-pac-12-is-the-second-best-conference-in-college-football", "title": "Heading Into 2023, The PAC-12 Is The Second Best Conference In College Football", "date_published": "2022-12-20 11:15:38+00:00", "description": "Okay, so we’ve all had our fun at the expense of the PAC-12 over what seems like decades. While the negativity surrounding the departure of USC and UCLA to the BIG-10 is still swirling, next year&#8217;s PAC-12 is set to be the best it has been since I can remember. Bo Nix just announced he’s ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/that-earthquake-was-insane-massive-6-4-earthquake-hits-northern-california", "title": "‘That Earthquake Was Insane’: Massive 6.4 Earthquake Hits Northern California", "date_published": "2022-12-20 10:58:30+00:00", "description": "A whopping 6.4-magnitude earthquake hit northern California at roughly 2:30 Tuesday morning, leaving over 70,000 people without power. By 4 a.m. two dozen aftershocks had been reported, according to the United States Geological Survey (USGS). The earthquake’s epicenter was estimated to lie 200 miles north of San Francisco, 7.5 miles southwest of Ferndale. According to ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/epic-collapse-a-traders-take-on-ftx-sam-bankman-fried-and-wall-street-hubris", "title": "Epic Collapse: A Trader’s Take On FTX, Sam Bankman-Fried, And Wall Street Hubris", "date_published": "2022-12-20 09:57:45+00:00", "description": "I’ve been in the trading business for over three decades. In that time I’ve seen so many boom/bust scenarios they no longer excite me. And not just with markets, but with individuals and their firms within the markets as well. They seem to fall into different categories of collapse. Some go down in flames as ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/yellowstone-prequel-1923-attracts-record-audience-for-premiere", "title": "‘Yellowstone’ Prequel ‘1923’ Attracts Record Audience For Premiere", "date_published": "2022-12-20 09:51:42+00:00", "description": "After a lot of hype and anticipation, the “Yellowstone” prequel “1923” premiered on Paramount+ to a record audience.  Paramount Global reported that 7.4 million people tuned in to the premiere episode Sunday, including viewers from three Paramount Network telecasts, CMT, and streaming on Paramount+, according to The Hollywood Reporter. The series stars Harrison Ford and ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/lauren-boebert-and-marjorie-taylor-greene-go-to-war-with-each-other-threw-me-under-the-bus", "title": "Lauren Boebert And Marjorie Taylor Greene Go To War With Each Other: ‘Threw Me Under The Bus’", "date_published": "2022-12-20 09:42:20+00:00", "description": "Rep. Lauren Boebert (R-CO) and Rep. Marjorie Taylor Greene (R-GA) went to war with each other Monday night after Boebert took a shot at Greene during an interview. Boebert brought up Greene&#8217;s past anti-Semitic conspiracy theories when asked if she agreed with Greene&#8217;s support for making House Minority Leader Kevin McCarthy (R-CA) the next speaker ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/kari-lake-election-lawsuit-can-go-to-trial-judge-rules", "title": "Kari Lake Election Lawsuit Can Go To Trial, Judge Rules", "date_published": "2022-12-20 09:29:27+00:00", "description": "A Maricopa County judge ruled Monday that Republican gubernatorial candidate Kari Lake will have her day in court to challenge the county&#8217;s ballot chain of custody and the efficacy of voting machine tabulators and printers during the 2022 midterm elections. Judge Peter Thompson dismissed eight other claims made by Lake in the lawsuit, but he ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/shock-wave-hits-earth-cracks-magnetosphere-that-protects-planet-from-radiation", "title": "Shock Wave Hits Earth, Cracks Magnetosphere That Protects Planet From Radiation", "date_published": "2022-12-20 09:06:38+00:00", "description": "A shock wave hit Earth’s magnetic field on Sunday night, cracking the magnetosphere, which protects the planet from radiation. Earth’s magnetic field, also called the geomagnetic field, extends from the interior of the earth thousands of miles into space. Electric currents, resulting from convection currents stimulated by molten iron and nickel in Earth’s outer core, ...", "persistent": false, "language": "en-US"}], "source url": "https://www.dailywire.com/feeds/rss.xml", "source title": "Daily Wire"}