[{"source": "https://www.gamespot.com/feeds/mashup", "title": "Destiny 2: How To Get The Revision Zero Exotic Pulse Rifle", "description": "<p>In addition to the <a href=\"https://www.gamespot.com/articles/destiny-2-spire-of-the-watcher-dungeon-guide/1100-6509966/\">Hierarchy of Needs Exotic </a>bow and <a href=\"https://www.gamespot.com/articles/destiny-2-season-of-the-seraph-guides-season-pass-gear-exotics/1100-6509713/\">The Manticore Exotic SMG</a>, Destiny 2's Season of the Seraph brings a new Exotic pulse rifle called Revision Zero. Revision Zero's intrinsic trait makes it strong against Barrier Champion's with its shield-piercing ammo. It also gathers target data from precision kills that lets you temporarily swap for a high-damage scope. Completing The Hidden Shape quest steps will give you Revision Zero and its weapon pattern for shaping it.</p><p>First, continue Season of the Seraph's Week three questline--called More Than A Weapon--and at Step 22 of the quest, you must speak with Elsie Bray at the Holoprojector. Accept<strong> The Hidden Shape Exotic quest</strong> and <strong>complete the Operation: Seraph's Shield mission</strong>--which you can access from the H.E.L.M. and is set at Power level 1580 for Normal mode. This mission doesn't have matchmaking, so you can complete it solo.</p><h2>Operation: Seraph's Shield Mission Guide</h2><p>Once at the facility entrance, avoid tripmines and head further into the facility. Defeat the Scanner Splicer to get the Scanner Augment, a mechanic that should be familiar from the Deep Stone Crypt raid.</p><a href=\"https://www.gamespot.com/articles/destiny-2-how-to-get-the-revision-zero-exotic-pulse-rifle/1100-6510185/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/destiny-2-how-to-get-the-revision-zero-exotic-pulse-rifle/1100-6510185/?ftag=CAD-01-10abi2f", "date_published": "2022-12-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Marvel's Midnight Suns: All Tarot Card Locations", "description": "<p>Marvel's Midnight Suns contains a few side quests and collectible hunts that you can choose to complete when you're not busy fighting Hydra and stopping Lilith's demon-related plans. There are <strong>22 Marvel-themed tarot cards</strong> to find inside the Abbey home base and the surrounding forest, but you'll need to get all <a href=\"https://www.gamespot.com/articles/marvels-midnight-suns-how-to-get-all-words-of-power/1100-6510017/\">Words of Power</a> to access the entire map. We're here to show you exactly where to look for each card.</p><h2>All Tarot Card Locations</h2><h3>The Moon</h3><p>Three tarot cards can be found inside the Abbey's main building, and The Moon is included in that trio. It's inside the forge room, next to a large bookshelf. The Moon is, of course, represented by Moon Knight for the card's art.</p><figure><div class=\"image-gallery__label\">Gallery</div>   <div class=\"image-gallery__list hide-scrollbar image-gallery__list--small\">       <a href=\"https://www.gamespot.com/a/uploads/original/1775/17752664/4079093-marvel%27smidnightsunsscreenshot2022.12.03-20.41.12.33.png\">       <img alt=\"Gallery image 1\" src=\"https://www.gamespot.com/a/uploads/square_avatar/1775/17752664/4079093-marvel%27smidnightsunsscreenshot2022.12.03-20.41.12.33.jpg\" />     </a>       <a href=\"https://www.gamespot.com/a/uploads/original/1775/17752664/4079092-marvel%27smidnightsunsscreenshot2022.12.19-16.06.37.06.png\">       <img alt=\"Gallery image 2\" src=\"https://www.gamespot.com/a/uploads/square_avatar/1775/17752664/4079092-marvel%27smidnightsunsscreenshot2022.12.19-16.06.37.06.jpg\" />     </a>   </div>    <figcaption>The Moon tarot card location</figcaption> </figure><h3>The Star</h3><p>The Star is in the same room as The Moon--it's on the opposite side of the forge, on top of a red workbench. Nova is the character who was chosen to represent this arcana, and he's used in its card art.</p><a href=\"https://www.gamespot.com/articles/marvels-midnight-suns-all-tarot-card-locations/1100-6510162/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/marvels-midnight-suns-all-tarot-card-locations/1100-6510162/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 23:17:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Dwayne Johnson Confirms Black Adam 2 Isn't Happening At DC Studios", "description": "<p>In the run-up to Black Adam's release, star Dwayne Johnson seemed to be making a big power play with the character in regard to DC's future films. However, with the changing of the guard at DC Studios and the film's lackluster box office performance, it seems like Black Adam's future is grim, and Johnson provided an update via <a href=\"https://twitter.com/TheRock/status/1605322145768165376\">Twitter</a>.</p><p>\"James Gunn and I connected, and Black Adam will not be in their first chapter of storytelling,\" Johnson wrote. \"However, DC and Seven Bucks have agreed to continue exploring the most valuable ways Black Adam can be utilized in future DC multiverse chapters.\"</p><div><blockquote align=\"center\" class=\"twitter-tweet\"><p dir=\"ltr\">Black Adam⚡️ <a href=\"https://t.co/b7ZbCJZxBw\">pic.twitter.com/b7ZbCJZxBw</a></p>  — Dwayne Johnson (@TheRock) <a href=\"https://twitter.com/TheRock/status/1605322145768165376?ref_src=twsrc^tfw\">December 20, 2022</a></blockquote>              </div><p> </p><a href=\"https://www.gamespot.com/articles/dwayne-johnson-confirms-black-adam-2-isnt-happening-at-dc-studios/1100-6510207/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/dwayne-johnson-confirms-black-adam-2-isnt-happening-at-dc-studios/1100-6510207/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 23:16:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "DualSense Edge Hand-On Preview", "description": "<img height=\"480\" src=\"https://www.gamespot.com/a/uploads/square_medium/1574/15746725/4079457-edge_v0.jpg\" width=\"480\" /> PlayStation is leaping into the world of prosumer controllers with the DualSense Edge.", "link": "https://www.gamespot.com/videos/dualsense-edge-hand-on-preview/2300-6460285/", "date_published": "2022-12-20 23:04:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "You Can Move Your Ubisoft Games You Bought On Stadia To Ubisoft Connect For Free", "description": "<p>If you own any Ubisoft games on Stadia, you'll receive Ubisoft Connect copies of them at no additional cost. This will happen automatically if you have linked your Ubisoft account to Stadia. If you haven't already, you'll need to do that before Stadia shuts down on January 18, 2023 in order to receive your games.</p><p>It's important to note that in-game currency will not transfer to Ubisoft Connect, but any items you purchase will, if the game in question has cross-progression. You can check out an <a href=\"https://www.ubisoft.com/en-us/help/purchases-and-rewards/article/information-about-ubisoft-games-on-stadia/000103864\">FAQ from Ubisoft</a> for more details of what exactly will transfer.</p><p>If you subscribed to Ubisoft+ Multi-Access through Stadia, you'll get an email with instructions on how to sign up directly on the Ubisoft website. You'll also receive a voucher for a free month of Ubisoft+. If you're in the US, you can continue streaming Ubisoft+ through Amazon Luna. If you're outside the US, you'll get a discount for six months of Ubisoft+ Multi-Access. Every Ubisoft customer on Staidia, whether a subscriber or an owner of games, will get a coupon code for one free month of GeForce Now Priority Membership.</p><a href=\"https://www.gamespot.com/articles/you-can-move-your-ubisoft-games-you-bought-on-stadia-to-ubisoft-connect-for-free/1100-6510206/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/you-can-move-your-ubisoft-games-you-bought-on-stadia-to-ubisoft-connect-for-free/1100-6510206/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 22:04:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "James Cameron Is Thinking About Relaunching The Terminator Franchise", "description": "<p>The Terminator has been relaunched what feels like T-1000 times. But that's not stopping discussions from happening for another installment, according to director James Cameron. He hasn't helmed an entry since Terminator 2: Judgment Day, though he did produce as well as develop the story for Terminator: Dark Fate.</p><p dir=\"ltr\">Speaking on <a href=\"https://open.spotify.com/episode/2gT2swiBao15w0laLIiWf0?si=e4d8b81b80594eaf&amp;nd=1\">the Smartless podcast</a> (via <a href=\"https://theplaylist.net/terminator-james-cameron-says-hes-had-discussions-about-relaunching-the-franchise-directing-it-20221219/?utm_source=dlvr.it&amp;utm_medium=twitter\">The Playlist</a>), Cameron conversed about themes and messaging in his movies. \"Well, the Avatar films are about the environment; I’m not dealing with AI,\" he said. \"If I were to do another Terminator film and maybe try and to launch that franchise again--which is in discussion, but nothing has been decided--I would make it much more about the AI side of it than bad robots gone crazy.\"</p><p dir=\"ltr\">Terminator: <a href=\"https://www.gamespot.com/articles/terminator-dark-fate-was-planned-as-first-movie-in/1100-6470751/\">Dark Fate was actually planned as the start of a trilogy</a>. But that was put on hold after lackluster box office results for the film. That's actually the second time in a row the series has landed in molten steel after a rough start. <a href=\"https://www.gamespot.com/articles/terminator-genisys-sequel-officially-removed-from-/1100-6434013/\">Terminator: Genisys also was supposed to see two sequels</a> originally. That obviously didn't pan out.</p><a href=\"https://www.gamespot.com/articles/james-cameron-is-thinking-about-relaunching-the-terminator-franchise/1100-6510205/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/james-cameron-is-thinking-about-relaunching-the-terminator-franchise/1100-6510205/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 22:02:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Get 14 Star Wars Games For $21 For A Limited Time", "description": "<p>If you're in the mood to go to a galaxy far, far away, Fanatical's Star Wars Collection offers an affordable trip down memory lane. The bundle comes with 14 Star Wars games, including several of the <a href=\"https://www.gamespot.com/articles/best-star-wars-games-in-2022-10-must-play-titles-set-in-a-galaxy-far-far-away/1100-6495929/\">best Star Wars games</a> of all time. The Star Wars Collection is only $21, so you're getting the 14 titles (Steam keys) for only $1.50 each.</p><div class=\"norewrite\" title=\"\">           <a href=\"https://www.anrdoezrs.net/links/9020176/type/dlg/sid/subid_value/https://www.fanatical.com/en/bundle/star-wars-collection?v=4042\">See Star Wars Collection at Fanatical</a> </div><p>Three of our 10 favorite Star Wars games our featured in the bundle: Knights of the Old Republic, Star Wars: Republic Commando, and Star Wars Jedi Knight II: Jedi Outcast. KOTOR is arguably the most beloved Star Wars game, and with a <a href=\"https://www.gamespot.com/articles/star-wars-knights-of-the-old-republic-remake-coming-to-ps5/1100-6496084/\">remake in the works</a>, now's not a bad time to revisit this all-time classic.</p><p>Once you roll credits on KOTOR, you can jump into Star Wars Knights of the Old Republic II: The Sith Lords, which is also included in the collection. And if you're looking for a more action-focused Star Wars game, both Force Unleashed games are in the Star Wars Collection.</p><a href=\"https://www.gamespot.com/articles/get-14-star-wars-games-for-21-for-a-limited-time/1100-6504813/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/get-14-star-wars-games-for-21-for-a-limited-time/1100-6504813/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 21:28:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "The Most-Anticipated PlayStation Games Of 2023 And Beyond", "description": "<p><img src=\"https://www.gamespot.com/a/uploads/scale_large/1639/16394322/4079394-screen-shot-2021-09-09-at-5-06-35-pm-1631221615252.jpg\" /><br /><h3><p dir=\"ltr\">Between God of War Ragnarok, Horizon Forbidden West, and The Last of Us Part I, 2022 was a big year for PlayStation fans. However, if you're thinking that means we have a quiet 2023 ahead of us, guess again.</p><p dir=\"ltr\">Between brand-new IPs, a return-to-form from the Assassin's Creed series, several survival-horror revivals, and a new entry in one of the most celebrated fighting game franchises of all time, there's plenty to get excited about. As such, we've rounded up a list of the biggest games hitting PlayStation consoles in 2023 and beyond.</p><p dir=\"ltr\">While many of the games on this list are not PlayStation exclusives, per se, all of these titles will be available on PlayStation consoles, making this a pretty comprehensive source for Sony fans looking to update their release calendars.</p><p>For even more PlayStation coverage, you can check out GameSpot's features on the <a href=\"https://www.gamespot.com/gallery/the-best-playstation-rpgs-for-ps5-and-ps4/2900-4148/\">best RPGs for PS4 and PS5</a>, the <a href=\"https://www.gamespot.com/gallery/best-free-ps5-games-to-play-in-2022/2900-3961/\">best free PS5 games</a> to play right now, and the <a href=\"https://www.gamespot.com/gallery/best-ps5-games-must-play-playstation-5-games/2900-3832/\">must-play PS5 titles</a> that are currently available.</p></h3></p><br />     <p><h2>Forspoken - January 24, 2023</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4019269-forspoken.jpg\" /><br /><h3><p><a href=\"https://www.gamespot.com/articles/square-enixs-forspoken-delayed-to-2023-for-ps5-and-pc/1100-6505130/\">Delayed but never forgotten</a>, Forspoken follows protagonist Frey Holland as she finds herself transported to the fantasy land of Athia. Able to wield vast magical powers and resist the the destructive effects of a magical storm-like phenomenon known as The Break, Frey is the last hope for a land that's in desperate need of a hero. An open-world action game with an emphasis on high-speed traversal and magic, Frey's journey doesn't just look visually impressive; it has some impressive tech thanks to the incorporation of <a href=\"https://www.gamespot.com/articles/forspoken-gets-an-amd-fsr-upgrade-in-new-gameplay-trailer/1100-6493186/\">AMD's new FidelityFX Super Resolution tech</a> into its design.</p><div><div class=\"norewrite\" title=\"\">           <a href=\"https://assoc-redirect.amazon.com/g/r/https://www.amazon.com/Forspoken-PlayStation-5/dp/B09NBBW4LS?tag=gamespotdeals-20&amp;ascsubtag=ag:gs-2900-4259|vg:-|st:mwb\">Preorder at Amazon</a> </div></div><p> </p></h3></p><br />     <p><h2>Dead Space Remake - January 27, 2023</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1639/16394322/4079395-4077778-deadspace.jpg\" /><br /><h3><p>After nearly a decade, we are finally getting a new Dead Space game--kind of. A remake of 2008's Dead Space, this upcoming survival-horror game retains the same basic plot as the original albeit with greatly improved visuals, no loading screens, new voice acting, and additional content that was removed from the original game due to technological restraints. The game follows USG Ishimura engineer Isaac Clarke, who makes the unfortunate discovery that mutated human corpses have begun attacking his fellow crewmates while investigating a distress signal from the ship's medical officer--who just so happens to be his girlfriend.</p></h3></p><br />     <p><h2>Hogwarts Legacy - February 10, 2023</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1639/16394322/4079396-egs_hogwartslegacy_avalanchesoftware_s1_2560x1440-2baf3188eb3c1aa248bcc1af6a927b7e.jpg\" /><br /><h3><p>Revisit the wizarding world of Harry Potter in Hogwarts Legacy, an open-world, action RPG that allows players to become a witch or wizard and attend classes at Hogwarts while getting into all sorts of mischief and mayhem--and even murder. Players will be able to choose their appearance, house, and gender, as well as level up and specialize in different spells and abilities. Hogwarts Legacy also features several iconic beasts from the series that you can care for, including hippogriffs and thestrals. Leading up to its release, Hogwarts Legacy has come under intense scrutiny for J.K. Rowling's transphobic views, former lead designer Troy Leavitt's controversial opinions, and its main story, which tasks children with suppressing a goblin rebellion through murder and torture.</p></h3></p><br />     <p><h2>Like A Dragon: Ishin! - February 21, 2023</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1639/16394322/4079397-4035976-likeadragonishin.jpg\" /><br /><h3><p>The Yakuza series is traveling back in time in the upcoming remake of 2014's Like A Dragon: Ishin! Set in 1866, Ishin follows real-life samurai Sakamoto Ryōma who, after being imprisoned then freed by his father figure Yoshida Tōyō, dedicates his life to ending the rigid class system in Japan. The game is noted as being most similar to Yakuza 5, as it uses the same Climax Heat system, but overall, differs greatly from the series. As Like A Dragon: Ishin! was previously only available in Japan, this remake marks the first time the game will be released worldwide.</p></h3></p><br />     <p><h2>Destiny 2: Lightfall - February 28, 2023</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1639/16394322/4079404-4026549-2022_lightfall_reveal.jpg\" /><br /><h3><p>The seventh DLC for Destiny 2 and the penultimate chapter in the game's ongoing Light and Darkness saga, Lightfall takes Guardians on a journey to the Neptunian city of Neomuna. Inspired by <a href=\"https://www.gamespot.com/articles/bungie-wants-destiny-2-lightfall-to-feel-like-blade-runner-meets-independence-day/1100-6507069/\">Blade Runner</a>, players can explore the neon-lit city as they team up with the Cloudstriders--Neomuna's protectors--and fend off antagonist Calus. New in-game features include <a href=\"https://www.gamespot.com/articles/destiny-2-is-aiming-to-become-more-social-than-ever-with-improved-lfg-and-guardian-rank-systems/1100-6506783/\">in-game loadout builds and a mod manager</a>, as well as the next <a href=\"https://www.gamespot.com/articles/destiny-2-lightfalls-grapple-will-change-how-you-interact-with-the-whole-game/1100-6507736/\">Darkness subclass, Strand</a>. Equipping the Strand ability turns Warlocks into telekinetically powered Architects, Titans into claw-bearing Tyrants, and Hunters into agile Threadrunners. All three classes can use their Strand abilities to launch grappling hooks into the environment around them as a new means of lightning-fast traversal.</p></h3></p><br />     <p><h2>Horizon: Call of the Mountain (PSVR 2) - February 22, 2023</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4019277-horizoncallofthemountain.jpg\" /><br /><h3><p>Horizon fans looking for a fresh perspective can start getting ready for a first-person take on the popular robot post-apocalypse adventure series, as Guerilla Games is bringing its hit franchise to the upcoming PSVR 2. The shift to first-person adventuring naturally makes a big difference to elements like climbing and combat, <a href=\"https://www.gamespot.com/articles/psvr-2s-horizon-call-of-the-mountain-debut-trailer-shows-first-person-robot-combat/1100-6504073/\">and judging by the teaser trailer</a>, a whole lot more intimidating when you have to face off against a mechanized beast eye to robotic eye.</p></h3></p><br />     <p><h2>Skull and Bones - March 9, 2023</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1639/16394322/4079405-hero-fallback-desktop.jpg\" /><br /><h3><p>For PlayStation owners who have been patiently waiting for their own Sea of Thieves, Ubisoft is at long last answering the call with Skull and Bones. While decidedly less cartoonish, Skull and Bones is a tactical action game set on the open sea that allows players to team up and engage in piracy and naval warfare. In addition to this multiplayer mode, the game also features a single-player campaign set in the Indian Ocean. Originally intended as an Assassin's Creed IV: Black Flag spinoff, Skull and Bones has been in development since 2013. Here's hoping for no more delays in 2023.</p></h3></p><br />     <p><h2>Star Wars Jedi: Survivor - March 15, 2022</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1639/16394322/4079423-4075217-starwars.jpg\" /><br /><h3><p>The sequel to 2019's Star Wars Jedi: Fallen Order, Survivor takes place five years after its predecessor--during approximately the same timeframe as Disney+'s Obi-Wan Kenobi series--and follows Jedi Knight Cal Kestis as he hides from the Galactic Empire following the execution of Order 66. The upcoming sequel is said to have a \"wider Metroidvania approach\" than Fallen Order, as well as an emphasis on honing your individual fighting style.</p></h3></p><br />     <p><h2>Resident Evil 4 Remake - March 24, 2023</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1639/16394322/4079409-4052279-re4.png\" /><br /><h3><p>Following the success of Resident Evil 2 Remake and Resident Evil 3 Remake, Capcom has turned their attention to one of the most critically-acclaimed titles in the horror series: Resident Evil 4. Resident Evil 4 follows series mainstay Leon S. Kennedy as he travels to a rural village in Spain to rescue the US President's daughter. Once Leon arrives, he discovers the village has been compromised by a violent, parasite-worshiping cult named Los Illuminados. The upcoming remake boasts impressive visuals and a handful of quality-of-life changes, such as a greatly enhanced parry system.</p></h3></p><br />     <p><h2>Dead Island 2 - April 28, 2023</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1639/16394322/4079410-egs_deadisland2_deepsilverdambusterstudios_s1_2560x1440-fdc688ce46680914ee3c4a7949ce8a67.jpg\" /><br /><h3><p>The long-awaited numbered sequel to 2011's Dead Island, Dead Island 2 is set several months after the events of Dead Island: Riptide in sunny Los Angeles, California. But while the weather might be nice, the conditions are far from perfect, as the zombie apocalypse has forced the city into a strict lockdown. In Dead Island 2, you play as a survivor who has been infected via zombie bite. However, instead of succumbing to your wounds, this bite grants you some unusual powers you can harness against the living dead as you hunt them down in this over-the-top action-RPG.</p></h3></p><br />     <p><h2>Street Fighter 6 - June 2, 2023</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1639/16394322/4079411-4036678-sf6roster.jpg\" /><br /><h3><p>Capcom's legendary fighting game series returns with Street Fighter 6. 12 familiar faces are set to return to the series in this next entry--including fan-favorites Ryu, Guile, Cammy, and Chun-Li--along with six new characters. The game features three overarching game modes, Fighting Ground, World Tour, and Battle Hub, as well as a new Drive Gauge mechanic. This mechanic allows players to hone in on a certain style of play by emphasizing five different techniques based on fighting styles from previous entries.</p></h3></p><br />     <p><h2>Diablo IV - June 6, 2023</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1639/16394322/4079413-open-graph.jpg\" /><br /><h3><p>Blizzard's legendary action-RPG returns with a darker tone and more \"grounded story\" in Diablo IV. Set in the familiar yet ever-grim world of Sanctuary, Diablo IV sees you take on the role of a powerful warrior on a mission to stop the demon Lilith and the cult that summoned her. The game features five classes--Barbarian, Sorceress, Rogue, Druid, and Necromancer--as well as the series' iconic loot-grinding gameplay loop. Familiar systems return, such as skill trees and runes, along with three new attributes: Angelic, Demonic, and Ancestral Power.</p></h3></p><br />     <p><h2>Final Fantasy XVI - June 22, 2023</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4019271-finalfantasyxvi.jpg\" /><br /><h3><p>The next chapter in the Final Fantasy mainline series appears to be an <a href=\"https://www.gamespot.com/articles/final-fantasy-16-dumped-traditional-turn-based-combat-so-that-it-could-appeal-to-younger-gamers/1100-6505477/\">action-packed blend of swords and sorcery</a> that follows in the footsteps of Final Fantasy VII Remake. Featuring a <a href=\"https://www.gamespot.com/articles/final-fantasy-16-is-an-ambitious-more-mature-entry-in-the-series-says-producer/1100-6504803/\">more mature storyline</a> with conflicts between multiple worlds and ample political drama, Final Fantasy XVI will follow protagonist Clive Rosfield, the son of an archduke, throughout three different eras of his life. While it's not an open-world game, the unique areas look ripe for exploration, and there will be <a href=\"https://www.gamespot.com/articles/final-fantasy-16-wont-be-an-open-world-game-but-its-eikon-battles-will-all-be-unique/1100-6504814/\">large-scale boss fights featuring Eikon.</a> For more details, check out a detailed roundup of <a href=\"https://www.gamespot.com/articles/final-fantasy-16-everything-we-know/1100-6485789/\">everything we currently know about Final Fantasy XVI.</a></p></h3></p><br />     <p><h2>Assassin's Creed Mirage - 2023</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1639/16394322/4079415-ac-mirage-basim-side-profile.jpg\" /><br /><h3><p>The 13th installment in the Assassin's Creed mainline series, Assassin's Creed Mirage is set in 9th century Baghdad and follows Basim Ibn Ishaq, a character introduced in Assassin's Creed Valhalla. Ubisost has described the game as a return to the series' roots, with less focus on RPG elements and a renewed emphasis on linear storytelling and stealth. <em>Mirage</em> also marks the return of the series' Black Box assassination missions, which task players with finding unique ways to eliminate dangerous targets.</p></h3></p><br />     <p><h2>Eternights - 2023</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4019273-eternights.jpg\" /><br /><h3><p>If you thought the regular dating game was tough, try finding a partner when the apocalypse is around the corner. Eternights is a dating action game that blends dungeon-crawling exploration with a chance to romance a cast of five quirky and lovable characters. You'll need to scavenge, survive, and build relationships while facing a ticking clock, but the stronger your bond becomes with your party, the more powerful you'll become as you unlock unique skills and spells that you can use in battle.</p></h3></p><br />     <p><h2>Marvel's Spider-Man 2 - 2023</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4019270-marvel%27sspider-man2.jpg\" /><br /><h3><p>Insomniac is doubling down on web-slingers for its next Spider-Man game and pitting them against some familiar villains. While details on how the game will evolve the spider-formula are still being kept under wraps, what we do know is that the sequel will be <a href=\"https://www.gamespot.com/articles/marvels-spider-man-2-is-being-compared-to-the-empire-strikes-back/1100-6496671/\">darker than the first entry in the series</a> and is being compared to Star Wars: The Empire Strikes Back. As for villains, you can expect to tangle with slimy symbiote Venom, voiced by none other than Candyman actor Tony Todd.</p></h3></p><br />     <p><h2>Suicide Squad: Kill the Justice League - 2023</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1639/16394322/4079416-ss_fed60f765e3b5facf915d0b70b7a05105aa3525b.1920x1080.jpg\" /><br /><h3><p>Rocksteady is returning to the DC Universe with Suicide Squad: Kill the Justice League. A noticeable departure from the Batman: Arkham series, Kill the Justice League follows the super villain-turned-anti-hero group The Suicide Suqad as they are given the seemingly impossible task of killing the alien invader Brainiac and any members of the Justice League who have been brainwashed by him. The game features four playable characters--Captain Boomerang, Deadshot, Harley Quinn, and King Shark--a whole lot of multiplayer fun, and most notably, Kevin Conroy's final performance as Batman following his passing on November 10, 2022.</p></h3></p><br />     <p><h2>Final Fantasy VII Rebirth - TBA</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4019272-finalfantasyviirebirth.jpg\" /><br /><h3><p>Final Fantasy VII Remake was a perfect example of how to revitalize a a classic game, and with the opening chapter behind it, Final Fantasy VII Rebirth looks set to chart new ground as the middle chapter for the ambitious trilogy. Details are naturally being kept under lock and key, but creative director Tetsuya Nomura did mention that development of Rebirth has been \"progressing rapidly since we adopted a new development structure,\" and that some development of the third game is already in progress as well.</p><p>Nomura also added that Rebirth is being developed in such a way that you don't need to have played the original version of Final Fantasy VII, nor do you even necessarily need to have played Remake (though we'd definitely recommend it). Rebirth is expected to launch between December 2023 and March 2024.</p></h3></p><br />     <p><h2>Marvel's Wolverine - TBA</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4019275-marvel%27swolverine.jpg\" /><br /><h3><p>It's still early days for Spider-Man developer Insomniac's <em>next </em>Marvel game, but the studio is getting ready to put everyone's favorite mutant back in the video game spotlight. Details are naturally slim at this point in time, but if the trailer is anything to go by, then this mature take on Wolverine should be a bloody adventure where the berserker is more than ready to prove that he's the best there is at what he does. And what he does ain't pretty, <em>bub</em>.</p></h3></p><br />     <p><h2>Silent Hill 2 Remake - TBA</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1639/16394322/4079418-ss_c0e2e0bf843a964df1bc6e561ebcd9bb3eeb4bad.1920x1080.jpg\" /><br /><h3><p>One of the most notable survival-horror games of all time is getting the remake treatment in Silent Hill 2 Remake. Originally released in 2001, Silent Hill 2 follows James Sunderland as he searches the eerie town of Silent Hill (hey, <a href=\"https://www.gamespot.com/gallery/we-went-to-the-abandoned-town-that-inspired-the-silent-hill-movie/2900-4388/\">we went there last year!</a>) for his thought-to-be-deceased wife. The game primarily consists of solving riddles and puzzles as well as avoiding death--particularly at the hands of the iconic villain Pyramid Head. Upon release, the game was praised for its dark themes, smart use of symbolism, and shocking plot. While Bloober Team has not stated all the changes coming to the remake, most notably is the pivot to an \"over-the-shoulder\" third-person perspective, similar to the recent Resident Evil remakes.</p></h3></p><br />     <p><h2>Star Wars: Knights of the Old Republic Remake (indefinitely delayed)</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4019276-starwarsknightsoftheoldrepublicremake.jpg\" /><br /><h3><p>The remake of Star Wars: Knights of the Old Republic, considered to be one of the greatest RPGs of all time, is in a perilous position right now. We're holding out for that New Hope, even if the project <a href=\"https://www.gamespot.com/articles/star-wars-knights-of-the-old-republic-remake-delayed-indefinitely-according-to-report/1100-6505913/\">might be delayed indefinitely</a> following a stall in development at studio Aspyr Media. If it does make it past these new hurdles, then expect a complete rebuild of the BioWare classic that's still home to one of the best twists in modern gaming.</p></h3></p><br />", "link": "https://www.gamespot.com/gallery/the-most-anticipated-playstation-games-of-2023-and-beyond/2900-4259/", "date_published": "2022-12-20 21:27:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Pokemon Go Winter Holiday Event Part 2 Adds More Pokemon In Festive Holiday Hats", "description": "<p dir=\"ltr\">The <a href=\"https://www.gamespot.com/articles/pokemon-go-winter-holiday-event-returns/1100-6509990/\">Pokemon Go Winter Holiday event</a> is in full swing, with Part 1 giving players the chance to catch special holiday-themed Pokemon and face off against new Ice-type Mega Pokemon. Part 2 is coming in just a few days, and the pool of holiday-themed Pokemon is about to feel an Eeveelution.</p><p dir=\"ltr\">The Winter Holiday Event Part 2 officially kicks off December 23 at 10 AM local time, and it will run until December 31 at 8 PM local time. Eevee and all of its evolved forms--Jolteon, Vaporeon, Flareon, Espeon, Umbreon, Leafeon, Glaceon, and Sylveon--will see new holiday forms added to the game, though the only way to see an evolved form in a festive hat is to evolve an Eevee wearing said hat.</p><figure style=\"width: 1280px;\"><a href=\"https://www.gamespot.com/a/uploads/original/3/37852/4079378-pokemon-go-winter-holiday-part-2.jpg\"><img alt=\"Eevee and its pals will soon be donning special holiday-themed hats.\" src=\"https://www.gamespot.com/a/uploads/original/3/37852/4079378-pokemon-go-winter-holiday-part-2.jpg\" /></a><figcaption>Eevee and its pals will soon be donning special holiday-themed hats.</figcaption></figure><p dir=\"ltr\"><span>All of the Pokemon available during Part 1 will remain in the game for Part 2, including Mega Glalie in Mega Raids and the special Winter Carnival Pikachu variant in one-star raids. A special Event Research ticket will also be available for $5, which will give players access to special quests that will focus on event-themed Pokemon encounters, as well as extra rewards for completing them.</span></p><a href=\"https://www.gamespot.com/articles/pokemon-go-winter-holiday-event-part-2-adds-more-pokemon-in-festive-holiday-hats/1100-6510203/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/pokemon-go-winter-holiday-event-part-2-adds-more-pokemon-in-festive-holiday-hats/1100-6510203/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 21:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "The Biggest Holiday Gaming Sales Happening Right Now", "description": "<p><img src=\"https://www.gamespot.com/a/uploads/scale_large/1702/17023653/4079335-nintendo%281%29.jpg\" /><br /><em>Credit: Nintendo</em><br /><h3><p>The holiday season is always a great time to pick up games and accessories at discounted prices. Retailers across the board are slashing prices on PS5, Switch, PC, and Xbox products--but most of these promotional events end as soon as we roll into 2023. Whether you’re shopping for your family or want to add another game to your own library, there are plenty of impressive sales to check out.</p><p>One of the biggest sales is happening over at <span class=\"norewrite\">           <a href=\"https://www.jdoqocy.com/click-9020176-13248075-1536151111000?sid=subid_value\">Fanatical,</a> </span> as the storefront is discounting thousands of games. It recently updated its catalog with even more items, letting you snag <span class=\"norewrite\">           <a href=\"https://www.anrdoezrs.net/links/9020176/type/dlg/sid/subid_value/https://www.fanatical.com/en/game/god-of-war\">God of War</a> </span> for $25 or <span class=\"norewrite\">           <a href=\"https://www.anrdoezrs.net/links/9020176/type/dlg/sid/subid_value/https://www.fanatical.com/en/game/deathloop\">Deathloop</a> </span> for $17. You’ll also earn a free game when spending over $12 on your order, so be sure to hit that mark before checking out. Fanatical is far from the only PC games storefront offering tremendous deals.</p><p><span class=\"norewrite\">           <a href=\"https://shop-links.co/link/?url=https://www.bestbuy.com/site/clp/sale-page/pcmcat185700050011.c&amp;publisher_slug=gamespot&amp;article_name=The Biggest Holiday Gaming Sales Happening Right Now&amp;article_url=http://www.gamespot.com/gallery/the-biggest-holiday-gaming-sales-happening-right-now/2900-4558/&amp;exclusive=1&amp;u1=subid_value\">Best Buy’s Last-Minute Sale</a> </span> is a great option if you’re still wrapping up your holiday shopping, as many products are eligible for curbside pickup and can be ready in less than an hour. Along with a vast selection of games, Best Buy is also discounting TVs, laptops, and other electronics.</p><p>As always, first-party storefronts for <span class=\"norewrite\">           <a href=\"https://store.playstation.com/en-us/pages/deals\">PlayStation,</a> </span> <span class=\"norewrite\">           <a href=\"https://click.linksynergy.com/deeplink?id=VZfI20jEa0c&amp;mid=24542&amp;u1=subid_value&amp;murl=https://www.xbox.com/en-US/promotions/sales/countdown-sale\">Xbox,</a> </span> and <span class=\"norewrite\">           <a href=\"https://www.nintendo.com/store/sales-and-deals/\">Switch</a> </span> are all joining in on the festivities. Nintendo’s catalog isn’t quite as robust as the other two, but you’ll still find some underrated indies and popular games from the Square Enix catalog on sale. PlayStation and Xbox, meanwhile, are slashing prices on hundreds of games--so be sure to check them out if your prospective game isn’t discounted elsewhere.</p><p>Don't forget you can also snag free games during the holidays. <a href=\"https://www.gamespot.com/articles/epic-is-giving-away-15-free-games-this-holiday/1100-6510080/\">Epic is giving away one free game</a> each day through December 29, and Amazon will offer <a href=\"https://www.gamespot.com/articles/amazon-is-giving-away-10-free-games-to-prime-subscribers-this-holiday/1100-6509948/\">10 freebies for Prime members</a> starting December 27.</p><p>To help you navigate all the deals available today, here’s a look at every winter/holiday sale that’s available today. Remember--many of these will end after the holidays, so try to find time in your busy schedule to take a look and save some cash.</p></h3></p><br />     <p><h2>Humble Bundle Year End Sale</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1702/17023653/4079323-humble%281%29.jpg\" /><br /><h3><p><a href=\"https://www.gamespot.com/articles/humble-bundles-year-end-sale-has-some-incredible-deals/1100-6510141/\">Humble</a> always seems to have a big sale going on, but things are even more exciting as we slowly roll into 2023. Head over to the retailer and you’ll find <span class=\"norewrite\">           <a href=\"https://www.anrdoezrs.net/links/9020176/type/dlg/sid/subid_value/https://www.humblebundle.com/store/sonic-frontiers\">Sonic Frontiers</a> </span> for $42, <span class=\"norewrite\">           <a href=\"https://www.anrdoezrs.net/links/9020176/type/dlg/sid/subid_value/https://www.humblebundle.com/store/stardew-valley\">Stardew Valley</a> </span> for $11, and <span class=\"norewrite\">           <a href=\"https://www.anrdoezrs.net/links/9020176/type/dlg/sid/subid_value/https://www.humblebundle.com/store/god-of-war\">God of War</a> </span> for $30. Most products are offered as Steam keys.</p><div><div class=\"norewrite\" title=\"\">           <a href=\"https://www.humblebundle.com/store/search?sort=bestselling&amp;filter=onsale&amp;hmb_source=navbar\">See deals at Humble</a> </div></div><p> </p></h3></p><br />     <p><h2>Xbox Store Countdown Sale</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1702/17023653/4079330-xboxcountdownsale%281%29.jpg\" /><br /><h3><p> </p><p>Looking for the best discounts on games released this year? Head over to the <a href=\"https://www.gamespot.com/articles/more-than-1000-xbox-games-are-discounted-in-huge-new-sale/1100-6510136/\">Xbox Store</a>, where you’ll find <span class=\"norewrite\">           <a href=\"https://click.linksynergy.com/deeplink?id=VZfI20jEa0c&amp;mid=24542&amp;u1=subid_value&amp;murl=https://www.xbox.com/en-us/games/store/elden-ring/9P3J32CTXLRZ\">Elden Ring</a> </span> for $42, <span class=\"norewrite\">           <a href=\"https://click.linksynergy.com/deeplink?id=VZfI20jEa0c&amp;mid=24542&amp;u1=subid_value&amp;murl=https://www.xbox.com/en-us/games/store/saints-row/BTVQTRMQVLJP\">Saints Row</a> </span> for $30, and <span class=\"norewrite\">           <a href=\"https://www.xbox.com/en-us/games/nba-2k23\">NBA 2K23</a> </span> for $24. All told, more than 1,000 products are on sale.</p><div><div class=\"norewrite\" title=\"\">           <a href=\"https://click.linksynergy.com/deeplink?id=VZfI20jEa0c&amp;mid=24542&amp;u1=subid_value&amp;murl=https://www.xbox.com/en-US/promotions/sales/countdown-sale\">See deals at Xbox Store</a> </div></div><p> </p></h3></p><br />     <p><h2>Ubisoft Winter Sale</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1702/17023653/4079329-ubisoftwintersale%281%29.jpg\" /><br /><h3><p> </p><p>Pick up <span class=\"norewrite\">           <a href=\"https://store.ubi.com/us/game/?lang=en_US&amp;pid=5cf15f1b39798c0870c076e6&amp;dwvar_5cf15f1b39798c0870c076e6_Platform=pcdl&amp;edition=Standard Edition&amp;source=detail\">Rainbow Six Extraction</a> </span> for $16, <span class=\"norewrite\">           <a href=\"https://store.ubi.com/us/game/?lang=en_US&amp;pid=5cec210a39798c0870c07684&amp;dwvar_5cec210a39798c0870c07684_Platform=pcdl&amp;edition=Standard Edition&amp;source=detail\">Immortals Fenyx Rising</a> </span> for $15, and <span class=\"norewrite\">           <a href=\"https://store.ubi.com/us/game/?lang=en_US&amp;pid=5f2816a15cdf9a055850c796&amp;dwvar_5f2816a15cdf9a055850c796_Platform=pcdl&amp;edition=Standard Edition&amp;source=detail\">Rider’s Republic</a> </span> for $18 during Ubisoft’s <span class=\"norewrite\">           <a href=\"https://www.gamespot.com/articles/ubisofts-most-popular-games-are-steeply-discounted/1100-6510108/\">end-of-year blowout.</a> </span> You can also use coupon code <strong>HOLIDAY22</strong> to get $10 off orders over $20.</p><div><div class=\"norewrite\" title=\"\">           <a href=\"https://ubisoft.pxf.io/c/159047/864200/12050?&amp;sharedId=gamespot&amp;u=https://store.ubi.com/us/winter-sale&amp;subId1=subid_value\">See deals at Ubisoft Store</a> </div></div><p> </p></h3></p><br />     <p><h2>Epic Games Store Holiday Sale</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1702/17023653/4079325-epicgamesstore%281%29.jpg\" /><br /><h3><p><a href=\"https://www.gamespot.com/articles/the-epic-games-store-holiday-sale-is-here-and-its-massive/1100-6510096/\">Epic</a> has been giving away free games every day, but you can also save big on hundreds of hit titles. This includes <span class=\"norewrite\">           <a href=\"https://store.epicgames.com/en-US/p/marvels-spider-man-remastered\">Marvel’s Spider-Man Remastered</a> </span> for $45 and the enticing <span class=\"norewrite\">           <a href=\"https://store.epicgames.com/en-US/bundles/deathloop-ghostwire-tokyo-bundle\">Deathloop + Ghostwire: Tokyo Bundle</a> </span> that’s just $40, down from $100.</p><div class=\"norewrite\" title=\"\">           <a href=\"https://store.epicgames.com/en-US/sales-and-specials/holiday-sale\">See deals at Epic Games Store</a> </div></h3></p><br />     <p><h2>Green Man Gaming Holiday Sale</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1702/17023653/4079328-greenmangaming%281%29.jpg\" /><br /><h3><p>Hundreds of older titles are on sale at <a href=\"https://www.gamespot.com/articles/green-man-gamings-holiday-sale-is-overflowing-with-deals/1100-6510059/\">Green Man Gaming</a>, making it a great place to shop if you have a deep wishlist that needs to be cleared for cheap. Top discounts include <span class=\"norewrite\">           <a href=\"https://greenmangaming.sjv.io/c/159047/1219987/15105?&amp;sharedId=gamespot&amp;u=https://www.greenmangaming.com/games/borderlands-3-pc/&amp;subId1=subid_value\">Borderlands 3</a> </span> for $8, <span class=\"norewrite\">           <a href=\"https://greenmangaming.sjv.io/c/159047/1219987/15105?&amp;sharedId=gamespot&amp;u=https://www.greenmangaming.com/games/middle-earth-shadow-of-war-pc&amp;subId1=subid_value\">Middle-earth: Shadow of War</a> </span> for $6, and <span class=\"norewrite\">           <a href=\"https://greenmangaming.sjv.io/c/159047/1219987/15105?&amp;sharedId=gamespot&amp;u=https://www.greenmangaming.com/games/rollerdrome-pc&amp;subId1=subid_value\">Rollerdrome</a> </span> for $17.</p><div class=\"norewrite\" title=\"\">           <a href=\"https://greenmangaming.sjv.io/c/159047/1219987/15105?&amp;sharedId=gamespot&amp;u=https://www.greenmangaming.com/holiday-sale&amp;subId1=subid_value\">See deals at Green Man Gaming</a> </div></h3></p><br />     <p><h2>GOG Winter Sale</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1702/17023653/4079327-gog%281%29.jpg\" /><br /><h3><p> </p><p>More than 4,000 titles are on sale at <a href=\"https://www.gamespot.com/articles/over-4500-games-are-discounted-in-gogs-2022-winter-sale/1100-6509962/\">GOG</a>, including some big names from the CDPR catalog such as <span class=\"norewrite\">           <a href=\"https://www.anrdoezrs.net/links/9020176/type/dlg/sid/subid_value/https://www.gog.com/en/game/the_witcher_3_wild_hunt_game_of_the_year_edition\">The Witcher 3</a> </span> and <span class=\"norewrite\">           <a href=\"https://www.anrdoezrs.net/links/9020176/type/dlg/sid/subid_value/https://www.gog.com/en/game/cyberpunk_2077\">Cyberpunk 2077.</a> </span> You can also score <span class=\"norewrite\">           <a href=\"https://www.anrdoezrs.net/links/9020176/type/dlg/sid/subid_value/https://www.gog.com/en/game/xcom_2\">XCOM 2</a> </span> for just $3--but with so many games on sale, it’s worth checking out the full catalog.</p><div><div class=\"norewrite\" title=\"\">           <a href=\"https://www.anrdoezrs.net/links/9020176/type/dlg/sid/subid_value/https://www.gog.com/en/promo/2022_winter_sale\">See deals at GOG</a> </div></div><p> </p></h3></p><br />     <p><h2>Fanatical Winter Sale</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1702/17023653/4079326-fanatical%281%29.jpg\" /><br /><h3><p>A little bit of everything is on sale at <a href=\"https://www.gamespot.com/gallery/fanatical-winter-sale-is-live-with-thousands-of-pc-game-deals/2900-4526/\">Fanatical</a> this holiday season. The fun party game collection <span class=\"norewrite\">           <a href=\"https://www.anrdoezrs.net/links/9020176/type/dlg/sid/subid_value/https://www.fanatical.com/en/bundle/the-jackbox-quintpack\">Jackbox Quintpack</a> </span> is down to $45, <span class=\"norewrite\">           <a href=\"https://www.anrdoezrs.net/links/9020176/type/dlg/sid/subid_value/https://www.fanatical.com/en/game/monster-hunter-rise\">Monster Hunter Rise</a> </span> is just $17, and <span class=\"norewrite\">           <a href=\"https://www.anrdoezrs.net/links/9020176/type/dlg/sid/subid_value/https://www.fanatical.com/en/game/death-stranding-director-s-cut\">Death Stranding</a> </span> is $19. You’ll also earn a free game if you spend over $12 on a single order--so be sure to hit that mark before checking out.</p><p><em>Disclosure: GameSpot and Fanatical are both owned by Fandom.</em></p><div class=\"norewrite\" title=\"\">           <a href=\"https://www.jdoqocy.com/click-9020176-13248075-1536151111000?sid=subid_value\">See deals at Fanatical</a> </div></h3></p><br />     <p><h2>Best Buy Last-Minute Holiday Sale</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1702/17023653/4079324-bestbuy%285%29.jpg\" /><br /><h3><p>Forget something important on your shopping list? When purchasing online with curbside pickup, <a href=\"https://www.gamespot.com/gallery/best-buy-last-minute-holiday-sale-has-tons-of-great-gaming-deals/2900-4554/\">Best Buy</a> can have your item ready within an hour. Discounts include <span class=\"norewrite\">           <a href=\"https://shop-links.co/link/?url=https://www.bestbuy.com/site/fifa-23-standard-edition-playstation-5/6514006.p&amp;publisher_slug=gamespot&amp;article_name=The Biggest Holiday Gaming Sales Happening Right Now&amp;article_url=http://www.gamespot.com/gallery/the-biggest-holiday-gaming-sales-happening-right-now/2900-4558/&amp;exclusive=1&amp;u1=subid_value\">FIFA 23</a> </span> for $35, <span class=\"norewrite\">           <a href=\"https://shop-links.co/link/?url=https://www.bestbuy.com/site/marvels-guardians-of-the-galaxy-playstation-5/6468675.p&amp;publisher_slug=gamespot&amp;article_name=The Biggest Holiday Gaming Sales Happening Right Now&amp;article_url=http://www.gamespot.com/gallery/the-biggest-holiday-gaming-sales-happening-right-now/2900-4558/&amp;exclusive=1&amp;u1=subid_value\">Guardians of the Galaxy</a> </span> for $15, and <span class=\"norewrite\">           <a href=\"https://shop-links.co/link/?url=https://www.bestbuy.com/site/halo-infinite-standard-edition-xbox-one-xbox-series-x/6414163.p&amp;publisher_slug=gamespot&amp;article_name=The Biggest Holiday Gaming Sales Happening Right Now&amp;article_url=http://www.gamespot.com/gallery/the-biggest-holiday-gaming-sales-happening-right-now/2900-4558/&amp;exclusive=1&amp;u1=subid_value\">Halo Infinite</a> </span> for $15.</p><div class=\"norewrite\" title=\"\">           <a href=\"https://shop-links.co/link/?url=https://www.bestbuy.com/site/clp/sale-page/pcmcat185700050011.c&amp;publisher_slug=gamespot&amp;article_name=The Biggest Holiday Gaming Sales Happening Right Now&amp;article_url=http://www.gamespot.com/gallery/the-biggest-holiday-gaming-sales-happening-right-now/2900-4558/&amp;exclusive=1&amp;u1=subid_value\">See deals at Best Buy</a> </div></h3></p><br />     <p><h2>PlayStation Savings Events</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1702/17023653/4079333-psendofyear%281%29.jpg\" /><br /><h3><p> </p><p><a href=\"https://www.gamespot.com/articles/more-than-1000-playstation-games-discounted-in-new-psn-sale/1100-6509535/\">Sony</a> is running a few different sales to end 2022, with both indies and AAA blockbusters seeing some of the best prices of the year. Right now, you can snag <span class=\"norewrite\">           <a href=\"https://store.playstation.com/en-us/product/UP3643-PPSA05303_00-2564955967631989\">Death’s Door</a> </span> for $10, <span class=\"norewrite\">           <a href=\"https://store.playstation.com/en-us/product/UP2113-CUSA06623_00-OUTLAST200000000\">Outlast 2</a> </span> for $3, and <span class=\"norewrite\">           <a href=\"https://store.playstation.com/en-us/product/UP1018-PPSA02223_00-GOTHAMKNIGHTSDLX\">Gotham Knights</a> </span> for $50.</p><div><div class=\"norewrite\" title=\"\">           <a href=\"https://store.playstation.com/en-us/pages/deals\">See deals on PlayStation Store</a> </div></div><p> </p></h3></p><br />     <p><h2>Nintendo Winter Deals</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1702/17023653/4079332-nintendo%281%29.jpg\" /><br /><h3><p> </p><p>Nintendo isn’t discounting as many games as other retailers, but there are still a few great discounts worth checking out. This includes <span class=\"norewrite\">           <a href=\"https://www.nintendo.com/store/products/golf-club-wasteland-switch/\">Golf Club Wasteland</a> </span> for $2, <span class=\"norewrite\">           <a href=\"https://www.nintendo.com/store/products/star-wars-knights-of-the-old-republic-switch/\">Knights of the Old Republic</a> </span> for $11, and <span class=\"norewrite\">           <a href=\"https://www.nintendo.com/store/products/the-diofield-chronicle-switch/\">The DioField Chronicle</a> </span> for $30.</p><div><div class=\"norewrite\" title=\"\">           <a href=\"https://www.nintendo.com/store/sales-and-deals/\">See deals at Nintendo eShop</a> </div></div><p> </p></h3></p><br />     <p><h2>GameStop Pro Week</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1702/17023653/4079331-gamestop%282%29.jpg\" /><br /><h3><p> </p><p>You’ll need to be a Pro member to cash in on most of the deals during GameStop’s Pro Week, but you’ll find a wide variety of collectibles up for grabs at incredibly low prices. You’ll also be able to purchase a preowned <span class=\"norewrite\">           <a href=\"https://click.linksynergy.com/deeplink?id=VZfI20jEa0c&amp;mid=24348&amp;u1=subid_value&amp;murl=https://www.gamestop.com/consoles-hardware/playstation-5/gaming-accessories/products/sony-dualsense-wireless-controller-for-playstation-5/232513.html\">DualSense</a> </span> for $40 or <span class=\"norewrite\">           <a href=\"https://click.linksynergy.com/deeplink?id=VZfI20jEa0c&amp;mid=24348&amp;u1=subid_value&amp;murl=https://www.gamestop.com/video-games/nintendo-switch/products/mario-plus-rabbids-sparks-of-hope---nintendo-switch/298408.html\">Mario + Rabbids: Sparks of Hope</a> </span> for $40.</p><div><div class=\"norewrite\" title=\"\">           <a href=\"https://click.linksynergy.com/deeplink?id=VZfI20jEa0c&amp;mid=24348&amp;u1=subid_value&amp;murl=https://www.gamestop.com/deals\">See deals at GameStop</a> </div></div><p> </p></h3></p><br />", "link": "https://www.gamespot.com/gallery/the-biggest-holiday-gaming-sales-happening-right-now/2900-4558/", "date_published": "2022-12-20 20:47:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Star Wars Jedi: Survivor Will Have New Lightsaber Stances And Tameable Mounts", "description": "<p>Star Wars Jedi: Survivor, the sequel to Jedi: Fallen Order, will include mounts, a variety of lightsaber stances, and an occasional AI companion.</p><p>In an interview with <a href=\"https://www.gameinformer.com/preview/2022/12/20/new-details-set-the-stage\">Game Informer,</a> game director Stig Asmussen and explained features of the upcoming Star Wars title. There are a total of five lightsaber stances, including a dual-blade stance and one where Cal wields both a lightsaber and a blaster. A new heavy and slow style uses the crossguard lightsaber, as introduced by Kylo Ren. These new stances will let you hit harder or from farther away, but whether you should use them depends on the enemies you will be facing. As Asmussen said in the interview, \"it requires the player to break down the enemies and figure out what the best weapon of choice is.\"</p><p>Survivor will also offer more options for travel, allowing for what Asmussen called \"a wider Metroidvania approach.\" You can use an ascension cable to climb walls or cross gaps. You can also tame and ride mounts. According to Asmussen, players can use a variety of skills to hop across unthinkable barriers. Protagonist Cal Kestis will also gain some AI assistance in the form of mercenary Bode Akuna, who has a brotherly bond with the young Jedi. Akuna will help you in both combat and traversal.</p><a href=\"https://www.gamespot.com/articles/star-wars-jedi-survivor-will-have-new-lightsaber-stances-and-tameable-mounts/1100-6510204/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/star-wars-jedi-survivor-will-have-new-lightsaber-stances-and-tameable-mounts/1100-6510204/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 20:17:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "A Bunch Of PC Games Are Discounted To Their Lowest Prices Yet", "description": "<p>Fanatical’s <span class=\"norewrite\">           <a href=\"https://www.tkqlhce.com/click-9020176-15339241-1663065986000?sid=subid_value\">Winter Sale</a> </span> is still going strong--in fact, several new additions have joined the catalog, including some big price cuts on <span class=\"norewrite\">           <a href=\"https://www.anrdoezrs.net/links/9020176/type/dlg/sid/subid_value/https://www.fanatical.com/en/game/god-of-war\">God of War</a> </span> and <span class=\"norewrite\">           <a href=\"https://www.kqzyfj.com/click-9020176-15365863-1666101573000?sid=subid_value\">Gotham Knights.</a> </span> You can pick up the former for just $26 right now, while the latter is listed for $27, making this a great time to check out the cooperative RPG.</p><p>Beyond those two standouts, you’ll also find <span class=\"norewrite\">           <a href=\"https://www.anrdoezrs.net/links/9020176/type/dlg/sid/subid_value/https://www.fanatical.com/en/game/deathloop\">Deathloop</a> </span> available for $17. That’s one of the best prices of the year, and considering it won the <a href=\"https://www.gamespot.com/articles/game-of-the-year-2021-deathloop/1100-6499014/\">GameSpot 2021 Game of the Year Award</a>, it’s definitely worth picking up. Beyond its slick graphics and time-looping storyline, you’ll be treated to tight gunplay and an immersive sim experience that adapts to your play style.</p><p>Other new arrivals to the Winter Sale include <span class=\"norewrite\">           <a href=\"https://www.anrdoezrs.net/links/9020176/type/dlg/sid/subid_value/https://www.fanatical.com/en/game/fallout-4-game-of-the-year-edition\">Fallout 4: Game of the Year Edition</a> </span> for $9, <span class=\"norewrite\">           <a href=\"https://www.anrdoezrs.net/links/9020176/type/dlg/sid/subid_value/https://www.fanatical.com/en/game/ghostwire-tokyo\">Ghostwire: Tokyo</a> </span> for $21, and <span class=\"norewrite\">           <a href=\"https://www.anrdoezrs.net/links/9020176/type/dlg/sid/subid_value/https://www.fanatical.com/en/game/back-4-blood-standard-edition\">Back 4 Blood</a> </span> for $17.</p><a href=\"https://www.gamespot.com/articles/a-bunch-of-pc-games-are-discounted-to-their-lowest-prices-yet/1100-6510173/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/a-bunch-of-pc-games-are-discounted-to-their-lowest-prices-yet/1100-6510173/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 20:05:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "New On Peacock In January 2023: Poker Face, The Traitors", "description": "<p dir=\"ltr\">December is already more than half gone, and January is not far away. A new month ahead also means a whole new slate of shows and movies to watch on HBO Max. Some of that content will be available on January 1, while other shows and movies will be available a little later next month. For more, check out our similar January 2023 rundowns for <a href=\"https://www.gamespot.com/articles/new-on-hbo-max-in-january-2023-the-last-of-us-velma/1100-6510199/\">HBO Max</a>, <a href=\"https://www.gamespot.com/articles/new-on-hulu-in-january-2023-how-i-met-your-father-season-2-the-drop/1100-6510137/\">Hulu</a>, <a href=\"https://www.gamespot.com/articles/new-on-amazon-prime-video-in-january-2023-hunters-season-2-shotgun-wedding/1100-6510158/\">Prime Video</a>, and <a href=\"https://www.gamespot.com/articles/new-on-disney-plus-in-january-2023-star-wars-the-bad-batch-willow/1100-6510155/\">Disney+</a>.</p><p dir=\"ltr\">On January 26, Rian Johnson's (Knives Out, The Last Jedi) mystery-of-the-week series Poker Face finally makes its debut with a four-episode premiere. Natasha Lyonne (Russian Doll, Orange Is the New Black) stars as Charlie Cale, who, according to a synopsis \"has an extraordinary ability to determine when someone is lying. She hits the road with her Plymouth Barracuda and with every stop encounters a new cast of characters and strange crimes she can’t help but solve.\" Lyonne will be joined by an impressive group of guest stars that include Adrien Brody, Chloë Sevigny, Ellen Barkin, Hong Chau, Jasmine Aiyana Garvin, Jameela Jamil, Joseph Gordon-Levitt, Judith Light, Nick Nolte, Rhea Perlman, Ron Perlman, S. Epatha Merkerson, Stephanie Hsu, Tim Blake Nelson, and Tim Meadows.</p><div>          </div><p>Also worth a look is The Traitors on January 12. It's a competition series, but a little different, as Alan Cumming (The Good Fight, Schmigadoon!) \"plays host to 20 larger-than-life personalities (including reality A-listers and America's best game players) who come together to complete a series of challenges with the objective of earning a cash prize of up to $250,000. The catch? Three of the contestants coined 'the traitors' will devise a plan to steal the prize from the other contestants coined 'the faithful.'\" It's a competition series, filled with plot twists, \"murder\" plots, and seasoned reality personalities working with genre newcomers.</p><a href=\"https://www.gamespot.com/articles/new-on-peacock-in-january-2023-poker-face-the-traitors/1100-6510202/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/new-on-peacock-in-january-2023-poker-face-the-traitors/1100-6510202/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 19:50:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Fortnite Settlement Refund: How To Find Out If You're Eligible", "description": "<p>Epic Games and the FTC recently announced a deal in which the game developer will pay <a href=\"https://www.gamespot.com/articles/epic-games-agrees-to-pay-500-million-in-fortnite-ftc-case/1100-6510151/\">$245 million to settle claims about in-game purchases</a>. The FTC will use the settlement money for refunds for certain affected players, but are you eligible? The FTC has published a <a href=\"https://www.ftc.gov/fortnite\">handy FAQ</a> to help you find out if you're eligible to get some money back. Here is what you need to know.</p><h3>Who is eligible for a refund?</h3><p>First off, the FTC is only paying US accounts. Assuming you live in the US, those eligible for a refund include both parents and children in a variety of situations. Here is the FTC's breakdown of eligible parties (as written by the FTC):</p><ul><li>Parents whose children made an unauthorized credit card purchase in the Epic Games Store between January 2017 and November 2018</li><li>Fortnite players who were charged in-game currency (V-Bucks) for unwanted in-game items (such as cosmetics, llamas, or battle passes) between January 2017 and September 2022</li><li>Fortnite players whose accounts were locked between January 2017 and September 2022 after disputing unauthorized charges with their credit card companies.</li></ul><h3>How to get a refund</h3><p>Those who believe they are eligible for money back don't need to do anything currently, the FTC said. The refund program is still being assembled, it seems. \"When we have more information about the refund program, we will post updates here and send email notices to customers who paid for in-game purchases,\" the FTC said. You can <a href=\"https://public.govdelivery.com/accounts/USFTC/subscriber/new?topic_id=USFTC_204\">sign up for email updates</a> to say up to date.</p><a href=\"https://www.gamespot.com/articles/fortnite-settlement-refund-how-to-find-out-if-youre-eligible/1100-6510201/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/fortnite-settlement-refund-how-to-find-out-if-youre-eligible/1100-6510201/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 19:29:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Marvel Snap Winterverse Event Includes Daily Rewards, Holiday Variants", "description": "<p>Marvel Snap is introducing its first holiday-themed event, starting today (December 20) and going through January 2. The Winterverse event will offer snowy variants that you can find, daily login rewards, and a special bundle available in the shop.</p><p>The daily login rewards will consist mostly of credits, boosters, and gold, but there will be two even better rewards on particular days. On Christmas day, December 25, you can claim a special Nick Fury variant with a Samuel L. Jackson autograph emblazoned on it. Then on New Year's Eve you can get a Black Panther avatar rendered in the style of the <a href=\"https://www.gamespot.com/articles/marvel-snap-debuts-free-login-bonus-new-variant-bundle/1100-6509841/\">recent Hero music video</a>.</p><p>During the Winterverse event you'll also be able to randomly find new holiday variants when opening Collector's Reserve boxes. Those include Winterverse variants of Abomination, Ebony Maw, Patriot, Rockslide, and Rogue.</p><a href=\"https://www.gamespot.com/articles/marvel-snap-winterverse-event-includes-daily-rewards-holiday-variants/1100-6510200/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/marvel-snap-winterverse-event-includes-daily-rewards-holiday-variants/1100-6510200/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 19:18:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "New On HBO Max In January 2023: The Last Of Us, Velma", "description": "<p> </p><p dir=\"ltr\">December is already more than half gone, and January is not far away. A new month ahead also means a whole new slate of shows and movies to watch on HBO Max. Some of that content will be available on January 1, while other shows and movies will be available a little later next month. For more, check out our similar January 2023 rundowns for <a href=\"https://www.gamespot.com/articles/new-on-hulu-in-january-2023-how-i-met-your-father-season-2-the-drop/1100-6510137/\">Hulu</a>, <a href=\"https://www.gamespot.com/articles/new-on-amazon-prime-video-in-january-2023-hunters-season-2-shotgun-wedding/1100-6510158/\">Prime Video</a>, and <a href=\"https://www.gamespot.com/articles/new-on-disney-plus-in-january-2023-star-wars-the-bad-batch-willow/1100-6510155/\">Disney+</a>.</p><p dir=\"ltr\">The big marquee content for January on HBO is undoubtedly The Last of Us, coming to the platform on January 15. It's been a long, long road for the series adapting the popular and grim 2013 zombie video game. Rather than rehash the game, the story as presented there, and the other adaptations that were attempted along the way, here's the official synopsis: \"This series takes place 20 years after modern civilization has been destroyed. Joel (Pedro Pascal), a hardened survivor, is hired to smuggle Ellie (Bella Ramsey), a 14-year-old girl, out of an oppressive quarantine zone. What starts as a small job soon becomes a brutal and heartbreaking journey as they both must traverse the U.S. and depend on each other for survival.\"</p><a href=\"https://www.gamespot.com/articles/new-on-hbo-max-in-january-2023-the-last-of-us-velma/1100-6510199/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/new-on-hbo-max-in-january-2023-the-last-of-us-velma/1100-6510199/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 19:14:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Avatar 2's Edie Falco Assumed The Movie Came Out Already And Flopped", "description": "<p dir=\"ltr\">While audiences are making up their minds about the long-awaited Avatar: The Way of Water, star Edie Falco (The Sopranos, Nurse Jackie) said in a recent media appearance that she thought it already came out years ago and flopped. On The View, Falco revealed that she filmed her scenes for the movie over four years ago.</p><p dir=\"ltr\">\"The second Avatar I shot four years ago,\" Falco said. \"I've been busy and doing stuff. Somebody mentioned Avatar and I thought, 'Oh, I guess it came out and it didn't do very well because I didn't hear anything about it.' It happens!\" Falco adds that she saw the first one right when it came out, but is \"excited\" to see Avatar 2.</p><div>          </div><p dir=\"ltr\"><span>Lots of other people, meanwhile, have been aware of Avatar 2's release--though at the box office, it's still been </span><a href=\"https://www.gamespot.com/articles/avatar-the-way-of-water-makes-waves-with-435-million-global-haul/1100-6510152/\">coming in below expectations</a><span>. The James Cameron-directed sequel raked in over $435 million dollars at the box office after being projected to hit half a billion. </span><a href=\"https://deadline.com/2022/12/avatar-the-way-of-water-opening-china-global-international-box-office-1235198763/\">Deadline</a><span> reports Avatar: The Way of Water missed the mark partly because of COVID-19 concerns in China. The movie was predicted to earn $100 million there but ended up with $57.1 million. The sequel didn't hit expectations domestically either. Last week, </span><a href=\"https://www.gamespot.com/articles/avatar-the-way-of-water-looks-to-make-175-million-opening-weekend/1100-6510013/\">Avatar: The Way of Water looked like it may bring in $150 million to $175 million</a><span> at theaters. Instead, the sci-fi flick settled with $134 million.</span></p><a href=\"https://www.gamespot.com/articles/avatar-2s-edie-falco-assumed-the-movie-came-out-already-and-flopped/1100-6510198/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/avatar-2s-edie-falco-assumed-the-movie-came-out-already-and-flopped/1100-6510198/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 18:56:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "How Does Wolverine Appear in Deadpool 3 If He's Dead? Hugh Jackman Weighs In", "description": "<p>Hugh Jackman will play Wolverine once again in the next Deadpool movie, in which he teams up with Ryan Reynolds' Deadpool. But how exactly this will happen remains to be seen, considering Jackman's Wolverine died at the end of 2017's Logan. Jackman said on the Jess Cagle Show on SiriusXM that Wolverine will appear in Deadpool 3 through a different timeline, one in which he is still alive.</p><p>\"It's all because of this device they have in the Marvel world of moving around timelines,\" Jackman said. \"Now we can go back because, you know, it's science [flashes airquotes]. So, I don't have to screw with the Logan timeline, which was important to me. And I think probably to the fans too.\"</p><div>          </div><p>Jackman said he was \"100% sure\" he was finished playing Wolverine after Logan. However, after he saw Deadpool 2, he felt the itch to come back and try a different spin on the Wolverine character.</p><a href=\"https://www.gamespot.com/articles/how-does-wolverine-appear-in-deadpool-3-if-hes-dead-hugh-jackman-weighs-in/1100-6510196/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/how-does-wolverine-appear-in-deadpool-3-if-hes-dead-hugh-jackman-weighs-in/1100-6510196/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 18:45:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Risk Of Rain Returns Is A Massive Revamp Of The Classic Roguelike", "description": "<p>Risk of Rain Returns, a ground-up remake of the now-classic rogue, is releasing in 2023 just in time for the original game's 10th anniversary. This new version incorporates new features and lessons learned from the sequel Risk of Rain 2.</p><p>Risk of Rain Returns features updated visuals, a revamped codebase, and plenty of new goodies and surprises. After crash-landing on the mysterious planet Petrichor V, you take the role of one of 15 survivors (including two new additions) attempting to make their way home. You will fight both monsters, pick up items to power themselves, and master escalating challenges. Risk of Rain Returns adds new items, monsters, and powers. You can also mix up the challenge by toggling game-altering artifacts before each run. The score from Chris Christodoulou returns with new additions. The game also features couch co-op and online play for up to four players.</p><div>          </div><p>The game was announced as part of the <a href=\"https://www.gamespot.com/articles/nintendo-releasing-mini-direct-style-videos-every-day-this-week/1100-6510169/\">Inside the House of Indies holiday event</a>. Over on the <a href=\"https://www.nintendo.com/whatsnew/hark-its-the-day-2-video-update/\">official Nintendo website</a>, as well as the <a href=\"https://youtu.be/6qXjO6eQm34\">official YouTube channel</a>, you can check out mini-Directs for a variety of indie games. The event started yesterday and will continue until December 24.</p><a href=\"https://www.gamespot.com/articles/risk-of-rain-returns-is-a-massive-revamp-of-the-classic-roguelike/1100-6510197/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/risk-of-rain-returns-is-a-massive-revamp-of-the-classic-roguelike/1100-6510197/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 18:30:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "CoD: Warzone 2 DMZ - How To Access Building 21 And Get Keycards", "description": "<p dir=\"ltr\"><a href=\"https://www.gamespot.com/games/call-of-duty-warzone-20/\">Call of Duty: Warzone 2</a>'s cooperative DMZ mode has tons of missions to complete and secrets to explore, but <a href=\"https://www.gamespot.com/articles/cod-modern-warfare-2-and-warzone-2-mid-season-update-includes-a-raid-and-soccer-themed-ltm/1100-6509928/\">Season 1 Reloaded</a> includes a brand-new area with the addition of Building 21. Here's everything you need to know about the building, and how to find the keycards needed to access it.</p><h2 dir=\"ltr\">What is Building 21?</h2><figure style=\"width: 1920px;\"><a href=\"https://www.gamespot.com/a/uploads/original/1639/16394540/4079320-mwii-s01-reloaded-009.jpg\"><img alt=\"Inside of Building 21\" src=\"https://www.gamespot.com/a/uploads/scale_super/1639/16394540/4079320-mwii-s01-reloaded-009.jpg\" /></a><figcaption>Inside of Building 21</figcaption></figure><p dir=\"ltr\">Season 1 Reloaded added Building 21 on December 19, and Infinity Ward describes this as a limited-time area. The developer doesn't confirm how long Building 21 will stick around, but those who miss the opportunity will need to \"wait for future deployments.\" The location contains high-tier Contraband weapons and loot to extract, so you'll likely want to give the area a visit.</p><p dir=\"ltr\">This location is separate from Al Mazrah, so you'll have the option to pick if you want to load into the Al Mazrah map or go to Building 21. Of course, Building 21 is locked unless you loot keycards from a successful exfil on Al Mazrah.</p><a href=\"https://www.gamespot.com/articles/cod-warzone-2-dmz-how-to-access-building-21-and-get-keycards/1100-6510194/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/cod-warzone-2-dmz-how-to-access-building-21-and-get-keycards/1100-6510194/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 17:42:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "See Your (Unofficial) 2022 Xbox Stats Online", "description": "<p dir=\"ltr\">It's the end of the year, which means that your favorite apps and platforms are showing you a year-end wrap-up in order for you to make sense of how you spent your 2022. Though PlayStation and Nintendo have their own official 2022 wrap-ups, the Xbox community TrueAchievements has created an unofficial version called <a href=\"https://www.trueachievements.com/n52332/my-year-on-xbox\">My Year On Xbox</a>, and it's free to use.</p><p dir=\"ltr\">In order to see your breakdown, you'll need to make a TrueAchievements account. The infographic includes achievements earned, total gamerscore, games played, hours played, and some stats based around your top game. Some users online have stated that the My Year On Xbox breakdown isn't accurate, and the site itself even admits that the data might not be reliable for new users--primarily because your top game of the year has to be a game you started playing this year--but it's a nice conversation piece.</p><p dir=\"ltr\">In other Xbox news, foul-mouthed shooter High On Life is apparently doing <a href=\"https://www.gamespot.com/articles/high-on-life-is-doing-great-on-xbox-game-pass-apparently/1100-6510179/\">quite well</a> on Xbox Game Pass. Microsoft's blockbuster deal to buy Activision Blizzard has become imperiled by an Federal Trade Commission suit, and it's not clear if the merger <a href=\"https://www.gamespot.com/articles/why-some-experts-believe-that-microsoft-activision-blizzard-merger-wont-happen/1100-6509987/\">will happen</a> after all. When you're done with that, check out our list of the <a href=\"https://www.gamespot.com/gallery/the-most-anticipated-xbox-games-of-2023-and-beyond/2900-4252/\">most-anticipated Xbox games</a> in 2023.</p><a href=\"https://www.gamespot.com/articles/see-your-unofficial-2022-xbox-stats-online/1100-6510193/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/see-your-unofficial-2022-xbox-stats-online/1100-6510193/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 17:36:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "2022 Is The Year Of Chainsaw Man", "description": "<p dir=\"ltr\">Anime is bigger than it's ever been--an obvious sentiment to anyone who spends enough time online--with films breaking out of series like Demon Slayer: Mugen Train setting all kinds of records in 2020 through to last year, and Jujutsu Kaisen 0 setting its own this year. These two series, alongside the likes of My Hero Academia, are obviously some of the big hits at the moment. But this year belongs to one series, and one series only: Chainsaw Man. And 2023 will be no different.</p><p dir=\"ltr\">Chainsaw Man really has been the big anime to watch this year, which I guess isn't that surprising since it's a popular Shonen Jump comic being animated by a studio with a strong legacy behind it, Mappa. The thing is though, anime adaptations of popular manga are typically made to shift more volumes of the manga, and create a consistent feedback loop that regularly increases a series' popularity. But Chainsaw Man was already an incredibly popular manga long before the anime dropped. You wanna know how I know? Because cosplayers are all over it.</p><p dir=\"ltr\">I was at London Comic Con back in October, which kicked off just a couple of days after the anime's third episode was released. My partner and I placed bets on what franchises would be the most cosplayed--we picked safe bets like Demon Slayer, Genshin Impact, and threw in some wildcards like an inflatable Among Us costume, and a Sailor Moon x Moon Knight crossover. I did personally expect to see a few Chainsaw Man cosplays… and it ended up being one of the most popular cosplays we saw there.</p><a href=\"https://www.gamespot.com/articles/2022-is-the-year-of-chainsaw-man/1100-6510022/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/2022-is-the-year-of-chainsaw-man/1100-6510022/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 17:24:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "CoD: Warzone 2 Loadout Drops Return To Buy Stations", "description": "<p dir=\"ltr\">Following the launch of the Season 1 Reloaded update, Raven Software has slowly been making several small tweaks to <a href=\"https://www.gamespot.com/games/call-of-duty-warzone-20/\">Call of Duty: Warzone 2</a>, including bringing back the battle royale's option to purchase a Loadout Drop Marker from Buy Stations.</p><p dir=\"ltr\">The <a href=\"https://twitter.com/RavenSoftware/status/1605233436385484802\">developer tweeted</a> on December 20 that purchasable loadout drops returned to the battle royale with a small update. These can be found in Buy Stations across Al Mazrah, bringing back Warzone's traditional custom loadout with weapons, perk packages, and equipment.</p><p dir=\"ltr\">Players can now buy their loadout drop at the following prices:</p><a href=\"https://www.gamespot.com/articles/cod-warzone-2-loadout-drops-return-to-buy-stations/1100-6510192/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/cod-warzone-2-loadout-drops-return-to-buy-stations/1100-6510192/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 17:23:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Destiny 2 Season Of The Seraph: Seasonal Challenges Guide Week 3", "description": "<p>The story is heating up in <a href=\"https://www.gamespot.com/games/destiny-2/\">Destiny 2</a> right now, as <a href=\"https://www.gamespot.com/articles/destiny-2-season-of-the-seraph-trailer-focuses-on-rasputin-and-xivu-arath/1100-6509741/\">Season of the Seraph</a> is shaping up to be an unhappy family reunion and an interesting examination of one of humanity's greatest minds.</p><p>For week 3, there's plenty to do <em>and </em>earn. The big draw this week is a chance to earn a brand-new Exotic: a pulse rifle called Revision Zero. Bungie had previously teased this mystery weapon back when the new season began, and it looks like Christmas has come early. Finish that quest, and you'll also earn some Challenger XP and an Exo frame module in the process.</p><p>For the remaining Exo frame module this week, you'll want to continue the seasonal quest and unlock more of the story surrounding Clovis Bray and his family as they work to restore Rasputin back to it Golden Age glory.</p><a href=\"https://www.gamespot.com/articles/destiny-2-season-of-the-seraph-seasonal-challenges-guide-week-3/1100-6509714/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/destiny-2-season-of-the-seraph-seasonal-challenges-guide-week-3/1100-6509714/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 17:17:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Today's Wordle Answer (#550) - December 21, 2022", "description": "<p>It might be the middle of the week, but there's still no slowing down this <a href=\"https://www.gamespot.com/games/wordle/\">Wordle </a>train. We've returned to offer more help to people in need when it comes to getting the Wordle correct. This time, we're helping out with the answer on December 21. Today's answer isn't too tricky, but it can definitely make life hard for players who might not be up to date with their astronomy. If you haven't started the Wordle just yet, then you can check out our list of recommended <a href=\"https://www.gamespot.com/articles/wordle-best-starting-words-to-use-and-other-game-tips/1100-6499460/\">starting words</a>. However, if you're already past the starting point, then you're likely looking for some hints.</p><p>Luckily, we provide just that further down in this article. We also spell out the full answer even further down, so if you don't want to be spoiled, don't read below the hints.</p><h2>Today's Wordle Answer - December 21, 2022</h2><p>We'll begin with two hints that directly relate to today's Wordle answer, but don't give it away immediately.</p><a href=\"https://www.gamespot.com/articles/todays-wordle-answer-550-december-21-2022/1100-6510191/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/todays-wordle-answer-550-december-21-2022/1100-6510191/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 17:17:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "After Years Of Discord Servers And Timed Drops, You Can (Maybe) Buy A PS5 At A Store", "description": "<p dir=\"ltr\">During previous console generations, the concept of popping down to your local big-box store and buying the hot new console of your choice wasn't a luxury--it's simply how things worked. Over the past two years, the pandemic completely changed the way that most people shop for desirable items such as the PS5 and Xbox Series X. In recent months, however, there have been indications that the new shortage culture surrounding video game consoles might be fading--at least in the short term.</p><p dir=\"ltr\">If you tried to get your hands on a PS5 or Xbox Series X in the past two years, you know exactly what I'm talking about. Eager would-be buyers were greeted by \"out-of-stock\" messages at every retailer. Advertised restocks would run dry within a minute or two after the gate opened, if they didn't crash for you in the first-place. This isn't the first console shortage that gamers have dealt with--the Wii suffered from issues at launch--but it's arguably the worst ever. However, while the Xbox Series X became relatively easy to find in 2022, the PS5 has continued to suffer from serious supply constraints.</p><p dir=\"ltr\">The pandemic-era shortages can be blamed on a wide variety of factors: an increased interest in gaming as a hobby, ongoing shortages of important components, and general supply-chain issues. During that period, it was virtually impossible to buy a new-gen console for MSRP without using outside resources to locate the right opportunities. Desperate buyers turned to a secondary culture of Discord servers, Telegram channels, and Twitch streams in order to find the next drop and take advantage.</p><a href=\"https://www.gamespot.com/articles/after-years-of-discord-servers-and-timed-drops-you-can-maybe-buy-a-ps5-at-a-store/1100-6510190/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/after-years-of-discord-servers-and-timed-drops-you-can-maybe-buy-a-ps5-at-a-store/1100-6510190/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 17:10:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Best PlayStation Plus Games December 2022", "description": "<img height=\"480\" src=\"https://www.gamespot.com/a/uploads/square_medium/1352/13527689/4077988-psdec_v0.jpg\" width=\"480\" /> Brought to you by PlayStation Plus. The holidays are coming and there's plenty of gaming to be done. Here's your rundown of everything coming to PS+ this month.", "link": "https://www.gamespot.com/videos/best-playstation-plus-games-december-2022/2300-6460257/", "date_published": "2022-12-20 17:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "GameSpot's TV Show Of 2022: Severance", "description": "<p> </p><p dir=\"ltr\">The concept is deceptively simple on its head: What if \"checking out\" when you sit down to clock in for your day job was a literal thing? What if you could, functionally, turn off your consciousness when it came time to go to work and then bring it back the moment you stepped out of the building? And don't try to say you've never fantasized about something like it before--just imagine how great your life would be if you never had to deal with an angry customer or a condescending boss ever again. Imagine how much lighter you'd feel if the hours you spent at work felt like going in and waking up from surgical anesthetic, just without all the potential side effects and pain.</p><p dir=\"ltr\">Except, there's a dark side to that story, too, because <em>something </em>has to actually make the work happen, right? And even if you're very literally not home in your brain, your body needs to be piloted one way or another. Enter: Severance, the plucky little AppleTV+ original that came out of nowhere to become GameSpot's favorite TV show of 2022.</p><a href=\"https://www.gamespot.com/articles/gamespots-tv-show-of-2022-severance/1100-6510175/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/gamespots-tv-show-of-2022-severance/1100-6510175/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 17:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Halo Infinite Holiday Event Winter Contingency II Adds Free And Festive Cosmetics", "description": "<p>In celebration of the holidays, 343 Industries has out a free 10-tier Event Pass with holiday aesthetics for Halo Infinite. The update is available today.</p><p>The event, called Winter Contingency II, runs from December 20 through January 3. The event pass includes a variety of festive cosmetics, including a snowflake emblem, a candy cane visor, decorative \"jingle bell\" grenades, a Santa hat, and reindeer horns. The pass also includes some frosty skins for weapons, including the Battle Rifle, Pistol, and Hydra. As usual, you'll be able to unlock these items by completing specially marked in-game challenges.</p><p>Halo Infinite has had some significant updates recently. <a href=\"https://www.gamespot.com/articles/halo-infinite-winter-update-forge-co-op-achievements-and-more/1100-6509026/\">Campaign co-op, mission replay, and Forge were added in the game's Winter update</a> in November. Additional changes came to <a href=\"https://www.gamespot.com/articles/halo-infinite-ranked-play-and-matchmaking-will-soon-be-overhauled/1100-6508896/\">ranked play and matchmaking</a> as part of the update. In December, Halo Infinite received a custom games browser. A<a href=\"https://www.gamespot.com/articles/halo-infinite-is-adding-a-beloved-map-from-halo-3/1100-6509763/\"> 343-developed, revamped version of the classic map The Pit</a>, created using Forge, was also released. Players have already taken to building funny, bizarre, and awe-inspiring creations, including a <a href=\"https://www.gamespot.com/articles/halo-infinite-forge-map-turns-waffle-house-into-a-late-night-battleground/1100-6509850/\">recreation of a Waffle House restaurant</a>. In a blog post outlining a variety of future plans for the franchise, live-service boss Sean Baron claimed that this was <a href=\"https://www.gamespot.com/articles/halo-infinite-first-year-stats-revealed-as-dev-reflects-on-a-year-full-of-challenges/1100-6510188/\">the biggest launch year in Halo history</a>, despite challenges.</p><a href=\"https://www.gamespot.com/articles/halo-infinite-holiday-event-winter-contingency-ii-adds-free-and-festive-cosmetics/1100-6510195/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/halo-infinite-holiday-event-winter-contingency-ii-adds-free-and-festive-cosmetics/1100-6510195/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 17:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Next Indiana Jones Movie Will Explain What Happened To Shia Labeouf's Character", "description": "<p dir=\"ltr\">Among the many questions swirling around Indiana Jones and the Dial of Destiny is whether it will touch on Shia LaBeouf's character Mutt, introduced in 2008's divisive Kingdom of the Crystal Skull. In a new <a href=\"https://ew.com/movies/indiana-jones-and-the-dial-of-destiny-james-mangold-2023-preview/\">EW</a> interview, director James Mangold promises audiences will \"find out what happened\" to him.</p><p dir=\"ltr\">Mangold further confirmed that LaBeouf will not appear in the film, something that most likely both the actor and audiences are just fine with. In a 2010 <a href=\"https://www.latimes.com/archives/blogs/24-frames/story/2010-05-15/cannes-2010-shia-labeouf-we-botched-the-last-indiana-jones\">Los Angeles Times</a> profile, LaBeouf says he not only \"dropped the ball\" when stepping into the franchise, but he felt he \"botched\" the film. At the time, Mutt--a young, motorcycle-riding greaser and Indy's sidekick and son--was introduced to potentially continue the franchise.</p><div>          </div><p dir=\"ltr\"><span>Though, to be fair, Mutt was only one of many problems audiences had with Crystal Skull. In the 2010 profile, LaBeouf shares that he had \"major discussions\" with Harrison Ford, and he \"wasn't happy with it… there was a reason it wasn't universally accepted.\" So, maybe the character will be given a grace note in Dial of Destiny.</span></p><a href=\"https://www.gamespot.com/articles/next-indiana-jones-movie-will-explain-what-happened-to-shia-labeoufs-character/1100-6510189/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/next-indiana-jones-movie-will-explain-what-happened-to-shia-labeoufs-character/1100-6510189/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 16:47:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Halo Infinite First-Year Stats Revealed, As Dev Reflects On A Year Full Of \"Challenges\"", "description": "<p>Halo Infinite has wrapped up its first full year of operation, and developer 343 Industries has now shared some first-year statistics. Live-service boss Sean Baron <a href=\"https://www.halowaypoint.com/news/yuletidings-yonder\">said in a blog post</a> that Halo Infinite had the \"biggest launch year\" in Halo's 20-year history.</p><p>Some of the first-year stats included 170 million multiplayer matches played, 50 million campaign missions played, and 16 billion Spartans slayed. Players collectively wiped out more than 2 billion bots and performed 6 million \"Ninja\" kills, which is when a player jumps over a foe and smacks them on the back with a melee. Finally, 343 said players collectively created 130,000 maps in Forge.</p><p>\"We're so grateful for the time you've spent with us and the passion you have for this franchise. The year has been full of challenges and opportunities,\" Baron said. \"Yet, your energy and engagement has driven us.\"</p><a href=\"https://www.gamespot.com/articles/halo-infinite-first-year-stats-revealed-as-dev-reflects-on-a-year-full-of-challenges/1100-6510188/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/halo-infinite-first-year-stats-revealed-as-dev-reflects-on-a-year-full-of-challenges/1100-6510188/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 16:09:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Today's Free Game At The Epic Games Store Is Live Now", "description": "<p>The Epic Games Store continues to give away free games each week, more than three years after the digital storefront launched its awesome weekly freebies program. Epic has confirmed that the free games program will continue through at least the end of 2022. Every Thursday at the same time 8 AM PT / 11 AM ET--Epic gives up between one and three free games. You merely need to <a href=\"https://www.epicgames.com/id/register\">create a free Epic account</a> and enable two-factor authentication to start snagging freebies. At this point, Epic has given away well over 100 free games, and there's no sign that the program will stop any time soon. We keep this article up to date weekly to highlight both the current free games and next week's offerings.</p><h2>Current free game at Epic</h2><figure style=\"width: 1280px;\"><a href=\"https://www.gamespot.com/a/uploads/original/1595/15950357/4079303-wolfenstein.jpeg\"><img alt=\"Wolfenstein: The New Order\" src=\"https://www.gamespot.com/a/uploads/original/1595/15950357/4079303-wolfenstein.jpeg\" /></a><figcaption>Wolfenstein: The New Order</figcaption></figure><p>Wolfenstein: The New Order is free at the Epic Games Store until tomorrow, December 21, at 8 AM PT / 11 AM ET. This excellent first-person shooter was free at Epic earlier this year, so there's a chance you already have it in your library.</p><h2>Next free game at Epic</h2><p>The next free game at Epic is a mystery. You'll have to check back tomorrow, December 21, at 8 AM PT / 11 AM ET to find out which game Epic is giving away next.</p><a href=\"https://www.gamespot.com/articles/todays-free-game-at-the-epic-games-store-is-live-now/1100-6476419/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/todays-free-game-at-the-epic-games-store-is-live-now/1100-6476419/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 16:04:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Nintendo Switch Joy-Con Drift A \"Design Flaw,\" Says UK Consumer Group", "description": "<p dir=\"ltr\">Nintendo Switch Joy-Con drift is a major hassle, especially for those who prefer to play their Switch in undocked mode. Now, a new study from the UK consumer group Which? reports that it's found <a href=\"https://www.eurogamer.net/nintendo-switch-joy-con-drift-due-to-design-flaw-uk-consumer-group-reports\">evidence</a> that the Joy-Con drft is due to a fundamental design flaw.</p><p dir=\"ltr\">According to the group, the plastic circuit boards within the Joy-Con controllers show wear around the stick slider contact points, even only after months of use. Additionally, dust and other grit can easily enter the mechanism, further exacerbating the problem. The group has called on Nintendo to replace or repair all affected Joy-Cons in the UK as part of a compensation plan.</p><p>In response, Nintendo issued a statement claiming that the number of Joy-Cons that develop drift is \"small,\" and that the company has continued to improve the controllers in the years since the Switch's release in 2017. While the number of impacted Joy-Cons is unclear, a report from Which? found that two in five controllers tested had drift. However, it's worth noting that Nintendo usually replaces Joy-Cons with drift free of charge if you contact Nintendo Support. Back in 2021, a YouTuber <a href=\"https://www.gamespot.com/articles/youtuber-claims-to-have-a-permanent-fix-for-joy-con-drift/1100-6493926/\">claimed</a> to find a fix for the problem, but sending your Joy-Cons to Nintendo is probably the safer choice overall.</p><a href=\"https://www.gamespot.com/articles/nintendo-switch-joy-con-drift-a-design-flaw-says-uk-consumer-group/1100-6510187/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/nintendo-switch-joy-con-drift-a-design-flaw-says-uk-consumer-group/1100-6510187/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 16:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "The Most-Anticipated Nintendo Switch Games Of 2023 And Beyond", "description": "<p><img src=\"https://www.gamespot.com/a/uploads/scale_large/1585/15855271/4079284-4034512-tearsofthekingdom.jpg\" /><br /><h3><p dir=\"ltr\">The Nintendo Switch had a great year in 2022, and it doesn't appear to be slowing down in the foreseeable future. The past 12 months alone gave us Bayonetta 3, Mario + Rabbids: Sparks of Hope, both Pokemon Arceus and Scarlet/Violet, Xenoblade Chronicles 3, Kirby and the Forgotten Land, and more.</p><p dir=\"ltr\">Nintendo is playing its cards close to the vest for 2023, but we already know of a few games on the horizon. Those include The Legend of Zelda: Tears of the Kingdom, the long-awaited follow-up to Breath of the Wild, along with Fire Emblem Engage and (hopefully!) Advance Wars. Looking further ahead, there's games like Metroid Prime 4 and Pikmin 4, which have not set release dates yet.</p><p dir=\"ltr\">The Switch is starting to enter what would usually be a console's twilight years, as 2023 will be its sixth year on the market. Persistent rumors have suggested that Nintendo is planning a new \"Pro\" edition that will help it keep pace with more powerful competitors, but so far that hasn't come to fruition. Right now, there is no indication from Nintendo that a new model is on the horizon, or if the company is preparing a successor.</p><p dir=\"ltr\">You can check below for the full list of big coming to the Switch in 2023 and beyond. If you just can't wait to get your hands on some great Switch games, though, read our roundups of the<a href=\"https://www.gamespot.com/articles/best-switch-games/1100-6472850/\"> best Switch games</a> and<a href=\"https://www.gamespot.com/articles/best-switch-games-for-kids/1100-6486062/\"> best Switch games for kids</a>. Also make sure to read our <a href=\"https://www.gamespot.com/gallery/the-5-best-nintendo-switch-exclusive-games-of-2022/2900-4495/\">best Switch exclusives of 2022</a>.</p></h3></p><br />     <p><h2>Fire Emblem Engage - January 20, 2023</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1597/15971423/4036787-0653520680-hero.jpg\" /><br /><h3><p dir=\"ltr\">Fire Emblem continues to be one of Nintendo's biggest and most prolific franchises in recent years, and the Nintendo Switch is getting a brand-new mainline entry with<a href=\"https://www.gamespot.com/games/fire-emblem-engage/\"> Fire Emblem Engage</a>. Set 1,000 years after four kingdoms sealed away the powerful Fell Dragon, Fire Emblem Engage sees that creature returning, and it's up to the humanoid Divine Dragon to save the world. This hero won't be able to do so alone, however, as past Fire Emblem characters like Marth will be available via summons and the tag-team \"Engage\" system to inherit their weapons and deal devastating attacks. It looks to be a classic turn-based tactical Fire Emblem experience that should be perfect for both new and old players.</p><p dir=\"ltr\">Fire Emblem Engage releases for Nintendo Switch on January 20, 2023.</p></h3></p><br />     <p><h2>Little Nemo and the Nightmare Fiends - TBA</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4017893-littlenemoandthenightmarefiends.jpg\" /><br /><h3><p dir=\"ltr\">For fans of adventuring with a dreamy twist, try to keep your eyes open for Little Nemo and the Nightmare Fiends. A unique journey through Slumberland, you'll have four characters to guide--brave Nemo, the magic-wielding Princess, the mischievous clown Flip, and the agile royal guard Peony--as you explore a world based on Winsor McCay's landmark 1905 comic strip. The dreamscape is surreal, the waking world hides secrets of its own, and each character will bring a unique way to play the game thanks to their inherent traits and skills. With a soundtrack by Wayne Strange, Little Nemo and the Nightmare Fiends is shaping up to be an enticing all-nighter of a game.</p></h3></p><br />     <p><h2>Blanc - February 2023</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1585/15855271/4079291-maxresdefault.jpg\" /><br /><h3><p dir=\"ltr\">A lovely game rendered entirely in a black-and-white pencil sketched style, Blanc tells the story of an unlikely friendship between a wolf cub and a fawn. The game can be played in single-player but it's built for co-op as you explore the quest to find safety in an isolated, snowy wilderness. The story is wordless, so it's meant to be enjoyed by players of any age or skill level. It's coming in February 2023.</p></h3></p><br />     <p><h2>Gunbrella - 2023</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1585/15855271/4079293-ss_1c11307def011b54f5975009199a06368d3ce2dd.600x338.jpg\" /><br /><h3><p dir=\"ltr\">This noir-action game has a creative title that tells you exactly what it is. You're armed with a Gunbrella, a firearm that also serves as an umbrella, as you take down cultists, gangsters, and other threats on your quest for revenge. It's the follow-up to the indie hit Gato Roboto for developer Doinksoft and marks another interesting-looking indie game being published by Devolver Digital. It's coming in 2023.</p></h3></p><br />     <p><h2>Advance Wars 1 + 2 Re-Boot Camp - TBA</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4017883-advancewars1%2B2re-bootcamp.jpg\" /><br /><h3><p dir=\"ltr\">The Advance Wars series brought some of the best tactical gameplay of the Game Boy Advance and Nintendo DS era. Now we get to revisit it with a fresh new look in the form of<a href=\"https://www.gamespot.com/games/advance-wars-1-plus-2-re-boot-camp/\"> Advance Wars 1 + 2: Re-Boot Camp</a>, a Nintendo Switch remake of the first two games. Featuring turn-based gameplay on a grid, the Advance Wars games see you assume the role of one of various Commanding Officers directing troops to victory, with each military group capable of using game-changing special abilities, such as unit repairs or power boosts. Developer WayForward (Shantae, River City Girls) has got the job with the remake, breathing new life into the series that will now feature online multiplayer in addition to the campaigns and local play included in the original release.</p><p dir=\"ltr\">Advance Wars 1+2: Re-Boot Camp had been scheduled for December 2021, but was delayed to April 2022 for fine-tuning. Its new date had been set for April 8, but Nintendo indefinitely delayed the remake again due to the ongoing conflict in Ukraine. There's still no word on when it will arrive.</p><p>Advance Wars 1+2: Re-Boot Camp was scheduled to release on April 8, but Nintendo indefinitely delayed the remake due to the ongoing conflict in Ukraine. There's still no word on when it will arrive.</p></h3></p><br />     <p><h2>Loco Motive - TBA</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4017897-locomotive.jpg\" /><br /><h3><p>What is it about trains that make them the perfect vehicles for murder most foul? You'll have to discover the answer to that question yourself, as Loco Motive puts you in the gumshoes of a rookie detective, lawyer, and an undercover spy as they race to prove their innocence before the real killer strikes again. While the setup is grim, the rest of the game plays out like a slapstick whodunnit as you interact with fellow passengers. Loco Motive has a delightful pixel art aesthetic, a moody soundtrack by Space Haven's Paul Zimmerman, and plenty of puzzles that'll likely leave you scratching your head.</p><div class=\"norewrite\" title=\"\">           <a href=\"https://www.nintendo.com/store/products/loco-motive-switch/\">See on Switch eShop</a> </div></h3></p><br />     <p><h2>The Garden Path - TBA</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4017889-thegardenpath.jpg\" /><br /><h3><p dir=\"ltr\">The gaming calendar is usually full of intense action games, but for a change of pace, make friends with a talking onion in this relaxing gardening game. The Garden Path doesn't just sound like a cathartic reason to sit back and tend to a patch of ground that needs a green thumb touch; it's also a slice-of-life simulator that looks fantastic with its painterly aesthetic.</p></h3></p><br />     <p><h2>Bomb Rush Cyberfunk - TBA 2022</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4017888-bombrushcyberfunk.jpg\" /><br /><h3><p>A very funky expression of personal style, graffiti, and crisp cel-shaded visuals, Bomb Rush Cyberfunk is shaping up to be the Jet Set Radio spiritual successor that fans have been waiting for. It's all about increasing your rep in every neighborhood, tagging walls with a can of spray-paint, and challenging other crews for local supremacy in a tricky showdown. Beyond that urban jungle appeal, expect to master your tricks of the trade with environments that are just begging for you to perform grinding, sliding, wall-running, and air maneuvers.</p><div><div class=\"norewrite\" title=\"\">           <a href=\"https://www.nintendo.com/store/products/bomb-rush-cyberfunk-switch/\">See on Switch eShop</a> </div></div></h3></p><br />     <p><h2>Mineko's Night Market - TBA</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4017886-mineko%27snightmarket.jpg\" /><br /><h3><p>Another narrative-driven and social simulation adventure game for the pile, Mineko's Night Market is also a celebration of Japanese culture and a story about friendship. Intertwined with themes of tradition--and a whole lot of cats--you'll guide Mineko as she solves puzzles, takes part in market games, and sneaks past government agents with the use of clever disguises. Boasting hours of exploration through its many environments and four seasons to experience, don't be too surprised to find yourself engaging in some wheeling and dealing with locals to help progress the story.</p><div class=\"norewrite\" title=\"\">           <a href=\"https://www.nintendo.com/store/products/minekos-night-market-switch/\">See on Switch eShop</a> </div></h3></p><br />     <p><h2>Rune Fencer Illyia - TBA</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4017885-runefencerillyia.jpg\" /><br /><h3><p>An action-packed platformer that's focused on both exploration and combat, you'll play as a young Runist named Illyia of Moonstone who is on a journey to find her missing twin sister and a way home. There's plenty of danger along the path though, but Illyia quickly picks up some sharp sword skills and powerful runic magic that'll help her survive in a hostile land. </p></h3></p><br />     <p><h2>The Legend of Zelda: Tears of the Kingdom - May 12, 2023</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4017884-thelegendofzeldabreathofthewild2.jpg\" /><br /><h3><p dir=\"ltr\">The Legend of Zelda: Breath of the Wild is not only one of the greatest Zelda games ever, but one of the greatest video games of all time. How do you follow something like that up? We'll have to wait for the sequel's launch to know for sure, but that game--titled<a href=\"https://www.gamespot.com/games/the-legend-of-zelda-tears-of-the-kingdom/\"> The Legend of Zelda: Tears of the Kingdom</a>--is going to be here sooner rather than later. The game's release date and title-reveal trailer showed that we'll be heading into the skies for some of Link's adventure, with enormous boulders soaring up against gravity and a giant glider providing a lighter path down to Hyrule's surface. The game is still explicitly referred to as a sequel by Nintendo, so just what that means for the eternal struggle between Link and Ganon remains to be seen.</p><p>The Legend of Zelda: Tears of the Kingdom launches for Nintendo Switch on May 12, 2023. In the meantime, read up on<a href=\"https://www.gamespot.com/articles/the-legend-of-zelda-tears-of-the-kingdom-everything-we-know/1100-6492308/\">everything we know about Zelda: Tears of the Kingdom</a>.</p><p> </p><div class=\"norewrite\" title=\"\">           <a href=\"https://assoc-redirect.amazon.com/g/r/https://www.amazon.com/Legend-Zelda-Breath-Wild-Nintendo-Switch/dp/B097B2YWFX?tag=gamespotdeals-20&amp;ascsubtag=ag:gs-2900-4251|vg:-|st:mwb\">See on Amazon</a> </div></h3></p><br />     <p><h2>Sports Story - TBA</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4017882-sportsstory.jpg\" /><br /><h3><p>From small indie team Sidebar Games, <a href=\"https://www.gamespot.com/games/sports-story/\">Sports Story</a> is the follow-up to charming RPG-sport hybrid <a href=\"https://www.gamespot.com/games/golf-story/\">Golf Story</a>, with the addition of several more sports, including tennis and soccer. Similar to the Mario Golf and Mario Tennis games on Game Boy Color, Golf Story combined satisfying sports gameplay with RPG elements, such as leveling up stats and acquiring better equipment, alongside a humorous story where every problem could be solved by hitting a golf ball at it. Sports Story was initially slated for a 2020 release but was delayed indefinitely due to its increasing development scope. At this point, we're not sure when Sports Story is going to bounce onto Nintendo Switch.</p></h3></p><br />     <p><h2>Star Wars: Hunters - TBA</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1595/15950357/4018070-starwarshunters.jpg\" /><br /><h3><p>Star Wars: Hunters is a team-based action game that may primarily be thought of as an iOS and Android game, but it's also coming to Nintendo Switch. Hunters features 4v4 combat in maps based on iconic locales from the Star Wars universe. There will be a ton of playable characters, including Jedi, Stormtroopers, Mandalorian, and more.</p><div><div class=\"norewrite\" title=\"\">           <a href=\"https://www.nintendo.com/store/products/star-wars-hunters-switch/\">See on Switch eShop</a> </div></div><p> </p></h3></p><br />     <p><h2>Metal Slug Tactics - TBA</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4017880-metalslugtactics.jpg\" /><br /><h3><p>Metal Slug has long been one of the best run-and-gun action game franchises out there, but for a change of pace, the series is swapping its blitzkrieg design for a more measured tactical-RPG format. A combination of gorgeous pixel art and fluid animation, Metal Slug Tactics features series powerhouses Marco, Eri, Fio, and Tarma and their over-the-top arsenal in an isometric tactics format that looks fun, clever, and explosive ahead of its eventual release.</p></h3></p><br />     <p><h2>Minecraft Legends - 2023</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1585/15855271/4079290-3989862-gamespot_conferencethumb_site.jpg\" /><br /><h3><p dir=\"ltr\">Mojang has been branching out with the Minecraft brand recently, and Minecraft Legends will mark another new take on the popular block-building franchise. This time it's a third-person action-strategy game, where you control a heroic unit leading your mobs of farm animals and other Minecraft mainstays into battle, and fortifying your defenses with the familiar building tools. The story revolves around the Nether, the corrupt dark side of the Minecraft universe. It's said to include both cooperative and competitive multiplayer, and it's scheduled to release in the first half of 2023.</p></h3></p><br />     <p><h2>Metroid Prime 4 - TBA</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4017881-metroidprime4.jpg\" /><br /><h3><p>Metroid Prime 4 has been in development for many years at this point, and development even restarted in 2019 when Retro Studios took over. There's still no word on a release window, and no one really knows how far along in development it actually is. That said, with Retro Studios at the helm and the sheer brilliance of the trilogy before it, we imagine Metroid Prime 4 will be worth the wait... however long that winds up being.</p><p>In the meantime, you can check out (or replay) Metroid Dread, which brought side-scrolling Metroid back in style last year. Based on a <a href=\"https://www.gamespot.com/articles/metroid-prime-games-are-coming-to-nintendo-switch-report/1100-6504912/\">recent report</a> from Jeff Grubb of GameSpot sister site Giant Bomb, you might be able to return to the Prime series earlier than expected, though, in Metroid Prime Remastered. Metroid Prime Remastered, according to the report, is coming to Switch.</p><div class=\"norewrite\" title=\"\">           <a href=\"https://assoc-redirect.amazon.com/g/r/https://www.amazon.com/Metroid-Prime-4-Nintendo-Switch/dp/B072JYMLT3?tag=gamespotdeals-20&amp;ascsubtag=ag:gs-2900-4251|vg:-|st:mwb\">See on Amazon</a> </div></h3></p><br />     <p><h2>Mina the Hollower - TBA</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1585/15855271/4079292-3935188-screenshot3.jpg\" /><br /><h3><p dir=\"ltr\">Yacht Club Games has made several follow-ups to its breakout hit Shovel Knight, but Mina the Hollower marks a totally new franchise for the indie studio. The game is said to be modeled after Game Boy classics like Link's Awakening, and the studio opened up its development process early with regular streams and blog posts showcasing concept art and design concepts. It's coming thanks to its <a href=\"https://www.kickstarter.com/projects/yachtclubgames/mina-the-hollower\">successful Kickstarter campaign</a>, but no release date has been set.</p></h3></p><br />     <p><h2>Pikmin 4 - TBA 2023</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1597/15971423/4036788-7792400802-1-4.j.jpg\" /><br /><h3><p dir=\"ltr\">Shigeru Miyamoto does what he wants. He has earned that right, and what he wants to do is make a new Pikmin game. Confirmed for Nintendo Switch,<a href=\"https://www.gamespot.com/games/pikmin-4/\"> Pikmin 4</a> is the next adventure featuring the adorable helpful critters, and the Switch's control scheme means gameplay will be more intuitive. According to Miyamoto, this will allow you to spend more time focusing on strategic gameplay decisions and less on just placing your Pikmin in particular locations. Additionally, there will be a new perspective that is closer to the Pikmins' own height, though it's unclear if this will be one option or the new standard.</p><p dir=\"ltr\">Pikmin 4 hits Nintendo Switch in 2023.</p></h3></p><br />", "link": "https://www.gamespot.com/gallery/the-most-anticipated-nintendo-switch-games-of-2023-and-beyond/2900-4251/", "date_published": "2022-12-20 15:47:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Crash Bandicoot: On The Run Is Shutting Down Very Soon", "description": "<p>The mobile game Crash Bandicoot: On the Run is shutting down very soon, developer King has announced. Service for the game will be terminated on February 16, 2023.</p><p>\"On that date the servers will be taken down and the game will no longer be playable,\" King said in a <a href=\"https://www.facebook.com/CrashOnTheRun/photos/a.180038943714811/728553738863326/\">social media post</a>.</p><p>King shut off in-game purchases on December 19. Players who have an in-game balance of purple crystals need to spend them before February 16. Whether or not there is a firesale on in-game items due to the impending shutdown isn't immediately known.</p><a href=\"https://www.gamespot.com/articles/crash-bandicoot-on-the-run-is-shutting-down-very-soon/1100-6510184/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/crash-bandicoot-on-the-run-is-shutting-down-very-soon/1100-6510184/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 15:36:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Star Wars: Dark Forces Gets Fan-Made 4K Remaster", "description": "<p dir=\"ltr\">Star Wars: Dark Forces was one of the first PC Star Wars games ever, and it's still considered one of the best by hardcore fans. Now, one fan-modder has released a total overhaul that allows the game to be easily played on modern systems, and it includes vital features like 4K support, better mouse-look, and a revamped save system.</p><p dir=\"ltr\">Previously, the best option to play Dark Forces was using the DOSbox emulator, which only supports resolutions up to 320x200. Similar to popular \"source ports\" for old-school shooters like Doom, such as <a href=\"https://zdoom.org/index\">GZDoom</a>, <a href=\"https://theforceengine.github.io/blog.html\">The Force Engine</a> requires a copy of Dark Forces to work. The revamped approach to saves adds optional quicksaves and quickloads to the game's checkpoint system.</p><p dir=\"ltr\">Released during the early era of first-person shooters, Dark Forces is a true \"Doom clone\" (as they were termed at the time), complete with sprite-based enemies and simple 3D geometry. Though the Force Engine has hit 1.0, the modder's plans aren't quite complete. In the <a href=\"https://theforceengine.github.io/2022/12/19/Version1-0.html\">blog post</a> announcing the move, they say that version 2.0 of the project will support Outlaws, a lesser-known Wild West shooter that was written in the same engine.</p><a href=\"https://www.gamespot.com/articles/star-wars-dark-forces-gets-fan-made-4k-remaster/1100-6510182/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/star-wars-dark-forces-gets-fan-made-4k-remaster/1100-6510182/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 15:18:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Sifu Comes To Xbox And Steam In March 2023", "description": "<p>Developer Sloclap announced that Sifu will launch on Xbox One, Xbox Series X|S, and PC via Steam in March 2023. A new Arenas mode will also be included, where players can earn new rewards as they take down more and more enemies.</p><p>\"Successfully completing the arenas will progressively unlock a massive new modifiers batch, which doubles the current game's amount and notably brings alternative moves to the Kung Fu palette of our main character,\" Sloclap <a href=\"https://www.ign.com/videos/sifu-arenas-mode-teaser-xbox-and-steam-announcement\">explains to IGN</a>. \"Completing the new Arenas challenges will also unlock new cheats and exclusive new outfits.\"</p><div><blockquote align=\"center\" class=\"twitter-tweet\"><p dir=\"ltr\">I'm sure you never had any doubt the day would come...<br />New content? 👀<br />New platforms? 👀👀<br />IT. IS. HAPPENING! 🔥<br />Check out our latest <a href=\"https://twitter.com/hashtag/Sifu?src=hash&amp;ref_src=twsrc^tfw\">#Sifu</a> REVEAL TEASER over at <a href=\"https://twitter.com/IGN?ref_src=twsrc^tfw\">@IGN</a>'s website! <a href=\"https://t.co/ZydrR5aUvj\">https://t.co/ZydrR5aUvj</a><br />Wishlist on Steam: <a href=\"https://t.co/6ykTM44kGm\">https://t.co/6ykTM44kGm</a> <a href=\"https://t.co/VSrkf0bJSn\">https://t.co/VSrkf0bJSn</a> <a href=\"https://t.co/7kU0RN2tzM\">pic.twitter.com/7kU0RN2tzM</a></p>  — SifuGame (@SifuGame) <a href=\"https://twitter.com/SifuGame/status/1605203248910155777?ref_src=twsrc^tfw\">December 20, 2022</a></blockquote>              </div><p>Sifu's <a href=\"https://www.gamespot.com/articles/sifu-gets-new-update-next-week-adds-gameplay-modifiers-and-scoring-system/1100-6506921/\">summer update</a> back in August added a new scoring system, a suite of gameplay modifiers, and more outfits. The game was first released on PlayStation and the Epic Games Store in February and then came to Nintendo Switch last month.</p><a href=\"https://www.gamespot.com/articles/sifu-comes-to-xbox-and-steam-in-march-2023/1100-6510183/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/sifu-comes-to-xbox-and-steam-in-march-2023/1100-6510183/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 15:11:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Zero Dark Thirty Writer On Why He's Unlikely To Make A Marvel-Style Blockbuster Anytime Soon", "description": "<p>Mark Boal, the former journalist who wrote the Oscar-winning writer who won two Oscars for the Bin Laden movie Zero Dark Thirty, has shared his thoughts on the big Marvel-style Hollywood blockbusters. Appearing on the <a href=\"https://open.spotify.com/show/4rOoJ6Egrf8K2IrywzwOMk\">Joe Rogan Experience podcast</a>, Boal was asked if a studio has ever come to him asking him to write a giant blockbuster.</p><p>\"Nobody ever f**king asked me that, no, they never do,\" he said.</p><p>The closest Boal has ever come to something like this was some script-doctoring work he did, though he didn't name any projects specifically. That said, Boal said he enjoys these jobs--which can involving punching up dialogue or helping fix the third act, for example--because they pay \"crazy good money.\" But Boal has never been asked to work on a massive IP like Spider-Man, for example.</p><a href=\"https://www.gamespot.com/articles/zero-dark-thirty-writer-on-why-hes-unlikely-to-make-a-marvel-style-blockbuster-anytime-soon/1100-6510180/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/zero-dark-thirty-writer-on-why-hes-unlikely-to-make-a-marvel-style-blockbuster-anytime-soon/1100-6510180/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 15:09:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Biggest Xbox Games Coming in 2023 and Beyond", "description": "<img height=\"480\" src=\"https://www.gamespot.com/a/uploads/square_medium/1352/13527689/4078620-v1%283%29.jpg\" width=\"480\" /> Xbox has had quite the year. But, 2023 is a new start with some very anticipated games coming out. Here are some of the biggest games you have to look forward to in 2023 and beyond.", "link": "https://www.gamespot.com/videos/biggest-xbox-games-coming-in-2023-and-beyond/2300-6460273/", "date_published": "2022-12-20 15:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Witcher: Blood Origin's Francesca Mills Treated Her Warhammer Like Another Cast Member, Keeps It In Her Bedroom", "description": "<p dir=\"ltr\">When Netflix's Witcher prequel series rolls around, Witcher: Blood Origin, there's a moment that will take you by surprise: when Francesca Mills' character Meldof reveals the history of her beautifully ornate warhammer named Gwen.</p><p dir=\"ltr\">Without getting into any spoilers, Gwen was more than Meldof's favorite tool to bash in the heads of her enemies, it was a full-fledged character both on the show and when the camera wasn't rolling. \"It was a big day,\" Mills told GameSpot when she first saw Gwen. \"I won't lie to you. Because also it sounds ridiculous to put an emotional attachment on an object, if that makes sense, but truly Gwen was part of the cast. People even passing Gwen on set. When you get passed it, it wasn't just like you were chucked your prop. It was like, 'Here's Gwen.' And I was like, 'Thank you.' And I'd have someone take Gwen. She'd never get dropped.</p><p dir=\"ltr\">\"There was such respect around going. And that was throughout the whole team as well, which was lovely and definitely helped me as an actor. Because then it became at one with my body, and it was like a comfort blanket almost to have Gwen there.\"</p><a href=\"https://www.gamespot.com/articles/witcher-blood-origins-francesca-mills-treated-her-warhammer-like-another-cast-member-keeps-it-in-her-bedroom/1100-6510181/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/witcher-blood-origins-francesca-mills-treated-her-warhammer-like-another-cast-member-keeps-it-in-her-bedroom/1100-6510181/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 14:46:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Marvel Teases New Details On Spider-Man: Across the Spider-Verse", "description": "<p dir=\"ltr\">Spider-Man: Into the Spider-Verse is one of the most beloved comic-book films ever, and is one of the few to win an Oscar. In a new interview with <a href=\"https://ew.com/movies/spider-man-across-the-spider-verse-phil-lord-chris-miller-2023-preview/\">Entertainment Weekly</a>, creative duo Phil Lord and Chris Miller have revealed some new details about the film's sequel, Spider-Man: Across the Spider-Verse.</p><p dir=\"ltr\">The second in a planned trilogy, Spider-Verse 2 will star Miles Morales yet again, a few years older and wiser. However, while the first film was all about other Spider-People invading his universe, this time, Miles will adventure across the multiverse himself. The film will also feature returning characters like Spider-Gwen and Peter B. Parker. Lord and Miller estimate that about 240 characters were designed for the film, so expect to see a lot of new faces.</p><p dir=\"ltr\">Two major new characters include Oscar Isaac as Spider-Man 2099, who was teased in the credits of the first film. Jason Schwartzman will play a villain known as the Spot, who has the ability to create portals to different dimensions. Lord and Miller describe him as a classic cartoon baddy, similar to Wile E. Coyote. Despite the character's goofy costume and appearance, Lord describes him as a \"dark mirror\" of Miles, because he wants to be taken seriously as a villain.</p><a href=\"https://www.gamespot.com/articles/marvel-teases-new-details-on-spider-man-across-the-spider-verse/1100-6510177/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/marvel-teases-new-details-on-spider-man-across-the-spider-verse/1100-6510177/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 14:20:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "GameSpot's 10 Best TV Shows Of 2022", "description": "<p><img src=\"https://www.gamespot.com/a/uploads/original/1562/15626911/4078584-gb-boty-2022tvtop10.jpg\" /><br /><h3><p dir=\"ltr\">Over the past two decades, television has evolved greatly. HBO changed the landscape with series like Sopranos, Oz, and The Wire, and very quickly, other networks followed suit. TV became more than sitcoms filmed before a studio audience that dominated the '80s and '90s. TV became more complex, more mature, and the overall quality increased. And since then, with the expansion of streaming services, there is simply too much high-quality content to keep up with.</p><p dir=\"ltr\">In 2022, it felt like there was more new content than ever. Between networks, cable, and streaming, there are dozens upon dozens of TV series worth watching. Whether it is the latest Star Wars series on Disney+ or something innovative happening at FX--which is a lot more than you think--there is no shortage of high-quality television to watch.</p><p dir=\"ltr\">And the list of great shows keeps growing, especially when services like Prime Video are dumping millions of dollars into creating a Lord of the Rings universe or HBO is continuing to build out its Game of Thrones brand with the prequel House of the Dragon or even Disney+ going beyond Marvel and Star Wars shows to bring back franchises like Willow and The Santa Clause as shows..</p><p dir=\"ltr\">So the staff of GameSpot came together to ask, \"What are the best TV shows of the past year?\" After long discussions about our favorite series, we came up with our Top 10 TV shows of the year, with the best TV show of the year. So check out the staff's favorite series of this past year.</p></h3></p><br />     <p><h2>Andor</h2><img src=\"https://www.gamespot.com/a/uploads/original/1562/15626911/4078596-1.jpg\" /><br /><h3><p dir=\"ltr\">We had every reason to be skeptical of Andor, the third Star Wars show this year on a platform that gave us the forgettable Book of Boba Fett and the fine-but-not-great Obi-Wan Kenobi. For one thing, a show based on a secondary character from Rogue One--the dashing and ethically compromised Rebel spy Cassian Andor--didn't seem terribly necessary. Imagine our surprise when the outcome was a prestige TV drama that stands apart from its source material.</p><p dir=\"ltr\">There's nary a Jedi in sight in Andor, which focuses on the first year of Cassian's recruitment into a fledgling rebel alliance. The story is more grounded and relatable, as it takes seriously both the stakes and the inner workings of the rebellion and the Empire. This is a show about interlocking systems of power and how they influence and ricochet off of each other, and it accomplishes this storytelling trick by focusing on individuals within those power structures. The Empire isn't a broad villain, but a collection of ambitious bureaucrats who feel utterly righteous even in the face of their own sadism. The Rebellion at this point a collection of loosely affiliated power brokers, dissidents, and guerrilla warriors, starting to find common cause. In most of Star Wars, we're told that the Empire is an oppressive force. In Andor, we see that oppression up close: how it grows and metastasizes, how it chokes out everyday life, and how those who fight against it are forced to surrender their own peace of mind.</p><p dir=\"ltr\">This is the context in which we explore themes like what we're willing to sacrifice, how to confront fascism, the prison industrial complex, and the legacy of revolutionary ideas that live beyond their creators. Buoyed by Emmy-worthy performances from Stellan Skarsgard and Fiona Shaw and well-written dialogue that consistently delivers instantly-iconic moments, this is the smartest and most resonant Star Wars has ever been. -- <em>Steve Watts</em></p></h3></p><br />     <p><h2>The Rehearsal</h2><img src=\"https://www.gamespot.com/a/uploads/original/1562/15626911/4078595-2.jpg\" /><br /><h3><p dir=\"ltr\">After four seasons of Nathan For You, it seemed like Nathan Fielder's fanbase had a pretty good idea of what to expect from his next reality project, but there is no way they could ever prepare for The Rehearsal. Billed as a chance for participants to \"rehearse\" important upcoming events in their lives so they could go off without a hitch, The Rehearsal is really an examination of what would happen if reality and fiction became so blurred that it was no longer possible to determine truth. The Rehearsal takes what Synecdoche, New York did in a fictional world and attempts to make it real, and that is as bizarre and hilarious as it sounds.</p><p dir=\"ltr\">From the opening minutes of the first episode, Nathan Fielder makes it very clear that you should not try to guess what is going to happen next, because you will be wrong. He jokes with his first participant--an avid trivia-night player with a dark secret--that he had already rehearsed their initial consultation ahead of time. Except that wasn't a joke: Nathan had secretly scoped out the man's entire apartment and had it recreated at full scale, putting a stand-in actor inside so he could run through the conversation they'd have <em>about </em>rehearsing an upcoming event. It's unhinged, creepy, and so funny that you'll likely have to pause each episode several times while you laugh.</p><p dir=\"ltr\">As Nathan finds himself more directly inserted into the rehearsals he's doing with his clients, The Rehearsal goes so far off the rails--in a good way--that I have legitimately no idea how he plans to top it with the upcoming second season. What I have learned, however, is to not question Nathan Fielder, who seems incapable of making anything that isn't laugh-out-loud hilarious and wholly unique. <em>--</em> <em>Gabe Gurwin</em></p></h3></p><br />     <p><h2>The Boys</h2><img src=\"https://www.gamespot.com/a/uploads/scale_super/1562/15626911/4078597-3.jpg\" /><br /><h3><p dir=\"ltr\">Season 3 of Prime Video's adaptation of the comic book series The Boys was the best season to date. Building on the past two seasons, the latest offering of episodes parodies what's happening in the real world, surrounding corporate takeovers, politics, and parodying one thing not so much happening in the real world: superhero content.</p><p dir=\"ltr\">This year's episodes were a game-changer for the show and the overall dynamic of The Seven. Without getting into major spoilers, it dived into a place where the future of the show seemed very exciting as the power dynamic of The Seven and Vought International was changing directions. For a show that's all about surprising the viewer--with typically shocking moments--it's great to see The Boys push the envelope by turning the well-established world on its head. Plus, we got to see a whole bunch of Jensen Ackles this season as he took on the role of Soldier Boy.</p><p dir=\"ltr\">There was also the highly-anticipated adaptation of the outrageous Herogasm storyline, which was slimmed down to one episode. Although it was a pretty big departure from the source material, the way the setting was woven into Season 3's storyline was perfect. Of course, we got some exceptionally shocking moments--<a href=\"https://www.gamespot.com/articles/the-boys-showrunner-and-mothers-milk-actor-break-down-the-grossest-moment-from-herogasm/1100-6504902/\">like the \"throwing ropes\" scene</a>--but the latest batch of episodes of The Boys was a homerun. -- <em>Mat Elfring</em></p></h3></p><br />     <p><h2>Better Call Saul</h2><img src=\"https://www.gamespot.com/a/uploads/original/1562/15626911/4078598-4.jpg\" /><br /><h3><p dir=\"ltr\">It's difficult to say anything about Better Call Saul that hasn't already been said. The show shouldn't have worked, Breaking Bad didn't need a spin-off to begin with, and a character like Saul Goodman should not have been compelling enough to carry multiple seasons. And yet, somehow, against all odds, here we are. Better Call Saul did everything right, from the way it handled its own forgone conclusion head-on to the way it maintained some level of mystery for its compelling supporting cast. It was heartbreaking, anxiety-inducing, and frequently hilarious. It took the groundwork laid by Breaking Bad and ran, pulling off victory lap after victory lap--but most importantly, it stuck the landing.</p><p dir=\"ltr\">It'll be lucky if we see another show this well crafted and this well executed any time soon, but thankfully, with the entire show now finished and the last season in the books, we can go back and relive the experience as many times as we want to fill the void. -- <em>Mason Downey</em></p></h3></p><br />     <p><h2>Our Flag Means Death</h2><img src=\"https://www.gamespot.com/a/uploads/scale_super/1562/15626911/4078599-5.jpg\" /><br /><h3><p dir=\"ltr\">Thanks to the MCU, Taika Waititi's name has become close to ubiquitous in mainstream pop culture, but before he was part of the biggest franchise on Earth, Waititi was teaming up with his fellow New Zealanders to make some of the funniest and most absurd comedy around. Our Flag Means death thrust Waititi and his frequent collaborator Rhys Darby back in front of the camera to return to that form in this quasi-historical romantic comedy about the golden age of piracy in the 18th century.</p><p dir=\"ltr\">But what makes Our Flag Means Death truly special, beyond just the fact that it's definitely one of the funniest shows around this year, is the fearless and fresh angle it takes on familiar pirate legends. Waititi and Darby play Blackbeard and Stede Bonnet respectively, but rather than a pair of swashbuckling pals or pirate rivals, in this version of the story Blackbeard and Bonnet are star-crossed lovers, brought together (and subsequently torn apart) by circumstance. It's hilarious, heart-breaking, and, most importantly, some of the most clever TV you can watch this year. Come for all your favorite comedians making cameos, stay for the definitely historically accurate 18th century Crocs. -- <em>Mason Downey</em></p></h3></p><br />     <p><h2>Chainsaw Man</h2><img src=\"https://www.gamespot.com/a/uploads/scale_super/1562/15626911/4078601-6.jpg\" /><br /><h3><p dir=\"ltr\">Every year, more and more anime events break through into mainstream American pop culture. In 2021, One Piece reached 1000 episodes. In 2022, the highly-anticipated manga Chainsaw Man was adapted into an anime, and it did not disappoint. With 12 episodes in Season 1--leading to the finale on December 27--Chainsaw Man not only grabbed the attention of the mainstream, but it's also just a brilliant show.</p><p dir=\"ltr\">Following Denji, a devil hunter, the series is bombastic and never lets up. Even when horrific monsters aren't being sliced to bits by the main character--who can transform into a monster with a chainsaw coming out of his head and two out of his arms--the show is shockingly fun and intense. Studio MAPPA is behind the show, and following its other recent anime like Jujutsu Kaisen and Attack on Titan, Chainsaw Man has a perfect home with this studio, as it's some of their best work yet.</p><p dir=\"ltr\">Filled with emotional backstories and complex characters--some of whom are way too horny for their own good--Chainsaw Man hits all the notes of what an anime series is like, while, in many ways, being a great entrance-level show for those new to the genre. -- <em>Mat Elfring</em></p></h3></p><br />     <p><h2>The Bear</h2><img src=\"https://www.gamespot.com/a/uploads/scale_super/1562/15626911/4078602-7.jpg\" /><br /><h3><p dir=\"ltr\">Who knew making Italian beef sandwiches could be such a high-stress environment? The Bear follows Carmy Berzatto, an award-winning chef that is more or less forced to return to his family's Italian beef sandwich shop to run it after the death of his brother. The premise is ridiculously simple, but the tension that radiates off the kitchen as cooks clash, family members quarrel, and Carmy tries to force a new and refined menu into a restaurant that relies on a classic dish is mesmerizing to watch.</p><p>That, of course, is thanks in large part to the cast led by Jeremy Allen White (Carmy), who somehow plays an even <em>more</em> Chicago-y kind of guy than he did as Lip on Shameless. The first season of The Bear was more or less a prologue to the overall story being told of Carmy and his motley crew of misfit cooks and business associates (and siblings) attempting to take their reliable family business and make something more that they can all be proud of. And, along the way, they'll chain smoke, scream at each other, quit repeatedly, and probably sell drugs from behind the counter. -- <em>Chris E. Hayner</em></p></h3></p><br />     <p><h2>Cyberpunk: Edgerunners</h2><img src=\"https://www.gamespot.com/a/uploads/scale_super/1562/15626911/4078603-8.jpg\" /><br /><h3><p dir=\"ltr\">CD Projekt Red's Cyberpunk 2077 experienced a rough launch, but it built a world that was exceptionally compelling and intriguing. Netflix's 10-episode anime series expanded upon that brilliantly. Produced by Studio Trigger (Promare), Cyberpunk: Edgerunner follows a new protagonist in Night City, taking on some familiar corporations from the game.</p><p dir=\"ltr\">Cyberpunk: Edgerunners is intense from start to finish. Watching the protagonist David slowly go from school dropout to super-powered edgerunner is an incredible journey, and the series is incredible at making you care about everyone on this show.</p><p dir=\"ltr\">It's a season that will fly by. 10 episodes will feel like an hour of view time with how engaging the show is. It feels like a cyberpunk anime from the '80s or '90s--drawing a lot of comparisons to Battle Angel, in the best way possible. Calling Edgerunners action-packed is almost like you're downplaying it, as the action sequences are over-the-top in the best ways possible. It is an incredible adaptation that far surpasses expectations. -- <em>Mat Elfring</em></p></h3></p><br />     <p><h2>Interview With the Vampire</h2><img src=\"https://www.gamespot.com/a/uploads/scale_super/1562/15626911/4078604-9.jpg\" /><br /><h3><p dir=\"ltr\">Adaptations can be tricky things, especially when you're dealing with texts as beloved as Anne Rice's Vampire Chronicles, which already have a certified cult classic adaptation in the '90s Interview With The Vampire movie. We love Brad Pitt and Tom Cruise as Louis and Lestat as much as anyone, but we're just going to come right out and say it: The show is doing a better and more interesting thing with that story.</p><p dir=\"ltr\">AMC's TV show is a masterclass in making smart, creative, and necessary changes to a source material in order to update it for a new era. A lot has changed since the book originally hit shelves, and even more has changed since the movie debuted in theaters, but the show understands all this and takes it in stride. And, with an incredible cast with even more incredible chemistry, Interview With the Vampire is easily one of the best and most unexpected shows of 2023. -- <em>Mason Downey</em></p><p> </p></h3></p><br />     <p><h2>GameSpot's Top TV Show of 2022: Severance</h2><img src=\"https://www.gamespot.com/a/uploads/scale_super/1562/15626911/4078605-10.jpg\" /><br /><h3><p dir=\"ltr\">Originality in an age of franchise sequels and spin-offs is rare enough these days, but it's rarer to see an original work so successfully stick its landing. Severance--an exclusive to Apple TV+ and the service's best selling point--is that original work. Its basic premise is infinitely relatable, asking us what our lives would look like if we could completely separate our personal memories from our work memories. It quickly veers into the surreal and dark in a way that shows just how harmful that would be.</p><p dir=\"ltr\">Severance immediately grabs you with its visual style and set design, which are like the platonic ideal of \"boring corporate office\" turned up to 11 and sterilized in an extremely creepy way. Often eerily quiet, the Lumon offices--where employees take numbers on their screen and sort them, for reasons unclear--seem friendly and calm at first glance, but like that unstable friend we all know, the slightest problem can show its true, terrifying colors.</p><p dir=\"ltr\">There are plenty of iconic moments in Severance's first season, including the much-coveted egg bar and Waffle Party, but they wouldn't have the same hilarious and unnerving impact without the show's impeccable cast. Adam Scott's role as a team leader who is also unsure of his company's true motivations makes for an emotionally complex part, and standout supporting actors like Christopher Walken and John Turturro both show different pieces of the always-churning corporate machine. Perhaps the best is Zach Cherry, a worker who cares not about the morally ambiguous nature of his job, but instead about the little freebies he gets for hitting arbitrary goals. We can all appreciate a good plastic toy for our desk, even if we only remember they exist for about eight hours every day. -- <em>Gabe Gurwin</em></p><p> </p></h3></p><br />", "link": "https://www.gamespot.com/gallery/gamespots-10-best-tv-shows-of-2022/2900-4550/", "date_published": "2022-12-20 14:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Sony's DualSense Edge Brings In-Depth Controller Customization To PS5", "description": "<p> PlayStation is leaping into the world of prosumer controllers with the DualSense Edge. I had the opportunity to check out the new gamepad, and it feels like a well-rounded hobbyist controller that's easy to customize on the fly.</p><p dir=\"ltr\">The DualSense Edge feels and looks nearly identical to the DualSense controller. DualSense Edge lead product manager Tomamasu Mizuno assured me that this was an intentional decision so as to not alienate players who've already spent hundreds of hours with the standard DualSense. If you've held a PlayStation 5 controller before, then you know what the Edge will feel like in your hands. The biggest changes to the ergonomics are the new, rubbery grips on the back of the controller, the two function buttons, the trigger stops, and the customizable paddle buttons in the back.</p><p dir=\"ltr\">The customizable back buttons are the thing that feel most different on the new controller. I had to adjust my grip ever so slightly to accommodate them. Unlike the Xbox Elite Series 2 controller's four, there are only two buttons on the back of the controller. The paddles jut out slightly more than the Elite controller's, meaning it requires a tap to press rather than the squeeze motion I would normally do with an Elite controller. The package also comes with an alternate set of back buttons shaped like half moons. These felt more natural in my hands as they leaned right up against my middle fingers. Of course, you can remove the back buttons altogether if you'd like.</p><a href=\"https://www.gamespot.com/articles/sonys-dualsense-edge-brings-in-depth-controller-customization-to-ps5/1100-6510106/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/sonys-dualsense-edge-brings-in-depth-controller-customization-to-ps5/1100-6510106/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 14:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "High On Life Is Doing Great On Xbox Game Pass, Apparently", "description": "<p>Squanch Games' wild and wacky shooter High On Life is tearing it up on Xbox Game Pass, it seems. <a href=\"https://twitter.com/BenjiSales/status/1604886228733759490\">Benji Sales on Twitter</a> found a list that showed the new game from Ricky and Morty's Justin Roiland as the No. 1 \"most-popular\" Xbox Game Pass title earlier this week. The game's own Twitter account re-shared the tweet.</p><p>The developer did not share any specific player or engagement numbers, however, and it only passed along Benji's tweet, saying it \"heard\" that the game was No. 1 on Game Pass, not that it actually is.</p><p>Whatever the case, it does seem that High On Life is performing well on Xbox. On the Xbox.com website, <a href=\"https://click.linksynergy.com/deeplink?id=VZfI20jEa0c&amp;mid=24542&amp;u1=gs-gs{{TYPE_ID}}{{CONTENT_ID}}-dtp-en&amp;murl=https://www.xbox.com/en-US/games/all-games?cat=newreleases\">High On Life ranks No. 5 on the current \"best-seller\" list</a> and <a href=\"https://click.linksynergy.com/deeplink?id=VZfI20jEa0c&amp;mid=24542&amp;u1=gs-gs{{TYPE_ID}}{{CONTENT_ID}}-dtp-en&amp;murl=https://www.xbox.com/en-us/games/all-games?cat=mostplayed\">No. 3 for \"most-played.\"</a></p><a href=\"https://www.gamespot.com/articles/high-on-life-is-doing-great-on-xbox-game-pass-apparently/1100-6510179/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/high-on-life-is-doing-great-on-xbox-game-pass-apparently/1100-6510179/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 13:50:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "The Last Of Us Is Gaming's Greatest Story, HBO Showrunner Craig Mazin Says", "description": "<p>In a recent interview, The Last of Us showrunner Craig Mazin expressed his enthusiasm for the show's source material and speculated why the classic game transcends the common limitations of other video games.</p><p>In an interview with <a href=\"https://www.empireonline.com/tv/news/the-last-of-us-craig-mazin-greatest-story-ever-told-video-games-exclusive/\">Empire</a>, Mazin said, \"It's an open-and-shut case: This is the greatest story that has ever been told in video games.\" He goes on to explain how the game's emphasis on grounded character development and human stories elevated it above other video games. According to Mazin, The Last of Us sings because \"they were just people. And that, in and of itself, is remarkably rare in games.\" He also alludes to the changing of certain elements to better fit the medium of TV, in collaboration with the game's writer and director Neil Druckmann. He said, \"Neil and I always knew to ask, \"'Why are we only doing what’s in the game? What can we do to expand?'\" Chris Mazin was previously best known for creating and showrunning the critically acclaimed series Chernobyl<em>.</em></p><p>Now, there are plenty of games that could take the spot of best video game story. One might suggest that there is a rich and overlooked history of interactive fiction, a legacy that continues today into games like Kentucky Route Zero or Disco Elysium. One might suggest that games like Dwarf Fortress can be pretty interesting story-telling engines that eschew traditional models. One could even point to classics like Final Fantasy X or Silent Hill 2, which hide human stories and characters beneath genre fare. However, it is hard to argue that any of those would be a better fit for prestige TV than The Last of Us.</p><a href=\"https://www.gamespot.com/articles/the-last-of-us-is-gamings-greatest-story-hbo-showrunner-craig-mazin-says/1100-6510178/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/the-last-of-us-is-gamings-greatest-story-hbo-showrunner-craig-mazin-says/1100-6510178/?ftag=CAD-01-10abi2f", "date_published": "2022-12-20 13:37:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "The Most-Anticipated Xbox Games Of 2023 And Beyond", "description": "<p><img src=\"https://www.gamespot.com/a/uploads/scale_large/1587/15875866/4076420-layla.jpeg\" /><br /><h3><p dir=\"ltr\">As 2022 winds down, it's time to look forward to what's ahead. If Xbox Series X|S or Xbox One is your console of choice, there's plenty to be excited about, with several console exclusives and many third-party titles coming to Microsoft's platforms in 2023 and beyond. Below, we detail the games we're most anticipating in the new year, from Embark Studios' Arc Raiders to Outerloop Games' Thirsty Suitors.</p><p dir=\"ltr\">In order to keep this list manageable, I'm holding myself to the rule that for a game to be included on this list, we must have seen gameplay of it at some point. I'm sure Xbox's future first-party titles like Avowed and Fable will wow, and there are some great-sounding third-party games on the horizon like Dragon Age: Dreadwolf and Assassin's Creed Mirage. But for now, let's try to reign in the hype and save our excitement for games where we actually know what the game looks like to play.</p><p dir=\"ltr\">Plus, even with that limitation, there are still a <em>ton </em>of games to look forward to--too many to list all of them. We had to draw the line somewhere or this article would have never been finished! Of the games picked, we've listed them in alphabetical order.</p></h3></p><br />     <p><h2>Arc Raiders</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1587/15875866/4079160-arc.jpg\" /><br /><h3><p> </p><p dir=\"ltr\">Arc Raiders is an upcoming free-to-play, co-op, third-person shooter from developer Embark Studios. In it, you play as a member of the human resistance, fighting against a never-ending army of machines that descend to Earth, sent from some unknown enemy. Using an assortment of good ol' fashioned firearms and more advanced gear like jetpacks, you work with other players to respond to overpower larger-than-life threats and protect the planet. Arc Raiders is scheduled to launch for Xbox Series X|S, PS5, and PC in 2023.</p></h3></p><br />     <p><h2>Atomic Heart</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1587/15875866/4079161-atomic.jpg\" /><br /><h3><p>Atomic Heart is an upcoming first-person shooter from developer Mundfish. Taking place in a fictional alternate history, Atomic Heart is set in the Soviet Union in 1955. After the USSR developed advanced robotics to defeat Nazi Germany, the Soviets were inspired to go all-in on a high-tech future, creating an entirely automatic labor force controlled by a collective hivemind. Brilliant move. No obvious downsides. Anyway, as a Soviet KGB officer, you're gifted an experimental power glove and a healthy array of firearms and told to go stop the army of freakish robotic monsters now trying to end the lives of their human creators. Atomic Heart is scheduled to launch for Xbox Series X|S, Xbox One, PS5, PS4, and PC on February 21, 2023.</p><div><div class=\"norewrite\" title=\"\">           <a href=\"https://click.linksynergy.com/deeplink?id=VZfI20jEa0c&amp;mid=24542&amp;u1=subid_value&amp;murl=https://www.xbox.com/en-US/games/atomic-heart\">See at Xbox</a> </div></div><p> </p></h3></p><br />     <p><h2>Blue Protocol</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1587/15875866/4079162-blueprotocol_presskit_cinematic_act2_charlotteintro.jpeg\" /><br /><h3><p>Blue Protocol is an upcoming action-RPG with MMO elements from developer Bandai Namco. Featuring expansive character customization--you decide your character's face, hairstyle, clothes, accessories, weapons, and mounts--that comes alive with a vibrant anime-like art style, Blue Protocol looks to be a fun story-driven adventure with friends, where you travel on a quest to discover your origins. Blue Protocol is scheduled to launch for Xbox Series X|S, PS5, and PC in 2023.</p></h3></p><br />     <p><h2>Cocoon</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1587/15875866/4079163-cocoon.jpg\" /><br /><h3><p>Cocoon is an upcoming puzzle adventure game from developer Geometric Interactive, and is notably being led by Jeppe Carlsen, the lead gameplay designer for both Limbo and Inside. Like those games, Cocoon seems to explore its tale wordlessly, as you explore increasingly strange alien worlds, each of which can be carried as a small orb on your back. Every orb presents a new world to dive into and uncover, and each possesses a unique ability as well--like illuminating unseen paths--creating Inception levels of world-within-world puzzles. Cocoon is scheduled to launch for Xbox Series X|S, Xbox One, Nintendo Switch, and PC in 2023.</p></h3></p><br />     <p><h2>Dead Island 2</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1587/15875866/4079164-deadisland.jpg\" /><br /><h3><p>Dead Island 2 is an upcoming action-RPG from developer Dambuster Studios. The long-awaited sequel to 2011's Dead Island moves the series' zombie outbreak apocalypse to California, seeing you play as survivors stuck in a restrictive quarantine set up by the United States Armed Forces. As a survivor who's infected, you can walk that fine line between becoming a zombie and staying human by embracing the disease and unlocking zombie powers. Dead Island 2 is scheduled to launch for Xbox Series X|S, Xbox One, PS5, PS4, and PC on April 28, 2023.</p></h3></p><br />     <p><h2>Dead Space</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1587/15875866/4076579-dead.jpg\" /><br /><h3><p> Dead Space is an upcoming remake of the 2008 survival-horror game of the same name. Developed by Motive Studios, Dead Space sees you play as engineer Isaac Clarke, who, while investigating a distress beacon issued by the USG Ishimura, discovers that the giant mining spaceship has been overrun by monstrous undead abominations of the ship's crew. Utilizing an assortment of engineering and maintenance equipment as makeshift weapons, Isaac has to find a way to escape the deteriorating ship, all while fighting off the infected by surgically cutting off their limbs. Dead Space is scheduled to launch for Xbox Series X|S, PS5, and PC on January 27, 2023.</p></h3></p><br />     <p><h2>Diablo IV</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1587/15875866/4079165-diablo4.jpg\" /><br /><h3><p>Diablo IV is an upcoming action-RPG from developer Blizzard Entertainment. In Diablo IV, your character is tasked with stopping Lilith, who has been resurrected and is taking advantage of the events of the past few games, which saw both the demons and angels largely decimated. You can pick one of five playable classes for your hero--Barbarian, Sorceress, Druid, Rogue, or Necromancer--and then set out into five open-world regions filled with procedurally generated dungeons, either on your own or in a party of four. Like its predecessor, Diablo IV is an always-online experience, allowing you to meet and befriend other players in town or when out exploring. Diablo IV is scheduled to launch for Xbox Series X|S, Xbox One, PS5, PS4, and PC on June 6, 2023.</p></h3></p><br />     <p><h2>Everspace 2</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1587/15875866/4079166-ever.jpg\" /><br /><h3><p>Everspace 2 is an upcoming fast-paced spaceship shooter from developer Rockfish Games. Surprisingly, Everspace 2 moves away from the beloved roguelike structure of its predecessor and instead opts for an open-world, narrative-driven experience with a more thoughtful sci-fi story, optional side quests to pursue, and a lot more RPG-inspired elements. The moment-to-moment gameplay of frenetic dogfights that rewards skilled piloting and adaptability is largely the same--it's just as good as you remember if you played the first game. Currently in early access via Steam Early Access and GOG's Games in Development, the game's 1.0 build is set to officially launch for Xbox and PlayStation consoles (Rockfish has not clarified which ones specifically yet) and PC in 2023.</p></h3></p><br />     <p><h2>Flintlock: The Siege Of Dawn</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1587/15875866/4029500-flintlock.jpg\" /><br /><h3><p>Flintlock: The Siege of Dawn is an upcoming open-world action-RPG with Souls-like-inspired combat from developer A44 Games. In Flintlock, you play Nor Vanek, a soldier in the coalition army. The army is at war with the gods, using gunpowder as a means to keep pace with the divine magic they face. Nor's personal vendetta with the gods sees her making an alliance with Enki, a small magical creature with his own problems with the gods. To overcome Flintlock's challenging enemies and eerie bosses, you need to explore how the two partners' skillsets best cooperate together, mixing devastating firearms with potent magic. Flintlock: The Siege of Dawn is scheduled to launch for Xbox Series X|S, Xbox One, PS5, PS4, and PC in 2023.</p></h3></p><br />     <p><h2>Forza Motorsport</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1702/17023653/4018087-forzamotorsport.jpg\" /><br /><h3><p dir=\"ltr\">Forza Motorsport is an upcoming racing simulator game from Turn 10 Studios, not to be confused with Playground Games' recent racing arcade game, Forza Horizon 4. Turn 10 Studios' new game will be the eighth main entry to the Forza Motorsport series, which generally focuses a lot more on detailed simulation in comparison to the Forza Horizon series. Forza Motorsport is scheduled to launch for Xbox Series X|S and PC in 2023.</p></h3></p><br />     <p><h2>Harold Halibut</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1587/15875866/4079167-harold.jpg\" /><br /><h3><p>Harold Halibut is an upcoming narrative adventure game from developer Slow Bros. The game is made entirely from 3D scanned physical models, emulating stop-motion technology. The result is a <em>gorgeous</em>-looking game about a young lab assistant, Harold, who lives in a city-sized spaceship stuck on an aquatic planet. Though most citizens have accepted their fate, the ship's lead scientist and your boss, Jeanne, hasn't. As you aid her in her attempts to find a way to free the ship from the planet, you can also explore it and meet your fellow passengers, learning what it means to call a place a home. Harold Halibut is scheduled to launch for Xbox One, PS4, and PC in 2023.</p></h3></p><br />     <p><h2>Hollow Knight Silksong</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1587/15875866/4079168-hollow.jpg\" /><br /><h3><p> Long have we waited to hear the silken strum of developer Team Cherry's sophomore effort grace our ears, to feel the propelled movements of protagonist Hornet as her insectoid feet pirouette through the air with deadly grace. And soon we shall have it. So soon, indeed. Hollow Knight Silksong builds off the intriguingly enigmatic conclusion to Team Cherry's first game, with a brand-new story about an abandoned princess clawing her way to the top of a long-lost kingdom in order to reach a shining citadel. Metroidvania fans, rejoice! Our chosen one approaches, scheduled to launch for Xbox Series X|S, PS5, Nintendo Switch, and PC in 2023.</p></h3></p><br />     <p><h2>Judas</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1587/15875866/4079169-judas.jpg\" /><br /><h3><p>Judas is an upcoming narrative-driven first-person shooter from Ghost Story Games, a studio led by Ken Levine--former director of System Shock 2, BioShock, and BioShock Infinite. And you can really tell by looking at Judas, which stylistically and gameplay-wise looks a whole lot like a BioShock game. In Judas, you play as the titular character, who's stuck on a deteriorating starship. The disaster unfolding around you is your fault, and to escape the dire situation you'll have to decide if it's worth putting aside your differences with those you've tried to doom in order to work together and collectively survive. Judas is scheduled to launch for Xbox Series X|S, PS5, and PC--according to digital storefronts, it's \"coming soon,\" which could mean 2023.</p></h3></p><br />     <p><h2>Lies Of P</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1587/15875866/4079170-liesofp.jpg\" /><br /><h3><p>Lies of P is an upcoming action Souls-like from developer Neowiz. The game twists the familiar tale of Pinocchio into an even crueler, darker setting that is giving off wonderful Bloodborne vibes. You play as Pinocchio, a puppet mechanoid, who must fight their way to their father, Geppetto, in their quest to become human. To reach Geppetto, Pinocchio will have to wade through a France overrun with those who would harm him, including giant mechanical monsters and scary, rabbit mask-wearing people. Lies of P is scheduled to launch for Xbox Series X|S, Xbox One, PS5, PS4, and PC in 2023.</p></h3></p><br />     <p><h2>Life A Dragon: Ishin</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1587/15875866/4079171-likeadragon.jpg\" /><br /><h3><p> </p><p dir=\"ltr\">Like a Dragon: Ishin is an upcoming action-adventure game from developer Ryu Ga Gotoku Studio. A remake of the 2014 game of the same name, which was never released in the West, Like a Dragon: Ishin sees you play as Sakamoto Ryoma, a samurai in the 1860s who travels to Kyoto in search of his father's killer and restore his family's honor. Like a Dragon: Ishin will launch for Xbox Series X|S, Xbox One, PS5, PS4, and PC on February 21, 2023.</p></h3></p><br />     <p><h2>Minecraft Legends</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1587/15875866/4079172-minecraftlegendsshowcase_hero2-9454eb66c3871c3a8715.jpg\" /><br /><h3><p>Minecraft Legends is an upcoming action-strategy game from developers Mojang Studios and Blackbird Interactive. In Minecraft Legends, you must help the residents of Minecraft's Overworld--from terrifying skeletons to simple villagers--put aside their differences and unite under your one banner in a war against an invading army of piglins. The game will feature multiplayer too, allowing you to team up with friends in your battle against the Nether or fight against them in PvP matches. Minecraft Legends is scheduled to launch for Xbox Series X|S, Xbox One, PS5, PS4, Nintendo Switch, and PC in 2023.</p></h3></p><br />     <p><h2>Planet Of Lana</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1702/17023653/4018089-planetoflana.jpg\" /><br /><h3><p dir=\"ltr\">Planet of Lana is an upcoming puzzle-platformer from developer Wishfully. You play as a girl who, along with an adorable black-furred creature companion, sets off on an adventure to save her home, a beautiful and vibrant world of nature that has been invaded by monstrous machines that have descended from the sky. In terms of gameplay, Planet of Lana looks a lot like games like Limbo and Inside. Planet of Lana is scheduled to launch for Xbox Series X|S, Xbox One, and PC in 2023.</p></h3></p><br />     <p><h2>Ravenlok</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1587/15875866/4079173-ravenlok.jpg\" /><br /><h3><p>Ravenlok is an upcoming action-adventure RPG from developer Cococucumber. Much like Lies of P is a darker take on Pinocchio, Ravenlok is a more twisted version of Alice's Adventures in Wonderland, reimagining the story about a young girl stumbling into a magical mirror and facing off against a corrupt queen in a fantastical world. The game features Cococucumber's signature 3D pixel artstyle, which brings gorgeous detail to Ravenlok's world. Ravenlok is scheduled to launch for Xbox Series X|S, Xbox One, and PC in 2023.</p></h3></p><br />     <p><h2>Redfall</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1702/17023653/4018085-redfall.jpg\" /><br /><h3><p dir=\"ltr\">Redfall is an upcoming open-world, cooperative first-person shooter from developer Arkane Austin. Taking place in the fiction island town of Redfall, Massachusetts, Redfall sees you play as cryptozoologist Devinder Crousley, combat engineer Remi De La Rosa, ex-military sharpshooter Jacob Boyer, or biomedical engineering student Layla Ellison. The island has been invaded by vampires, who have blotted out the sun and cut off any-and-all escape. Utilizing an assortment of firearms, high-tech gadgets, and mutant abilities, you have to find a way to survive long enough to eradicate the vampires for good. Redfall is scheduled to launch for Xbox Series X|S, Xbox One, and PC in 2023.</p></h3></p><br />     <p><h2>Replaced</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1587/15875866/4079174-replaced.jpg\" /><br /><h3><p>Replaced is an upcoming action-platformer from developer Sad Cat Studios. Stylized in an incredible-looking 2.5D pixel artstyle, Replaced sees you play as an AI trapped within a human body who lives in a retro-futuristic sci-fi variation of the 1980s. As an AI, your struggles to adapt to human life leads to one problem after another, including violent outlaws and greedy corporations. Replaced is scheduled to launch for Xbox Series X|S, Xbox One, and PC in 2023.</p></h3></p><br />     <p><h2>Resident Evil 4</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1587/15875866/4079175-re4.jpg\" /><br /><h3><p>Resident Evil 4 is an upcoming survival-horror game from developer Capcom. A remake of the 2005 game of the same name, Resident Evil 4 puts you back in the well-tailored shoes of Leon S. Kennedy, who travels to a Spanish village that's dominated by a violent cult in order to rescue Ashley graham, the daughter of the US president. Like the Resident Evil remakes before it, Resident Evil 4 adds some new mechanics to its survival-horror formula, such as a parry system, and enhances the visuals to match current-day standards. Resident Evil 4 is scheduled to launch for Xbox Series X|S, PS5, PS4, and PC on March 24, 2023.</p></h3></p><br />     <p><h2>Senua's Saga: Hellblade II</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1702/17023653/4018077-senuasagehellblade2.jpg\" /><br /><h3><p dir=\"ltr\">Senua's Saga: Hellblade II is an upcoming action-adventure game from developer Ninja Theory. Like the first game, Hellblade II takes place in a fantastical rendition of the 8th century, taking inspiration from Norse mythology and Celtic culture. Once again, we're playing as Senua, who has come to accept her mental illness as a part of her. We know very little about what she's up to this time around, though the gameplay reveal trailer for Hellblade II does seem to hint that Senua is the head of her own tribe now and this next adventure will see her face the struggles that come with leadership. Senua's Saga: Hellblade II is scheduled to launch for Xbox Series X|S and PC--it does not yet have a release window.</p></h3></p><br />     <p><h2>Stalker 2: Heart Of Chornobyl</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1702/17023653/4018084-stalker2.jpg\" /><br /><h3><p dir=\"ltr\">Stalker 2: Heart of Chornobyl is an upcoming survival-horror first-person shooter with RPG elements from developer GSC Game World. In the long-awaited sequel to 2007's Stalker: Shadow of Chernobyl, you once again delve into the irradiated remains of the Chornobyl Exclusion Zone in search of valuable artifacts. Featuring a non-linear story in an open-world setting, Stalker 2 features dangerous anomalies to navigate, frightening mutants to shoot, and characters to meet. Stalker 2: Heart of Chornobyl is scheduled to launch for Xbox Series X|S and PC in 2023.</p></h3></p><br />     <p><h2>Starfield</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1702/17023653/4018086-starfield.jpg\" /><br /><h3><p dir=\"ltr\">Starfield is an upcoming action-RPG from developer Bethesda Softworks, the first new intellectual property developed by the studio in over <em>25 years</em>. In Starfield, you customize your own space explorer and then set out into a solar system that's enjoyed 20 years of uneasy peace following a war between the United Colonies and Freestar Collective. Like in the Fallout and The Elder Scrolls games, Starfield's story is heavily defined by role-play, allowing you to shape your story with dialogue decisions and allying with different factions. Starfield is scheduled to launch for Xbox Series X|S and PC in 2023.</p></h3></p><br />     <p><h2>Star Wars Jedi: Survivor</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1587/15875866/4079176-star-wars-jedi-survivor.jpg\" /><br /><h3><p> Star Wars Jedi: Survivor is an upcoming action game from developer Respawn Entertainment. The sequel to 2019's Star Wars Jedi: Fallen Order sees protagonist Cal Kestis five years older and still in hiding from the Galactic Empire. Armed with a crossguard lightsabers, new Force powers and parkour abilities, and a healthy variety of animal mounts, Cal finds himself fending off Jedi-killing bounty hunters, Stormtroopers, and dangerous droids in his continued fight to take down the Empire. Star Wars Jedi: Survivor is scheduled to launch for Xbox Series X|S, PS5, and PC on March 17, 2023.</p></h3></p><br />     <p><h2>Street Fighter 6</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1587/15875866/4079177-street.jpg\" /><br /><h3><p>Street Fighter 6 is an upcoming fighting game from developer Capcom. The game features a starting base roster of 18 characters, six of which--Jamie, JP, Kimberly, Lily, Manon, and Marisa--are new to the series. Street Fighter 6 is scheduled to launch for Xbox Series X|S, PS5, PS4, and PC on June 2, 2023.</p></h3></p><br />     <p><h2>Suicide Squad: Kill The Justice League</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1587/15875866/4079178-suicide.jpg\" /><br /><h3><p>Suicide Squad: Kill the Justice League is an upcoming action-adventure third-person shooter from developer Rocksteady Studios. In it, you and up to four friends can play as long-standing members of Task Force X--Deadshot, King Shark, Harley Quinn, and Captain Boomerang--who have been assigned to kill the mind-controlled members of the Justice League. Each member of Task Force X uses a unique weapon and possesses a different way of getting around the open-world setting of Metropolis, which is now full of aliens that need killing. Suicide Squad: Kill the Justice League is scheduled to launch for Xbox Series X|S, PS5, and PC in 2023.</p></h3></p><br />     <p><h2>The Finals</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1587/15875866/4041155-thefinals.png\" /><br /><h3><p>The Finals is an upcoming first-person shooter from developer Embark Studios. This free-to-play shooter has you compete in a virtual game show, where contestants battle it out in <em>very </em>destructible environments--these former Battlefield devs are turning that destructible dial up to 11. To win, you and your teammates have to find and secure vaults of cash, demolishing anyone who tries to stop you. Alongside the destructible buildings, The Finals' interactive environments are a virtual playground of possibility, especially with the use of advanced gadgets like a grappling hook and Prey-like glue gun. The Finals is scheduled to launch for Xbox Series X|S, PS5, and PC--digital storefronts list that it's \"coming soon.\"</p></h3></p><br />     <p><h2>The Invincible</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1587/15875866/4079179-the_invincible.png\" /><br /><h3><p>The Invincible is an upcoming first-person adventure game from developer Stalward Industries. Inspired by the 1967 sci-fi novel of the same name, The Invincible sees you play as Yasna, a scientist stationed on Regis III who can't remember much beyond her name. Your entire crew is gone and you set out in search of them, reporting what you find to your Astrogator, who remains a faceless voice on a radio you carry with you. Big Firewatch vibes with this one, though the atompunk atmosphere of the game seems to make for an even more chilling experience. The Invincible is scheduled to launch for Xbox Series X|S, PS5, and PC in 2023.</p></h3></p><br />     <p><h2>Thirsty Suitors</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1587/15875866/3988909-ts_screen07.jpg\" /><br /><h3><p> </p><p dir=\"ltr\">Thirsty Suitors is an upcoming adventure game from Outerloop Games. You play as Jala, who returns home to attend her sister's wedding and take some time to learn self-love and find herself. This quest will see her contending with her demanding parents, skateboarding around town, learning to cook, and hashing things out with her numerous ex-partners in colorful turn-based battles. Thirsty Suitors is scheduled to launch for Xbox Series X|S, Xbox One, PS5, PS4, Nintendo Switch, and PC in 2023.</p></h3></p><br />", "link": "https://www.gamespot.com/gallery/the-most-anticipated-xbox-games-of-2023-and-beyond/2900-4252/", "date_published": "2022-12-20 00:58:00+00:00", "persistent": false, "user": null, "language": "en-US"}]