[{"source": "https://www.engadget.com/rss.xml", "title": "The EU is investigating Broadcom's $61 billion deal to buy VMware", "description": "<p>The European Union plans to carry out a full-scale investigation of Broadcom's <a href=\"https://www.engadget.com/broadcom-buys-vmware-125814712.html\">$61 billion bid</a> to buy VMware. Following a preliminary probe, the European Commission, the bloc's executive branch, <a href=\"https://ec.europa.eu/commission/presscorner/detail/en/ip_22_7835\">announced on Tuesday</a> it believes the proposed acquisition may allow Broadcom to &quot;restrict competition&quot; in the markets for network interface cards, fiber channel host-bus adapters and storage adapters.</p><p>Specifically, the EU is concerned Broadcom may harm competition in those markets by limiting interoperability between rival hardware and VMware's server virtualization software. It also worries the company could either prevent or degrade access to VMware's software. The European Commission warns those actions &quot;could lead to higher prices, lower quality and less innovation for business customers, and ultimately consumers.&quot;</p><span id=\"end-legacy-contents\"></span><p>The Commission will also investigate whether Broadcom could hinder rivals like NVIDIA and Intel from developing their own smart network interface cards. Here it points to VMWare's involvement in <a href=\"https://blogs.vmware.com/vsphere/2020/09/announcing-project-monterey-redefining-hybrid-cloud-architecture.html\">Project Monterey</a>, an industry-wide effort the company announced in 2020. &quot;Broadcom may decrease VMware's involvement in Project Monterey to protect its own NICs revenues,&quot; the Commission notes. &quot;This could hamper innovation to the detriment of customers.&quot; Another concern is that Broadcom could start bundling VMware's virtualization software with its own mainframe and security tools, a move that would reduce choice in the market.</p><p>As one of the larger tech acquisitions of 2022, Broadcom's bid to buy VMware was certain to draw scrutiny. The European Commission won't necessarily block the deal, but the investigation could significantly delay the transaction and force concessions out of Broadcom. With today's announcement, the Commission has 90 working days or until May 11th, 2023, to make a decision. If the deal were to fall through, it would be a bitter repeat of Broadcom's 2018 attempt to buy chipmaker Qualcomm. While the circumstances and concerns were different, the company was forced to abandon the takeover after the Trump administration <a href=\"https://www.engadget.com/2018-03-12-trump-blocks-broadcom-takeover-of-qualcomm.html\">blocked the transaction</a>.</p>", "link": "https://www.engadget.com/eu-investigating-broadcoms-61-billion-deal-buy-v-mware-234418707.html?src=rss", "date_published": "2022-12-20 23:44:18+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "Delta will reportedly offer free WiFi starting next year", "description": "<p>Delta Air Lines reportedly plans to offer free WiFi to all its passengers as soon as next year, <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy53c2ouY29tL2FydGljbGVzL2RlbHRhLWFpci1saW5lcy10by1yb2xsLW91dC1mcmVlLXdpLWZpLTExNjcxNTUyNzg1P3BhZ2U9MSIsImNvbnRlbnRVdWlkIjoiMGRlNzNiMDAtZmJlYS00NGJkLThiZWMtMmQ5YWJhNzYxZjQ0In0&amp;signature=AQAAAVeChl7FeVKTkF8hRdRYX19IgZTl1wdlayixcOLRegwO&amp;gcReferrer=https%3A%2F%2Fwww.wsj.com%2Farticles%2Fdelta-air-lines-to-roll-out-free-wi-fi-11671552785%3Fpage%3D1\">according to</a> the <em>Wall Street Journal</em>. The airline is already testing free wireless internet for members of its frequent-flier program, and it's expected to expand significantly through 2023.</p><p>According to the report, Delta will start rolling out free WiFi “on a significant portion of its airplanes” before expanding the service to more of its fleet later next year. Once the program is available for all passengers, it will likely require a SkyMiles loyalty number to get online.</p><span id=\"end-legacy-contents\"></span><p>CEO Ed Bastian first announced the airline’s goal of free wireless access in 2018, and it recently stepped up testing. It currently uses <a href=\"https://www.engadget.com/2018-02-27-viasat-fastest-satellite-internet-us-via-sat-2.html\">Viasat</a> and Intelsat (<a href=\"https://www.engadget.com/gogo-rebrand-intelsat-airplane-wifi-193059353.html\">formerly Gogo</a>) for internet access, and it reportedly plans to equip most of its US domestic fleet with Viasat service by the end of this year. JetBlue is the only major US airline currently offering <a href=\"https://www.engadget.com/2017-01-11-jetblue-fly-fi-broadband-free-every-flight.html\">free WiFi for all passengers</a>.</p><p>The airline industry has tried for years to improve WiFi, testing with various providers and business models. However, the result is still a mess for customers: You might end up with different online requirements and pricing on two legs of the same flight, even with the same airline. Hopefully, Delta’s move will force other airlines to compete with free WiFi of their own — while cleaning up the process of accessing it.</p>", "link": "https://www.engadget.com/delta-free-wifi-2023-224010550.html?src=rss", "date_published": "2022-12-20 22:40:10+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "Lionel Messi's World Cup celebration is now the most-liked post on Instagram", "description": "<p>Soccer megastar Lionel Messi finally secured the one prize that had eluded him during his illustrious career this weekend when Argentina won the World Cup. Afterward, the best player of the 21st century (yeah, I said it) added another record to his resume, as he now has <a href=\"https://www.instagram.com/p/CmUv48DLvxd/\"><ins>the most-liked post</ins></a> on <a href=\"https://www.engadget.com/tag/instagram/\"><ins>Instagram</ins></a>.</p><p>Messi posted a slideshow of him and his teammates celebrating after winning the World Cup. At the time of writing, the post has more than 65.8 million likes. <a href=\"https://www.engadget.com/2019-01-14-egg-versus-jenner.html\"><ins>The previous record-holder</ins></a>, a <a href=\"https://www.instagram.com/p/BsOGulcndj-/\"><ins>stock photo</ins></a> of an egg, claimed the top spot in early 2019 and currently has north of 57.3 million likes.</p><span id=\"end-legacy-contents\"></span><div id=\"fae8cbde0a94427f98c9b03dafbc2fdf\"><blockquote class=\"instagram-media\" style=\"border: 0; margin: 1px; padding: 0; width: 99.375%;\"><div style=\"padding: 16px;\"><a href=\"https://www.instagram.com/p/CmUv48DLvxd/?utm_source=ig_embed&amp;utm_campaign=loading\" style=\"padding: 0 0; text-align: center; text-decoration: none; width: 100%;\" target=\"_blank\"><div style=\"display: flex;\"><div style=\"background-color: #F4F4F4; height: 40px; margin-right: 14px; width: 40px;\"></div><div style=\"display: flex;\"><div style=\"background-color: #F4F4F4; height: 14px; margin-bottom: 6px; width: 100px;\"></div><div style=\"background-color: #F4F4F4; height: 14px; width: 60px;\"></div></div></div><div style=\"padding: 19% 0;\"></div><div style=\"display: block; height: 50px; margin: 0 auto 12px; width: 50px;\"></div><div style=\"padding-top: 8px;\"><div style=\"color: #3897f0; font-family: Arial, sans-serif; font-size: 14px; font-style: normal;\">View this post on Instagram</div></div><div style=\"padding: 12.5% 0;\"></div><div style=\"display: flex; margin-bottom: 14px;\"><div><div style=\"background-color: #F4F4F4; height: 12.5px; width: 12.5px;\"></div><div style=\"background-color: #F4F4F4; height: 12.5px; width: 12.5px; margin-right: 14px; margin-left: 2px;\"></div><div style=\"background-color: #F4F4F4; height: 12.5px; width: 12.5px;\"></div></div><div style=\"margin-left: 8px;\"><div style=\"background-color: #F4F4F4; height: 20px; width: 20px;\"></div><div style=\"width: 0; height: 0; border-top: 2px solid transparent; border-left: 6px solid #f4f4f4; border-bottom: 2px solid transparent;\"></div></div><div style=\"margin-left: auto;\"><div style=\"width: 0px; border-right: 8px solid transparent;\"></div><div style=\"background-color: #F4F4F4; height: 12px; width: 16px;\"></div><div style=\"width: 0; height: 0; border-left: 8px solid transparent;\"></div></div></div><div style=\"display: flex; margin-bottom: 24px;\"><div style=\"background-color: #F4F4F4; height: 14px; margin-bottom: 6px; width: 224px;\"></div><div style=\"background-color: #F4F4F4; height: 14px; width: 144px;\"></div></div></a><p style=\"color: #c9c8cd; font-family: Arial, sans-serif; font-size: 14px; margin-bottom: 0; margin-top: 8px; overflow: hidden; padding: 8px 0 7px; text-align: center; white-space: nowrap;\"><a href=\"https://www.instagram.com/p/CmUv48DLvxd/?utm_source=ig_embed&amp;utm_campaign=loading\" style=\"color: #c9c8cd; font-family: Arial, sans-serif; font-size: 14px; font-style: normal; font-weight: normal; text-decoration: none;\" target=\"_blank\">A post shared by Leo Messi (@leomessi)</a></p></div></blockquote></div><p>It's not super surprising that Messi broke the Instagram record. As <a href=\"https://www.theverge.com/2022/12/20/23519016/instagram-lionel-messi-most-liked-record-egg\"><em><ins>The Verge</ins></em></a> points out, the majority of the most-liked posts on the platform are from footballers, with the Paris Saint-Germain forward holding eight of the top 20 spots.&nbsp;</p><p>Messi is also the second most-followed person on the platform with 404 million followers. Instagram's own official account has the most followers overall. In second place, one spot ahead of Messi, is his old rival Cristiano Ronaldo with 520 million followers. Bet he'd rather have a World Cup, though.</p>", "link": "https://www.engadget.com/lionel-messi-instagram-record-world-cup-220050247.html?src=rss", "date_published": "2022-12-20 22:00:50+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "OpenAI releases Point-E, which is like DALL-E but for 3D modeling", "description": "<p>OpenAI, the Elon Musk-founded artificial intelligence startup behind popular DALL-E text-to-image generator, <a href=\"https://arxiv.org/pdf/2212.08751.pdf\">announced on Tuesday</a> the release of its newest picture-making machine POINT-E, which can produce 3D point clouds directly from text prompts. Whereas existing systems like Google's DreamFusion typically require multiple hours — and GPUs — to generate their images, Point-E only needs one GPU and a minute or two.</p><figure><img alt=\"There's a corgi in a santa hat, an \" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/e5baaea0-8096-11ed-87ef-9629c78ed7e6\" /><figcaption></figcaption><div class=\"photo-credit\">OpenAI</div></figure><p>3D modeling is used across a variety industries and applications. The CGI effects of modern movie blockbusters, video games, VR and AR, NASA's <a href=\"https://www.engadget.com/2019-06-11-nasa-innovative-advanced-concepts-phase-three.html\">moon crater mapping missions</a>, Google's <a href=\"https://www.engadget.com/2020-01-29-google-heritage-on-the-edge-3d-scans.html\">heritage site preservation projects</a>, and <a href=\"https://www.engadget.com/how-meta-flunked-its-first-year-as-a-metaverse-company-150049067.html\">Meta's vision for the Metaverse</a> all hinge on 3D modeling capabilities. However, creating photorealistic 3D images is still a resource and time consuming process, despite <a href=\"https://www.engadget.com/nvidia-ai-model-get3d-virtual-worlds-objects-130021127.html\">NVIDIA's work to automate object generation</a> and Epic Game's <a href=\"https://www.engadget.com/epic-games-realityscan-ios-213549896.html\">RealityCapture mobile app</a>, which allows anyone with an iOS phone to scan real-world objects as 3D images.&nbsp;</p><span id=\"end-legacy-contents\"></span><p>Text-to-Image systems like OpenAI's DALL-E 2 and Craiyon, DeepAI, Prisma Lab's Lensa, or HuggingFace's Stable Diffusion, have rapidly gained popularity, notoriety and <a href=\"https://www.engadget.com/dall-e-generative-ai-tracking-data-privacy-160034656.html\">infamy in recent years</a>. Text-to-3D is an offshoot of that research. Point-E, unlike similar systems, &quot;leverages a large corpus of (text, image) pairs, allowing it to follow diverse and complex prompts, while our image-to-3D model is trained on a smaller dataset of (image, 3D) pairs,&quot; the OpenAI research team led by Alex Nichol wrote in <a href=\"https://arxiv.org/pdf/2212.08751.pdf\">Point·E: A System for Generating 3D Point Clouds from Complex Prompts</a>, published last week. &quot;To produce a 3D object from a text prompt, we first sample an image using the text-to-image model, and then sample a 3D object conditioned on the sampled image. Both of these steps can be performed in a number of seconds, and do not require expensive optimization procedures.&quot;</p><figure><img alt=\"Point-E\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/9e7ed450-80a3-11ed-b7ff-7feee7f1a132\" /><figcaption></figcaption><div class=\"photo-credit\">OpenAI</div></figure><p>If you were to input a text prompt, say, &quot;A cat eating a burrito,&quot; Point-E will first generate a synthetic view 3D rendering of said burrito-eating cat. It will then run that generated image through a series of diffusion models to create the 3D, RGB point cloud of the initial image — first producing a coarse 1,024-point cloud model, then a finer 4,096-point. &quot;In practice, we assume that the image contains the relevant information from the text, and do not explicitly condition the point clouds on the text,&quot; the research team points out.&nbsp;</p><p>These diffusion models were each trained on &quot;millions&quot; of 3d models, all converted into a standardized format. &quot;While our method performs worse on this evaluation than state-of-the-art techniques,&quot; the team concedes, &quot;it produces samples in a small fraction of the time.&quot; If you'd like to try it out for yourself, OpenAI has posted the projects open-source code on <a href=\"https://github.com/openai/point-e\">Github</a>.</p>", "link": "https://www.engadget.com/openai-releases-point-e-dall-e-3d-text-modeling-210007892.html?src=rss", "date_published": "2022-12-20 21:15:07+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "Apple adds M1 Mac desktops and Studio Display to the Self Service Repair program", "description": "<p>Apple has expanded its self-repair program once again. As noted by <a href=\"https://sixcolors.com/link/2022/12/apples-self-repair-program-adds-mac-desktops/\"><em>Six Colors</em></a> and <a href=\"https://www.theverge.com/2022/12/20/23519059/apple-self-service-repair-imac-mac-mini-studio-now-available\"><em>The Verge</em></a>, folks in the US can now try to fix issues with the <a href=\"https://www.engadget.com/apple-imac-m1-review-24-inch-portable-desktop-130026556.html\">M1 iMac</a>, M1 Mac mini, <a href=\"https://www.engadget.com/apple-mac-studio-review-m1-ultra-desktop-130044054.html\">Mac Studio</a> and <a href=\"https://www.engadget.com/apple-studio-display-review-mac-monitor-154504997.html\">Apple Studio Display</a> themselves with genuine parts, repair manuals and tools.</p><p>The self-repair program is designed for those who have the time, patience, skills and confidence to carry out fixes at home, rather than taking their busted device to an Apple Store or third-party repair shop, or shipping it to Apple. You can buy all the parts and rent the tools you need, but at checkout you'll need to enter a code from the relevant manual to show that you've actually read the document.</p><span id=\"end-legacy-contents\"></span><p>Apple debuted the Self Service Repair program in April by offering manuals and parts <a href=\"https://www.engadget.com/apple-self-service-repair-release-date-122332505.html\">for select iPhone models</a> in the US. Since then, it has expanded the program to <a href=\"https://www.engadget.com/apple-self-service-repair-macbook-air-pro-133326786.html\">Mac laptops</a> and more <a href=\"https://www.engadget.com/apple-opens-self-service-repair-in-europe-to-let-customers-fix-their-own-devices-112500379.html\">territories</a>.&nbsp;</p><p>Apple <a href=\"https://www.engadget.com/apple-user-iphone-repair-policy-change-173047862.html\">introduced the program</a> ahead of right-to-repair rules likely coming into force <a href=\"https://www.engadget.com/biden-right-to-repair-ftc-apple-microsoft-214015408.html\">in the US</a> and <a href=\"https://www.engadget.com/2020-03-11-eu-right-to-repair-phones-tablets-computers.html\">Europe</a>. In 2021, President Joe Biden <a href=\"https://www.engadget.com/biden-executive-order-call-for-reinstating-net-neutrality-141029471.html\">signed an executive order</a> focused on bolstering competition in the US economy, partly in the tech sector. Among other things, it urged the Federal Trade Commission to ban &quot;anticompetitive restrictions on using independent repair shops or doing DIY repairs of your own devices and equipment.&quot;&nbsp;</p><p>The agency has taken a stronger stance on such issues. In July, it <a href=\"https://www.ftc.gov/business-guidance/blog/2022/07/ftc-announces-three-right-repair-cases-do-your-warranties-comply-law\">announced settlements</a> with three companies (including Weber and Harley-Davidson), which it accused of threatening to unlawfully void warranties if consumers used third-party repair parts or independent repair shops.</p>", "link": "https://www.engadget.com/apple-m1-mac-desktops-studio-display-self-service-repair-205016531.html?src=rss", "date_published": "2022-12-20 20:50:16+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "Congress attempts to ban TikTok on government devices as part of $1.7 trillion spending bill", "description": "<p>After obtaining <a href=\"https://www.engadget.com/us-senate-approves-bill-ban-tiktok-government-devices-075852696.html\">Senate approval last week</a>, the No TikTok on Government Devices Act could become law thanks to the <a href=\"https://www.cbsnews.com/news/budget-congress-proposed-1-7-trillion-partial-government-shutdown/\">$1.7 trillion spending bill</a> federal lawmakers unveiled early Tuesday morning. In addition to allocating more funding for Ukraine and earmarking $40 billion for natural disaster recovery efforts across the US, the sprawling <a href=\"https://www.appropriations.senate.gov/imo/media/doc/JRQ121922.PDF\">4,155-page bill</a> includes provisions that would prohibit the use of TikTok on government-owned phones and other devices.</p><p>While some Republican lawmakers are <a href=\"https://www.engadget.com/senate-house-tiktok-ban-bill-anti-social-ccp-act-205120387.html/\">pushing for a country-wide ban</a> on TikTok, the spending bill stops short of prohibiting all government use of TikTok. If passed, the legislation would order the General Services Administration and Office of Management and Budget to create guidelines for staff at executive agencies to remove TikTok from government-owned devices by mid-February. The draft legislation allows congressional staff and elected officials to continue using the app. It also carves out some exceptions for law enforcement agents and officials.</p><span id=\"end-legacy-contents\"></span><div id=\"e54cf79569324369bdcde493a22edca3\"><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">The ban on TikTok on government  devices has ended up in the omnibus. <br /><br />This was a Josh Hawley bill. Pelosi pushed for it in the omni <a href=\"https://t.co/gpBZ8zFC7Y\">pic.twitter.com/gpBZ8zFC7Y</a></p>— Jake Sherman (@JakeSherman) <a href=\"https://twitter.com/JakeSherman/status/1605126233406246913?ref_src=twsrc%5Etfw\">December 20, 2022</a></blockquote></div><p>&quot;We're disappointed that Congress has moved to ban TikTok on government devices — a political gesture that will do nothing to advance national security interests — rather than encouraging the Administration to conclude its national security review,&quot; TikTok spokesperson Brooke Oberwetter told Engadget.</p><p>&quot;The agreement under review by [The Committee on Foreign Investment in the United States] will meaningfully address any security concerns that have been raised at both the federal and state level. These plans have been developed under the oversight of our country's top national security agencies — plans that we are well underway in implementing — to further secure our platform in the United States, and we will continue to brief lawmakers on them.&quot;</p><p>The proposed ban comes after at least 11 states, including <a href=\"https://www.engadget.com/georgia-tiktok-wechat-telegram-ban-211015416.html\">Georgia</a> and <a href=\"https://www.engadget.com/south-dakota-bans-tiktok-from-government-owned-devices-093526831.html\">South Dakota</a>, prohibited TikTok on government-owned devices. Political concerns over TikTok hit a high earlier this month after FBI Director Chris Wray said China could use the app to collect user data. TikTok has tried to address those concerns. As of June, the app began <a href=\"https://www.engadget.com/tiktok-user-data-us-200500287.html/\">routing all domestic traffic</a> through Oracle servers in the US. At the same time, TikTok and parent company ByteDance pledged to delete US user data from their own data servers in the US and Singapore.</p>", "link": "https://www.engadget.com/congress-attempts-ban-tiktok-on-government-devices-through-17-trillion-spending-bill-204028363.html?src=rss", "date_published": "2022-12-20 20:40:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "Ubisoft explains how Stadia users can get free PC copies of games", "description": "<p>After Google announced <a href=\"https://www.engadget.com/google-shutting-down-stadia-162704135.html\">Stadia's shutdown</a> earlier this year, Ubisoft said it would help users <a href=\"https://www.engadget.com/stadia-shut-down-google-ubisoft-connect-pc-gaming-184117918.html\">transfer their purchases to PC</a>. We got more detail today, as the publisher <a href=\"https://news.ubisoft.com/en-ca/article/3NThAYm8CVEXa7IAw11oFg/whats-next-for-stadia-players-ubisoft-games-and-subscriptions\">says</a> it will provide free PC versions of all Ubisoft games bought on Stadia. The publisher also has other perks to make the transition as smooth as possible for jilted users of Google's platform.</p><p>Anyone who bought Ubisoft games on Stadia should see the PC versions of those games appear in their Ubisoft Connect accounts at no extra cost. If your Stadia and Ubisoft accounts aren’t yet linked, connect them before Stadia shuts down on January 18th to get the PC games. Additionally, if you played Ubisoft games with cross-progression (<a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy51Ymlzb2Z0LmNvbS9lbi1jYS9oZWxwL2Nvbm5lY3Rpdml0eS1hbmQtcGVyZm9ybWFuY2UvYXJ0aWNsZS9jcm9zcy1wcm9ncmVzc2lvbi1mb3ItY2xvdWQtYWNjZXNzLXdpdGgtdWJpc29mdC8wMDAwNzkyMDM_aXNTc289dHJ1ZSZjb25uZWN0U3NvSWQ9VVlQMWxCJTJGbG1vcktDakRlYTY5Snc4a1p3R29qMFJab1AlMkI3dm1wckFsem8lM0QmcmVmcmVzaFN0YXR1cz1vayIsImNvbnRlbnRVdWlkIjoiOTZjMTVlZDMtODZhMi00NTA3LTliNzMtMGVlMjhmMjdmMzlhIn0&amp;signature=AQAAARyFn1WRmreHiVQUPMVG9mBlgRm3KgJ_A3-XQrpKm67K&amp;gcReferrer=https%3A%2F%2Fwww.ubisoft.com%2Fen-ca%2Fhelp%2Fconnectivity-and-performance%2Farticle%2Fcross-progression-for-cloud-access-with-ubisoft%2F000079203%3FisSso%3Dtrue%26connectSsoId%3DUYP1lB%252FlmorKCjDea69Jw8kZwGoj0RZoP%252B7vmprAlzo%253D%26refreshStatus%3Dok\">complete list</a>), you can pick up your progress on PC where you left off on Stadia.</p><span id=\"end-legacy-contents\"></span><p>Ubisoft notes any unspent virtual currency won’t transfer. Still, if you use it in Stadia before January 18th, the purchased items will move to PC (but only for games supporting cross-progression). Meanwhile, Stadia gamers who subscribed to Ubisoft+ Multi-Access (the company's plan that lets you play on multiple devices) will receive an email telling them how to sign up directly through the Ubisoft+ website. As a bonus, subscribers will also get a free month of Ubisoft+. The publisher notes that US residents can continue streaming Ubisoft+ games through <a href=\"https://www.engadget.com/luna-amazon-cloud-gaming-interview-pwa-apple-173948922.html\">Amazon Luna</a>, and those living elsewhere will get a discount on Ubisoft+ Multi-Access for six months. Additionally, If you bought or subscribed to any Ubisoft content on Stadia, you'll receive one free month of <a href=\"https://www.engadget.com/nvidia-geforce-now-rtx-3080-monthly-plan-165932532.html\">GeForce Now Priority</a>.</p><p>The perks are on top of Google's refunds for all game purchases, so Ubisoft's PC games are a no-charge consolation prize. Investing in a cloud-gaming platform requires customers to trust that their purchases won’t be all for naught if the platform fails, but at least Google and its partners are doing what they can to make it right.</p>", "link": "https://www.engadget.com/ubisoft-stadia-pc-games-free-transition-shutdown-202026044.html?src=rss", "date_published": "2022-12-20 20:20:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "NASA's InSight lander says goodbye from Mars", "description": "<p>This is likely the final photo that NASA's Mars InSight lander will ever send back to Earth. The robot has been snapping pics and gathering data about the Martian environment since landing on the planet in November 2018 — and it's been steadily accumulating dust on its solar panels that entire time. As <a href=\"https://www.engadget.com/nasa-mars-insight-lander-farewell-095620031.html\">NASA predicted</a> earlier this year, the layer of debris has finally become too thick for the solar panels to operate. The InSight Twitter account officially said goodbye on December 19th with a final image from the surface of Mars.</p><p>&quot;My power’s really low, so this may be the last image I can send,&quot; the tweet reads. &quot;Don’t worry about me though: my time here has been both productive and serene. If I can keep talking to my mission team, I will – but I’ll be signing off here soon. Thanks for staying with me.&quot;</p><span id=\"end-legacy-contents\"></span><p>You're welcome, metal astronaut.</p><div id=\"63aba47851f64d20a4dfee1be4358d95\"><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">My power’s really low, so this may be the last image I can send. Don’t worry about me though: my time here has been both productive and serene. If I can keep talking to my mission team, I will – but I’ll be signing off here soon. Thanks for staying with me. <a href=\"https://t.co/wkYKww15kQ\">pic.twitter.com/wkYKww15kQ</a></p>— NASA InSight (@NASAInSight) <a href=\"https://twitter.com/NASAInSight/status/1604955574659035136?ref_src=twsrc%5Etfw\">December 19, 2022</a></blockquote></div><p>InSight touched down on Mars on November 26th, 2018. It set up a seismometer on the Martian surface and collected data about marsquakes, which helped NASA scientists compile a clearer picture of the planet's interior structure. Over the past four years, InSight provided data on more than 500 quakes and at least one <a href=\"https://www.engadget.com/nasa-insight-lander-meteoroid-impact-mars-192030510.html\">meteoroid impact</a>. From these reports, NASA researchers concluded Mars' core is about half the size of Earth's and likely composed of lighter elements than previously thought.</p><p>NASA announced in May 2022 that InSight would likely go dark by the end of the summer, due to the dust settling on the lander's solar panels. InSight had recently celebrated its fourth anniversary on Mars when it stopped communicating with NASA. In <a href=\"https://blogs.nasa.gov/insight/2022/12/19/nasa-insight-dec-19-2022/\">a blog update</a> on December 19th, the agency said the following:</p><p>&quot;On Dec. 18, 2022, NASA’s InSight did not respond to communications from Earth. The lander’s power has been declining for months, as expected, and it’s assumed InSight may have reached its end of operations. It’s unknown what prompted the change in its energy; the last time the mission contacted the spacecraft was on Dec. 15, 2022. The mission will continue to try and contact InSight.&quot;</p>", "link": "https://www.engadget.com/nasa-mars-insight-lander-rip-194514276.html?src=rss", "date_published": "2022-12-20 19:45:14+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "An algorithm can use WiFi signal changes to help identify breathing issues", "description": "<p>National Institute of Standards and Technology (<a href=\"https://www.engadget.com/tag/nist/\"><ins>NIST</ins></a>) researchers have developed a way to monitor breathing based on tiny changes in <a href=\"http://engadget.com/tag/wifi/\"><ins>WiFi</ins></a> signals. They say their BreatheSmart deep-learning algorithm could help detect if someone in the household is having breathing issues.</p><p>WiFi signals are almost ubiquitous. They bounce off of and pass through surfaces as they try to link devices with routers. But any movement will alter the signal's path, including how the body moves as we breathe, which can change if we have any issues. For instance, your chest will move differently if you're coughing.</p><span id=\"end-legacy-contents\"></span><p>Other researchers have explored the use of WiFi signals to detect people and movements, but their approaches required dedicated sensing devices and their studies provided limited data. A few years ago, a company called Origin Wireless <a href=\"https://www.engadget.com/2017-10-09-origin-wireless-motion-detection-breathing-rate-sensor.html\"><ins>developed</ins></a> an algorithm that works with a <a href=\"https://www.engadget.com/2018-06-06-origin-wireless-wifi-mesh-motion-fall-sleep-detection.html\"><ins>WiFi mesh network</ins></a>. Similarly, NIST says BreatheSmart works with routers and devices that are already available on the market. It only requires a single router and connected device.</p><p>The scientists changed the firmware on a router so that it would check &quot;channel state information,” or CSI, more frequently. CSI refers to the signals that are sent from a device, such as a phone or laptop, to the router. CSI signals are consistent and the router understands what they should look like, but deviations in the environment, such as the signal being affected by surfaces or movement, modify the signals. The researchers got the router to request these CSI signals up to 10 times per second to gain a better sense of how the signal was being modified.</p><p>The team simulated several breathing conditions with a manikin and monitored changes in CSI signals with an off-the-shelf router and receiving device. To make sense of the data they collected, NIST research associate Susanna Mosleh developed the algorithm. <a href=\"https://ieeexplore.ieee.org/document/9989347\"><ins>In a paper</ins></a>, the researchers noted that BreatheSmart correctly identified the simulated breathing conditions 99.54 percent of the time.</p><p>Mosleh and Jason Coder, who heads up NIST’s research in shared spectrum metrology, hope developers will be able to use their research to create software that can <a href=\"https://www.engadget.com/mit-csail-coronavirus-patient-monitoring-device-190037775.html\"><ins>remotely monitor a person's breathing</ins></a> with existing hardware. “All the ways we’re gathering the data is done on software on the access point (in this case, the router), which could be done by an app on a phone,” Coder said. “This work tries to lay out how somebody can develop and test their own algorithm. This is a framework to help them get relevant information.”</p>", "link": "https://www.engadget.com/wifi-signal-breathing-algorithm-nist-191032955.html?src=rss", "date_published": "2022-12-20 19:10:32+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "SEC deposition shows Zuckerberg misled Congress about Cambridge Analytica timeline", "description": "<p>Meta CEO Mark Zuckerberg misled Congress and the American public about how early he knew about the threat Cambridge Analytica posed to Facebook user privacy, according to a newly published <a href=\"https://the-citizens.com/wp-content/uploads/2022/12/22-00038-REMD-Releasable-transcript-copy.pdf\">US Securities and Exchange Commission document</a>. The sworn deposition was <a href=\"https://rfob.medium.com/sec-testimony-obtained-by-rfob-shows-zuckerberg-misled-congress-knew-far-more-about-cambridge-48b3489e907b\">obtained by Zamaan Qureshi</a>, a policy advisor with the <a href=\"https://www.engadget.com/facebook-advisory-board-critics-155625348.html\">Real Facebook Oversight Board</a>.&nbsp;</p><p>In 2019, Zuckerberg told the SEC he was aware of Cambridge Analytica at least as early as 2017. At the start of that year, Zuckerberg sent an email to Facebook staff asking about an article <a href=\"https://www.vice.com/en/article/mg9vvn/how-our-likes-helped-trump-win\"><em>Motherboard</em></a><em>&nbsp;</em>published about the data firm. The <em>Vice News</em> outlet<em>&nbsp;</em>was one of the first English-language publications to detail Cambridge Analytica's use of online data to build psychographic profiles.&nbsp;</p><span id=\"end-legacy-contents\"></span><p>The SEC asked Zuckerberg if that was the first time he had become aware of the firm. \"I think that's probably right,\" he told the Commission. \"My guess is I heard of them before. And that this was after seeing a couple of mentions of what they were claiming to do, I wanted to ask people who I trusted what their assessment was.\"&nbsp;&nbsp;</p><p>Zuckerberg also considered explicitly calling out Cambridge Analytica in a statement he made about Facebook's attempts to combat Russian election meddling in the fall of 2017. His first draft called for him to state: \"We are already looking into foreign actors including Russian intelligence actors in other Soviet states and organizations like Cambridge Analytica.” However, on the day of the livestream, he at best alluded to the firm, saying Facebook was investigating \"organizations like the campaigns, to further our understanding of how they used our tools.”</p><p>The timeline Zuckerberg provided to the SEC contradicts the one he gave during sworn testimony before the <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy55b3V0dWJlLmNvbS93YXRjaD92PUcyNzJSNTB2Nnd3JmFiX2NoYW5uZWw9WWFob29GaW5hbmNlIiwiY29udGVudFV1aWQiOiI1MDY5NDQ0ZC1iNzAwLTRlNmUtYmQyZi00ZDE1MTE1YWM2NmYifQ&amp;signature=AQAAAQ86q0xPq7WMM8C3yivi-BAsXd5RfrIXqIWl1m76MJBT&amp;gcReferrer=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DG272R50v6ww%26ab_channel%3DYahooFinance\">House Financial Services Committee in 2019</a>. \"I'm not sure of the exact time, but it was probably around the time it became public, I think it was around March of 2018. I could be wrong, though,\" he told Representative Alexandria Ocasio-Cortez.&nbsp;&nbsp;</p><p>When asked to comment on Real Facebook Oversight Board's findings, Meta pointed Engadget to its <a href=\"https://www.engadget.com/2019-07-12-facebook-ftc.html\">2019 Federal Trade Commission settlement</a>, which saw the company agree to pay $5 billion in financial penalties and <a href=\"https://about.fb.com/news/2019/07/ftc-agreement/\">implement new privacy measures</a>. “This has been a settled case for over three years,\" a Meta spokesperson added. The office of Alexandria Ocasio-Cortez did not immediately respond to Engadget's comment request.</p><p>The findings are likely to prompt new questions about Facebook's handling of Cambridge Analytica. To this day, the scandal is the largest in Meta's history. The data firm harvested information from as many as 87 million Facebook profiles and may have passed on that data to <a href=\"https://www.engadget.com/2018-03-16-facebook-cambridge-analytica-suspended.html\">Donald Trump's 2016 presidential campaign</a> and the Brexit campaign.</p>", "link": "https://www.engadget.com/mark-zuckerberg-misled-congress-sec-docs-183809371.html?src=rss", "date_published": "2022-12-20 18:38:09+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "USPS expects to only buy electric delivery vehicles starting in 2026", "description": "<p>The <a href=\"https://www.engadget.com/tag/usps/\"><ins>United States Postal Service</ins></a> said it expects to buy more than 66,000 electric vehicles by the end of 2028 in a significant change from previous plans. In February, the USPS said it would purchase 5,000 fully electric versions of the <a href=\"https://www.engadget.com/usps-next-generation-delivery-vehicle-230128191.html\"><ins>Next Generation Delivery Vehicle</ins></a>, with gas-powered trucks accounting for the remaining 45,000 of the initial order. After <a href=\"https://www.engadget.com/epa-urges-usps-halt-to-gas-delivery-truck-purchase-153248945.html\"><ins>pushback from the Biden administration</ins></a> and <a href=\"https://www.engadget.com/usps-electric-next-gen-mail-truck-gas-194803588.html\"><ins>resistance to that</ins></a> from the USPS, the agency has <a href=\"https://www.engadget.com/the-usps-is-doubling-its-order-of-next-gen-electric-mail-trucks-173029231.html\"><ins>gradually</ins></a><a href=\"https://www.engadget.com/us-postal-boost-purchases-electric-151223631-173128864.html\"><ins>increased</ins></a> the proportion of EVs in the order.</p><p>Now, the postal service aims to buy at least 60,000 Next Generation Delivery Vehicles by 2028, at least 75 percent of which will be electric models. Starting in 2026, the USPS expects that all NGDV acquisitions will be electric versions. The NGDVs are expected to start operating on delivery routes late next year. In addition, the agency plans to buy another 21,000 off-the-shelf EVs through 2028.</p><span id=\"end-legacy-contents\"></span><p>Overall, the USPS plans to buy 106,000 delivery vehicles by the end of 2028 to start replacing its aging, inefficient and not-as-safe fleet of more than 220,000 vehicles. That means the agency still expects to buy around 40,000 gas-powered models over the next six years. The USPS <a href=\"https://about.usps.com/newsroom/national-releases/2022/1220-usps-intends-to-deploy-over-66000-electric-vehicles-by-2028.htm\"><ins>said in a statement</ins></a> that the feasibility of fully electrifying the fleet &quot;will continue to be explored.&quot; However, it believes there will be more EV availability in the future, which will certainly help.</p><p>The agency expects to spend $9.6 billion on these vehicle purchases and related infrastructure, $3 billion of which is from <a href=\"https://www.engadget.com/president-joe-biden-signs-inflation-reduction-act-200724230.html\"><ins>Inflation Reduction Act</ins></a> funding. &quot;The $3 billion provided by Congress has significantly reduced the risk associated with accelerating the implementation of a nationwide infrastructure necessary to electrify our delivery fleet,&quot; Postmaster General Louis DeJoy said. &quot;While most of the electric vehicle funding will continue to come from Postal Service revenues, we are grateful for the confidence that Congress and the Administration have placed in us to build and acquire what has the potential to become the largest electric vehicle fleet in the nation.&quot;</p>", "link": "https://www.engadget.com/us-postal-service-hopes-electric-delivery-vehicles-2026-171507258.html?src=rss", "date_published": "2022-12-20 17:15:07+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "‘Sifu’ is getting an arena mode and heading to Xbox in March 2023", "description": "<p><a href=\"https://www.engadget.com/sifu-release-date-ps4-ps5-epic-games-store-sloclap-204046869.html\"><em><ins>Sifu’s</ins></em></a> long-awaited Arenas mode will arrive next March. Developer Sloclap made the announcement <a href=\"https://www.ign.com/videos/sifu-arenas-mode-teaser-xbox-and-steam-announcement\"><ins>through IGN</ins></a>, which shared a trailer for the upcoming DLC. The studio first teased the mode last April when it <a href=\"https://www.engadget.com/sifu-difficulty-options-content-roadmap-sloclap-194237152.html\"><ins>published a free content roadmap</ins></a> for <em>Sifu</em>. At the time, Sloclap said the update would arrive in the winter of 2022. However, true to its initial promise, the mode will include new outfits for players to unlock.</p><p>“Successfully completing the arenas will progressively unlock a massive new modifiers batch, which doubles the current game's amount and notably brings alternative moves to the Kung Fu palette of our main character,” Sloclap told <em>IGN</em>. “Completing the new Arenas challenges will also unlock new cheats and exclusive new outfits.” If you haven’t had a chance to play <em>Sifu </em>yet because it’s not available on Xbox, there’s more good news. The arrival of the Arenas mode update will coincide with the game’s release on Xbox and Steam. Sloclap promised to share more information about both news items soon.</p><span id=\"end-legacy-contents\"></span><div id=\"1160864cdc044812b2e58cd905418e9a\"><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Get your first look at the new Arenas mode coming to Sifu!<br /><br />Arenas arrives on all platforms in March as part of a free update that coincides with the game also coming to Xbox and Steam. <a href=\"https://t.co/l3DbydcOVK\">pic.twitter.com/l3DbydcOVK</a></p>— IGN (@IGN) <a href=\"https://twitter.com/IGN/status/1605201784296935427?ref_src=twsrc%5Etfw\">December 20, 2022</a></blockquote></div>", "link": "https://www.engadget.com/sifu-arena-mode-xbox-availability-march-2023-165054455.html?src=rss", "date_published": "2022-12-20 16:50:54+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "The best Xbox games for 2023", "description": "<p>A series of missteps put Microsoft in second place before the Xbox One even came out. With the launch of the <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9ncC9wcm9kdWN0L0IwOEg3NVJUWjg_dGFnPWdkZ3QwYy1wLW8tZHMtMjAiLCJjb250ZW50VXVpZCI6IjBhNmU2ZWRiLTRiMzYtNDI5MC1iNWU1LWE0NGFiYjYwMjRjOCJ9&amp;signature=AQAAAdCY1Ouea6Ye_E8ZBLQVFsHtK7IC6Z9AHRQ53QcLI6FU&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2Fgp%2Fproduct%2FB08H75RTZ8\">Xbox Series X</a> and <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9ncC9wcm9kdWN0L0IwOEc5SjQ0Wk4vP3RhZz1nZGd0MGMtcC1vLWRzLTIwIiwiY29udGVudFV1aWQiOiIwYTZlNmVkYi00YjM2LTQyOTAtYjVlNS1hNDRhYmI2MDI0YzgifQ&amp;signature=AQAAAVja2chGXjB4Lqvh7g-yFx643XegWlyGfH9m-TTWFYyP&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2Fgp%2Fproduct%2FB08G9J44ZN%2F\">S</a>, though, Microsoft is in a great position to compete. Both are well-priced, well-specced consoles with a huge library of games spanning two decades.</p><p>Microsoft’s console strategy is unique. Someone with a 7-year old Xbox One has access to an almost-identical library of games as the owner of a brand-new Xbox Series X. That makes it difficult to maintain meaningfully different lists for its various consoles — at least for now. But while “next-gen” exclusives may be few and far between, with PS4 outselling Xbox One by a reported two-to-one, there are a lot of gamers who simply haven’t experienced much of what Microsoft has had to offer since the mid ‘10s.</p><span id=\"end-legacy-contents\"></span><p>It’s with that frame of mind that we approach this list: What games would we recommend to someone picking up an Xbox today — whether it’s a Series X, a Series S, One X or One S — after an extended break from Microsoft’s consoles?</p><p>This list then, is a mixture of games exclusive to Microsoft’s consoles and cross-platform showstoppers that play best on Xbox. We’ve done our best to explain the benefits Microsoft’s systems bring to the table where appropriate. Oh, and while we understand some may have an aversion to subscription services, it’s definitely worth considering <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy54Ym94LmNvbS9lbi11cy9nYW1lcy9zdG9yZS94Ym94LWdhbWUtcGFzcy11bHRpbWF0ZS9jZnE3dHRjMGtoczA_IiwiY29udGVudFV1aWQiOiIwYTZlNmVkYi00YjM2LTQyOTAtYjVlNS1hNDRhYmI2MDI0YzgifQ&amp;signature=AQAAATA7cFPYXyTkpJeNab6R9hJfA-cPdcZE-1KJNU5fwe8R&amp;gcReferrer=https%3A%2F%2Fwww.xbox.com%2Fen-us%2Fgames%2Fstore%2Fxbox-game-pass-ultimate%2Fcfq7ttc0khs0%3F\">Game Pass Ultimate</a>, which will allow you to play many of the games on this list for a monthly fee.</p><h2>Deathloop</h2><p></p><p><em>Deathloop</em>, from the studio that brought you the Dishonored series, is easy enough to explain: You’re trapped in a day that repeats itself. If you die, then you go back to the morning, to repeat the day again. If you last until the end of the day, you still repeat it again. Colt must “break the loop” by efficiently murdering seven main characters, who are inconveniently are never in the same place at the same time. It’s also stylish, accessible and fun.</p><p>While you try to figure out your escape from this time anomaly, you’ll also be hunted down by Julianna, another island resident who, like you, is able to remember everything that happens in each loop. She’ll also lock you out of escaping an area, and generally interfere with your plans to escape the time loop. (The online multiplayer is also addictive, flipping the roles around. You play as Julianna, hunting down Colt and foiling his plans for murder. )</p><p>As you play through the areas again (and again) you’ll equip yourself with slabs that add supernatural powers, as well as more potent weapons and trinkets to embed into both guns and yourself. It’s through this that you’re able to customize your playstyle or equip yourself in the best way to survive Julianna and nail that assassination. Each time period and area rewards repeat exploration, with secret guns, hidden conversations with NPCs and lots of world-building lore to discover for yourself.</p><p>Originally a timed PlayStation exclusive, Deathloop landed on Xbox in September 2022.</p><h2>Overwatch 2</h2><p></p><p>Even though Blizzard has improved the onramp for new players this time around, <em>Overwatch 2 </em>still has a steep learning curve. Stick with it, though, and you’ll get to indulge in perhaps the best team shooter around. <em>Overwatch 2</em> has a deceptively simple goal — stand on or near an objective and keep the other team away long enough to win. It’s much more complex in practice. To the untrained eye, matches may seem like colorful chaos, but <em>Overwatch 2</em> has a deceptively simple goal — stand on or near an objective and keep the other team away long enough to win.</p><p>It’s much more complex in practice. Blizzard reduced the number of players on each team from six to five. That, along with across-the-board character tweaks, has made gameplay faster-paced and more enjoyable compared with the original <em>Overwatch</em>. There's a greater emphasis on individual impact, but you'll still need to work well with your teammates to secure a victory.</p><p>Now featuring a cast of more than 30 heroes, each with distinct abilities and playstyles, you’ll surely find a few <em>Overwatch 2</em> characters that you can connect with. The first batch of new heroes are all a blast to play. There are many great (though often fairly expensive) new skins to kit them out with too. The game looks and sounds terrific too, thanks to Blizzard’s trademark level of polish. At least until you figure out how to play <em>Overwatch 2</em>, you can marvel at how good it looks.</p><h2>Control</h2><p></p><p>Take the weird <em>Twin Peaks</em> narrative of <em>Alan Wake</em>, smash it together with <em>Quantum Break</em>'s frenetic powers and gunplay, and you've got <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9kcC9CMDhTWjFGNUZCP3RhZz1nZGd0MGMtcC1vLWRzLTIwIiwiY29udGVudFV1aWQiOiIwYTZlNmVkYi00YjM2LTQyOTAtYjVlNS1hNDRhYmI2MDI0YzgifQ&amp;signature=AQAAAb-mT1O2eoop_v7mVo5v6CzIKruanvg2dh0vXqu3y2Tg&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB08SZ1F5FB\"><em>Control</em></a>. Playing as a woman searching for her missing brother, you quickly learn there's a thin line between reality and the fantastical. It's catnip for anyone who grew up loving <em>The X-Files</em> and the supernatural. It's also a prime example of a studio working at their creative heights, both refining and evolving the open-world formula that's dominated games for the past decade.</p><p><em>Control</em> on the last-gen Xbox is a mixed affair, with the One S struggling a little, but the One X being head-and-shoulders above the PS4 Pro when it comes to fidelity and smoothness. With the launch of the next-gen consoles, an ‘Ultimate Edition’ emerged which brought the ray-tracing and higher frame rates that PC gamers enjoyed to console players. Although you’ll only get those benefits as a next-gen owner, it also includes all the released DLC and is the edition we recommend buying, even if you’re not planning to immediately upgrade.</p><h2>Halo Infinite</h2><p></p><p>Master Chief's latest adventure may not make much sense narratively, but it sure is fun to play. After the middle efforts from 343 Industries over the last decade, <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9IYWxvLUluZmluaXRlLVhib3gtT25lLVN0YW5kYXJkL2RwL0IwN1NMNllZQlc_dGFnPWdkZ3QwYy1wLW8tZHMtMjAiLCJjb250ZW50VXVpZCI6IjBhNmU2ZWRiLTRiMzYtNDI5MC1iNWU1LWE0NGFiYjYwMjRjOCJ9&amp;signature=AQAAAYYvislHANh4z4ZvZjJJxbVtnDXilb8DXfUkFCNI6YBZ&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FHalo-Infinite-Xbox-One-Standard%2Fdp%2FB07SL6YYBW\"><em>Halo Infinite</em></a> manages to breathe new life into Microsoft's flagship franchise, while also staying true to elements fans love. The main campaign is more open than ever, while also giving you a new freedom of movement with the trusty grappling hook. And the multiplayer mode is wonderfully addictive (though 343 still needs to speed up experience progression), with a bevy of maps and game modes to keep things from getting too stale. The only thing keeping it from greatness is its baffling and disjointed story, but it's not like Xbox fans have many options when it comes to huge exclusives right now.</p><h2>Forza Horizon 5</h2><p></p><p><a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9Gb3J6YS1Ib3Jpem9uLVN0YW5kYXJkLVhib3gtT25lLVgvZHAvQjA5N01HWjdNWT90YWc9Z2RndDBjLXAtby1kcy0yMCIsImNvbnRlbnRVdWlkIjoiMGE2ZTZlZGItNGIzNi00MjkwLWI1ZTUtYTQ0YWJiNjAyNGM4In0&amp;signature=AQAAAU0yzKlrsheJOfWA1l8p0TFSvflXUxXjwv8p8r3gYqNN&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FForza-Horizon-Standard-Xbox-One-X%2Fdp%2FB097MGZ7MY\"><em>Forza Horizon 5</em></a><em>&nbsp;</em>deftly walks a fine line by being an extremely deep and complex racing game that almost anyone can just pick up and play. The game has hundreds of cars that you can tweak endlessly to fit your driving style, and dozens of courses spread all over a gorgeous fictional corner of Mexico. If you crank up the difficulty, one mistake will sink your entire race, and the competition online can be just as fierce.</p><p>But if you’re new to racing games, <em>Forza Horizon 5</em> does an excellent job at getting you up and running. The introduction to the game quickly gives you a taste at the four main race types you’ll come across (street racing, cross-country, etc.), and features like the rewind button mean that you can quickly erase mistakes if you try and take a turn too fast without having to restart your run. Quite simply, <em>Forza Horizon 5</em> is a beautiful and fun game that works for just about any skill level. It’s easy to pick up and play a few races and move on with your day, or you can sink hours into it trying to become the best driver you can possibly be.</p><h2>Gears 5</h2><p></p><p><a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9HZWFycy1XYXItR2FtZS1ZZWFyLURpZ2l0YWwvZHAvQjA4VFM1WDRONz90YWc9Z2RndDBjLXAtby1kcy0yMCIsImNvbnRlbnRVdWlkIjoiMGE2ZTZlZGItNGIzNi00MjkwLWI1ZTUtYTQ0YWJiNjAyNGM4In0&amp;signature=AQAAAb2XnfHobrWv0cDvjyMrn9_lxbM-mgMUtdIVJprVNais&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FGears-War-Game-Year-Digital%2Fdp%2FB08TS5X4N7\"><em>Gears 5</em></a> tries to be a lot of things, and doesn't succeed at them all. If you're a Gears of War fan, though, there's a lot to love here. The cover-shooter gameplay the series helped pioneer feels great, and the campaign, while not narratively ambitious, is well-paced and full of bombastic set pieces to keep you interested. As they stand, the various multiplayer modes are not great, but <em>Gears 5</em> is worth it for the campaign alone.</p><p>It’s also a true graphical showcase, among the best-looking console games around. Microsoft did a great job optimizing for all platforms and use-cases, with high-resolution and ultra-high (up to 120fps on series consoles) frame rates.</p><h2>Nier: Automata</h2><p></p><p>It took more than a while to get here, but <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=ffe106af-8248-4af3-9098-a2d4fd637766&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=GameStop&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiJmZmUxMDZhZi04MjQ4LTRhZjMtOTA5OC1hMmQ0ZmQ2Mzc3NjYiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuZ2FtZXN0b3AuY29tL3ZpZGVvLWdhbWVzL3Byb2R1Y3RzL25pZXItYXV0b21hdGEtLS1iZWNvbWUtYXMtZ29kcy1lZGl0aW9uLzE3Nzc5NS5odG1sPyIsImNvbnRlbnRVdWlkIjoiMGE2ZTZlZGItNGIzNi00MjkwLWI1ZTUtYTQ0YWJiNjAyNGM4In0&amp;signature=AQAAAX9W98Q0NTHEAWeBajzQBwNuwCZ1SKPDpIaD8BYL-zoM&amp;gcReferrer=https%3A%2F%2Fwww.gamestop.com%2Fvideo-games%2Fproducts%2Fnier-automata---become-as-gods-edition%2F177795.html%3F\"><em>Nier: Automata</em></a> finally arrived on Xbox One in the summer of 2018. And boy, was it worth the almost-18-month wait. Nier takes the razor-sharp combat of a Platinum Games title and puts it in a world crafted by everyone's favorite weirdo, Yoko Taro. Don't worry, you can mostly just run, gun and slash your way through the game, but as you finish, and finish and finish this one, you'll find yourself pulled into a truly special narrative, one that's never been done before and will probably never be done again. It’s an unmissable experience, and one that feels all the more unique on Xbox, which has never had the best levels of support from Japanese developers.</p><p>On Xbox One X and Series X, you effectively have the best version of Nier: Automata available, short of a <a href=\"https://steamcommunity.com/groups/SpecialK_Mods/discussions/3/1334600128973500691/\">fan-patched</a> PC game. On Series S and One S... not so much, but you do at least get consistent framerates on the Series S and a passable experience on the One S.&nbsp;</p><h2>Ori and the Blind Forest</h2><p></p><p>Arriving at a time when \"Gears Halo Forza\" seemed to be the beginning, middle and end of Microsoft's publishing plans, <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9PcmktQmxpbmQtRm9yZXN0LURlZmluaXRpdmUtWGJveC1PbmUvZHAvQjAxRENBOFNGOD90YWc9Z2RndDBjLXAtby1kcy0yMCIsImNvbnRlbnRVdWlkIjoiMGE2ZTZlZGItNGIzNi00MjkwLWI1ZTUtYTQ0YWJiNjAyNGM4In0&amp;signature=AQAAAVfTOXgeVH-KtGSKk3-IKOPfNlTEvwQjDHoEfrKOVEgq&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FOri-Blind-Forest-Definitive-Xbox-One%2Fdp%2FB01DCA8SF8\"><em>Ori and the Blind Forest</em></a> was a triumph. It's a confident mash of the pixel-perfect platforming popularized by <em>Super Meat Boy</em>, and the rich, unfolding worlds of Metroidvania games. You'll die hundreds of times exploring the titular forest, unlocking skills that allow you to reach new areas. It looks and sounds great — like, Disney great — and its story, while fairly secondary to the experience, is interesting. Ori might not do much to push the boundaries of its genres, but everything it does, it does so right. Its sequel, <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9PcmktV2lsbC1XaXNwcy1YYm94LU9uZS9kcC9CMDdESlJQWldZP3RhZz1nZGd0MGMtcC1vLWRzLTIwIiwiY29udGVudFV1aWQiOiIwYTZlNmVkYi00YjM2LTQyOTAtYjVlNS1hNDRhYmI2MDI0YzgifQ&amp;signature=AQAAAfTE7WPzcM9M1leeu2EaffZRkeF-CWIxXNuSuGgLlwuu&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FOri-Will-Wisps-Xbox-One%2Fdp%2FB07DJRPZWY\"><em>Ori and the Will of the Wisps</em></a>, is very much “more of everything,” so if you like <em>Blind Forest</em>, it’s well worth checking out too.</p><h2>Red Dead Redemption 2</h2><p></p><p><a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9SZWQtRGVhZC1SZWRlbXB0aW9uLTItWGJveC1PbmUvZHAvQjAxTUFZQzFDSj90YWc9Z2RndDBjLXAtby1kcy0yMCIsImNvbnRlbnRVdWlkIjoiMGE2ZTZlZGItNGIzNi00MjkwLWI1ZTUtYTQ0YWJiNjAyNGM4In0&amp;signature=AQAAATibTCIXYz2C1jYubXuCBIXn0nb7Q1Ez7omtNIcEpnPC&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FRed-Dead-Redemption-2-Xbox-One%2Fdp%2FB01MAYC1CJ\"><em>Red Dead Redemption 2</em></a> is the kind of game no one but Rockstar, the team behind the GTA series, could make. Only when a studio is this successful can it pour millions of dollars and development hours into a game. Rockstar's simulation of a crumbling frontier world is enthralling and serves as a perfect backdrop to an uncharacteristically measured story. While the studio's gameplay may not have moved massively forward, the writing and characters of RDR2 will stay with you.</p><p>While Rockstar hasn’t deemed fit to properly upgrade <em>Red Dead Redemption 2 </em>for the next-gen yet, Series X owners will at least benefit from the best last-gen (Xbox One X) experience with the addition of improved loading times. The Series S, on the other hand, gets the One S version, but with an improved 30 fps lock and swifter loading.</p><h2>Resident Evil Village</h2><p></p><p><a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9SZXNpZGVudC1FdmlsLVZpbGxhZ2UtWGJveC1YLVN0YW5kYXJkL2RwL0IwOTQ3ODlZUkg_dGFnPWdkZ3QwYy1wLW8tZHMtMjAiLCJjb250ZW50VXVpZCI6IjBhNmU2ZWRiLTRiMzYtNDI5MC1iNWU1LWE0NGFiYjYwMjRjOCJ9&amp;signature=AQAAAfJmstwVEyn8HZv9ZyhLJzF1iav2cmw3ckOJL5JBjx2P&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FResident-Evil-Village-Xbox-X-Standard%2Fdp%2FB094789YRH\"><em>Resident Evil Village</em></a> is delightful. It’s a gothic fairy tale masquerading as a survival-horror game, and while this represents a fresh vibe for the franchise, it’s not an unwelcome evolution. The characters and enemies in Village are full of life — even when they’re decidedly undead — and Capcom has put a delicious twist on the idea of vampires, werewolves, sea creatures, giants and creepy dolls. The game retains its horror, puzzle and action roots, and it has Umbrella Corporation’s fingerprints all over it. It simply feels like developers had fun with this one, and so will you.</p><p>A word of caution before you run to buy it, though: This game doesn’t play great on every Xbox. On Series X, things are great: There's the option to turn on ray-tracing with the occasional frame rate issue, or to keep it off and have perfect 4K/60 presentation. With the Series S, while there is a ray-tracing mode, it’s almost unplayable. With ray-tracing off, the Series S does a decent job, though. The One X’s 1080p/60 mode is also fantastic, although its quality mode feels very juddery. If you own a base Xbox One or One S, though, there’s really no mode that actually feels enjoyable to play.</p><h2>Sekiro: Shadows Die Twice</h2><p></p><p><a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9TZWtpcm8tU2hhZG93cy1Ud2ljZS1EaWdpdGFsLVN0YW5kYXJkL2RwL0IwN1ozWEw0UVA_dGFnPWdkZ3QwYy1wLW8tZHMtMjAiLCJjb250ZW50VXVpZCI6IjBhNmU2ZWRiLTRiMzYtNDI5MC1iNWU1LWE0NGFiYjYwMjRjOCJ9&amp;signature=AQAAAWqL_CsEamZZyAf5YVE3vj3hqm-qVYtRphiN8Dd_IvgE&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FSekiro-Shadows-Twice-Digital-Standard%2Fdp%2FB07Z3XL4QP\"><em>Sekiro: Shadows Die Twice</em></a> isn't just another Dark Souls game. FromSoftware's samurai adventure is a departure from that well-established formula, replacing slow, weighty combat and gothic despair for stealth, grappling hooks and swift swordplay. Oh, and while it's still a difficult game, it's a lot more accessible than Souls games — you can even pause it! The result of all these changes is something that's still instantly recognizable as a FromSoftware title, but it's its own thing, and it's very good.</p><p>This is one game that’s really not had a lot of love from its developer or publisher, as, despite the fact next-gen consoles should be easily able to run this game at 60 fps, the Series S is locked to an inconsistently paced 30 fps, while the Series X doesn’t quite hold to 60 either. With that said, it’s more than playable.</p><h2>Lost Judgement</h2><p></p><p>This is private eye Takayuki Yagami’s <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=ffe106af-8248-4af3-9098-a2d4fd637766&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=GameStop&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiJmZmUxMDZhZi04MjQ4LTRhZjMtOTA5OC1hMmQ0ZmQ2Mzc3NjYiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuZ2FtZXN0b3AuY29tL3ZpZGVvLWdhbWVzL3Byb2R1Y3RzL2xvc3QtanVkZ21lbnQtLS14Ym94LXNlcmllcy14LzI5MTA3NS5odG1sPyIsImNvbnRlbnRVdWlkIjoiMGE2ZTZlZGItNGIzNi00MjkwLWI1ZTUtYTQ0YWJiNjAyNGM4In0&amp;signature=AQAAAbUclKxTgGXlHAtfLZeZ1icGRYZts0EQCyjo_Nj7NVIJ&amp;gcReferrer=https%3A%2F%2Fwww.gamestop.com%2Fvideo-games%2Fproducts%2Flost-judgment---xbox-series-x%2F291075.html%3F\">second adventure</a>; a spin-off of Sega’s popular, pulpy and convoluted Yakuza saga. He lives in the same Kamurocho area, the same yakuza gangs roam the streets, and there’s the very occasional crossover of side-story characters and, well, weirdos. But instead of punching punks in the face in the name of justice or honor, which was the style of Yakuza<em>&nbsp;</em>protagonist Kazuya Kiryu, Yagami fights with the power of his lawyer badge, drone evidence and… sometimes (read: often) he kicks the bad guys in the face.</p><p>The sequel skates even closer to some sort of serialized TV drama, punctuated by fights, chases and melodrama. For anyone that’s played the series before, it treads familiar ground, but with a more serious (realistic) story that centers on bullying and suicide problems in Japanese high schools, which is tied into myriad plots encompassing the legal system, politics and organized crime.</p><p>Yagami has multiple  fighting styles to master, while there are love interests, batting cages, mahjong, skate parks and more activities to sink even more hours into. On the PS5, <em> Lost Judgment</em> looks great. Fights are fluid and the recreated areas in Tokyo and Yokohama are usually full of pedestrians, stores and points of interest. While <em>Yakuza Like a Drago</em>n takes the franchise in a new (turn-based, more ridiculous) direction, <em>Lost Judgment</em> retains the brawling playstyle of the Yakuza series, with a new hero who has, eventually, charmed us.</p><h2>Xbox Game Pass Ultimate</h2><p></p><p>We already mentioned this one but it's difficult to overemphasize how good a deal <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9YYm94LUdhbWUtUGFzcy1VbHRpbWF0ZS1NZW1iZXJzaGlwL2RwL0IwN1RGUDdKRkg_dGFnPWdkZ3QwYy1wLW8tZHMtMjAiLCJjb250ZW50VXVpZCI6IjBhNmU2ZWRiLTRiMzYtNDI5MC1iNWU1LWE0NGFiYjYwMjRjOCJ9&amp;signature=AQAAAbIx13ZjEsaaH0nMgLx2YYuLdPxuDIBtEKFdsJ-lNDuE&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FXbox-Game-Pass-Ultimate-Membership%2Fdp%2FB07TFP7JFH\">Game Pass</a> is for Xbox owners. For $15 a month you get access to a shifting and growing library of games. The company does a good job explaining what games are coming and going in advance, so you won't get caught out by a game disappearing from the subscription service just as you're reaching a final boss. There are 11 games mentioned in this guide, and seven of them are currently available with Game Pass. The full library is broad, and, while still Microsoft's cloud service is still just in beta, you'll have access to many of the games on your tablet, phone or browser through xCloud at no extra fee.</p><p></p>", "link": "https://www.engadget.com/best-xbox-games-140022399.html?src=rss", "date_published": "2022-12-20 16:30:04+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "Amazon and EU finalize third-party seller antitrust deal", "description": "<p><a href=\"https://www.engadget.com/tag/amazon/\"><ins>Amazon</ins></a> has agreed to change some business practices in the European Union as part of legally binding commitments with the bloc's executive branch. The European Commission said <a href=\"https://www.engadget.com/amazon-reportedly-agrees-to-end-eu-antitrust-probe-192410097.html/\"><ins>the deal</ins></a> will put antitrust investigations over how Amazon treats third-party sellers to bed for the time being. Amazon will need to abide by the commitments for between five and seven years or it could face hefty fines.</p><p>&quot;Today’s decision sets new rules for how Amazon operates its business in Europe. Amazon can no longer abuse its dual role [as both marketplace and seller] and will have to change several business practices,&quot; Margrethe Vestager, the Commission's executive vice-president in charge of competition policy, <a href=\"https://ec.europa.eu/commission/presscorner/detail/en/ip_22_7777\"><ins>said in a statement</ins></a>. &quot;They cover the use of data, the selection of sellers in the Buy Box and the conditions of access to the Amazon Prime Program. Competing independent retailers and carriers as well as consumers will benefit from these changes opening up new opportunities and choice.&quot;</p><span id=\"end-legacy-contents\"></span><p>The deal includes several preliminary commitments Amazon <a href=\"https://www.engadget.com/amazon-buy-box-prime-marketplace-seller-eu-changes-143402811.html/\"><ins>made in July</ins></a>. Among other things, it will rank all sellers equally in the Buy Box, which displays an item from a specific seller so customers can quickly purchase it. Amazon said it will display a second Buy Box if another seller offers the product with a significantly different price and/or delivery time.</p><p>Third-party sellers in the EU will be able to offer their products through Prime without having to use Amazon's delivery or logistics services. Additionally, Amazon will not use any non-public data relating to third-party sellers to benefit its own business, including logistics or creating copycat versions of popular products.</p><p>The final deal includes some additional commitments, such as making it easier for third-party sellers to directly contact their Amazon customers so they can provide similar delivery services to those offered by Amazon. The company will also need to create a way for sellers and carriers to file complaints if they suspect it isn't complying with the commitments.</p><p>Amazon said it disagreed with some of the Commission’s preliminary conclusions. However, it told the <a href=\"https://apnews.com/article/technology-europe-business-amazoncom-inc-european-union-6d35d298aba32492b927be8f4f069148/\"><em><ins>Associated Press</ins></em></a> that, “We are pleased that we have addressed the European Commission’s concerns and resolved these matters.”</p><p>The settlement applies for five years in most cases. The Prime and second Buy Box commitments will last for seven years. The deal is legally enforceable in the European Economic Area save for Italy. That country's competition authority has <a href=\"https://www.engadget.com/italy-fines-amazon-for-abuse-of-dominant-position-085244332-085736675.html\">imposed its own penalties</a> on Amazon.</p><p>If EU regulators determine that Amazon isn't sticking to the terms of the deal, the Commission can fine the company up to 10 percent of its global annual revenue without having to find an infringement of antitrust rules. Based on Amazon's 2021 revenue, that fine could be as much as $47 billion. Alternatively, the EC could fine Amazon five percent of its daily turnover for every day that it doesn't comply with the terms of the deal.</p><p>EU regulators brought formal antitrust charges against Amazon <a href=\"https://www.engadget.com/amazon-reportedly-agrees-to-end-eu-antitrust-probe-192410097.html/\"><ins>in November 2020</ins></a>, accusing the company of abusing its dual position. The Commission <a href=\"https://www.engadget.com/2019-07-17-eu-amazon-probe-merchant-data-sensitive-advantage.html/\"><ins>opened an investigation</ins></a> over the use of non-public data the previous year. In a separate investigation, the EC found that Amazon &quot;abused its dominance on the French, German and Spanish markets for the provision of online marketplace services to third-party sellers.&quot; Amazon is still facing scrutiny on these issues <a href=\"https://www.engadget.com/sec-amazon-third-party-seller-data-053518981.html/\"><ins>in the US</ins></a> and <a href=\"https://www.engadget.com/amazon-class-action-lawsuit-uk-buy-box-192735097.html/\"><ins>the UK</ins></a>.</p>", "link": "https://www.engadget.com/amazon-eu-european-commission-antitrust-settlement-third-party-sellers-160026620.html?src=rss", "date_published": "2022-12-20 16:00:26+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "Hands-on with LG's 240Hz UltraGear gaming monitors: Setting a new bar for OLED refresh rates", "description": "<p>Earlier this year, Alienware released what’s arguably the best all-around gaming monitor on the market right now: the <a href=\"https://www.engadget.com/alienware-qd-oled-gaming-monitor-ultrawide-review-140012704.html\"><ins>AW3423DW.</ins></a> But last week, <a href=\"https://www.engadget.com/lg-27gr95qe-us-pricing-availability-announced-181515149.html\"><ins>LG quietly announced its latest batch of UltraGear gaming monitors</ins></a> and after getting a chance to check them out in person, I can say that Alienware’s display has some formidable new rivals.</p><p>Unlike the AW3423DW, LG’s monitors are available in two sizes intended for slightly different use cases. There’s the <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy5sZy5jb20vdXMvbW9uaXRvcnMvbGctMjdncjk1cWUtYiMiLCJjb250ZW50VXVpZCI6ImE3NmZmZjRlLWY4NGItNGJmOS05YmQ3LTEzNGJjMTc3ODgyZCJ9&amp;signature=AQAAAf_tfHqeOLYPow1RHCZgx1_k6oiu5Qgms33wR2ex-sVF&amp;gcReferrer=https%3A%2F%2Fwww.lg.com%2Fus%2Fmonitors%2Flg-27gr95qe-b%23\"><ins>27-inch 27GR95QE-B</ins></a>, which sports a flat panel with 2,560 x 1,440 resolution meant for both general use and more demanding competitive play, while the 45-inch <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy5sZy5jb20vdXMvbW9uaXRvcnMvbGctNDVncjk1cWUtYiIsImNvbnRlbnRVdWlkIjoiYTc2ZmZmNGUtZjg0Yi00YmY5LTliZDctMTM0YmMxNzc4ODJkIn0&amp;signature=AQAAAdBdGMaZYeNqAuedCn76Qty6RXgt8qEAigZAYprrrW9u&amp;gcReferrer=https%3A%2F%2Fwww.lg.com%2Fus%2Fmonitors%2Flg-45gr95qe-b\"><ins>45GR95QE-B</ins></a> packs a curved display with 800R radius and 3,440 x 1,440 resolution designed to deliver a more immersive experience.</p><span id=\"end-legacy-contents\"></span><figure><img alt=\"Like its bigger sibling, the 27-inch 27GR95QE sports a blazing 240Hz refresh rate, but with a smaller non-curved OLED panel. \" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/b2ab2840-806f-11ed-bbcd-63ac419267b3\" style=\"height: 1200; width: 2000;\" /><figcaption>Like its bigger sibling, the 27-inch 27GR95QE-B sports a blazing 240Hz refresh rate, but with a smaller non-curved OLED panel.</figcaption><div class=\"photo-credit\">Sam Rutherford/Engadget</div></figure><p>The nice thing about these monitors is that regardless of which one you pick, both feature 240Hz refresh rates – the highest you can get from any OLED monitor available today. On top of that, both models have incredibly fast response times of just 0.3 ms (gray to gray). What’s more, they each support both AMD FreeSync Premium and Nvidia G-Sync while also outputting a dazzling range of colors (up to 98.5 percent of the DCI-P3 spectrum). In short, LG’s new UltraGear displays deliver a laundry list of premium display tech with one clear downside: a relatively low max brightness of just 200 nits.</p><p>Admittedly, low brightness might not be a big deal if, like many people, you prefer gaming in dark environments – especially since you’ll probably want to turn the lights down anyway to make the most of LG’s built-in RGB light strips. You can even sync the LEDs on the back to what’s being displayed on screen, which adds a bit of bias lighting without the need for additional hardware. Another small bonus of having a lower max brightness is that there’s no need for an ABL (auto brightness limiter) setting like you see on some other OLED monitors, so you don’t have to worry about the display randomly getting dimmer when looking at primarily white screens (like when you’re viewing word docs or spreadsheets).</p><figure><img alt=\"The 800R curve on the 45GR95QE-B is even more rounded than many of its rivals and delivers an almost cocoon-like gaming experience. \" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/40cb2bb0-8071-11ed-9db7-715a36dffcbe\" style=\"height: 1200; width: 2000;\" /><figcaption>The 800R curve on the 45GR95QE-B is even more rounded than many of its rivals and delivers an almost cocoon-like gaming experience.&nbsp;</figcaption><div class=\"photo-credit\">Sam Rutherford/Engadget</div></figure><p>Unfortunately, because of the size of the displays – particularly the huge 45-inch model – text doesn’t look quite as sharp as I’d like. When you’re gaming that’s not an issue, but when I browsed the web, I could see color fringing and a bit of general blurriness when reading stories and headlines. Now, it’s important to mention that color fringing is something that can be seen on a handful of new OLED displays (most notably QD-OLED panels due to their triangular sub-pixel arrangement), and it’s possible that tools like <a href=\"https://github.com/bp2008/BetterClearTypeTuner\"><ins>Better ClearType</ins></a> or an update to Microsoft’s own Clear Type feature could address this issue. But unfortunately, I didn’t have the time to test that out during my brief hands-on.</p><figure><img alt=\"To test its new UltraGear gaming monitors, LG flew in pro Valorant players Com (pictured here) and Jawgemo from Evil Geniuses.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/b521d820-8070-11ed-bfc2-458598e97866\" style=\"height: 1200; width: 2000;\" /><figcaption>To test its new UltraGear gaming monitors, LG flew in pro Valorant players Com (pictured here) and Jawgemo from Evil Geniuses.</figcaption><div class=\"photo-credit\">Sam Rutherford/Engadget</div></figure><p>That said, while the new UltraGear monitors may not be the best all-around displays for both productivity and entertainment, they look stunning in gaming scenarios. The 27GR95QE-B is the more approachable of the two as it only costs $1,000 (versus $1,700 for the 27GR95QE) and has a better chance of actually fitting on your desk – at least without you needing to rearrange everything. At 27 inches, it’s also closer in size to what pro gamers use in tournaments (most competitions feature 24-inch monitors), while support for tilt, swivel, height and even portrait adjustments make it super easy to position the display properly.</p><p>But the best thing is just how good everything looks in motion. LG brought in some pro Valorant gamers from Evil Geniuses to show off the new UltraGears and even in the midst of a firefight everything stayed tack sharp which brings me to the monitors’ most important spec: their 240Hz refresh rates. Previously, the highest you could get on an OLED monitor (including premium rivals like the Alienware <a href=\"https://www.engadget.com/alienware-qd-oled-gaming-monitor-ultrawide-review-140012704.html\"><ins>AW3423DW</ins></a> and <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=f85e63cd-e13c-4f9d-991c-9fbaadede3ac&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Samsung+Electronics&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiJmODVlNjNjZC1lMTNjLTRmOWQtOTkxYy05ZmJhYWRlZGUzYWMiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuc2Ftc3VuZy5jb20vemEvbW9uaXRvcnMvZ2FtaW5nL29keXNzZXktb2xlZC1nOC1nODVzYi0zNC1pbmNoLTE3NWh6LWN1cnZlZC11bHRyYS13cWhkLWxzMzRiZzg1MHN1eGVuLyIsImNvbnRlbnRVdWlkIjoiYTc2ZmZmNGUtZjg0Yi00YmY5LTliZDctMTM0YmMxNzc4ODJkIn0&amp;signature=AQAAAZgZjgD9uqjKky90cQU0D6PZRDrxXSRPk92wtfNnx9vl&amp;gcReferrer=https%3A%2F%2Fwww.samsung.com%2Fza%2Fmonitors%2Fgaming%2Fodyssey-oled-g8-g85sb-34-inch-175hz-curved-ultra-wqhd-ls34bg850suxen%2F\"><ins>Samsung Odyssey OLED G8</ins></a>) was 175Hz.</p><figure><img alt=\"If you can ignore the moire pattern from my camera, you'll notice some color fringing or rainbow outlines around some of the text which seems to stem from an issue between Windows and the new sub-pixel layout uses in its new OLED panels.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/0a5f8560-8073-11ed-9fe7-36a832985db1\" style=\"height: 1200; width: 2000;\" /><figcaption>If you can ignore the moire pattern from my camera, you'll notice some color fringing or rainbow outlines around some of the text.  The issue may be caused by an issue with the ClearType feature in Windows, so there's a chance Microsoft may be able to address it in the future.&nbsp;</figcaption><div class=\"photo-credit\">Sam Rutherford/Engadget</div></figure><p>For people still using 60Hz displays, that gap might not sound like a big deal. However, the issue is that the general rule when it comes to monitors is that you typically only notice a difference in perceivable performance when you double the refresh rate (e.g., from 60Hz to 120Hz or 120Hz to 240Hz) That means anyone upgrading from a 120Hz displays to one of Alienware’s or Samsung’s rivals might not notice a big improvement while still having a panel that can’t quite hit the super high frame rates (typically from 240 to 300 fps or more) that competitive gamers prefer. But with LG’s latest UltraGears, you get the deep blacks and rich vibrant colors that OLED displays are known for <em>and</em> a refresh rate that rivals all but the very fastest LCD screens.</p><p>As for the larger and more expensive 45GR95QE-B, while it has a slightly lower pixel density than its smaller sibling, its curved panel delivers an encompassing experience. Its 800R radius is meant to mimic the natural shape of your eye while wrapping around you even more than more typical 1000R curved displays. The sweet spot for the monitor is about two and a half feet from the screen and it’s basically perfect. You can still see from edge to edge so you get that glorious panoramic view, but it's not so expansive that you need to constantly move your head to spot buttons or icons that might live in the corners. Interestingly, when I asked <a href=\"https://twitter.com/c0mtweets\"><ins>EG Com</ins></a> if the 800R curve messed up his aim when compared to a flat display, he said even though it was his first time using this monitor he didn’t have to adjust much at all.</p><figure><img alt=\"LG's latest gaming monitors even feature a dedicated dashboard for quickly adjusting image settings or viewing things like the display's refresh rate. \" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/0e41d330-8074-11ed-9fb9-5f27bfe27eaf\" style=\"height: 1200; width: 2000;\" /><figcaption>LG's latest gaming monitors even feature a dedicated dashboard for quickly adjusting image settings or viewing things like the display's refresh rate.&nbsp;</figcaption><div class=\"photo-credit\">Sam Rutherford/Engadget</div></figure><p>Aside from the new panels themselves, there are a couple of other design tweaks I want to call out. The first is that to better cater to competitive gamers, LG is using new feet on the UltraGears’ stands so you can position your keyboard closer to the monitor. But to me, the bigger upgrade is the inclusion of a dedicated remote for adjusting image settings. Instead of having to fumble around with hidden buttons or a joystick on the back of the monitor, you can just sit back and enjoy a more TV-like experience. The addition of a remote is something we’ve seen from other flagship monitors like <a href=\"https://www.engadget.com/samsung-odyssey-ark-hands-on-specs-price-taking-gaming-monitors-to-a-whole-new-dimension-140056568.html\"><ins>Samsung’s Odyssey Ark</ins></a> and it’s a trend I’m really hoping to see trickle down to more mainstream displays across the market.</p><figure><img alt=\"Instead of relying on hidden buttons or a joystick, for its latest UltraGear gaming monitors LG created a new dedicated remote for adjusting image settings. \" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/f0cd1250-806f-11ed-ab5f-79e4d6eb2aaa\" style=\"height: 1200; width: 2000;\" /><figcaption>Instead of relying on hidden buttons or a joystick, for its latest UltraGear gaming monitors LG created a new dedicated remote for adjusting image settings.&nbsp;</figcaption><div class=\"photo-credit\">Sam Rutherford/Engadget</div></figure><p>So while LG’s new UltraGear monitors don’t have the best brightness, they’ve got pretty much every other high-end feature you could want on a gaming monitor right now. And with the 27-inch model going for $1,000 while the bigger 45-inch version going for $1,700, LG suddenly has some very interesting alternatives (both smaller and larger) to Alienware’s fantastic QD-OLED display.</p>", "link": "https://www.engadget.com/lg-ultra-gear-gaming-monitors-hands-on-setting-a-new-bar-for-oled-refresh-rates-153046589.html?src=rss", "date_published": "2022-12-20 15:30:46+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "How Meta flunked its first year as a metaverse company", "description": "<p>A year ago, Meta was riding high on the metaverse. The company had just completed its rebranding from Facebook to Meta. Social networks, as Mark Zuckerberg explained, were no longer a singular focus for the company. “From now on, we're going to be metaverse-first, not Facebook first,” he said.</p><p>Now, as Meta finishes its first full year as a “metaverse company,” the outlook is considerably less rosy. The company has lost billions of dollars on Reality Labs, the division overseeing its metaverse work. Its stock has cratered. The company has, for the first time, shed thousands of employees in <a href=\"https://www.engadget.com/meta-mass-layoffs-facebook-111406126.html\">mass layoffs</a>. Even longtime shareholders are starting to do what was once unthinkable: question Zuckerberg’s vision for the future.</p><span id=\"end-legacy-contents\"></span><p>At the same time, Meta still hasn’t clearly articulated what the metaverse is or effectively made the case for why the billions of people currently using its social media apps would want to be part of an “embodied internet.” Worse still, the company’s initial metaverse product has proved underwhelming, and turned the metaverse into a punchline, rather than a source of anticipation.</p><h2>We still don’t know what the metaverse is for</h2><p>Meta and Zuckerberg have offered various definitions over the last year. The metaverse is the “successor to the mobile internet,” and “an embodied internet where you’re in the experience.” It’s virtual reality, but also (eventually) augmented reality. It will also, somehow, tie into our existing social graphs on Facebook and Instagram. But, unlike Facebook and Instagram, it will be interoperable with other companies’ platforms. It might have something to do with NFTs and web3.</p><p>“The defining characteristic of the metaverse is that you really feel like you're present with other people or in another place,” Zuckerberg said during an interview at SXSW in February. “You might look at documents, you might look at a website but in the future you're going to be <em>in</em> it.”</p><p>Zuckerberg might think this is explaining the beginnings of some grand vision for a future internet, but it also just sounds a lot like plain old virtual reality. Moreover, it’s telling that one of his go-to examples is “looking at documents.” Over the last year, the company has leaned hard into <a href=\"https://www.engadget.com/facebook-horizon-workrooms-oculus-vr-meeting-collaboration-110018369.html\">Horizon Workrooms</a>, its social VR experience geared toward office workers.</p><figure><img alt=\"Meta's is integrating Zoom and Microsoft Teams into VR meetings with Horizon Workrooms.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-10/acef1780-48ee-11ed-bc33-294d8da32433\" /><figcaption></figcaption><div class=\"photo-credit\">Meta</div></figure><p>When the company showed off its new high-end Quest Pro, it offered up Horizon Workrooms as one of the key experiences optimized for the new headset. You can now recreate a whole virtual workspace in VR. Soon, you’ll be able to use <a href=\"https://www.engadget.com/meta-will-integrate-zoom-and-microsoft-teams-into-horizon-workrooms-174012859.html\">a slew</a> of office and productivity software, from Zoom to Microsoft Word.</p><p>But the idea of working in VR with a headset strapped to your face is still pretty far from appealing to most people. And there are a vanishingly small number of jobs and industries where working in VR is even remotely justified.</p><p>Perhaps what’s most telling is that Meta has apparently struggled to persuade its own employees to use Workrooms. Despite making Quest 2 headsets <a href=\"https://uploadvr.com/free-quest-2-facebook-employees/\">free</a> to all employees last year, a recent push from Zuckerberg for teams to start holding meetings in VR revealed that many either hadn’t taken advantage of the offer or hadn’t set the headset up, <em>The New York Times</em><a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=c813ae39-7d58-41cb-ac66-ad830606ceef&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=The+New+York+Times&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiJjODEzYWUzOS03ZDU4LTQxY2ItYWM2Ni1hZDgzMDYwNmNlZWYiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cubnl0aW1lcy5jb20vMjAyMi8xMC8wOS90ZWNobm9sb2d5L21ldGEtenVja2VyYmVyZy1tZXRhdmVyc2UuaHRtbCIsImNvbnRlbnRVdWlkIjoiMjJkZTZjZDItMWJjNS00MzY5LTk4NmEtZDYxYTc2ODYxODQ3In0&amp;signature=AQAAAatw5DRRB8XubBl2_SzrcfFbrRtN6flGHLalPOJt_mfE&amp;gcReferrer=https%3A%2F%2Fwww.nytimes.com%2F2022%2F10%2F09%2Ftechnology%2Fmeta-zuckerberg-metaverse.html\">reported</a>.</p><h2>Meta’s metaverse is a meme for bad graphics</h2><p>Without a clear vision, it became far too easy for Meta’s critics to seize on aesthetic issues and other problems. For now, the closest thing Meta has to the “metaverse” is Horizon Worlds, its social VR playground where users are free to explore as their avatar. But the experience of actually using it is far different than the polished videos and demos Meta has shared.</p><p>This was never more apparent than when Zuckerberg earnestly posted a screenshot of his avatar in front of the Eiffel Tower and Barcelona’s Sagrada Familia to mark Horizon World’s launch in France and Spain. The screenshot was <a href=\"https://www.engadget.com/mark-zuckerberg-horizon-graphics-avatars-204551743.html\">hilariously bad</a> and quickly took on a life of its own as people mocked the “1995 level graphics.”</p><figure><img alt=\"Mark Zuckerberg's Horizon avatar.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/6f3681d0-7b1b-11ed-beff-bef54caa1494\" /><figcaption></figcaption><div class=\"photo-credit\">Meta</div></figure><p>Zuckerberg quickly promised new and improved avatars, and showed off a more realistic likeness of himself, saying that “graphics in Horizon are capable of much more.” (A <a href=\"https://twitter.com/MattNavarra/status/1562821184471040002\">post</a> on LinkedIn, which has since been deleted, later revealed that the “improved” Zuck avatar took about a month and “40 iterations” to complete.)</p><p>Then, at the company’s Connect event, Zuckerberg promised an even bigger advancement: <a href=\"https://www.engadget.com/meta-avatars-metaverse-legs-vr-virtual-reality-facebook-instagram-whatsapp-190937062.html\">legs</a>. Soon, Horizon’s cartoonish, legless avatars would be replaced with ones resembling actual, walking humans. We watched as Zuckerberg’s “full body” avatar casually strolled around Horizon Worlds. But while it was first thought to be a turning point — adding leg tracking to VR has been a notoriously tricky problem — it turned out this particular demo was <a href=\"https://www.engadget.com/meta-vr-legs-video-mocap-105007370.html\">more stagecraft</a> than actual innovation. The company later confirmed that the demo <a href=\"https://twitter.com/UploadVR/status/1580876321453838336\">was created</a> with motion capture and wasn’t live VR.</p><p>Meta still says that its avatars will eventually have legs, but it’s not clear when, or if the feature will even look like the demo.</p><h2>The metaverse is a money pit</h2><p>It’s impossible to ignore that Zuckerberg’s metaverse pivot has also coincided with the company’s worst financial performance in recent memory. Meta’s revenue has <a href=\"https://www.engadget.com/meta-facebook-q2-2022-earnings-203433373.html\">shrunk</a> for two straight quarters for the first time ever. Its stock has lost more than 60 percent of its value this year, wiping out billions of dollars.</p><p>To be fair, the metaverse isn’t entirely to blame. Apple’s anti-tracking changes in iOS have hurt the company’s advertising business. And the entire industry is reeling from an economic downturn that’s affected even the largest tech giants.</p><p>At the same time, Meta is undeniably losing vast amounts of money on its metaverse investments. Reality Labs lost $10 billion in 2021, and 2022’s losses already amounted to $9 billion by the third quarter. Those losses are <a href=\"https://www.engadget.com/meta-q3-2022-earnings-211903277.html\">expected to</a> “grow significantly” in 2023, according to the company’s CFO.</p><figure><img alt=\"Mark Zuckerberg in what's likely the company's new VR headset.\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-09/30db98a0-2e07-11ed-bee1-0e9797d5cf61\" /><figcaption></figcaption><div class=\"photo-credit\">Meta</div></figure><p>It’s no surprise, then, that Meta’s investors are starting to question whether all this metaverse stuff is really worth it. The CEO of Altimeter Capital, a longtime Meta shareholder, made headlines when he wrote an open letter to Mark Zuckerberg earlier this year that called the company’s metaverse investments “super-sized and terrifying, even by Silicon Valley standards.”</p><p>In the company’s most recent earnings call, where Zuckerberg more often fields peppy questions about the company’s ad business, one analyst also raised the issue of “experimental bets versus proven bets.”</p><p>“I think everyone wants to hear why you think this pays off,” he asked. Zuckerberg, who seemed a bit flustered by the question, replied that “the metaverse work is a longer term set of efforts that we're working on, but I think that it’s going to end up working.” Patience, he said, will be rewarded.</p>", "link": "https://www.engadget.com/how-meta-flunked-its-first-year-as-a-metaverse-company-150049067.html?src=rss", "date_published": "2022-12-20 15:00:49+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "The first weird gadget of CES 2023 is Lenovo's Swiss army lamp", "description": "<p><a href=\"https://www.engadget.com/tag/ces%202023/\">CES 2023</a> usually features some pretty eccentric gadgets, and Lenovo is kicking off that trend with the Go Desk Station with Webcam. It's designed for those of us with limited desk space, serving as a webcam, adjustable desk light, Qi wireless charger and expansion hub all in one. It doesn't compromise on any of those things, but is priced accordingly.</p><p>The primary feature is the Lenovo Go 4K Pro Webcam (also available as a standalone camera) designed for video conferencing and high-res streaming. It can stream 4K at up to 30 fps and includes autofocus and auto-framing with an adjustable field of view, along with auto ambient light adjustment, via the built-in desk light.</p><span id=\"end-legacy-contents\"></span><figure><img alt=\"Lenovo's desk light has an integrated webcam, wireless charger and 135W power input\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/f5e64460-806e-11ed-a3da-65bd4abc58f7\" style=\"height: 1252; width: 2200;\" /><figcaption></figcaption><div class=\"photo-credit\">Lenovo</div></figure><p>That desk light rides on a height-adjustable and rotating arm, and can be positioned in almost any direction to illuminate your face or objects on your desk. You can choose from three color temperature options to match your environment, including 3,000K (yellow white), 4,500K (cool white) and 6,500K (daylight), with brightness up to 1600 lux at 0.5 meters (1.5 feet).&nbsp;</p><p>It's a versatile hub, as well. It has a 135-watt USB-C power input with a full-function 65-watt USB-C port for laptop power, to start with. It also includes 15-watt Qi compliant charging pad for mobile devices, a 20W USB Type-C port, two USB Type-A 3.1 ports and an HDMI 2.0 output for external displays up to 4K at 60fps.&nbsp;&nbsp;</p><p>If you're already looking for a desk lamp, wireless charger and USB hub, this could fit the bill in just a single purchase. You'll pay for it though. The Go Desk Station with Webcam arrives in March 2023 starting at $329, or you can grab the Lenovo Go 4K Pro webcam by itself for $150, also in March next year.&nbsp;</p>", "link": "https://www.engadget.com/lenovos-desk-light-has-an-integrated-webcam-wireless-charger-and-135-w-power-input-143028207.html?src=rss", "date_published": "2022-12-20 14:30:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "What we bought: Our favorite books of 2022", "description": "<p>We may not have had quite as much unfettered reading time as we did in the lockdown days of the COVID pandemic, but Engadget’s editors have still managed to pick out, peruse and ponder a broad variety of this year’s most intriguing books. Whether we learned how to wield a wok, listened to life lessons from Hideo Kojima, or dove into the seedy underbelly of an alt-universe 1940’s San Francisco, here are a few of our favorites from 2022.</p><h2><em>Razzmatazz</em> by Christopher Moore</h2><figure><img alt=\"Razmatazz cover\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/c58dba90-7b0b-11ed-87ff-310a5b2b0aca\" /><figcaption></figcaption><div class=\"photo-credit\">Harper Collins</div></figure><p>Classic noir cinema was a staple in my house growing up — I mean, my first celebrity crush was on <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9Db21wbGV0ZS1Db2xsZWN0aW9uLUFmdGVyLUFub3RoZXItU2hhZG93L2RwL0IwMDA5R1gxQzQvP3RhZz1nZGd0MGMtcC1vLWQ4LTIwIiwiY29udGVudFV1aWQiOiI4NDg1YjBiOS05MTVkLTQ1YjktYWE2Yy04Y2ExZmM5ZWNlN2YifQ&amp;signature=AQAAAdx4RjiwKe1bS4AXNFRcXfvqClShKWiZSHzv55nMnsGE&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FComplete-Collection-After-Another-Shadow%2Fdp%2FB0009GX1C4%2F\"><em>The Thin Man</em></a> series co-star, <a href=\"https://www.imdb.com/name/nm0001485/\">Myrna Loy</a> — so any story from the days when mugs were mooks and gals were dames holds sway over my heart. But <em>The Thin Man</em>, like the rest of the media made at that time, only showed a very narrow, very male, very white view of life. Christopher Moore’s latest novel, <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9SYXp6bWF0YXp6LU5vdmVsLUNocmlzdG9waGVyLU1vb3JlLWVib29rL2RwL0IwOUNRMzk1MUYvP3RhZz1nZGd0MGMtcC1vLWQ4LTIwIiwiY29udGVudFV1aWQiOiI4NDg1YjBiOS05MTVkLTQ1YjktYWE2Yy04Y2ExZmM5ZWNlN2YifQ&amp;signature=AQAAAV4KI085Vv7VRD6P5tkDi0SleDK1rcAAIkYnOP1DpB43&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FRazzmatazz-Novel-Christopher-Moore-ebook%2Fdp%2FB09CQ3951F%2F\"><em>Razzmatazz</em></a><em>,</em> adds some much needed color to the otherwise black-and-white world of noir<em>.</em></p><span id=\"end-legacy-contents\"></span><p><em>Razzmatazz</em> is the second title for Moore’s satirical murder mystery series, following 2019’s <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9Ob2lyLU5vdmVsLUNocmlzdG9waGVyLU1vb3JlL2RwLzAwNjI0MzM5OTcvcmVmPXBkX2J4Z3lfaW1nX3NjY2xfMS8xNDAtNjk0NTEzMy0xNTczNjA5P3BkX3JkX3c9cUNIck0mY29udGVudC1pZD1hbXpuMS5zeW0uN2YwY2YzMjMtNTBjNi00OWUzLWIzZjktNjM1NDZiYjc5YzkyJnBmX3JkX3A9N2YwY2YzMjMtNTBjNi00OWUzLWIzZjktNjM1NDZiYjc5YzkyJnBmX3JkX3I9QzBSWTFUODA3MjFRTUIwNTMyRUQmcGRfcmRfd2c9cU1qWDMmcGRfcmRfcj1hZmJhZDU0Ni05NDMxLTRiOGItYmRhOC0wYWQzZTcyOGYxYWQmcGRfcmRfaT0wMDYyNDMzOTk3JnBzYz0xJnRhZz1nZGd0MGMtcC1vLWQ4LTIwIiwiY29udGVudFV1aWQiOiI4NDg1YjBiOS05MTVkLTQ1YjktYWE2Yy04Y2ExZmM5ZWNlN2YifQ&amp;signature=AQAAAcL09U2n6xp62BORKMVEjOx5ldzl5R9TdkMzX4T5dLKH&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FNoir-Novel-Christopher-Moore%2Fdp%2F0062433997%2Fref%3Dpd_bxgy_img_sccl_1%2F140-6945133-1573609%3Fpd_rd_w%3DqCHrM%26content-id%3Damzn1.sym.7f0cf323-50c6-49e3-b3f9-63546bb79c92%26pf_rd_p%3D7f0cf323-50c6-49e3-b3f9-63546bb79c92%26pf_rd_r%3DC0RY1T80721QMB0532ED%26pd_rd_wg%3DqMjX3%26pd_rd_r%3Dafbad546-9431-4b8b-bda8-0ad3e728f1ad%26pd_rd_i%3D0062433997%26psc%3D1\"><em>Noir</em></a>. In this latest installment, we’re returned to Post-WWII San Francisco as bartender Sammy “Two Toes” Tiffin and his cadre of misfit friends hustle to survive in Fog City. Now, helping disappear your best friend’s girlfriend’s abusive husband is one thing but, as the team soon learns, stealing back a possibly magical, definitely priceless, heirloom from the local Tong is another entirely — and that’s before some madman starts murdering the city’s drag kings.</p><p><em>Razzmatazz</em> is a smart and just a bit snarky adventure mystery featuring a diverse and developed cast of characters, fast-paced action that seamlessly transitions between the varying viewpoints of said ensemble and doesn’t get bogged down in world building. At around 350 pages apiece, <em>Noir</em> and <em>Razzmatazz</em> will each provide a solid weekend’s entertainment and, if you’re still looking for more Moore after that, check out 2020’s <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9VbnRpLU1vb3JlLU5vdmVsLTE1LUNocmlzdG9waGVyLWVib29rL2RwL0IwN0cxM1lEM00_dGFnPWdkZ3QwYy1wLW8tZDgtMjAiLCJjb250ZW50VXVpZCI6Ijg0ODViMGI5LTkxNWQtNDViOS1hYTZjLThjYTFmYzllY2U3ZiJ9&amp;signature=AQAAASPq4tSSAiTrTO0ZSZ9PowqwyHB0zJlOHrMMcvf5uzJS&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FUnti-Moore-Novel-15-Christopher-ebook%2Fdp%2FB07G13YD3M\"><em>Shakespeare for Squirrels</em></a>. <em>– Andrew Tarantola, Senior Editor</em></p><h2><em>Upgrade</em> by Blake Crouch</h2><figure><img alt=\"stylized double helix on blue background\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/7d6437d0-7b0b-11ed-b5bb-c71ba03eee08\" /><figcaption></figcaption><div class=\"photo-credit\">Penguin Randomhouse</div></figure><p>I always look forward to new Blake Crouch releases because his writing is vivid and fast-paced, so much so that I can see the movie version playing out in my head as I devour his latest title in just a couple of days. This year’s <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9VcGdyYWRlLU5vdmVsLUJsYWtlLUNyb3VjaC1lYm9vay9kcC9CMDlKVjlOWFhXLz90YWc9Z2RndDBjLXAtby1kOC0yMCIsImNvbnRlbnRVdWlkIjoiODQ4NWIwYjktOTE1ZC00NWI5LWFhNmMtOGNhMWZjOWVjZTdmIn0&amp;signature=AQAAAdkmK3zWsuCaNq-eTFQMHmk3a2PUmkZuwCpxDpw9Vqx3&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FUpgrade-Novel-Blake-Crouch-ebook%2Fdp%2FB09JV9NXXW%2F\"><em>Upgrade</em></a> was no exception – we’re in a world in which gene editing is real yet highly regulated, and we follow Logan Ramsay, a member of the Gene Protection Agency as he tries to apprehend those who may be involved in nefarious gene-editing activities.</p><p>But after a violent encounter on a mission, Logan starts to feel less and less like himself and more like a <em>better</em> version of himself. He can read faster, he’s physically stronger and he needs less sleep. He soon finds out his genome has been hacked, and he also discovers he’s part of a much larger plan that could change humanity as he knows it. As he works to stop this plan from being executed, he’s forced to confront some of the darkest parts of his past and the tarnished family legacy he’s been working so hard to escape.</p><p>Crouch excels at putting readers into his protagonist’s shoes, forcing them to feel the same anxiety, dread and confusion inflicting his main characters. But to think that produces an overall unpleasant reading experience would be incorrect: <em>Upgrade</em> is an intriguing thrill ride that moves at break-neck speed, while posing a lot of questions about humanity as a whole. <em>– Valentina Palladino, Senior Commerce Editor</em></p><h2><em>Notes on an Execution</em> by Danya Kukafka</h2><figure><img alt=\"a broken locket on a purple background with black lettering\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/44e92460-7b0b-11ed-bdbf-de93ac20e26c\" /><figcaption></figcaption><div class=\"photo-credit\">Harper Collins</div></figure><p>On its face, <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9Ob3Rlcy1FeGVjdXRpb24tTm92ZWwtRGFueWEtS3VrYWZrYS1lYm9vay9kcC9CMDkyOTJKU1pGP3RhZz1nZGd0MGMtcC1vLWQ4LTIwIiwiY29udGVudFV1aWQiOiI4NDg1YjBiOS05MTVkLTQ1YjktYWE2Yy04Y2ExZmM5ZWNlN2YifQ&amp;signature=AQAAAQOMntq2d_8Ft5aI01-ftfFc0K_Ip3m95W-YY1imJWsG&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FNotes-Execution-Novel-Danya-Kukafka-ebook%2Fdp%2FB09292JSZF\"><em>Notes on an Execution</em></a> may seem like a typical examination of a serial killer. The novel begins with Ansel Packer counting down his last 12 hours before he’s to be executed for killing many women. But Danya Kukafka is much less interested in this murderer as she is in telling the stories of three women who were all affected by Ansel in some way. We follow Lavender, Ansel’s mother, as a lost teenager pushed to the brink as she struggles to protect her children and herself; Hazel, Ansel’s sister-in-law who watches her twin lose herself in this toxic relationship; and Saffy, the lead investigator on Ansel’s case with more hidden trauma than you might expect buried just under the surface. But these women aren’t victims with a capital V. Instead, they work to flip the serial-killer narrative on its head by focusing our attention on the fact that, despite everything, they survived. <em>Notes on an Execution</em> is a dark, engaging story with lovely prose and a surprisingly, underlying element of hope at the end of it all. <em>– V.P.</em></p><h2><em>Our Missing Hearts</em> by Celeste Ng</h2><figure><img alt=\"a feather disintegrating into birds on a blue ombre background. ugh reese witherspoon is vouching for this book for some reason\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/eb7d4be0-7b0a-11ed-b2f7-b1f7b48d639d\" /><figcaption></figcaption></figure><p><a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9PdXItTWlzc2luZy1IZWFydHMtQ2VsZXN0ZS1OZy1lYm9vay9kcC9CMDlRQllDQzNKLz90YWc9Z2RndDBjLXAtby1kOC0yMCIsImNvbnRlbnRVdWlkIjoiODQ4NWIwYjktOTE1ZC00NWI5LWFhNmMtOGNhMWZjOWVjZTdmIn0&amp;signature=AQAAAX2-cb_N0PxSnNavrBPEm65VY7704CYzJq-vLP1HczFE&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FOur-Missing-Hearts-Celeste-Ng-ebook%2Fdp%2FB09QBYCC3J%2F\"><em>Our Missing Hearts</em></a><em>,</em> in the grand tradition of near-future dystopian fiction like <em>The Handmaid’s Tale </em>or <em>1984</em>, presents a vision of our country that feels far too close for comfort. In Ng’s third novel, she writes of a 12-year-old boy named Bird and his father, who live in a United States where laws enshrining America-first culture have been put in place following years of economic and social turmoil.</p><p>In this world, Asians have been made the scapegoat for all of America’s ills; while Asian Americans are still technically free and full citizens, many of them are under the thumb of police and subject to various degrees of violence from so-called “real” Americans. And any parents deemed to be un-America could have their children immediately confiscated – no questions asked. As in any good dystopia, books deemed unpatriotic have also been seized and destroyed, including a book of poetry by Bird’s mother, a woman who disappeared years earlier.</p><p>This story is simultaneously small and universal. The meat of the narrative focuses on Bird pushing to learn more about his mother and the circumstances of the world he’s living in, and there are only a handful of major characters. At the same time, Ng skillfully paints a plausible picture of an America that’s given in to its worst instincts. Ng has pointed out multiple times that all the atrocities being committed in <em>Our Missing Hearts</em> are things that have taken place in the US or other parts of the world already – not a comforting thought.</p><p>But as bleak as this world is, the book is filled with moments of unexpected beauty and small triumphs. Perhaps most crucially, there’s a sense that while an extremist minority currently may rule over a more sensible populace, there’s a way out of the darkness.<em> Our Missing Hearts </em>isn’t a light story, but it’s an important one, artfully told by a writer who can deftly weave together a compelling narrative with poignant social commentary. Ng may have made a big impact in popular culture with <em>Little Fires Everywhere </em>(and its accompanying Hulu miniseries), but <em>Our Missing Hearts</em> feels like her definitive work thus far. <em>– Nathan Ingraham, Deputy Editor</em></p><h2>The Creative Gene by Hideo Kojima</h2><figure><img alt=\"The Creative Gene by Hideo Kojima\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/2455a510-7b0c-11ed-9f76-53775b74126e\" /><figcaption></figcaption><div class=\"photo-credit\">Simon and Schuster</div></figure><p>Hideo Kojima is a video game designer best known for the <em>Metal Gear </em>series, which popularized the stealth genre and had a plot that could charitably be described as <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy55b3V0dWJlLmNvbS93YXRjaD92PWFhTGlMUlZlYVpBIiwiY29udGVudFV1aWQiOiI4NDg1YjBiOS05MTVkLTQ1YjktYWE2Yy04Y2ExZmM5ZWNlN2YifQ&amp;signature=AQAAAZ1uyqmvS4K5zmySA5s-muAnX_kDKxrdfBypuCiz_Uck&amp;gcReferrer=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DaaLiLRVeaZA\">ridiculous</a>. Perhaps shamefully, I am a Kojima fan. His studios’ games are often in dire need of an editor and almost constantly tow the line between insight and navel-gazing. Sometimes, they’ve also <a href=\"https://www.theguardian.com/technology/2014/apr/09/metal-gear-solid-ground-zeroes-sexual-violence\">seemed incapable</a> of treating their female characters with respect. But they are always bursting with ideas, trying things with an unmistakable voice and a ceaseless, pulverizing earnestness. His post-apocalyptic delivery sim <a href=\"https://www.engadget.com/2019-11-07-death-stranding-is-a-great-movie.html\"><em>Death Stranding</em></a><em>&nbsp;</em>is at once laughably on-the-nose (one hard-to-kill character is called “<a href=\"https://deathstranding.fandom.com/wiki/Die-Hardman\">Die-Hardman</a>” AKA: John McClane, <a href=\"https://en.wikipedia.org/wiki/John_McClane\">of course</a>), and one the most enchanting games I’ve played in the past decade.</p><p>I give you this background to help explain how I ended up reading Kojima’s book, <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9DcmVhdGl2ZS1HZW5lLWluc3BpcmVkLWNyZWF0b3ItU3RyYW5kaW5nL2RwLzE5NzQ3MjU5MVg_dGFnPWdkZ3QwYy1wLW8tZDgtMjAiLCJjb250ZW50VXVpZCI6Ijg0ODViMGI5LTkxNWQtNDViOS1hYTZjLThjYTFmYzllY2U3ZiJ9&amp;signature=AQAAARCghgfPUBpfg-5btm1WZ1edyZJXQ51sfpTxGth6VUOp&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FCreative-Gene-inspired-creator-Stranding%2Fdp%2F197472591X\"><em>The Creative Gene</em></a>, earlier this year. (It was technically published in late 2021.) Instead of telling some weirdo techno-thriller or a behind-the-scenes look at game development, though, this is a collection of previously published essays about the books, movies and other cultural objects that Kojima finds essential to his being. Like his games, it can border on hokey and self-mythologizing, but it is disarmingly honest, personal and anti-cynical.</p><p>In many ways, the <em>Metal Gear </em>games are about identity – who we are and how we got there. That’s more or less what Kojima gets at here; for about 250 pages, he raves about things he likes with a tangible verve, not to recommend them to consumers, but to explore how they’ve shaped his experience. More than a memoir, though, <em>The Creative Gene </em>is an appreciation of how art of all stripes can spark inspiration in a recyclable process.</p><p>The prose is nothing extraordinary, and there are certainly more essential subjects out there. While you don’t need to be a gamer to get something out of this, having a familiarity with Kojima’s work doesn’t hurt. Still, <em>The Creative Gene</em>’s sincerity and enthusiasm are easy to appreciate in a time of widespread detachment. <em>– Jeff Dunn, Senior Commerce Writer</em></p><h2>Sea of Tranquility by Emily St. John Mandel</h2><figure><img alt=\"fields with a moon rising over distant hills\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/59f23b90-7b0a-11ed-bda9-a7723a86e64a\" /><figcaption></figcaption><div class=\"photo-credit\">Penguin Randomhouse</div></figure><p>Emily St. John Mandel delivered one of the essential reads of the pandemic when she published <em>The Glass Hotel </em>in March 2020. It was no small feat given she previously wrote the award-winning <a href=\"https://www.engadget.com/hbo-max-teases-station-eleven-071727998.html\"><em>Station Eleven</em></a>, a novel that’s set partly after a world-ending flu. Given that there was a five-year gap between <em>Station Eleven </em>and <em>Glass Hotel</em>, I didn’t dare hope one of my favorite authors would release a new novel so soon, and that it would be as good as her previous works. Thankfully, <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=66ea567a-c987-4c2e-a2ff-02904efde6ea&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Amazon&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2NmVhNTY3YS1jOTg3LTRjMmUtYTJmZi0wMjkwNGVmZGU2ZWEiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cuYW1hem9uLmNvbS9TZWEtVHJhbnF1aWxpdHktRW1pbHktSm9obi1NYW5kZWwtZWJvb2svZHAvQjA5OURSSFRMWC8_dGFnPWdkZ3QwYy1wLW8tZDgtMjAiLCJjb250ZW50VXVpZCI6Ijg0ODViMGI5LTkxNWQtNDViOS1hYTZjLThjYTFmYzllY2U3ZiJ9&amp;signature=AQAAAbwEENLgYfyDtvTkudSm8k8J_0CmJs6Osz1IS_sPtTy9&amp;gcReferrer=https%3A%2F%2Fwww.amazon.com%2FSea-Tranquility-Emily-John-Mandel-ebook%2Fdp%2FB099DRHTLX%2F\"><em>Sea of Tranquility</em></a><em>&nbsp;</em>does not disappoint.</p><p>It shares many of the same strengths as Mandel’s past novels, including a brilliant sense of atmosphere and prose that rewards close reading. <em>Sea of Tranquility </em>is also in conversation with <em>Station Eleven</em> and <em>The Glass Hotel</em> in a way that will delight fans. That’s not to say you need to have read those books to enjoy her latest, but it may make you look at them (and Mandel’s career) in a new light. Add to that themes that will resonate with anyone who has lived through the past two years and you have one of the best books of 2022. <em>– Igor Bonifacic, Weekend Editor</em></p>", "link": "https://www.engadget.com/what-we-bought-our-favorite-books-of-2022-141533279.html?src=rss", "date_published": "2022-12-20 14:15:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "Lenovo's IdeaPad Flex 3i Chromebook offers a larger display and optional 1080p webcam", "description": "<p>Lenovo has launched the IdeaPad Flex 3i 2-in-1 Chromebook with improved features over <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?merchantId=59bdf74a-dd5e-49bf-af3d-ef9ab46255e9&amp;siteId=us-engadget&amp;pageId=1p-autolink&amp;featureId=text-link&amp;merchantName=Lenovo&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI1OWJkZjc0YS1kZDVlLTQ5YmYtYWYzZC1lZjlhYjQ2MjU1ZTkiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cubGVub3ZvLmNvbS91cy9lbi9wL2xhcHRvcHMvbGVub3ZvL2xlbm92by1lZHUtY2hyb21lYm9va3MvaWRlYXBhZC1mbGV4LTMtY2ItMTFpZ2wwNS84OGlwZmMzMTQ1MSIsImNvbnRlbnRVdWlkIjoiMDEyZTM5NmItNTI2MC00YWUyLTk5OWUtMTc3OTM3YzI4ZDQzIn0&amp;signature=AQAAAbw_qfF0SNy05p0qyK9FBlWHQ_WxSswLO8a7LU094MCT&amp;gcReferrer=https%3A%2F%2Fwww.lenovo.com%2Fus%2Fen%2Fp%2Flaptops%2Flenovo%2Flenovo-edu-chromebooks%2Fideapad-flex-3-cb-11igl05%2F88ipfc31451\">last year's</a> Flex 3i Chromebook, along with a higher price tag. The 16:10 12.2-inch display is an inch larger than before, and it can be used as a laptop, tablet or made to stand in tent-mode for entertainment. It also comes with thinner bezels and looks a fair bit less chunky than the previous model. Performance-wise, it offers the latest N-series Intel processors (the N100 or N200), up to 8GB of RAM and 128GB of storage.</p><p>Other features include an optional Full HD webcam with a physical shutter and designated mute key, along with faster connectivity via WiFi 6E. It offers up to 12 hours of battery life, an optional backlit keyboard, tuned speakers and a drop-hinge feature that lifts the keyboard for a more ergonomic typing experience. It's shipping in May 2023 starting at $350, a fair chunk more than the $190 price on the current Flex 3i.</p><span id=\"end-legacy-contents\"></span><figure><img alt=\"Lenovo's IdeaPad Flex 3i Chromebook offers a larger display and optional 1080p webcam\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/96a36c40-8068-11ed-b396-328d87d618a8\" style=\"height: 1295; width: 2000;\" /><figcaption></figcaption><div class=\"photo-credit\">Lenovo</div></figure><p>If it's an Android tablet you're after, Lenovo also took the wraps off the Tab M9 ahead CES 2023. It's essentially designed as an entertainment unit, with a 9-inch \"Netflix HD-supported\" 1,920 x 1,200 display, Dolby Atmos spatial audio support and dual stereo speakers. If you're more into books, it also offers an immersive reading mode that simulates the color of real book pages, lets you soften the tone for your eyes, and choose from various ambient background sounds.&nbsp;</p><p>It comes with a MediaTek Helio G80 Octa-Core processor, Android 12 OS, up to 128GB of storage, 13 hours of battery life, face unlocking and WiFi 5 connectivity. It arrives in Q2 2023 for $140, though it'll cost more with the optional folio case shown above.&nbsp;</p>", "link": "https://www.engadget.com/lenovos-idea-pad-flex-3-i-chromebook-offers-a-larger-display-and-up-to-a-1080-p-webcam-140048803.html?src=rss", "date_published": "2022-12-20 14:00:48+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "Lenovo updates its IdeaPad Pro and Slim laptops with the latest Intel and AMD chips", "description": "<p>We’re not that far away from CES, where we should expect new chip announcements from Intel and AMD. That’s normally followed by a raft of Windows 11 laptop announcements that use the new silicon, but Lenovo has decided to get its news out of the door well ahead of time. Unfortunately, that means there’s some vague references to next-generation chips from Intel, AMD and NVIDIA. But you can probably guess when those details will be filled in, and what they’ll likely represent.</p><p>Of the many machines Lenovo has announced today, only a handful are coming to the US, such as the IdeaPad Pro 5 and 5i. This is coming in 14- and 16-inch variants, both of which will only come with Intel’s “next-gen” Core i5 and i7 options, with the option of a 14-inch 2.2k display or a 2.8k 120Hz screen, while the 16-inch comes with a 2.5K 120Hz model by default. Lenovo adds that you can expect “enhanced performance” thanks to better thermals, allowing for a cooler and quieter experience overall. Other tweaks for these machines include a 25 percent larger touchpad, a new FHD IR webcam with a Time of Flight sensor and, for the 16-inch model, an SSD expandable storage slot.</p><span id=\"end-legacy-contents\"></span><p>As for the IdeaPad Slim, you’ll be able to pick up the Slim 5i with a 16-inch display, packing Intel’s as-yet unnamed processor. You’ll also be able to snag a 16-inch Slim 5 with options for AMD’s Ryzen 3 (7330U), 5 (7530U) or 7 (7730U) processor, although you’re stuck with a 60Hz display no matter which option you go for. With one eye on privacy, these new models get a physical shutter on the webcam. The only other major change is the greater choice in paint jobs, since you’ll now be able to grab them in Violet, Cloud Grey and Abyss Blue.</p><p>In terms of availability, Lenovo is saying that these models won’t reach the US until May 2023, with prices for the 16-inch 5i starting at $1,500. The Slim 5, meanwhile, will start at $650 for the AMD edition, while the Intel-toting 5i is priced at $750.</p>", "link": "https://www.engadget.com/lenovo-ideapad-slim-pro-laptop-update-140003422.html?src=rss", "date_published": "2022-12-20 14:00:03+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "TikTok will explain why it recommends videos on its 'For You' page", "description": "<p>The algorithm that powers TikTok’s “For You” page has long been a source of fascination and suspicion. Fans often remark on the app’s eerie accuracy, while TikTok critics have at times speculated the company could subtly manipulate its algorithm to influence its users in more nefarious ways.</p><p>Now, the company is taking <a href=\"https://newsroom.tiktok.com/en-us/learn-why-a-video-is-recommended-for-you\"><ins>new steps</ins></a> to demystify some aspects of its algorithm. The app is introducing a feature that will “help people understand why a particular video has been recommended to them.” With the update, users will be able to tap on a new question mark icon, which will list some factors that played a role in the recommendation.</p><span id=\"end-legacy-contents\"></span><p>In a blog post, the company notes that  its “recommendation system is powered by technical models” and the feature is meant to make “technical details more easily understandable.” For now, that also means the details shared sound a bit vague. For example, “this video is popular in the United States,” and “you are following Hanna” are two of the explanations provided by Tiktok. Other explanations may be based on “user interactions, such as content you watch, like or share, comments you post, or searches.”</p><p>The company says it plans to add “more granularity and transparency” to the feature over time, though, so the explanations could eventually get more detailed. A TikTok spokesperson said that future versions may also incorporate other factors that influence the app's algorithm, like an individual’s account settings.</p><p>While the feature will likely not do much to assuage <a href=\"https://www.engadget.com/why-trump-wants-to-ban-tiktok-201019879.html\"><ins>critics</ins></a> who think TikTok, or parent company ByteDance, uses the algorithm to manipulate users, it could help make its recommendations a bit more understandable to its users. And the change is part of a broader move from TikTok to prove it's willing to be more transparent about the inner workings of its app. The company has also partnered <a href=\"https://www.engadget.com/oracle-tiktok-algorithms-content-moderation-review-171742979.html\"><ins>with Oracle</ins></a> to conduct a review of its algorithms and content moderation system.</p>", "link": "https://www.engadget.com/tiktok-will-explain-recommendations-algorithm-for-you-page-130016909.html?src=rss", "date_published": "2022-12-20 13:00:16+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "The Morning After: We tried Dyson’s air-purifying headphones", "description": "<p>Dyson’s Zone is a headset-visor that processes the air you breathe and pumps it, well, into your face. Now we know the price ($949!) and launch date (March 2023), the company invited press to strap the baffling device on and test it a little more extensively.</p><p>In a dark blue with copper accents, it looks a little subtler than the press images. But it’s still going to turn heads. The Dyson Zone is not designed to protect against COVID-19 or other viruses, as it does not seal to your face. The air purifier filters have a dual-layer design with potassium-enriched carbon to capture acidic gasses. The company claims the filters will block 99 percent of particles, including those as small as 0.1 microns for &quot;filtering city fumes and pollutants.&quot; However, you can use inserts like an N95 mask attachment – also offered by Dyson.</p><p>You can check out Engadget’s Cherlynn Low <a href=\"https://www.engadget.com/dyson-zone-air-purifying-headphones-hands-on-video-163050650.html\">wearing the Dyson Zone around New York</a>.</p><p>– Mat Smith</p><p><em>The Morning After isn’t just a</em><a href=\"https://www.engadget.com/about/newsletter/\"><em> newsletter</em></a><em> –  it’s also a daily podcast. Get our daily audio briefings, Monday through Friday, by</em><a href=\"https://www.engadget.com/2019-08-01-engadget-podcasts.html\"><em> subscribing right here</em></a><em>.</em></p><h3>The biggest stories you might have missed</h3><ul><li><p><a href=\"https://www.engadget.com/apples-11-inch-i-pad-pro-m-2-drops-to-a-new-all-time-low-of-699-193433630.html\">Apple's 11-inch iPad Pro M2 drops to a new all-time low of $699</a></p></li><li><p><a href=\"https://www.engadget.com/epic-games-ftc-settlement-fortnite-170857237.html\">Epic Games will pay $520 million to settle FTC's 'Fortnite' case </a></p></li><li><p><a href=\"https://www.engadget.com/tech-companies-union-labor-2022-150022946.html\">The year organized labor finally took root in big tech </a></p></li><li><p><a href=\"https://www.engadget.com/what-we-bought-our-favorite-gadgets-of-2022-irl-153051451.html\">Our favorite gadget purchases of 2022</a></p></li><li><p><a href=\"https://www.engadget.com/kia-ev6-gt-first-drive-video-050142389.html\">Kia’s EV6 GT crams performance into a great EV</a></p></li></ul><p></p><h2><a href=\"https://www.engadget.com/it-looks-like-elon-musk-is-going-to-find-someone-new-to-run-twitter-121055836.html\">Elon Musk will find someone else to run Twitter, according to his poll</a></h2><h3>He asked users if he should step down, and they decisively voted yes.</h3><h3></h3><p>Elon Musk put his own leadership of Twitter on the line at the weekend. &quot;Should I step down as head of Twitter? I will abide by the results of this poll,&quot; he tweeted. The poll ended and 57.5 percent of users voted &quot;Yes,&quot; compared to 42.5 percent who voted no (with 17,502,391 votes) – a decisive 15-point margin. It remains to be seen if (and how, and when) Musk will abide by his poll, as he has yet to issue any comment about the results. Shortly after publishing the vote (and when it was already tilting toward Yes), he tweeted &quot;as the saying goes, be careful what you wish, as you might get it.&quot;</p><p>The vote follows a flurry of activity on Twitter after it announced a sudden rule change prohibiting users from linking to competing platforms and banning several influential users soon after. A massive backlash ensued, prompting an apology from Musk, who also tweeted that &quot;going forward, there will be a vote for major policy changes.&quot; Then, in yet another poll yesterday, @TwitterSafety asked users whether it should &quot;have a policy preventing the creation of or use of existing accounts for the main purpose of advertising other social media platforms.&quot;</p><p><a href=\"https://www.engadget.com/it-looks-like-elon-musk-is-going-to-find-someone-new-to-run-twitter-121055836.html\"><strong>Continue reading.</strong></a></p><p></p><h2><a href=\"https://www.engadget.com/final-fantasy-pixel-remaster-series-nintendo-switch-sony-playstation-4-spring-2023-173026080.html\">The Final Fantasy 'Pixel Remaster' series heads to Switch and PS4</a></h2><h3>And you can buy a pricey physical edition of the first six games.</h3><p></p><a href=\"https://www.engadget.com/final-fantasy-pixel-remaster-series-nintendo-switch-sony-playstation-4-spring-2023-173026080.html\"><figure><img alt=\"TMA\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/c191f940-8058-11ed-9fff-f29a973e06d7\" /><figcaption></figcaption><div class=\"photo-credit\">Square Enix</div></figure></a><p>If you were looking for a late (and spendy) Christmas gift for your favorite Engadget newsletter editor (hi, me), Square Enix has you covered. To celebrate the Pixel Remaster series’ arrival on Switch and PlayStation, the company is selling a limited-edition bundle of all six entries in the Pixel Remaster series – <em>Final Fantasy, Final Fantasy II, Final Fantasy III, Final Fantasy IV, Final Fantasy V </em>and<em> Final Fantasy VI</em> – as well a vinyl soundtrack set, a 128-page art book and a set of pixel art figurines. A mere $260 to make my Christmas.</p><p><a href=\"https://www.engadget.com/final-fantasy-pixel-remaster-series-nintendo-switch-sony-playstation-4-spring-2023-173026080.html\"><strong>Continue reading.</strong></a></p><p></p><h2><a href=\"https://www.engadget.com/best-nintendo-switch-games-160029843.html\">The best Nintendo Switch games for 2023</a></h2><h3>A guide for beginners, from A to Z trigger.</h3><h3></h3><p>In time for holiday shopping, we’ve updated and expanded our guide to the best Switch games, covering all the major games that have wowed us since the console’s launch. Sure, there’s Zelda and Mario in here, but there’s also a bug knight, a witch with guns on her shoes and a skateboarding world to explore.</p><p><a href=\"https://www.engadget.com/best-nintendo-switch-games-160029843.html\"><strong>Continue reading.</strong></a></p><p></p><h2><a href=\"https://www.engadget.com/instagram-2022-recap-reel-bad-bunny-150043505.html\">Instagram lets you create your own 2022 Recap Reel</a></h2><h3>Select at least three photos or videos and the app will automatically combine them into a Reel.</h3><a href=\"https://www.engadget.com/instagram-2022-recap-reel-bad-bunny-150043505.html\"><figure><img alt=\"TMA\" src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-12/c1603ae0-8058-11ed-b8f7-73476f4b780c\" /><figcaption></figcaption><div class=\"photo-credit\">Instagram</div></figure></a><p>Instagram has been placing a bigger focus on Reels this year, and that extends to how users create their 2022 Recap – whether you want it to or not. Select at least three photos or videos and Instagram will automatically stitch these together into a Reel with narration templates from the likes of Bad Bunny, Priah Ferguson and DJ Khaled. Hopefully, those can be toggled off, too.</p><p>Reels have been a major focus for Meta over the past year. Across Instagram and Facebook, the company now says Reels are played over 140 billion times every day. Meta has been bolstering its answer to TikTok by making it easier to create Reels, launching an in-app Reels scheduler and ways to post to Reels from third-party apps.</p><p><a href=\"https://www.engadget.com/instagram-2022-recap-reel-bad-bunny-150043505.html\"><strong>Continue reading.</strong></a></p><p></p><span id=\"end-legacy-contents\"></span><h2><a href=\"https://www.engadget.com/eu-meta-dominance-limiting-competitors-facebook-marketplace-142748760.html\">European Commission tells Meta that Facebook Marketplace is unfair to rivals</a></h2><h3>It 'abused its dominant position.'</h3><h3></h3><p>Europe has hit Facebook owner Meta with a complaint that its Marketplace classified service is unfair to competitors. By tying its main social media site to Marketplace, it has a &quot;substantial distribution advantage&quot; over rivals, the EU Commission wrote in a press release.</p><p>&quot;With its Facebook social network, Meta reaches globally billions of monthly users and millions of active advertisers,&quot; EU Antitrust Commissioner said in a statement. &quot;Our preliminary concern is that Meta ties its dominant social network, Facebook, to its online classified ad services called Facebook Marketplace. This means that users of Facebook automatically have access to Facebook Marketplace, whether they want it or not.&quot; This all infringes on EU rules that prohibit the abuse of a dominant market position. The EU has the power to impose a fine of up to 10 percent of Meta's annual revenue and prohibit the behavior. Meta's head of EMEA competition said the &quot;claims made by the European Commission are without foundation.&quot;</p><p><a href=\"https://www.engadget.com/eu-meta-dominance-limiting-competitors-facebook-marketplace-142748760.html\"><strong>Continue reading.</strong></a></p><p></p><span id=\"end-legacy-contents\"></span><h2><a href=\"https://www.engadget.com/oneplus-11-5g-buds-pro-2-reveal-event-date-140054267.html%20https://www.engadget.com/...\">OnePlus 11 5G launch event set for February 7th</a></h2><h3>The Alert Slider and Hasselblad camera tuning are back.</h3><p></p><p>OnePlus has revealed when it will formally show off its flagship products for 2023. The Cloud 11 event will take place in New Delhi, India, on February 7th. The company will showcase the OnePlus 11 5G, OnePlus Buds Pro 2 and more. Along with revealing the event date, OnePlus said it would bring a couple of fan-favorite features back for its next flagship smartphone. The OnePlus 11 will once again feature the company's Alert Slider, which offers an easy way to shift between silent, vibrate and alert modes.</p><p><a href=\"https://www.engadget.com/oneplus-11-5g-buds-pro-2-reveal-event-date-140054267.html%20https://www.engadget.com/...\"><strong>Continue reading.</strong></a></p>", "link": "https://www.engadget.com/the-morning-after-we-tried-dysons-air-purifying-headphones-121506892.html?src=rss", "date_published": "2022-12-20 12:15:06+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "Meta reconfirms its commitment to the metaverse", "description": "<p>While acknowledging that 2022 was &quot;harder than we expected&quot; for its metaverse plans, Meta remains committed to the technology, Reality Labs CTO Andrew Bosworth wrote in a <a href=\"https://www.theverge.com/2022/12/19/23516964/meta-half-reality-labs-ar-vr-andrew-bosworth-blog-post\">blog post</a>. To that end, the company is planning to put 20 percent of its total spending toward Reality Labs in 2023, with half of that going directly toward augmented reality (AR) initiatives — around the same amount as last year.&nbsp;</p><p>Meta was <a href=\"https://www.theguardian.com/business/nils-pratley-on-finance/2022/nov/02/mark-zuckerberg-metaverse-is-a-joke-not-shared-equally-with-investors\">criticized</a> this year for putting billions toward metaverse projects and seeing a <a href=\"https://www.engadget.com/meta-q3-2022-earnings-211903277.html\">loss of $9.4 billion</a> from Reality Labs through the first three-quarters of 2022. &quot;Economic challenges across the world, combined with pressures on Meta’s core business, created a perfect storm of skepticism about the investments we’re making,&quot; Bosworth acknowledged.</p><span id=\"end-legacy-contents\"></span><p>However, reversing course now could produce &quot;disastrous consequences,&quot; he added. Noting that daily active Facebook users (DAUs) were at an all-time high, the 20 percent investment in Reality Labs &quot;makes sense for a company committed to staying at the leading edge&quot; of AR tech.&nbsp;</p><p>While Reality Labs is losing money, the spending enabled Meta to develop &quot;foundational pieces of technology&quot; for the future, Bosworth said. Specifically, Meta shipped the Quest Pro headset with mixed reality and eye and face tracking that have been adopted by developers, creators and builders. &quot;We’ll be living with the benefits of this work for decades to come.&quot;</p><p>It looks like Meta and its investors will need to stay patient, though, as the company's vision for immersive AR glasses is years off. &quot;Our vision for true AR glasses will require years of progress making our devices slimmer, lighter, faster, and more powerful, all while consuming way less battery power and generating much less heat,&quot; according to Bosworth.</p><p>In the shorter term, Reality Labs is working to improve its incredibly basic avatar system, with more news coming in 2023. It's also planning to help Horizon Worlds &quot;flourish,&quot; will introduce a Meta Question Gaming Showcase in the spring and reveal the &quot;successor to the Meta Quest 2&quot; sometime next year.&nbsp;</p><p>Virtual reality pioneer John Carmack <a href=\"https://www.engadget.com/john-carmack-leaves-meta-043202664.html\">recently left Meta</a>, while criticizing the company's lack of efficiency. Bosworth also acknowledged the likely arrival of Apple's AR headset and HTC's Meta Quest rival likely coming in 2023 Given all that, Meta likely wanted to assure users and investors alike that the company is staying the course on AR, despite the challenges.</p>", "link": "https://www.engadget.com/meta-reconfirms-its-commitment-to-the-metaverse-120640616.html?src=rss", "date_published": "2022-12-20 12:06:40+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.engadget.com/rss.xml", "title": "Almost 200 nations promise to protect 30 percent of the planet's land and oceans", "description": "<p>Nearly 200 countries have <a href=\"https://twitter.com/UNBiodiversity/status/1604917261365641227\">agreed</a> to protect 30 percent of Earth's lands and oceans by 2030. The <a href=\"https://www.cbd.int/doc/c/e6d3/cd1d/daf663719a03902a9b116c34/cop-15-l-25-en.pdf\">deal</a> was reached early this morning at the UN Biodiversity Conference (COP15) in Montreal following two weeks of negotiations. The only holdouts to the deal were the US and the Vatican, though the Biden administration has a <a href=\"https://www.washingtonpost.com/politics/2022/11/22/report-details-how-biden-can-protect-30-percent-us-lands-waters-by-2030-without-congress/\">domestic plan</a> to conserve 30 percent of US land and water by 2030.&nbsp;</p><p>With the agreement, each participating country agrees to hitting over 20 environmental targets by the end of the decade. A key condition is the so-called 30x30 plan to protect at least 30 percent of land, inland water and coastal areas by 2030. That forms the basis of an international agreement similar to the<a href=\"https://www.engadget.com/us-rejoin-paris-agreement-official-190909769.html\"> 2015 Paris climate accord</a>.&nbsp;</p><span id=\"end-legacy-contents\"></span><p>Along with the protection of habitats, nations have pledged to reduce pesticide risks by 50 percent, reduce nutrient runoff from farms and the rate at which invasive species are introduced to ecosystems.</p><div id=\"78b4adf9eb994fb9a3a9b89d57904a62\"><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">The Plenary: Adoption of Decisions has officially started! 🌿<br /><br />Watch live in order to learn what is happening at <a href=\"https://twitter.com/hashtag/COP15?src=hash&amp;ref_src=twsrc%5Etfw\">#COP15</a> 🌱<br /><br />🎥 : <a href=\"https://t.co/pl4ZsxsZ76\">https://t.co/pl4ZsxsZ76</a><a href=\"https://t.co/p3Blysb4qm\">pic.twitter.com/p3Blysb4qm</a></p>— UN Biodiversity (@UNBiodiversity) <a href=\"https://twitter.com/UNBiodiversity/status/1604747716365619200?ref_src=twsrc%5Etfw\">December 19, 2022</a></blockquote></div><p>Nations now have eight years to stop the loss of biodiversity being driven by humans due rainforest destruction, species exploitation, pollution and more. Previous agreements, like the biodiversity targets set at Aichi, Japan in 2010, saw nations fail to achieve the goals set. This time, though, there's a monitoring framework to keep track of progress.&nbsp;</p><p>In addition to protecting species, the <a href=\"https://www.cbd.int/doc/c/e6d3/cd1d/daf663719a03902a9b116c34/cop-15-l-25-en.pdf\">draft COP15 agreement</a> urges nations to recognize and respect &quot;the rights of indigenous peoples and local communities, including over their traditional territories.&quot; However, <a href=\"https://www.amnesty.org/en/latest/news/2022/12/biodiversity-cop15-biodiversity-deal-a-missed-opportunity-to-protect-indigenous-peoples-rights/\">Amnesty International</a> wrote that the deal was a &quot;missed opportunity to protect indigenous peoples' rights,&quot; as it didn't explicitly recognize their lands and territories as a separate category of conserved area.</p><p>Another point of disagreement was between wealthy and poor countries over funds. Nations in South America and Africa that house the world's largest rainforests wanted assurances from rich countries that they'll receive money to battle poaching, illegal deforestation and other issues, according to <a href=\"https://www.washingtonpost.com/climate-solutions/2022/12/19/cop15-biodiversity-wildlife-extinction/\"><em>The Washington Post</em></a>.&nbsp;</p><p>At one point in negotiations, delegates from developing countries walked out of on talks over funding issues. The agreement must &quot;align the resources and the ambitions,&quot; said Columbia's environmental minister Susana Muhamad. The Democratic Republic of Congo's environment minister, Ève Bazaiba, added that &quot;when it comes to fauna, we need to have the means to achieve this objective.&quot;&nbsp;</p><p>The COP15 agreement follows a breakthrough deal at the <a href=\"https://www.engadget.com/cop27-climate-agreement-173357879.html\">COP27 climate conference</a>, approving a climate damage fund for developing nations. How well the plan will be implemented remains to be seen, though. &quot;While agreements are great, if we’re going to save life on Earth, now we have to roll up our sleeves and do it,&quot; the Center for Biological Diversity's Tanya Sanerib <a href=\"https://biologicaldiversity.org/w/news/press-releases/biodiversity-summit-agrees-to-protect-one-third-of-planet-by-2030-2022-12-19/\">wrote</a>. &quot;The planet faces an extinction crisis like none ever before witnessed by humankind, with 28 percent of species across the global facing extinction.&quot;</p>", "link": "https://www.engadget.com/almost-200-nations-promise-to-protect-30-percent-of-planets-land-and-oceans-095458113.html?src=rss", "date_published": "2022-12-20 09:54:58+00:00", "persistent": false, "user": null, "language": "en-US"}]