{"entries": [{"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-20/wielka-brytania-ekspert-odradza-masturbacji-w-okresie-swiat-taka-praktyka-moze-byc-niebezpieczna/", "title": "Wielka Brytania. Ekspert odradza masturbacji w okresie świąt. Taka praktyka może być niebezpieczna", "date_published": "2022-12-20 21:50:00+00:00", "description": "Nie zaleca się masturbacji ozdobami świątecznymi – apeluje w rozmowie z NeedToKnow.Online brytyjska ginekolog dr Sarah Welsh. Ekspertka wymieniła wiele niebezpieczeństw, jakie niesie ze sobą autoerotyzm z wykorzystaniem świątecznych gadżetów.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-20/anglia-zapadl-wyrok-w-sprawie-mordercy-polaka-mezczyzna-spedzi-co-najmniej-27-lat-w-wiezieniu/", "title": "Anglia. Zapadł wyrok w sprawie mordercy Polaka. Mężczyzna trafi do więzienia na wiele lat", "date_published": "2022-12-20 21:42:00+00:00", "description": "30-letni Grant Richard Harding został skazany za zabicie Roberta Jadeckiego, który był bezdomnym Polakiem. Policja stwierdziła, że był to brutalny i niesprowokowany atak na tle rasowym. Mężczyzna spędzi w więzieniu co najmniej 27 lat.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-20/chiny-awaryjne-ladowanie-boeinga-767-w-hongkongu-z-prawego-silnika-wydobywal-sie-ogien/", "title": "Chiny. Awaryjne lądowanie Boeinga 767 w Hongkongu. Z prawego silnika wydobywał się ogień", "date_published": "2022-12-20 20:42:00+00:00", "description": "Chwile grozy przeżyła we wtorek załoga Boeinga 767, który wykonywał lot UA2831 z Honkongu do Guam. Po kilkudziesięciu minutach w powietrzu maszyna wróciła na lotnisko. Powodem awaryjnego lądowania były płomienie, które wydobywały się z prawego silnika.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-20/ukraina-pozar-w-rosyjskiej-bazie-wojskowej-w-mariupolu-skuteczny-atak-dywersji/", "title": "Ukraina. Pożar w rosyjskiej bazie wojskowej w Mariupolu. \"Skuteczny atak dywersji\"", "date_published": "2022-12-20 19:19:00+00:00", "description": "Płonie baza rosyjskich wojsk w Mariupolu - poinformowali przedstawiciele ukraińskiego ruchu oporu. Spłonęło mienie zrabowane przez żołnierzy podczas wojny - oznajmił we wtorek proukraiński doradca mera Mariupola Petro Andriuszczenko.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-20/afganistan-talibowie-zamykaja-uniwersytety-dla-kobiet-trwa-kryzys-edukacji/", "title": "Afganistan. Talibowie zamykają uniwersytety dla kobiet. Trwa kryzys edukacji", "date_published": "2022-12-20 18:51:00+00:00", "description": "Talibowie ogłosili zamknięcie uniwersytetów dla kobiet w Afganistanie - podaje BBC. Decyzja została zawarta w liście ministra szkolnictwa wyższego i oczekuje się, że wejdzie w życie w trybie natychmiastowym.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-20/paraliz-na-lotniskach-dziesiatki-lotow-odwolanych/", "title": "Paraliż na lotniskach. Dziesiątki lotów odwołanych", "date_published": "2022-12-20 16:59:00+00:00", "description": "British Airways odwołuje dziesiątki lotów. Tym samym blisko 5 tys. pasażerów zostało skazanych na wielogodzinne oczekiwanie na lotniskach w Europie, Azji i USA. Główne brytyjskie linie lotnicze przepraszają za opóźnienia. Klienci dają z kolei upust swoim frustracjom w mediach społecznościowych, publikując nagrania i relacje z hali lotniska. Przyczyną chaosu ma być... usterka techniczna.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-20/peru-naukowcy-odkryli-ponad-sto-geoglifow-na-plaskowyzu-nazca/", "title": "Peru. Naukowcy odkryli ponad sto geoglifów na płaskowyżu Nazca", "date_published": "2022-12-20 15:41:00+00:00", "description": "Ponad 160 rysunków wykonanych metodą nasypową odkryli na płaskowyżu Nasca w Peru naukowcy z japońskiego Yamagata University. Figury pochodzące sprzed dwóch tysięcy lat mają średnio od dwóch do sześciu metrów i przedstawiają ludzi, koty, węże, gwanako (ssaki z rodziny wielbłądowatych) czy alpaki.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-20/lionel-messi-wygral-z-kurzym-jajkiem-zdjecie-argentynczyka-naj-popularniejsze-na-instagramie/", "title": "Lionel Messi wygrał z kurzym jajkiem. Zdjęcie Argentyńczyka najpopularniejsze na Instagramie", "date_published": "2022-12-20 14:39:00+00:00", "description": "Lionel Messi wznoszący puchar świata, to kadr, który zagościł na instagramowym profilu piłkarza. Po niedzielnym zwycięstwie Argentyny z Francją, kapitan mistrzów świata nie czekał długo na nowe wyzwanie. Tym razem był to pojedynek nie na boisku, a w sieci, przeciwnikiem zaś było... zdjęcie kurzego jaja. Okazało się, że i tym razem Argentyńczyk był nie do pobicia.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-20/wojna-w-ukrainie-porzucony-rosyjski-sklad-na-wyzwolonych-terenach-bron-i-amunicje-przejela-armia/", "title": "Wojna w Ukrainie. Porzucony rosyjski arsenał. Broń i amunicję przejęła ukraińska armia", "date_published": "2022-12-20 13:59:00+00:00", "description": "Ukraińska Służba Bezpieczeństwa przeprowadziła operację poszukiwania i zabezpieczania uzbrojenia porzuconego przez Rosjan w obwodzie czernihowskim na północnym wschodzie kraju. Odnaleziono znaczne ilości amunicji i broni, w tym setki sztuk rakiet do wyrzutni Grad, ręczne granatniki przeciwpancerne i amunicję do nich oraz kilkadziesiąt skrzyń z granatami. Wszystko przejęła armia.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-20/wojna-rosja-ukraina-rosyjski-gazociag-w-ogniu-potezna-eksplozja/", "title": "Wojna Rosja-Ukraina. Rosyjski gazociąg w ogniu. Eksportuje gaz do Europy", "date_published": "2022-12-20 12:37:00+00:00", "description": "W rosyjskiej Republice Czuwaskiej doszło do potężnej eksplozji - informuje ukraińska agencja informacja TSN. Jak potwierdza Reuters, podczas planowanych prac serwisowych wybuchł rosyjski gazociąg, który transportuje paliwo do Europy. W mediach społecznościowych pojawiły się nagrania z pożaru. Według agencji TASS wskutek eksplozji zginęły trzy osoby.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-20/niemcy-sad-skazal-97-latke-za-zbrodnie-wojenne-wyrok-dwa-lata-w-zawieszeniu/", "title": "Niemcy. Sąd skazał 97-latkę za zbrodnie wojenne. Wyrok: dwa lata w zawieszeniu", "date_published": "2022-12-20 10:52:00+00:00", "description": "Sąd w Niemczech skazał 97-latkę za pomoc i podżeganie do zabójstwa 10,5 tys. osób w czasie II wojny światowej - podaje Reuters. Kobieta pracowała jako sekretarka w niemieckim obozie koncentracyjnym Stutthof na terenie dzisiejszego Sztutowa.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-20/isw-wladimir-putin-nie-przekonal-aleksandra-lukaszenki-do-dalszej-integracji-z-rosja/", "title": "Spotkanie Putina i Łukaszenki. Eksperci analizują, co chciał osiągnąć Kreml", "date_published": "2022-12-20 09:21:00+00:00", "description": "Alaksandr Łukaszenka prawdopodobnie udaremnił wysiłki Władimira Putina, który dążył do zmuszenia Białorusi do dalszej integracji z Rosją - ocenił amerykański Instytut Badań nad Wojną, komentując poniedziałkową wizytę prezydenta Rosji na Białorusi. Z kolei sekretarz Rady Bezpieczeństwa Narodowego i Obrony Ukrainy Ołeksij Daniłow ocenił, że Putin chciał namówić Łukaszenkę do zaatakowania Ukrainy.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-20/usa-komisja-sledcza-rekomenduje-postawienie-zarzutow-donaldowi-trumpowi/", "title": "USA: Komisja śledcza rekomenduje postawienie zarzutów Donaldowi Trumpowi", "date_published": "2022-12-20 05:20:00+00:00", "description": "Komisja śledcza Izby Republikanów wydała rekomendację dla prokuratury federalnej - sugeruje w niej postawienie czterech zarzutów karnych byłemu prezydentowi USA, Donaldowi Trumpowi. Mają one być związane ze szturmem na Kapitol 6 stycznia 2021 roku i dotyczyć m.in. podżegania do przeprowadzenia przewrotu.", "persistent": false, "language": "pl-PL"}], "source url": "https://www.polsatnews.pl/rss/swiat.xml", "source title": "Polsat News"}