[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCxt2r57cLastdmrReiQJkEg", "title": "How The Media Promotes Transphobia", "description": "Watch this video ad-free on Nebula: https://nebula.tv/videos/tomnicholas-how-the-media-promotes-transphobia\n\nA video about transphobia, the British media’s obsession with the so-called “trans debate” and What is a Woman? by Matt Walsh and The Daily Wire.\n\nWritten, directed and presented by Tom Nicholas.\n\nEditing and music by Neil Farrell.\n\n*Chapters*\n\n00:00 Introduction: Transphobia in the Media\n01:14 1. What is a Woman?\n13:22 CuriosityStream & Nebula\n16:09 2. The \"Trans Debate\" in the UK\n29:38 3. How to Make Hate Sound Respectable\n43:16 4. Re-Humanising the Trans Debate\n\n*Bibliography*\n\nYou can find an annotated bibliography for this video on my website, here: https://tomnicholas.com/2022/10/how-the-media-promotes-transphobia/\n\n*Some Copy About this Video for the YouTube Algorithm*\n\nThe so-called “trans debate” has come to dominate the news media.\n\nIn America, right-wing provocateurs at outlets such as Fox News and The Daily Wire release constant attacks on trans women, trans men and non-binary people. In the UK, this trend is even more widespread, with many outlets which describe themselves as “impartial” or even “liberal” similarly filling airtime and column inches with spurious “debates” about trans rights and healthcare.\n\nBut, how does the more openly cruel and hateful transphobia that is more prevalent in the US compare with the supposedly more “polite”, “respectable” transphobia which cloaks the anti-trans moral panic in the UK?\n\nIn this month’s video, we take a look at a bunch of interviews which have been conducted by mainstream journalists with senior British politicians over the past 18 months and compare them with excerpts from What is a Woman?, the provocative transphobic pseudo-documentary presented by Matt Walsh and released by The Daily Wire earlier this year.\n\nIn doing so, hopefully we can uncover something about the dangers of the so-called “trans debate” and what journalists and right-wing politicians are really trying to achieve with this current obsession with questions about the definition of womanhood.\n\nSupport the channel on Patreon at https://patreon.com/tomnicholas\n\nIf you've enjoyed this video and would like to see more including my What The Theory? series in which I provide some snappy introductions to key theories in the humanities as well as video essays and more then do consider subscribing.\n\nThanks for watching!\n\nTwitter: http://twitter.com/tom_nicholas\nInstagram: http://instagram.com/tomnicholaswtf\nPatreon: http://patreon.com/tomnicholas\nWebsite: http://www.tomnicholas.com\n\nSelect footage courtesy of Getty\n\n#Transphobia #WhatIsAWoman #TomNicholas", "link": "https://www.youtube.com/watch?v=oAMM3l156Oo", "date_published": "2022-10-14 19:00:09+00:00", "persistent": false, "user": null, "language": "en-US"}]