[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Uncharted Franchise Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down more of the weaponry of the Uncharted franchise, including the INSAS rifle, the P90, and an ancient Flintlock pistol.\n\n00:00 - Opening\n00:38 - Raffica (Uncharted 4: A Thief’s End)\n01:57 - Barok .44 (Uncharted 4: A Thief’s End)\n03:15 - Flintlock Pistol (Uncharted 4: A Thief’s End)\n05:52 - Lantern Mounted Flintlock (Uncharted 4: A Thief’s End)\n07:11 - MP34a (Uncharted 4: A Thief’s End)\n08:46 - China Lake Grenade Launcher (Uncharted 4: A Thief’s End)\n09:51 - FAL (Uncharted 4: A Thief’s End)\n11:34 - Beretta ARX-160 (Uncharted 4: A Thief’s End)\n12:49 - INSAS (Uncharted: The Lost Legacy)\n14:50 - P90 (Uncharted: The Lost Legacy)\n16:18 - US-AN 12 Auto Shotgun (Uncharted: The Lost Legacy)\n17:16 - Carrigan 53 (Uncharted: The Lost Legacy)\n18:21 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of the Uncharted franchise and compares them to their real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=qFE94bb7lEM", "date_published": "2022-10-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Minecraft Live 2022", "description": "Minecraft Live 2022 is starting soon, are you ready? Do you have all the snacks you need? Plenty of beverages? It’s important to hydrate! Have you cast your mob vote yet? From October 14, noon EDT you will be able to cast vote until the show starts! Read more and cast your vote here:\r\nhttps://Minecraft.net/live\r\n\r\n#minecraftlive #gaming", "link": "https://www.youtube.com/watch?v=xh_FS3QuOQk", "date_published": "2022-10-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Modern Warfare 2 - Why I'm Cautiously Optimistic", "description": "From Task Force 141's return in the cinematic campaign, to a robust multiplayer, and a fresh clean slate for Warzone 2.0, here are the biggest reasons I'm hyped for Call of Duty: Modern Warfare 2 and a few things that have me concerned.\n\nCall of Duty Modern Warfare 2 is coming real soon and I’ve been waiting for this game ever since the post credits cutscene of 2019’s Modern Warfare. So here’s what I’m looking forward to, and what I’m not looking forward to in both the campaign & multiplayer.\n\nFrom movie style set pieces, to wicked plot twists, and sick villains, the cod campaigns are something I look forward to every release. Call me casual but I know I’m not the only one who was disappointed when Black Ops 4 didn’t have a campaign. Now so far we’ve only seen the reveal of the Dark Water mission and snippets from the brand new campaign trailer released earlier. Dark Water looked dope to me, but some people online felt that it looked like a rehash of the original Modern Warfare’s opening ship mission which, fair! The cutscenes from the new trailer though? Dude seriously, I had to pause and double take because I thought this was a live-action trailer, the cgi and cutscenes look really awesome and I can not wait to bust it out on my shiny Series X or PC. \n\nUnfortunately, in multiplayer, Activision likes to mess with everything it touches, and a big part of me is warily waiting for something to happen with Modern Warfare 2’s live service model, especially from a “give me more money” point of view. If not at launch, then almost certainly in future season passes. Modern Warfare 2019 was really tame at launch when it came to cosmetics and microtransactions with a lot of skins being pretty neat mil-sim style stuff. Then along came Warzone and suddenly we got crazier and crazier skins compounded with Black Ops and Vanguard all transitioning their skins across games.\n\nModern Warfare 2 is right around the corner with a weird rolling launch. We’ve got the campaign coming up first in an early access period, then the official base launch with multiplayer, and Warzone 2.0 at its heels with a November launch. We've all enjoyed our time with the multiplayer beta so far so be sure to subscribe for more guides, gameplay, livestreams, and of course our official review score once the game launches. \n\n\nTimestamps: \n\n0:00 Intro\n0:14 Why I'm Excited for the Campaign\n04:02 - Why I'm Excited for the Multiplayer\n07:32 - Campaign & Spec Ops Concerns\n09:24 - The Activision Problem\n\n\n#gaming #cod #modernwarfare2", "link": "https://www.youtube.com/watch?v=dykkxgTpF9o", "date_published": "2022-10-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Minutes of Dead Space Remake Gameplay", "description": "Dead Space Remake looks as spooky as ever, and now with a fresh coat of paint in this remake. Check out 10 minutes of gameplay from the 2nd and 3rd chapter of the campaign!\n\n#deadspace #gaming", "link": "https://www.youtube.com/watch?v=pVcE0EIjJL0", "date_published": "2022-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "11 Minutes Of Warhammer 40,000 Darktide Psyker Gameplay (Closed Beta)", "description": "The Warhammer 40,000: Darktide closed beta is showing off new classes including Psyker, Ogryn, and Sharpshooter. In this gameplay clip we're showcasing an early run with the Psyker Class who are magic-users specializing in crowd control. \n\n#gaming #warhammer40k  #gamespot", "link": "https://www.youtube.com/watch?v=nHH-FMyRJTI", "date_published": "2022-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dead Space 14th Anniversary Livestream", "description": "Get an extensive look at Dead Space Remake with Creative Director Roman Campos-Oriola and Senior Producer Philippe Ducharme as they celebrate this important 14th anniversary.\r\n\r\n#deadspace #gaming", "link": "https://www.youtube.com/watch?v=eAP5t5JH61c", "date_published": "2022-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dead Space Remake vs Original Comparison", "description": "The Dead Space remake is looking to overhaul and change the original 2008 horror classic. From graphical improvements, rewritten dialogue, and new gameplay mechanics. This video highlights some of the biggest changes we found in chapters 2 and 3. Please keep in mind the game is still in development and anything we show here is subject to change.\n\n #deadspaceremake #gamespot #gaming", "link": "https://www.youtube.com/watch?v=f4AxFohd0c8", "date_published": "2022-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Good News For Modern Warfare 2 Players On Console | GameSpot News", "description": "Activision clears up the Call of Duty: Modern Warfare 2 phone number requirement and Gotham Knights confirms a 4-Player mode.\n#GamingNews #CallofDuty #ModernWarfare2  \n\nActivision has clarified the SMS requirement for Call of Duty: Modern Warfare II, confirming that a phone number is required for PC players but not on console. This confirmation comes not long after another Activision Blizzard game, Overwatch 2, made headlines for its own controversial SMS policy.\n\nIn a blog post, Activision said a \"text-enabled mobile phone number\" is required for Modern Warfare 2 on PC. This is the same requirement that has been in place for Warzone players on PC since May 2020. Anyone who previously played Warzone on PC won't have to do anything else to get started with Modern Warfare II and Warzone 2.0. Additionally, people on Steam must link a phone number to play Modern Warfare II, so this requirement is not limited to Battle.net alone.\n\nActivision also provided an update on the efforts it's taking to fight cheating in Modern Warfare II and Warzone 2.0. Activision's Ricochet anti-cheat system will be available at launch for Modern Warfare II and Warzone 2.0, and it will be beefed up with \"better detection capabilities, additional access to develop and deploy new mitigation techniques, and expanded freedom to update our security more frequently than ever before.\"\n\nAnd lastly, let's talk about Gotham Knights. The upcoming brawler set in the Batman universe will get a proper four-player co-op mode in late November, a little over a month after the game's October 21 release. Called Heroic Assault, the mode will be added to Gotham Knights as a free update on November 29 and is entirely separate from the main story campaign.", "link": "https://www.youtube.com/watch?v=U9vVW2yUoxU", "date_published": "2022-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Scarlet and Pokémon Violet | Meet Bellibolt!", "description": "Iono’s partner Pokémon is Bellibolt, the EleFrog Pokémon! \n\nBellibolt expands and contracts its body to generate electricity in an organ that looks like a belly button. Electricity is then discharged from the two bumps on either side of its head that resemble eyeballs.\n\n#PokemonScarletAndViolet #Pokemon #Bellibolt #Frog", "link": "https://www.youtube.com/watch?v=IG0PhvqWNdA", "date_published": "2022-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Scorn Review", "description": "Scorn, a game with notable visual influences from H.R. Giger and Zdzisław Beksiński is finally out after around 8 years of since its first kickstarter. But, was this creepy bio-horror filled world worth the wait?\n#scorn #scorngame #gamespot\n\nScorn is primarily an exploration puzzle game, with most of its gameplay revolving around searching the game's grotesque environment for clues, all while witnessing a number of horrors and disgusting visuals. Your nameless character is on a quest with no forward-facing explanation, so it's up to you to interpret the meaning of your quest and the world around you.\n\nWhile Scorn mostly focuses on exploration and puzzle solving, with the environments themselves often times lending themselves to the puzzles, there are also FPS elements, with your character finding multiple weapons they can use to hold enemies at bay. Of course, like most horror games, ammo is limited, and the enemies are overpowered, meaning you'll want to avoid these encounters at all costs.\n\nWhat is there to discover in Scorn, and how is the game? Check out Alessandro Barbosa's review here to see if it's worth your time to take a trip into the world of Scorn.", "link": "https://www.youtube.com/watch?v=I81ZTVPHFl8", "date_published": "2022-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "We Played 3 Hours of The Dead Space Remake", "description": "We got hands-on with the first three chapters of the Dead Space remake, and there is a lot to talk about.\n\nThis has been a long time coming. We’ve known about the Dead Space remake for a while now, but outside of dev live streams showing early footage and the recent trailer, we haven’t seen all that much. Until now. A few weeks ago press got hands-on with the first 3 chapters of the game, equating to about 3 hours and boy is there a lot to talk about.\n\n#deadspaceremake #gamespot #gaming #deadspace", "link": "https://www.youtube.com/watch?v=IE_bmSwxoV4", "date_published": "2022-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]