[{"source": "https://www.theguardian.com/rss", "title": "Building your brand: how to create effective newsletters", "description": "<p>With people spending no more than eight seconds reading an average email, how can companies use them to boost their customer base? The founder of a science subscription box for kids reveals how she grew her digital community</p><p>With model comets that whizz and fizz, potions that change colour, and sparkly dough sculptures that conduct electricity – science can be fun. But all too often, a child’s experience of Stem (science, technology, engineering and maths) subjects at school can be boring and uninspired.</p><p>“Hardly any primary school teachers have done any science beyond GCSE,” entrepreneur Renee Watson, who is a scientist by trade, says. “I had been doing a lot of work with schools and saw there was no time or money to make science fun and interesting in the classroom. So I thought: ‘Well, I can put fun stuff in boxes and send them to families to do at home.’”</p> <a href=\"https://www.theguardian.com/email-marketing-and-automation-with-mailchimp/2022/oct/14/building-your-brand-how-to-create-effective-newsletters\">Continue reading...</a>", "link": "https://www.theguardian.com/email-marketing-and-automation-with-mailchimp/2022/oct/14/building-your-brand-how-to-create-effective-newsletters", "date_published": "2022-10-14 13:52:41+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘Emails should be 80 words or fewer’: experts reveal 10 rules to optimise business communication", "description": "<p>It is essential for companies of all sizes to keep customers and employees happy by communicating effectively – so where should you start?</p><p>Whether it’s by email, face-to-face or via a technology platform such as Slack or Zoom, good communication skills eliminate silos, win deals, and help build trust and loyalty with employees, clients and customers. But with the shift to hybrid working post-pandemic, many organisations are having to rethink how they’ve always done things. We ask three experts where leaders should start when it comes to optimising business communication.</p><p><strong>Remember your audience is busy<br /></strong>The average professional spends a significant part of their working day reading and answering emails. And, according to Kim Arnold, business communication expert and founder of the email-writing training course <a href=\"https://www.kimarnold.co.uk/email-engagement/\" rel=\"nofollow\">Email Engagement</a>, there are some pointers that everyone should know when it comes to writing emails.</p> <a href=\"https://www.theguardian.com/email-marketing-and-automation-with-mailchimp/2022/oct/14/emails-should-be-80-words-or-fewer-experts-reveal-10-rules-to-optimise-business-communication\">Continue reading...</a>", "link": "https://www.theguardian.com/email-marketing-and-automation-with-mailchimp/2022/oct/14/emails-should-be-80-words-or-fewer-experts-reveal-10-rules-to-optimise-business-communication", "date_published": "2022-10-14 13:49:23+00:00", "persistent": false, "user": null, "language": "en-UK"}]