{"entries": [{"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/29/championship-boro-stun-blackburn-as-sheffield-united-keep-pace-at-top", "title": "Championship: Boro stun Blackburn as Sheffield United keep pace at top", "date_published": "2022-12-29 22:49:06+00:00", "description": "<p>• Carrick’s side continue form to break into playoff places</p><p>• Blades record fifth straight win to move level with Burnley</p><p><strong>Middlesbrough</strong> moved into the Championship playoff places for the first time this season after coming from behind to defeat 10-man <strong>Blackburn</strong> 2-1 at Ewood Park.</p><p> Rovers went ahead in an even first half thanks to a cool Ryan Hedges finish in the sixth minute, vindicating Blackburn’s ploy of targeting the visitors’ high line.</p> <a href=\"https://www.theguardian.com/football/2022/dec/29/championship-boro-stun-blackburn-as-sheffield-united-keep-pace-at-top\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/fashion/2022/dec/29/dame-vivienne-westwood-fashion-designer-dies-aged-81", "title": "Dame Vivienne Westwood, fashion designer, dies aged 81", "date_published": "2022-12-29 21:21:15+00:00", "description": "<p>The iconoclastic fashion designer’s creative partner and husband says ‘I will continue with Vivienne in my heart’ </p><p>Dame Vivienne Westwood died peacefully surrounded by her family in Clapham, South London, today, her representatives said in a statement.</p><p>The 81-year-old’s husband and creative partner, Andreas Kronthaler, said: “I will continue with Vivienne in my heart.</p> <a href=\"https://www.theguardian.com/fashion/2022/dec/29/dame-vivienne-westwood-fashion-designer-dies-aged-81\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/29/pele-football-greatness-brazil-global-star", "title": "Pelé set the standards by which footballing greatness is judged | David Goldblatt", "date_published": "2022-12-29 20:19:54+00:00", "description": "<p>He wasn’t just a demigod in Brazil, but the first truly global football star</p><p>In the final seconds of the 1958 World Cup final, with Brazil already 4-2 ahead, Pelé, then just 17 years old, received a long ball near the Swedish penalty area. He caught it on his chest, stunning it so smartly that the ball dropped at his feet. He stepped over the ball and effortlessly back-heeled it to a team mate. With the crowd still cheering this, the ball was lobbed back into the area and, insouciantly, Pelé flicked it with the side of his head into the goal. Within moments, Brazil had<strong> </strong>won their first World Cup, making the nation’s identity, then better known for coffee, synonymous with football. Pelé, reduced to floods of tears on the pitch, began his life as the embodiment of Brazilian football.</p><p>It is worth recalling how much was riding on this moment for Brazil. The country’s scintillating Afro-Brazilian stars, such as Leônidas, first caught the world’s attention at the 1938 World Cup. Commentators at the time suggested that the country’s hybrid Afro-Indian-European demography was the greatest strength behind its football and culture. The 1950 World Cup, held in Brazil, was meant to cement this notion, but the shock defeat to Uruguay in the final game <em>–</em> the<em> </em><em>Maracanazo </em><em>– </em>was read as a failure of the country’s modernisation and its pathological miscegenation; the black players were made scapegoats for the defeat and racist stereotypes were reactivated. In 1958 the curse was lifted. Brazil’s super-diverse squad had become champions playing in their own unique style; Pelé was the star, and the world took notice.</p><p>David Goldblatt is the author of The Ball is Round: A Global History of Football and The Game of Our Lives</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/29/pele-football-greatness-brazil-global-star\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/29/israel-swears-in-benjamin-netanyahu-amid-fears-of-further-slide-to-right", "title": "Israel swears in Benjamin Netanyahu amid concerns of further slide to right", "date_published": "2022-12-29 20:10:43+00:00", "description": "<p>Arab citizens and LGBTQ+ community fear return of veteran leader will damage democracy</p><p>Israel’s most rightwing cabinet ever has been sworn in, with Benjamin Netanyahu heading an administration that could open the door to fervently nationalist and religious politicians to radicalise the country and policies towards the Palestinians.</p><p>Israeli liberals fear the veteran leader’s return to power <a href=\"https://www.theguardian.com/world/2022/dec/21/benjamin-netanyahu-israel-rightwing-government\">in alliance with anti-Arab, ultranationalist and ultraorthodox parties</a> will damage democratic aspects of the country’s governance. Arab citizens and <a href=\"https://www.theguardian.com/world/2022/dec/22/israel-lgbtq-community-fear-future-far-right-government\">the country’s LGBTQ+ community</a> are both alarmed at what may be in store.</p> <a href=\"https://www.theguardian.com/world/2022/dec/29/israel-swears-in-benjamin-netanyahu-amid-fears-of-further-slide-to-right\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/live/2022/dec/29/pele-dies-aged-82-tributes-paid-to-a-football-great-live-updates-and-reaction", "title": "Pelé dies aged 82: tributes paid to a football great – live updates and reaction", "date_published": "2022-12-29 20:05:50+00:00", "description": "<ul><li>All the reaction after Brazil legend dies in São Paulo</li><li><a href=\"https://www.theguardian.com/football/2022/dec/29/pele-brazil-dies-football-legend\">Report: three-time World Cup winner dies aged 82</a></li><li><a href=\"https://www.theguardian.com/football/blog/2022/dec/29/pele-radiated-the-quality-of-joy-an-instant-appeal-to-the-eye-and-heart-brazil\">Pelé radiated joy: an instant appeal to the eye and heart</a></li><li>Email <a href=\"mailto:michael.butler@theguardian.com\">michael.butler@theguardian.com</a> | Tweet <a href=\"https://twitter.com/michaelbutler18\">@michaelbutler18</a></li></ul><p><strong>It is worth remembering</strong> that Neymar equalled Pelé’s scoring record for Brazil at the World Cup. Both players have 77 goals for their country.</p><p>Neymar, the player who now wears the Brazil No 10 shirt made famous by Pelé, posted on Instagram:</p><p>Before Pelé, “10” was just a number. I’ve read this phrase somewhere, at some point in my life. But this sentence, beautiful, is incomplete. I would say before Pelé football was just a sport. Pelé has changed it all. He turned football into art, into entertainment He gave voice to the poor, to the blacks and especially: He gave visibility to Brazil. Soccer and Brazil have raised their status thanks to the King! He’s gone but his magic remains. Pelé is FOREVER!!</p> <a href=\"https://www.theguardian.com/football/live/2022/dec/29/pele-dies-aged-82-tributes-paid-to-a-football-great-live-updates-and-reaction\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/29/fireworks-in-the-paddock-the-growing-cult-of-the-f1-team-principal", "title": "Fireworks in the paddock: the growing cult of the F1 team principal", "date_published": "2022-12-29 20:00:28+00:00", "description": "<p>Formerly behind-the-scenes figures, team principals are increasingly stepping into the limelight of the F1 soap opera</p><p>Posing for selfies, signing autographs and manoeuvring through eager fans it seems is no longer the sole prerogative of Formula One’s glamour drivers. Max Verstappen might have cantered to the title this year but over the past two seasons the fascination with those pulling the strings has been a remarkable draw for the sport. Welcome to the show within a show, the cult of the F1 team principal.</p><p>While drivers traded licks on track so have their bosses’ increasingly public and competitive egos battled for attention. Mercedes’ Toto Wolff and Red Bull’s Christian Horner have been centre stage of this soap opera, enthusiastically documented by the Netflix series Drive to Survive.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/29/fireworks-in-the-paddock-the-growing-cult-of-the-f1-team-principal\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/29/pele-obituary", "title": "Pelé obituary", "date_published": "2022-12-29 19:59:57+00:00", "description": "<p>Global superstar of football who was a hugely prolific goalscorer and three times a World Cup winner with Brazil</p><p>Pelé, who has died aged 82 after suffering from cancer, is widely regarded as the greatest footballer the game has ever seen. He was the only player to have won the World Cup three times, and perhaps the most remarkable aspect of his long career was that he reached his apotheosis so early, and on the world’s biggest stage. He was 17 when he played for Brazil in the 1958 World Cup finals in Sweden, scoring six goals in their last three games – the winner in the quarter-final, a hat-trick in the semi-final and two in the final – his confidence and stature growing palpably with every game.</p><p>Almost two decades later he came out of retirement and made the almost unthinkable decision of signing for New York Cosmos. For all its wealth, the US was then a pauper of the football world, and it was Pelé who helped introduce Americans to “soccer”. His first game was televised in 22 countries, and the pitch, more dirt than grass, had to be spray-painted green for the watching world. </p> <a href=\"https://www.theguardian.com/football/2022/dec/29/pele-obituary\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/29/mikaela-shiffrin-semmering-slalom-paula-moltzan", "title": "Shiffrin takes Semmering slalom for third win in three days and 80th overall", "date_published": "2022-12-29 19:39:35+00:00", "description": "<ul><li>Shiffrin completes hat-trick of World Cup wins in Semmering</li><li>American’s 80th career win is two behind Vonn’s women’s mark</li><li>Minnesota’s Moltzan finishes second for rare US one-two finish</li></ul><p>Mikaela Shiffrin led Paula Moltzan for an American 1-2 finish in a night slalom Thursday to become the first ski racer with 50 World Cup wins in a single discipline.</p><p>No other skier, female or male, has won an event more than 46 times in the 56-year World Cup history.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/29/mikaela-shiffrin-semmering-slalom-paula-moltzan\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/video/2022/dec/29/pele-one-of-footballs-all-time-greats-dies-aged-82-video-obituary", "title": "Pelé, one of football's all-time greats, dies aged 82 – video obituary", "date_published": "2022-12-29 19:19:52+00:00", "description": "<p>Pelé, widely regarded as potentially the greatest player of all-time, has died aged 82. The Brazilian burst on to the scene as a young 17-year-old at the 1958 World Cup in Sweden, scoring a memorable brace in the final against the hosts. From there he never stopped scoring, 12 years on at the 1970 World Cup he won the Golden Ball and scored a towering header in the final against Italy. In 1999, he was named Fifa's co-player of the century, alongside the late Diego Maradona. He'll be remembered as one of the all-time greatest forwards the game has ever produced</p> <a href=\"https://www.theguardian.com/football/video/2022/dec/29/pele-one-of-footballs-all-time-greats-dies-aged-82-video-obituary\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/blog/2022/dec/29/pele-radiated-the-quality-of-joy-an-instant-appeal-to-the-eye-and-heart-brazil", "title": "Pelé radiated the quality of joy: an instant appeal to the eye and heart | Richard Williams", "date_published": "2022-12-29 19:18:35+00:00", "description": "<p>The first global football superstar made everyone smile and his tricks were never designed to diminish his opponents</p><ul><li><a href=\"https://www.theguardian.com/football/live/2022/dec/29/pele-dies-aged-82-tributes-paid-to-a-football-great-live-updates-and-reaction\">Tributes paid to a football great – live updates and reaction</a></li></ul><p>For the generation born just after the end of the second world war, the emergence of the teenaged Pelé during the 1958 World Cup opened a door to a new dimension of football. The brief televised highlights of the matches in Sweden were broadcast in a black and white that was actually more like blurred shades of grey but already the Brazilian prodigy seemed to be sharply focused and bathed in a golden glow.</p><p>The <a href=\"https://www.theguardian.com/football/2006/may/13/sport.bookextracts\" title=\"\">skinny 17-year-old with the flat-top haircut</a> scored six goals, several of them executed with an impudent wit and a hitherto unimaginable level of technique, and then wept openly on the shoulder of <a href=\"https://www.theguardian.com/football/2013/aug/26/gylmar\" title=\"\">Gilmar</a>, the team’s goalkeeper, when the triumph was secured. For many of his new fans in foreign lands, Edson Arantes do Nascimento was the first complicated foreign name they committed to memory.</p> <a href=\"https://www.theguardian.com/football/blog/2022/dec/29/pele-radiated-the-quality-of-joy-an-instant-appeal-to-the-eye-and-heart-brazil\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/29/pele-brazil-dies-football-legend", "title": "Pelé, Brazil World-Cup winner and football legend, dies aged 82", "date_published": "2022-12-29 19:05:59+00:00", "description": "<p>• Striker widely regarded as the best to have played the game<br />• Pelé scored a world record 1,281 goals in 1,363 games<br /><a href=\"https://www.theguardian.com/football/ng-interactive/2014/may/27/the-world-cups-top-100-footballers-of-all-time-interactive\">• Pelé tops our list of the top 100 all-time World Cup footballers</a><br /><a href=\"http://observer.theguardian.com/osm/story/0,,716785,00.html\">• Observer Archive from 1970: ‘There is only one Pelé’</a><br /></p><p>Pelé, the Brazilian virtuoso whose captivating skill and athleticism ensured he was universally regarded as one of football’s greatest players, has died at the age of 82.</p><p>Pelé, who had a colon tumour removed in 2021, was readmitted to Albert Einstein hospital in São Paulo in November amid deteriorating health. After reports he was receiving end-of-life care, Pelé said he felt “strong, with a lot of hope” in a social media post on 3 December.</p> <a href=\"https://www.theguardian.com/football/2022/dec/29/pele-brazil-dies-football-legend\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/29/new-zealand-bans-battery-cages-hens-replacement-just-as-bad", "title": "New Zealand bans battery cages for hens – but replacement ‘just as bad’", "date_published": "2022-12-29 19:00:27+00:00", "description": "<p>Colony cages are larger but animal welfare campaigners say the birds are still not able to behave naturally</p><p>Battery cages for layer hens will become illegal in New Zealand from 2023 but animal welfare campaigners are urging the government to scrap the replacement colony cages, which they say are just as bad.</p><p>The plan to ban battery cages has been 10 years in the making – in 2012, the previous National party government committed to phasing them out by 1 January 2023.</p> <a href=\"https://www.theguardian.com/world/2022/dec/29/new-zealand-bans-battery-cages-hens-replacement-just-as-bad\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/29/new-york-marijuana-first-legal-dispensary-opens", "title": "New York’s first legal dispensary for recreational marijuana opens doors", "date_published": "2022-12-29 18:52:19+00:00", "description": "<p>Mayor Eric Adams hails ‘major milestone’ as former Gap store in Lower Manhattan sells variety of cannabis-related products</p><p>From the long-empty husk of a Manhattan retail chain, new life blooms – in the form of the state of New York’s first legal dispensary for recreational <a href=\"https://www.theguardian.com/society/cannabis\">marijuana</a>, which was set to open on Thursday at 4.20pm.</p><p>Housing Works Cannabis Company will roll out retail adult-use weed sales at a shop on Broadway and Astor Place in Lower Manhattan – a former Gap outpost – with items such as edibles from $20 and flowers from $40, <a href=\"https://www.nbcnewyork.com/news/local/nys-1st-legal-cannabis-dispensary-is-set-to-open-thursday-in-manhattan-what-to-know/4018496/\">according to NBC New York</a>.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/29/new-york-marijuana-first-legal-dispensary-opens\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/29/state-man-eases-to-matheson-hurdle-success-at-leopardstown", "title": "State Man eases to Matheson Hurdle success at Leopardstown", "date_published": "2022-12-29 18:17:20+00:00", "description": "<ul><li>State Man beat Vauban by four-and-a-quarter lengths</li><li>Sharjah completed one-two-three for Willie Mullins’ stable</li></ul><p>State Man, last season’s County Handicap Hurdle winner at Cheltenham, continued his progress towards a possible meeting with the unbeaten Constitution Hill at the Festival in March with a convincing success in the Grade One Matheson Hurdle at Leopardstown on Thursday.</p><p>Constitution Hill remains long odds-on for the Champion Hurdle on 14 March after his <a href=\"https://www.theguardian.com/sport/2022/dec/26/bravemansgame-lands-paul-nicholls-a-remarkable-13th-king-george-vi-chase-victory-horse-racing-tips\">latest effortless success</a> in the Christmas Hurdle at Kempton Park on Boxing Day. State Man, however, did enough in Thursday’s race to suggest that he will emerge as the biggest threat to the favourite next year, with Paul Townend, his jockey, insisting afterwards that “every day he runs, he seems to build on the day before”.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/29/state-man-eases-to-matheson-hurdle-success-at-leopardstown\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/29/michelle-obama-couldnt-stand-husband-barack-10-years", "title": "Michelle Obama says she ‘couldn’t stand’ husband Barack for 10 years", "date_published": "2022-12-29 17:09:59+00:00", "description": "<p>Former first lady says caring for their young daughters put strain on their marriage in Revolt TV interview promoting latest book</p><p>Former first lady Michelle Obama has said she “couldn’t stand” her husband for a decade while the couple’s children were young.</p><p>In frank comments to the Black news station <a href=\"https://www.revolt.tv/category/watch/\">Revolt TV</a> last week, Obama – <a href=\"https://today.yougov.com/topics/international/explore/public_figure/Michelle_Obama\">one of the most popular women</a> in America – said that raising children had put strains on her three-decade marriage to Barack Obama, the US president for two four-year terms beginning in 2009.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/29/michelle-obama-couldnt-stand-husband-barack-10-years\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/29/brazils-president-lula-picks-staunch-amazon-defenders-for-ministry", "title": "Brazil’s President Lula picks staunch Amazon defenders for ministry", "date_published": "2022-12-29 17:04:27+00:00", "description": "<p>Move demonstrates commitment to Indigenous communities but faces huge challenges from Bolsonaro era</p><p>Two internationally celebrated Amazon defenders – Marina Silva and Sônia Guajajara – have been named as ministers in Brazil’s new government in an attempt to contain the intensifying assault on Indigenous territories and the environment.</p><p>The announcement was made by incoming president Luiz Inácio Lula da Silva, who will take office on Sunday after four years of rainforest wrecking under his far-right predecessor, Jair Bolsonaro.</p> <a href=\"https://www.theguardian.com/world/2022/dec/29/brazils-president-lula-picks-staunch-amazon-defenders-for-ministry\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/politics/2022/dec/29/one-in-10-tory-peers-have-given-more-than-100000-to-party", "title": "One in 10 Tory peers have given more than £100,000 to party", "date_published": "2022-12-29 17:00:25+00:00", "description": "<p>Exclusive: 27 members of House of Lords have donated almost £50m in total to Conservatives</p><ul><li><a href=\"https://www.theguardian.com/politics/2022/dec/29/donors-cronies-lackeys-case-abolish-lords-reform-labour-boris-johnson\">The ‘indefensibles’: donors, cronies and lackeys embody case to abolish Lords</a></li></ul><p>One in 10 Conservative peers are big donors to the party, giving almost £50m in total, new analysis shows, amid controversy over more financial backers believed to have been put forward on Boris Johnson’s resignation honours list.</p><p>After speculation about more donors due to get peerages within the coming weeks, figures compiled by the Guardian show 27 out of the party’s 274 peers have given more than £100,000 to the Conservatives.</p> <a href=\"https://www.theguardian.com/politics/2022/dec/29/one-in-10-tory-peers-have-given-more-than-100000-to-party\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/29/i-dressed-as-boy-school-afghanistan-90s-fool-cruel-taliban", "title": "I had to dress as a boy to go to school in Afghanistan in the 90s. That would never fool today’s cruel Taliban | Zahra Joya", "date_published": "2022-12-29 16:08:57+00:00", "description": "<p>Banned from schools, streets, universities and even working for NGOs, women and girls are now nothing more than prisoners in their homes in my home country </p><p>In the past 15 months or so, life has changed unrecognisably for Afghanistan’s women and girls. Speak to secondary school pupils, their parents and education activists, and you will hear just how devastating the impact of the <a href=\"https://www.theguardian.com/world/2021/sep/17/taliban-ban-girls-from-secondary-education-in-afghanistan\">Taliban’s school closures have been</a>. It is hard to fathom the depth of the darkness that has emerged as a consequence of this action.</p><p>Girls are dealing with the psychological fallout of being cut off from their classmates and social networks. Many are struggling with severe depression. Since secondary schools were closed, <a href=\"https://www.unicef.org/press-releases/girls-increasingly-risk-child-marriage-afghanistan\">child marriage has increased</a> dramatically. Suicide rates among women and girls have been <a href=\"https://news.un.org/en/story/2022/07/1121852\">steadily rising</a> since the Taliban’s return to power. Women protesting against the Taliban’s <a href=\"https://www.gov.uk/government/news/uk-statement-in-response-to-the-talibans-closure-of-universities-for-women-in-afghanistan\">closure of universities</a> in Kabul this week have been <a href=\"https://www.theguardian.com/world/2022/dec/23/taliban-minister-defends-closing-universities-to-women-as-global-backlash-grows\">beaten and whipped</a>.</p><p>Zahra Joya is an Afghan journalist living in London and the editor-in-chief and founder of Rukhshana Media, a news agency reporting on life for women and girls in Afghanistan</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/29/i-dressed-as-boy-school-afghanistan-90s-fool-cruel-taliban\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/29/liverpool-stepped-up-interest-in-gakpo-before-he-was-unaffordable-says-klopp", "title": "Liverpool stepped up interest in Gakpo before he was ‘unaffordable’, says Klopp", "date_published": "2022-12-29 16:06:17+00:00", "description": "<ul><li>Manager said €50m move for Dutch striker ‘all about timing’</li><li>Klopp confirmed there is still money for signings in January</li></ul><p>Jürgen Klopp has said Cody Gakpo would have been “unaffordable” had Liverpool waited to secure his signature and there remains money available for further signings in the January window.</p><p>The Netherlands’ World Cup star will officially become a Liverpool player on 1 January after the Anfield club beat off rival interest to <a href=\"https://www.theguardian.com/football/2022/dec/28/liverpool-complete-35m-signing-of-world-cup-star-cody-gakpo\">seal his transfer from PSV Eindhoven</a> for an initial €40m, rising to €50m. Klopp believes Liverpool had to bring forward plans to sign the 23-year-old as his rate of development could have put him out of financial reach in the near future.</p> <a href=\"https://www.theguardian.com/football/2022/dec/29/liverpool-stepped-up-interest-in-gakpo-before-he-was-unaffordable-says-klopp\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/29/leonardo-dicaprio-longnose-harlequin-frog-copper-mining-ecuador", "title": "Lost and found: the rediscovery that became ‘Leonardo DiCaprio’s frog’", "date_published": "2022-12-29 16:00:24+00:00", "description": "<p>The longnose harlequin frog, not seen since the 1980s, was found again in 2016 and has since become a symbol of defiance against mining plans in the Intag Valley</p><p>“At first, it’s hard to believe – you need to convince yourself it’s not a dream,” says the Ecuadorian biologist Elicio Tapia. “When you find a species thought to be extinct, after searching for so many years, it’s unbelievable to see it again.”</p><p>Tapia was part of the team that in 2016 <a href=\"https://www.theguardian.com/environment/2021/nov/23/frog-back-from-the-dead-helps-fight-mine-plans-in-ecuadors-cloud-forest-aoe\">“rediscovered” the rare longnose harlequin frog</a> (<em>Atelopus longirostris</em><em>)</em> – a striking little yellow-spotted frog with a pointed snout that hadn’t been seen since 1989 and was presumed extinct.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/29/leonardo-dicaprio-longnose-harlequin-frog-copper-mining-ecuador\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/29/stop-making-excuses-start-socialising-thing-ill-do-differently", "title": "‘I’m going to stop making excuses and start socialising again’: the thing I’ll do differently in 2023", "date_published": "2022-12-29 16:00:23+00:00", "description": "<p>I love my friends – I just have an awful habit of staying in and listening to podcasts in bed instead of meeting them for coffee. But not any more! </p><p>My heyday was in about 2009. I had am-dram rehearsals several days a week, parties every weekend, and on my quieter days I’d have friends over to watch Rent for the eighth time that month. I was 17 and living the dream – my social life was, as the kids no longer say, “popping”. Now, I’m 30 and my social life is not popping; it’s barely even sizzling. And there is a little part of me that’s OK with that – I like my dressing gown and box sets, sue me.</p><p>But apparently (and this might come as a shock to you), it’s good to socialise and stimulate the brain. Who knew?! So I’ve decided that in 2023 I would like to have more of a social life. Which sounds a bit tragic really, doesn’t it? Yes, Amy, yes it does. Let’s look back at where it all went wrong …</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/29/stop-making-excuses-start-socialising-thing-ill-do-differently\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/29/bill-cosby-tour-2023-new-sexual-assault-lawsuit", "title": "Bill Cosby plans to tour again in 2023 despite new sexual assault lawsuit", "date_published": "2022-12-29 15:56:33+00:00", "description": "<p>Actor’s radio announcement met with incredulity after his 2018 conviction and new complaint filed by five women in New York</p><p>The actor Bill Cosby, the 80s TV comedian who was convicted in Pennsylvania of a criminal sex assault charge in 2018, is looking to return to live performing next year, according to a report on Tuesday.</p><p>In a WGH Talk radio interview, 85-year-old Cosby answered “yes” when asked if he planned to tour again in 2023.</p> <a href=\"https://www.theguardian.com/world/2022/dec/29/bill-cosby-tour-2023-new-sexual-assault-lawsuit\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/29/why-did-china-relax-its-covid-policy-and-should-we-be-worried", "title": "Why did China relax its Covid policy – and should we be worried?", "date_published": "2022-12-29 15:50:09+00:00", "description": "<p>After long pursuing a strict zero-Covid regime, restrictions have been lifted in China as new variants emerge</p><p>After long pursing a zero-Covid policy, China has relaxed many restrictions including quarantine rules for travellers. But some experts have raised concerns the U-turn may cause problems. We take a look at why.</p><p><strong>What has happened in China?</strong></p> <a href=\"https://www.theguardian.com/world/2022/dec/29/why-did-china-relax-its-covid-policy-and-should-we-be-worried\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/music/2022/dec/29/thom-bell-obituary", "title": "Thom Bell obituary", "date_published": "2022-12-29 15:39:55+00:00", "description": "<p>Songwriter and producer behind the Philadelphia sound, creating hits for the Delfonics and the Stylistics</p><p>The unusual combination of a French horn, a grand piano, an electric sitar and a glockenspiel provided the introduction to Didn’t I (Blow Your Mind This Time), a swooning soul ballad that took the Delfonics, a Philadelphia vocal trio, to the top of the US charts in the early weeks of 1970, selling a million copies and earning them a Grammy award for the year’s best performance by an R&amp;B duo or group. The record also established the credentials of <a href=\"https://www.theguardian.com/culture/2022/dec/23/philadelphia-soul-pioneer-thom-bell-dies-aged-79\">Thom Bell</a>, their 26-year-old producer and arranger, whose classical training lay behind his often strikingly unorthodox orchestrations.</p><p>Bell, who has died aged 79, was one of the creators of the Philadelphia sound, a style of smooth soul music that dominated the pop, R&amp;B and disco charts throughout the 1970s. After the Delfonics, he produced hits for the Stylistics, the Spinners (known in the UK as the Detroit Spinners to avoid confusion with a popular folk group), New York City, Dionne Warwick, Elton John and Deniece Williams.</p> <a href=\"https://www.theguardian.com/music/2022/dec/29/thom-bell-obituary\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/29/iranian-chess-player-moving-spain-competing-without-headscarf-sara-khadem", "title": "Iranian chess player ‘moving to Spain’ after competing without headscarf", "date_published": "2022-12-29 15:30:18+00:00", "description": "<p>Sara Khadem and family plan to set up residence in an unnamed Spanish city, according to reports</p><p>One of Iran’s top-ranked female chess players is reportedly planning to settle in Spain after photographs emerged of her taking part in an international tournament without a headscarf.</p><p>Sara Khadem, <a href=\"https://ratings.fide.com/profile/12512214\"> ranked 804 in the world</a> and 10th in her home country, was not planning to return to Iran after the tournament due to fear of reprisals, two sources <a href=\"https://english.elpais.com/sports/2022-12-29/after-playing-without-a-hijab-in-a-world-championship-iranian-chess-star-defects-to-spain.html\">told Spanish newspaper El País</a>.</p> <a href=\"https://www.theguardian.com/world/2022/dec/29/iranian-chess-player-moving-spain-competing-without-headscarf-sara-khadem\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/business/2022/dec/29/thai-police-screen-ex-workers-at-former-tesco-supplier-sweatshop-claims", "title": "Thai police screen ex-workers at former Tesco supplier over sweatshop claims", "date_published": "2022-12-29 15:29:39+00:00", "description": "<p>Interviews follow raid on VK Garment factory, the subject of a UK lawsuit against the supermarket from 130 ex-workers</p><p>Thai police and civil servants have begun screening more than 100 former workers at a factory that supplied Tesco to determine if they were victims of forced labour.</p><p>The Guardian revealed last week that <a href=\"https://www.theguardian.com/business/2022/dec/18/workers-in-thailand-who-made-ff-jeans-for-tesco-trapped-in-effective-forced-labour\">Burmese workers who produced F&amp;F jeans for Tesco</a> in Thailand had reported being trapped in their work, enduring 99-hour weeks for illegally low pay in <a href=\"https://www.theguardian.com/world/2022/dec/18/workers-tell-of-sweatshop-conditions-at-thai-factory-used-by-tesco\">appalling conditions</a>.</p> <a href=\"https://www.theguardian.com/business/2022/dec/29/thai-police-screen-ex-workers-at-former-tesco-supplier-sweatshop-claims\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/29/donald-trump-judge-hints-supporters-more-than-protest-jan-6", "title": "January 6: judge hints Trump wanted supporters to ‘do more’ than protest", "date_published": "2022-12-29 15:19:15+00:00", "description": "<p>Opinion comes in ruling barring man charged with role in Capitol attack from arguing former president authorized his actions</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> may have been telling his supporters he wanted them “to do something more” than simply protest against his defeat to Joe Biden in the 2020 presidential race when he told a mob of them to “fight like hell” on the day of the Capitol attack, according to findings from a federal judge on Wednesday.</p><p>The opinion from Judge John Bates came in the form of <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.dcd.228770/gov.uscourts.dcd.228770.63.0.pdf\">a ruling</a> barring one man charged with having a hand in staging the Capitol assault on January 6 2021 – Alexander Sheppard – from arguing that Trump, as president at the time, had authorized his actions.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/29/donald-trump-judge-hints-supporters-more-than-protest-jan-6\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/music/2022/dec/29/raffi-cavoukian-from-childrens-troubadour-to-climate-campaigner", "title": "Raffi Cavoukian: from children’s troubadour to climate campaigner", "date_published": "2022-12-29 15:04:10+00:00", "description": "<p>These days the Canadian singer, 75, is as likely to be belting out protest songs as performing whimsical tunes</p><p>With 13 albums, more than 12m sales in North America and a devoted following, he’s been called the most popular children’s singer in the English-speaking world, a title that has spanned generations. But pivoting from hits such as Bananaphone and <a href=\"https://www.youtube.com/watch?v=CDx9zqDpSik\">Baby Beluga</a>, the Canadian singer Raffi Cavoukian has since followed in the footsteps of his folk music heroes, dedicating much of his later career to advocating on children, social justice and the climate crisis.</p><p>“Nobody can guarantee a future, but who has the right to steal our children’s future?” the 75-year-old, who performs as Raffi, said in an interview. “The stakes are very high right now. People ask me if I’m hopeful. But I heard recently that hope is a verb. So I’m active.”</p> <a href=\"https://www.theguardian.com/music/2022/dec/29/raffi-cavoukian-from-childrens-troubadour-to-climate-campaigner\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/29/no-such-thing-freak-weather-2023-storm-elliott", "title": "There’s no such thing as ‘freak’ weather any more – and 2023 already looks like a disaster movie | John Vidal", "date_published": "2022-12-29 15:02:58+00:00", "description": "<p>As Storm Elliott rages and 2022 is declared the UK’s warmest year yet, why are leaders still in denial about extreme weather?</p><p>The 2004 film The Day After Tomorrow was based on the idea that the main north Atlantic Ocean current could slow and then reverse, superstorms would flash-freeze the northern hemisphere and a new ice age would abruptly descend. It was <a href=\"https://www.rogerebert.com/reviews/the-day-after-tomorrow-2004\">dismissed </a>as “profoundly silly”, “a <a href=\"https://www.rottentomatoes.com/m/day_after_tomorrow\">ludicrous popcorn thriller</a>” informed by “<a href=\"https://www.theguardian.com/film/2004/may/14/climatechange\">lousy science</a>”, and some scientists <a href=\"https://www.sciencedaily.com/releases/2004/05/040512044611.htm\">argued</a> it depicted meteorological phenomena “as occurring over days, instead of decades or centuries”.</p><p>Storm Elliott, the “bomb cyclone” that hit the US over the holidays, should have made some of those critics uncomfortable. Temperatures in places plunged in just a few minutes as one of the greatest North American storms <a href=\"https://www.foxnews.com/us/temperature-wyoming-drops-40-degrees-half-hour-wind-chills-freeze-us-break-records\">ever recorded</a> swept down from the Arctic to Mexico, sometimes at hurricane speed. It brought death, chaos and misery for tens of millions of people.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/29/no-such-thing-freak-weather-2023-storm-elliott\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/music/2022/dec/29/chuck-d-bringing-rap-to-the-uk-was-our-british-invasion", "title": "Chuck D: ‘Bringing rap to the UK was our British invasion’", "date_published": "2022-12-29 15:00:22+00:00", "description": "<p>The founder of Public Enemy answers your questions on the future of hip-hop, police harrassment and whether he has ever ridden on an ostrich</p><p><strong>When did you last see Terminator X and has he ever let you ride on one of </strong><strong>the ostriches on his ostrich farm?</strong><em> Grimpeurs<br /></em><a href=\"https://www.theguardian.com/music/public-enemy\">Public Enemy</a> does a conference Zoom call every two weeks, so, yeah, I still speak to him once in a while. I’ve eaten ostrich in South Africa years ago. But, no. It wasn’t an ostrich farm anyway, it was an emu farm, and it was destroyed by a hurricane in the late 90s or early 00s. This just shows you how digital news never goes away. It’s like radiation. That’s why we have to watch it with news, because they’re still saying Terminator X has his ostrich farm, and no matter how many times we refute it, this same dumb-ass question comes up. It’s no one’s fault: it just shows how far we’ve got [to go] to get the space junk out of orbit, bro.</p><p><strong>The music you made in the 80s still sounds </strong><strong>vital and fresh, like it was made yesterday. Of today’s hip-hop artists, who do you think will still be talked about in 35 years, and what current artists inspire you? </strong><em>Hhhhssss<br /></em>There’s so many, it’s hard to choose. I play a lot of these artists on my radio show on <a href=\"https://rapstation.com/\">Rapstation</a>: <a href=\"https://open.spotify.com/artist/0qHfqHyHZnxvv1lfkJraQc\">Skyzoo</a>, <a href=\"https://www.iamsubstantial.com/\">Substantial</a>, <a href=\"https://open.spotify.com/artist/5KZfRaQHfjizCZsoRV9vqA\">Lazarus </a>– who’s also a doctor – to name a few. One of my reasons for doing the <a href=\"https://www.vibe.com/news/movies-tv/chuck-d-pbs-docuseries-fight-the-power-1234681850/\">Fight the Power documentary for the BBC</a> is to let people know the world of hip-hop is as deep as jazz. I think the future of hip-hop and rap is Africa, with artists such as <a href=\"https://sampathegreat.com/\">Sampa the Great</a>. In fact, women play a large part in hip-hop worldwide. They’re not taking any slack, either; they’re coming hard: at least 33% of the worldwide hip-hop output is from women, and that’s great.</p> <a href=\"https://www.theguardian.com/music/2022/dec/29/chuck-d-bringing-rap-to-the-uk-was-our-british-invasion\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/29/france-marine-le-pen-hijab-french-elections", "title": "This was the year France dodged a Marine Le Pen-shaped bullet. Again | Jonathan Meades", "date_published": "2022-12-29 14:30:22+00:00", "description": "<p>Campaign posters during French elections become pavement palimpsests that exist to be defaced – hence Le Pen in a hjiab</p><ul><li>What was the image on your phone that defined 2022? <a href=\"https://www.theguardian.com/commentisfree/series/snapshot-of-2022\">Writers give their perspectives</a></li></ul><p>This photo was taken on the Boulevard Saint-Martin in the 10th arrondissement in Paris on 15 April 2022, between the two rounds of the <a href=\"https://www.theguardian.com/world/2022/apr/24/emmanuel-macron-wins-french-presidential-election-say-projected-results\">presidential election</a>.</p><p>There is an immutable French tradition that, once every five years, Marine Le Pen is allowed out on day release to lose that election to an opponent she will cast as an “insider”, while blithely overlooking the dynastic engine that propels her – but only so far. No matter how much she dilutes her shtick with euphemism, it is obvious that the only people who vote for her are the people who vote for her<em>.</em></p><p>Jonathan Meades lives in Marseille. He is <a href=\"https://unbound.com/books/empty-wigs/\">crowdfunding</a> for his<strong> </strong>megafiction, Empty Wigs</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/29/france-marine-le-pen-hijab-french-elections\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/29/i-am-an-optimistic-person-the-scientist-who-studies-climate-catastrophes", "title": "‘I am an optimistic person’: the scientist who studies climate catastrophes", "date_published": "2022-12-29 14:30:21+00:00", "description": "<p>Friederike Otto, a member of the world’s only rapid reaction force of climate scientists, on looking into the apocalypse of extreme weather</p><p>Cycling over London Bridge as the dry heat pushed the temperature above 40C and a hot wind gusted down the River Thames, Friederike Otto paused to look at the monument to the city’s great fire more than 350 years earlier.</p><p>“The heat was intense, the humidity was so low and there were these winds. You could almost feel if there was one spark now, London will burn again,” she said.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/29/i-am-an-optimistic-person-the-scientist-who-studies-climate-catastrophes\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/film/2022/dec/29/ruggero-deodato-director-cannibal-holocaust-dies-aged-83", "title": "Ruggero Deodato, director of notorious horror Cannibal Holocaust, dies aged 83", "date_published": "2022-12-29 14:27:52+00:00", "description": "<p>Italian film-maker found infamy when rumours about his 1980 ‘found footage’ horror led to him being charged with murder</p><p>Ruggero Deodato, director of the notorious 1980 horror film Cannibal Holocaust, has died aged 83. Italian media <a href=\"https://www.leggo.it/spettacoli/cinema/ruggero_deodato_morto_cannibal_holocaust_ragazzi_muretto-7139120.html\">reported that he died on Thursday</a>.</p><p>Deodato had a lengthy film-making career and operated in a variety of genres but remains best known for his gruesome horror film, which was banned in multiple countries and even resulted in him being put on trial for murdering his actors.</p> <a href=\"https://www.theguardian.com/film/2022/dec/29/ruggero-deodato-director-cannibal-holocaust-dies-aged-83\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/29/derek-carr-benched-las-vegas-raiders", "title": "Derek Carr steps away from Las Vegas Raiders after surprise benching", "date_published": "2022-12-29 14:27:31+00:00", "description": "<ul><li>Raiders bench Carr, will start Stidham for final two games</li><li>Carr has been the team’s starting quarterback since 2014</li></ul><p>Las Vegas Raiders quarterback Derek Carr has missed only three games in nine years, all because of injury. Now, for the first time, he won’t play because of what coach Josh McDaniels said Wednesday were offensive performance reasons.</p><p>McDaniels not only will start Jarrett Stidham the final two weeks, including Sunday’s home game against the San Francisco 49ers, but Carr will be inactive. Practice squad quarterback Chase Garbers will be the backup.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/29/derek-carr-benched-las-vegas-raiders\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/29/g7-tells-taliban-to-reverse-reckless-dangerous-ban-on-female-aid-workers-afghanistan", "title": "G7 tell Taliban to reverse ‘reckless and dangerous’ ban on female aid workers", "date_published": "2022-12-29 14:21:08+00:00", "description": "<p>UN aid programmes in Afghanistan under threat after decision to bar women from agencies and charities, foreign ministers warn</p><p>Major world powers have called on the Taliban to urgently reverse a “reckless and dangerous” decision to ban women from working for aid agencies and charities.</p><p>In a joint statement, foreign ministers from 12 countries, as well as an EU representative, warned<a href=\"https://www.theguardian.com/world/2022/dec/24/taliban-stop-women-from-working-for-aid-organisations\"> the ban on women working in non-governmental organisations (NGOs)</a> would have an inevitable impact on UN aid programmes because many of these multimillion-dollar relief efforts were delivered and designed by NGOs.</p> <a href=\"https://www.theguardian.com/world/2022/dec/29/g7-tells-taliban-to-reverse-reckless-dangerous-ban-on-female-aid-workers-afghanistan\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/29/us-virgin-islands-suing-jpmorgan-chase-over-jeffrey-epstein-sex-trafficking", "title": "US Virgin Islands suing JPMorgan Chase over Jeffrey Epstein’s sex trafficking", "date_published": "2022-12-29 14:17:18+00:00", "description": "<p>Documents accuse bank of ‘turning a blind eye’ to illegal activities committed by their client</p><p>The US Virgin Islands is suing the bank JPMorgan Chase, accusing it of helping Jeffrey Epstein’s sex trafficking of women and girls, according to a lawsuit filed in federal court in New York.</p><p>The documents submitted by the US Virgin Islands’ (USVI) attorney general accuse JPMorgan of “turning a blind eye” to illegal activities committed by Epstein – a client of the bank – on his private island, Little St James, which is part of the Caribbean US territory.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/29/us-virgin-islands-suing-jpmorgan-chase-over-jeffrey-epstein-sex-trafficking\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/science/2022/dec/29/if-aliens-contact-humanity-who-decides-what-we-do-next", "title": "If aliens contact humanity, who decides what we do next?", "date_published": "2022-12-29 14:13:37+00:00", "description": "<p>Scientists setting up ‘post-detection hub’ in Scotland are concerned humans would react ‘like headless chickens’</p><p>The moment has been imagined a thousand times. As astronomers comb the cosmos with their powerful telescopes, they spot something that makes them gasp. Amid the feeble rays from distant galaxies lies a weak but persistent signal: a message from an advanced civilisation.</p><p>It would be a transformative event for humankind, one the world’s nations are surely prepared for. Or are they? “Look at the mess we made when Covid hit. We’d be like headless chickens,” says Dr John Elliott, a computational linguist at the University of St Andrews. “We cannot afford to be ill-prepared, scientifically, socially, and politically rudderless, for an event that could happen at any time and which we cannot afford to mismanage.”</p> <a href=\"https://www.theguardian.com/science/2022/dec/29/if-aliens-contact-humanity-who-decides-what-we-do-next\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/news/gallery/2022/dec/29/kyiv-air-raids-greenwich-moons-thursdays-best-photos", "title": "Kyiv air raids and Greenwich moons: Thursday’s best photos", "date_published": "2022-12-29 14:03:07+00:00", "description": "<p>The Guardian’s picture editors select photo highlights from around the world</p> <a href=\"https://www.theguardian.com/news/gallery/2022/dec/29/kyiv-air-raids-greenwich-moons-thursdays-best-photos\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/30/how-do-i-figure-out-what-to-do-with-my-professional-life-will-i-always-feel-helpless-and-bored", "title": "How do I figure out what to do with my professional life? Will I always feel helpless and bored? | Leading questions", "date_published": "2022-12-29 14:00:23+00:00", "description": "<p>Work isn’t designed to make you feel anything good. But that can be a freeing realisation, writes advice columnist <strong>Eleanor Gordon-Smith</strong></p><p><strong>How do I figure out what to do with my professional life? I have always been considered a smart and ambitious young woman. I have an honours bachelor degree, a master’s degree from an internationally lauded university and I excel at whatever job I’ve held (which has been at least 10 in the past 10 years). However I find little to no satisfaction in my working life. I’ve tried everything from archaeology to winemaking to high-flying philanthropy to real estate, but nothing sticks. My parents think I’m a “Pollyanna” who just gets excited at the prospect of something and then disappointed once the rose-coloured glasses come off. I don’t think that’s the whole picture. I am a hard worker, very committed when I start out, often even working myself to burnout.</strong></p><p><strong>I have an analytical mind, but I don’t think I’m overly critical once the honeymoon ends, as my parents suggest. Will I always feel helpless and bored and pointless at work? How can I find something that pays to have a moderate standard of living, that I don’t hate doing and engages me enough that I don’t feel like quitting? I have many decades-long hobbies and friendships, and studied hard for many years, so I know that I’m not “a quitter” by nature, just with work. Sometimes I think, did I use up all my effort too early in life?</strong></p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/30/how-do-i-figure-out-what-to-do-with-my-professional-life-will-i-always-feel-helpless-and-bored\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/29/what-happened-to-queens-corgis-living-with-prince-andrew", "title": "‘Sandy, Candy, you’re moving in with Andy!’ How the royals rehomed the corgi and dorgi who lost their queen", "date_published": "2022-12-29 14:00:23+00:00", "description": "<p>What do you give the prince who’s already sharing his home with an ex-wife and five dogs? That’s right: more dogs!</p><p>It was an image that spoke to a nation in mourning, and even those not deep in mourning felt the natural empathy of the dog-lover: Muick and Sandy, the Queen’s corgis, attended by footmen as they watched her funeral procession. What would be the dogs’ fate? Did they even understand that their destiny had changed for ever?</p><p>Queen Elizabeth II was in fact survived by four dogs: two corgis, a dorgi and a cocker spaniel. The last, Lissy, is a baffler, since she wasn’t of either breed for which the Queen had such pronounced preference, and Elizabeth named her after<em> herself. </em>The need for disambiguation must have been constant, although Lissy’s registered pedigree name is Wolferton Drama. Anyway, she is living with her trainer, Ian Openshaw, for the time being.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/29/what-happened-to-queens-corgis-living-with-prince-andrew\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/30/my-bad-trip-the-world-cup-holiday-that-became-a-tour-of-europes-dental-clinics", "title": "My bad trip – the World Cup holiday that became a tour of Europe’s dental clinics", "date_published": "2022-12-29 14:00:21+00:00", "description": "<p>Unable to drink and hazy with painkillers, my six visits to the dentist started in a deserted Moscow mall and ended in Berlin, via diarrhoea in Barcelona</p><p>I arrived in Europe with a sore tooth and World Cup fever. I left with a half-completed root canal and the unpleasant memory of shitting myself in a Barcelona club.</p><p>The holiday had been planned for months: my family’s “boys tour” through Russia for the 2018 World Cup, followed by a wedding in the sunny south of France.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/30/my-bad-trip-the-world-cup-holiday-that-became-a-tour-of-europes-dental-clinics\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/29/thai-police-offer-cash-prizes-for-videos-of-worst-road-accidents-in-safety-campaign", "title": "Thai police offer cash prizes for videos of worst road accidents", "date_published": "2022-12-29 13:52:48+00:00", "description": "<p>Effort to reduce new year collisions has been criticised for encouraging drivers to film others or stage violations</p><p></p><p></p><p>Thai police are taking an alternative approach to their annual road safety campaign by offering cash prizes of 10,000 baht (£240) for the best – or worst – videos of traffic violations.</p><p>About <a href=\"https://www.who.int/thailand/activities/the-bloomberg-initiative-for-global-road-safety\">22,000 people die each year in Thailand in road traffic accidents</a>, one of the worst death rates in the world. The week over the new year, known locally as the “seven dangerous days”, has the biggest spike as people speed around the country.</p> <a href=\"https://www.theguardian.com/world/2022/dec/29/thai-police-offer-cash-prizes-for-videos-of-worst-road-accidents-in-safety-campaign\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/29/eu-states-looking-for-joint-stance-on-covid-testing-for-travellers-from-china", "title": "EU states looking for joint stance on Covid testing for travellers from China", "date_published": "2022-12-29 13:40:49+00:00", "description": "<p>Italy urges action at European level as more than 50% of recent arrivals from China test positive at Milan airport</p><p>Member states of the European Union are trying to find a joint stance on how to treat travellers entering the borderless Schengen area from China, after Italy urged the rest of the economic bloc to bring back anti-Covid checks in response to Beijing’s rapid rollback of its <a href=\"https://www.theguardian.com/world/2022/dec/17/what-was-it-for-the-mental-toll-of-chinas-three-years-in-covid-lockdowns\">previously stringent hygiene restrictions</a>.</p><p>Italy on Wednesday <a href=\"https://www.theguardian.com/world/2022/dec/28/italy-decrees-travellers-from-china-must-take-covid-tests\">brought back mandatory coronavirus tests</a> for all airline travellers arriving from China, after reports of rising infection rates in the world’s most populous country.</p> <a href=\"https://www.theguardian.com/world/2022/dec/29/eu-states-looking-for-joint-stance-on-covid-testing-for-travellers-from-china\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/29/resurgent-mohamed-salah-seeks-to-banish-ghost-christmas-past-leicester-liverpool", "title": "Firing Mo Salah faces Foxes seeking to banish ghost of Christmas past", "date_published": "2022-12-29 13:30:20+00:00", "description": "<p>Liverpool forward’s trip to the King Power a year ago prefaced a patchy 2022 but he has now well and truly regained his mojo</p><p>Liverpool face Leicester on Friday evening looking to win a fourth Premier League game in succession and strengthen their push for a top-four place. For one of their players the encounter also provides an opportunity for redemption, the chance to right a wrong from almost exactly a year ago and further demonstrate that after a difficult 12 months he is back to his very best.</p><p>Indeed Mohamed Salah may well look back at events at the King Power Stadium on Tuesday, 28 December 2021 as when things turned against him. He went into the game against Leicester in sensational form having scored 22 goals in 24 appearances for a rampant Liverpool side. He, and they, appeared set for more joy on a chilly night in the east Midlands, especially given the hosts were in poor form and severely hampered by injuries, and everything appeared to be going to plan when on 15 minutes the visitors were awarded a penalty after a foul by Wilfred Ndidi on Salah. He took it himself, and then came the twist – the shot was saved by Kasper Schmeichel, with the Egyptian’s header from the subsequent rebound crashing against the bar.</p> <a href=\"https://www.theguardian.com/football/2022/dec/29/resurgent-mohamed-salah-seeks-to-banish-ghost-christmas-past-leicester-liverpool\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/business/2022/dec/29/five-charts-that-show-the-uks-economic-prospects-in-2023", "title": "Five charts that show the UK’s economic prospects in 2023", "date_published": "2022-12-29 13:03:21+00:00", "description": "<p>Inflation, faltering GDP and rising unemployment are all on the cards for the country this year</p><p>The UK is beginning 2023 on the <a href=\"https://www.theguardian.com/business/2022/dec/12/uk-recession-economic-october-gdp\">brink of recession</a> as households and businesses come under intense pressure from the cost of living crisis, with inflation at the highest rates since the early 1980s.</p><p>The <a href=\"https://www.theguardian.com/business/bankofenglandgovernor\">Bank of England</a> has said the country is on track for a prolonged recession, as households struggle to keep up with the soaring costs of food, energy and other basic essentials. Here are five charts for the UK’s economic prospects in 2023.</p> <a href=\"https://www.theguardian.com/business/2022/dec/29/five-charts-that-show-the-uks-economic-prospects-in-2023\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/audio/2022/dec/29/erling-haaland-leads-the-way-for-manchester-city-football-weekly-podcast", "title": "Haaland leads the way for Manchester City – Football Weekly Extra", "date_published": "2022-12-29 13:01:24+00:00", "description": "<p><a href=\"https://twitter.com/maxrushden\">Max Rushden</a> is joined by <a href=\"https://twitter.com/bglendenning\">Barry Glendenning</a>, <a href=\"https://twitter.com/jonawils\">Jonathan Wilson</a> and Robyn Cowen after more midweek Premier League action</p><p><strong>Rate, review, share on <a href=\"https://itunes.apple.com/podcast/football-weekly-the-guardian/id188674007?mt=2\">Apple Podcasts</a>, <a href=\"https://soundcloud.com/guardianfootballweekly\">Soundcloud</a>, <a href=\"https://audioboom.com/channel/football-weekly\">Audioboom</a>, <a href=\"https://www.mixcloud.com/guardianfootballweekly/\">Mixcloud</a>, <a href=\"https://www.acast.com/footballweekly\">Acast</a> and <a href=\"http://www.stitcher.com/podcast/guardianuk/football-weekly\">Stitcher</a>, and join the conversation on <a href=\"https://www.facebook.com/GuardianPodcasts/\">Facebook</a>, <a href=\"https://twitter.com/guardianaudio\">Twitter</a> and <a href=\"mailto:footballweekly@theguardian.com\">email</a>.</strong></p><p>Today: incredibly, despite the break for the World Cup, good teams with good players remain good. Manchester City, Manchester United and Chelsea all win fairly comfortably in their respective midweek fixtures.</p> <a href=\"https://www.theguardian.com/football/audio/2022/dec/29/erling-haaland-leads-the-way-for-manchester-city-football-weekly-podcast\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/games/2022/dec/29/15-video-games-to-look-forward-to-in-2023", "title": "Street Fighter returns, Link is back and vampires run amok: 15 video games to anticipate in 2023", "date_published": "2022-12-29 13:00:20+00:00", "description": "<p>From space exploration and eerie late night fishing to dungeon-delving and confronting your exes, there’s lots to be excited about – including some long-awaited sequels</p><ul><li><a href=\"https://viewer.gutools.co.uk/culture/series/2023-culture-preview\">More from the 2023 culture preview</a></li></ul><p>It’s not that much of an exaggeration to say that 2008’s Dead Space is to video games what Alien was to movies: ambitious, gory, frightening sci-fi horror that raised the bar for a whole genre. This remake involves some of the same talent, and will bring a skin-crawling classic to a new generation of players.<br />• PlayStation 5, Xbox Series S/X, PC, 27 January</p> <a href=\"https://www.theguardian.com/games/2022/dec/29/15-video-games-to-look-forward-to-in-2023\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/29/on-the-sixth-day-of-christmas-or-was-it-the-seventh-why-numbers-matter-more-than-ever", "title": "You can never be too careful when it comes to the ‘grammar of numbers’ | Elisabeth Ribbans", "date_published": "2022-12-29 13:00:20+00:00", "description": "<p>Statistics are often likened to a minefield – and frequent reader complaints highlight the need to tread with caution</p><p>Imagine this newspaper reports that cuts in the dairy industry mean there will now be “four times fewer” maids a-milking on the eighth day of Christmas. How many do you imagine will be at work? We’ll come back to that question later.</p><p>The handling of numbers is something that readers regularly make contact about, and 2022 has been no different. But with the bountiful optimism of an approaching new year, we can hope that a review of some repeat offences brings down the 2023 tally by a fraction.</p><p>Elisabeth Ribbans is the Guardian and Observer’s global readers’ editor. She can be contacted at <a href=\"mailto:guardian.readers@theguardian.com\">this email address</a></p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/29/on-the-sixth-day-of-christmas-or-was-it-the-seventh-why-numbers-matter-more-than-ever\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/politics/2022/dec/29/uk-farmers-impact-brexit-trade-deal-losing-common-agricultural-policy", "title": "‘We’re only seeing the negative’: UK farmers on Brexit and losing the common agricultural policy", "date_published": "2022-12-29 13:00:20+00:00", "description": "<p>In the third of our series looking at the impact of the Brexit trade deal, the Guardian talks to farmers about the difficulties they face</p><p>Sitting in his 18th-century farmhouse in the uplands of Bethlehem, in the breathtaking western reaches of the Brecon Beacons, Ian Rickman ponders the damage Brexit has done to his future. Two years since the UK quit the EU, the future for mountain sheep-farmers such as him is full of economic precarity.</p><p>He has lost unfettered access to his nearest export market, faces reduction in farm subsidies as the result of the loss of the common agricultural policy (CAP), and has been disadvantaged by trade deals giving access to the UK market to rival farmers from <a href=\"https://www.theguardian.com/politics/2021/jun/15/uk-australia-trade-deal-what-does-it-mean-brexit\">Australia</a> and <a href=\"https://www.theguardian.com/business/2022/feb/28/uk-and-new-zealand-sign-free-trade-deal\">New Zealand</a>.</p> <a href=\"https://www.theguardian.com/politics/2022/dec/29/uk-farmers-impact-brexit-trade-deal-losing-common-agricultural-policy\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/29/sports-most-memorable-moments-of-2022-no-4-rugby-union", "title": "Sport’s most memorable moments of 2022 – No 4: Rugby union", "date_published": "2022-12-29 12:42:44+00:00", "description": "<p>A remarkable year included Italy’s win in Cardiff and the end of Eddie Jones’s England reign plus a dramatic Women’s World Cup final</p><p>Italy arrived in Cardiff on the back of 36 consecutive defeats in the Six Nations and though Wales had hardly had a championship to remember – a disappointing defence of their title – given the <em>Azzurri</em>’s tendency to get worse as the tournament goes on they were given little hope of breaking their seven-year duck. They were heading for another gallant defeat when Josh Adams went over after 68 minutes, but with less than two minutes to go Edoardo Padovani gathered Kieran Hardy’s overhit box-kick and passed inside to Ange Capuozzo. The full-back, then 22, cemented his burgeoning reputation with a dazzling run, through Adams, then twisted Hardy inside out and delivered the pass to Padovani to score. Paolo Garbisi nailed the conversion <a href=\"https://www.theguardian.com/sport/2022/mar/19/wales-italy-six-nations-rugby-union-match-report\">to seal a magnificent victory</a>. Italy built on it by defeating Australia this autumn, adding further intrigue to next year’s tournament, with a home match against France kicking off their campaign.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/29/sports-most-memorable-moments-of-2022-no-4-rugby-union\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/29/turkish-and-syrian-defence-and-security-officials-meet-for-first-time-in-decade", "title": "Turkish and Syrian defence and security officials meet for first time in a decade", "date_published": "2022-12-29 12:36:13+00:00", "description": "<p>Move towards peaceful relations represents cause for alarm for more than 4m refugees in Turkey since 2011</p><p>Top Turkish and Syrian defence and security officials have held their first public meeting in more than a decade, in a dramatic shift towards normalising relations between the two countries after Ankara backed rebels during Syria’s civil war.</p><p>The Turkish defence minister, Hulusi Akar, and the head of the country’s national intelligence organisation (MIT), Hakan Fidan, met the Syrian defence minister, Ali Mahmoud Abbas, and the notorious spy chief Ali Mamlouk in Moscow, in a meeting attended by the Russian defence minister, Sergei Shoigu.</p> <a href=\"https://www.theguardian.com/world/2022/dec/29/turkish-and-syrian-defence-and-security-officials-meet-for-first-time-in-decade\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/29/dining-across-the-divide-jonah-ricky", "title": "Dining across the divide: ‘She sees my generation as not being grateful enough for what we have’", "date_published": "2022-12-29 12:30:19+00:00", "description": "<p>They both vote Labour and agree on Brexit – but what about freedom of speech and cancel culture?</p><p><strong>Jonah, 23, Plymouth</strong></p><p><strong>Occupation</strong> University administrator</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/29/dining-across-the-divide-jonah-ricky\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/uk-news/2022/dec/29/gchq-chief-western-spy-agencies-must-pre-bunk-disinformation", "title": "GCHQ chief: western spy agencies must ‘pre-bunk’ disinformation", "date_published": "2022-12-29 12:22:58+00:00", "description": "<p>Jeremy Fleming says war in Ukraine prompted new public outreach effort by intelligence community </p><ul><li><a href=\"https://www.theguardian.com/world/live/2022/dec/29/russia-ukraine-war-live-air-raid-alarms-sound-in-kyiv-and-kherson-bakhmut-reaching-stalemate-say-us-thinktank\">Russia-Ukraine war – latest news updates</a></li></ul><p>Western spy agencies should use intelligence to “pre-bunk” narratives pushed by Russia and other authoritarian states, the head of GCHQ has said while guest editing BBC Radio 4’s Today programme.</p><p>Jeremy Fleming, who leads the largest of Britain’s three main intelligence agencies, said on Thursday the war in Ukraine had prompted a significant opening up, in a Christmas broadcast co-produced by a serving spy chief for the first time.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/29/gchq-chief-western-spy-agencies-must-pre-bunk-disinformation\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/29/kylian-mbappe-shrugs-off-futile-martinez-celebrations-after-world-cup-final", "title": "Kylian Mbappé shrugs off ‘futile’ Emi Martínez celebrations after World Cup", "date_published": "2022-12-29 12:01:51+00:00", "description": "<ul><li>France forward admits he will ‘never get over’ defeat</li><li>Lionel Messi due back in France on 1 January</li></ul><p>Kylian Mbappé has insisted that he was not concerned by the Argentina goalkeeper Emiliano Martínez’s celebrations following the World Cup final but admitted he will “probably never get over” France’s defeat.</p><p>Mbappé became the first player to score a hat-trick in a World Cup final since England’s Sir Geoff Hurst in 1966, but still <a href=\"https://www.theguardian.com/football/2022/dec/18/world-cup-final-argentina-france-match-report\">ended up on the losing side</a> after Martínez’s heroics in the penalty shootout.</p> <a href=\"https://www.theguardian.com/football/2022/dec/29/kylian-mbappe-shrugs-off-futile-martinez-celebrations-after-world-cup-final\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/food/2022/dec/29/delicious-dishes-to-make-with-marsala", "title": "Delicious dishes with marsala | Kitchen aide", "date_published": "2022-12-29 12:00:19+00:00", "description": "<p>Use this Sicilian fortified wine in cocktails, boozy desserts, for adding to soups … or just as cook’s special treat</p><p>Got a culinary dilemma? Email <a href=\"mailto:feast@theguardian.com\">feast@theguardian.com</a></p><p><strong>I made <a href=\"https://www.theguardian.com/food/2021/sep/29/how-to-make-tiramisu-recipe-masterclass-felicity-cloake\">Felicity Cloake’s tiramisu</a>, which was delicious, but I still have a nearly full bottle of marsala. What else can I make with it?</strong><br /><em><strong>Viv, Cardiff</strong></em><br />Not all marsala is made equal: you have <em>secco</em> (dry), <em>semi-secco</em> (medium-dry) and <em>dolce</em> (sweet), but, as Viv is talking tiramisu, I’m going to assume it’s the last that’s in need of using up. However, before we dive into that, the Guardian’s drinks expert <a href=\"https://www.theguardian.com/food/series/fiona-beckett-on-wine\">Fiona Beckett</a> says it’s worth noting that this Sicilian fortified wine is often sold in half-bottles, although she grants that’s not much use to Viv now. “That said,” Beckett adds, “the great news is that you can essentially use it wherever you would use a sweet sherry.”</p><p>First and foremost, consider spent marsala a cook’s treat. “Dip into it when you’ve finally got rid of the family and things quieten down,” says Beckett, who suggests sipping it with any leftover Christmas cake, chocolate or stilton. Alternatively, for a final hurrah before dry(ish) January, consider a cocktail such as a marsala martini: mixologist <a href=\"https://www.diffordsguide.com/cocktails/recipe/3450/marsala-martini\">Tony Conigliaro’s recipe</a> calls for 50ml London dry gin, 10ml marsala dolce, 5ml dry vermouth and a few drops of almond bitters.</p><p>Got a culinary dilemma? Email <a href=\"mailto:feast@theguardian.com\">feast@theguardian.com</a></p> <a href=\"https://www.theguardian.com/food/2022/dec/29/delicious-dishes-to-make-with-marsala\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/film/2022/dec/29/the-best-new-years-eve-scenes-ranked", "title": "The best New Year’s Eve scenes – ranked", "date_published": "2022-12-29 12:00:19+00:00", "description": "<p>We trawl acres of celluloid for the best New Year’s Eves, from romcoms and musicals to gangster flicks and comedies, from parties-for-two to hellishly elaborate dance sequences</p><p>Most of the films in this list merely contain scenes set on New Year’s Eve. Not New Year’s Eve, though, because all of New Year’s Eve happens during New Year’s Eve. A Love Actually-style ensemble anthology (the middle part of a trilogy that began with Valentine’s Day and ended with Mother’s Day), this film attracted Halle Berry, Robert Downey Jr, Hilary Swank and Jon Bon Jovi. It is also terrible, but you knew that.</p> <a href=\"https://www.theguardian.com/film/2022/dec/29/the-best-new-years-eve-scenes-ranked\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/29/why-environmental-disaster-victims-are-looking-to-european-courts", "title": "Why environmental disaster victims are looking to European courts", "date_published": "2022-12-29 12:00:19+00:00", "description": "<p>Campaigners are finding courts increasingly open to considering cases – and finding in their favour</p><p>Between 2004 and 2007, the villages of Oruma, Goi and Ikot Ada Udo in Nigeria were polluted with oil from infrastructure built by Royal Dutch Shell. More than 15 years later, in late December, the company finally agreed to pay four farmers and their communities €15m in compensation and install a leak detection system after a court in the Netherlands ruled that Shell’s Nigerian subsidiary was liable and the parent company had a duty of care.</p><p>The legal battle has been so long that all the original claimants have died and Shell admits no liability under the settlement. But Milieudefensie, the Dutch arm of Friends of the Earth that fought the case, says it shows “large-scale polluters all over the world that they can no longer get away with destructive practices”.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/29/why-environmental-disaster-victims-are-looking-to-european-courts\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/artanddesign/2022/dec/29/i-expected-an-lp-but-it-was-a-watercolour-map-of-melbourne-the-christmas-present-ill-never-forget", "title": "‘I expected an LP, but it was a watercolour map of Melbourne’ – the Christmas present I’ll never forget", "date_published": "2022-12-29 12:00:19+00:00", "description": "<p>My tough scouser grandma was a weaver of yarns, a teller of blitz stories, a bowler for Lancashire – and painter of meticulous maps as unforgettable as her</p><p>Even though I was excited about them at the time, I can’t remember most of my Christmas presents. I either lost them, ate them or grew out of them. But I’ll never forget the painting my late grandmother gave me when I was 10.</p><p>I was disappointed with the gift at the time. I was young and expected the giant rectangle to be an LP or a pair of video games, but when I tore off the wrapping paper, I found a watercolour map of Melbourne, Australia, where I was born.</p> <a href=\"https://www.theguardian.com/artanddesign/2022/dec/29/i-expected-an-lp-but-it-was-a-watercolour-map-of-melbourne-the-christmas-present-ill-never-forget\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/music/2022/dec/29/the-10-best-global-albums-of-2022", "title": "The 10 best global albums of 2022", "date_published": "2022-12-29 12:00:18+00:00", "description": "<p>Musicians mixed the old and the new, with vocals from Indigenous American tribes and flute music from the ancient Mayan courts among the year’s album highlights</p><ul><li><a href=\"https://www.theguardian.com/music/series/best-music-2022\">The best music of 2022</a></li><li><a href=\"https://www.theguardian.com/culture/series/2022-in-culture\">More of the best culture of 2022</a></li></ul><p>Sound artist Liew Niyomkarn’s latest album wove poignant field recordings from her rural birthplace in northern Thailand with pulsing synths and plucked lyres to create a meditative reimagining of home. Recorded between Thailand and her current base in Antwerp, the album plays like a nostalgic blur of memory music.</p> <a href=\"https://www.theguardian.com/music/2022/dec/29/the-10-best-global-albums-of-2022\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/global-development/2022/dec/29/what-taliban-bar-on-women-ngo-work-means", "title": "‘In two days, I will have to beg on the streets’: what the Taliban’s bar on women’s NGO work means", "date_published": "2022-12-29 11:42:24+00:00", "description": "<p>Many Afghan families rely solely on female breadwinners, yet the latest restrictions threaten to increase hardship and unemployment lines</p><p>It has been just days since Gulsoom, the only breadwinner in her family of six, has had no job to go to. But she is already feeling desperate.</p><p>It’s the second time Gulsoom has lost a role over Taliban restrictions on women. The first time was when the extremists came to power, and she had to leave her position in the Ministry of Social Affairs. Now, the 28-year-old has lost her job with a private organisation.</p> <a href=\"https://www.theguardian.com/global-development/2022/dec/29/what-taliban-bar-on-women-ngo-work-means\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/29/russia-launches-large-round-of-missile-attacks-on-ukraine", "title": "Russia launches large round of missile attacks on Ukraine", "date_published": "2022-12-29 11:20:56+00:00", "description": "<p>Ukrainian defence ministry says strikes amount to ‘one of the most massive missile attacks’ since invasion</p><ul><li><a href=\"https://www.theguardian.com/world/series/ukraine-live/latest\">Russia-Ukraine war – latest updates</a></li></ul><p>Russia has launched a large round of missile attacks across Ukraine as Moscow rejected a Ukrainian peace plan and kept up its attacks on infrastructure.</p><p>Targets from Lviv in the west to Kharkiv in the east, came under fire. Mykhailo Podolyak, an adviser to Ukraine’s president, Volodymyr Zelenskiy, said more than 120 Russian missiles had been launched, while the Ukrainian army command said Russia launched 69 missiles from land, sea and air, 54 of which it said were shot down.</p> <a href=\"https://www.theguardian.com/world/2022/dec/29/russia-launches-large-round-of-missile-attacks-on-ukraine\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/29/surviving-will-be-difficult-west-sending-warm-clothes-to-ukraine-as-temperatures-fall", "title": "‘Surviving will be difficult’: west sending warm clothes to Ukraine as temperatures fall", "date_published": "2022-12-29 11:18:46+00:00", "description": "<p>Allies and charities send cold-weather clothing, generators and shelters amid Russia’s bombardment of infrastructure</p><p></p><p>Since the first snowfalls whitened the streets of Kyiv earlier this year, western countries and charities have stepped up to provide clothing and generators to help Ukraine face what is expected to be its hardest winter since the second world war.</p><p>In an effort to force Ukraine to negotiate peace, Russia has been trying to destroy the country’s energy infrastructure with a series of mass strikes. </p> <a href=\"https://www.theguardian.com/world/2022/dec/29/surviving-will-be-difficult-west-sending-warm-clothes-to-ukraine-as-temperatures-fall\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/29/operation-make-new-friends-2023", "title": "In 2023, I’m on Operation Make New Friends | Jill Filipovic", "date_published": "2022-12-29 11:13:17+00:00", "description": "<p>Friendships won’t save the world. But they can sure save your sanity, shore up your health and make your life a lot better</p><p>Here is a much-needed resolution for many of us in the new year: make new friendships and shore up old ones.</p><p>Americans are an increasingly lonely bunch, <a href=\"https://www.washingtonpost.com/opinions/2022/11/23/americans-alone-thanksgiving-friends/\">spending more time solo</a> and on our devices than with others. A decade ago, the average American spent about six and a half hours a week with friends. In 2014, time with friends declined, while time alone shot up. By 2019 – before the pandemic – Americans were spending just four hours a week with friends, a number that tanked in 2021 to two hours and 45 minutes. And it’s not that those hours were going to other people – to kids, spouses or family. As time with friends decreased, time spent alone soared.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/29/operation-make-new-friends-2023\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/video/2022/dec/29/aerial-footage-shows-partially-frozen-niagara-falls-video", "title": "Aerial footage shows partially frozen Niagara Falls – video", "date_published": "2022-12-29 11:08:32+00:00", "description": "<p>Niagara Falls partially froze because of extreme cold weather in Canada and the north-east of the US.</p><p>Drone footage shows&nbsp;thick layers of ice and snow around the waterfall.</p><p>Major storms brought blizzard-like\nconditions south across much of the US, including record snowfalls \nand hurricane-force winds</p> <a href=\"https://www.theguardian.com/world/video/2022/dec/29/aerial-footage-shows-partially-frozen-niagara-falls-video\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/29/the-guardian-thursday-quiz-general-knowledge-topical-news-trivia-88", "title": "Czech leaders, the mystery of snail teeth, and a cathedral murder – take the Thursday quiz", "date_published": "2022-12-29 11:00:18+00:00", "description": "<p>Fifteen questions on general knowledge and topical trivia, plus a few jokes every Thursday. How will you fare?</p><p>The gap between Christmas and the new year, when nobody really knows what day it is. Fortunately the Thursday quiz can remember when it is Thursday, and so you face the regular challenge of 15 not particularly topical general knowledge questions strung together with a few in-jokes. There are no prizes, it is just for fun. Let us know how you get on in the comments, and happy new year!</p><p><strong>The Thursday quiz, No 88</strong></p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/29/the-guardian-thursday-quiz-general-knowledge-topical-news-trivia-88\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/29/houston-texas-frozen-bats-nursed-health-winter-storm", "title": "Nearly 700 frozen bats nursed back to health after surviving chilly weather", "date_published": "2022-12-29 11:00:18+00:00", "description": "<p>In all, 1,544 bats were rescued around Houston, Texas, many having suffered ‘hypothermic shock’</p><p>Nearly 700 wild <a href=\"https://www.theguardian.com/science/2022/nov/29/bats-are-the-death-metal-singers-of-the-animal-world-research-shows\">bats</a> will be released in Houston, Texas, on Wednesday night after undergoing about one week of rehabilitation from exposure to frigid temperatures.</p><p>The Houston Humane Society and Texas Wildlife Rehabilitation Coalition announced the Mexican free-tailed bats would be released back to their colony under the city’s Waugh Drive bridge.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/29/houston-texas-frozen-bats-nursed-health-winter-storm\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/music/2022/dec/29/stefflon-don", "title": "Stefflon Don: ‘That’s what it is to be an artist – you’ve always gotta evolve’", "date_published": "2022-12-29 11:00:18+00:00", "description": "<p>She’s produced tracks with everyone from Skepta to Sean Paul and Nile Rodgers. This year, the UK rapper releases her long-anticipated debut album, Island 54. What took her so long?</p><ul><li><a href=\"https://www.theguardian.com/culture/series/2023-culture-preview\">More from the 2023 culture preview</a></li></ul><p>Stefflon Don has carved out her own niche within UK rap’s boys’ club with relative ease. Thanks to her cutting verses, the 30-year-old star has a string of features: Anne Marie, Sean Paul, Nile Rodgers. And yet, no album. This year, that will finally change as she releases her long-awaited debut, Island 54. It holds true to her willingness to meld multiple music styles – the dancehall of her youth, lightning-fast verses influenced by grime, even South African dance style amapiano – and her eagerness to prove herself as a creative force.</p><p><strong>On the album you’re playing with lots of genres</strong><strong>. What</strong><strong> motivated you to explore new sounds?<br /></strong>It’s just been natural. [The amapiano track] is very interesting, right? I love amapiano. I go to Ghana every year for New Year. If you’re in a dance, all you hear is afrobeats, amapiano, it always gets everyone going. It’s just a hype! I was brought up in Holland, my parents are Jamaican, so everything is a mix. I’m so used to hearing many different languages and many different sounds that I connect with. That’s why my music is very versatile – I don’t stick to just one thing because I’m not one thing.</p> <a href=\"https://www.theguardian.com/music/2022/dec/29/stefflon-don\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/29/us-criminal-justice-system-lenore-anderson-in-their-names", "title": "The crime victims’ advocate fighting mass incarceration: ‘How we actually stop violence’", "date_published": "2022-12-29 11:00:18+00:00", "description": "<p>In a new book, Lenore Anderson says the legal system doesn’t serve most victims or alleviate unaddressed trauma</p><p>For decades, the cause of victims’ rights has been one of the most powerful political movements in the US.</p><p>From the 1980s to 2010s, advocates worked with law enforcement to transform the criminal justice system, passing more than 32,000 laws explicitly in the name of victims. Fueled by backlash to the civil rights era, white Americans’ fears of rising crime and hysteria around particularly <a href=\"https://www.theguardian.com/us-news/2022/oct/22/polly-klaas-sisters-criminal-justice-mass-incarceration\">shocking cases of violence</a>, the policies exponentially <a href=\"https://bjs.ojp.gov/content/pub/pdf/piusp01.pdf\">grew</a> prison <a href=\"https://www.sentencingproject.org/policy-brief/u-s-prison-population-trends-massive-buildup-and-modest-decline/\">populations</a>. They also created mandatory <a href=\"https://www.sentencingproject.org/app/uploads/2022/08/No-End-in-Sight-Americas-Enduring-Reliance-on-Life-Imprisonment.pdf\">long and indefinite sentences</a>; locked up <a href=\"https://www.sentencingproject.org/fact-sheet/youth-sentenced-to-life-imprisonment/\">youth for life</a>; expanded surveillance; and restricted the rights of defendants and incarcerated people.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/29/us-criminal-justice-system-lenore-anderson-in-their-names\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/technology/2022/dec/29/tech-grifter-sbf-elizabeth-holmes-therano-ftx", "title": "Year of the tech grifter: will Silicon Valley ever learn from its mistakes?", "date_published": "2022-12-29 11:00:18+00:00", "description": "<p>The tech industry’s hype machine always trumpets a fresh new ‘genius’ – and it still hasn’t learned its lesson</p><p>It was a month of eerie parallels.</p><p>On <a href=\"https://www.theguardian.com/us-news/2022/dec/12/former-ftx-ceo-sam-bankman-fried-arrested-in-the-bahamas-local-authorities-say\">12 December</a>, the disgraced crypto founder Sam Bankman-Fried was arrested on <a href=\"https://www.theguardian.com/technology/2022/dec/13/sam-bankman-fried-ftx-charged-sec-crypto-exchange\">fraud charges</a> in the Bahamas, marking a dramatic end to his reign as the head of the now defunct cryptocurrency exchange FTX.</p> <a href=\"https://www.theguardian.com/technology/2022/dec/29/tech-grifter-sbf-elizabeth-holmes-therano-ftx\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/books/2022/dec/29/a-dangerous-business-by-jane-smiley-review-madams-and", "title": "A Dangerous Business by Jane Smiley review – madams and murder", "date_published": "2022-12-29 11:00:17+00:00", "description": "<p>This tale of brothel workers in gold rush America lacks mystery and risk</p><p>Eliza is not sorry when her husband dies. Peter Cargill is 20 years older than his 18-year-old bride, and persuades her parents back in Kalamazoo, Michigan, that he will be a tender and supportive spouse. But as they chase the gold rush and head out west, the opposite turns out to be the case. The year is 1851, and there is little recourse for Eliza against his cruelties: “He had made it clear that he intended to put it to her, whether she liked it or not, once or twice every day.” So when he’s shot in a bar fight in Monterey, it’s a relief. But how will the young widow support herself? Fortunate, then, that one Mrs Parks offers her work in a brothel. The place is spacious, with a nice veranda, “and the first fellow who came to her treated her much more kindly than Peter ever had”.</p><p>So begins A Dangerous Business, the latest from <a href=\"https://www.theguardian.com/books/jane-smiley\" title=\"\">Jane Smiley</a>, best known for her prize-winning 1991 novel A Thousand Acres, King Lear recast on an Iowa farm. She returned to Iowa more recently for <a href=\"https://www.theguardian.com/books/2015/oct/21/golden-age-jane-smiley-review-final-volume-the-last-hundred-years-trilogy\" title=\"\">the Last Hundred Years trilogy</a>, a family saga stretching across the 20th century. In these and many other books she has proved herself a sensitive chronicler of the American scene. Yet A Dangerous Business is startlingly flat and unsatisfying. It is a mystery with no mystery, a book in which the characters develop not a whit.</p> <a href=\"https://www.theguardian.com/books/2022/dec/29/a-dangerous-business-by-jane-smiley-review-madams-and\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/29/howard-webb-returns-to-england-on-mission-to-boost-referees-confidence", "title": "Howard Webb returns to England on mission to boost referees’ confidence", "date_published": "2022-12-29 10:31:28+00:00", "description": "<p>Premier League’s first chief refereeing officer feels standards have improved but admits more transparency is needed</p><p>“When you think about refereeing it’s very much about confidence,” says Howard Webb. “It’s a mental discipline, you need resilience to be successful at it. My job is to make sure that referees are going into their job feeling confident and supported.”</p><p>After eight years away, the most successful referee of the Premier League era has come back to the English game. His contract overseeing officials in the US had come to an end and he had been in discussions about coming home in some form for a while, but Webb’s appointment as the first chief refereeing officer in the elite game has the feel of a necessity, as – by common consent – the men in black need all the help they can get.</p> <a href=\"https://www.theguardian.com/football/2022/dec/29/howard-webb-returns-to-england-on-mission-to-boost-referees-confidence\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/29/tougher-challenges-ahead-for-england-after-dream-start-under-jon-lewis", "title": "Tougher challenges ahead for England after dream start under Jon Lewis", "date_published": "2022-12-29 10:12:52+00:00", "description": "<p>Crushing a weak West Indies was hardly ideal preparation for a T20 World Cup followed by an Ashes series for new head coach</p><p>The England head coach, Jon Lewis, will have been able to rest easy over his turkey and mince pies after his opening tour in charge concluded last week with a clean-sweep against West Indies in three one-day internationals and five Twenty20s – including <a href=\"https://www.theguardian.com/sport/2022/dec/23/england-complete-t20-series-sweep-after-bowling-out-west-indies-for-43\">wiping them out for 43</a> in the final match, their lowest total in T20 internationals.</p><p>With Heather Knight (hip injury) and Nat Sciver (mental health break) both making successful returns, it has proved a dream first assignment for Lewis. England are back to winning ways after the disappointment of a <a href=\"https://www.theguardian.com/sport/2022/aug/07/england-new-zealand-commonwealth-games-womens-cricket-third-place-playoff-match-report\">medal-less Commonwealth Games</a> and a <a href=\"https://www.theguardian.com/sport/2022/sep/24/england-women-india-third-one-day-international-cricket\">3-0 ODI defeat</a> against India in September; while Knight has been effusive about the psychological impact of the <a href=\"https://www.theguardian.com/sport/2022/nov/18/former-england-bowler-jon-lewis-appointed-womens-team-coach-cricket\">new coach</a> on her team.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/29/tougher-challenges-ahead-for-england-after-dream-start-under-jon-lewis\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/technology/2022/dec/29/unsellable-worthless-nfts-tax-write-off", "title": "Investors convert ‘totally worthless’ NFTs into tax write-offs", "date_published": "2022-12-29 10:00:17+00:00", "description": "<p>A new service offers a way to offset losses from NFTs during a grim crypto winter that saw demand for digital collectibles vanish</p><p>Just a year ago, Washington DC’s Hirshhorn art museum – the capital’s preeminent contemporary art museum – was asking whether non-fungible tokens (NFTs) were <a href=\"https://www.youtube.com/watch?v=MLBf3orYtkY\">“fad or the future of art”</a>. Twelve months on, it looks like “tax write-off” might have been the right answer.</p><p>This year was not just the year that cryptocurrency values were burned by investor fears, rising interest rates, inflation and <a href=\"https://www.theguardian.com/business/2022/dec/22/sam-bankman-fried-new-york-court-charges-ftx\">scandals</a>, it was the year that crypto’s cartoonish art cousin the NFT – an electronic identifier confirming a digital collectible is real – collided with reality.</p> <a href=\"https://www.theguardian.com/technology/2022/dec/29/unsellable-worthless-nfts-tax-write-off\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/music/2022/dec/29/2023-most-promising-newcomers-ukrainian-hardcore-nigerian-street-pop", "title": "Ukrainian hardcore, Nigerian alté and Red Bull-soaked bloghouse: 2023’s most promising musical newcomers", "date_published": "2022-12-29 10:00:17+00:00", "description": "<p>From Memphis rap to Manchester post-punk and Laurel Canyon-worthy beauty, a new generation is coming this way</p><p><strong>From </strong>Los Angeles, US<br />Marina Allen wears songwriterly classicism with incredible lightness: there are tinges of Brill Building doyennes such as Laura Nyro to her conversational piano playing and lilting voice; of west coast wonder to her open-hearted and unflinching lyricism. Her second album, 2022’s gorgeous Centrifics, was produced by Cass McCombs and Weyes Blood collaborator Chris Cohen, and represented Allen daring herself to say “yes” to being honest with herself, to write her way out of rumination. <em>LS</em><br /><strong>Recommended if you like</strong> Joanna Newsom, Cassandra Jenkins, Carole King<br /><strong>Up next</strong> <a href=\"https://www.firerecords.com/artists/marina-allen/#:~:text=Marina%20Allen%20is%20a%20once,too%20much%20and%20too%20little.\">Touring the UK from 8-15 February</a></p> <a href=\"https://www.theguardian.com/music/2022/dec/29/2023-most-promising-newcomers-ukrainian-hardcore-nigerian-street-pop\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/music/2022/dec/29/best-of-the-rest-the-classical-cds-we-missed-in-2022", "title": "Best of the rest: the classical CDs we missed in 2022", "date_published": "2022-12-29 10:00:16+00:00", "description": "<p>We are able to review only a tiny fraction of the albums released each month. From Brahms to Berg, and Pejačević to Sohy, here are 10 recent releases worth going back to</p><p>Despite more than a decade now of dire predictions of the terminal decline of the classical recording industry there’s still no sign of its imminent demise. Companies may come and go, and the emphasis of the repertory may shift from year to year, but the quantity of discs and downloads issued by both familiar and unfamiliar labels seems undiminished. There are so many new discs to sample each month that if you ask any two classical enthusiasts to name their standout releases of the year, it’s unlikely that there will be much overlap. What we do review sometimes seems barely to scratch the surface of what’s available and what deserves attention.</p><p>In a perfect world, for instance, Bru Zane’s release of one of the authentic “grand operas”, Meyerbeer’s <strong><a href=\"https://open.spotify.com/album/5k56fSNZhKWtRT36zUzEzh?si=BFKQpdfVS6mi9pMcBEXzSw\">Robert le Diable</a></strong>, based on performances in Bordeaux conducted by Marc Minkowski, with John Osborn and Erin Morley outstanding as Robert and Isabelle respectively, should have got a column to itself, as would the latest instalment of John Nelson’s Berlioz series for Warner Classics, pairing <strong><a href=\"https://open.spotify.com/album/5ZE4ETKbYlWdJLqoezWuWP?si=LN_pYu_QQaSiE6y8_Z88dg\">Les Nuits d’Été</a></strong> with <strong>Harold en Italie</strong>, with Michael Spyres as the soloist in the song cycle, and Timothy Ridout as the viola player in Harold.</p> <a href=\"https://www.theguardian.com/music/2022/dec/29/best-of-the-rest-the-classical-cds-we-missed-in-2022\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/29/60-old-fart-embrace-it-thing-ill-do-differently", "title": "‘I’ve hit 60 – I’m officially an old fart and I’m going to embrace it’: the thing I’ll do differently in 2023", "date_published": "2022-12-29 10:00:16+00:00", "description": "<p>People have started to offer me their seats on the bus. But I don’t mind. Far from denying my age, I am going to flaunt it</p><p>I’m 60 on 29 December. Wooohooo! For the past five years, I’ve already been thinking of myself as 60, and now I’m ready to truly embrace it. Presumably, on 30 December I’ll start thinking of myself as 70.</p><p>It’s not that I’m wishing my life away. Far from it. Nor do I want to start acting like a batty eccentric, wearing purple with a red hat that doesn’t go, as in <a href=\"https://www.scottishpoetrylibrary.org.uk/poem/warning/\">the Jenny Joseph poem</a>. I’ve been happily clashing all my life. Yet there is something liberating about this landmark.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/29/60-old-fart-embrace-it-thing-ill-do-differently\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/film/2022/dec/29/there-is-joy-and-love-alongside-the-sadness-and-pain-chinonye-chukwu-on-directing-till", "title": "‘There’s joy and love alongside the sadness and pain’: Chinonye Chukwu on directing Till", "date_published": "2022-12-29 10:00:16+00:00", "description": "<p>A film about the brutal 1955 racist attack on Emmett Till has been a long time coming. Its director talks about overcoming Hollywood’s reluctance, on-set therapy and her ‘non-negotiables’</p><p>In the late 1990s, when the idea of a film about the lynching of Emmett Till was first floated, the woman who would eventually direct it was in high school. Chinonye Chukwu was a depressed, daylight-deprived Alaskan teenager obsessed with Julia Roberts romcoms. </p><p>“<em>Obsessed.</em> She had the back-to-back trifecta: <a href=\"https://www.theguardian.com/film/News_Story/Critic_Review/Observer_review/0,,90615,00.html\">Runaway Bride</a>, <a href=\"https://www.theguardian.com/film/2020/may/20/ive-never-seen-notting-hill\">Notting Hill</a>, <a href=\"https://www.theguardian.com/film/filmblog/2014/may/02/my-guilty-pleasure-my-best-friends-wedding\">My Best Friend’s Wedding</a>,” says the 37-year-old, as she pours herself a cup of herbal tea in her London hotel room. “I would rewrite the film’s story in my journal, and either make myself the protagonist, or somebody else who looked like me … It was my escape, y’know?”</p> <a href=\"https://www.theguardian.com/film/2022/dec/29/there-is-joy-and-love-alongside-the-sadness-and-pain-chinonye-chukwu-on-directing-till\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/tv-and-radio/2022/dec/29/hear-here-uncontrolled-substances-cerebral-podcast", "title": "The rise and fall of the Silicon Valley brand that made antidepressants ‘cool’", "date_published": "2022-12-29 09:47:00+00:00", "description": "<p>Cerebral raised millions from investors, but ended under investigation. How did it go wrong? Plus: five podcasts to help you understand British politics</p><ul><li><strong><a href=\"https://www.theguardian.com/info/2017/may/10/hear-here-podcast-recommendations-sign-up-for-unexpected-audio-pleasures\">Don’t get Hear Here delivered to your inbox? Sign up here</a></strong></li></ul><p>Want to look back on 2022 without fear, regret and sadness? Remembering the year that was via its finest audio shows is one of the happiest ways I can think of to do so. Last week, we released <a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/23/the-20-best-podcasts-of-2022\">our annual list of the 20 best pods</a>, and it is stuffed with killer listens, from series on tiger attacks and cyberstalking to an audio tour of the womb. Use it like a great cultural cheat-sheet, packed with tips that are guaranteed not to disappoint.</p><p>The year isn’t over yet, though, and there are still new listens to check out as well. From comedians offering dating advice to a thoughtful documentary about a mental health startup that ended up under federal investigation, there are still plenty of brilliant new shows to listen to. Here’s to another great year in audio!<br /><br /><em><strong>Alexi Duggins</strong><br />Deputy TV editor</em></p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/29/hear-here-uncontrolled-substances-cerebral-podcast\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/business/2022/dec/29/goldman-sachs-boss-unveils-plan-to-cut-jobs-amid-global-economy-fears", "title": "Goldman Sachs boss unveils plan to cut jobs amid global economy fears", "date_published": "2022-12-29 09:10:32+00:00", "description": "<p>CEO David Solomon said he will make cuts in January with reports claiming investment bank will axe about 4,000 posts</p><p>The boss of Goldman Sachs has told staff that he will make job cuts early next month, as the US investment bank seeks to improve its profits amid concerns over the global economy.</p><p>The bank is reportedly considering cutting about 8% of its 49,000 employees, which could equate to as many as 4,000 job losses. It is also thought to be considering <a href=\"https://www.theguardian.com/business/2022/dec/14/goldman-sachs-bankers-brace-for-hefty-cut-to-bonuses\">cuts to its bonus pool of up to 40%</a>.</p> <a href=\"https://www.theguardian.com/business/2022/dec/29/goldman-sachs-boss-unveils-plan-to-cut-jobs-amid-global-economy-fears\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/29/power-corruption-and-fury-the-killing-of-percy-lapid", "title": "Power, corruption and fury: the killing of Percy Lapid", "date_published": "2022-12-29 09:05:34+00:00", "description": "<p>Mystery surrounds the alleged involvement of top officials in the murder of the high-profile Philippine journalist</p><p>It was just past 8pm on 3 October and the veteran broadcaster Percy Mabasa was on his way to record his nightly radio show. Every weekday evening, tens of thousands of Filipinos, many living abroad, would tune in to listen to his news commentary and sharp humour.</p><p>But on this evening, as Mabasa drove up to the entrance of his gated community where his studio is located in Las Piñas, Metro Manila, a motorbike began to trail him. Footage taken by a camera on the back of his car, and since released by police, shows two figures on the bike pulling up alongside him. Then gunshots can be heard. There’s a bang as Mabasa’s car slams into the vehicle in front. The motorbike turns and drives away. Mabasa was killed instantly.</p> <a href=\"https://www.theguardian.com/world/2022/dec/29/power-corruption-and-fury-the-killing-of-percy-lapid\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/29/sahra-wagenknecht-german-left-die-linke-breakaway-far-right-afd", "title": "Sahra Wagenknecht: heroine of German left could become ally of far right", "date_published": "2022-12-29 09:03:15+00:00", "description": "<p>Die Linke politician is receiving overtures from rightwing AfD and is rumoured to be planning a breakaway party</p><p>She has been compared to iconic political figureheads such as Frida Kahlo and Rosa Luxemburg, as much for her strident leftwing views as for her striking looks.</p><p>Sahra Wagenknecht is a household name in Germany and the best-known figure on the far left. The most prominent and outspoken member of the 15-year-old Die Linke party, she has been rattling the Berlin political scene for years with her vague pronouncements that she is planning to form her own breakaway bloc.</p> <a href=\"https://www.theguardian.com/world/2022/dec/29/sahra-wagenknecht-german-left-die-linke-breakaway-far-right-afd\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/29/pharoah-sanders-american-jazz-islam", "title": "Allah supreme: how Pharoah Sanders found freedom and rebellion in Islam", "date_published": "2022-12-29 09:00:15+00:00", "description": "<p>The saxophonist was among an assembly of American jazz musicians who reached across continents to find meaning in sound</p><p>The day the music died was 24 September 2022. On that Saturday, the legendary tenor saxophonist Pharoah Sanders, a man who blew his horn “as if he was a dragon breathing fire”, <a href=\"https://www.theguardian.com/music/2022/sep/24/jazz-legend-pharoah-sanders-dead-at-81\">passed on, at age 81</a>. With his death came the end of a majestic era, a time of saxophone spirituality and musical mysticism that will probably never be surpassed or even replicated. Sanders, like so many of his generation, channeled spirit into song, drawing inspiration from a panoply of sacred sources.</p><p>For a while, younger hip-hop generations also found words and meaning in a similar kind of search, and the music –along with the quest – continued.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/29/pharoah-sanders-american-jazz-islam\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/technology/2022/dec/29/guardian-tech-reviews-2022-repair-recycled-materials", "title": "Guardian tech reviews in 2022: better to repair and longer-lasting devices", "date_published": "2022-12-29 09:00:15+00:00", "description": "<p>More devices contain recycled materials and are supported for longer, but there is much more to do</p><p>With a year full of pressures on our wallets, comfort and climate, technology took a back seat in 2022. But change for the better is slowly happening as big tech firms wake up to the demands of consumers wanting better, longer-lasting and more sustainable devices.</p><p>Trends <a href=\"https://www.theguardian.com/technology/2021/dec/29/guardian-tech-reviews-small-sustainability-steps-but-lots-more-to-do\">established in the last couple of years</a> continued to gain pace. Recycled material has become mainstream. Devices containing at least some recycled plastic, metal or minerals are available in almost every category. The range of materials being reused is increasing – an important step towards a circular economy even if it is a very long way away from being fully realised.</p> <a href=\"https://www.theguardian.com/technology/2022/dec/29/guardian-tech-reviews-2022-repair-recycled-materials\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/books/2022/dec/29/the-last-days-of-the-ottoman-empire-by-ryan-gingeras-fall-of-the-sultans", "title": "The Last Days of the Ottoman Empire by Ryan Gingeras – fall of the sultans", "date_published": "2022-12-29 09:00:15+00:00", "description": "<p>This epic account of Ottoman decline and the birth of modern Turkey is a tour de force of accessible scholarship</p><p>By the end of 1918, after four increasingly grim years of warfare, revolution was in the air across Europe. Thrones wobbled; rulers abdicated. In the space of months, the great, centuries-old dynasties of the Romanovs, Habsburgs and Hohenzollerns were all toppled from power.</p><p>At the eastern edge of the continent lay the vast, ancient empire that the Ottoman sultans had built up since the 14th century. At its height, around 1700, it had stretched across north Africa, Arabia, Mesopotamia and around the Black Sea, also encompassing Greece, the Balkans and the Danube valley, stopping just short of Vienna. But in the course of the 19th century, as its economic and military power declined, many of its outermost lands were lost to conquest or insurrection. Local nationalist movements, and rival colonial powers such as Russia, Britain and Austria-Hungary, stripped away Greece, the Balkans, Bulgaria, Macedonia, the lands around the Black Sea, and all of its African possessions. When the Ottomans sided with Germany in the first world war, the British and French gradually captured all of the Middle East. After the war, humiliatingly, they even occupied Istanbul itself.</p> <a href=\"https://www.theguardian.com/books/2022/dec/29/the-last-days-of-the-ottoman-empire-by-ryan-gingeras-fall-of-the-sultans\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/australia-news/2022/dec/29/what-the-devil-woman-mistakes-real-tasmanian-marsupial-for-dog-toy-in-hobart-home", "title": "What the devil? Woman mistakes real Tasmanian marsupial for dog toy in Hobart home", "date_published": "2022-12-29 08:35:04+00:00", "description": "<p>Kirsten Lynch says the Tasmanian devil – who was gently shooed outside – likely followed their golden retriever puppy into the house</p><p>Hobart woman Kirsten Lynch got the fright of her life on Wednesday night when she went to pick up her golden retriever’s Tasmanian devil plush toy and it ran away.</p><p>“I went to reach for it, the devil shot underneath the couch,” she said. </p><p><strong><a href=\"https://www.theguardian.com/australia-news/2021/dec/21/sign-up-for-five-great-reads-guardian-australias-wrap-of-our-best-summer-stories\">Sign up for a weekly email featuring our best reads</a></strong></p> <a href=\"https://www.theguardian.com/australia-news/2022/dec/29/what-the-devil-woman-mistakes-real-tasmanian-marsupial-for-dog-toy-in-hobart-home\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/29/novak-djokovic-forgives-but-wont-forget-australian-visa-saga-as-he-prepares-for-adelaide-international", "title": "Novak Djokovic forgives but won’t forget Australian visa saga as he prepares for Adelaide International", "date_published": "2022-12-29 08:15:55+00:00", "description": "<p>World men’s tennis No 5 says return proves he is ready to move on from his deportation and begin quest for 10th Australian Open title</p><p>Novak Djokovic says there are no hard feelings on his return to Australia, but can’t guarantee he will ever completely move past the saga that torpedoed his 2022 Australian Open hopes and thrust him into the centre of a media frenzy.</p><p>Djokovic was deported from Australia almost 12 months ago after arriving unvaccinated against Covid at a time when the country was still subject to strict biosecurity regulations.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/29/novak-djokovic-forgives-but-wont-forget-australian-visa-saga-as-he-prepares-for-adelaide-international\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/business/live/2022/dec/29/european-natural-gas-prices-drop-rouble-uk-mortgage-oil-china-covid-business-live", "title": "European natural gas prices drop back to pre-Ukraine war levels – business live", "date_published": "2022-12-29 08:04:09+00:00", "description": "<p>Rolling coverage of the latest economic and financial news</p><p>The <em><strong>Financial Times</strong></em> points out that the fall in European whosesale gas prices came after warmer than usual temperatures across north-west Europe, which are expected to linger into the new year. </p><p><a href=\"https://www.ft.com/content/6f83306f-14ef-458f-a47e-1cac9c6c6dc6\">The FT says</a>:</p><p>As the warm weather reduces heating demand, Europe has been able to build up its gas inventory again after drawdowns from mid-November, including during the cold snaps in the early weeks of December. </p><p>Since Christmas Eve Europe has been sending more gas into its storage facilities than it has taken out of them, with storage levels increasing 0.28 per cent to Monday. Capacity stood at 83.2 per cent full as of December 26 — down from the mid-November high of 95.6 per cent, according to industry body Gas Infrastructure Europe.</p> <a href=\"https://www.theguardian.com/business/live/2022/dec/29/european-natural-gas-prices-drop-rouble-uk-mortgage-oil-china-covid-business-live\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/music/2022/dec/29/coheed-and-cambria-vaxis-act-ii-a-window-of-the-waking-mind-review-roadrunner", "title": "Coheed and Cambria: Vaxis – Act II: A Window of the Waking Mind review –rocket-fuelled pop anthems", "date_published": "2022-12-29 08:00:14+00:00", "description": "<p><strong>(Roadrunner)<br /></strong>The prog rockers delivered some of their most concise and infectious songwriting without the self-indulgence of The Unheavenly Creatures</p><p>Conceptually, New York prog rockers <a href=\"https://www.theguardian.com/music/2010/apr/08/coheed-cambria-black-rainbow-review\">Coheed and Cambria</a> seem inaccessible. The entirety of their 20-year output, save a one-off detour in 2015, has taken place in a sci-fi cosmos called Heaven’s Fence. What started as a way for frontman and comic book geek Claudio Sanchez to express himself has spiralled into a mess of metanarratives with countless characters.</p><p>On Vaxis – Act II: A Window of the Waking Mind, the band mercifully juxtapose a sprawling concept with some of their most concise and infectious songwriting to date. The sequel to 2018’s Vaxis – Act I: The Unheavenly Creatures is the second part of a planned pentalogy, but it eschews the self-indulgence of its 80-minute predecessor. In its place are no-frills pop anthems such as Beautiful Losers and Shoulders, which have choruses that fly higher than a rocketship.</p> <a href=\"https://www.theguardian.com/music/2022/dec/29/coheed-and-cambria-vaxis-act-ii-a-window-of-the-waking-mind-review-roadrunner\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/29/the-showbiz-quiz-of-the-year-how-did-justin-bieber-describe-sex-and-who-had-a-dig-at-taylor-swift", "title": "The showbiz quiz of the year! How did Justin Bieber describe sex and who had a dig at Taylor Swift?", "date_published": "2022-12-29 08:00:14+00:00", "description": "<p>From reality stars to the fall of Phil and Holly, how closely have you followed the gossip this year? Prove yourself a true celebrity obsessive</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/29/the-showbiz-quiz-of-the-year-how-did-justin-bieber-describe-sex-and-who-had-a-dig-at-taylor-swift\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/29/new-orleans-pelicans-nba-championship-contenders", "title": "The winning recipe: how the small-market Pelicans became legit title contenders", "date_published": "2022-12-29 08:00:14+00:00", "description": "<p>Even with the Pelicans having perched themselves at or near the top of the Western Conference all year, many don’t seem to take them seriously as contenders. It’s time for that to change</p><p>A lot has been made over the years of the raw deal offered to small-market NBA teams. The younger brothers of the league, they often get overlooked in favor of their flashier coastal franchise siblings. While I’ve always argued that a competent front office is the tried and true salve for this issue, as evidenced by Giannis Antetokoumpo’s loyalty (and delivery of a championship) to the Milwaukee Bucks, it’s verifiable that as far as national media coverage goes, smaller-name teams often don’t get their due.</p><p>One such team is the New Orleans Pelicans. I mentioned in <a href=\"https://www.theguardian.com/sport/2022/jun/18/nba-playoffs-2022-highlights-talking-points\">my end-of-season wrap in June</a> that I believed the future to be decidedly bright in Louisiana. With Zion’s long-awaited return to form on the court having even exceeded expectations so far, that looks to have been a sound prediction. But even with the team having perched themselves at or near the top of the Western Conference standings all year, many don’t seem to take them seriously as contenders. While, yes, the team hasn’t historically made much noise in the postseason, and doesn’t currently boast any NBA champions on its roster, there’s more than enough reason to believe that Nola won’t have to wait long to bring a Larry O’Brien to Bourbon Street. And that’s because of one simple fact: they already have all the ingredients that go into the recipe of a champion.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/29/new-orleans-pelicans-nba-championship-contenders\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/29/this-year-i-only-needed-to-open-my-window-in-brazil-to-witness-the-climate-crisis", "title": "This year, I only needed to open my window in Brazil to witness the climate crisis | Eliane Brum", "date_published": "2022-12-29 08:00:14+00:00", "description": "<p>My snapshot of 2022 shows the Amazon burning – but what it doesn’t communicate is the pain</p><p>I have covered the Amazon as a journalist for almost 25 years. It started in 1998, with a trip along the Trans-Amazonian Highway. In 2017, I moved to the city of Altamira in Pará, northern Brazil; it is the centre of the deforestation, forest fires and social devastation <a href=\"https://www.theguardian.com/cities/2018/feb/06/urban-poor-tragedy-altamira-belo-monte-brazil\">caused</a> by the Belo Monte hydroelectric dam. I moved here because I no longer wanted to be just a “special correspondent to the Amazon”, but so I could describe what was happening to the largest tropical forest on the planet from the inside. Despite this long experience, 2022 was the first year in which I watched the forest burn from the window of my home. I didn’t need to go to the fire, as journalists normally do. The fire had come to me. </p><p>The photo I’ve chosen, taken by my husband, is from the night of 27 August. Later, Brazil’s National Institute for Space Research revealed that it was the <a href=\"https://phys.org/news/2022-09-brazilian-amazon-worst-august-years.html#:~:text=All%20the%20worst%20August%20figures,seeking%20re%2Delection%20next%20month\">worst August for fires</a> in the Amazon since 2010. Fires and deforestation <a href=\"https://www.theguardian.com/world/2019/jul/03/brazil-amazon-rainforest-deforestation-environment\">rose considerably</a> under Jair Bolsonaro who, this year, was narrowly defeated in the presidential election by Luiz Inácio Lula da Silva, or Lula, as he is better known.</p><p>Eliane Brum is one of the creators of the trilingual news platform Sumaúma and the author of Banzeiro Òkòtó: the Amazon as the Centre of the World, which is published in the UK in 2023. This article was translated by James Young<br /></p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/29/this-year-i-only-needed-to-open-my-window-in-brazil-to-witness-the-climate-crisis\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/books/2022/dec/29/the-new-life-by-tom-crewe-review-desire-on-trial", "title": "The New Life by Tom Crewe review – desire on trial", "date_published": "2022-12-29 07:30:13+00:00", "description": "<p>Inspired by the fight to change the law and social mores in Victorian England, this excellent debut dramatises physical intensity and moral dilemmas</p><p>Tom Crewe’s virtuoso debut The New Life is one of the most embodied historical novels I have read. The tone is set in the extraordinary opening scene. It’s London in 1894, and John is jostled against another man in a tube carriage, “close enough to smell the hairs on the back of the man’s neck”. John has an erection, “cramped” flat against the man’s body, and the man begins to move his buttocks against him. As the scene becomes more openly outrageous – the man unbuttons his flies and reaches in – it becomes clear that this is a dream. It’s a dangerous literary move but it succeeds, because it’s immediately evident that this is a novel about an erotic life that’s as yet unrealisable. From the constrictive comfort of his marital bed, John is dreaming his way into a future yet to be born.</p><p>John Addington is one of two married men who will soon collaborate on a book entitled Sexual Inversion, based on the real 1897 book of the same name by Havelock Ellis and John Addington Symonds. Crewe’s Addington has got to a point where he’s prepared to risk everything for lust, and for openness about who he is, because he is “dying” from the feeling that he’s wasted his life and destroyed his wife’s life in the process. Just when he’s begun discreetly circulating a celebration of homosexuality in ancient Greece to his friends, he’s propositioned by a man in the park and quickly moves him into his marital home as his secretary. In this febrile, ecstatic and guilty state, he encounters an article by Henry Ellis declaring that “morality is thus the normal activity of a healthy nature”. He then writes wishfully to Ellis and their collaboration begins.</p> <a href=\"https://www.theguardian.com/books/2022/dec/29/the-new-life-by-tom-crewe-review-desire-on-trial\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/29/are-you-bored-yet-beat-festive-fatigue-and-your-family-with-seven-of-the-best-new-board-games", "title": "Are you bored yet? Beat festive fatigue – and your family – with seven of the best new board games", "date_published": "2022-12-29 07:00:14+00:00", "description": "<p>From fiendish strategy, to quick-to-learn cards, here are some great ways to fill those long winter nights</p><p>The days of board games being a last-resort wintry-day activity have long-since passed. Whether you’re in need of a kid-distracting family game or looking to spend a long, dark evening in the company of friends, you should consider these cardboard treats …</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/29/are-you-bored-yet-beat-festive-fatigue-and-your-family-with-seven-of-the-best-new-board-games\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/travel/2022/dec/29/women-led-ski-touring-skiing-weekend-cairngorm-mountain-scotland", "title": "Ski touring without the machismo: a women-led weekend on Cairngorm mountain, Scotland", "date_published": "2022-12-29 07:00:14+00:00", "description": "<p>Ski and snowboard touring can be intimidating for novices. We join a two-day workshop that aims to make the sport more accessible</p><p>The closer we get to the summit, the harder the wind blows. When it fills the sky fills with tiny ice pellets picked up from the upper slopes, we seek shelter beneath a bank of snow. We have a decision to make. Continue our ascent of Cairngorm mountain or switch our kit back to snowboards and skis, and ride down from here instead.</p><p>We’re on an introductory weekend to ski touring, the sport where you attach sticky but removable “skins” to the base of your skis so you can walk uphill. In my case, though, it’s splitboard touring: I’m on a snowboard that splits in two, allowing me to climb, with skins, like a ski tourer.</p> <a href=\"https://www.theguardian.com/travel/2022/dec/29/women-led-ski-touring-skiing-weekend-cairngorm-mountain-scotland\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/film/2022/dec/29/exploited-review-college-slasher-is-a-toxic-pile-of-yuckiness", "title": "Exploited review – college slasher is a toxic pile of yuckiness", "date_published": "2022-12-29 07:00:13+00:00", "description": "<p>While there’s something to be said for tilting the hetero norms of the genre, the rest of this low-grade nasty should be swiftly consigned to history</p><p>Since the very dawn of the seventh art, critics and cinephiles have debated … what are the very best LGBT slasher films? It is possible that in a couple of decades, this film will be subject to some kind of bold revisionist reconsideration, some flashy contrarian reassessment, and creep in to the lower reaches of the Top Million. But right about now, there’s not much to be said for it, save for a certain wry irony in the pertly self-aware title.</p><p>Jordan Ver Hoeve brings minimal nuance to the role of Brian, just starting at college and coming to terms with his gay identity. Having just met his hunky roommate Jeremy (Andrew Matthew Welch), who is diffidently making out with his girlfriend on the bed (who is Jeremy kidding?) Brian finds a flashdrive on the floor, plugs it into his laptop and discovers video files of its previous owner Caleb (Colin Bates) having online sex with various freaky people whose kinks are – possibly – supposed to be funny.</p> <a href=\"https://www.theguardian.com/film/2022/dec/29/exploited-review-college-slasher-is-a-toxic-pile-of-yuckiness\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/uk-news/2022/dec/29/home-office-urged-to-reunite-eritrean-family-separated-as-they-boarded-boat", "title": "Home Office urged to reunite Eritrean family separated as they boarded boat", "date_published": "2022-12-29 07:00:13+00:00", "description": "<p>Appeal for UK authorities to bring over mother who was left in France after smugglers departed shore with her three children</p><p>The Home Office is under pressure to reunite a family of Eritrean asylum seekers after smugglers forced three children, the youngest aged just five, to cross the Channel on a small boat before their mother could get on board with them.</p><p>The woman, 31, who was staying in northern France hoping to reach the UK, paid smugglers for places on a dinghy for herself and her three children, a boy aged 14 and two girls aged nine and five, to cross the Channel on 16 December. She said she believed the UK was the place where she would find safety and a respect for the human rights of her family.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/29/home-office-urged-to-reunite-eritrean-family-separated-as-they-boarded-boat\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/29/how-rehoming-wildlife-rhinos-bison-revive-threatened-species-aoe", "title": "How rehoming wildlife from rhinos to bison can revive threatened species", "date_published": "2022-12-29 07:00:13+00:00", "description": "<p>They can be challenging, expensive and dangerous, but 2022 was a busy year for translocations and more are planned in the months ahead</p><ul><li><a href=\"https://www.theguardian.com/environment/2021/nov/29/white-rhinos-flown-from-south-africa-to-rwanda-in-largest-single-translocation\">White rhinos flown from South Africa to Rwanda in largest single translocation</a></li><li><a href=\"https://www.theguardian.com/environment/series/biodiversity--what-happened-next-\">Read more in our series Biodiversity: what happened next?</a></li></ul><p>“The birth of white rhino calves is extremely exciting news,” says Peter Fearnhead, CEO of African Parks. It is the news the conservation organisation hoped for after it completed the largest ever single translocation of white rhino in November 2021. <a href=\"https://www.theguardian.com/environment/2021/nov/29/white-rhinos-flown-from-south-africa-to-rwanda-in-largest-single-translocation\">Thirty white rhinos were transported</a> 2,100 miles from Phinda private game reserve in South Africa to Akagera national park in eastern Rwanda in a 40-hour journey completed by truck and Boeing 747.</p><p>Classified as “near threatened” by the IUCN, numbers of white rhino are declining across Africa, mainly because of poaching. The recent arrival of numerous babies in Akagera suggests the mission to create a new rhino haven is on track. “Translocation can be stressful for animals,” says Fearnhead. “Once babies start being born, it’s a sign the animals have settled well and are starting the process of building up numbers.”</p> <a href=\"https://www.theguardian.com/environment/2022/dec/29/how-rehoming-wildlife-rhinos-bison-revive-threatened-species-aoe\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/business/2022/dec/29/global-economy-recession-downturn-2023", "title": "Predictions that global economy is heading for a recession are premature | Jeffrey Frankel", "date_published": "2022-12-29 07:00:12+00:00", "description": "<p>Despite many forecasts, a worldwide downturn in 2023 is not inevitable – and it can be avoided</p><p>The world’s leading economists spent most of 2022 convincing themselves that, if the global economy was not already in a recession, it was about to fall into one. But with the year’s end, the global slump has been postponed to 2023.</p><p>Clearly, <a href=\"https://scholar.harvard.edu/files/frankel/files/barrons_isusrecession060822.pdf\">the reports</a> <a href=\"https://scholar.harvard.edu/files/frankel/files/barrons_isusrecession060822.pdf\">that</a> the US was <a href=\"http://www.jeffrey-frankel.com/2022/07/21/the-july-28-announcement-of-q2-gdp-will-not-mean-recession/\">in recession</a> during the first half of the year <a href=\"https://www.bnnbloomberg.ca/the-close/inflation-is-not-a-recession-odds-of-a-recession-this-year-not-particularly-high-harvard-professor~2460772#/.YqEd0fnLHv4.twitter\">were premature</a>, especially given how tight the country’s <a href=\"https://www.hks.harvard.edu/centers/mrcbg/programs/growthpolicy/us-job-growth-slowing-labor-market-remains-very-hot\">labour</a> <a href=\"https://www.bls.gov/news.release/pdf/empsit.pdf\">market</a> is. And, despite the <a href=\"https://www.conference-board.org/research/economy-strategy-finance-charts/CoW-Recession-Probability\">confidence</a> with which many again proclaim the inevitability of a downturn, the chances of one in the coming year are well below 100%. But, owing to the <a href=\"http://www.jeffrey-frankel.com/2022/02/27/fighting-the-last-inflation-war/\">rapid interest rate rises</a> by the US Federal Reserve and other big central banks, there is something like a 50% chance of a recession in 2023 and a 75% chance of it happening at some point during the next two years.</p> <a href=\"https://www.theguardian.com/business/2022/dec/29/global-economy-recession-downturn-2023\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/global-development/2022/dec/29/a-whites-only-luxury-store-in-harare-transformed-into-arts-centre-for-all", "title": "A ‘whites only’ luxury store in Harare transformed into arts centre for all", "date_published": "2022-12-29 06:30:12+00:00", "description": "<p>In 2014, when Greatermans closed in Zimbawe’s capital, it echoed the economic decline of the country. Now a vibrant and inclusive  cultural rebirth is under way at the downtown site</p><p>A disused city landmark that symbolised <a href=\"https://www.theguardian.com/global-development/2022/aug/29/living-on-scraps-the-zimbabwe-children-who-eke-out-a-living-from-rusty-metal\">Zimbabwe’s economic decline</a> has seen a vibrant rebirth this month. Most of the old Greatermans building was closed in 2014 as shoppers abandoned Harare’s central business district for suburban malls. Its parent company Meikles opened one of its Pick n Pay grocery stores on the ground floor but closed off the upper three floors.</p><p>Now the <a href=\"https://ne-np.facebook.com/people/ZICCA-Zimbabwe-Creative-and-Cultural-Arts/100088577582110/\">Zimbabwe Creative and Cultural Arts</a> (Zicca) team – with permission from the building owner, Old Mutual – has cleaned up eight years of dust and debris in a matter of weeks, and has staged a showcase of visual art, film, fashion, theatre and workshops throughout December.</p> <a href=\"https://www.theguardian.com/global-development/2022/dec/29/a-whites-only-luxury-store-in-harare-transformed-into-arts-centre-for-all\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/global-development/gallery/2022/dec/29/why-cricket-means-freedom-for-exiled-young-syrians-in-pictures", "title": "Howzat?! Why cricket means freedom for exiled young Syrians – in pictures", "date_published": "2022-12-29 06:00:13+00:00", "description": "<p>Life can be grim in a Beirut refugee camp for boys and girls who have known nothing but war in their homeland. But when play begins on an oasis of green amid the concrete, they ‘let go of everything bad’</p><p><strong>Photographs by Ollie Tikare</strong></p> <a href=\"https://www.theguardian.com/global-development/gallery/2022/dec/29/why-cricket-means-freedom-for-exiled-young-syrians-in-pictures\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/29/china-surveillance-protests-alarms-cameras-hikvision", "title": "Police in China can track protests by enabling ‘alarms’ on Hikvision software", "date_published": "2022-12-29 06:00:13+00:00", "description": "<p>Chinese surveillance manufacturer Hikvision has put in place tools to help police track protest activities</p><p>Chinese police can set up “alarms” for various protest activities using a software platform provided by Hikvision, a major Chinese camera and surveillance manufacturer, the Guardian has learned. Descriptions of protest activity listed among the “alarms” include “gathering crowds to disrupt order in public places”, “unlawful assembly, procession, demonstration” and threats to “petition”.</p><p>These activities are listed alongside offenses such as “gambling” or disruptive events such as “fire hazard” in technical documents available on Hikvision’s website and flagged to the Guardian by surveillance research firm IPVM, or Internet Protocol Video Market. The company’s website also included alarms for “religion” and “Falun Gong” – a spiritual movement banned in China and categorized as a cult by the government – until IPVM contacted the company. </p> <a href=\"https://www.theguardian.com/world/2022/dec/29/china-surveillance-protests-alarms-cameras-hikvision\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/uk-news/2022/dec/29/bill-clintons-ni-views-led-uk-officials-to-brace-for-turbulence-papers-reveal", "title": "Bill Clinton’s NI views led UK officials to brace for ‘turbulence’, papers reveal", "date_published": "2022-12-29 06:00:12+00:00", "description": "<p>British government urged Washington embassy to lobby incoming president, declassified documents show</p><p>The election of Bill Clinton as US president in 1992 prompted the British government to brace for “turbulence” because of his views on Northern Ireland.</p><p>The Northern Ireland Office (NIO) said the incoming president’s views on the region were unwelcome and urged the British embassy in Washington to confront him, according to an official document declassified this week.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/29/bill-clintons-ni-views-led-uk-officials-to-brace-for-turbulence-papers-reveal\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/29/how-neil-borthwick-met-angela-hartnett-we-were-in-this-tiny-lift-all-you-could-do-was-end-up-snogging", "title": "How Neil Borthwick met Angela Hartnett: ‘We were in this tiny lift. All you could do was end up snogging’", "date_published": "2022-12-29 06:00:12+00:00", "description": "<p>Hartnett, 54, and Borthwick, 41, met when they were chefs together at the Connaught hotel and were firm friends for a decade before their relationship became more serious. They now live together in London</p><p>In 2002, chef and cookbook author Angela Hartnett was heading the restaurant team at the Connaught hotel in London. When fellow chef Neil Borthwick came to work for her, she was impressed by his skills, as well as his sense of humour. “I was in the meat and fish section,” he says. “I’d previously been working in Scotland but I wanted to train up in London and then go to France.” He soon became good friends with Angela. “She was very pretty and cheeky; we were always laughing,” he says. Although she sensed he “might have a thing for me” they kept things professional. “As well as the fact I was his boss, he was also much younger than me and it wouldn’t have been appropriate,” says Angela.</p><p>Four years later, Neil followed his dreams and moved to Valence in France to work for the chef Anne-Sophie Pic at the Maison Pic. He and Angela stayed in touch and continued to meet up several times a year. “We knew a lot of the same people and sometimes a few of us would go to France to visit Neil and try out different restaurants together,” she says. In that time, Angela also opened Murano, a Michelin-starred Italian restaurant in Mayfair.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/29/how-neil-borthwick-met-angela-hartnett-we-were-in-this-tiny-lift-all-you-could-do-was-end-up-snogging\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/29/listening-reading-audiobooks-podcasts-generational-shift", "title": "Ignore the purists – listening to a book instead of reading it isn’t skiving or cheating  | Gaby Hinsliff", "date_published": "2022-12-29 06:00:12+00:00", "description": "<p>From audiobooks to podcasts and voice notes, there’s a steady generational shift in the way we understand the world</p><p>Insomniacs do it in the middle of the night. Dog owners do it while trudging round the park. Some people do it in the gym, but lately I’ve taken to doing it alone in the car, on long journeys north through the dark when I need distraction from everything circling round my head.</p><p>Listening, that is; and perhaps more specifically, listening to things you might once have read instead. The growth of audiobooks, podcasts and even <a href=\"https://www.theguardian.com/lifeandstyle/2022/feb/25/are-voice-notes-killing-the-phone-call\">voice notes</a> – those quick self-recorded clips that are steadily taking over from typed messages on WhatsApp and range, depending on the sender, from something like a brisk voicemail to a rambling internal monologue – reflects a steady generational shift away from eyes to ears as the way we take in the world, and perhaps also in how we understand it.</p><p>Gaby Hinsliff is a Guardian columnist</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/29/listening-reading-audiobooks-podcasts-generational-shift\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/music/2022/dec/29/the-best-new-music-to-look-forward-to-in-2023", "title": "The best new music to look forward to in 2023", "date_published": "2022-12-29 06:00:12+00:00", "description": "<p>Yo La Tengo, Billy Nomates, Låpsley and Paramore have hotly anticipated albums due out – while the BBCSO puts on an Everest opera and Simon Rattle waves goodbye to the Barbican</p><ul><li><a href=\"https://www.theguardian.com/culture/series/2023-culture-preview\">More from the 2023 culture preview</a></li><li><a href=\"https://www.theguardian.com/music/2022/dec/06/the-50-best-albums-of-2022\">The 50 best albums of 2022</a></li></ul><p>Pop teams up with superproducer Andrew Watt – who’s recently worked with everyone from Miley Cyrus to Morrissey to Elton John – and promises “music that will beat the shit out of you … made the old-fashioned way”. Contributions come from Red Hot Chili Peppers drummer Chad Smith and Guns N’ Roses’ Duff McKagan.<br />• 6 January</p> <a href=\"https://www.theguardian.com/music/2022/dec/29/the-best-new-music-to-look-forward-to-in-2023\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/stage/gallery/2022/dec/29/tristram-kentons-best-stage-shots-of-2022-in-pictures", "title": "Tristram Kenton’s best stage shots of 2022 – in pictures", "date_published": "2022-12-29 06:00:12+00:00", "description": "<p>From Sister Act to the Wagatha Christie trial, Shakespeare to showtunes, and footballers to ballet stars, our photographer snapped a stellar year of shows</p> <a href=\"https://www.theguardian.com/stage/gallery/2022/dec/29/tristram-kentons-best-stage-shots-of-2022-in-pictures\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/uk-news/2022/dec/29/its-me-against-the-road-meet-the-marathon-man-of-west-cumbria", "title": "‘It’s me against the road’: meet the marathon man of west Cumbria", "date_published": "2022-12-29 06:00:12+00:00", "description": "<p>Gary McKee has run a marathon a day throughout 2022 on his Three Six Five Challenge for charity</p><p>Lots of people enjoy a run before work in the morning. But how about a marathon before work? Every day? For a year?</p><p>“You do have to be committed,” said Gary McKee about his <a href=\"https://www.justgiving.com/fundraising/threesixfive\">Three Six Five Challenge</a> for charity. “But then it’s no good telling people you’re going to do something and then finding an excuse not to do it.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/29/its-me-against-the-road-meet-the-marathon-man-of-west-cumbria\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/australia-news/2022/dec/29/absolute-miracle-three-children-survive-more-than-two-days-alone-in-outback-australia-after-car-crash-killed-parents", "title": "‘Absolute miracle’: three children survive more than two days alone in outback Australia after car crash killed parents", "date_published": "2022-12-29 05:57:47+00:00", "description": "<p>Five-year-old girl credited for helping siblings survive 55 hours in 30-degree heat in car wreckage with dead parents</p><p>Trapped inside the wreckage of a car after an accident that killed her parents, a five-year-old girl has been credited for an “absolute miracle” feat of survival.</p><p>Inside an upturned Land Rover, hidden from view beside a remote Western Australian road, the young girl managed to undo her one-year-old brother’s seatbelt, freeing him.</p> <a href=\"https://www.theguardian.com/australia-news/2022/dec/29/absolute-miracle-three-children-survive-more-than-two-days-alone-in-outback-australia-after-car-crash-killed-parents\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/29/cambodia-casino-hotel-fire-deaths-dozens-trapped-poipet", "title": "At least 10 killed and dozens injured in Cambodia casino hotel fire", "date_published": "2022-12-29 05:14:30+00:00", "description": "<p>Death toll expected to rise as footage emerges showing people huddled on ledges on the burning building in Poipet</p><p>At least 10 people have died and dozens have been injured in a fire that engulfed a casino hotel in Cambodia late on Wednesday, officials have said.</p><p>Multiple videos shared online showed flames erupting from the Grand Diamond City hotel and casino in Poipet, a popular commuter town on the border with Thailand, as hundreds of rescue workers struggled to contain the blaze.</p> <a href=\"https://www.theguardian.com/world/2022/dec/29/cambodia-casino-hotel-fire-deaths-dozens-trapped-poipet\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/29/australia-south-africa-match-report-mcg-test-cricket-melbourne-cricket-ground-david-warner", "title": "Australia secure series with thumping second Test victory over South Africa | Geoff Lemon", "date_published": "2022-12-29 04:57:12+00:00", "description": "<ul><li>Australia thrash South Africa by an innings and 182 runs  </li><li>David Warner awarded Mullagh Medal for his first-innings 200</li></ul><p>It took some work but Australia wrapped up the second Test at the Melbourne Cricket Ground before tea on day four, by an innings and 182 runs, taking nine South African wickets to restrict the tourists to 204 all out. The result breaks South Africa’s streak of three series wins on Australian soil, and made it two from two for Australia this summer after beating the West Indies.</p><p>David Warner won the Johnny Mullagh Medal for best on ground after his double century on the match’s hottest day, while Mitchell Starc was influential despite bowling with an injured hand.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/29/australia-south-africa-match-report-mcg-test-cricket-melbourne-cricket-ground-david-warner\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/live/2022/dec/29/russia-ukraine-war-live-air-raid-alarms-sound-in-kyiv-and-kherson-bakhmut-reaching-stalemate-say-us-thinktank", "title": "Russia-Ukraine war live: air raid alarms sound in Kyiv and Kherson; Bakhmut reaching stalemate, say US thinktank", "date_published": "2022-12-29 04:55:01+00:00", "description": "<p>Residents urged to head to shelters amid warnings of strikes; Institute for the Study of war says Russia'n forces in Bakhmut have likely ‘culminated’</p><ul><li><strong><a href=\"https://www.theguardian.com/world/series/russia-ukraine-war-at-a-glance\">Russia-Ukraine war at a glance</a></strong></li></ul><p>The head of Ukraine’s military intelligence agency, Kyrylo Budanov, has made a similar claim to what the Institute for the Study of War had to say about Bakhmut, though he has widened it to the whole country. </p><p>Budanov says that fighting in Ukraine is at a deadlock, as neither Ukraine nor Russia is able to make significant advances.</p><p>US military doctrine defines culmination as the “point at which a force no longer has the capability to continue its form of operations, offense or defense,” and “when a force cannot continue the attack and must assume a defensive posture or execute an operational pause.” <strong>If Russian forces in Bakhmut have indeed culminated, they may nevertheless continue to attack aggressively.</strong> Culminated Russian forces may continue to conduct ineffective squad-sized assaults against Bakhmut, though these assaults would be very unlikely to make operationally significant gains.</p> <a href=\"https://www.theguardian.com/world/live/2022/dec/29/russia-ukraine-war-live-air-raid-alarms-sound-in-kyiv-and-kherson-bakhmut-reaching-stalemate-say-us-thinktank\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/29/rural-china-races-to-boost-medical-facilities-ahead-of-expected-covid-surge", "title": "Rural China races to boost medical facilities ahead of expected Covid surge", "date_published": "2022-12-29 03:47:26+00:00", "description": "<p>Poorly resourced regional hospitals brace for flood of cases during upcoming lunar new year holiday as infections soar </p><p>China’s sprawling and thinly resourced countryside was racing to beef up its medical facilities amid a surging Covid-19 wave as hundreds of millions of migrant factory workers prepare to return to their families for the lunar new year.</p><p>Each year, hundreds of millions of people, mostly working in factories near the southern and eastern coasts, return to the countryside for the lunar new year festivities, due to start on 22 January next year.</p> <a href=\"https://www.theguardian.com/world/2022/dec/29/rural-china-races-to-boost-medical-facilities-ahead-of-expected-covid-surge\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/news/audio/2022/dec/29/can-i-tell-you-a-secret-episode-four-a-reckoning", "title": "Can I tell you a secret? Episode four: a reckoning", "date_published": "2022-12-29 03:00:08+00:00", "description": "<p>Revisited: Matthew Hardy’s victims come face to face with him as an attempt is made to stop the torment once and for all</p><p><em>This week we are revisiting the Can I tell you a secret? series. This episode was first broadcast on 23 September 2022.</em></p><p>In this seven-episode podcast, Guardian journalist <strong>Sirin Kale</strong> investigates the story of Matthew Hardy, a cyberstalker who terrified people in his hometown and beyond for over a decade.</p> <a href=\"https://www.theguardian.com/news/audio/2022/dec/29/can-i-tell-you-a-secret-episode-four-a-reckoning\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/29/un-suspends-some-afghanistan-programs-taliban-female-aid-workers-ban", "title": "UN suspends some Afghanistan programs after ban on female aid workers", "date_published": "2022-12-29 02:44:29+00:00", "description": "<p>Many humanitarian activities ‘paused’ as Taliban decision to bar women NGO workers prevents vital services across the country</p><p>The United Nations said that some “time-critical” programs in Afghanistan have temporarily stopped and warned many other activities will also likely need to be paused because of a ban by the Taliban-led administration on women aid workers.</p><p>UN aid chief Martin Griffiths, the heads of UN agencies and several aid groups said in a joint statement on Wednesday that women’s “participation in aid delivery is not negotiable and must continue”, calling on authorities to reverse the decision.</p> <a href=\"https://www.theguardian.com/world/2022/dec/29/un-suspends-some-afghanistan-programs-taliban-female-aid-workers-ban\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/29/perus-ousted-president-pedro-castillo-says-he-is-a-victim-of-political-revenge", "title": "Peru’s ousted president Pedro Castillo says he is a victim of ‘political revenge’", "date_published": "2022-12-29 02:14:28+00:00", "description": "<p>Castillo is appealing against his detention earlier in December over an attempt to illegally dissolve Congress</p><p>The former Peruvian president Pedro Castillo, who is being held in pretrial detention after attempting to illegally dissolve Congress, said he was a victim of “political revenge” by his adversaries.</p><p>Castillo, speaking at a hearing on Wednesday to appeal against the detention, said he had not committed the crimes of rebellion and conspiracy for which he is under investigation.</p> <a href=\"https://www.theguardian.com/world/2022/dec/29/perus-ousted-president-pedro-castillo-says-he-is-a-victim-of-political-revenge\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/technology/2022/dec/29/twitter-users-report-global-outage-with-many-unable-to-log-into-website-or-app", "title": "Twitter users report global outage with many unable to log into website or app", "date_published": "2022-12-29 01:34:10+00:00", "description": "<p>The technical failure comes after mass layoffs at the tech firm following its takeover by Elon Musk</p><p>Twitter users have reported a massive global outage with many unable to access the website and its features.</p><p>According to <a href=\"https://downdetected.com/\">Downdetected.com</a>, which tracks site traffic, the website became unavailable shortly before midnight GMT (11am Thursday AEDT, 7pm Wednesday EST), with outages most commonly reported on website rather than the app.</p> <a href=\"https://www.theguardian.com/technology/2022/dec/29/twitter-users-report-global-outage-with-many-unable-to-log-into-website-or-app\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/29/my-104-year-old-nans-secret-to-a-long-life", "title": "My 104-year-old Nan’s secret to a long life | Lewis Isaacs", "date_published": "2022-12-29 00:58:33+00:00", "description": "<p>To understand my Nan’s incredible longevity, you have to know more about the life she’s lived</p><p>“Just because no one has lived forever before, doesn’t mean Nan won’t be the first.” That’s a joke my cousin made about my then 94-year-old grandmother. A decade later it feels more like a prophecy.</p><p>Nan is 104. She’s lived on her own for more than 30 years, remains sharp between the ears and maintains her hair appointments religiously. Whenever I mention her age the reactions are the same eye-widening universal amazement – yet it still catches me off-guard. Apparently this isn’t normal. Not everyone’s grandparent has a letter from Queen Elizabeth II.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/29/my-104-year-old-nans-secret-to-a-long-life\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/29/myanmars-junta-blamed-for-deaths-of-more-than-160-children-in-2022", "title": "Myanmar’s junta blamed for deaths of more than 160 children in 2022", "date_published": "2022-12-29 00:50:20+00:00", "description": "<p>Exiled National Unity Government says figure is a rise of 78% on last year, following February 2021 coup</p><p>Myanmar’s military junta killed 165 children in 2022, according to the country’s exiled opposition National Unity Government (NUG). According to their data, 78% more children died at the hands of the occupying military in 2022 compared with 2021.</p><p>“The NUG figure appears credible,” says Thomas Kean, a senior consultant on Myanmar for the International Crisis Group, explaining that reports are often accompanied by evidence.</p> <a href=\"https://www.theguardian.com/world/2022/dec/29/myanmars-junta-blamed-for-deaths-of-more-than-160-children-in-2022\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/29/bolivian-opposition-leader-luis-fernando-camachos-whereabouts-unknown-after-police-arrest", "title": "Bolivian opposition leader Luis Fernando Camacho’s whereabouts ‘unknown’ after police arrest", "date_published": "2022-12-29 00:37:08+00:00", "description": "<p>The Santa Cruz governor and former presidential candidate reportedly taken to a local airport to be flown to La Paz</p><p>Bolivian police have detained prominent opposition leader Luis Fernando Camacho in what has been dubbed a “kidnapping” by his supporters.</p><p>The detention on Wednesday of 43-year-old Camacho, the governor of Santa Cruz who unsuccessfully ran for president in 2020, was confirmed by the interior minister and Camacho allies.</p> <a href=\"https://www.theguardian.com/world/2022/dec/29/bolivian-opposition-leader-luis-fernando-camachos-whereabouts-unknown-after-police-arrest\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/29/russia-ukraine-war-at-a-glance-what-we-know-on-day-309-of-the-invasion", "title": "Russia-Ukraine war at a glance: what we know on day 309 of the invasion", "date_published": "2022-12-29 00:18:33+00:00", "description": "<p>Evacuation calls in Kherson amid barrage of Russian artillery attacks; Zelenskiy says of Bakhmut ‘there is no place that is not covered with blood’</p><ul><li><strong><a href=\"https://www.theguardian.com/world/ukraine\">See all our Ukraine war coverage</a></strong></li></ul> <a href=\"https://www.theguardian.com/world/2022/dec/29/russia-ukraine-war-at-a-glance-what-we-know-on-day-309-of-the-invasion\">Continue reading...</a>", "persistent": false, "language": "en-US"}], "source": {"url": "https://www.theguardian.com/international/rss", "title": "The Guardian - International"}}