[{"source": "https://businessinsider.com.pl/.feed", "title": "Jakie mogą być skutki długu publicznego?", "description": "Pojęcie długu publicznego może wydawać się abstrakcyjne. Kwoty liczone w setkach miliardów złotych, wykazy procentowe informujące o zadłużeniu państwa, regulacje unijne próbujące trzymać w ryzach kraje zbyt ochoczo wydające nie swoje pieniądze. To wszystko wydaje się odległe na tyle, że dla przeciętnego Kowalskiego jest bez znaczenia. Jednak prawda jest zupełnie inna, temat ten dotyczy każdego. Z tego powodu warto zastanowić się, czym jest i jakie mogą być skutki długu publicznego?", "link": "https://businessinsider.com.pl/finanse/makroekonomia/dlug-publiczny-czym-jest-jakie-niesie-za-soba-skutki/e5med25", "date_published": "2022-12-29 21:35:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Banknoty i monety z PRL-u – dziś mogą być warte tysiące", "description": "Polacy coraz chętniej przeszukują piwnice, strychy, stare książki czy zakurzone słoiki z nadzieją, że znajdą coś cennego. Niektórzy decydują się na sprzedanie wartościowych reliktów przeszłości, inni zaś zachowują je jako pamiątkę. Dużym zainteresowaniem cieszą się banknoty i monety z okresu PRL-u. Kolekcjonerzy jednak ostrzegają – większość pieniędzy drukowanych w tych latach to bezwartościowa pozostałość po minionych latach. Ale nie wszystkie. Czy waluta z PRL-u jest dziś coś warta? Jakie warunki muszą zostać spełnione?", "link": "https://businessinsider.com.pl/twoje-pieniadze/banknoty-i-monety-z-prl-u-dzis-moga-byc-warte-tysiace-ale-jest-kilka-warunkow/g5cykqm", "date_published": "2022-12-29 21:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Boisz się o swoją pensję w związku z Polskim Ładem? Złóż PIT-2", "description": "Nowy rok nie zaczął się dobrze dla niektórych grup zawodowych, przede wszystkim nauczycieli. Ich wynagrodzenia wypłacane są z góry, dlatego jako pierwsi odczuli realne skutki reformy podatkowej Polskiego Ładu. Pensje niższe nawet o kilkaset zł to rzeczywistość, której można jednak uniknąć. W jaki sposób? Kluczem jest formularz PIT-2.", "link": "https://businessinsider.com.pl/twoje-pieniadze/pit-2-co-to-jest-kto-powinien-go-zlozyc-i-skad-go-pobrac/n6ry5hw", "date_published": "2022-12-29 20:45:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Wyłudzenie. Ile grozi za to powszechne przestępstwo?", "description": "Oszuści znajdują coraz to nowsze sposoby na czerpanie korzyści z ludzkiej niewiedzy lub nadmiernego zaufania. Narażone są przede wszystkim osoby starsze oraz początkujący przedsiębiorcy – to oni najczęściej padają ofiarami wyłudzeń. Oszukać można na wiele sposobów, ale jedno jest pewne – w każdej sytuacji ktoś zostaje pokrzywdzony.", "link": "https://businessinsider.com.pl/twoje-pieniadze/prawo-i-podatki/jak-powaznym-przestepstwem-jest-wyludzenie-i-z-jaka-kara-sie-wiaze/x8clet8", "date_published": "2022-12-29 20:45:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "L4 na żądanie, bez teleporady. Lekarze popierają pomysł", "description": "Powinniśmy natychmiast rozpocząć dyskusję o zwolnieniach lekarskich i o tym, żeby część pacjentów, która nie musi widzieć lekarza, mogła z takiego zwolnienia skorzystać bez wizyty czy bez teleporady— mówi w RMF FM Łukasz Jankowski, szef Naczelnej Rady Lekarskiej.", "link": "https://businessinsider.com.pl/wiadomosci/l4-na-zadanie-bez-teleporady-lekarze-popieraja-pomysl/kmf761w", "date_published": "2022-12-29 20:38:09+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "13 cech świadczących o inteligencji. Sprawdź, czy je posiadasz", "description": "Poziom inteligencji nie zależy wyłącznie od liczby punktów IQ, lecz także od pewnych umiejętności interpersonalnych, szybkiego dostosowywania się do okoliczności oraz doświadczenia. Wszystkie te elementy sprawiają, że poziom inteligencji (również emocjonalnej) może z czasem być coraz większy. Wiele osób zastanawia się natomiast, jakie konkretnie usposobienie świadczy o nieprzeciętnej mądrości. Czy jest to pewność siebie, czy wręcz skromność? Jakie są cechy inteligentnych osób? Co je ze sobą łączy?", "link": "https://businessinsider.com.pl/rozwoj-osobisty/cechy-inteligentnych-osob-poznaj-13-cech-charakteru-swiadczacych-o-inteligencji/43eypb5", "date_published": "2022-12-29 20:30:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Ile alkoholu można przewieźć przez granicę?", "description": "Chcemy przywieźć z podróży kilka butelek wina francuskiego, włoskiego, węgierskiego bądź trochę piwa od sąsiadów z południa? Jak powszechnie wiadomo, za przewóz alkoholu przez granicę pobiera się podatek akcyzowy. Są jednak limity, w zakresie których można wwieźć bez problemu całkiem sporo napoju procentowego. W przypadku piwa jest to aż 110 litrów w ramach UE. Co i w jakich ilościach bez obaw można eksportować przez między państwami?", "link": "https://businessinsider.com.pl/twoje-pieniadze/przewozenie-alkoholu-przez-granice-jakie-istnieja-limity/2by08nc", "date_published": "2022-12-29 20:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Niemcy. Po dwóch latach wracają fajerwerki. \"Czekali przed sklepem nawet 13 godzin\"", "description": "Od czwartku fajerwerki znów są na rynku w Niemczech, po raz pierwszy od ponad dwóch lat. W Berlinie stęsknieni klienci czekali przed sklepem na rozpoczęcie sprzedaży nawet 13 godzin. Ustawiła się długa kolejka jak po nowy model iPhone'a — pisze \"Bild\".", "link": "https://businessinsider.com.pl/wiadomosci/fajerwerki-po-dwoch-latach-wracaja-do-niemiec-czekali-przed-sklepem-13-godzin/eqxtq7c", "date_published": "2022-12-29 19:57:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Zmarł Pele. Legendarny brazylijski piłkarz miał 82 lata", "description": "W wieku 82 lat zmarł Pele, uważany przez wielu za najlepszego piłkarza w historii. Brazylijczyk, jako jedyny zawodnik w historii, jest trzykrotnym mistrzem świata w piłce nożnej.", "link": "https://businessinsider.com.pl/wiadomosci/zmarl-pele-legendarny-brazylijski-pilkarz-strzelil-ponad-1200-goli/8z6vkk3", "date_published": "2022-12-29 19:20:08+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Pierwszy dzień w nowej pracy. Te rzeczy warto zrobić", "description": "Pierwszy dzień w nowej pracy — nieważne, czy na stanowisku prezesa, czy którejś z posad juniorskich — to jeden z najbardziej pamiętnych momentów kariery. To także jeden z najważniejszych dni w pracy — odpowiednie przygotowanie się do niego pozwala stworzyć naprawdę doskonały grunt pod efektywną pracę. I odwrotnie: jeśli już na początku zrobi się kiepskie wrażenie, później będzie tylko pod górkę.", "link": "https://businessinsider.com.pl/rozwoj-osobisty/kariera/pierwszy-dzien-w-pracy-jak-postepowac-aby-zrobic-dobre-wrazenie/1qce812", "date_published": "2022-12-29 19:15:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Jak wygląda praca w Wielkiej Brytanii w 2022 r.?", "description": "Nowy system punktowy obowiązujący na Wyspach Brytyjskich znacznie utrudnia podjęcie legalnej pracy cudzoziemcom. O zatrudnienie nie muszą obawiać się wykwalifikowani specjaliści, zwłaszcza w branży medycznej i IT. Proces imigracyjny przedkłada kwalifikacje i kompetencje pracownika ponad jego kraj pochodzenia. Najtrudniej jest uzyskać pracę osobom z niepełnym wykształceniem i bez znajomości języka angielskiego. Jak wyglądają procedury dotyczące zatrudnienia na Wyspach? Ile mogą wynieść zarobki?", "link": "https://businessinsider.com.pl/twoje-pieniadze/praca/procedury-i-zarobki-w-wielkiej-brytanii-jak-obecnie-wyglada-sytuacja/m3khcry", "date_published": "2022-12-29 19:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Prywatne ubezpieczenie zdrowotne — szybszy dostęp do lekarzy specjalistów", "description": "Każda osoba wykonująca zawód na podstawie umowy o pracę ma bezpośredni dostęp do państwowej opieki NFZ. Jednak ten, kto nie spotkał się z godzinnymi kolejkami do specjalisty, nie wie, jak zawodna bywa publiczna ochrona zdrowia. Z pomocą przychodzą indywidualne placówki współpracujące z towarzystwami ubezpieczeniowymi, które oferują rozbudowane pakiety medyczne. Czym jest prywatne ubezpieczenie zdrowotne? Jakie kryteria należy wziąć pod uwagę przy wyborze?", "link": "https://businessinsider.com.pl/poradnik-finansowy/ubezpieczenia/szybszy-dostep-do-lekarzy-specjalistow-prywatne-ubezpieczenie-zdrowotne/0jfsb6k", "date_published": "2022-12-29 18:30:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Amerykański gigant naftowy nie chce dzielić się zyskami. Pozywa UE", "description": "Amerykański koncern naftowo-gazowy ExxonMobil pozywa Unię Europejską w związku z unijną opłatą za tzw. nieoczekiwane zyski. Koncern utrzymuje, że \"opłata\" jest w istocie podatkiem, który mogą nakładać tylko kraje członkowskie UE.", "link": "https://businessinsider.com.pl/gospodarka/amerykanski-gigant-naftowy-nie-chce-dzielic-sie-zyskami-pozywa-ue/6lr2sjq", "date_published": "2022-12-29 18:19:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Monitoring pracowników – czy można zamontować kamery w miejscu pracy?", "description": "Montowanie kamer w sferze publicznej jest coraz popularniejszą praktyką, również w miejscach pracy. Ma to na celu przede wszystkim zapewnienie bezpieczeństwa zatrudnionym czy klientom. Warto wiedzieć, że istnieją jednak granice wyznaczane przez przepisy. W niektórych przypadkach monitoring pracowników może bowiem naruszać ich prywatność. Co więcej, pod tym pojęciem kryją się również inne rodzaje kontroli niż tylko klasyczne rejestrowanie obrazu wizyjnego. W jakich sytuacjach można zamontować kamery w miejscu pracy? Czy jest to legalne?", "link": "https://businessinsider.com.pl/twoje-pieniadze/praca/monitoring-pracownikow-czy-mozna-zamontowac-kamery-w-miejscu-pracy/9v089mv", "date_published": "2022-12-29 18:15:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Agencja zatrudnienia — jak to działa?", "description": "Agencje zatrudnienia istnieją od dawna, jednak w ostatniej dekadzie ich rola w procesie pośrednictwa pracy znacznie wzrosła. Prowadzenie działalności w zakresie doradztwa personalnego jest bardzo pożądane. Agencje są w stanie udzielić skutecznej pomocy osobom, które nie wiedzą, jaką branżę wybrać, lub poszukują idealnego zajęcia odpowiadającego ich określonym kwalifikacjom zawodowym. Jak działa agencja zatrudnienia? Co trzeba o niej wiedzieć? Co to jest?", "link": "https://businessinsider.com.pl/twoje-pieniadze/praca/agencja-zatrudnienia-w-jaki-sposob-funkcjonuje/shwr93b", "date_published": "2022-12-29 18:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Radiobudzik — mały, niedrogi i przydatny gadżet. Przegląd modeli", "description": "Radiobudzik to małe, niedrogie i praktyczne urządzenie, które na co dzień budzi nas oraz umila poranki dobrą muzyką i ciekawą audycją. Przed zakupem warto porównać modele, funkcje i wygląd urządzenia. Nowoczesne radiobudziki posiadają wiele przydatnych funkcji, np. informowanie o temperaturze i ciśnieniu powietrza, ładowanie telefonu, budzenie za pomocą ulubionej piosenki. Rynek oferuje duży wybór radiobudzików. W poniższym artykule podpowiadamy, na co zwrócić uwagę przy dokonywaniu wyboru oraz prezentujemy najlepsze, wg nas, modele.", "link": "https://businessinsider.com.pl/technologie/radiobudzik-maly-niedrogi-i-przydatny-gadzet-przeglad-modeli/hch28jc", "date_published": "2022-12-29 17:57:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "O ile w 2023 r. wzrosną składki ZUS? Rekordowe kwoty", "description": "W 2023 r. przedsiębiorcy zapłacą prawie 2,5 tys. zł więcej z tytułu składek na ubezpieczenie społeczne. To skutek wzrostu prognozowanego, przeciętnego wynagrodzenia. Więcej wydadzą też osoby z firmą, które korzystają z preferencji we wpłatach do ZUS-u. W ich przypadku wysokość składek zmieni się dwa razy w ciągu roku — od stycznia i lipca 2023 r.", "link": "https://businessinsider.com.pl/prawo/praca/skladki-zus-w-2023-r-rekordowe-wzrosty/egb9m08", "date_published": "2022-12-29 17:52:28+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Blokada rachunku bankowego — co zrobić w takiej sytuacji?", "description": "Blokada rachunku bankowego występuje tylko w niektórych sytuacjach, lecz każdorazowo okazuje się problematyczna dla właściciela konta. Wskutek niej nie da się bowiem wypłacić pieniędzy, zrobić zakupów czy też wykonać przelewu. Kto odpowiada za taki stan rzeczy? Kiedy i dlaczego środki na rachunku bankowym zostają zablokowane? Jak temu zapobiec?", "link": "https://businessinsider.com.pl/twoje-pieniadze/blokada-rachunku-bankowego-kiedy-nastepuje-co-zrobic-w-takiej-sytuacji/wh2f8h1", "date_published": "2022-12-29 17:45:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Gorączka złota w bankach centralnych. Pod lupą Rosja i Chiny", "description": "Banki centralne gromadzą złoto w najszybszym tempie od 1967 r., co wskazuje, że niektóre kraje chcą zdywersyfikować swoje rezerwy \"z dala od dolara\" — pisze \"Financial Times\". Analitycy jako dużych nabywców wskazują Chiny i Rosję.", "link": "https://businessinsider.com.pl/gospodarka/trwa-goraczka-zlota-pod-lupa-rosja-i-chiny/273fz1j", "date_published": "2022-12-29 17:41:29+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kuszą dodatkowym świadczeniem z powodu migracji i wojny. To oszustwo", "description": "Oszuści podszywający się pod Ministerstwo Finansów obiecują przyznanie jednorazowego świadczenia bezrobotnym i pracującym obywatelom RP, ze względu na wysoki poziom migracji obywateli Ukrainy. W rzeczywistości jest to próba wyłudzenia danych osobowych i haseł.", "link": "https://businessinsider.com.pl/twoje-pieniadze/dodatkowe-swiadczenie-z-powodu-migracji-i-wojny-to-oszustwo-komunikat-ministerstwa/11d1z2l", "date_published": "2022-12-29 17:37:22+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Wraca wyższy VAT na paliwa. Co dalej z ceną? \"Nie ma potrzeby, aby kupować je na zapas\"", "description": "Za trzy dni wraca wyższa stawka VAT na paliwo. Skoczy z 8 proc. do 23 proc. Przedstawiciele Orlenu zapewniają, że na stacjach nie dojdzie do gwałtownego skoku cen. Jak to możliwe? Wygląda na to, że dziś płacimy więcej, niż moglibyśmy płacić, żeby z dnia na dzień nie płacić znacznie więcej.", "link": "https://businessinsider.com.pl/biznes/wraca-wyzszy-vat-na-paliwa-co-dalej-z-cena-nie-ma-potrzeby-aby-kupowac-je-na-zapas/29jes4m", "date_published": "2022-12-29 17:01:23+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Natura przyszła nam z pomocą. Rekordy wiatraków w energetyce i to akurat po awarii Kozienic", "description": "Przełom starego i nowego roku zapowiadał się zimno i ciemno po informacjach o awarii i ponad dwutygodniowym wyłączeniu bloku energetycznego w największej elektrowni w Polsce w Kozienicach. Wtedy do wsparcia przystąpiły siły natury. Jak wcześniej nie wiało, tak nagle zaczęło wiać. I to porządnie.", "link": "https://businessinsider.com.pl/gospodarka/oze-ratuje-energetyke-rekordy-wiatrakow-i-to-akurat-po-awarii-kozienic/0ebpm20", "date_published": "2022-12-29 16:32:39+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Chiny otwierają granice, państwa Unii mają problem", "description": "Pod naciskiem społeczeństwa chińskie władze zdecydowały się odejść od restrykcyjnej polityki zero covid. Jednocześnie kraj mierzy się z kolejną falą zakażeń koronawirusem. Państwa Unii zastanawiają się, jak odpowiedzieć na otwarcie granic i zmianę podejścia do pandemii przez Chińską Republikę Ludową.", "link": "https://businessinsider.com.pl/wiadomosci/chiny-otwieraja-granice-panstwa-unii-maja-problem/p0741xh", "date_published": "2022-12-29 16:27:11+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Jakie pytania warto zadać podczas rozmowy kwalifikacyjnej?", "description": "Podczas rozmowy kwalifikacyjnej nie tylko jedna strona ma prawo zadawać pytania. Ubiegając się o pracę, też możemy, a nawet powinniśmy to robić. Trzeba mieć pewność, że nie tylko my odpowiadamy pracodawcy, ale i pracodawca nam, więc gdy padnie w końcu pytanie: \"Czy ma pan/pani jakieś pytania?\" trzeba z tego skorzystać.", "link": "https://businessinsider.com.pl/rozwoj-osobisty/kariera/rozmowa-kwalifikacyjna-jak-sie-przygotowac-i-jakie-zadawac-pytania/v2hsqyl", "date_published": "2022-12-29 16:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Zasiłki w Niemczech. Jakie dodatkowe świadczenia socjalne można pozyskać w 2023 r.?", "description": "Zasiłki w Niemczech i dodatkowe świadczenia socjalne od lat rozbudzają wyobraźnię wielu emigrantów zarobkowych. Niemcy — jako najbogatsza gospodarka Europy — mają dobrze rozbudowany system danin społecznych. Ze świadczeń mogą skorzystać nie tylko obywatele Niemiec, lecz także pracujący tam obcokrajowcy. Jak to zrobić? Ile wynoszą benefity?", "link": "https://businessinsider.com.pl/poradnik-finansowy/zasilki-w-niemczech-jakie-swiadczenia-socjalne-mozna-pozyskac-w-2023-r/1lwbnsb", "date_published": "2022-12-29 16:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Tańszy węgiel od samorządów. Mieszkańcom Mazur gmina proponuje zakup na Pomorzu", "description": "Dwie mazurskie gminy wskazały mieszkańcom możliwość zakupu tańszego węgla w składzie na Pomorzu, oddalonym o ponad 200 km. Mieszkańcy mają sami pokryć koszty transportu.", "link": "https://businessinsider.com.pl/twoje-pieniadze/tanszy-wegiel-od-samorzadow-na-niektorych-czeka-w-innym-wojewodztwie/6hlp1k1", "date_published": "2022-12-29 15:28:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Tarcza dała 518 zł każdej rodzinie. W 2023 r. nie będzie tak różowo", "description": "Ministerstwo Finansów policzyło, ile średnio zostaje w kieszeni gospodarstw domowych dzięki tarczy antyinflacyjnej i obniżkom VAT na poszczególne produkty. Sama obniżka VAT na żywność do zera dała w 2022 r. średnio 518 zł każdej rodzinie. – To radykalna obniżka – przekonywał na konferencji prasowej Artur Soboń, wiceminister finansów. Dodajmy, że zerowa stawka VAT na żywność pozostanie również do połowy 2023 r.", "link": "https://businessinsider.com.pl/prawo/podatki/tarcza-antyinflacyjna-dala-518-zl-kazdej-rodzinie-ile-dostaniesz-w-2023-r/8qvh1k1", "date_published": "2022-12-29 15:16:25+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Ubezpieczenie wynajmowanego mieszkania — ile kosztuje?", "description": "Wielu wynajmujących zastanawia się, czy ubezpieczenie kupionego pod inwestycję mieszkania jest w ogóle możliwe. Towarzystwa ubezpieczeniowe w odpowiedzi na potrzeby osób, które są właścicielami nieruchomości, przewidziały taką opcję. Ile kosztuje to rozwiązanie? Czy trzeba to uzgodnić z najemcą? Kto powinien podpisać umowę polisy?", "link": "https://businessinsider.com.pl/poradnik-finansowy/ubezpieczenia/ile-kosztuje-ubezpieczenie-wynajmowanego-mieszkania-i-jak-przebiega-caly-proces/ncxdlgq", "date_published": "2022-12-29 15:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Pogorszenie na amerykańskim rynku pracy. Ale stopniowe i oczekiwane", "description": "W Stanach Zjednoczonych Ameryki liczba osób wnioskujących po raz pierwszy o zasiłek dla bezrobotnych wzrasta, ale stopniowo. Przybyło także bezrobotnych wciąż pobierających wsparcie socjalne. Na razie jednak nie zmienia to perspektyw dotyczących stóp procentowych w USA.", "link": "https://businessinsider.com.pl/finanse/makroekonomia/pogorszenie-na-amerykanskim-rynku-pracy-ale-stopniowe-i-oczekiwane/n7qzexq", "date_published": "2022-12-29 14:56:35+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Zapłać ZUS w grudniu, a zaoszczędzisz nawet 5 tys. zł na składce zdrowotnej", "description": "Prowadzący działalność gospodarczą, opłacający ryczałt ewidencjonowany mogą uniknąć wyższej składki zdrowotnej za cały 2022 r. Chodzi o osoby, których przychody za cały 2022 r. mogą przekroczyć granicę 60 tys. zł lub 300 tys. zł. Przekroczenie tych limitów choćby o 1 gr powoduje, że za cały rok trzeba dopłacić składkę zdrowotną. Jest jednak sposób, aby uniknąć dopłaty, ale można z niego skorzystać tylko do końca grudnia.", "link": "https://businessinsider.com.pl/prawo/podatki/skladka-zdrowotna-za-2022-r-jak-uniknac-doplaty-zostalo-malo-czasu/2x2pp0g", "date_published": "2022-12-29 14:43:24+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Ubezpieczenie sprzętu sportowego – jak działa, co obejmuje, ile kosztuje", "description": "Zarówno miłośnicy aktywności fizycznej, jak i zawodowi sportowcy często korzystają ze specjalistycznego sprzętu w danej dziedzinie. Mogą to być deski surfingowe, rakiety tenisowe, ochraniacze, sprzęt wspinaczkowy, kije golfowe bądź rowery. Niezależnie od tego, czy dana osoba przebywa na specjalnej delegacji, czy na urlopie, ochrona całego wyposażenia może być bardzo ważna. Warto więc rozważyć ubezpieczenie sprzętu sportowego. Ile to kosztuje i jaki zakres obejmuje? Czy da się ubezpieczyć każdy rodzaj wyposażenia?", "link": "https://businessinsider.com.pl/poradnik-finansowy/ubezpieczenia/ubezpieczenie-sprzetu-sportowego-co-obejmuje-i-ile-kosztuje/1dggbe6", "date_published": "2022-12-29 14:30:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Nawet 60 mln zł dla seniorów. Nabór potrwa jeszcze tylko kilka dni", "description": "Jeszcze tylko do 5 stycznia 2023 r. można składać wnioski o dofinansowanie w ramach programu Senior plus. Do rozdania w aktualnej edycji jest 60 mln zł. Głównym celem programu jest zwiększenie aktywności osób starszych w życiu społecznym. Kto może się ubiegać o pieniądze i na jaką kwotę może liczyć? Wyjaśniamy.", "link": "https://businessinsider.com.pl/wiadomosci/nawet-60-mln-zl-dla-seniorow-nabor-potrwa-jeszcze-tylko-kilka-dni/8vzhqmz", "date_published": "2022-12-29 14:20:21+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Ubezpieczenie mienia w transporcie. Jak zmniejszyć straty finansowe podczas przewozu?", "description": "Przewóz mienia zawsze wiąże się z ryzykiem jego zniszczenia podczas transportu. Aby chronić właściciela towaru przed stratami finansowymi, towarzystwa ubezpieczeniowe oferują polisy cargo. Tego typu umowa zawiera różnorodny katalog nagłych zdarzeń, dzięki czemu zakres takiej ochrony jest bardzo szeroki, a dodatkowo można negocjować jej warunki. Na czym polega ubezpieczenie mienia w transporcie? Jakie towary się ubezpiecza? Jakie są ograniczenia?", "link": "https://businessinsider.com.pl/poradnik-finansowy/ubezpieczenia/ubezpieczenie-mienia-w-transporcie-jak-zmniejszyc-straty-finansowe-podczas-przewozu/kbc1keh", "date_published": "2022-12-29 14:15:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Słabe dane o polskiej wymianie towarowej. Drugi najsłabszy wynik w historii", "description": "Ujemny wynik obrotów w rachunku bieżącym Polski staje się coraz większy w dużej mierze za sprawą pogarszającej się wymiany towarów. III kwartał 2022 r. przyniósł w tym zakresie drugi najgorszy wynik w historii.", "link": "https://businessinsider.com.pl/finanse/makroekonomia/slabe-dane-o-polskiej-wymianie-towarowej-drugi-najslabszy-wynik-w-historii/zw9ydr0", "date_published": "2022-12-29 13:51:11+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Przełomowy moment na rynku lokat. Które banki oferują najwyższe oprocentowanie?", "description": "Wygląda na to, że na rynku lokat bankowych w Polsce doszło do przesilenia. Nie wszystkie bowiem zmiany są już bowiem jednoznacznie pozytywne dla klientów i sporo może wskazywać, że jesteśmy w okolicach szczytu pod względem wysokości oprocentowania depozytów terminowych. Tym bardziej, że stopy procentowe od trzech miesięcy nie rosną i prawdopodobnie już nie pójdą w górę, a banki są nadpłynne.", "link": "https://businessinsider.com.pl/twoje-pieniadze/przelomowy-moment-na-rynku-lokat-ktore-banki-oferuja-najwyzsze-oprocentowanie/qlynpdq", "date_published": "2022-12-29 12:55:25+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Strajk personelu Ryanair, odwołanych 128 lotów w weekend noworoczny", "description": "Personel Ryanair w Belgii strajkuje, zarzucając firmie, że łamie prawo pracy. W efekcie tania linia lotnicza odwołuje w ten weekend łącznie 128 lotów z i do znajdującego się w okolicach Brukseli lotniska Charleroi.", "link": "https://businessinsider.com.pl/biznes/strajk-personelu-ryanair-odwolanych-128-lotow-w-nowym-roku/6r4pje5", "date_published": "2022-12-29 12:45:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Rafineria Gdańska i Unimot pod szczególną ochroną rządu", "description": "Zgodnie z rozporządzeniem Rady Ministrów Rafineria Gdańska i Unimot od 1 stycznia znajdą się w wykazie podmiotów podlegających szczególnej ochronie. To pokłosie wątpliwości w sprawie fuzji Orlenu z Lotosem.", "link": "https://businessinsider.com.pl/wiadomosci/rafineria-gdanska-i-unimot-pod-szczegolna-ochrona-rzadu/zdb2qq6", "date_published": "2022-12-29 12:42:08+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Projektor multimedialny do domu. Podpowiadamy, jaki model wybrać", "description": "Jeśli zastanawiasz się nad kupnem projektora multimedialnego, który będzie nowoczesny i spełni obecne wymagania technologiczne, a jednocześnie nie będzie kosztował majątku, to ten artykuł jest dla ciebie. W ostatnich latach domowe projektory zyskały na popularności. Każdy, kto jest fanem sportu, filmów i seriali marzy, by mieć własne kino w domowym zaciszu. Nowoczesne projektory multimedialne dają tę możliwość, zaskakując odbiorców doskonałą jakością obrazu i przestrzennym dźwiękiem.", "link": "https://businessinsider.com.pl/technologie/projektor-multimedialny-do-domu-podpowiadamy-jaki-model-wybrac/q043yt6", "date_published": "2022-12-29 12:33:41+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Milion jenów na dziecko. Japonia walczy z przeludnieniem stolicy", "description": "Rząd Japonii przyjął nietypową strategię walki ze zbyt dużą koncentracją ludności w stolicy kraju. Zaoferuje nawet milion jenów (7,5 tys. dol.) za każde dziecko rodzinom, które zdecydują się na wyprowadzkę z Tokio – podała w czwartek agencja Kyodo, powołując się na anonimowe źródło zapoznane z planem.", "link": "https://businessinsider.com.pl/wiadomosci/milion-jenow-na-dziecko-japonia-walczy-z-przeludnieniem-stolicy/d4ty5yf", "date_published": "2022-12-29 12:32:13+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Opłaty sądowe w sprawach cywilnych — czego dotyczą?", "description": "Na opłaty sądowe — lub inaczej koszty sądowe — składa się wiele różnych należności, które obowiązkowo trzeba uregulować, aby zostało wszczęte postępowanie. W przypadku wygrania sprawy można ubiegać się o ich zwrot — wystarczy złożyć odpowiedni wniosek. Jak to zrobić? Kogo dotyczą opłaty sądowe w sprawach cywilnych? Ile kosztują poszczególne czynności?", "link": "https://businessinsider.com.pl/twoje-pieniadze/prawo-i-podatki/co-to-sa-oplaty-sadowe-w-sprawach-cywilnych-i-kogo-dotycza/564k08s", "date_published": "2022-12-29 12:17:59+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Rosyjskie bojówki Wagnera kłócą się z armią o niepowodzenia podczas inwazji na Ukrainę", "description": "Przywódca prorosyjskiej prywatnej armii Grupy Wagner ostro skrytykował regularne wojsko rosyjskie, zaostrzając tym samym wewnętrzne spory wokół wojny w Ukrainie.", "link": "https://businessinsider.com.pl/wiadomosci/bojowki-wagnera-kloca-sie-z-armia-o-niepowodzenia-podczas-inwazji-na-ukraine/6b8t6j3", "date_published": "2022-12-29 12:06:40+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Milionowe kary dla Allegro. Dotyczą m.in. usługi Smart", "description": "Prezes UOKiK wydał dwie decyzje, w których nałożył łącznie ponad 210 mln zł kar na spółkę Allegro, w tym 206 mln zł kary za faworyzowanie własnego sklepu internetowego kosztem konkurencyjnych sprzedawców na platformie allegro.pl.", "link": "https://businessinsider.com.pl/firmy/milionowe-kary-dla-allegro-dotycza-min-uslugi-smart/psp5s27", "date_published": "2022-12-29 12:05:25+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Milionowe kary dla Allegro. Za naruszenia regulaminów", "description": "Dwie kary wynoszące łącznie blisko 4 mln zł nałożył Urząd Ochrony Konkurencji i Konsumentów na Allegro Sp. z.o.o (Allegro PL). Obie dotyczą naruszeń regulaminów.", "link": "https://businessinsider.com.pl/firmy/milionowe-kary-dla-allegro-za-naruszenia-regulaminow/psp5s27", "date_published": "2022-12-29 12:05:25+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Ukraina oferuje mieszkańcom gotówkę i darmowe przejazdy, by ewakuowali się z Chersonia", "description": "Władze ukraińskie zachęcają obywateli uwięzionych w Chersoniu do opuszczenia miasta, ponieważ w ostatnim tygodniu tragicznego dla Ukrainy roku siły rosyjskie rozpoczęły ostrzał rakietowy i artyleryjski regionu.", "link": "https://businessinsider.com.pl/wiadomosci/ukraina-oferuje-gotowke-i-darmowe-przejazdy-pociagiem-za-wyjazd-z-chersonia/3fx5njt", "date_published": "2022-12-29 11:53:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Tak pieniądze z Krajowego Planu Odbudowy pomogłyby polskiej gospodarce", "description": "Środki z Krajowego Planu Odbudowy, sięgające łącznie 35,4 mld euro (ponad 160 mld zł), mają duże znaczenie i przełożą się na wyższy wzrost PKB. Wiceminister finansów Artur Soboń szacuje, jak duży będzie pozytywny wpływ KPO na polską gospodarkę.", "link": "https://businessinsider.com.pl/finanse/makroekonomia/tak-pieniadze-z-krajowego-planu-odbudowy-pomoglyby-polskiej-gospodarce/bks71d2", "date_published": "2022-12-29 11:52:39+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Limity na ropę. Minister Moskwa zapewnia, że Polska jest gotowa na zemstę Putina", "description": "Władimir Putin podpisał dekret o krokach odwetowych na wprowadzenie limitu cen rosyjskiej ropy. Według dokumentu Rosja zabrania dostaw ropy i produktów naftowych podmiotom zagranicznym, jeśli kontrakt zakłada limit cen. Minister klimatu Anna Moskwa zapewnia, że Polska, w tym przede wszystkim Orlen, poradzi sobie z ewentualnym brakiem dostaw.", "link": "https://businessinsider.com.pl/gospodarka/limity-na-rope-minister-moskwa-zapewnia-ze-polska-jest-gotowa-na-zemste-putina/3s1m614", "date_published": "2022-12-29 11:48:42+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Soboń: z wakacji kredytowych skorzystało ponad milion Polaków", "description": "Z wakacji kredytowych skorzystało 1,04 mln Polaków i objęły one kredyty o wartości 261,6 mld zł. – przekazał na konferencji prasowej wiceminister finansów Artur Soboń.", "link": "https://businessinsider.com.pl/twoje-pieniadze/sobon-z-wakacji-kredytowych-skorzystalo-ponad-milion-polakow/19f3tcd", "date_published": "2022-12-29 11:16:33+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Zmiany na rynku pracy w 2023 r. Ekspert wskazuje zawody, które mogą \"rozbić bank\"", "description": "Jak będzie wyglądał rynek pracy w 2023 r.? Czy zaleją nas zwolnienia grupowe i masowe bezrobocie? Zdaniem eksperta pewne spowolnienie rekrutacji będzie raczej oczywiste, ale to już nie będzie to samo, co np. w początkowej fazie pandemii, kiedy pracodawcy zwalniali niemal lawinowo. Tym razem już wiedzą, czym to grozi, nauczyli się, że zbyt szybko mogą pojawić się braki kadrowe, a o wykwalifikowanych pracowników nie będzie łatwo.", "link": "https://businessinsider.com.pl/wiadomosci/zmiany-na-rynku-pracy-2023-te-zawody-moga-rozbic-bank/65nsxkk", "date_published": "2022-12-29 11:14:24+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Musk zapewnia pracowników, że nie powinni \"przejmować się szaleństwem giełdowym\"", "description": "Od początku tego roku akcje Tesli spadły o prawie 70 proc., a w samym grudniu o 40 proc.. Phil Rosen z Insidera zauważył, że Tesla była jedną z najgorzej radzących sobie spółek na indeksie giełdowym S&amp;P 500. Mimo to Elon Musk, CEO Tesli, powiedział swoim pracownikom, żeby nie przejmowali się \"szaleństwem giełdowym\".", "link": "https://businessinsider.com.pl/wiadomosci/musk-zapewnia-pracownikow-ze-nie-powinni-przejmowac-sie-szalenstwem-gieldowym/ctxlezc", "date_published": "2022-12-29 11:11:10+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Ropa i miedź tanieją. Światowa gospodarka wkracza w spowolnienie", "description": "Miedź na giełdzie metali LME w Londynie tanieje, a inwestorzy obawiają się, że wzrost liczby przypadków Covid-19 w Chinach osłabi popyt na metale. Podobnie jest z ropą naftową, choć tutaj widoczne są również problemy z podażą i malejącymi zapasami w USA. Światowa gospodarka spowolnienia, więc presja na wzrost cen surowców może maleć.", "link": "https://businessinsider.com.pl/biznes/ropa-i-miedz-tanieja-swiatowa-gospodarka-wkracza-w-spowolnienie/g3m1wr6", "date_published": "2022-12-29 11:07:52+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "USA \"w gotowości\" wobec nowych wariantów wirusa. Chiny pod specjalnym nadzorem", "description": "Niemal każdy podróżujący do Stanów Zjednoczonych z Chin będzie musiał pokazać dowód negatywnego wyniku testu, począwszy od przyszłego tygodnia, podały w środę federalne organy zdrowia USA. Amerykanie ostrzegają też, że gwałtownie rosnące przypadki zakażeń w Chinach mogą \"zwiększyć\" potencjał pojawienia się nowych wariantów.", "link": "https://businessinsider.com.pl/wiadomosci/usa-w-gotowosci-wobec-nowych-wariantow-wirusa-chiny-pod-specjalnym-nadzorem/1w0xctf", "date_published": "2022-12-29 10:36:16+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Czarnek o przyszłości nauczycieli. \"Trzeba będzie zwolnić 100 tys. osób\"", "description": "W perspektywie dwóch, trzech lat trzeba będzie zwolnić ok. 100 tys. nauczycieli — powiedział w czwartek w Radiu Zet minister edukacji i nauki Przemysław Czarnek. Dodał, że jest to spowodowane potężnym niżem demograficznym, zwłaszcza w szkołach średnich.", "link": "https://businessinsider.com.pl/twoje-pieniadze/praca/czarnek-o-przyszlosci-nauczycieli-trzeba-bedzie-zwolnic-100-tys-osob/rnvcre1", "date_published": "2022-12-29 10:11:46+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Coraz więcej firm planuje zwolnienia. Drastyczny wzrost", "description": "Zatrudnienie w polskiej gospodarce jest rekordowo wysokie, ale odsetek firm planujących zwolnienia wzrósł z 12 do 23 proc. rdr — wynika z badania Grant Thornton. Według ekspertów nawet wzrost bezrobocia o połowę oznaczałby jedynie cofnięcie się rynku pracy o trzy-cztery lata.", "link": "https://businessinsider.com.pl/firmy/coraz-wiecej-firm-planuje-zwolnienia-drastyczny-wzrost/4nq2fbn", "date_published": "2022-12-29 10:01:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Abonament RTV mocno w górę. Oto stawki na 2023 r. i terminy płatności", "description": "Znaczące podwyżki abonamentu radiowo-telewizyjnego czekają Polaków w 2023 r. Można nieco oszczędzić, płacąc szybko całą kwotę. W przyszłym roku ponad połowę wpływów z abonamentu otrzyma TVP. Reszta pójdzie na Polskie Radio, w tym na rozgłośnie regionalne.", "link": "https://businessinsider.com.pl/twoje-pieniadze/abonament-rtv-mocno-w-gore-oto-stawki-na-2023-r-i-terminy-platnosci/eprxm1f", "date_published": "2022-12-29 10:01:34+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Biedronka, Lidl i inni w sylwestra zamkną się wcześniej. Godziny otwarć sklepów", "description": "W sylwestra, podobnie jak w wigilię, większość sieci handlowych zamknie się wcześniej. Mimo wszystko zakupy będzie można robić do późniejszych godzin niż przed Bożym Narodzeniem.", "link": "https://businessinsider.com.pl/wiadomosci/biedronka-lidl-i-inni-w-sylwestra-zamkna-sie-wczesniej-godziny-otwarc-sklepow/vr3sf8g", "date_published": "2022-12-29 09:37:12+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Większość firm planuje podwyżki cen w 2023 r.", "description": "Aż 66 proc. respondentów badania Polskiego Instytutu Ekonomicznego planuje podwyżki cen lub usług dla odbiorców w 2023 roku.", "link": "https://businessinsider.com.pl/finanse/wiekszosc-firm-planuje-podwyzki-cen-w-2023-r/3qcq1f6", "date_published": "2022-12-29 09:17:21+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "5 mln osób z niższą pensją od marca? Tak zadziała autozapis do PPK", "description": "Już raz wypisałeś się z PPK? Jeśli nie chcesz uczestniczyć w programie, będziesz musiał zrobić to ponownie. Warto to jednak dobrze przemyśleć, bo eksperci ostrzegają dzisiejszych 30-latków, że czekają ich głodowe emerytury.", "link": "https://businessinsider.com.pl/twoje-pieniadze/praca/5-mln-osob-z-nizsza-pensja-od-marca-tak-zadziala-autozapis-do-ppk/fntlg75", "date_published": "2022-12-29 08:57:05+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "W te niedziele w 2023 r. zrobimy zakupy", "description": "W 2023 r. będziemy mogli zrobić zakupy w siedem niedziel handlowych. Najwięcej ich wypada w grudniu.", "link": "https://businessinsider.com.pl/finanse/handel/niedziele-handlowe-w-2023-roku/k83hp8w", "date_published": "2022-12-29 08:43:07+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Miękkie lądowanie. Bliski współpracownik premiera przedstawia scenariusz dla polskiej gospodarki", "description": "Polska uniknie recesji w przyszłym roku, ze wzrostem wynoszącym ok. 1 proc., zaś od kwietnia należy oczekiwać \"bardzo znaczącego\" spadku inflacji, ocenia prezes Polskiego Funduszu Rozwoju (PFR) Paweł Borys. Jego zdaniem stopy procentowe są na odpowiednim poziomie.", "link": "https://businessinsider.com.pl/finanse/makroekonomia/miekkie-ladowanie-bliski-wspolpracownik-premiera-przedstawia-scenariusz-dla-polskiej/xgnkbmk", "date_published": "2022-12-29 08:30:43+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Powiew optymizmu. Ten wskaźnik poprawił się po raz pierwszy od półtora roku", "description": "Wskaźnik Wyprzedzający Koniunktury (WWK), informujący z wyprzedzeniem o przyszłych tendencjach w gospodarce, w grudniu 2022 r. po raz pierwszy od czerwca 2021 r. wzrósł znacząco, czyli o 2,9 punktu, i wyniósł 154,3 pkt. Najbliższe miesiące pokażą, czy to będzie bardziej trwały odwrót od spadkowego trendu i najgorsze już minęło.", "link": "https://businessinsider.com.pl/finanse/makroekonomia/powiew-optymizmu-ten-wskaznik-poprawil-sie-po-raz-pierwszy-od-poltora-roku/7h03sn5", "date_published": "2022-12-29 08:14:09+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kurs euro 29 grudnia poniżej 4,7", "description": "Kurs euro poniżej 4,7. W czwartek rano 29 grudnia 2022 r. kurs EUR/PLN wynosił 4,6934 zł.", "link": "https://businessinsider.com.pl/gielda/kursy-walut/kurs-euro-eurpln-notowania-walut-29-grudnia-2022/qx5ew5l", "date_published": "2022-12-29 08:09:08+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kurs dolara 29 grudnia powyżej 4,4", "description": "Kurs dolara powyżej 4,4. W czwartek rano 29 grudnia 2022 r. kurs USD/PLN wynosi 4,4175.", "link": "https://businessinsider.com.pl/gielda/kursy-walut/kurs-dolara-usdpln-notowania-walut-29-grudnia-2022/y1jv7ng", "date_published": "2022-12-29 08:07:23+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kurs franka 28 grudnia powyżej 4,75", "description": "Frank szwajcarski powyżej 4,75 zł. W czwartek rano 29 grudnia 2022 r. kurs tej waluty wobec polskiego złotego wynosi 4,7641.", "link": "https://businessinsider.com.pl/gielda/kursy-walut/kurs-franka-frank-szwajcarski-chfpln-28-grudnia-2022/0jfflnm", "date_published": "2022-12-29 08:05:07+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kurs franka 29 grudnia powyżej 4,75", "description": "Frank szwajcarski powyżej 4,75 zł. W czwartek rano 29 grudnia 2022 r. kurs tej waluty wobec polskiego złotego wynosi 4,7641.", "link": "https://businessinsider.com.pl/gielda/kursy-walut/kurs-franka-frank-szwajcarski-chfpln-29-grudnia-2022/0jfflnm", "date_published": "2022-12-29 08:05:07+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Mapa budowy dróg w Polsce. Oto plany drogowców na 2023 r.", "description": "Ułatwiony wjazd do Warszawy od południa czy domknięcie obwodnicy Łodzi — to część planów Generalnej Dyrekcji Dróg Krajowych i Autostrad na 2023 r. Pęknąć ma bariera 5000 km dróg szybkiego ruchu w Polsce.", "link": "https://businessinsider.com.pl/technologie/motoryzacja/mapa-budowy-drog-w-polsce-oto-plany-drogowcow-na-2023-r/0m9qtmm", "date_published": "2022-12-29 07:50:38+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Minister Moskwa: na ograniczenie cen energii wydamy w dwa lata ponad 100 mld zł", "description": "Ponad 100 mld zł — tyle wydamy na ograniczenie podwyżek cen energii, tak gazu jak i prądu — przekazała minister klimatu i środowiska Anna Moskwa. Dodała, że dzięki działaniom rządu rachunki za prąd będą przynajmniej o kilkaset złotych niższe, niż mogłyby być.", "link": "https://businessinsider.com.pl/finanse/minister-moskwa-na-ograniczenie-cen-energii-wydamy-w-dwa-lata-ponad-100-mld-zl/hvf541d", "date_published": "2022-12-29 07:43:30+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Zmiany na mapie Polski. 15 nowych miast od 2023 r.", "description": "Piętnastu miejscowościom zostanie nadany status miasta w 2023 r. Łącznie na mapie Polski będzie 979 miast.", "link": "https://businessinsider.com.pl/wiadomosci/zmiany-na-mapie-polski-15-nowych-miast-od-2023-r/3j6hyym", "date_published": "2022-12-29 07:10:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Inflacja i sezon grzewczy dobiją psychicznie Polaków", "description": "W wyniku wysokiej inflacji już ponad 50 proc. Polaków skarży się na pogorszenie zdrowia psychicznego. Z miesiąca na miesiąc jest coraz gorzej — donosi czwartkowa Rzeczpospolita.", "link": "https://businessinsider.com.pl/wiadomosci/inflacja-i-sezon-grzewczy-dobija-psychicznie-polakow/4zpsbe2", "date_published": "2022-12-29 07:08:40+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Ubezpieczenie domu i mieszkania — kto powinien je mieć?", "description": "Każdy właściciel nieruchomości — niezależnie od tego, czy jest to mieszkanie w przedwojennej kamienicy, czy też nowoczesny dom jednorodzinny — powinien rozważyć zakup ubezpieczenia. To rozwiązanie pozwala uchronić się przed wydatkami spowodowanymi na przykład pożarem, podtopieniem lub włamaniem. Jaką ofertę warto wybrać? Czy ubezpieczenie domu jest obowiązkowe w każdej sytuacji?", "link": "https://businessinsider.com.pl/poradnik-finansowy/ubezpieczenia/czu-ubezpieczenie-domu-jest-obowiazkowe-jak-dopelnic-formalnosci-z-nim-zwiazane/kr8nq91", "date_published": "2022-12-29 06:45:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Blocher: w 2023 r. inflacja będzie dalej zubożała nasze społeczeństwo", "description": "W przyszłym roku spodziewam się stabilizacji inflacji na wysokim dwucyfrowym poziomie, co w dalszym ciągu będzie zubożało nasze społeczeństwo — pisze w felietonie dla Business Insider Polska Dariusz Blocher, dyrektor Grupy Ferrowial i członek Rady Nadzorczej firmy Budimex. Podkreśla również, że do odbudowy Ukrainy trzeba podejść biznesowo i już dziś należy stworzyć jednostkę centralną, koordynującą działania po stronie polskiej.", "link": "https://businessinsider.com.pl/gospodarka/blocher-w-2023-r-inflacja-bedzie-dalej-zubozala-nasze-spoleczenstwo/73b8k28", "date_published": "2022-12-29 06:31:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Kolejne ćwierć miliarda złotych na Izerę. Jeszcze poczekamy na produkcję polskiego elektryka", "description": "Pierwsze przedprodukcyjne prototypy polskiego samochodu elektrycznego poznaliśmy w lipcu 2020 r. Kończy się 2022 r., a do rozpoczęcia produkcji Izery jeszcze daleko. Na razie spółka ElectroMobility Poland dostała kolejne 250 mln zł na przetrwanie — pisze wnp.pl.", "link": "https://businessinsider.com.pl/technologie/motoryzacja/izera-dostala-kolejne-250-mln-zl-pieniadze-na-przetrwanie/4pr3zml", "date_published": "2022-12-29 06:30:08+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Ubezpieczenie na studiach – komu przysługuje? Jak wyglądają formalności?", "description": "Ubezpieczenie zdrowotne to bardzo ważna kwestia formalna, która jest nieocenioną pomocą w razie nieszczęśliwych wypadków lub podczas leczenia w ramach NFZ. Osoby zatrudnione na umowie o pracę mają zapewnioną tę ochronę dzięki odprowadzanym składkom. W przypadku studentów poniżej 26. roku życia wygląda to nieco inaczej – osoba ucząca się ma wówczas kilka możliwości. Jak zapewnić sobie ubezpieczenie na studiach? Jakich formalności należy dopełnić i jak wysokie są składki?", "link": "https://businessinsider.com.pl/poradnik-finansowy/ubezpieczenia/komu-przysluguje-ubezpieczenie-na-studiach-co-trzeba-wiedziec/ee14wxx", "date_published": "2022-12-29 06:30:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Trzy lata po pierwszym pojawieniu się COVID-19 znów staje się problemem", "description": "Niestety wracają problemy związane z COVID-19. Wszyscy przylatujący samolotami z Chin będą musieli w USA pokazać ważny, negatywny test na covid, a we Włoszech zrobić taki test po wylądowaniu. Włosi apelują też, aby podobne rozwiązania przyjęła cała Unia Europejska. Rząd ma pomysł na stawianie większej liczby paneli fotowoltaicznych na dachach bloków mieszkalnych. Deficyt sektora finansów publicznych ma być w tym roku mniejszy od przewidywań, a w USA wciąż tracą na wartości spółki technologiczne. Tym razem spadkom przewodziła nie Tesla, tylko Apple. Oto pięć najciekawszych wydarzeń w gospodarce teraz.", "link": "https://businessinsider.com.pl/gospodarka/piec-najciekawszych-wydarzen-w-gospodarce-teraz-29122022/w257l8g", "date_published": "2022-12-29 06:25:38+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Tak będą wyglądać ceny mieszkań na początku 2023 r.", "description": "W najbliższych miesiącach ceny mieszkań powinny utrzymać się na obecnym poziomie — przewidują eksperci. Wskazują, że rynek jest w stanie wyczekiwania na ożywienie w kredytach hipotecznych.", "link": "https://businessinsider.com.pl/gospodarka/tak-beda-wygladac-ceny-mieszkan-na-poczatku-2023-r/q2qsfx9", "date_published": "2022-12-29 06:08:55+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Recep Erdogan zniósł wiek emerytalny w Turcji", "description": "Prezydent Turcji Tayyip Erdogan zniósł w środę wymóg wieku emerytalnego. Dzięki tej decyzji dwa miliony pracowników możeprzejść na natychmiastową emeryturę. Wszystko dzieje się na mniej niż sześć miesięcy przed wyborami — informuje Reuters.", "link": "https://businessinsider.com.pl/twoje-pieniadze/emerytury/recep-erdogan-zniosl-wiek-emerytalny-w-turcji/sgfy1nl", "date_published": "2022-12-29 05:36:56+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Jakie zmiany w prawie pracy w 2023 r. Nie tylko dłuższe urlopy", "description": "Praca z domu, w tym okazjonalna, nowe rodzaje urlopów i zmodyfikowane zatrudnienie na okres próbny — to tylko przykładowe zmiany w prawie pracy, jakie mają wejść w życie w 2023 r. Zatrudnieni zyskają lepszą ochronę przed zwolnieniem, a firmy — jednoznaczne prawo do weryfikowania trzeźwości pracowników.", "link": "https://businessinsider.com.pl/prawo/praca/co-zmieni-sie-w-kodeksie-pracy-w-2023-r-nie-tylko-dluzsze-urlopy/1508v1b", "date_published": "2022-12-29 05:27:16+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Szef PFR: uruchomienie KPO dla Polski bardzo opłacalne", "description": "Uruchomienie KPO o wartości 165 mld zł jest dla Polski bardzo opłacalne — przekonuje prezes Polskiego Funduszu Rozwoju (PFR) Paweł Borys. Podkreśla, że KPO to m.in. szybszy rozwój kraju poprzez inwestycje.", "link": "https://businessinsider.com.pl/finanse/szef-pfr-uruchomienie-kpo-dla-polski-bardzo-oplacalne/emdf3b7", "date_published": "2022-12-29 05:23:35+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "O tych inwestycjach mówiła cała Polska. Siedem najgłośniejszych projektów w 2022 r.", "description": "Jakie inwestycje przyniósł mijający rok? To przede wszystkim domykanie i inicjowanie kolejnych wielkich państwowych projektów. Wydanie w Polsce miliardów zapowiadał nie tylko rząd, lecz także znane na całym świecie globalne firmy. Oto siedem najgłośniejszych inwestycji 2022 r. Te dopiero zapowiedziane, jak i zmierzające do ukończenia.", "link": "https://businessinsider.com.pl/firmy/o-tych-inwestycjach-mowila-cala-polska-7-najglosniejszych-projektow-w-2022-r/r0mye1l", "date_published": "2022-12-29 05:01:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "title": "Zdolność kredytowa Polaków przestaje szorować po dnie. Prawie 40 tys. zł w niecałe dwa miesiące", "description": "Zdolność kredytowa Polaków przestała znikać. Wręcz odwrotnie. Planujący wzięcie kredytu w banku mogą dziś liczyć na wyższą kwotę niż jeszcze na początku listopada. W zależności od dochodów różnice mogą sięgać nawet 40 tys. zł.", "link": "https://businessinsider.com.pl/gospodarka/zdolnosc-kredytowa-polakow-odbija-sie-od-dna-prawie-40-tys-zl-w-niecale-dwa-miesiace/gvt4r83", "date_published": "2022-12-29 04:58:00+00:00", "persistent": false, "user": null, "language": "en-US"}]