[{"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Nie żyje projektantka mody Vivienne Westwood", "description": "Zmarła projektantka mody Vivienne Westwood. W oświadczeniu na Twitterze jej dom mody przekazał, że zmarła spokojnie i otoczona rodziną w Clapham w południowym Londynie.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-29/nie-zyje-projektantka-mody-vivienne-westwood/", "date_published": "2022-12-29 21:24:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Australia: Troje dzieci spędziło ponad dwie doby w aucie po tym jak ich rodzice zginęli w wypadku", "description": "Rodzice i troje dzieci jechali na święta do rodziny. 10 kilometrów przed celem podróży doszło do wypadku. Dorośli zginęli na miejscu, a 5-letnia dziewczynka i jej młodsi bracia byli uwięzieni w aucie przez 55 godzin.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-29/australia-troje-dzieci-spedzilo-ponad-dwie-doby-w-aucie-po-tym-jak-ich-rodzice-zgineli-w-wypadku/", "date_published": "2022-12-29 21:07:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Meksyk. W bagażniku samochodu znaleziono małego tygrysa. W aucie była również broń i amunicja", "description": "W bagażniku samochodu zatrzymanego za drobne wykroczenie drogowe znajdował się młody tygrys. W aucie odkryto także broń i amunicję - przekazały media. Kierujący samochodem mężczyzna i pasażerka zostali zatrzymani.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-29/meksyk-w-bagazniku-samochodu-znaleziono-malego-tygrysa-w-aucie-byla-rowniez-bron-i-amunicja/", "date_published": "2022-12-29 20:29:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "USA. Śledztwo ws. George'a Santosa. Kongresmen-elekt kłamał na temat swojego pochodzenia", "description": "Takiego skandalu amerykański Kongres chyba jeszcze nie widział. Już dwie prokuratury wszczęły śledztwo w sprawie republikańskiego kongresmana-elekta, który, jak się okazuje, zmyślił swoje pochodzenie, wykształcenie, a nawet doświadczenie zawodowe. Wszystko wskazuje jednak, że 3 stycznia i tak zostanie zaprzysiężony.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-29/usa-sledztwo-ws-georgea-santosa-kongresmen-elekt-klamal-na-temat-swojego-pochodzenia/", "date_published": "2022-12-29 19:45:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Niemcy: Mężczyzna zasnął za kierownicą Tesli. Przed nim jechała policja", "description": "Mężczyzna jadący autostradą w Niemczech zasnął za kierownicą autonomicznego samochodu elektrycznego. Policjanci przez kwadrans próbowali obudzić go za pomocą sygnałów dźwiękowych.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-29/niemcy-mezczyzna-zasnal-za-kierownica-tesli-przed-nim-jechala-policja/", "date_published": "2022-12-29 19:33:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Legendarny piłkarz Pele nie żyje. Miał 82 lata", "description": "W wieku 82 lat zmarł legendarny brazylijski piłkarz Pele -poinformowała w czwartek w mediach społecznościowych córka sportowca. Pele zmarł po długiej chorobie.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-29/legendarny-pilkarz-pele-nie-zyje-mial-82-lata/", "date_published": "2022-12-29 19:00:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Meksyk: W stolicy śnieg spadł po raz pierwszy od 55 lat", "description": "Taką zimę pamiętają tylko najstarsi Meksykanie. W stolicy Meksyku śnieg spadł pierwszy raz od 55 lat. Władze wydały pomarańczowe i żółte alerty pogodowe, ostrzegające przed temperaturami od -5°C do -15°C stopni Celsjusza.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-29/meksyk-w-stolicy-snieg-spadl-po-raz-pierwszy-od-55-lat/", "date_published": "2022-12-29 15:37:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Wojna w Ukrainie. Na terytorium Białorusi miała spaść ukraińska rakieta", "description": "Ukraińska rakieta S-300 spadła na pole na terytorium Białorusi - twierdzi białoruska agencja BelTA. W czwartek Rosja przeprowadziła zmasowany ataku na Ukrainę z użyciem ponad 100 rakiet kierowanych. Odpierała je obrona przeciwlotnicza. Białoruskie media sugerują, że mogło dojść do powtórki z Przewodowa w woj. lubelskim, gdzie podobna rakieta uderzyła w gospodarstwo rolne, zabijając dwóch mężczyzn.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-29/wojna-w-ukrainie-na-terytorium-bialorusi-miala-spasc-ukrainska-rakieta/", "date_published": "2022-12-29 12:15:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Watykan. Media: Benedykt XVI w stanie ciężkim, ale stabilnym", "description": "Stan 95-letniego emerytowanego papieża Benedykta XVI jest ciężki, ale stabilny - informuje w czwartek włoska agencja ANSA, powołując się na swoje źródła w Watykanie. Wyjaśniono, że stan zdrowia byłego Ojca Świętego nie zmienił się w ciągu doby. W środę papież Franciszek zaapelował w czasie audiencji generalnej o modlitwę za swojego poprzednika. Jest bardzo chory - mówił.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-29/watykan-media-benedykt-xvi-w-stanie-ciezkim-ale-stabilnym/", "date_published": "2022-12-29 10:52:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Watykan. Benedykt XVI chce być pochowany w tym samym miejscu, co Jan Paweł II", "description": "Korespondentka Polsat News w Rzymie Urszula Rzepczak przekazała, że Benedykt XVI chce być pochowany w Grotach Watykańskich w miejscu, w którym wcześniej znajdowała się trumna z ciałem papieża Polaka św. Jana Pawła II. 95-letni papież-senior kilka dni temu poczuł się gorzej. Ojciec święty Franciszek wezwał w środę do modlitwy, a nieoficjalnie miał udzielić poprzednikowi ostatniego namaszczenia.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-29/watykan-benedykt-xvi-chce-byc-pochowany-w-miejscu-gdzie-wczesniej-spoczywal-papiez-polak/", "date_published": "2022-12-29 09:08:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Ukraina: Zmasowany atak rakietowy Rosjan. Wybuchy w Kijowie, Lwowie i Odessie", "description": "Ukraińskie siły obrony powietrznej zneutralizują dzisiaj najwięcej rosyjskich pocisków od początku wojny - ocenił w czwartek rano na Telegramie szef władz obwodu mikołajowskiego Witalij Kim. W kraju trwa zmasowany atak rakietowy wroga. Pojawiają się kolejne doniesienia o skutecznych działaniach sił obrony przeciwlotniczej i przeciwrakietowej.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-29/ukraina-zmasowany-atak-rakietowy-rosjan-wybuchy-w-kijowie-lwowie-i-odessie/", "date_published": "2022-12-29 07:46:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Prezydent Andrzej Duda na plakatach w Irpieniu. Ukraińcy dziękują za wsparcie", "description": "Ukraińcy dziękują światowym przywódcom za wsparcie. W Irpieniu pod Kijowem pojawiły się billboardy z wizerunkami m.in. prezydentów Polski Andrzeja Dudy i Stanów Zjednoczonych Joe Bidena. Dziękujemy za wsparcie - brzmi hasło.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-29/wojna-w-ukrainie-prezydent-andrzej-duda-na-plakatach-w-irpieniu-ukraincy-dziekuja-za-wsparcie/", "date_published": "2022-12-29 07:45:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Wojna w Ukrainie. Ławrow: Z nikim nie będziemy rozmawiać na warunkach formuły pokojowej Zełenskiego", "description": "- Rosja z nikim nie zamierza rozmawiać w oparciu o formułę pokoju zaproponowaną przez Wołodymyra Zełenskiego - powiedział szef rosyjskiej dyplomacji Siergiej Ławrow w wywiadzie dla rosyjskiej agencji RIA Nowosti. Jest oczywiste, że Kijów nie jest gotowy do dialogu - stwierdził rosyjski minister spraw zagranicznych. Wcześniej dla TASS powiedział, że USA nie zaangażują się bezpośrednio w wojnę.", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-29/wojna-w-ukrainie-lawrow-z-nikim-nie-bedziemy-rozmawiac-na-warunkach-formuly-pokojowej-zelenskiego/", "date_published": "2022-12-29 07:07:00+00:00", "persistent": false, "user": null, "language": "pl-PL"}]