[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Assassin’s Creed: 10 Things You Never Knew", "description": "Since 2007, history has been our playground thanks to Assassin’s Creed, and the games are packed full of secrets. To celebrate the announcement of Assassin’s Creed Mirage, which looks to return to the design of the first Assassin's Creed; as well as a plethora of new entries including Assassin's Creed Jade, Assassin's Creed Red, and Assassin's Creed Hexe. \n\nHere are 10 things you didn’t know about the original Assassin’s Creed.\n\n#gaming #assassinscreed #gamespot #ubisoft \n\nStu here to break down the secrets and real life histories behind the first Assassin's Creed. Assassin’s Creed defined what the open world genre would look like for Ubisoft during the last 3 console generations. The series itself has gone through award winning highs, lows that have made it a divisive series throughout the gaming industry, and a reinvention that flipped the formula in a fascinating way. It’s been enthralling to go back to 2007 and see where the series has come from, along with the thought and principle that went into its world and story. With the new entry in the series, Assassin’s Creed Mirage, newly announced; an emphasis on a “back to basics” mentality from Ubisoft will be interesting to see how they execute it within the framework of how different Assassin’s Creed looks and feels today from its inception.\n\nFor More Assassin's Creed, check out Jordan Ramée's chat with Assassin's Creed Mirage art director, Jean-Luc Sala.\nhttps://www.gamespot.com/articles/assassins-creed-mirage-sounds-like-a-fantastic-return-to-the-roots-of-the-series/1100-6507322/\n\nSTAMPS:\n00:00 Intro\n00:23 Half Horse, Half Man, Half Terrifying\n00:57 Assassins Roll Out!\n01:11 The Sacred Texts!\n01:38 Assassins Couch Co-Op\n02:16 Side Missions, Schmide Missions\n03:20 The Animus\n04:00 Multilingual\n04:34 Historical Fiction\n05:47 On Eagle's Wings\n06:32 Prince of Persia: Assassin\n07:46 Outro", "link": "https://www.youtube.com/watch?v=zSpEi36vF_I", "date_published": "2022-09-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Forspoken Hands-On Preview: Spider-Man's Movement And Combat With Magic", "description": "Forspoken has fun traversal and combat, but it isn't reinventing the open-world wheel.\n#gaming #Forspoken #gamespot #SquareEnix #JRPG \n\nIf you imagine Spider-Man, Marvel's super-agile superhero, slinging a variety of deadly magic spells rather than webs, you have a good idea of what it's like to play Forspoken. Square Enix's upcoming open-world action game puts equal emphasis on quick movement and bombarding your opponents with all manner of magic in an experience that's all about fast thinking, smart movement, and overwhelming force.\n \nSquare Enix recently gave GameSpot a chance to play about an hour of Forspoken in a curated demo. We didn't play the actual game, but rather, a specifically crafted slice that demonstrated how Forspoken will feel and gave a sense of how its open world will work. In some ways, what we saw of Forspoken felt familiar for anyone who's played a lot of open-world games--there are a lot of locations to unlock, small challenges to complete, and items to collect to upgrade protagonist Frey's powers.\n\nWhere Forspoken stands apart is in its traversal and combat, once you get the hang of both. It's a fast and frenetic game, giving you a whole host of abilities to use against enemies. While you'll have to think about how to best use all the magic weapons at your disposal, the fun of Forspoken is in the speed--it relies less on methodical planning and more on hitting opponents with everything you've got. \n\nThe demo we played took place in a series of vast fields, craggy valleys, and swampy lowlands. Most of the time, you'll get around with Forspoken's magical parkour system, which has been a big highlight in trailers and gameplay videos so far. Holding down a single face button on your controller activates the ability, which causes Frey to bound forward and to automatically climb up or spring off any obstacles that get in her way. You can't parkour forever, though--Frey has a limited amount of stamina that has to be recharged after a while.\n\nTo get the most out of the traversal system, you want to plan your moves through the world to actually hit obstacles and use them to your advantage. For instance, just bounding across an open field will let you move fast for a short period, but you'll get farther if you cut through a stand of trees, because Frey will kick off them as she passes to get extra speed and distance. You'll also want to combine the parkour system with Frey's ability to grab onto ledges or special rocks with a sort of magical rope, which allows her to zip forward or upward like Spidey making his way up a building or across rooftops.\n\nGetting around in Forspoken feels pretty good, and the game keeps things simple so that you don't have to do much more than hold down a button and steer for Frey to navigate terrain. But even the demo we saw had a pretty huge open world, with a lot of space between points of interest. A fast-travel system you unlock by visiting key locations helps make moving around quicker and easier. It seems that while parkouring around the map will be a main focus of the experience, the parkour mechanics are better for shorter trips around objects--at least until you unlock more capabilities as you explore and Frey levels up. I found myself running out of steam as I tried to cross large areas, and it took me a while to get a good sense of how to utilize the system to make getting around fun instead of arduous.", "link": "https://www.youtube.com/watch?v=RNI6NohOZUE", "date_published": "2022-09-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Logitech About To Reveal Its Steam Deck Competitor | GameSpot News", "description": "Logitech is getting into the gaming handheld business, a Nintendo Direct is incoming, confusion over Assassin's Creed Mirage's rating, and download the Call of Duty Modern Warfare 2 beta early.\n#Gaming #CallOfDuty #AssassinsCreed #SteamDeck #NintendoDirect \n\nLogitech is unveiling a new gaming handheld, a September Nintendo Direct is happening, and confusion over the new Assassin’s Creed. All this and more on today’s GameSpot News.\n\nLogitech is unveiling its own gaming device on September 21. In the wake of Valve’s successful handheld, Steam Deck, the PC peripheral manufacturer is attempting its own portable gaming console, although it will be significantly different compared to what is available on the market already.\n\nThe product, which Logitech is partnering with gaming giant Tencent on, will have a focus on streaming games. The company revealed that it is working with Microsoft and Nvidia to make sure that their services, Xbox Cloud Gaming and GeForce Now respectively, work smoothly on the device.\n\nIt seems, however, that the device won’t solely be for streaming games. Images of the device that leaked in August showed a ‘Google Play’ front and center on the console’s homescreen, which if indicative of the final OS that will ship with the device, suggests that the hardware’s processor will be beefy enough to run native Android games as well.\n\nA tease for the September 21 event suggests that the device will have a yellow button adorned with the Logitech logo, identical to the one in the leaks, possibly confirming the validity of those images. \n\nFrom one handheld to another, a Nintendo Direct is happening tomorrow, September 13, the company not breaking its streak of having a September Direct every year since 2016. It will include \"roughly 40 minutes\" of new information, focusing on games coming to Nintendo Switch this winter. \n\nMultiple games are rumored to be part of the presentation, including two ports of The Legend of Zelda--Wind Waker HD and Twilight Princess HD--as well as a remaster of the original Metroid Prime. Pokemon Scarlet and Violet, which are scheduled to release on November 18, should feature during the event as well. Other than Metroid Prime 4 and the Breath of the Wild sequel, Nintendo’s first party slate of officially announced games after Scarlet and Violet is completely unknown.\n\nHere’s hoping for Mario Kart 9! Just kidding. They’re going to sell Mario Kart 8 forever. Why do you think it’s logo is infinity?\n\nAnother showcase of games that happened over the weekend was Ubisoft Forward, which included a presentation on Assassin’s Creed celebrating its 15th anniversary. A smaller, AC1 inspired title called Mirage will release early next year, set in Baghdad and featuring a young Basim, a side character in 2020’s Assassin’s Creed Valhalla. \n\nTwo additional games for console and PC, similar in scope to the recent, larger entries, were also announced; Project Red will allow players to finally climb around feudal Japan as a shinobi, and the spooky Project Hexe which is rumored to be set during the Holy Roman Empire and focus on the witch trials of that period. Red and Hexe will kick of Ubisoft’s hub for Assassin’s Creed, Infinity, which Ubisoft has confirmed will feature multiplayer elements in the future.", "link": "https://www.youtube.com/watch?v=Y8O3_IMkNcw", "date_published": "2022-09-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sword Master Reacts to MORE Chivalry 2 Weapons", "description": "David Rawlings, a Sword Master and founder of the London Longsword Academy, breaks down some more of the weapons from Chivalry 2, including the Messer, the Mace, the Rapier, and the Halberd.\n\nExpert Reacts Playlist: https://youtube.com/playlist?list=PLp...\n\nIf you are interested in training with David and team and learn how to swordfight, check out www.londonlongsword.com or send an email to enquiry@londonlongsword.com\n \nIf you would like to see more videos of David Rawlings and the London Longsword Academy (LLA) check out their YouTube channel: https://www.youtube.com/user/LondonLo...\n \nIf you like swords and martial arts content, follow the LLA on Instagram  Master_at_Arms and Swordfightress or Facebook London Longsword Academy.\n\nWeapons Featured:\n\n00:00 - Intro\n00:43 - Messer\n02:59 - Mace\n04:55 - Axe\n06:37 - Targeting the legs\n07:37 - Rapier\n09:09 - Fighting with a recorder\n09:42 - Halberd\n12:48 - Ending", "link": "https://www.youtube.com/watch?v=hLr5Nqx_Sdg", "date_published": "2022-09-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]