[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "BMJ gets fact checked", "description": "1984, APPENDIX. The Principles of Newspeak\n\nhttps://www.planetebook.com/free-ebooks/1984.pdf\n\nIt was expected that Newspeak would have finally supersed Oldspeak \n\n(or Standard English, as we should call it) \n\nby about the year 2050. \n\nThe purpose of Newspeak was not only to provide a medium of expression for the world-view and mental habits, proper to the devotees of Ingsoc \n\nbut to make all other modes of thought impossible. \n\nBMJ, past record\n\nHistory of a news blog\n\nhttps://www.bmj.com/about-bmj/history-of-the-bmj\n\nFacebook versus the BMJ: when fact checking goes wrong\n\nhttps://www.bmj.com/content/376/bmj.o95\n\nFacebook and the gatekeepers of international fact checking\n\nRelating to Covid-19: Researcher blows the whistle on data integrity issues in Pfizer’s vaccine trial\n\nhttps://www.bmj.com/content/375/bmj.n2635?ijkey=cf293206374e43f3ec06e0046635025977bf86ac&keytype2=tf_ipsecsha\n\nSecond highest “Altmetric” score of all time across all biomedical publications\n\nHoward Kaplan, retired dentist posted a link, private Facebook group\n\nThe investigation reported poor clinical trial research practices occurring at Ventavia, a contract research company helping to carry out the main Pfizer covid-19 vaccine trial \n\n“The Facebook Thought Police has issued me a dire warning,”\n\n“Facebook’s ‘independent fact-checker’ doesn’t like the wording of the article by the BMJ. \n\nAnd if I don’t delete my post, they are threatening to make my posts less visible.\n\n Obviously, I will not delete my post . . . If it seems like I’ve disappeared for a while, you’ll know why.” \n\nOver the past two months the journal’s editorial staff have been navigating the opaque appeals process without success, and still today their investigation remains obscured on Facebook.\n\nThe experience has highlighted serious concerns about the “fact checking” \n\nthird party providers on behalf of Facebook, \n\nthe resulting censorship of information.\nOther FB users\n\nunable to share\n\n“Missing context . . . Independent fact-checkers say this information could mislead people.” \n\nReaders were directed to a “fact check” performed by Lead Stories\n\n“debunking fake news as it happens.”\n\nA Pfizer spokesperson said that the company’s investigation “did not identify any issues or concerns that would invalidate the data or jeopardize the integrity of the study.” \n\nNo errors found\n\nthe Lead Stories article not identifying anything false or inaccurate. \n\nLead Stories did not mention that the investigation was externally peer reviewed, \n\nAt the time of going to press Ventavia had not responded to The BMJ’s repeated requests for information.\n\nPfizer told The BMJ, actions were taken to correct and remediate where necessary.” \n\nFDA stated that it was unable to answer The BMJ’s questions, “as it is an ongoing matter.”\n\nWider problem\n\nInstagram, like Facebook, is owned by the parent company Meta.\n\nA Cochrane spokesperson said that in October its Instagram account was “shadowbanned” for two weeks\n\n“when other users tried to tag Cochrane, a message popped up saying @cochraneorg had posted material that goes against ‘false content’ guidelines”\n\nJillian York, director for international freedom of expression, Electronic Frontier Foundation\n\nI worry about the amount of power placed in the hands of these third party groups,\n\nThere’s no accountability structure. \n\nThere’s no democratic process to this. \n\nFacebook and some traditional media are reasonably concerned about vaccine misinformation\n\nbut have swung so far in the opposite direction as to potentially shut down legitimate questions about major corporations like Pfizer\n\nhttps://twitter.com/LeadStoriesCom/status/1472929863040438287\n\nhttps://twitter.com/LeadStoriesCom/status/1472929863040438287\n\n(Paul Thacker, the author of The BMJ’s investigation)\n\nKamran Abbasi, The BMJ’s editor in chief\n\n“We should all be very worried that Facebook, a multibillion dollar company, is effectively censoring fully fact checked journalism that is raising legitimate concerns about the conduct of clinical trials.\n\nwhy is Facebook acting in this way? \n\nWhat is driving its world view? \n\nIs it ideology? \n\nIs it commercial interests? \n\nIs it incompetence? \n\nUsers should be worried that, despite presenting itself as a neutral social media platform, Facebook is trying to control how people think under the guise of ‘fact checking.’”", "link": "https://www.youtube.com/watch?v=lMf-Zq7xJcY", "date_published": "2022-02-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "European normalisation", "description": "World Health Organization in Europe \n\nhttps://www.washingtonpost.com/world/2022/02/03/who-europe-coronavirus-ceasefire/?utm_campaign=wp_to_your_health&utm    \n\nHans Kluge, WHO regional director Europe\n\nSoon enter a cease-fire long period of tranquillity\n\nplausible endgame \n\nplausible hope for stabilization and normalization\n\nThis period of higher protection should be seen as a cease-fire that could bring us enduring peace\n\nEuropean, 12 million cases week\n\nHospitalizations up\n\nICU, not increased significantly\n\neven with a more virulent variant than omicron potentially on the horizon, \n\nthe continent was still in a better position and probably could avoid reinstalling the kind of disruptive measures we needed before\n\nDenmark \n\nNo longer a socially critical disease\n\nItaly, Sweden, Switzerland, France, moving to phase out social restrictions\n\nTedros Adhanom Ghebreyesus \n\nthe emergency phase of the pandemic could end this year if 70%\n\nof the population of every country is vaccinated and vaccines are more equitably distributed\n\nIt is dangerous to assume that omicron will be the last variant, or that we are in the endgame\n\nRussia\n\nhttps://www.washingtonpost.com/world/2022/02/04/russia-omicron-surge/?utm_campaign=wp_to_your_health&utm\n\nMoscow, record high cases, + 168,000\n\n(relatively low testing)\n\nOmicron dominant\n\n(18,000 hospitalized)\n\nSignificant pressure already\n\nElective work often postponed\n\nLow vaccination rates\n\nPutin ruled out a lockdown\n\nLife goes on despite the difficult situation\n\nViktor Zakharov, Intelligent Logistics Center St. Petersburg University\n\nPeak + 200,000 22nd February\n\n4 million people simultaneously ill\n\nRussia’s state coronavirus task force\n\nHas reported 333,357 deaths\n\nState statistics agency Rosstat\n\n681,100 deaths\n\nMoscow Times \n \nhttps://www.themoscowtimes.com/2022/01/28/russias-pandemic-excess-death-toll-almost-1m-a76194\n\nNearly a million excess deaths by the end of 2021\n\nCardiologist in Transylvania\n\nI agree with Daniela about the politics and healthcare infrastructure. \n\nNo new hospital since the fall of Communism.\n\nPeople are listening to medical recommendations\n\nThe death rate is higher because of lack of competence of doctors in part because the health system is state owned and corrupted. \n\nFor example, almost no one is employed without knowing someone in the system or without being in a political party or paying a lot of money (bribes). \n\nBut also because people here don't go to the doctor early and they don't prevent disease.\n\nCovid admissions, a sizeable proportion didn't even knew they had high blood pressure or diabetes. \n\nAnd known cases, disease was not optimally controlled\n\nSadly I've seen a lot of people die with COVID\n\nIf it wasn't for this disease these people would have lived longer. \n\nThe political system is indeed highly corrupted and that's why also the police is doing a very poor job. \n\nAlso the judicial system is not up to standard.\n\nI would also emigrate in the near future. \n\nAs for returning, what's the point when you, as a doctor, cannot find a job in the public healthcare system because you're not politically involved\n\nSteve Cosslett\n\n\"Studies in Applied Economics\" is a working paper (preprint) series \n\nStates with more cases, and so potentially more deaths, will tend to have more restrictive lockdowns.\n\nThe paper doesn't address the real question: would there have been even more deaths without the lockdowns?\n\nBarry (US)\n\nI am afraid that I have a rather jaundiced view of economics being described as a science, \n\nyou only have to look at how the Fed has handled the economy since 2008!  We are about to pay for that economic science!", "link": "https://www.youtube.com/watch?v=t2vdPJtDDdE", "date_published": "2022-02-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Romanian perspectives", "description": "A discussion with Daniela on the pandemic in Romania and other interesting sociocultural factors.", "link": "https://www.youtube.com/watch?v=dkWBn8cCmJI", "date_published": "2022-02-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]