[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCaJ_go3GJftsbQ1VDl12oHQ", "title": "Jordan Peterson's FASCINATING Analysis On The Selfconscious Conditions (Which one are you?)", "description": "If things go from bad to worse long enough... Everything falls.\n\nBe wise, and listen. \n\n\n#JordanPeterson\n#PursuitofMeaning\n\n\nThis is his best book, in my opinion: https://geni.us/DrJP\nHINT: You can get for FREE the audio version narrated by Dr. Peterson himself if you sign up for an Audible Trial.\n\n\nWe create to inspire, hopefully, worldwide.\n\nIf you're into a motivational speech or a motivational video from Dr. Jordan Peterson, you can stop here.\n\nHere, at the \"Pursuit of Meaning\" channel, we transform the original content from shows, podcasts, and key-notes with Dr. Jordan Peterson, to provide the viewers with a more immersive experience. \n\nWe amplify the content's original message by making it more cinematic and easier to understand by the end consumer. \n\nIf you are the legal content owner of any videos we posted on the channel and would like to remove them, please e-mail us at hello@succesonline.ro.\n\n✅ Fair Use Disclaimer\n1. The videos have no negative impact on the original works.\n2. The videos we make are used for teaching purposes.\n3. The videos are transformative in nature.\n4. We use only the audio component and tiny pieces of video footage, only if it's necessary.\n\n☢️ We hold license for using both video footage and songs.\n\n📧 Hello@succesonline.ro\n\n- Jordan Peterson Motivation\n- Jordan Peterson Responsibility\n- Jordan Peterson Meaning\n- Jordan Peterson Religion\n- Jordan Peterson God\n- Jordan Peterson Cain Able\n- Jordan Peterson Speech\n- Success Chasers\n- Wisdom Talks\n- Bite-sized Philosophy\n- Wise Advice Motivation\n- Be inspired\n- Motivation Madness\n- Chaos & Order\n- Better Chapter\n- Forever Inspired", "link": "https://www.youtube.com/watch?v=ikp8StSFBZQ", "date_published": "2022-02-06 00:00:00+00:00", "persistent": true, "user": "rumpel", "language": "en", "tags": ["motivation"]}]