[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "15 Minutes Of Far Cry 6 Joseph: Collapse DLC Gameplay", "description": "Watch Joseph literally bible-thump people out of existence in the final villain-focused DLC for Far Cry 6.", "link": "https://www.youtube.com/watch?v=dHMX8KhGqFk", "date_published": "2022-02-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dying Light 2 Hits Milestone On Steam Despite Bugs | GameSpot News", "description": "Dying Light 2: Stay Human has a huge start on Steam, Batman: Arkham Collection possibly leaked for Nintendo Switch and you can sign up for PSVR2 pre-order notifications. \n\nIn this video, DeVante talks about Dying Light 2: Stay Human’s impressive first weekend numbers on Steam. The game’s popularity grew rapidly despite the its buggy launch that has included issues with co-op as well as crazy spinning heads just to name a few. Dying Light 2 is also available on PlayStation and Xbox consoles, but player data for those platforms is not available.\n\nSTAMPS\n00:00 - Intro\n00:06 - Dying Light 2\n00:53 - Batman on Switch?\n01:36 - PSVR2 Info", "link": "https://www.youtube.com/watch?v=RhLWbZskA7Y", "date_published": "2022-02-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Parents React to FINAL FANTASY XIV: Endwalker", "description": "Renowned FINAL FANTASY expert Jesse Cox gets his parents to react to FINAL FANTASY XIV: Endwalker. This expansion is the thrilling final chapter in the Hydaelyn and Zodiark story bringing a variety of new dungeons, jobs, and updates to the game! (In Partnership with Square Enix)\nPlay now: https://bit.ly/3mbPBlM", "link": "https://www.youtube.com/watch?v=cl7t5IjgMvU", "date_published": "2022-02-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sifu Review", "description": "Sifu is an excellent modern beat-'em-up with deep combat mechanics and a fascinating aging system.\n\nDeveloper Sloclap's Sifu will be available on PlayStation 4, PlayStation 5, and Microsoft Windows on February 8, 2022. You can read the full written Sifu review by Richard Wakeling on GameSpot.\n\n#Sifu", "link": "https://www.youtube.com/watch?v=FKWb6WW2reE", "date_published": "2022-02-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Real Weapons That Inspired Star Wars’ Iconic Arsenal - Loadout", "description": "The Star Wars universe is full of iconic weapons that feel like they could be real...and that’s because they sort of are. From their original creation back in the mid 1970s through to their appearances in the latest movies, and games like Star Wars Dark Forces, Jedi Knight 2: Jedi Outcast, and Star Wars Battlefront 2, these iconic sci-fi weapons come from a place a lot closer to home than a galaxy far, far away. (Presented by PUBG MOBILE)\n\nIn this episode of Loadout, Dave Jewitt visits the Royal Armouries to talk to Keeper of Firearms & Artillery Jonathan Ferguson, to chart the impact and inspiration behind Star Wars’ iconic firearms.\n\nYou can check out more episodes of Loadout right here. - https://www.youtube.com/watch?v=yzSrmGkpWKk&list=PLpg6WLs8kxGMzIemU1gyyLmg5VlKI2UvC\n\nYou can check out our Firearms Expert Reacts series here. - https://www.youtube.com/watch?v=5FVzcoRjoN4&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/", "link": "https://www.youtube.com/watch?v=uyZLiR6G43w", "date_published": "2022-02-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]