[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Limited Run Games LRG3 Showcase (ft. Mega64)", "description": "Limited Run Games is teaming up with Mega64 for the LRG3 Showcase, featuring over 30 trailers and physicals release reveals.\n\n#Summergamefest #SGF2022", "link": "https://www.youtube.com/watch?v=yw5v27xUx3Q", "date_published": "2022-06-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mario Strikers: Battle League | Everything To Know", "description": "Mario Strikers: Battle League is coming to Nintendo Switch letting you watch some of your favorite Mario characters duke it out on the soccer pitch. Here's everything you need to know about Mario's latest adventure\n\nMario Strikers: Battle League isn’t exactly the newest FIFA game. Instead, it takes the iconic plumber, and many of his most popular friends and rivals and has them duke it out on the soccer pitch. This video breaks down everything you need to know ahead of the upcoming release of Mario Strikers: Battle League on June 10th.\n\nThe game adds a fun arcadey twist to the game of soccer by eliminating all fouls. This means characters will violently and hilariously tackle each other, all in the name of sportsmanship. Don’t worry if you get beat up since getting tackled is one way you will receive items similar to those you might find in a Mario Party or Mario Kart game, letting you even the odds a bit.\n\nLastly, you can take an awesome final smash style shot where the game will add really cool animations as your character levels an unblockable shot if you time the shot perfectly. Don’t worry if you miss the window, though, as you’ll still have a good chance at making a goal, although if you’re unlucky, the ball might land in the goalie’s hands. Mario Strikers: Battle League comes out exclusively on Nintendo Switch. See you on the pitch!\n\n#MarioStrikers #battleleague", "link": "https://www.youtube.com/watch?v=vbpV3qAKE-4", "date_published": "2022-06-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Netflix Geeked Week - Day 1 Livestream | Series Showcase, The Sandman & The Umbrella Academy", "description": "It's Netflix's Geeked Week, a celebration and showcase of all things geeked coming from Netflix. Day 1 includes the Series Showcase, The Sandman, & The Umbrella Academy, and more.\n\n#GeekedWeek #Netflix", "link": "https://www.youtube.com/watch?v=UQEyzdaS4Qk", "date_published": "2022-06-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite Chapter 3 Season 3 Gameplay Trailer", "description": "Check out gameplay from Fortnite's Chapter 3 Season 3 featuring a theme park vibe. Additionally we get our first glimpse at Indiana Jones who seems to be making his way into the Fortnite Universe. \n\nIn Fortnite Chapter 3 Season 3: Vibin’, the Island is one giant party. Bounce around in Reality Falls, brave the Screwballer coaster, ride atop creatures, and revel with new arsenal. Drop into Season 3 and spread the good vibes!\n\nThe Reality Tree has blossomed on the Island, forming a new biome in the process! This location called Reality Falls is a lush forest of mushrooms, bouncy mushrooms, and trees of purple. When you’re not browsing its flora, swim beneath its waterfalls, seek loot in its cavern, and spring from its geysers. \n\nBallers are back! Roll around and grapple onto surfaces, but don’t just roll as you did before. In the spirit of celebration, get on the (totally safe) Screwballer for a high-flying amusement park ride. \n\nDon’t let the high-speed fun stop with Ballers: jump on a wolf or boar to ride on it! You don’t have to dismount to fight — shoot and throw weapons while atop your steed.\n\nReality Seed Pods are spreading from the Reality Tree. Plant a Reality Seed to grow a Reality Sapling — which grows in the same place match to match! Saplings bear better loot each time you weed them, so keep weeding a sapling until it bears Mythic loot. When it wilts away, plant the seed left behind!\n\nBring good and evil together with this Season’s Battle Pass. In addition to Darth Vader himself, the Chapter 3 Season 3 Battle Pass includes the anti-hero Evie, the defender Adira, and five more Outfits. Speaking of assembling Outfits, customize the parts of “Snap”! Later on in the Season? Unlock world famous archaeologist Indiana Jones.\n\n#Fortnite #Vibin", "link": "https://www.youtube.com/watch?v=ZyFAfjMiyUA", "date_published": "2022-06-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite Chapter 3 Season 3 Official Cinematic Trailer", "description": "Check out Fortnite's Chapter 3 Season 3 Vibin cinematic trailer. We get a glimpse of a fun theme park vibe, as well as Darth Vader riding a fun roller coaster ride. We even get a glimpse of Genos.\n\nIn Chapter 3 Season 3: Vibin’, the Island is one giant party. Bounce around in Reality Falls, ride atop creatures, brave the Screwballer coaster, and revel with new arsenal. \n\nDrop into Season 3 and spread the good vibes! Bring good and evil together with this Season’s Battle Pass. In addition to Darth Vader himself, the Chapter 3 Season 3 Battle Pass includes the anti-hero Evie, the defender Adira, and five more Outfits. Speaking of assembling Outfits, customize the parts of “Snap”! Later on in the Season? Unlock world famous archaeologist Indiana Jones. Play Your Way!\n\nSprint, climb, and smash your way to a Victory Royale whether you choose to build up in Fortnite Battle Royale or go no-builds in the new Fortnite Zero Build.\n\n#Fortnite #Vibin", "link": "https://www.youtube.com/watch?v=VdcLGaiHgEY", "date_published": "2022-06-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]