[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "8 Close-Quarters Combat Games You Can Play Now", "description": "Correction: Call Of Duty: Modern Warfare 2 releases on October 28.\nClose-quarters battle in video games takes many forms, from SWAT-style titles or mil-sim urban combat to more unique and niche ideas in cyberspace or future settings. We know there's something out there for all skill levels and budgets. If you are a veteran player or just want to try your hand at more slow-paced, methodical, and brain-taxing shooter games, this video is for you. We're about to show you games with great mechanics, levels, and unique ideas around close-quarter combat. \n\nWe'll start with an easy first pick: Void Interactive's Ready Or Not, a team-based tactical shooter with very mature themes. This title nails many of the fundamentals of SWAT-style games, including a great communications system, large toolset, constant sense of danger, and incredibly satisfying door-breaching. This game is also very contemporary, which might be tough for some people, so use your own judgment. Then we'll explore a level from Call of Duty: Modern Warfare by Infinity Ward that drastically differed from every other Call of Duty game and put players in some intense shoot-or-don't-shoot scenarios. We'll then move on to a few wildcard picks, the first being Superhot, which allows players the time to think through fast-moving gunfights and feel like Neo from The Matrix. We'll then keep picking titles based on unique ideas, such as the wicked sound design of Insurgency Sandstorm, the meticulously modeled guns and one-handed gun manipulation from Hot Dogs, Horseshoes & Hand Grenades, and the perma-death seen in the turn-based XCOM series, and entry-level budget picks on Steam like Zero Hour and Ground Branch. Finally, we can't forget the long-running close-quarters PvP tactical shooter Rainbow Six Siege, which is going into Year 7.\n \nWe hope we found something for everyone on every platform, including PlayStation 5, PSVR, Xbox Series X/S, PC, and those with more complex virtual reality setups. We had to cut a number of other unique titles off this list, so let us know if you want a second part that covers retro games like the older Rainbow Six titles and lesser-known titles like Syndicate.\n\n0:00 Intro\n0:26 Ready Or Not\n2:55 - Call of Duty: Modern Warfare (2019)\n4:00 - SUPERHOT\n4:50 - Insurgency: Sandstorm\n5:39 - Hotdogs, Horseshoes, & Hand Grenades\n7:00 - Zero Hour & Ground Branch\n8:31 - XCOM\n9:46 - Rainbow Six Siege\n\n\n\n#gamespot #gaming #readyornot #h3vr #rainbowsixsiege", "link": "https://www.youtube.com/watch?v=Sljwb-Lb0vI", "date_published": "2022-08-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To MORE Call Of Duty: Modern Warfare Remastered Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of the Call Of Duty: Modern Warfare Remastered, including the suppressed USP sidearm, the AK-47, and the Skorpion.\n\n00:00 - Opening\n00:40 - M60E4\n03:20 - G3\n05:23 - USP\n07:22 - AK-47\n11:05 - Skorpion\n13:57 - STG 44\n18:28 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down more of the guns of Call Of Duty: Modern Warfare Remastered and compares them to their real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=VW86QU3LwiE", "date_published": "2022-08-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]