[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC_7PqixGIdE-jjoHKMPYpGA", "title": "Dlatego nie reklamuję CBD...", "description": "📚 Kup moją najnowszą książkę ► https://siedem.alt.pl\nDo 9 listopada darmowa wysyłka na terenie Polski\n\n👉 Patronite ► https://patronite.pl/NaukowyBelkot \n👉 Nasz naukowy portal► https://naukowybelkot.pl\n\n📚 Moja książka ► https://altenberg.pl/geny/\n📚 E-book ► https://tinyurl.com/pnp-ebook\n🎧 Mix audio ► http://ratstudios.pl/\n\nTak... Będzie o olejkach CBD...\n\n===\nCzy można wierzyć publikacjom\n👉 https://www.youtube.com/watch?v=Avq9X0SSiLU\n\nPlacebo\n👉 https://www.youtube.com/watch?v=rgtPI8urtkE\n\n===\nRozkład jazdy:\n\n0:00 Twój ulubiony celebryta vs CBD\n2:10 Źródła #disclaimer\n3:52 Braki dowodów #disclaimer\n5:00 Placebo #disclaimer\n6:30 Czy działa na ludzi?\n8:20 Czy uzależnia?\n8:52 Bezpieczeństwo\n11:50 Epilepsja\n12:58 Ból\n14:50 Nowotwory\n15:17 Lęki\n16:35 Choroby psychiczne\n17:55 Przypadłości neurologiczne\n18:40 Sen\n19:01 Uzależnienia\n19:40 Wiarygodność\n\n===\nŹródła (wybrane):\n\nN. Black i in. - Cannabinoids for the treatment of mental disorders and symptoms of mental disorders: A systematic review and metaanalysis\nD. Larsen i in. - Dosage, Efficacy and Safety of Cannabidiol Administration in Adults: A Systematic Review of Human Trials\nJ. Moltke i in. - Reasons for cannabidiol use: a crosssectional study of CBD users, focusing on self-perceived stress, anxiety, and sleep problems\nM. Eisenstein - From menace to medicine\nF. Pampolina i in. - Potential Clinical Benefits of CBD-Rich Cannabis Extracts Over Purified CBD in Treatment-Resistant Epilepsy: Observational Data Meta-analysis\nC. White - Potential Clinical Benefits of CBD-Rich Cannabis Extracts Over Purified CBD in Treatment-Resistant Epilepsy: Observational Data Meta-analysis\nD. Sholler i in. - Potential Clinical Benefits of CBD-Rich Cannabis Extracts Over Purified CBD in Treatment-Resistant Epilepsy: Observational Data Meta-analysis\nE. Chesney i in. - Adverse effects of cannabidiol: a systematic review and meta-analysis of randomized clinical trials\nK. Iffland i in. - An Update on Safety and Side Effects of Cannabidiol: A Review of Clinical Data and Relevant Animal Studies\nN. Vozoris i in. - Morbidity and mortality associated with prescription cannabinoid drug use in COPD\nE. Seltzer i in. - Cannabidiol (CBD) as a Promising Anti-Cancer Drug\nE. Boland i in. - Cannabinoids for adult cancer-related pain: systematic review and meta-analysis\nM. Mucke i in. - Systematic review and meta‐analysis of cannabinoids in palliative medicine\nA. Hazekamp i in. - Grote variatie in samenstelling cannabisolie noopt tot rege\nhttps://sciencebasedmedicine.org/where-are-we-with-cbd/", "link": "https://www.youtube.com/watch?v=zv_CoSRC710", "date_published": "2022-04-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]