[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Get Revenge On Young Anakin & Fly In LEGO Star Wars | GameSpot News", "description": "LEGO Star Wars exploit allows players to fly, Epic Games partners with LEGO for a new family friendly metaverse, and Max Payne 1 and 2 are getting remakes.\n#GamingNews #LEGO #StarWars\n\nAn exploit has been found in Lego Star Wars: The Skywalker Saga, allowing players to essentially fly across the map. In a video posted by Red Orb, the player tested this trick out on child Anakin, using an extended combo of attacks from Jedi character Qui-Gon Jinn.\n\nEpic Games and The Lego Group have announced a new \"long-term\" deal to help \"shape the future of the metaverse\" and specifically make it safe and fun for children and families. Epic's most popular game, Fortnite, was not mentioned in the company's press release, so it appears whatever Epic and The Lego Group are building together is separate from the battle royale title.\n\nA remake of Max Payne and Max Payne 2 is in the works. These remakes are coming from Remedy Entertainment, the studio behind the original Max Payne games. The studio has reached an agreement with Rockstar to remake both games for PC, PS5, and Xbox Series X|S.\n\nSTAMPS\n00:00 - Intro\n00:08 - LEGO Star Wars\n01:31 - LEGO & Epic\n02:31 - Max Payne", "link": "https://www.youtube.com/watch?v=RmkmQYjoktA", "date_published": "2022-04-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "How Hard Has BOTW Advanced Combat Become?", "description": "Breath of the Wild combat has morphed into a complex monster of melding techniques that requires an insane amount of knowledge and frame perfect timing. How much as it changed over a span of 5 years?\n\nWe breakdown two clips, from the first inception of more advanced combat in 2017, to the mind blowing tactics we use now in 2022. Basic skills such as Bomb Parries and Jump Cancels are still used today, but are overshadowed by frame-perfect techniques such as Daruk's Shield Block Resets, Quadruple Daruk's Perfect Parries, and Bomb Arrow Absolute Thunderclap Rushes. As the years go on, Breath of the Wild combat will continue to get more complex.\n\n0:00 Intro\n0:37 Old Advanced Combat\n2:25 New Advanced Combat\n9:07 Conclusion\n9:51 Outro\n\n#BOTW", "link": "https://www.youtube.com/watch?v=lfmKB6DqR70", "date_published": "2022-04-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "MLB The Show 22 Video Review", "description": "MLB The Show 22 stills plays a phenomenal game of baseball, but incremental updates reveal a series that's lacking in ambition.", "link": "https://www.youtube.com/watch?v=2G0PHrowOlE", "date_published": "2022-04-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Everything New In Black Desert Online's Eternal Winter Expansion", "description": "(Presented by Pearl Abyss) Blizzards? Check. A sick new player class? Check. A fox sherpa? Check. Black Desert Online's new Eternal Winter (free) update has something for everyone, even if you've never played the hugely popular MMO before. Whether you're a long time Black Desert Online player or just getting started, you can jump straight into the new Eternal Winter expansion. Just don't forget to bring a coat!", "link": "https://www.youtube.com/watch?v=xatvbQrZRUU", "date_published": "2022-04-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Ubisoft NFTs: Your Favorite Games Aren't Safe Yet | GameSpot News", "description": "Ubisoft may still have plans for NFTs in its future games, the next Ghost Recon is reportedly in development, and Call of Duty Warzone season 3 may include sniper nerfs.\n#GamingNews #Ubisoft #Warzone\n\nThe Ubisoft Quartz website shows that the company seems to have plans to continue its NFT push. The site thanks the players who claimed their in-game NFTs and goes on to say “stay tuned for more updates with features to the platform and future drops coming with other games!”\n\nAccording to Kotaku, the next mainline Ghost Recon game could launch as early as the fiscal year 2023, and is codenamed Over. Not much other information about a new Ghost Recon is currently available.\n\nNews of the upcoming sniper nerf for Season 3 comes from Ted Timmins, who works on Warzone as Raven Software's Senior Creative Director. Timmins said, \"I think we would all agree it’s long overdue. The sniper meta hasn’t changed in what feels like forever.\"\n\nSTAMPS\n00:00 - Intro\n00:06 - Ubisoft NFT\n00:51 - New Ghost Recon\n01:45 - Warzone", "link": "https://www.youtube.com/watch?v=cJ9iakYNW8c", "date_published": "2022-04-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]