[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Immigrant Family Separated Under 'Zero Tolerance' Speaks Out | After Zero Tolerance | FRONTLINE", "description": "When Anavelis and her 6-year-old daughter, Genesis, arrived in the United States from Honduras in 2018, they hoped for a better life ahead. Instead, they became one of thousands of families separated under the Trump administration’s immigration policies, including \"zero tolerance.\"\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nAnavelis and Genesis share their stories in this excerpt from \"After Zero Tolerance,\" a documentary short premiering Tues., Dec. 6, 2022 on FRONTLINE. Follow their years-long quest to reunite in the full documentary: https://to.pbs.org/3h42qPH\n\n#immigration #zerotolerance #excerpt \n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\n“After Zero Tolerance” is a FRONTLINE production with Five O’Clock Films in association with Guerra Productions, Syracuse University’s S.I. Newhouse School of Public Communications, and University of Connecticut. The writer, producer and director is Oscar Guerra. The senior producer is Frank Koughan. The editor-in-chief and executive producer of FRONTLINE is Raney Aronson-Rath.\n\nFRONTLINE is produced at GBH in Boston and is broadcast nationwide on PBS. Funding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Additional support for FRONTLINE is provided by the Abrams Foundation, the John D. and Catherine T. MacArthur Foundation, Park Foundation, the Heising-Simons Foundation, and the FRONTLINE Journalism Fund, with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation.", "link": "https://www.youtube.com/watch?v=5efmXiM5BtQ", "date_published": "2022-12-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]