[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Crisis Core: Final Fantasy VII Reunion Video Review", "description": "Crisis Core: Final Fantasy VII Reunion is an updated version of the PSP classic - showcasing the story of Zack Fair and a prequel to Final Fantasy VII. Jessica Howard goes over what was updated for this remake of a classic game.\n#gaming #gamename #gamespot \n\nMuch like protagonist Zack Fair himself, the story of the self-proclaimed country-boy-turned-SOLDIER-First-Class is not one shrouded in mystery. If you've engaged with Final Fantasy VII or any of its various spin-offs, prequels, remakes, or animated movies, chances are you understand the weight of his legacy--which is, coincidentally, only rivaled by the weight of his sword. However, if you're looking for the definitive way to experience it, look no further than Crisis Core: Final Fantasy VII Reunion.\n\nA remake of the 2007 PSP exclusive Crisis Core: Final Fantasy VII, Crisis Core Reunion is a faithful retelling of Zack Fair's story with dramatic visual upgrades, full voice acting, and several quality-of-life changes. Considering the game was already heralded as a fantastic prequel and one of the best titles on PSP, it comes as little surprise that this version is triumphant in making Crisis Core into a modern day must-play for Final Fantasy VII fans. Not only does Crisis Core Reunion port the once fairly difficult-to-find game to several new consoles, allowing for a greater audience to experience the title, it transforms the game from feeling like a smaller, handheld experience into something that can proudly stand beside Final Fantasy VII Remake as a worthy companion.", "link": "https://www.youtube.com/watch?v=KUnD_SOlTgk", "date_published": "2022-12-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dead Island 2 Full Showcase - Another Day in HELL.A.", "description": "Watch the Dead Island 2 live action and gameplay Showcase featuring slayers, zombies, tones of gore, weapons, and visceral melee combat. We've rolled out the red carpet for you - welcome to HELL-A.\n \nLA is in ruins. A deadly virus is spreading and the city is in quarantine. With the military long gone, follow three fearless survivors in their search for a safe haven from the outbreak and zombie hordes. \n\nAs they roam the supposedly abandoned mansion of local videogame and movie producer in the Hollywood Hills, they’ll soon discover that nowhere is safe in HELL-A.\n\n#deadisland2 #gaming", "link": "https://www.youtube.com/watch?v=GYxiPPhCETs", "date_published": "2022-12-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dead Island 2 Official Gameplay Trailer", "description": "Welcome to HELL-A! Join slayers Jacob and Amy on a picture postcard tour of LA – they’ve got all the usual tourist attractions covered, albeit with a uniquely horrifying vibe.\n\n#deadisland2 #gaming", "link": "https://www.youtube.com/watch?v=abYGYJZBmmY", "date_published": "2022-12-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dead Island 2 Showcase Livestream", "description": "Take a break from the harsh winter weather and dip into a day in HELL-A with Dead Island 2. A showcase for the upcoming game is on the way and promises to satisfy all your gore-y needs.\r\n\r\n#gaming #deadisland2", "link": "https://www.youtube.com/watch?v=_yYzAGes9O0", "date_published": "2022-12-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "ELDEN RING | Free Colosseum Update Official 4K Trailer", "description": "Come forth, warriors, and bask in the glory of the Colosseums.\n\nThe Colosseums of Limgrave, Leyndell and Caelid will open their gates, allowing players to engage in battles such as duels, free-for-alls and team fights.\n\nProve your worth in Free Colosseum Update 1.08. Coming December 7. \n\n#ELDENRING #Colosseum #PvP", "link": "https://www.youtube.com/watch?v=gXbCAG0aVwg", "date_published": "2022-12-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Free Elden Ring Colosseum Update Revealed | GameSpot News", "description": "Elden Ring is getting a new Colosseum update, Cyberpunk 2077’s multiplayer has been canceled, God of War Ragnarok adds a photo mode and Vampire Survivors reveals DLC.\n#GamingNews #EldenRing #Cyberpunk2077 \n\nThe Colosseum update, which arrives tomorrow December 7, invites players into the colosseums of Limgrave, Leyndell, and Caelid where they can fight in 1v1 duels, as part of a team, or in free-for-all matches. All of this comes to Elden Ring in update 1.08, but the full patch notes haven't been announced yet.\n\nIn a new update from developer CD Projekt Red, we’ve learned Cyberpunk 2077’s online mode became a casualty of the game's turbulent release as the studio was forced to focus all of its energy on fixing the game’s many issues.\n\nWhat that multiplayer game would have looked like remains a mystery, as CD Projekt Red kept details of the project tightly under wraps and seldom spoke of it. Luckily the game’s Phantom Liberty expansion is still on the way for PC, PS5 and Xbox Series X|S sometime next year as well as a sequel further into the future.  \n\nAn update you won’t have to wait for however is the latest for God of War Ragnarok. This update adds a very popular feature for virtual photographers: photo mode. The mode lets players put facial expressions on characters like Kratos, Atreus, and more as well as hide main or side characters, too. What's more, things like field of view, focal length, depth of field, and f-stop can be manipulated. In addition, the photo mode includes film grain and exposure settings to tinker with. There is also the ability to apply borders, logos, and vignettes to any photo.\n\nSTAMPS\n00:00 - Elden Ring\n01:14 - Cyberpunk 2077\n01:52 - God of War Ragnarok\n02:27 - Vampire Survivors", "link": "https://www.youtube.com/watch?v=rg1-wpqclMg", "date_published": "2022-12-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Breaks Down Different AK Variants - Loadout", "description": "From the classic AK-47 and AKM rifles through to reproductions like the Chinese Type-56, our favourite shooters have featured plenty of the iconic Russian firearm. In this bonus episode of Loadout, Keeper of Firearms & Artillery Jonathan Ferguson breaks down and compares a variety of different AK rifles.\n\nIn this episode of Loadout, Dave Jewitt visits the Royal Armouries to talk to Keeper of Firearms & Artillery Jonathan Ferguson about the iconic AK-47 and its different variants.\n\nYou can check out more episodes of Loadout right here. - https://www.youtube.com/watch?v=yzSrmGkpWKk&list=PLpg6WLs8kxGMzIemU1gyyLmg5VlKI2UvC\n\nYou can check out our Firearms Expert Reacts series here. - https://www.youtube.com/watch?v=5FVzcoRjoN4&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/", "link": "https://www.youtube.com/watch?v=mrKoaValItk", "date_published": "2022-12-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Star Wars Jedi: Survivor Release Date Revealed Early? | GameSpot News", "description": "According to a Steam page that has since been changed, Star Wars Jedi: Survivor will be released in March 2023.\n#GamingNews #StarWarsJediSurvivor #TheGameAwards\n\nAccording to a previous report, Jedi: Survivor's release date is scheduled to be officially announced during The Game Awards this week. A new trailer for the game will also be shown at the event. \n\nAnd the potential release date isn’t the only thing that the Steam page revealed, there were also images that showcased the pre-order bonuses for different versions of the game. These items include some new looks for Cal and BD-1, new Lightsabers and possibly the most exciting addition: different Blaster sets. In Jedi: Fallen Order, Cal didn’t have a gun in his loadout, however it looks like this time around that will change. \n\nGuess we’re just going to have to wait for the Game Awards for confirmation. Lucky for us, Thursday is right around the corner so we won’t have to wait long. On top of that, we won’t have to watch it for very long either as Geoff Keighley has confirmed that The Game Awards 2022 will be much shorter than last year's showcase.\n\nDuring a recent Twitter Spaces talk, Keighley discussed the upcoming ceremony and answered some questions about what to expect. The Game Awards is usually filled with not only award presentations, but interviews with developers and trailers for brand-new games. Last year's pre-show lasted around 30 minutes while the main event went on for 3 hours. During the Spaces talk Geoff said, \"I won't say anything officially until we're through our rehearsals but we think it's going to be significantly shorter.\"", "link": "https://www.youtube.com/watch?v=r1aJJyopODs", "date_published": "2022-12-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Witcher 3 PS4 vs PS5 Next Gen Update", "description": "Here's side-by-side gameplay of The Witcher 3: Wild Hunt running on the PlayStation 4 and PlayStation 5 with ray tracing.", "link": "https://www.youtube.com/watch?v=ieLbOS0ExQU", "date_published": "2022-12-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Witcher 3's Next Gen Upgrade Looks Incredible", "description": "The Witcher 3 is back with a fresh coat of paint. We had a chance to check it out, and it looks and plays better than ever. Jake and DeVante talk through their thoughts after an extended preview.\n\nThe Witcher 3: Wild Hunt originally came to PC, Xbox One, and PS4 back in 2015. It is widely considering one of the best games of that generation, and now it's getting a next-gen update for PS5 and Xbox Series S|X.\n\nThis version adds two modes: Performance and Ray Tracing. Both settings look great, but the Ray Tracing mode utilizes some subtle ray tracing techniques to enhance the visuals even more.\n\nThe Witcher 3: Wild Hunt - Complete Edition is out on December 14 as a free upgrade.\n\n#witcher #gamespot #gaming", "link": "https://www.youtube.com/watch?v=7pWykIsXp6k", "date_published": "2022-12-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]