[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Stromae: Tiny Desk Concert", "description": "Stephen Thompson | December 5, 2022\nBelgian dance-pop superstar Stromae puts on one of the best live shows in the world — here’s a two-song set from 2015, presented as evidence — but his stage presentation is tough to strip down. To say nothing of the light show, Stromae’s throbbingly impeccable arrangements involve the extensive use of pre-recorded tracks, all of which are frowned upon at the Tiny Desk. So, given a simple three-word assignment (“no preset sounds”), his team set about re-creating Stromae’s music so that it could be performed in real time.\n\nThis involved more gleaming tech than we could have ever imagined when we launched Tiny Desk concerts nearly 15 years ago — veritable banks of laptops, mixers and synthesizers, with multiple producers working out of frame — but damned if every sound in this set wasn’t crafted and played live on the spot. Stromae and his team had to come a day early for hours of setup and rehearsals, and even the band’s clothing was handpicked from the singer’s fashion line, but what they produced felt loose-limbed and organic in the spirit of the series.\n\nIt helps that, as heard on this year’s outstanding Multitude, Stromae’s songs draw from a deep well of lived emotion. Backed by three members of the Bulgarian women’s choir Yasna Voices, Stromae kicked off his set with “L’enfer,” a wrenching acknowledgement of suicidal thoughts. The song’s chorus, translated to English, reads, “Sometimes I’ve had suicidal thoughts and I’m not proud of it / Sometimes you feel it’d be the only way to silence them / All these thoughts putting me through hell.”\n\nFrom there, Stromae’s song selections conveyed lighter moods, but even his most danceable tracks contain undercurrents of darkness and conflict: “Santé” is a toast to those who can’t celebrate, “Alors on danse” (from 2009’s Cheese) embraces dancing as a way to drown out life’s hardships and “Mon amour” attempts to reassure a lover against a backdrop of infidelity and dysfunction. On its own, each track is a heady cocktail of painstaking craft and hard-won joy. Taken together, they form a portrait of a world-class showman at the height of his powers.\n\nSET LIST\n“L’enfer”\n“Santé”\n“Alors on danse”\n“Mon amour”\n\nMUSICIANS\nStromae: vocals\nManoli Avgoustinatos: keyboards, charango, vocals\nYoshi Masuda: keyboard, vocals\nSimon LeSaint: drums, vocals\nFlorian Rossi: keyboard, vocals\n\nYasna Voices NY Bulgarian Women’s Choir, directed by Vlada Tomova\nMimi Berkova\nLarkin Grimm\nVlada Tomova\n\nTINY DESK TEAM\nProducer: Bob Boilen\nDirector/Editor: Maia Stern\nAudio Engineer: Josh Rogosin \nSeries Producer: Bobby Carter\nVideographers: Joshua Bryant, Maia Stern, Pierre Kattar, Sofia Seidel\nProduction Assistants: Jill Britton, Alanté Serene\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Kara Frame, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#stromae #tinydesk #nprmusic", "link": "https://www.youtube.com/watch?v=6dkDepLX0rk", "date_published": "2022-12-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]