[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Size & Preload Details | GameSpot News", "description": "Elden Ring file size and preloading are confirmed on Xbox consoles, Activision gives an update on Call of Duty anti-cheat, and EA responds to reports that Halo Infinite hurt Battlefield 2042. \n\nIn this video, DeVante talks about Elden Ring’s file size and preloading, which is currently live for Xbox players. A preload date hasn't been announced yet for PlayStation consoles or PC. Elden Ring releases on February 25, 2022 for PlayStation, Xbox and PC. \n\nDeVante also talks about reports that said the launch of Halo Infinite might have contributed to the lower-than-expected results. Fans may recall that Microsoft surprise-launched Halo Infinite's multiplayer on November 15, just days before Battlefield 2042. \n\nLater in the video, he explains a new blog post from Activision that said cheating within Warzone reached an \"all-time low\" during the holidays, speaking to the success of the Ricochet tools.\n\nSTAMPS\n00:00 - Intro \n00:10 - Elden Ring\n01:06 - Battlefield\n02:36 - Call of Duty\n\n#GameSpotNews #EldenRing #Battlefield2042", "link": "https://www.youtube.com/watch?v=89xIXegs_KA", "date_published": "2022-02-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Is Cyberpunk 2077 Finally In The State It Should Be?", "description": "Cyberpunk 2077 launches on next-gen PS5 and Xbox Series X/S with patch 1.5. Lucy and Jean-Luc dive into if the game is finally in the bug-free and fully playable state it should have been at launch, as well as touch on added features like new apartments and weapons.\n\nThe next-gen versions of Cyberpunk 2077 come with both a performance and ray tracing mode, giving players the option for 60fps or 30fps with ray-traced shadows. It also features another round of bug fixes. While the game still isn't perfect, the game's current state feels more than acceptable, and we feel confident in saying that Cyberpunk is finally in a good playable state for players to enjoy. Patch 1.5 also features some more dramatic gameplay changes like new skills, a rebalanced economy, the option to change your appearance after the start, and even new apartments for V to rent. Only time will tell where Cyberpunk will go from here but for now it's nice to just sit back and experience the game for what it is.\n\nTimestamps:\n00:00 - Intro\n01:02 - PlayStation 5 Version\n05:38 - PC Version\n06:39 - Quality of Life Improvements\n09:27 - Are There Still Bugs?\n10:24 - Skills & Apartments\n11:19 - What's The Future For Cyberpunk?", "link": "https://www.youtube.com/watch?v=5eeZiVJP33k", "date_published": "2022-02-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Rainbow Six Extraction - Spillover Crisis Event Gameplay", "description": "Rainbow Six Extraction is having it's first post-launch, limited time event- Spillover. Check out our gameplay as we defend and decontaminate hot zones throughout the San Francisco map. \n\nRainbow Six Extraction is dropping their first post-launch update with \"Spillover\". Ubisoft announced \"Crisis Events\" prior to the launch of Extraction with updates including new operators, REACT-Tech and more. Ubisoft invited GameSpot to an early access event where we got to check out the latest update before release. In between in-game assignments, Crisis modes will only last for three weeks, so be sure to squad up and unlock all the limited-timed goodness. \n\nSpillover is the first Crisis Event available for Tom Clancy's Rainbow Six Extraction. Spillover introduces Zofia as a brand new playable operator as well as new gadgets, cosmetics, and lore.\n\nWith more Crisis events Rainbow Six Extraction coming soon, stay tuned to GameSpot for all the latest. Rainbow Six Extraction is available on PS4, PS5, Xbox One, Xbox Series X/S and PC. with the Spillover event coming soon.", "link": "https://www.youtube.com/watch?v=xHkeOrOUtmY", "date_published": "2022-02-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "9 Things I Wish I Knew Before Playing Horizon Forbidden West", "description": "Horizon Forbidden West is a sprawling game with loads to see and do. In this video, Lucy James breaks down nine tips to help you get started. Everything from skill tree upgrades to combat techniques, these tips will help you begin your journey into the forbidden west.\n\nHorizon Forbidden West is the long-awaited sequel to Horizon Zero Dawn, and throws Aloy into a beautiful but dying world full of powerful machines, as she tries to discover why the world is ending. The game gives you a lot of tricks up your sleeve to stop the apocalypse… again, but it’s a lot to get your head around, so here are nine things I wish I knew before playing Horizon Forbidden West.\n\nTimestamps:\n00:23 - Watch A Prequel Recap\n01:05 - Tweak Your Settings\n02:16 - Embrace Your Skill Trees\n03:26 - Valor Surges\n04:18 - Traps Are OP\n05:12 - Use Your Focus Everywhere\n06:13 - Switch It Up!\n07:02 - Selling Stuff\n07:35 - Side Quests", "link": "https://www.youtube.com/watch?v=n4kNPZjPMxM", "date_published": "2022-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 - PS4 Pro (Patch 1.31) vs PS5 version (Patch 1.5) Graphics Comparison", "description": "How much better does the next-gen version really look? More than you might except.\n\nCD Projekt RED dropped the surprise bombshell that is Cyberpunk 2077’s 1.5 Patch on Tuesday. This not only included a host of improvements and gameplay tweaks, but also marked the release of the long awaited next-gen versions for PlayStation 5 and Xbox Series X/S. The new versions include a performance mode that runs at 60fps at a dynamic 4K, as well as a ray tracing mode that includes ray traced shadows at 30fps dynamic 4K.\n\nIn this video we compare the PS4 Pro version of Cyberpunk running on a PS5 with patch 1.31, vs the native PS5 version running on the new 1.5 patch. Even without the ray traced shadows there is a noticeable difference between the two versions, with updated lighting, higher res textures, and even better model detail. It's nice to see more than just a simple resolution and frame rate bump with these next-generation versions.\n\n#Cyberpunk2077", "link": "https://www.youtube.com/watch?v=ofw_PfDolCg", "date_published": "2022-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 Secrets Being Found | GameSpot News", "description": "In today’s episode of GameSpot News, Persia talks about some of Cyberpunk 2077’s new secrets being revealed, No Man’s Sky Sentinel update out now, and more. \n\nDuring CD Projekt Red’s 1.5 patch reveal stream, it was also mentioned that there would be some new secrets for players to discover throughout the game with clips emerging online showcasing new police chases, character before & afters, character balance changes, and more. \n\nHello Games has just dropped the Sentinel update for No Man’s Sky. The update features a complete combat overhaul, the ability to have their own drone to take care of, and more.\n\nNintendo has opened registrations for the Nintendo Switch Sports online play tests, also advising players that they are strictly forbidden from sharing any footage. The online play test runs this weekend on February 19 and 20 for a set period of hours each day, and you need to be a subscriber to Nintendo's Switch Online membership to get in. \n\nSign up at the links below:\nUS https://my.nintendo.com/rewards/7465c9bc0183c858 \nEU https://my.nintendo.com/rewards/5ef22cb53f7e0914 \n\nFor more information on all of our topics, please visit www.gamespot.com.\n\nTimestamps:\nIntro - 00:00\nCyberpunk Secrets - 00:08\nNo Man's Sky Sentinel - 01:12\nNintendo Switch Sports - 02:07\nOutro - 03:24", "link": "https://www.youtube.com/watch?v=yTdI8Wk9II0", "date_published": "2022-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Fans Beware!  | GameSpot News", "description": "In today’s episode of GameSpot News, Persia talks about Elden Ring spoilers emerging online, confirmation of the Metro’s fate in Cyberpunk 2077, and more. \n\nWhile Elden Ring has a planned launch of February 25, some players have managed to get their copies just over a week early, and are streaming the game on Twitch. Not only that, but the game's intro cinematic has been released early, alongside some screengrabs and gameplay features.\n\nNow that players have had some time with Cyberpunk 2077’s 1.5 patch, they’re starting to discover all types of new secrets under the hood. However, a screenshot shared on reddit of an existing asset had the Metro discussion circulating again. Cyberpunk 2077’s Global Community Director, Marcin Momot, was quick to clarify on twitter that there will definitely not be a Metro added to the game and the screenshot that was circulating was completely unrelated.\n\nA new patch for Dying Light 2 has gone live on PC, and between a few tweaks to the zombie apocalypse sandbox, one of the game's more annoying bugs has been fixed. Dying during a quest within a restricted area would result in them being respawned in a different area, and facing a time limit that would not allow them to get back to the previous mission area on time. That issue has been fixed, alongside a few others.\n\nFor more information on all of our topics, please visit gamespot.com.\n\nTimestamps:\nIntro - 00:00\nElden Ring - 00:07\nCyberpunk 2077 - 00:56\nDying Light 2 - 02:04\nOutro -  02:59", "link": "https://www.youtube.com/watch?v=Ad7PFpv_LFI", "date_published": "2022-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Horizon Forbidden West - 10 Combat Tips You Need To Know", "description": "Horizon Forbidden West's frontier can be daunting to newcomers and veterans alike, so we've compiled 10 tips to give you the extra fighting edge.\n\nIn this video we go over key combat differences from Horizon Zero Dawn into Horizon Forbidden West, and brand new mechanics that changed combat. From Halfmoon Cancels to proper glider use, there's a lot to unpack in the jampacked sequel.\n\nTimestamps:\n00:00 - Intro\n00:20 - Valor Surge Dodging\n00:51 - Slide Dodging\n01:21 - Trap Mechanics Changed\n01:59 - Combat Settings\n02:55 - Javelin Lockdown\n03:25 - Jump Off Attacks\n03:57 - Halfmoon Cancel\n04:35 - Choosing The Right Valor Surge\n06:20 - Smoke Bomb Offense\n06:40 - Grapple Point Landing\n07:19 - Outro", "link": "https://www.youtube.com/watch?v=CILj04Ll5-I", "date_published": "2022-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Horizon Forbidden West Opening Hours Gameplay Livestream", "description": "Horizon Forbidden West is here, and Lucy James is showing off a look at some of the early game.", "link": "https://www.youtube.com/watch?v=w6pEiPoInck", "date_published": "2022-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]