[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "StarLite Mk IV: the MOST PORTABLE laptop with Linux!", "description": "Make sure your PHP applications stay relevant for longer: https://bit.ly/3djMBCj\n\nStarlabs StarLite: https://fr.starlabs.systems/pages/starlite\n\n👏 SUPPORT THE CHANNEL:\nGet access to a weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYouTube: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n📹 MORE VIDEOS FROM ME\nLinux news in Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\nGaming on Linux: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nI'm also on ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n🏆 FOLLOW ME ELSEWHERE:\nTwitter : http://twitter.com/thelinuxEXP\nMastodon: https://mastodon.social/web/@thelinuxEXP\nPixelfed: https://pixelfed.social/TLENick\nDiscord: https://discord.gg/xK7ukavWmQ\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\nThis video is distributed under the Creative Commons Share Alike license.\n\n#linux #laptop #starlabs\n\n\n00:00 Intro\n00:50 Sponsor: Extend the lifecycle of your PHP applications\n01:40 Design and Build Quality\n04:47 The Specs: low power, fanless\n07:30 The Display: tiny, big bezels, but a good panel\n08:26 Webcam, mic, and speakers: a mixed bag\n09:46 Keyboard and touchpad: really good\n11:08 Performance and battery life: very, very lightweight\n14:24 Who is this laptop for?\n16:53 Support the channel\n\n\nWhat we have here is an 11 inch laptop, with a full matte black anodized aluminium body, which is super rigid and strong, and looks really, really good. It's also insanely thin, at 1.36 mm in height.\n\nSpeaking of the bezels, they're really a weak point here. They're huge, both on the top and bottom, and on the sides, and that's really a shame.\n\nAnother small issue: the chassis is an absolute fingerprint magnet.\n\nOf course, you can also open the starlite, either by removing the little trapdoor with 2 screws, to access the SSD.\n\nThe Starlite comes with one CPU option, an intel Pentium N5030. This is a quad core CPU with a base clock of 1.10 Ghz, with turboboost up to 3.10 Ghz.\n\nThe graphics part is the integrated intel UHD 605.\n\nThis CPU is accompanied by 8Gb of RAM, it's 2400Mh DDR4, it's soldered.\n\nIt also embarks 240GB of SSD, with options to go up to 480 or 960GB, and again, you can upgrade that yourself.\n\nIn terms of I/O, you get a USB C port that also does charging, you get a micro HDMI output, 2 full size USB 3.0 ports, a DC jack for the included barrel charger, a headphone jack, and a micro SD card.\n\nYou also get wifi and bluetooth, of course, with 802.11 ac and bluetooh 5.1.\n\nThe display 11.6 inches. It's 1080p, 16:9, it's matte, and it's covered by something that looks like glass, but definitely has an anti glare coating. \n\nThe viewing angles are really good, the colors feel nice and accurate, and it's bright enough at 300 nits. It supports 100% of SRGB, and has a color depth of 71%, with a contrast ratio of 1000:1.\n\nThe top bezel hosts the 1080p webcam, which is serviceable. This webcam is accompanied by a microphone that is ... bad. As per the speakers, they're surprisingly decent.\n\nThe keyboard is relatively small, or course, and certain keys don't have a standard size, but it also doesn't feel cramped. It's backlit, with 2 levels of brightness, and it feels surprisingly good to type on!\n\nKey travel is nice, not too shallow, the keys aren't mushy at all, they actuate really well, they're stable, and you won't get any missed presses. It also sounds pretty good.\n\nTHe touchpad is covered in glass, and it's super smooth, although it does pick up fingerprints like crazy. Gestures feel really good on this thing, and it's very precise and nice to use.\n\nSo by now, you probably figured out that the CPU isn't a beast.\nOn geekbench 5, it gets a single core score of 550, and a multi core score of 1544\n\nDay to day performance is pretty good, though, you'll rarely notice you're not using a more powerful CPU, even with a lot of browser tabs open, with a video playing in the background, the device stayed reactive, and didn't stutter.\n\nOf course, gaming on that thing isn't really an option.\n\nAt mid brightness, on power saver mode, playing youtube videos in a loop, over wifi, it lasted for 5 hours. With a more typical workload of web browsing, writing scripts, listening to music and the occasional youtube video, it lasted for 6 and a half hours.", "link": "https://www.youtube.com/watch?v=DxANDkM3O8g", "date_published": "2022-08-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]