[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Games Like Pokemon That Fans Should Check Out", "description": "From franchises like Monster Hunter to Final Fantasy, here are some games to play when you can't play anymore Pokemon.\n\n00:00 Intro\n00:40 Coromon\n01:18 Chocobo's Mystery Dungeon: Every Buddy!\n01:58 Ni No Kuni: Wrath of the White Witch\n02:45  Ooblets \n03:38 Monster Crown\n04:04 Monster Hunter Stories / Stories 2\n04:50 Monster Sanctuary \n05:27 Nexomon / Nexomon Extinction \n06:10 TemTem\n06:50 World of Final Fantasy: Maxima\n07:31 Outro\n\nStu here to break down some of the top games that scratch that “Gotta Catch Em’ All” itch. From big name franchises like Final Fantasy and Monster Hunter, to smaller indie teams like Ooblets and Temtem, these experiences all emulate some aspect of the Pokemon phenomenon. There is something for everyone here and although they could never be Pokemon, hopefully they can fill that Charizard sized hole in your heart until the next big release. The games on this list are available across all platforms from Playstation, to Nintendo Switch, to Xbox, and PC.\n\n#pokemon #gaming", "link": "https://www.youtube.com/watch?v=DTStbXkFWcc", "date_published": "2022-08-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Patch 1.06 Explained - Nerfs, Buffs, and Fixes", "description": "Elden Ring gets a substantial patch, a new Xbox Elite controller is on its way, and Skyrim gets a Nemesis System.\n#Gaming #EldenRing #Xbox \n\nElden Ring is getting some of its biggest changes yet, a new Xbox Elite controller could be coming soon, and Skyrim gets a fun mod. All this on today’s GameSpot News.\n\nA new patch for Elden Ring, 1.06, is now live, and it brings with it some massive adjustments. Previously in the game, you could only put down one summon sign at a time. Even leaving an area would be enough to stop the summon sign from functioning. With this newest patch, players can place multiple summon signs and invade larger areas. This means that it will be easier to pick up some PvP or run around the world while waiting to get summoned for a boss. \n\nThe oft-used and oft-maligned ash of war Bloodstone Step has been nerfed, with decreased distance and fewer invincibility frames, as well as growing less effective with repeated use. \n\nAnother notorious skill, Corpse Piler, now has decreased damage and blood buildup when hit with the blood portion of the attack. Damage caused by hitting enemies with the blade itself has only been slightly decreased. \n\nOther changes make Greatswords, Curved Greatswords, and Great Hammers quicker and an increased roll distance with a light equip load. The patch also fixes dozens of bugs and will now warn players if they are in possession of an unauthorized item such as Deathbed Smalls aka Fia’s underwear. Earlier this year a player ironically named Pantsu Dealer invaded worlds and left the cursed item behind for unsuspecting players to pick up. This resulted in tons of 180-day ban reports from users on Elden Ring’s subreddit. At least now you’ll know ahead of time to toss them because the ban hammer is dropped.  \n\nThe community response to the patch, thus far, has been overwhelmingly positive. Quote tweets and comments abound rejoice at the implemented nerfs and even the buffs to larger and heavier weapons.\n\nTIMESTAMPS: \n\n00:12 - Elden Ring 1.06 Patch\n02:03 - Xbox Elite Controller\n02:55 - Skyrim Nemesis Mod", "link": "https://www.youtube.com/watch?v=MccxCfRL_Wk", "date_published": "2022-08-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Monster Hunter Digital Event (August 2022)", "description": "Tune in to the Monster Hunter Rise: Sunbreak Digital Event for new info on the free Title Update 1, including a look at Lucent Nargacuga, Seething Bazelgeuse, and more.\n\nThis digital event is presented by Monster Hunter Series Producer Ryozo Tsujimoto and Game Director Yoshitake Suzuki.\n\n#monsterhunter #gaming", "link": "https://www.youtube.com/watch?v=oVxSLZ0Gqkk", "date_published": "2022-08-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Modern Warfare 2 Beta Explained - Dates, Maps, and Early Access | GameSpot News", "description": "Modern Warfare 2 beta info drops, we might be getting a new Tekken game, and Platoon 3 is getting a Nintendo direct.\n#Gaming #ModernWarfare2 #CallOfDuty\n\nA flood of new Call of Duty info, some exciting fighting game surprises, and more on today’s GameSpot News.\n\nAt this past weekend’s Call of Duty League World Championships - ‘grats LA Thieves - Infinity Ward announced dates for the Modern Warfare 2’s upcoming beta. \n\nThe beta will start on September 16th and 17th for PlayStation players via early access. Anyone on that platform that preorders the game, received a beta code during the world championship event, or receives them via online giveaways from Activision or partnered streamers, will have access at this time. On the 18th through the 20th of September, the beta becomes open to all PlayStation players.\n\nGamers on Xbox and PC can jump into their own early access period on September 22nd and 23rd, with the beta becoming available to all players on every platform September 24th through 26th. That means if you’re playing in early access on PlayStation, you have a full ten days of beta to sink your teeth into.\n\nNo modes were confirmed for the beta, but a new map, Marina Grand Prix, which looks to take place on a Formula 1 race track, was shown off and will be playable in September. We’re also hoping to see if Battle Maps will make an appearance which are COD MW 2’s larger scale modes including Ground War. \n\nBut that’s not all! Right before the beta kicks off, on September 15th, a Call of Duty Next event will take place. This will be when you will get your first real look at Modern Warfare 2’s multiplayer, Activision’s next iteration of Warzone, as well as a taste of Warzone for mobile. Yes, Call of Duty currently has a very popular mobile title, that does already include a battle royale mode, but it is something more akin to the BR that was packed in with Black Ops 4 Blackout than the much more popular, stand alone Warzone. \n\nOk, was that enough Call of Duty for you? I think that was enough Call of Duty for you. How about some Tekken?\n\nTIME CODES: \n00:09 - Modern Warfare 2\n01:54 - Tekken\n02:57 - Splatoon 3", "link": "https://www.youtube.com/watch?v=ObJuAgsHz9M", "date_published": "2022-08-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Tekken Official Teaser Announcement", "description": "A teaser for the next game in the beloved Tekken series dropped at EVO 2022. Is it Tekken 8? or something different? All will be revealed in time.\n\n#gaming #tekken8 #evo2022", "link": "https://www.youtube.com/watch?v=QX8ia2uYLtE", "date_published": "2022-08-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Street Fighter 6 - Kimberly & Juri Gameplay Reveal Trailer", "description": "Kimberly and Juri join the fight in this latest trailer for Street Fighter 6 from EVO 2022.\n\n#gaming #streetfighter6 #evo2022", "link": "https://www.youtube.com/watch?v=_CuS37pXhwY", "date_published": "2022-08-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]