[{"source": "https://www.computerworld.com/index.rss", "title": "Did Microsoft make a bad $69B bet on Activision Blizzard?", "description": "<article>\n\t<section class=\"page\">\n<p>“Those who cannot remember the past are condemned to repeat it,” the philosopher George Santayana warned 120 years ago. An even better-known philosopher, former Yankee catcher Yogi Berra, put it more succinctly: “It’s déjà vu, all over again.”</p><p>I’m referring to the antitrust battle Microsoft is waging with the US government over the company’s $69 billion agreement to buy game-maker Activision Blizzard. More than 30 years ago, Microsoft fought the feds in another antitrust suit over whether the software maker was using Windows’ monopolistic market share to kill competitors.</p><p>That one didn’t go well for Microsoft. It consumed the company’s attention for so long that it set the company adrift, setting off what is called Microsoft’s lost decade; it fell behind Apple, Google, Amazon, Facebook, and its stock price plummeted to half its previous worth.</p><p class=\"jumpTag\"><a href=\"https://www.computerworld.com/article/3683214/did-microsoft-make-a-bad-69b-bet-on-activision-blizzard.html#jump\">To read this article in full, please click here</a></p></section></article>", "link": "https://www.computerworld.com/article/3683214/did-microsoft-make-a-bad-69b-bet-on-activision-blizzard.html#tk.rss_all", "date_published": "2022-12-27 11:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.computerworld.com/index.rss", "title": "Handy PowerPoint keyboard shortcuts for Windows and Mac", "description": "<article>\n\t<section class=\"page\">\n<p>PowerPoint’s Ribbon interface is great for finding everything you might ever want to do in the presentation package — particularly things you don’t do frequently, like using the rehearse timing feature.</p><p>But if you’re looking to do common tasks fast, you’ll find keyboard shortcuts far more useful. Why bother to lift your hands from the keyboard if you want to open or close a presentation, apply formatting, or start a presentation?</p><p>There are keyboard shortcuts to accomplish a vast array of tasks in the PowerPoint desktop client, in both the Windows and Mac versions. (Fewer shortcuts are available for the Mac, but you can <a href=\"https://support.microsoft.com/en-us/office/create-a-custom-keyboard-shortcut-for-office-for-mac-6bbeb90e-96d9-4e03-b199-fc026ebdc321#:~:text=On%20the%20Tools%20menu%2C%20click,in%20the%20Current%20keys%20box.\" rel=\"nofollow noopener\" target=\"_blank\">create your own custom keyboard shortcuts</a> if you like.)</p><p class=\"jumpTag\"><a href=\"https://www.computerworld.com/article/3682669/handy-powerpoint-keyboard-shortcuts-for-windows-and-mac.html#jump\">To read this article in full, please click here</a></p></section></article>", "link": "https://www.computerworld.com/article/3682669/handy-powerpoint-keyboard-shortcuts-for-windows-and-mac.html#tk.rss_all", "date_published": "2022-12-27 11:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]