{"entries": [{"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/the-real-minimum-wage-is-zero-mcdonalds-restaurant-uses-automation-for-pickups-and-orders", "title": "‘The Real Minimum Wage Is Zero’: McDonald’s Restaurant Uses Automation For Pickups And Orders", "date_published": "2022-12-27 18:03:15+00:00", "description": "McDonald’s revealed a test restaurant near Fort Worth, Texas, earlier this month in which automation technology replaces many positions formerly held by employees, drawing mixed reactions from conservatives and liberals. The fast food behemoth announced that customers can use kiosks and a mobile app to grab their orders from a conveyor belt rather than interacting ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/southwest-ceo-calls-on-employees-to-get-it-together-amid-mass-cancellations", "title": "Southwest CEO Calls On Employees To Get It Together Amid Mass Cancellations", "date_published": "2022-12-27 17:55:33+00:00", "description": "Southwest Airlines CEO Bob Jordan called on employees to get it together as thousands of delays and cancellations left post-holiday travelers and their bags stranded in airports all across the country. According to a report from entertainment website TMZ, Jordan sent a message out to airline employees as reports of stranded travelers continued to pile ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/florida-investigates-alleged-sexually-explicit-performance-marketed-to-children-a-crime-in-florida", "title": "Florida Investigates Alleged ‘Sexually Explicit Performance Marketed To Children’: ‘A Crime In Florida’", "date_published": "2022-12-27 17:42:20+00:00", "description": "The state of Florida announced that it has launched an investigation over complaints that were made about an alleged sexually explicit performance that was marketed toward children earlier this month. The popular conservative Twitter account Libs of TikTok tweeted on December 21: &#8220;The same group who put on an extremely graphic &#8216;family-friendly&#8217; drag show which ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/breaking-supreme-court-rules-to-keep-title-42-in-place-indefinitely", "title": "BREAKING: Supreme Court Rules To Keep Title 42 In Place Indefinitely", "date_published": "2022-12-27 17:14:02+00:00", "description": "The U.S. Supreme Court ruled 5-4 Tuesday to keep the pandemic-era limit on immigration, referred to as Title 42, in place indefinitely, which allows officials to turn away migrants at the border to prevent the spread of COVID. Customs and Border Protection officials warned lawmakers that approximately 50,000 foreigners were waiting to cross into the ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/trump-world-warns-against-pushing-steve-scalise-for-house-speaker", "title": "Trump World Warns Against Pushing Steve Scalise For House Speaker", "date_published": "2022-12-27 16:57:13+00:00", "description": "House Republican Whip Steve Scalise (R-LA) is coming under fire over reports that he is quietly being prepped to make a run for House Speaker as House Minority Leader Kevin McCarthy (R-CA) looks to wrap up the remaining support that he needs to get the position next month. McCarthy is widely viewed as the Republican ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/it-is-a-miracle-jamie-lynn-spears-reveals-how-they-talk-about-daughters-near-death-accident-5-years-later", "title": "‘It Is A Miracle’: Jamie Lynn Spears Reveals How She Talks About Daughter’s Near-Death Accident 5 Years Later", "date_published": "2022-12-27 16:49:21+00:00", "description": "Actress Jamie Lynn Spears revealed how her family talks about daughter Maddie&#8217;s near-death accident five years later and said they don&#8217;t see it as an &#8220;accident anniversary&#8221; but a &#8220;miracle&#8221; one. The 31-year-old singer and sister of Britney Spears told Page Six that her 14-year-old daughter Maddie understands she is lucky to be alive after ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/texas-governor-rips-hypocrite-in-chief-joe-biden-after-busloads-of-migrants-arrive-at-veeps-residence", "title": "Texas Governor Rips ‘Hypocrite-In-Chief’ Joe Biden After Busloads Of Migrants Arrive At Veep’s Residence", "date_published": "2022-12-27 16:30:04+00:00", "description": "Texas Governor Greg Abbott hit back at President Joe Biden on Monday over criticism of a Texas program voluntarily relocating migrants at the U.S. southern border to sanctuary cities. Three buses filled with about 130 immigrants stopped and let their passengers off outside Vice President Kamala Harris’ official residence in Washington, D.C., on Christmas Eve ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/federal-employees-get-pay-boost-after-biden-executive-order", "title": "Federal Employees Get Pay Boost After Biden Executive Order", "date_published": "2022-12-27 16:26:57+00:00", "description": "President Joe Biden granted federal employees a raise as inflationary pressures and labor shortages pinch the bureaucracy. According to an executive order that will take effect on January 1, federal employees will receive an overall pay raise of 4.1%, as well as an average locality-based pay raise of 0.5%, indicating that some 2.1 million federal employees ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/piers-morgan-locked-out-after-hacker-takes-over-his-twitter-posts-private-messages-and-racial-slurs", "title": "Piers Morgan Locked Out After Hacker Takes Over His Twitter, Posts Private Messages And Racial Slurs", "date_published": "2022-12-27 16:26:08+00:00", "description": "British television host Piers Morgan became the apparent victim of hackers on Monday, when his personal Twitter account suddenly began spewing racial slurs and insulting people like singer Ed Sheehan and the late Queen Elizabeth II. The hackers removed Morgan&#8217;s profile photo and changed the way his name appeared several times — making it read ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/young-woman-trapped-inside-car-during-buffalo-blizzard-for-18-hours-found-dead", "title": "Young Woman Trapped Inside Car During Buffalo Blizzard For 18 Hours Found Dead", "date_published": "2022-12-27 16:01:02+00:00", "description": "A 22-year-old woman was found dead on Christmas Eve after being trapped inside her car for nearly a day during the historic blizzard in Buffalo, New York, last weekend. Anndel Taylor of Charlotte, North Carolina, was driving home from work on Friday afternoon when her car became stranded in the snowstorm for at least 18 ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/he-doesnt-give-a-s-while-americans-face-deadly-cold-snap-bidens-off-to-the-sunny-virgin-islands", "title": "‘He Doesn’t Give A S***’: While Americans Face Deadly Cold Snap, Biden’s Off To The Sunny Virgin Islands", "date_published": "2022-12-27 16:00:52+00:00", "description": "President Joe Biden and his wife Jill are being slammed for heading off on a New Year’s vacation to the Virgin Islands while Americans across the nation suffer freezing temperatures that have reportedly left at least 70 people dead, prompting outrage on social media. The Bidens’ destination, the Caribbean island of St. Croix, is currently ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/kim-kardashian-on-balenciaga-scandal-backlash-says-people-get-mad-no-matter-what-she-does", "title": "Kim Kardashian On Balenciaga Scandal Backlash, Says People Get Mad No Matter What She Does", "date_published": "2022-12-27 15:59:59+00:00", "description": "Kim Kardashian talked about the backlash she faced over her first comments on the Balenciaga scandal and said people will get mad at her no matter what she does. During the 42-year-old reality star&#8217;s appearance on the &#8220;Angie Martinez IRL Podcast,&#8221; the &#8220;Keeping Up With The Kardashians&#8221; alum said on Monday that even after she ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/colleges-ban-oil-and-gas-companies-from-recruiting-students", "title": "Colleges Ban Oil And Gas Companies From Recruiting Students", "date_published": "2022-12-27 15:50:39+00:00", "description": "Multiple universities in the United Kingdom have prohibited fossil fuel companies from recruiting students on campus in the name of battling climate change. Fossil Free Careers, a project led by the activist group People and Planet, demands that postsecondary institutions prevent companies in the “oil, gas, and mining industries” from attending careers fairs or listing ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/joe-rogan-tears-into-jimmy-kimmel-hes-done-some-pretty-outrageous-s-back-in-the-day-blackface", "title": "Joe Rogan Tears Into Jimmy Kimmel: ‘He’s Done Some Pretty Outrageous S*** Back In The Day … Blackface’", "date_published": "2022-12-27 15:46:51+00:00", "description": "Joe Rogan, host of &#8220;The Joe Rogan Experience,&#8221; ripped into &#8220;leftist&#8221; comedian Jimmy Kimmel during a recent episode of his show while he was discussing how wokeness kills comedy. &#8220;The problem with that kind of stuff is it continues to go in the same direction where more and more things become forbidden and toxic,&#8221; Rogan ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/you-think-george-santos-is-a-liar-wait-till-you-see-whos-in-the-white-house", "title": "You Think George Santos Is A Liar? Wait Till You See Who’s In The White House", "date_published": "2022-12-27 15:45:45+00:00", "description": "If you tuned into the news this week, you would think that Congressman-elect George Santos (R-NY) was the only liar to ever be elected to office. On Monday, he admitted that he &#8220;embellished&#8221; his education, his career, and even matters relating to his love life prior to winning this year&#8217;s Congressional election. In other words, ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/an-absolute-honor-j-j-watt-makes-shocking-announcement-hes-retiring-from-the-nfl", "title": "‘An Absolute Honor’: J.J. Watt Makes Shocking Announcement He’s Retiring From The NFL", "date_published": "2022-12-27 15:38:56+00:00", "description": "Arizona Cardinals star J.J. Watt made a shocking retirement announcement on Tuesday. The NFL star tweeted to his 5.6 million followers a picture of him holding his infant son Koa with his wife Kealia Watt after the Cardinals lost the Sunday game to the Tampa Bay Buccaneers 19-16 in overtime. &#8220;Koa&#8217;s first ever NFL game,&#8221; ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/judge-rejects-sanctions-against-kari-lake", "title": "Judge Rejects Sanctions Against Kari Lake", "date_published": "2022-12-27 15:37:04+00:00", "description": "A judge denied sanctions against Arizona Republican candidate Kari Lake in her recently tossed 2022 election lawsuit seeking to overturn the results of last month&#8217;s governor&#8217;s race. The ruling, issued Tuesday, is a blow to Arizona Governor-elect Katie Hobbs (D) and Maricopa County, who sought as much as $700,000 in penalties to cover the attorneys&#8217; ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/babylon-flops-hard-at-box-office-wont-recoup-80m-production-budget-report", "title": "‘Babylon’ Flops Hard At Box Office, Won’t Recoup $80M Production Budget: Report", "date_published": "2022-12-27 14:59:48+00:00", "description": "“Babylon” underperformed expectations at the box office over Christmas weekend, leaving industry insiders to speculate that the film won’t break even financially. Damien Chazelle’s $80 million historical comedy-drama about the golden age of Hollywood starring Brad Pitt and Margot Robbie certainly had hype and promotion behind it. But moviegoers opted not to buy tickets to ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/one-of-most-sacred-sites-for-jews-christians-to-be-fully-opened-to-public-miracle-pool-of-siloam", "title": "One Of Most Sacred Sites For Jews & Christians To Be Fully Opened To Public: ‘Miracle’ Pool Of Siloam", "date_published": "2022-12-27 14:48:39+00:00", "description": "The historic Pool of Siloam — the nearly three millennia-old public pool in the City of David in which Jewish pilgrims would purify themselves before journeying on to the Temple and which the New Testament records as the site where Jesus healed a blind man — is to be fully excavated and opened to modern-day ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/i-was-almost-in-tears-libs-of-tiktok-reveals-crazy-offer-from-ron-desantis", "title": "‘I Was Almost In Tears’: Libs Of TikTok Reveals ‘Crazy’ Offer From Ron DeSantis", "date_published": "2022-12-27 14:43:35+00:00", "description": "Chaya Raichik, owner of the popular Twitter account Libs of TikTok, revealed during a recent interview that when she was doxxed, Governor Ron DeSantis (R-FL) had stepped up to offer her help. Libs of TikTok had kept herself anonymous until The Washington Post&#8217;s Taylor Lorenz outed her, prompting a slew of threats directed at both ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/fda-could-regulate-cbd-amid-evidence-of-worrying-health-risks-report", "title": "FDA Could Regulate CBD Amid Evidence Of Worrying Health Risks: Report", "date_published": "2022-12-27 14:41:32+00:00", "description": "The Food and Drug Administration is beginning to examine whether cannabidiol, the cannabis extract also known as CBD, is safe in food and supplements, according to a report from the Wall Street Journal. “Given what we know about the safety of CBD so far, it raises concerns for FDA about whether these existing regulatory pathways ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/numb-the-pain-drew-barrymore-shares-what-happened-that-made-her-decide-to-stop-drinking", "title": "‘Numb The Pain’: Drew Barrymore Shares What Happened That Made Her Decide To Stop Drinking", "date_published": "2022-12-27 14:41:23+00:00", "description": "Hollywood star Drew Barrymore said she went through &#8220;excruciating&#8221; pain following her divorce from art advisor Will Kopelman and credits her kids with helping her find sobriety. In a wide-ranging interview, the 47-year-old actress spoke to People magazine about fighting for her family after her split from Kopelman in 2016, calling the year that followed &#8220;cripplingly ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/taiwan-extends-compulsory-military-service-amid-rising-china-threat", "title": "Taiwan Extends Compulsory Military Service Amid Rising China Threat", "date_published": "2022-12-27 14:37:05+00:00", "description": "Taiwan will extend its mandatory military service requirement from four months to one year beginning in 2024, President Tsai Ing-wen announced Tuesday.  The extension comes amid increased provocations and threats from China in the past year. On Sunday, China sent 71 warplanes around Taiwan in what the People&#8217;s Liberation Army called a “strike drill,&#8221; in ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/amid-intraparty-gop-fight-will-jim-jordan-sneak-in-as-house-speaker", "title": "Amid Intraparty GOP Fight, Will Jim Jordan Sneak In As House Speaker?", "date_published": "2022-12-27 14:29:46+00:00", "description": "The 118th Congress hasn&#8217;t even convened yet and already the Republicans are in disarray. The GOP took control of the House in the midterm elections, but just barely: they hold a 222-213 edge over Democrats. Now they have to pick a speaker, but that&#8217;s proven to be far harder than anyone could have predicted. While ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/james-cameron-cut-10-minutes-of-guns-from-new-avatar-flick-over-fears-hed-fetishize-firearms", "title": "James Cameron Cut 10 Minutes Of Guns From New ‘Avatar’ Flick Over Fears He’d ‘Fetishize’ Firearms", "date_published": "2022-12-27 13:55:44+00:00", "description": "***This article contains spoilers*** Director James Cameron cut ten full minutes from his latest film, &#8220;Avatar: The Way of Water&#8221; — which still clocks in at a lengthy three hours and 12 minutes — because he was afraid that scenes featuring guns would &#8220;fetishize&#8221; firearms. Cameron made the comments during an interview published by Esquire: ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/its-nothing-to-play-with-rgiii-urges-dolphins-qb-to-sit-out-season-after-latest-hit-to-head", "title": "‘It’s Nothing To Play With’: RGIII Urges Dolphins QB To Sit Out Season After Latest Hit To Head", "date_published": "2022-12-27 13:17:09+00:00", "description": "After Miami Dolphins quarterback Tua Tagovailoa’s head hit the ground hard after being tackled by the Green Bay Packers’ Kingsley Enagbare on Christmas Day, Robert Griffin III, former star quarterback for the Washington Redskins, urged Tagovailoa to sit out the rest of the season because of concussion risk. This is the play circling on social ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/video-of-trans-woman-bowled-over-from-first-intense-period-goes-viral-notice-the-smirk", "title": "Video Of Trans Woman Bowled Over From ‘First Intense Period’ Goes Viral: ‘Notice The Smirk’", "date_published": "2022-12-27 13:01:55+00:00", "description": "The internet is ablaze with commentary after a video of a trans-identifying biological male alleging to be experiencing menstrual cramps went viral.  The video was originally shared to Twitter with the caption, “This clown is acting like getting period pain.” It has racked up over 5 million views as of Tuesday morning. “Trans girl experiences ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/whitmer-kidnapping-plotter-sentenced-to-16-years-in-prison", "title": "Whitmer Kidnapping Plotter Sentenced To 16 Years In Prison", "date_published": "2022-12-27 12:42:15+00:00", "description": "A federal judge sentenced Adam Fox, convicted in August of conspiring to kidnap Democratic Michigan Gov. Gretchen Whitmer, to 16 years in prison on Tuesday. Fox was one of the ringleaders of the plan against the governor, prosecutors said. The scheme was stopped by federal agents who infiltrated Fox’s circle during a roughly 10-month investigation. ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/lgbt-activists-praise-spice-girls-singer-mel-c-for-canceling-poland-nye-show", "title": "LGBT Activists Praise Spice Girls Singer Mel C For Canceling Poland NYE Show", "date_published": "2022-12-27 12:23:53+00:00", "description": "Spice Girls singer Mel C canceled her scheduled New Year’s Eve performance in Poland, which prompted LGBT activists to celebrate her decision. The 48-year-old British singer did not specify her reason for canceling the show. Still, followers were convinced that she decided to pull out because of Poland’s anti-LGBT stance. &#8220;In light of some issues ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/chers-ring-pic-fuels-engagement-rumors-with-boyfriend-who-is-40-years-younger", "title": "Cher’s Ring Pic Fuels Engagement Rumors With Boyfriend Who Is 40 Years Younger", "date_published": "2022-12-27 11:46:53+00:00", "description": "Cher is sparking engagement rumors after posting a photo of a giant diamond ring. The 76-year-old singer shared a Twitter post on Christmas day marveling at the glittering jewelry, which was a gift from her boyfriend, Alexander “AE” Edwards.  &#8220;THERE R NO WORDS,&#8221; Cher wrote in the post caption, followed by her boyfriend’s name. After ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/heres-when-gas-prices-could-return-to-4-per-gallon-according-to-new-projection", "title": "Here’s When Gas Prices Could Return To $4 Per Gallon, According To New Projection", "date_published": "2022-12-27 11:33:07+00:00", "description": "Gas prices could near or surpass $4.00 per gallon as soon as next May, according to data from GasBuddy shared with CNN. The national average price for gasoline is currently $3.10 per gallon, according to data from AAA. Prices surpassed $5.00 per gallon in June; although costs are not projected to reach such levels, they ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/russian-sausage-tycoon-whose-whatsapp-account-criticized-ukraine-invasion-dies-in-fall-from-hotel-window", "title": "Russian Sausage Tycoon Whose WhatsApp Account Criticized Ukraine Invasion Dies In Fall From Hotel Window", "date_published": "2022-12-27 11:30:04+00:00", "description": "Another Russian tycoon who may have criticized the invasion of Ukraine has died under mysterious circumstances. Sausage magnate and politician Pavel Antov, who last summer denied being critical of the Kremlin, was found dead Sunday at a hotel in Rayagada, in India’s eastern state of Odisha, after apparently falling from a window. Antov, who was ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/watch-bills-players-have-to-dig-out-their-cars-after-returning-to-buffalo-following-massive-winter-storm", "title": "WATCH: Bills Players Have To Dig Out Their Cars After Returning To Buffalo Following Massive Winter Storm", "date_published": "2022-12-27 10:58:35+00:00", "description": "Buffalo Bills players just wanted to get home to their families on Christmas Day, but a winter storm that slammed western New York made that a little more difficult than usual.  The Bills had a successful weekend in Chicago, beating the Bears handily after a second-half offensive surge on Christmas Eve. But when players got ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/top-biden-official-pushed-big-tech-to-censor-misinformation-on-trans-care-for-minors-video-shows", "title": "Top Biden Official Pushed Big Tech To Censor ‘Misinformation’ On Trans ‘Care’ For Minors, Video Shows", "date_published": "2022-12-27 10:53:51+00:00", "description": "U.S. Assistant Secretary for Health Rachel Levine, who identifies as a transgender female, advocated for Big Tech censorship of “misinformation” related to “gender-affirming care,&#8221; a surfaced video shows. Levine, the first transgender federal official to be confirmed by the Senate, has in the past advocated for transgender &#8220;care&#8221; of minors, which opponents highlight is often irreversible ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/thousands-stranded-as-southwest-cancels-two-thirds-of-post-christmas-flights", "title": "Thousands Stranded As Southwest Cancels Two-Thirds Of Post-Christmas Flights", "date_published": "2022-12-27 10:31:10+00:00", "description": "Travelers returning from Christmas excursions were stranded across the country as Southwest Airlines canceled more than two-thirds of its flights, drawing the attention of government officials. Southwest nixed 2,909 flights on Monday, accounting for 71% of the company’s volume, according to data from FlightAware, far surpassing other major carriers. Southwest also canceled 2,536 flights on ...", "persistent": false, "language": "en-US"}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/trump-claims-he-asked-ivanka-husband-not-to-be-part-of-24-campaign", "title": "Trump Claims He Asked Ivanka, Husband Not To Be Part Of ’24 Campaign", "date_published": "2022-12-27 09:31:33+00:00", "description": "More than a month after Ivanka Trump was a no-show at her father&#8217;s announcement that he would seek the presidency again, Donald Trump says he actually asked her and her husband Jared Kushner not to join his campaign. Ivanka, who bore the title of senior presidential adviser during her father&#8217;s term in the White House, ...", "persistent": false, "language": "en-US"}], "source": {"url": "https://www.dailywire.com/feeds/rss.xml", "title": "Daily Wire"}}