{"entries": [{"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-27/ukraina-kijow-zareagowal-na-slowa-orbana-wegry-patologicznie-lekcewaza-nasz-kraj/", "title": "Ukraina. Kijów zareagował na słowa Orbana. \"Węgry patologicznie lekceważą nasz kraj\"", "date_published": "2022-12-27 19:44:00+00:00", "description": "Ukraińskie MSZ stwierdziło, że wypowiedzi premiera Węgier pokazują jego polityczną krótkowzroczność. Przekazano, że stanowisko Viktora Orbana świadczy o patologicznym lekceważeniu Ukrainy i narodu ukraińskiego. Kijów odniósł się do wypowiedzi premiera Węgier, który powiedział, że Ukraina może walczyć tylko tak długo, jak długo Stany Zjednoczone wspierają ją, przekazując broń i pieniądze.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-27/przepowiednie-nostradamusa-na-2023-rok-iii-wojna-swiatowa-walka-z-antychrystem-i-kometa/", "title": "Przepowiednie Nostradamusa na 2023 rok: III wojna światowa, walka z antychrystem i kometa", "date_published": "2022-12-27 19:33:00+00:00", "description": "Na 2023 rok Nostradamus wieszczy katastrofy, które mogą zachwiać światem, jaki znamy - przekazują media. W jego wizjach znalazła się kometa, która będzie jak niebiański ogień na królewskim gmachu. Nostradamus to XVI-wieczny astrolog, któremu przypisuje się przepowiedzenie pożaru Londynu, dojścia Hitlera do władzy, ataki z 11 września 2001 roku i pandemię COVID-19.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-27/eksperci-ostrzegaja-przez-grozna-bakteria-w-wielkiej-brytanii-z-powodu-powiklan-zmarly-94-osoby/", "title": "Eksperci ostrzegają przez groźną bakterią. W Wielkiej Brytanii z powodu powikłań zmarły 94 osoby", "date_published": "2022-12-27 18:05:00+00:00", "description": "Amerykańskie Centra Kontroli i Zapobiegania Chorobom poinformowały, że śledzą możliwy wzrost liczby inwazyjnych paciorkowców grupy A wśród dzieci. W Wielkiej Brytanii z powodu powikłań spowodowanych zakażeniem tą bakterią zmarły co najmniej 94 osoby.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-27/szkocja-myslala-ze-jej-syn-od-lat-nie-zyje-odnalazl-sie-caly-i-zdrowy-we-francji/", "title": "Szkocja: Myślała, że jej syn od lat nie żyje. Odnalazł się cały i zdrowy we Francji", "date_published": "2022-12-27 17:06:00+00:00", "description": "Matka myślała, że ​​jej syn zmarł po tym, jak zaginął ponad 10 lat temu we Francji. Okazało się, że mężczyzna żyje. - To jak ten film Cud na 34. ulicy. To jak cud - powiedziała kobieta.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-27/putin-podarowal-swoim-sojusznikom-pierscienie-media-widza-podobienstwa-do-prozy-tolkiena/", "title": "Putin podarował swoim sojusznikom pierścienie. Media widzą podobieństwa do prozy Tolkiena", "date_published": "2022-12-27 15:47:00+00:00", "description": "Przywódcy krajów postsowieckich podczas szczytu Wspólnoty Niepodległych Państw (WNP) dostali od Władimira Putina pamiątkowe pierścienie - przekazały media. Niektórzy widzą w tym geście nawiązanie do Władcy Pierścieni. Przeczytaliśmy Tolkiena i mamy dla Putina złe wiadomości - odpowiedziała Służba Bezpieczeństwa Ukrainy.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-27/wstrzasajace-nagranie-uchwycono-moment-zasypania-narciarzy-przez-lawine-sniezna/", "title": "Wstrząsające nagranie. Uchwycono moment zasypania narciarzy przez lawinę śnieżną", "date_published": "2022-12-27 12:44:00+00:00", "description": "25 grudnia śnieżna lawina porwała 10 narciarzy zjeżdżających zboczem góry u podnóża szczytu Trittkopf (2720 m n.p.m.) w zachodniej Austrii. Do akcji ratunkowej przystąpiło około 200 ratowników i kilka helikopterów. Na szczęście wszyscy poszkodowani przeżyli - cztery osoby zostały ranne, w tym jedna ciężko. W mediach społecznościowych pojawiło się nagranie z tego zdarzenia.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-27/wielka-brytania-urodzila-dziecko-w-lesie-i-zostawila-je-w-szalasie-26-latka-z-zarzutami/", "title": "Wielka Brytania. Urodziła dziecko w lesie i zostawiła je w namiocie. 26-latka z zarzutami", "date_published": "2022-12-27 12:43:00+00:00", "description": "26-letnia Brytyjka urodziła dziecko w lesie, a malucha zostawiła w namiocie. O zajściu powiadomiła policję, ale początkowo błędnie wskazała miejsce, gdzie znajduje się noworodek. Służby odnalazły w końcu dziecko, które trafiło do szpitala. Nieodpowiedzialna matka usłyszała już zarzuty.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-27/usa-22-latka-zamarzla-w-aucie-przed-smiercia-wyslala-rodzinie-film/", "title": "USA. 22-latka zamarzła w aucie. Przed śmiercią wysłała rodzinie film", "date_published": "2022-12-27 11:34:00+00:00", "description": "Co najmniej 60 osób zginęło podczas burz śnieżnych, które nawiedziły Stany Zjednoczone. Część osób zamarzła w zaspach albo autach, kiedy podczas zamieci utknęli w śniegu i czekali na pomoc. Wśród ofiar jest 22-letnia Anndel. Kobieta przed śmiercią wysłała wideo swojej rodzinie.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-27/na-naszej-twarzy-zyja-ich-tysiace-kopuluja-skladaja-jaja-i-umieraja-w-20-dni/", "title": "Na naszej twarzy żyją ich tysiące. Kopulują, składają jaja i umierają w 20 dni", "date_published": "2022-12-27 10:09:00+00:00", "description": "Nużeniec (Demodex) to pasożyt z rodzaju roztoczy żyjących na ludzkiej skórze - głównie na twarzy. Ten mikroskopijny pajęczak mieszka w porach, a wydzielane w nich woskowe sebum jest jego ulubionym posiłkiem. Według najnowszych badań nosicielami nużeńców prawdopodobnie jest większość ludzi, chociaż analiza ich DNA każe sądzić, że ich kres jest bliski.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-27/wojna-w-ukrainie-wolodymyr-zelenski-9-mln-osob-pozostaje-bez-pradu/", "title": "Wojna w Ukrainie. Wołodymyr Zełenski: 9 mln osób pozostaje bez prądu", "date_published": "2022-12-27 08:36:00+00:00", "description": "Prawie dziewięć milionów osób w Ukrainie pozostaje bez prądu - przekazał w poniedziałek wieczorem prezydent Wołodymyr Zełenski. Dodał, że w związku z sytuacją w energetyce i infrastrukturze spotkał się z przedstawicielami rządu, by przygotować się na kolejny rok.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-27/usa-tragiczny-bilans-swiat-burze-sniezne-zabily-60-osob/", "title": "USA. Zamarzali w zaspach i autach. Śnieżyce zabiły co najmniej 60 osób", "date_published": "2022-12-27 07:27:00+00:00", "description": "Co najmniej 60 osób zginęło w związku ze śnieżycami, które w okresie świątecznym nawiedziły Stany Zjednoczone. Część osób zamarzła w zaspach lub przysypana śniegiem w swoich samochodach. Władze mówią o najgorszych burzach śnieżnych od prawie 50 lat.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-27/rosja-przepowiednie-miedwiediewa-na-nowy-rok-2023-wspomina-polske/", "title": "Rosja. \"Przepowiednie\" Miedwiediewa na nowy rok 2023. Wspomina Polskę", "date_published": "2022-12-27 06:49:00+00:00", "description": "Powrót Wielkiej Brytanii do UE i rozpad Unii, wojna domowa w USA i powstanie IV Rzeszy - to tylko część wydarzeń, do których może dojść w 2023 roku według byłego prezydenta i premiera Rosji Dmitrija Miedwiediewa. Polityk przedstawił też przyszłość Polski.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-27/lawrow-propozycje-dotyczace-demilitaryzacji-i-denazyfikacji-ukrainy-sa-dobrze-znane-kijowowi/", "title": "Ławrow: Propozycje dotyczące \"demilitaryzacji\" i \"denazyfikacji\" Ukrainy są dobrze znane Kijowowi", "date_published": "2022-12-27 05:14:00+00:00", "description": "Propozycje Moskwy dotyczące demilitaryzacji i denazyfikacji Ukrainy są dobrze znane Kijowowi i to do władz ukraińskich należy ich realizacja, w przeciwnym razie armia rosyjska rozstrzygnie tę kwestię - powiedział szef rosyjskiej dyplomacji Siergiej Ławrow.", "persistent": false, "language": "pl-PL"}], "source": {"url": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Polsat News"}}