[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Post covid Alzheimer's", "description": "69% higher risk of Alzheimer's for older COVID survivors\n\nhttps://www.cidrap.umn.edu/news-perspective/2022/09/possible-69-higher-risk-alzheimers-older-covid-survivors\n\nOlder COVID-19 survivors,\n\n69% higher risk of developing Alzheimer's disease,\n\nwithin 1 year of infection\n\nMedical records of 6,245,282 \n\n65 years and older\n\nMedical visits but no previous diagnosis of Alzheimer's disease\n\nFebruary 2020 to May 2021\n\n410,748 participants tested positive for COVID-19\n\n5,834,534 did not test positive\n\nCOVID-19 survivors had a 69% higher risk of a new diagnosis of Alzheimer's disease within 1 year of infection than their uninfected peers\n\nHazard ratio 1.69; 95% (1.53 to 1.72)\n\nMost at risk\n\nAges 85 and older, HR = 1.89\n\nWomen, HR = 1.82\n\nAssociation of COVID-19 with New-Onset Alzheimer’s Disease\n\nhttps://content.iospress.com/articles/journal-of-alzheimers-disease/jad220717\n\nJournal of Alzheimer's Disease, vol. 89, no. 2, pp. 411-414, 2022\n\n13th September 2022\n\nInfectious etiology of Alzheimer’s disease, postulated for decades\n\nSo, is SARS-CoV-2 infection associated with increased risk for Alzheimer’s disease?\n\nRetrospective cohort study\n\nN = 6,245,282 older adults (age ≥65 years),\n\nPeople with COVID-19 were at significantly increased risk for new diagnosis of Alzheimer’s disease\n\nWithin 360 days after the initial COVID-19 diagnosis \n\nPropensity-score matching\n\nCOVID-19 cohort = 0.68%\n\nnon-COVID-19 cohort = 0.35%\n\n(hazard ratio or HR:1.69)\n\nTriNetX Analytics Platform\n\nde-identified electronic health records\n\nOver 95 million patients\n\nInpatient and outpatient visits\n\n68 health care organizations\n\n28% of the US population\n\n50 states, covering diverse geographic, age, race/ethnic, income, and insurance groups \n\nOur findings call for research to understand the underlying mechanisms and for continuous surveillance of long-term impacts of COVID-19 on Alzheimer’s disease\n\nNot clear whether COVID-19 triggers or accelerates development of Alzheimer's disease\n\nSARS-CoV-2 has been associated with inflammation and central nervous system disorders\n\nPrior infections, especially viral infections, and inflammation\n\nDr. Pamela Davis\n\nWe thought we had turned some of the tide on it by reducing general risk factors such as hypertension, heart disease, obesity and a sedentary lifestyle\n\nNow, so many people in the U.S. have had COVID and the long-term consequences of COVID are still emerging.\n\nIt is important to continue to monitor the impact of this disease on future disability\n\nPlan to continue studying the potential effects of COVID-19 on Alzheimer's,\n\nand other neurodegenerative diseases,\n\nwhether certain populations may be especially vulnerable\n\nAssess, any drugs could be repurposed to treat COVID-19's long-term effects", "link": "https://www.youtube.com/watch?v=M5ExGpJS_PA", "date_published": "2022-09-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]