[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Madison Cunningham: Tiny Desk Concert", "description": "Jewly Hight | August 3, 2022\nMadison Cunningham looked thoroughly put together behind the Tiny Desk in her white satin pantsuit and powder blue blouse, but her performance didn't seem at all buttoned-up. The clear leader of her band of crack, Southern California musicians — keyboardist Philip Krohnengold, bassist Daniel Rhine and drummer Kyle Crane — she was also our audacious guide, steering us toward exploration with the shrewd parts she played on three different guitars over the course of four songs.\n\nA West Coast native herself, she's learned well the liberating lessons of Joni Mitchell and much more recent predecessors like Fiona Apple, Andrew Bird and Chris Thile, who welcomed her into a scene that celebrates the splintering of familiar folk, indie rock and singer-songwriter song forms.\n\nThe songs that Cunningham selected for her Tiny Desk, culled from her third album, Revealer — out in early September — are alive with new sensations. She opens with \"All I've Ever Known,\" and makes the confession of an artist only getting started, but powerfully awake to possibility: \"I'm afraid of what I don't know.\" \"Hospital,\" a song whose wiry, tunefully loopy vocal lines and guitar licks stayed lodged in my head for days, transforms a setting that's become a symbol of doom into somewhere that she could face her own overstimulated extremes.\n\nThe other musicians left Cunningham alone behind the desk to conclude with her quietly riveting song \"Life According To Raechel,\" written after her grandmother passed, she tells us. Eyes closed, Cunningham took in the loss like she knew it would be the first of many.\n\nSET LIST\n\"All I've Ever Known\"\n\"Hospital\"\n\"In From Japan\"\n\"Life According To Raechel\"\n\nMUSICIANS\nMadison Cunningham: vocals, guitar\nKyle Crane: drums\nPhilip Krohnengold: keys\nDaniel Rhine: bass\n\nTINY DESK TEAM\nProducer/Creative Director: Bob Boilen\nAudio Engineer: Josh Rogosin\nDirector: Kara Frame\nSeries Producer: Bobby Carter\nEditor: Michael Zamora\nVideographers: Joshua Bryant, Kara Frame, Michael Zamora\nProduction Assistants: Jill Britton, Joby Tanseco\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=3944VpVVKCI", "date_published": "2022-08-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]