[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Steam Deck Reservations Available Following Production Increase | GameSpot News", "description": "Steam Deck is coming to new regions of the world and the next version of the Switch is still a ways away. \n#GamingNews #SteamDeck #NintendoSwitch\n\nValve has partnered with Komodo for distribution of Steam in four new countries: Japan, South Korea, Hong Kong and Taiwan. These new reservations will not impact existing NA/UK/EU reservation timelines. So if you're in Q3 or Q4, you'll still be in those queue groups with the same estimated delivery dates. You can expect to see Steam Deck at BitSummit in Kyoto and September's Tokyo Game Show.\n\nIn other Steam Deck news, the latest update for the device, version 3.3, warns users about excessive heat and cold affecting the unit, which can impact performance. Officially, Valve has warned Steam Deck owners that the optimal temperature for the unit is between 0–35°C/32-95°F. Going beyond those numbers will see performance throttled, as the internal AMD APU chip runs hot to begin with.\n\nAnd since we’re on the subject of handhelds with big screens, let's talk about the Switch. \n\nNintendo will likely not be announcing any new hardware or the long-rumored Switch Pro console this year, a new report has revealed. According to a new article by Nikkei, Nintendo is currently focused entirely on building Switch consoles with the component parts that it has been able to secure and is aiming to ship 21 million Switch units during the fiscal year that ends in March 2023. Due in part to the ongoing semiconductor shortage, Switch sales declined this year by 22.9% compared to the previous fiscal year. The system has still been a successful product for Nintendo, and lifetime sales currently sit at 111.08 million units. \n\nSTAMPS\n00:00 - Intro\n00:07 - Steam Deck\n00:45 - Steam Deck Update\n02:10 - Switch Pro", "link": "https://www.youtube.com/watch?v=z64NOhCqqwE", "date_published": "2022-08-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Leaked Modern Warfare 2 Photos Confirm New Multiplayer Mode ‘DMZ’ | GameSpot News", "description": "Images of Modern Warfare 2’s multiplayer and rumored unannounced mode DMZ have surfaced online and Pokemon Scarlet and Violet get a new trailer and more details.\n#GamingNews #ModernWarfare2 #Pokemon\n\nA kicker for the LA Rams, shared an image of the Modern Warfare 2 menu on Instagram Stories and captioned the image, \"Having fun on the new Call of Duty.\" Another player posted a slightly blurry photo, saying they were previewing the unreleased game, but the image still clearly says \"DMZ\" in the top right-hand corner of the screen.The images have since been deleted, but sites like CharlieIntel and ModernWarzone were quick to capture and tweet out their existence. Call of Duty insiders have long suggested the existence of DMZ, which is said to be Modern Warfare 2's extraction-based mode inspired by Escape from Tarkov. The leaks describe DMZ as an open-world mode with a mix of battle royale and survival game elements, and the mode has reportedly been in development for four years.\n\nToday the Pokemon Company revealed more details about its November games, Pokemon Scarlet and Violet. The game takes place in the Paldea region, which players will travel across using the two legendary Pokemon Koraidon and Miraidon. The new trailer also shows off how versatile the new legendaries are; both can be used for travel by air, land and sea. The story centers on a Pokemon academy, where the main character is a student who sets out to explore the world.\n\nBut that's not all, because we also learned about Scarlet and Violet’s new gameplay mechanic, Terastallize, which transforms a pocket monster into a crystal version of itself with boosted stats. Each Pokemon in the Paldea region gets a unique gem-like look when subjected to Terastallizing, and some Pokemon will change type as well. According to the Pokemon Company, there are 18 types that form a wide number of combinations of Pokemon and Tera Types, and players can Terastallize a Pokemon once per battle.\n\nSTAMPS\n00:00 - Intro\n00:07 - Modern Warfare 2\n01:53 - Pokemon Scarlet & Violet", "link": "https://www.youtube.com/watch?v=WXyK6enUA5g", "date_published": "2022-08-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Presents Full Presentation (08.03.2022)", "description": "Checkout the full Pokémon Presents for August 3rd, 2022 with updates on Pokémon apps and video games, including Pokémon Scarlet and Pokémon Violet!\n\n#Pokémon #pokemonscarlet #pokemonviolet\n\nTimestamps:\n00:00 - Intro\n00:21 - Pokémon World Championships 2022\n03:00 - Pokémon GO FEST 2022\n04:42 - Pokémon Unite\n06:22 - Pokémon Masters EX\n07:12 - Pokémon Café Remix\n09:13 - Pokémon Scarlet and Violet", "link": "https://www.youtube.com/watch?v=Cm0MCwBgtBg", "date_published": "2022-08-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Scarlet & Pokémon Violet - World Overview Gameplay Presentation", "description": "#Pokémon #pokemonscarlet #pokemonviolet\n\nNintendo revealed more info about Pokemon Scarlet and Violet, featuring a new region called Paldea and a spooky occurrence named Terastallization. Pokemon Scarlet and Violet will be available November 18th.", "link": "https://www.youtube.com/watch?v=Qnq6Wizm538", "date_published": "2022-08-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Scarlet & Pokémon Violet Paldea Region Official Trailer", "description": "The new Pokémon Scarlet & Pokémon Violet just dropped! Learn about the brand new Paldea region, where your next Pokémon adventure will take place.\n\n #Pokémon #pokemonscarlet #pokemonviolet", "link": "https://www.youtube.com/watch?v=VoSVc1TWXjg", "date_published": "2022-08-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xenoblade Chronicles 3 Ultimate Combat Guide", "description": "Xenoblade Chronicles 3 can be overwhelming. Fortunately, Jake has you covered with this in-depth combat guide covering everything from Fusion Arts to Chain Attacks.\n#nintendo #xenobladechronicles3 #guide \n\nIn this guide Jake will go over basic mechanics like Arts and auto-attacks, and dig into more complex moves like Fusion Arts and Ouroboros Orders. Here are all the concepts Jake covers:\n\n00:00 - Intro\n00:29 - Classes\n01:10 - Auto-attacks\n01:30 - Arts\n02:18 - Positioning\n03:02 - Combos\n05:10 - Talent Arts\n05:41 - Recap\n05:56 - Master Arts\n06:33 - Fusion Arts\n07:29 - Interlinks\n09:01 - Chain Attacks\n11:03 - Ouroboros Orders\n12:05 - Outro\n\nIf you have questions drop them in the comments or reach out to Jake on Twitter (@jacobdekk).", "link": "https://www.youtube.com/watch?v=oVkICGL2IWQ", "date_published": "2022-08-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]