[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Samora Pinderhughes: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nNikki Birch | April 15, 2022\nThe opening piano notes are barely sufficient warning to brace for the sweet and powerful voices that transport us to Samora Pinderhughes' Tiny Desk (home) concert, shot on film. \"The Cry\" heralds our journey into the Bay Area native's sophomore album, GRIEF. The vocalists move briefly out of frame for \"Masculinity,\" a probing, open letter that addresses masculine stereotypes with directness and compassion. The song blooms beautifully, with Pinderhughes accompanied by strings, a background chorus, and his sister, renowned flutist Elena Pinderhughes.\n\nBetween tunes, Pinderhughes greets us and shares that the setting for this Tiny Desk (home) concert is his exhibition, \"The Healing Project,\" at Yerba Buena Center for the Arts in San Francisco. Five years in the making, the project explores trauma and healing from structural violence with conversations, film, music and art created by incarcerated artists, including the artist Pitt Panther. Pinderhughes then plays \"Holding Cell,\" a dedication to those behind the walls. For his next song, Pinderhughes leads us to a blue space, a memorial shrine with candles, offerings and dedications, where we encounter the haunted pleas of \"Grief.\"\n\nPinderhughes' ability to be vulnerable makes his music incredibly intimate. He reminds us of this quiet strength once again as he introduces the last song in his set, \"Process,\" with some final thoughts: \"I think a lot of times we get a message that we should just succeed or triumph over something that's difficult in our life, particularly things like depression or grief or anxiety. But sometimes it's about living alongside those things and just taking it one day at a time.\"\n\nSET LIST\n\"The Cry / Masculinity\"\n\"Holding Cell\"\n\"Grief\"\n\"Process\"\n\nMUSICIANS\nSamora Pinderhughes: vocals, piano, keyboard\nNio Levon: vocals, vocal arrangements\nElliott Skinner: vocals, guitar\nJehbreal Muhammad Jackson: vocals\nDani Murcia: vocals \nElena Pinderhughes: flute\nClara Kim: violin\nGiancarlo Latta: violin\nCarly Scena: viola\nSaul Richmond-Rakerd: cello\n\nCREDITS\nDirector: Christian Padron \nCinematographer: Jon Harrison\nAudio Engineer: Jack DeBoe \nProducers: Christian Padron, Samora Pinderhughes, Jesse Sachs, Hana Mogulescu\nCreative Direction: Samora Pinderhughes, & Christian Padron\nEditor: Christian Padron\n1st AC: Linhdan Le\n2nd AC: Nam Anh Nguyen\nGaffer: Carlos Gonzalez\nPD/Grip: Irene Peng\nShot on Kodak Film\nFilmed in \"The Healing Project\" exhibition at Yerba Buena Center for the Arts\nVisual Pieces in Exhibition by Samora Pinderhughes, Pitt Panther, Emeka Ekwelum, Josh Begley, Christian Padron, Vashni Korin, Daniel Pfeffer, Christopher Burch, Nico Cary, Eli Marienthal, Raquel Pinderhughes, Dwayne Betts and Titus Kaphar.\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Kara Frame, Joshua Bryant\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Michael Zamora, Maia Stern, Ashley Pointer\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #samorapinderhughes", "link": "https://www.youtube.com/watch?v=ICUoG54pIW0", "date_published": "2022-04-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]