[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "\"We're Machine Gun Heavy\" - Firearms Expert Reacts To MORE Squad Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down more of the weaponry of Squad, including the Carl Gustav M2, the F89 Minimi and a couple of different AK variants.\n\n#GameSpot #Gaming #ExpertReacts #Squad\n\n0:00 - Opening\n0:37 - L7A2 GPMG\n04:04 - EF88\n05:47 - HK417\n07:25 - AK-74M & AKS-74\n09:23 - Carl Gustav M2\n11:17 - M110 SASS\n12:39 - F89 Minimi\n14:30 - Maximi\n16:29 - RPD\n18:03 - SKS\n20:36 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down more of the guns of Squad and  compares them to their real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=nzkNNvnvIWk", "date_published": "2022-05-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Alleged Silent Hill Screenshot Leak Explained | GameSpot News", "description": "Alleged Silent Hill screenshots get taken down by copyright claim and Star Wars Jedi: Fallen Order sequel may be called Star Wars Jedi: Survivor. \n#GamingNews #SilentHill #StarWars\n\nFour alleged Silent Hill images leaked by a Twitter user called Aesthetic Gamer have since been taken down by a DMCA request. In their original tweet, Aesthetic Gamer wrote that their source had given them enough proof to believe the shots were real. Over on ResetEra, Aesthetic Gamer also claimed that Sony is still involved and that Konami was the one who filed the DMCA.\n\nThe Star Wars Jedi: Fallen Order sequel, according to Grubbsnax host Jeff Grubb, will have the subtitle Survivor. A sequel to Star Wars Jedi: Fallen Order was confirmed by EA and Star Wars back in January, when the companies announced that Respawn would be leading development on three upcoming Star Wars titles.\n\nSTAMPS\n00:00 - Intro\n00:06 - Silent Hill\n01:50 - Star Wars Jedi: Fallen Order", "link": "https://www.youtube.com/watch?v=cnRiiQIgSg0", "date_published": "2022-05-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Lore - Rennala and the Academy of Raya Lucaria", "description": "While much of Elden Ring initially would seem to focus on the Erdtree and Golden Order, the Academy of Raya Lucaria is just as major of a faction to the overall story and lore of Elden Ring. From Raya Lucaria's founding astrologers to Rennala, Queen of the Full Moon, sorcerers from Caria and Sellen have had a major impact on the history of the Lands Between. Today, we'll focus on Rennala and the Academy of Raya Lucaria.\n\n#Elden Ring #EldenRingLore #RennalaLore #Rennala\n\nToday, we’ll discuss a prodigy who would become a Queen and a school influenced by the stars. It all began with those who would look up at the stars above.“ Astrologers, who preceded the sorcerers, established themselves in mountaintops that nearly touched the sky, and considered the Fire Giants their neighbors.”\n\nWe can find remnants of the Astrologers looking out at the stars all over the Lands Between, via crescent bowl shaped monuments or, perhaps moondials setup on mountains and cliffsides that collect Starlight Shards.\n\nWhile I’m not certain of the exact purpose of these, one is found on an altar in the Royal Moongazing Grounds of Caria Manor - indicating that it was incredibly important to astrologers. Considering they do look so similar to Sun Dials, it could be that these served a similar purpose… but for the moon. As Starlight Shards are regularly found in these, perhaps they were used for that very purpose.", "link": "https://www.youtube.com/watch?v=WHb0xaCP0aQ", "date_published": "2022-05-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "GROOVY! | Evil Dead: The Game Livestream", "description": "Ben and Jean-Luc load up their boomsticks and check out the launch of Evil Dead: The Game.", "link": "https://www.youtube.com/watch?v=oNkBW9AV8cM", "date_published": "2022-05-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Starfield Delayed, Dead Space Release Date Confirmed | GameSpot News", "description": "Starfield and Redfall Delayed To 2023, Dead Space gets an official release date, Call of Duty’s mobile Warzone is officially revealed and Sony has reportedly registered a new PS5 model. \n#GamingNews #Starfield #DeadSpace\n\nTwo of the studio’s major games, Starfield and Redfall, have been delayed to 2023. Starfield originally had a release date of November 11 for PC and Xbox Series X|S, while Redfall's launch date had yet to be announced but was slated for this summer. The new release window for both games is currently set for the first half of 2023 aka by the end of next June. \n\nThe Dead Space remake from EA Motive now has an official release date. As announced in the latest Dead Space stream, the game will release on January 27, 2023 for PC, PS5, and Xbox Series X|S.\n\nNicknamed \"Project Aurora,\" the upcoming title is a battle royale that aims to deliver \"a fresh new way to play.\" According to a post on Call of Duty’s website, the Project Aurora team has already begun play testing the game, however don't expect to see or hear anything about the game any time soon. The closed alpha is reportedly \"limited in size,\" and the select few who are playing are prohibited from sharing any details about the game publicly.\n\nSTAMPS\n00:00 - Intro\n00:07 - Starfield & Redfall \n01:33 - Dead Space Remake\n02:30 - DeathLoop \n02:48 - Warzone Mobile\n03:32 - New PS5 Model", "link": "https://www.youtube.com/watch?v=iiI3rIH8cks", "date_published": "2022-05-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]