[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCxt2r57cLastdmrReiQJkEg", "title": "Think Tanks: How Fake Experts Shape the News", "description": "Watch this video ad-free on Nebula: https://nebula.tv/videos/tomnicholas-think-tanks-how-fake-experts-shape-the-news\n\nA video about how billionaire-funded right-wing “think tanks” such as the Heritage Foundation, Adam Smith Institute, Manhattan Institute and Institute of Economic Affairs manipulate the news to spread their propaganda.\n\n*Chapters*\n\n0:00 Think Tanks & Propaganda in the Media\n00:37 1. Privatising the Moon\n09:10 Curiosity Stream & Nebula\n11:32 2. A Brief History of Think Tanks\n24:53 3. How Think Tanks Shape the News\n37:22 4. Moonshot Politics\n\n*Bibliography*\n\nYou can find an annotated bibliography for this video on my website, here: https://tomnicholas.com/2022/05/think-tanks-how-fake-experts-shape-the-news\n\n*Some Copy about the Video for the YouTube Algorithm*\n\nIn this month’s video, we’re looking at how the political right uses a network of fake research institutes and experts to shape the news.\n\nOrganisations such as the Adam Smith Institute, the Heritage Foundation, and the Institute of Economic Affairs have the appearance of respected, academic institutions. But are they really? Well... no.\n\nFunded by large corporations (including the climate denialists at big oil and tobacco companies) and super-rich libertarians such as Charles Koch and Betsy DeVos, these organisations are little more than propaganda fronts which exist solely to produce “research” which furthers the agendas of their funders.\n\nOften referred to as “think tanks”, these organisations have had a number of key successes in influencing our collective political discourse over recent years: debates surrounding “Critical Race Theory”, immigration policy and the UK’s process of leaving the European Union have all been significantly influenced by these groups.\n\nBut, where did these organisations come from? How did they gain such a stranglehold on our politics? And how can we be more astute in spotting their tactics?\n\nSupport the channel on Patreon at http://patreon.com/tomnicholas\n\nIf you've enjoyed this video and would like to see more including my What The Theory? series in which I provide some snappy introductions to key theories in the humanities as well as video essays and more then do consider subscribing.\n\nThanks for watching!\n\nTwitter: http://twitter.com/tom_nicholas\nInstagram: http://instagram.com/tomnicholaswtf\nPatreon: http://patreon.com/tomnicholas\nWebsite: http://www.tomnicholas.com\n\nSelect footage courtesy of Getty\n\n#thinktanks #mediabias #tomnicholas", "link": "https://www.youtube.com/watch?v=3n3Hq7XSBjA", "date_published": "2022-05-13 18:00:11+00:00", "persistent": false, "user": null, "language": "en-US"}]