[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Essential Voices USA: Tiny Desk Concert", "description": "Tom Huizenga | July 1, 2022\nWith all the crazy politics and a stubborn pandemic dragging on, it’s easy to be pessimistic about America this Fourth of July. But this Tiny Desk performance — happily back in our NPR Music office — will help turn dark skies to blue and remind us of the best and brightest version of our country. \n \nThis video marks the world premiere performance of excerpts of Washington Women, uplifting songs built on speeches and writings by amazing women — First Ladies, Secretaries of State, Senators and Supreme Court Justices — who had strong visions of what America should be.\n \nThe project is the brainchild of intrepid choral conductor and composer Judith Clurman, who directs the meticulously fine-tuned Essential Voices USA, a New York-based choir. While the songs have their own musical personalities, they also contain iconic political personalities. Hillary Rodham Clinton states, “Human rights are women’s rights, and women’s rights are human rights once and for all,” while Shirley Chisholm, the first Black congresswoman, declares that laws can be used to compel “the insensitive majority to reexamine its unconscious attitudes.” Betty Ford speaks of “the search for human freedom,” and Vice President Kamala Harris talks about the importance of dreaming big.\n \nClurman says she wrote the piece (along with Broadway arranger David Chase) not just for professional choruses to sing. She hopes that high school choirs will pick it up as well so that young people across the country will know how influential these women were and are, in making America a brighter, better place. \n\nSET LIST\n“The Essence of America” (text by Condoleezza Rice)\n“For Centuries Now” (text by Elena Kagan)\n“Freedom” (text by Eleanor Roosevelt, Hillary Rodham Clinton, Betty Ford)\n“In the Field of Equal Rights” (text by Shirley Chisholm)\n“Remember the Ladies” (text by Abigail Adams)\n“We Not Only Dream” (text by Kamala Harris, Nancy Pelosi)\n\nMUSICIANS\nMusic by Judith Clurman and David Chase\nJudith Clurman: director\nEssential Voices USA Choir:\nPaul D’Arcy\nChloe Holgate\nAmy Justman\nHelen Karloski\nEnrico Lagasca\nSteven Moore\nHeather Petrie\nJamet Pittman\nGregory Purnhagen\nElisa Singer Strom\nJason Weisinger\n\nTedd Firth: piano\nRaman Ramakrishnan: cello\n\nTINY DESK TEAM\nProducer: Tom Huizenga\nAudio Recording & Mix Engineer: Josh Rogosin\nDirector: Kara Frame\nSeries Creator: Bob Boilen\nSeries: Producer: Bobby Carter\nEditor: Joshua Bryant\nVideographers: Kara Frame, Joshua Bryant, Michael Zamora, Pierre Kattar, \nProduction Assistant: Ashley Pointer\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Jill Britton, Joby Tanseco, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\nSpecial Thanks: Yamaha Artist Services, New York, Jordan Kitt's Music\n\n#tinydesk #nprmusic #EssentialVoicesUSA", "link": "https://www.youtube.com/watch?v=D3XZg82Z52A", "date_published": "2022-07-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Usher: Tiny Desk Concert", "description": "This year, NPR Music is celebrating Black Music Month with an array of brand new Tiny Desk concerts — both from home and from behind our beloved Desk. Together, these artists represent the past, present and future of Black music. This month of carefully curated shows is a celebration of Black artists expressing themselves in ways we've never seen before, and of the Tiny Desk's unique way of showcasing that talent.\n\nBobby Carter | June 30, 2022\n\"We celebrate Black Music Month. This has been Black magic.\" Truer words may have never been spoken behind the Tiny Desk as R&B goliath Usher caps off our month-long celebration of Black music, highlighting a catalog chock-full of hits spanning 25 years. It's been over two years since NPR headquarters was abuzz with chatter of a legend in the building. After an early morning rehearsal for his set at the Something in the Water Festival in Washington, D.C., he made his way over to deliver an unforgettable performance.\n\nUsher and his band, all dipped in black, set it off with an introduction over a funky horn-laced instrumental reminiscent of a Blaxploitation flick. They keep that groove going right into a reworked version of his 1997 breakout single, \"You Make Me Wanna...\" Twenty-five years later, Usher sits arguably as the king of R&B. Between 2000 and 2010, there was no debate whatsoever, with his string of records that included the biggest R&B album of the 21st century, Confessions.\n\nWhat he's done in the vocal booth is only half of his claim to fame. The stage is where he's continued to shine as he prepares for the second leg of his Las Vegas residency. This loose and playful set touches on his many career phases; the crooning, the deeply personal, the club bangers and even the Tik Tok challenges indicate that he could just be reaching his prime. Recently, we've heard plenty of hot takes, wild battles and social media fodder about who sits at the mountaintop in the world of R&B. Usher Raymond has entered the chat.\n\nSET LIST\n\"You Make Me Wanna...\"\n\"Superstar\"\n\"U Don't Have to Call\"\n\"Nice & Slow\"\n\"Confessions Part II\"\n\"My Way\"\n\nMUSICIANS\nUsher: vocals\nEric Bellinger: vocals\nVedo: vocals\nDmitry Gorodetsky: bass\nLemar Guillary: trombone\nBrandyn Phillips: trumpet\nJay Flat: saxophone\nDarek Cobbs: keys\nErick Walls: guitar\nRyan Carr: drums\n\nTINY DESK TEAM\nProducer: Bobby Carter\nAudio Recording & Mix Engineer: Josh Rogosin\nDirector: Kara Frame\nEditor: Michael Zamora\nSeries Creator: Bob Boilen\nVideographers: Kara Frame, Joshua Bryant, Michael Zamora, Pierre Kattar, Alanté Serene\nProduction Assistant: Ashley Pointer\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Jill Britton, Joby Tanseco, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #usher #BMM", "link": "https://www.youtube.com/watch?v=up8ODGFWgFg", "date_published": "2022-06-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]