[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCG_nvdTLdijiAAuPKxtvBjA", "title": "Doctor Strange 2 — The Wanda Problem of Madness | Anatomy Of A Failure", "description": "Thanks MANSCAPED for sponsoring the video! Get 20% off + Free International Shipping with code “FILMENTO20” at https://mnscpd.com/Filmento\n\nDoctor Strange in the Multiverse of Madness is Marvel's next step into the multiverse after Spider-Man No Way Home. It's visually great and also has a fresh feel of a Marvel horror movie thanks to Sam Raimi. The main issue with the movie seems to be the writing, especially in terms of the antagonist Wanda Maximoff/Scarlet Witch as well as with the exposition. So today let's look at the Wanda problem and the exposition problem to maybe learn something.\n\nFilmento en Español:\nhttps://youtu.be/xmLyqpc8C_U\n\nSupport:     https://patreon.com/filmento\nFollow:        https://twitter.com/filmento\n\n#doctorstrange  #multiverseofmadness   #anatomyofafailure  \n\nMusic and inspiration\nman outta u - https://youtu.be/WCUHeNYOYpQ\nok wanda - https://youtu.be/bVa8lEuDcsc\n\n\n-\nDoctor Strange in the Multiverse of Madness (2022)\nIn Marvel Studios’ “Doctor Strange in the Multiverse of Madness,” the MCU unlocks the Multiverse and pushes its boundaries further than ever before. Journey into the unknown with Doctor Strange, who, with the help of mystical allies both old and new, traverses the mind-bending and dangerous alternate realities of the Multiverse to confront a mysterious new adversary. “Doctor Strange in the Multiverse of Madness” stars Benedict Cumberbatch, Chiwetel Ejiofor, Elizabeth Olsen, Benedict Wong, Xochitl Gomez, with Michael Stühlbarg, and multiverse of madness scene honest trailer multiverse of madness everything wrong with doctor strange in the multiverse of madness full movie online free watch clip 4k hd multiverse of madness after credits explained multiverse of madness wanda bad movie good movie multiverse of madness memes scene doctor strange vs doctor strange opening evil wanda kids explained boys smartest man alive wanda black bolt reed richards doctor strange 2 mistakes Rachel McAdams. The film is directed by Sam Raimi, and Kevin Feige is the producer. Louis D’Esposito, Victoria Alonso, Eric Hauserman Carroll and Jamie Christopher serve as executive producers. The screenplay was written by Michael Waldron.", "link": "https://www.youtube.com/watch?v=KJhj-YbBkkI", "date_published": "2022-06-30 17:00:07+00:00", "persistent": false, "user": null, "language": "en-US"}]