[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCHnyfMqiRRG1u-2MsSQLbXA", "title": "The Riddle That Seems Impossible Even If You Know The Answer", "description": "The 100 Prisoners Riddle feels completely impossible even once you know the answer. This video is sponsored by Brilliant. The first 200 people to sign up via https://brilliant.org/veritasium get 20% off a yearly subscription.\n\nSpecial thanks to Destin of Smarter Every Day (https://ve42.co/SED), Toby of Tibees (https://ve42.co/Tibees), and Jabril of Jabrils (https://ve42.co/Jabrils) for taking the time to think about this mind bending riddle.\n\nHuge thanks to Luke West for building plots and for his help with the math. \nHuge thanks to Dr. Eugene Curtin and Dr. Max Warshauer for their great article on the problem and taking the time to help us understand it: https://ve42.co/CurtinWarshauer\nThanks to Dr. John Baez for his help with finding alternate ways to do the calculations.\nThanks to Simon Pampena for his input and analysis.\n\nOther 100 Prisoners Riddle videos:\nminutephysics: https://www.youtube.com/watch?v=C5-I0bAuEUE\nVsauce2: https://www.youtube.com/watch?v=kOnEEeHZp94\nStand-up Maths: https://www.youtube.com/watch?v=a1DUUnhk3uE\nTED-Ed: https://www.youtube.com/watch?v=vIdStMTgNl0\n\n▀▀▀\nReferences:\nOriginal paper: Gál, A., & Miltersen, P.B. (2003). The Cell Probe Complexity of Succinct Data Structures. BRICS, Department of Computer Science, University of Aarhus. All rights reserved. – https://ve42.co/GalMiltersen\nWinkler, P. (2006). Seven Puzzles You Think You Must Not Have Heard Correctly. – https://ve42.co/Winkler2006\nThe 100 Prisoners Problem – https://ve42.co/100PWiki \nGolomb, S. & Gaal, P. (1998). On the Number of Permutations on n Objects with Greatest Cycle Length k. Advances in Applied Mathematics, 20(1), 98-107. – https://ve42.co/Golomb1998\nLamb, E. (2012). Puzzling Prisoners Presented to Promote North America's Only Museum of Math. Observations, Scientific American. – https://ve42.co/Lamb2012\nPermutations – https://ve42.co/PermutationsWiki\nProbability that a random permutation of n elements has a cycle of length k greater than n/2, Math SE. – https://ve42.co/BaezProbSE\nCounting Cycle Structures in Sn, Math SE. – https://ve42.co/CountCyclesSE\nWhat is the distribution of cycle lengths in derangements? In particular, expected longest cycle, Math SE. – https://ve42.co/JorikiSE\nThe Manim Community Developers. (2021). Manim - Mathematical Animation Framework (Version v0.13.1). – https://www.manim.community/\n\n▀▀▀\nSpecial thanks to Patreon supporters: RayJ Johnson, Brian Busbee, Jerome Barakos M.D., Amadeo Bee, Julian Lee, Inconcision, TTST, Balkrishna Heroor, Chris LaClair, Avi Yashchin, John H. Austin, Jr., OnlineBookClub.org, Matthew Gonzalez, Eric Sexton, john kiehl, Diffbot, Gnare, Dave Kircher, Burt Humburg, Blake Byers, Dumky, Evgeny Skvortsov, Meekay, Bill Linder, Paul Peijzel, Josh Hibschman, Timothy O’Brien, Mac Malkawi, Michael Schneider, jim buckmaster, Juan Benet, Ruslan Khroma, Robert Blum, Richard Sundvall, Lee Redden, Vincent, Stephen Wilcox, Marinus Kuivenhoven, Michael Krugman, Cy 'kkm' K'Nelson, Sam Lutfi, Ron Neal\n\n▀▀▀\nWritten by Derek Muller and Emily Zhang\nFilmed by Derek Muller and Petr Lebedev\nAnimation by Ivy Tello and Jesús Rascón\nEdited by Trenton Oliver\nAdditional video/photos supplied by Getty Images\nMusic from Epidemic Sound and Jonny Hyman\nProduced by Derek Muller, Petr Lebedev, and Emily Zhang", "link": "https://www.youtube.com/watch?v=iSNsgj1OCLA", "date_published": "2022-06-30 12:20:58+00:00", "persistent": false, "user": null, "language": null}]