[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCW0gH2G-cMKAEjEkI4YhnPA", "title": "The Rings of Power Teaser BREAKDOWN | The Lord of the Rings on Prime", "description": "We finally got our first teaser trailer for The Lord of the Rings: The Rings of Power!  In this video, I go through it shot-by-shot giving my interpretations, thoughts, and theories.  The teaser certainly left me wanting more - in both good ways, and some ways that are more underwhelming for me as a huge book fan.  We see Galadriel, Gil-galad, Elrond, Durin IV, Disa, Arondir, Halbrand, Finrod, \"Meteor Man\", and new hobbit Elenor \"Nori\" Brandyfoot.  We also got our first look at Númenor, an ice troll, and more.\n\nHit subscribe - and the bell!\nNerd of the Rings on PATREON: https://www.patreon.com/NerdoftheRings\n\nYou can watch the trailer here: https://youtu.be/OCLoZI-FOYA\n\nTo purchase artist work, check out these amazing artists!\n\nJenny Dolfen - goldseven.wordpress.com/\nTed Nasmith - www.tednasmith.com/shop/\nKip Rasmussen - https://www.kiprasmussen.com\n\nHelcaraxe - Jenny Dolfen\nEru and the Gods Singing the First Song of Creation - Kip Rasmussen\nMorgoth Came - Jenny Dolfen\nLorien - Brothers Hildebrandt\nThe Burning of the Ships - Ted Nasmith\nFingolfin Leads the Host Across the Helcaraxe - Ted Nasmith\n\n#ringsofpower #lotronprime #lotrrop", "link": "https://www.youtube.com/watch?v=YQmGXbXpw80", "date_published": "2022-02-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCW0gH2G-cMKAEjEkI4YhnPA", "title": "LOTR Rings of Power Trailer Watch Party! Super Bowl Sunday w/ TheOneRing.net", "description": "I'll be joining the folks at The One Ring for the OFFICIAL The Lord of the Rings: The Rings of Power trailer watch party!  As a special treat, the good folks at TORn and I have worked it out so that we will simulcast the stream to my channel in addition to their YouTube, Twitter, etc.  Check them out here: @TheOneRingNet \n\nAfter the teaser airs, we will screen it live and give our reactions, extensive analysis, and take questions/comments/thoughts from YOU in the live chat!  Click \"Set Reminder\" so you get notified when we go LIVE!  (Scheduled time is subject to change depending on when the teaser actually airs.)\n\nRings of Power Description:\nBeginning in a time of relative peace, we follow an ensemble cast of characters as they confront the re-emergence of evil to Middle-earth. From the darkest depths of the Misty Mountains, to the majestic forests of Lindon, to the breathtaking island kingdom of Númenor, to the furthest reaches of the map, these kingdoms and characters will carve out legacies that live on long after they are gone.\n\n#ringsofpower #lotrrop #lotronprime", "link": "https://www.youtube.com/watch?v=IoFnHAUR12s", "date_published": "2022-02-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]