[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty Vanguard & Warzone Season 2 Livestream", "description": "Call of Duty Vanguard's second season is here! Tune in as Richie checks out the new weapons, operators, vehicles shared across Vanguard and Warzone.", "link": "https://www.youtube.com/watch?v=3QNzGxQRcUo", "date_published": "2022-02-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 News Coming Tomorrow... Next-Gen Please | GameSpot News", "description": "CD Projekt Red will be talking about Cyberpunk 2077 live, Capcom is counting down to a game reveal, and more.\n\nCD Projekt Red has announced a special video briefing coming up tomorrow, February 15, where it will talk about items related to Cyberpunk 2077. The event kicks off at 4 PM CET, which is 7 AM PT / 10 AM ET.\n\nA timer on the Capcom website is currently counting down to something, but the video game company has not yet revealed what will be seen once the clock counts down to zero. Currently scheduled to end February 20/21 at 10 PM PT / 1 AM ET, speculation on the upcoming reveal is focused on a possible Street Fighter announcement.\n\nDying Light 2 Stay Human's post-launch support is well underway, with the game's first free DLC launching today. Called the \"Authority Pack,\" players can represent the Peacekeepers with a suite of new armor and a new weapon.\n\nFor more information on all of our topic, please visit gamespot.com!\n\nTimestamps:\n00:00 - Intro\n00:07 - Cyberpunk 2077\n01:07 - Capcom\n02:12 - Dying Light 2\n03:41 - COD Season 2", "link": "https://www.youtube.com/watch?v=SD-BqfkFiE8", "date_published": "2022-02-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Horizon Forbidden West Review", "description": "Horizon: Forbidden West sometimes packs in so much that it gets in its own way, but the many well-drawn characters populating its quests keep it compelling.", "link": "https://www.youtube.com/watch?v=Jbsmr-Afzn0", "date_published": "2022-02-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Breaks Down Iconic Star Wars Weapons - Loadout Extended Chat", "description": "From Han Solo’s DL-44 pistol to the Stormtrooper’s E-11 Blaster, the Star Wars universe is full of iconic firearms. In this extended chat from our previous Star Wars episode, Keeper of Firearms & Artillery Jonathan Ferguson breaks down some of the franchise’s iconic weapons and details the behind the scenes stories that led to their creations. (Presented by PUBG MOBILE)\n\n00:00 - Opening\n00:55 - Han Solo’s DL-44 Pistol\n03:41 - Boba Fett’s EE-3 Carbine Rifle\n04:54 - The E-11 Blaster Rifle\n\nIn this episode of Loadout, Dave Jewitt visits the Royal Armouries to talk to Keeper of Firearms & Artillery Jonathan Ferguson about the real world weapons that made up some of Star Wars iconic arsenal.\n\nYou can check out more episodes of Loadout right here. - https://www.youtube.com/watch?v=yzSrmGkpWKk&list=PLpg6WLs8kxGMzIemU1gyyLmg5VlKI2UvC\n\nYou can check out our Firearms Expert Reacts series here. - https://www.youtube.com/watch?v=5FVzcoRjoN4&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/", "link": "https://www.youtube.com/watch?v=gzqoNtVOB8o", "date_published": "2022-02-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Horizon Zero Dawn Full Story Recap", "description": "The story of the Horizon franchise is A LOT. There’s dense lore, a multitude of important characters, and plenty of earth-shattering revelations. And while the franchise is only really just getting started, we’ve had more than enough happen across a single game and its DLC expansion to warrant a story refresher. So whether you played Horizon Zero Dawn on release in 2017 or you’re just jumping in for Horizon Forbidden West, let’s break down the story so far.\n\nThe Horizon franchise plays out its grand narrative of tribal politics and robot dino-animal-things in the 31st century in the wake of a cataclysmic robot-apocalypse that has wiped out the majority of humanity. Those that have survived have formed tribes, and are living their lives largely devoid of the technological advancements of their predecessors, who are widely known as the ‘Old Ones’. \n\nHorizon Zero Dawn features four of these tribes: The Nora - deeply religious warrior-hunters from the south, who worship at the altar of ‘All-Mother’ - a mystical mountain; the Carja, who reside in the bustling cities of the central deserts and revere the Sun God; the Oseram - a tribe of practically-minded forgemen and women; and the Banuk, who are a mountain-dwelling tribe of hunters and shaman. The tribes aren’t exactly all on friendly terms either - with the Carja being notorious for raiding their rivals under the leadership of the Mad Sun King, Jiran.\n\nScattered across the stunning post-apocalyptic landscapes are animal and dinosaur-like robots known as ‘machines’, who for the most part peacefully coexist with the tribes. However, as the years pass by, the machines have become increasingly more violent towards humanity as part of a phenomenon known as the ‘Derangement’. So begins Horizon: Zero Dawn. \n\nHorizon Font: https://www.fontspace.com/horizon-font-f26000", "link": "https://www.youtube.com/watch?v=Nopfzl_oIdw", "date_published": "2022-02-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]