{"entries": [{"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/live/2022/dec/26/australia-vs-south-africa-cricket-live-updates-score-second-test-boxing-day-one-latest-scores-aus-v-sa", "title": "Australia v South Africa: second Test, day one – live", "date_published": "2022-12-25 23:05:34+00:00", "description": "<ul><li>Updates as the three-Test series continues at the MCG</li><li>Start time in Melbourne is 10:30am/11:30pm GMT</li><li>Any thoughts? <a href=\"mailto:geoff.lemon@theguardian.com\">Email Geoff</a> or tweet <a href=\"https://twitter.com/GeoffLemonSport\">@GeoffLemonSport</a></li></ul><p>That’s interesting. The pitch is nowhere near as green as Brisbane, but it does look grassy enough from a distance, that kind of patchy grass that has characterised the surface over the last few years. It’s also fairly cool and a bit cloudy right at the moment, mid 20s with a forecast high later of 32, and forecast to be sunny and in the high 30s tomorrow, so maybe Pat Cummins thinks that the bowling conditions will be easier to handle and will hope to be batting by the time it gets hot.</p><p>And why not a potentially soon-to-be-redundant argument for David Warner at the top of the order? Another couple of low scores might throw this out the window, but I’m thinking that patience is the right way to go when a player’s record is this good. </p> <a href=\"https://www.theguardian.com/sport/live/2022/dec/26/australia-vs-south-africa-cricket-live-updates-score-second-test-boxing-day-one-latest-scores-aus-v-sa\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/25/antonio-conte-admits-to-strange-experience-of-watching-kane-v-lloris", "title": "Antonio Conte admits to ‘strange’ experience of watching Kane v Lloris", "date_published": "2022-12-25 22:30:14+00:00", "description": "<ul><li>Tottenham manager ‘enjoyed’ England v France in World Cup</li><li>Conte: ‘I think Harry will be motivated, I am sure’</li></ul><p>Antonio Conte has spoken of the “strange” experience of watching his two most senior players face each other from the penalty spot not once but twice during the World Cup.</p><p>The Spurs coach has the task of making sure both Harry Kane and Hugo Lloris are focused on achieving for Spurs in the second half of the Premier League season which resumes on Boxing Day. But the Italian has little doubt his two leaders will be ready, despite the unusual events of the quarter-final between England and France.</p> <a href=\"https://www.theguardian.com/football/2022/dec/25/antonio-conte-admits-to-strange-experience-of-watching-kane-v-lloris\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/25/graham-potter-more-confident-of-changing-chelseas-fortunes-after-talks", "title": "Graham Potter ‘more confident’ of changing Chelsea’s fortunes after talks", "date_published": "2022-12-25 22:30:14+00:00", "description": "<ul><li>Manager met co-owner Behdad Eghbali in California</li><li>‘We understand where we are and the challenges ahead’</li></ul><p>Graham Potter insists he feels more confident in his role than ever before after meeting one of Chelsea’s owners during a trip to California during the World Cup.</p><p>Potter spent a week on the west coast of the United States with his wife after seeing Chelsea go into the World Cup break on the back of <a href=\"https://www.theguardian.com/football/2022/nov/12/newcastle-chelsea-premier-league-match-report\">three successive defeats</a> – a run that has left them eight points adrift of the top four.</p> <a href=\"https://www.theguardian.com/football/2022/dec/25/graham-potter-more-confident-of-changing-chelseas-fortunes-after-talks\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/25/liverpools-jurgen-klopp-showers-praise-on-just-exceptional-jude-bellingham", "title": "Liverpool’s Jürgen Klopp showers praise on ‘just exceptional’ Jude Bellingham", "date_published": "2022-12-25 22:30:14+00:00", "description": "<ul><li>Manager praises maturity and potential of England midfielder</li><li>Admits Champions League qualification is club’s ‘main target’</li></ul><p>Jürgen Klopp has paid a lavish tribute to Jude Bellingham and insisted failure to qualify for the Champions League this season would not prevent Liverpool attracting their top transfer targets.</p><p>Liverpool’s interest in Bellingham was well established before the England midfielder enhanced his reputation at the World Cup, although the prospect of Borussia Dortmund selling the 19-year-old in January appears remote. Despite also being linked with a move for Enzo Fernández next month, Liverpool are not in the market for Argentina’s World Cup-winning midfielder.</p> <a href=\"https://www.theguardian.com/football/2022/dec/25/liverpools-jurgen-klopp-showers-praise-on-just-exceptional-jude-bellingham\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/25/trust-in-frank-lampard-hangs-by-thread-before-evertons-boxing-d-day", "title": "Trust in Frank Lampard hangs by thread before Everton’s Boxing D-Day", "date_published": "2022-12-25 22:30:14+00:00", "description": "<p>Manager must correct form quickly to avoid relegation danger as his side face a critical match against rock-bottom Wolves</p><p>Right, where were we? Police and stewards had formed a cordon to separate angry fans from angry players, Jordan Pickford was ushered away from one confrontation, Alex Iwobi gave his shirt to a supporter and had it thrown back at him and Frank Lampard held his hands up in apology after a <a href=\"https://www.theguardian.com/football/2022/nov/12/bournemouth-everton-premier-league-match-report\">second anaemic defeat at Bournemouth</a> inside five days. We pick up with Everton in trouble again.</p><p>Six weeks is a long time to brood over events on the south coast, where Everton’s collapse in form was met with an ugly demonstration of a collapse in support for Lampard’s team. One of the major plusses of the Everton manager’s 11-month reign has been the reconnection between crowd and players after the divisive days of Rafael Benítez and the disillusionment that had set in before his ridiculous appointment.</p> <a href=\"https://www.theguardian.com/football/2022/dec/25/trust-in-frank-lampard-hangs-by-thread-before-evertons-boxing-d-day\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/25/kevin-de-bruyne-claims-goal-obsession-can-drive-erling-haaland-to-800-club", "title": "Kevin De Bruyne claims goal obsession can drive Erling Haaland to 800 club", "date_published": "2022-12-25 22:30:13+00:00", "description": "<ul><li>De Bruyne says Haaland’s love for scoring makes him unique</li><li>Midfielder hails Pep Guardiola as a genius for changing the game</li></ul><p>Kevin De Bruyne believes Erling Haaland is so obsessed with scoring that the Manchester City striker can register 800 goals in his career.</p><p>The Norwegian’s opener in <a href=\"https://www.theguardian.com/football/2022/dec/22/manchester-city-liverpool-carabao-cup-last-16-match-report\">Thursday’s 3-2 Carabao Cup win</a> over Liverpool was his 24th strike in 19 appearances in all competitions this season. His total career tally is approaching 200.</p> <a href=\"https://www.theguardian.com/football/2022/dec/25/kevin-de-bruyne-claims-goal-obsession-can-drive-erling-haaland-to-800-club\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/25/mikel-arteta-wants-arsenal-to-make-january-signings-as-quickly-as-possible", "title": "Mikel Arteta wants Arsenal to make January signings as quickly as possible", "date_published": "2022-12-25 22:30:13+00:00", "description": "<ul><li>Manager wants players in and settled with key games coming up</li><li>Arteta: ‘This is idealistic. Sometimes it is not realistic’</li></ul><p>Mikel Arteta has urged Arsenal to make January signings as quickly as possible, with the Premier League leaders preparing to face Newcastle, Tottenham and Manchester United during a key month in the title race.</p><p>Arteta’s team lead Manchester City by five points going into Monday’s match at home to West Ham. The manager has said <a href=\"https://www.theguardian.com/football/2022/dec/22/arsenal-must-be-active-and-strengthen-in-transfer-window-insists-mikel-arteta\">Arsenal are “going to be active”</a> in the window and believes the speed with which they get deals done could shape their season. A game at home to Newcastle on 3 January is followed by an FA Cup third-round tie at Oxford, and then come fixtures at Spurs on 15 January and a visit from Manchester United a week later.</p> <a href=\"https://www.theguardian.com/football/2022/dec/25/mikel-arteta-wants-arsenal-to-make-january-signings-as-quickly-as-possible\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/25/tiktok-sleuth-ashley-guillard-rebecca-scofield-defamation-idaho-murders", "title": "Professor sues TikTok sleuth for linking her to Idaho students’ murders", "date_published": "2022-12-25 20:53:06+00:00", "description": "<p>Rebecca Scofield said a TikTok user spread baseless and false claims linking her to the November slayings of four students</p><p>A University of <a href=\"https://www.theguardian.com/us-news/idaho\">Idaho</a> professor has filed a defamation lawsuit against a self-proclaimed psychic on TikTok after the tarot card reader accused her of killing four of the school’s students, whose murders shocked the US last month.</p><p>The federal <a href=\"https://www.documentcloud.org/documents/23528145-scofield-v-guillard-idaho-student-killings-lawsuit?responsive=1&amp;title=1\">lawsuit</a> for damages filed by the university’s history department chair Rebecca Scofield on Wednesday alleges that TikTok user Ashley Guillard spread baseless claims which falsely linked the professor to the 13 November slayings of Xana Kernodle, 20; Ethan Chapin, 20; Maddie Mogen, 21; and Kaylee Goncalves, 21, in Moscow, Idaho.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/25/tiktok-sleuth-ashley-guillard-rebecca-scofield-defamation-idaho-murders\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/film/2022/dec/26/from-sissy-to-the-stranger-the-10-best-australian-films-of-2022-ranked", "title": "From Sissy to The Stranger: the 10 best Australian films of 2022 – ranked", "date_published": "2022-12-25 20:24:51+00:00", "description": "<p>We were treated to some remarkable new talent this year, spanning environmental documentaries, satirical horror and kitchen sink realism</p><p><strong><em>Which Australian films did you love this year? Join us in the comments</em></strong></p><ul><li><a href=\"https://www.theguardian.com/newsletters/2019/oct/18/saved-for-later-sign-up-for-guardian-australias-culture-and-lifestyle-email?CMP=cvau_sfl\">Get our weekend culture and lifestyle email</a></li></ul><p>There was no shortage of excellent Australian films released this year. If 2021 was a particularly <a href=\"https://www.theguardian.com/film/2021/dec/29/from-the-dry-to-my-name-is-gulpilil-the-10-best-australian-films-of-2021\">great year for documentaries</a> (which accounted for half of my Top 10, including three of the top five), 2022 boasts a more particular highlight: films about rivers. By coincidence, three of the titles below contemplate rivers historically, ecologically and spiritually.</p><p>But it’s not all beautiful streams of flowing water – there’s also witches, criminals and the scum of the universe (social media influencers). As usual, films needed to have a local theatrical or streaming release (outside film festivals) sometime during the calendar year to be eligible for this list.</p><p><a href=\"https://www.theguardian.com/film/2022/mar/16/river-review-jennifer-peedom-willem-dafoe\">Read the full review</a></p> <a href=\"https://www.theguardian.com/film/2022/dec/26/from-sissy-to-the-stranger-the-10-best-australian-films-of-2022-ranked\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/25/wolves-confirm-matheus-cunha-signing-from-atletico-madrid-in-44m-deal", "title": "Wolves confirm Matheus Cunha signing from Atlético Madrid in £44m deal", "date_published": "2022-12-25 19:20:48+00:00", "description": "<ul><li>Brazil forward joins on loan with obligation for Wolves to buy</li><li>‘I’m happy like a kid,’ says Cunha as he links up with Diego Costa </li></ul><p>Wolves have signed the Brazil forward Matheus Cunha on loan from Atlético Madrid with an obligation to buy for €50m (£44m).</p><p>The 23-year-old will join Julen Lopetegui’s squad from 1 January subject to a work permit. The former Sion, RB Leipzig and Hertha Berlin player moved to Atlético in the summer of 2021 and scored seven goals last season but has struggled for playing time this term.</p> <a href=\"https://www.theguardian.com/football/2022/dec/25/wolves-confirm-matheus-cunha-signing-from-atletico-madrid-in-44m-deal\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/25/seven-people-british-links-arrested-iran-protests", "title": "Seven people with British links arrested in Iran over protests", "date_published": "2022-12-25 19:06:46+00:00", "description": "<p>UK Foreign Office is seeking further information about detainees, who include several dual nationals</p><p>Seven people with links to Britain have been arrested by Iran’s Revolutionary Guards over anti-government protests that have snowballed across the country in recent months, according to reports.</p><p>The people arrested, some of whom are dual nationals, were detained while trying to leave Iran, according to Reuters, citing a statement published by state media.</p> <a href=\"https://www.theguardian.com/world/2022/dec/25/seven-people-british-links-arrested-iran-protests\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/25/up-to-10-people-buried-in-avalanche-in-austria-on-christmas-day", "title": "Up to 10 people buried in avalanche in Austria on Christmas Day", "date_published": "2022-12-25 19:00:23+00:00", "description": "<p>One person rescued so far after incident that occurred in the Lech/Zuers free skiing area at about 3pm on Sunday</p><p>About 10 people have been buried in an avalanche in Austria, one of whom has so far been rescued.</p><p>The avalanche occurred in the Lech/Zuers free skiing area at about 3pm (1400 GMT) on Sunday, the Austrian Press Agency said, adding that several helicopters and search teams were deployed soon afterwards.</p> <a href=\"https://www.theguardian.com/world/2022/dec/25/up-to-10-people-buried-in-avalanche-in-austria-on-christmas-day\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/25/suspect-in-paris-shooting-says-he-had-pathological-hatred-of-foreigners", "title": "Suspect in Paris shooting ‘had pathological hatred of foreigners’", "date_published": "2022-12-25 18:08:42+00:00", "description": "<p>The man, 69, was held on Friday after killing three people at a Kurdish cultural centre and nearby cafe</p><p>The French man detained over the <a href=\"https://www.theguardian.com/world/2022/dec/23/dead-injured-paris-shooting-reports\">killing of three Kurdish people</a> in Paris last week has told investigators he had a “pathological” hatred of foreigners, the city’s prosecutor said on Sunday.</p><p>The 69-year-old man was arrested on Friday after shooting dead two men and a woman in a Kurdish cultural centre and nearby Kurdish cafe in the 10th district of Paris, which the French president, Emmanuel Macron, described as a “vile” attack on the Kurds of France.</p> <a href=\"https://www.theguardian.com/world/2022/dec/25/suspect-in-paris-shooting-says-he-had-pathological-hatred-of-foreigners\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/25/eddie-howe-confident-newcastle-can-convert-champions-league-promise", "title": "Eddie Howe confident Newcastle can convert Champions League promise", "date_published": "2022-12-25 17:00:07+00:00", "description": "<p>Manager has praise for players he’s got and eyes on impressive additions as Premier League resumes with his side third</p><p>Eddie Howe would later admit he was not really thirsty but that failed to prevent Newcastle’s manager from unscrewing the top of the small bottle of water in front of him and taking a long, very slow, sip. It was such an obvious timewasting tactic that, by the time he put it back on the table, laughter filled the room.</p><p>“I’m conveniently drinking my water,” Howe joked after being asked whether he would prefer to finish in the Premier League’s top four or win the Carabao Cup. The 45-year-old had evidently forgotten that, in an unguarded moment, after last Tuesday night’s <a href=\"https://www.theguardian.com/football/2022/dec/20/newcastle-bournemouth-carabao-cup-fourth-round-match-report\">Carabao Cup win</a> against Bournemouth, he had admitted: “The Premier League’s our priority.”</p> <a href=\"https://www.theguardian.com/football/2022/dec/25/eddie-howe-confident-newcastle-can-convert-champions-league-promise\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/25/christmas-arctic-storm-buffalo-new-york", "title": "‘Life-threatening hazard’: 28 dead in Arctic storm battering US", "date_published": "2022-12-25 16:21:18+00:00", "description": "<p>Officials warn the number of deaths might rise, while a quarter of a million people in the US have no electricity</p><p>The monstrous Arctic storm that has gripped most of the continental US over the Christmas holiday continued to batter the northern city of Buffalo, New York, on Sunday, as freezing temperatures trailing across the nation created what forecasters called a “potentially life-threatening hazard”.</p><p>Twenty-eight deaths attributed to the weather have been recorded across the nation, with officials warning that the number of fatalities would probably rise as “the Arctic air enveloping much of the eastern two-thirds of the US would be slow to moderate”.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/25/christmas-arctic-storm-buffalo-new-york\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/society/2022/dec/25/home-office-accused-breaking-pledge-tackle-violence-against-women-and-girls", "title": "Home Office accused of breaking pledge to tackle violence against women", "date_published": "2022-12-25 16:00:05+00:00", "description": "<p>Labour says department has failed to make crimes such as rape, stalking and upskirting a priority </p><p>The Home Office has been accused of breaking a promise made after the murder of Sarah Everard to elevate violence against women and girls to the same status as terrorism.</p><p>Police forces are not yet required to make a group of misogynistic crimes such as rape, stalking and upskirting a major priority because of a failure to issue a proposed government directive, Labour said.</p> <a href=\"https://www.theguardian.com/society/2022/dec/25/home-office-accused-breaking-pledge-tackle-violence-against-women-and-girls\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/25/svalbard-reindeer-thrive-develop-taste-popsicle-like-grasses", "title": "Svalbard reindeer thrive as they shift diet towards ‘popsicle-like’ grasses", "date_published": "2022-12-25 16:00:05+00:00", "description": "<p>Increased plant growth due to warmer climate appears to be prompting change in eating habits</p><p>As the Arctic warms, concern for the plight of Santa’s favourite sleigh pullers is mounting. But in one small corner of the far flung north – Svalbard – Rudolph and his friends are thriving.</p><p>Warmer temperatures are boosting plant growth and giving Svalbard reindeer more time to build up fat reserves; they also appear to be shifting their diets towards “popsicle-like” grasses that poke up through the ice and snow, data suggests.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/25/svalbard-reindeer-thrive-develop-taste-popsicle-like-grasses\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/25/spain-bus-plunges-off-bridge-lerez-river-galicia", "title": "At least five dead in Spain after bus plunges off bridge into river", "date_published": "2022-12-25 15:52:58+00:00", "description": "<p>Driver and one passenger rescued as search continues for at least one missing person in Galicia</p><p></p><p></p><p></p><p>At least five people have died after a bus fell off a bridge into a surging river in north-western Spain late on Christmas Eve.</p><p>Emergency teams are searching for at least one missing person, while two survivors – the driver of the bus and a female passenger – were rescued from the Lérez River in Galicia and taken to hospitals, authorities said on Sunday. Police said the driver tested negative for alcohol and drugs.</p> <a href=\"https://www.theguardian.com/world/2022/dec/25/spain-bus-plunges-off-bridge-lerez-river-galicia\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/uk-news/2022/dec/25/king-charles-highlights-cost-of-living-crisis-in-first-christmas-broadcast", "title": "King Charles highlights cost of living crisis in first Christmas broadcast", "date_published": "2022-12-25 15:10:04+00:00", "description": "<p>Monarch pays tribute to the volunteers and charity workers helping those in financial difficulty</p><p>King Charles has highlighted the cost of living crisis and the “great anxiety and hardship” of many struggling to “pay their bills and keep their families fed and warm” in his first Christmas broadcast.</p><p>In the message, with the nation in the grip of economic woes and against the backdrop of the war in Ukraine, the king dedicated a major part of his broadcast to those helping to ease the plight of others.</p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/25/king-charles-highlights-cost-of-living-crisis-in-first-christmas-broadcast\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/25/kamala-harris-migrant-buses-christmas-eve-texas", "title": "More migrants bussed to Kamala Harris’s home on Christmas Eve", "date_published": "2022-12-25 15:04:29+00:00", "description": "<p>Three buses of Central and South American migrants arrived to the vice-president’s home from Texas</p><p>Three busloads of migrants were dropped off outside the Washington DC home of US vice-president Kamala Harris late on Christmas Eve, the latest episode in an escalating battle between the Joe Biden White House and the governors of southern Republican states over federal immigration policy.</p><p>The Central and South American migrants, believed to be sent from Texas, were dropped off in below-freezing temperatures, with some wearing only sweatshirts and shorts.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/25/kamala-harris-migrant-buses-christmas-eve-texas\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/26/a-day-at-the-beach-i-realised-that-if-i-was-going-to-join-in-id-have-to-get-comfortable-with-the-ocean", "title": "A day at the beach: ‘I realised that if I was going to join in, I’d have to get comfortable with the ocean’", "date_published": "2022-12-25 14:00:05+00:00", "description": "<p>Although Zoya Patel spent most of her life in Australia, the ocean never felt safe. Then a summer break forced her out of her comfort zone, and into the water</p><p></p><p>I was 23 the first time I truly felt free in the ocean. I stood waist-deep in the water, watching a wave unfurl towards me, and in place of the fear I usually felt, there was a rush of exhilaration.</p><p>I’ve lived in Australia since I was a toddler, but the ocean wasn’t a safe place in my childhood. Both of my parents were born in Fiji, and while some Australians would be surprised to hear it, they had never learned to swim. Though the crystal blue waters are enjoyed by tourists and coastal residents, the islands’ large Fijian-Indian population rarely swim.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/26/a-day-at-the-beach-i-realised-that-if-i-was-going-to-join-in-id-have-to-get-comfortable-with-the-ocean\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/culture/2022/dec/26/michael-sheen-on-art-fear-and-amadeus-david-suchet-was-in-really-good-shape-i-am-not", "title": "Michael Sheen on art, fear and Amadeus: ‘David Suchet was in really good shape. I … am not!’", "date_published": "2022-12-25 14:00:05+00:00", "description": "<p>His breakthrough role was as a young Mozart in Peter Hall’s Amadeus, opposite Suchet’s Salieri. Twenty-three years later, Sheen returns to the play for Sydney Opera House – this time as Mozart’s rival</p><ul><li><a href=\"https://www.theguardian.com/newsletters/2019/oct/18/saved-for-later-sign-up-for-guardian-australias-culture-and-lifestyle-email?CMP=cvau_sfl\">Get our weekend culture and lifestyle email</a></li></ul><p></p><p>Those who have followed the career of the Welsh actor Michael Sheen might expect to encounter a chatty charmer, the “bare-footed buffoon” of his Twitter bio, a full-throated stage animal.</p><p>But when he meets Guardian Australia, “harried” is the word that springs to mind – a Sheen closer to the exaggerated version of himself he plays in the Covid lockdown TV hit Staged, not given to suffering fools. At one point I swear he rolled his eyes.</p><p><strong><a href=\"https://www.theguardian.com/newsletters/2019/oct/18/saved-for-later-sign-up-for-guardian-australias-culture-and-lifestyle-email?CMP=copyembed\">Sign up for the fun stuff with our rundown of must-reads, pop culture and tips for the weekend, every Saturday morning</a></strong></p> <a href=\"https://www.theguardian.com/culture/2022/dec/26/michael-sheen-on-art-fear-and-amadeus-david-suchet-was-in-really-good-shape-i-am-not\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/25/brain-surgery-dolls-houses", "title": "After a long career in brain surgery, I’m trying my hand at making doll's houses | Henry Marsh", "date_published": "2022-12-25 14:00:04+00:00", "description": "<p>To my surprise I don’t miss neurosurgery now I’ve retired, but still find joy in making things for my grandchildren</p><p>The pictures on my iPhone photo roll for the past two years are mainly of my granddaughters and, more recently, of my newborn grandson, interspersed with destroyed and rusty Russian tanks in Ukraine, where I went this year, having <a href=\"https://www.ft.com/content/f0066b0c-286f-42c6-a3d9-ef99771b0e91\">regularly travelled</a> to teach surgery therefor 30 years.</p><p>But there are also a few pictures from the workshop at the bottom of my garden of the doll’s house I have been building for Lizzie, my youngest granddaughter. I started working on it during lockdown and hope to finish it by Christmas. I suppose in some ways it is a substitute for operative neurosurgery as I “hung up my gloves” – as surgeons call retiring – more than two years ago, although I continue to teach and lecture.</p><p>Henry Marsh’s latest book, And Finally: Matters of Life and Death, is out now</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/25/brain-surgery-dolls-houses\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/25/gibraltar-uk-police-asked-to-help-with-inquiry-into-alleged-government-corruption", "title": "Gibraltar: UK police asked to help with inquiry into alleged government corruption", "date_published": "2022-12-25 14:00:04+00:00", "description": "<p>Royal Gibraltar police ask British counterparts to investigate alleged data breach in interests of ‘transparency’</p><p>UK police have been called in to lead an investigation into a data breach in a <a href=\"https://www.theguardian.com/world/2022/sep/04/gibraltar-government-braces-for-inquiry-into-alleged-corruption-on-security-contracts\">public inquiry concerning alleged corruption</a> at the top of <a href=\"https://www.theguardian.com/world/gibraltar\">Gibraltar</a>’s government.</p><p>The development is the latest twist in the inquiry, which is to hear explosive allegations by the British overseas territory’s former police chief, Ian McGrail.</p> <a href=\"https://www.theguardian.com/world/2022/dec/25/gibraltar-uk-police-asked-to-help-with-inquiry-into-alleged-government-corruption\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/26/welcome-to-the-best-week-of-the-year-this-week-nothing-matters", "title": "Welcome to the best week of the year! This week nothing matters | Jess Harwood", "date_published": "2022-12-25 14:00:04+00:00", "description": "<p>The pudding-fuelled time warp of partial consciousness between Christmas and New Year</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/26/welcome-to-the-best-week-of-the-year-this-week-nothing-matters\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/25/murders-dom-phillips-bruno-pereira-brazil-amazon", "title": "‘Amazonia, you beauty!’ How the murders of Dom Phillips and Bruno Pereira renewed the fight for Brazil’s forests", "date_published": "2022-12-25 14:00:04+00:00", "description": "<p>Six months on, is something positive coming from the killings that shocked the world?</p><p>Sunday 5 June started peacefully for Dom Phillips. The British journalist was in the rainforest on a reporting trip for his book, How to Save the Amazon. Just after dawn he got in a small launch with his friend and guide, Bruno Pereira, and they travelled up the Itaquaí River, only the sound of the birds and the motor breaking the comforting silence. But then they were ambushed and both men were shot dead. The killers, angry at Pereira for trying to stop their illegal fishing racket, dragged their bodies into the forest and buried them.</p><p>The murders hit headlines around the world and shone a light on a region where violence has soared since rightwing president Jair Bolsonaro took power on 1 January 2019. After a slow response, Brazilian police, with the considerable assistance of the Indigenous local people, took action and three people are in jail awaiting trial for the killings. Another man identified as the possible intellectual author of the crime was released from custody in October and is under house arrest.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/25/murders-dom-phillips-bruno-pereira-brazil-amazon\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/uk-news/2022/dec/25/family-finally-united-in-the-uk-after-fleeing-yemen", "title": "‘We are overjoyed’: the family finally united in the UK after fleeing Yemen", "date_published": "2022-12-25 14:00:04+00:00", "description": "<p>Half the Hareth family obtained visas, but three sons faced years of danger and uncertainty, until they were recognised as refugees</p><p>A refugee family have celebrated their first festive season safely together in two and a half years after the Home Office abandoned threats to deport three of them because they arrived in the UK on a small boat.</p><p>The Hareth family – mother, Ferdowz, and father, Hussein, both 55, Hamzah, 27, Hassan, 25, Hazem, 24, and Azzam, 14, fled war in Yemen, but had very different journeys to the UK and contrasting experiences of dealing with the Home Office even though their circumstances were identical. </p> <a href=\"https://www.theguardian.com/uk-news/2022/dec/25/family-finally-united-in-the-uk-after-fleeing-yemen\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/society/2022/dec/25/long-covid-patients-unproven-expensive-treatments-experts-warn", "title": "Long Covid patients using unproven and expensive treatments, experts warn", "date_published": "2022-12-25 14:00:03+00:00", "description": "<p>Lack of approved therapies and need to work means people are turning to options such as ‘blood washing’ </p><p>People with long Covid are turning to unproven and expensive treatments because of a lack of approved therapies coupled with a need to return to paid work, experts have warned.</p><p>According to figures from the Office for National Statistics, more than 2.1 million people in November were still living with Covid symptoms more than four weeks after the first confirmed or suspected infection – about 3.3% of the UK population.</p> <a href=\"https://www.theguardian.com/society/2022/dec/25/long-covid-patients-unproven-expensive-treatments-experts-warn\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/25/mafia-themed-food-items-unacceptable-says-italian-farmers-group", "title": "Mafia-themed food items sold abroad unacceptable, says Italian farmers", "date_published": "2022-12-25 13:00:02+00:00", "description": "<p>Investigation takes aim at everything from Cosa Nostra whiskey to El Padrino restaurant in Spain and Nasi Goreng Mafia eaterie in Indonesia </p><p>Italy’s biggest farmers’ association is waging a battle against the “scandalous” use of mafia terms to sell a variety of food and drink products around the world, from Cosa Nostra whiskey to Chilli Mafia tomato sauce.</p><p>Coldiretti undertook an extensive investigation and also discovered that almost 300 restaurants beyond Italy have mafia-themed names, including El Padrino in Spain, Don Corleone in Finland, Burger Mafia in Germany, Falafel Mafia in the US and Nasi Goreng Mafia in Indonesia.</p> <a href=\"https://www.theguardian.com/world/2022/dec/25/mafia-themed-food-items-unacceptable-says-italian-farmers-group\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/politics/2022/dec/25/senior-tories-risk-losing-seats-nigel-farage-returns-politics-reform-uk", "title": "Senior Tories risk losing seats if Nigel Farage returns to politics, experts say", "date_published": "2022-12-25 13:00:02+00:00", "description": "<p>Reform UK resurgence and a Labour swing could threaten Iain Duncan Smith, Dominic Raab and Theresa Villiers</p><p>Iain Duncan Smith, Dominic Raab and Theresa Villiers are among a swathe of Conservative MPs at risk of losing their seats if the Tories face a resurgent populist party led by Nigel Farage alongside a Labour swing at the next election, experts have said.</p><p>Their constituencies are among hundreds of Tory-held ones where <a href=\"https://www.theguardian.com/politics/2019/nov/11/brexit-party-will-not-contest-317-tory-seats-nigel-farage-says\">the Brexit party did not stand</a> in the 2019 general election, but the already slim majorities would be destroyed by the Reform UK candidates attracting even relatively small numbers of voters.</p> <a href=\"https://www.theguardian.com/politics/2022/dec/25/senior-tories-risk-losing-seats-nigel-farage-returns-politics-reform-uk\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/news/gallery/2022/dec/25/christmas-swims-and-santa-treats-christmas-days-best-photos", "title": "Festive swims and Santa treats: Christmas Day’s best photos", "date_published": "2022-12-25 12:59:44+00:00", "description": "<p>Guardian picture editors bring you the best Christmas 2022 pictures from across the world </p> <a href=\"https://www.theguardian.com/news/gallery/2022/dec/25/christmas-swims-and-santa-treats-christmas-days-best-photos\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/25/archbishop-of-canterbury-and-pope-francis-call-for-end-to-war-in-ukraine", "title": "Archbishop of Canterbury and Pope Francis call for end to war in Ukraine", "date_published": "2022-12-25 12:55:31+00:00", "description": "<p>Pontiff says world suffering from ‘famine of peace’ as Justin Welby praises example of late monarch</p><p>The archbishop of Canterbury and Pope Francis have used their Christmas addresses to call for an end to the war in Ukraine.</p><p>During his sermon, Justin Welby also spoke of those suffering “immense anxiety and hardship” during the cost of living crisis and made reference to the “desperate struggles of hospital wards”.</p> <a href=\"https://www.theguardian.com/world/2022/dec/25/archbishop-of-canterbury-and-pope-francis-call-for-end-to-war-in-ukraine\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/25/he-gave-me-a-battered-copy-of-a-book-i-already-owned-and-i-felt-id-come-home-the-christmas-present-ill-never-forget", "title": "He gave me a battered copy of a book I already owned, and I felt I’d come home – the Christmas present I’ll never forget", "date_published": "2022-12-25 12:00:02+00:00", "description": "<p>Afters years of expectation, hope and disappointment, all it took was one simple, heartfelt gift to show me he was the one</p><p>I have an embarrassing secret. I <em>love </em>getting presents. I know it is supposed to be more blessed to give than to receive. I know that 50% of all Christmas gifts are grudging Secret Santa purchases, and 100% of those are always the third item in a Boots 3-for-2 special – a Soap &amp; Glory shower puff. And I know I’m too old and too ugly for stockings and surprises. First, I’m at a truly privileged point in my life where I already have everything I already need. Second, my top gift from Christmas 2021 was a high-sided sauté pan. I’m not going to wake up on 25 December and find a shiny bicycle under the tree.</p><p>And yet I live in hope. I long for the romance of surprise. The bar has been set high. At Christmas 2012, my husband presented me with one of the most romantic and surprising gifts I have ever received. It wasn’t set with diamonds, and it didn’t come with a shiny bell and basket. It was an old book, long separated from its dustjacket. A book I already owned.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/25/he-gave-me-a-battered-copy-of-a-book-i-already-owned-and-i-felt-id-come-home-the-christmas-present-ill-never-forget\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/business/2022/dec/25/aptamer-york-biotech-cancer-treatments", "title": "Aptamer: the York biotech working on precision cancer treatments", "date_published": "2022-12-25 12:00:00+00:00", "description": "<p>UK firm links with up global drug firms to make synthetic antibodies capable of binding to targets such as tumour cells</p><p>Inside a science park lab next to the University of York, two clusters of robots are busy moving clear plates with mechanical arms as they screen many millions of molecules. The machines need only 24 hours to complete work that would usually take teams of human scientists several days. </p><p>The lab is run by Aptamer Group, a small biotech firm that has quietly carved out a leading position in the development of a highly sought after technology. Its scientists create aptamers – fragments of DNA, also known as synthetic antibodies, that are used to diagnose illnesses, or to deliver drugs to their target to fight a range of diseases including cancer.</p> <a href=\"https://www.theguardian.com/business/2022/dec/25/aptamer-york-biotech-cancer-treatments\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/25/frodsham-cheshire-golf-course-transformed-woodland", "title": "Rewilded former golf course in Cheshire to be transformed into woodland", "date_published": "2022-12-25 11:30:00+00:00", "description": "<p>Frodsham golf course joins growing number of sites being put to new, more community friendly use</p><p>It was once an immaculate golf course where footballers such as Michael Owen and Dietmar Hamann teed off.</p><p>These days, the only holes are those made by badgers and woodpeckers. Instead of golfers, self-sown silver birch saplings march over the greens.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/25/frodsham-cheshire-golf-course-transformed-woodland\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/25/2022-guitar-god--six-strings-electric-self-expression", "title": "In 2022 we needed ways to connect with ourselves: thank God for the guitar | John Harris", "date_published": "2022-12-25 11:00:04+00:00", "description": "<p>The democratic magic of six strings, two hands and an electric current – a means of self-expression as perfect as it has ever been</p><p>In the world of music, two of this year’s seemingly endless losses happened within a fortnight of each other. Both led to outpourings<br />of appreciation and reminiscence centred on an invention that is heading towards its 100th birthday: the electric guitar, that enduring<br />symbol of noise, excitement, and the basic human urge to express yourself.</p><p>Wilko Johnson – born John Wilkinson, in 1947 – passed away on 21 November. By the time of his death, he had become a kind of left-field national treasure, <a href=\"https://www.imdb.com/title/tt4188192/\">portrayed in</a> two <a href=\"https://www.theguardian.com/film/2010/feb/04/oil-city-confidential-review\">feature-length documentaries</a>, and given a silent part in the huge TV show Game of Thrones. <a href=\"https://www.theguardian.com/music/2022/nov/23/wilko-johnson-obituary\">His obituaries </a>told the story of his roots in Canvey Island, on the Thames estuary, and a later phase of life that had included the resurrection-like experience of being diagnosed with late-stage cancer in 2012, only to be <a href=\"https://www.bbc.co.uk/news/entertainment-arts-29727632\">apparently cured</a>. But what really mattered were the two key things he had brought to the prophetic 1970s rhythm and blues band Dr Feelgood: songs that beautifully romanticised where he was from (their first album was titled Down By the Jetty), and a unique way of playing his instrument.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/25/2022-guitar-god--six-strings-electric-self-expression\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/25/threat-unity-anger-over-push-make-hindi-national-language-of-india", "title": "‘A threat to unity’: anger over push to make Hindi national language of India", "date_published": "2022-12-25 11:00:04+00:00", "description": "<p>Ruling BJP accused of agenda of ‘Hindi imposition’ in a country with more than 700 languages</p><p>Tensions are rising in India over prime minister Narendra Modi’s push to make Hindi the country’s dominant language.</p><p>Modi’s Bharatiya Janaya party (BJP) government has been accused of an agenda of “Hindi imposition” and “Hindi imperialism” and non-Hindi speaking states in south and east India have been fighting back.</p> <a href=\"https://www.theguardian.com/world/2022/dec/25/threat-unity-anger-over-push-make-hindi-national-language-of-india\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/25/f1-teams-told-they-must-work-to-improve-governance-and-transparency", "title": "F1 teams told they must work to improve governance and transparency", "date_published": "2022-12-25 10:30:04+00:00", "description": "<ul><li>Only three of the 10 F1 teams had a published code of ethics</li><li>Clarity needed on issues such as sustainability and human rights</li></ul><p>Formula One teams must do more to improve their governance and transparency if they are to embrace a sustainable future, according to new research.</p><p>The report by the Standard Ethics group has concluded that F1 teams need to make clear their position and goals on environmental, social and governance issues, with only three of the 10 on the grid currently having a publicly stated code of ethics.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/25/f1-teams-told-they-must-work-to-improve-governance-and-transparency\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/education/2022/dec/25/uk-scheme-supporting-black-students-to-reach-oxbridge-expands-to-nursery-schools", "title": "UK scheme supporting Black students to reach Oxbridge expands to nursery schools", "date_published": "2022-12-25 10:30:04+00:00", "description": "<p>The Hemisphere programme helps teachers see how unconscious damages students’ prospects </p><p>One of the UK’s most successful schemes supporting students of Black heritage to get into Oxford and Cambridge universities is expanding to help children as young as three years old to achieve their academic potential.</p><p><a href=\"https://targetoxbridge.co.uk/year-10.html\">Target Oxbridge</a> has worked with more than 800 Black British students, of whom more than 350 have secured Oxbridge offers. In 2021, alumni from the scheme made up 24% of the Black British undergraduates starting at the universities.</p> <a href=\"https://www.theguardian.com/education/2022/dec/25/uk-scheme-supporting-black-students-to-reach-oxbridge-expands-to-nursery-schools\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/football/2022/dec/25/mikel-arteta-arsenal-gabriel-jesus-keep-faith", "title": "Arteta keeps the faith in Arsenal’s resurrection despite absence of Jesus", "date_published": "2022-12-25 10:30:03+00:00", "description": "<p>Manager confident his side can cope with challenges but league leaders must find a way to prosper without injured key forward</p><p>When Gabriel Jesus limped from the Lusail Stadium field on 2 December, having played 64 minutes for Brazil in a game against Cameroon they could afford to lose – and <a href=\"https://www.theguardian.com/football/2022/dec/02/cameroon-brazil-world-cup-group-g-match-report\">eventually did</a> – the effect on his club bordered on catastrophic.</p><p>Thursday brought the regrettable sight of Jesus on crutches at Arsenal’s London Colney training ground. “Progressing”, followed by a series of motivational emojis, was the one-word social media message. After Mikel Arteta said he was unwilling to set a timescale on a return from mangled medial knee ligaments, the Arsenal manager next veered into the dangerous territory of attempting to take the positives.</p> <a href=\"https://www.theguardian.com/football/2022/dec/25/mikel-arteta-arsenal-gabriel-jesus-keep-faith\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/2022/dec/25/can-controversial-geoengineering-fix-climate-crisis", "title": "Can geoengineering fix the climate? Hundreds of scientists say not so fast", "date_published": "2022-12-25 10:00:03+00:00", "description": "<p>The Biden administration is developing a controversial solar geoengineering research plan to the dismay of many experts</p><p>As global heating escalates, the US government has set out a plan to further study the controversial and seemingly sci-fi notion of deflecting the sun’s rays before they hit Earth. But a growing group of scientists denounces any steps towards what is known as solar geoengineering.</p><p>The White House has set into motion a <a href=\"https://www.whitehouse.gov/ostp/legal/\">five-year outline for research</a> into “climate interventions”. Those include methods such as sending a phalanx of planes to spray reflective particles into the upper reaches of the atmosphere, in order to block incoming sunlight from adding to rising temperatures.</p> <a href=\"https://www.theguardian.com/environment/2022/dec/25/can-controversial-geoengineering-fix-climate-crisis\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/25/christmas-cake-traditional-sri-lankan-treat-uniting-island-diaspora", "title": "Christmas cake: the traditional Sri Lankan treat uniting an island and its diaspora", "date_published": "2022-12-25 10:00:03+00:00", "description": "<p>The nation has been rattled by economic crisis, political upheaval and corruption, but many believe the dessert-making custom could spark joy in these bleak times</p><p>As a child in Colombo, Sri Lanka, Oryan Cumaraiah-Misso remembers excitedly readying himself in front of a handheld meat grinder to crush cashews. It was his part in his family’s annual tradition of preparing a 60-year-old recipe for Christmas cake that had been passed down for generations. Christmas cake – a moist, decadent treat filled with nuts and fruit – usually kicks off the holiday season on the island nation, and for immigrants in the US, has become a way to preserve traditions from back home.</p><p>Sri Lanka’s Christmas cake is similar to the fruit cake, a quintessentially British dish, but has since evolved from its colonial roots. Like the British version, Christmas cake includes raisins and cherries, but also preserved ginger, the green vegetable chayote (or chow chow, as Sri Lankans call it) in sugar syrup, preserved melon (known as <em>puhul dosi</em>), candied peel, sultanas and aromatics like nutmeg.</p> <a href=\"https://www.theguardian.com/world/2022/dec/25/christmas-cake-traditional-sri-lankan-treat-uniting-island-diaspora\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/25/it-wont-be-like-before-christmas-in-ukraine-transformed-by-war", "title": "‘It won’t be like before’: Christmas in Ukraine transformed by war", "date_published": "2022-12-25 10:00:03+00:00", "description": "<p>With many of the usual traditions cancelled, Ukrainians are doing their best to keep the festive spirit alive</p><p>On Christmas Eve, as Ukrainian Catholics gathered to celebrate in the Latin Cathedral in the western city of Lviv, the electricity was off, the consequence of the recent waves of Russian missile strikes on the country’s power grid.</p><p>The family of Oksana Mykhailivna, 50, one of the congregants will be celebrating twice this year, because of a push to move away from the Orthodox calendar – which marks Christmas on 7 January – and because of other consequences of the war.</p> <a href=\"https://www.theguardian.com/world/2022/dec/25/it-wont-be-like-before-christmas-in-ukraine-transformed-by-war\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/25/new-york-law-bans-pet-sale-dogs-cats-rabbits", "title": "Animal welfare advocates hail New York law banning sale of pets at retail stores", "date_published": "2022-12-25 09:00:02+00:00", "description": "<p>The legislation aims to end the ‘puppy mill-to-pet store pipeline’ for abusive breeders of dogs, cats and rabbits</p><p><a href=\"https://www.theguardian.com/world/animal-welfare\">Animal welfare</a> advocates in <a href=\"https://www.theguardian.com/us-news/new-york\">New York</a> are heralding the <a href=\"https://www.governor.ny.gov/news/governor-hochul-signs-legislation-end-puppy-mill-pipeline\">recent approval</a> of a statewide law that prohibits the sale of <a href=\"https://www.theguardian.com/lifeandstyle/dogs\">dogs</a>, <a href=\"https://www.theguardian.com/lifeandstyle/cats\">cats</a> and <a href=\"https://www.theguardian.com/environment/2021/nov/28/hope-rabbit-hotels-can-help-britains-decimated-population-bounce-back\">rabbits</a> at retail pet stores to “end the <a href=\"https://www.theguardian.com/world/2017/dec/18/ending-puppy-farms-are-victorias-new-laws-the-right-approach\">puppy mill</a>-to-pet store pipeline and stop abusive breeders” and help more stray and abandoned pets find homes.</p><p>The law, which goes into effect in 2024, will not outright bar pet shops from having four-legged friends on display as retailers may charge rescue organizations rent to present ready-to-adopt companion animals. But it has been hailed as a major achievement for animal welfare by its backers.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/25/new-york-law-bans-pet-sale-dogs-cats-rabbits\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/technology/2022/dec/25/worst-tech-ceo-musk-bankman-fried-holmes-zuckerberg-bezos", "title": "Musk, Zuck, SBF: the lousiest tech bosses of 2022 – rated", "date_published": "2022-12-25 09:00:02+00:00", "description": "<p>It’s been a bad year for delusional egomaniacs in Silicon Valley. But who had it worst? </p><p>It’s been a pretty good few decades for America’s top tech CEOs, as their supposed brilliance turned them into billionaire oligarchs with cultlike followings. But in 2022, things suddenly looked a bit bleaker.</p><p>Mark Zuckerberg’s Meta and Jeff Bezos’s Amazon reportedly cut thousands of workers. Elon Musk, once hailed as a<strong> </strong>genius, has revealed a truly impressive level of incompetence at Twitter. Elizabeth Holmes was sentenced to more than a decade in prison. And then there’s Sam Bankman-Fried, who recently became a household name for disastrous reasons.</p> <a href=\"https://www.theguardian.com/technology/2022/dec/25/worst-tech-ceo-musk-bankman-fried-holmes-zuckerberg-bezos\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/tv-and-radio/2022/dec/25/the-bear-jeremy-allen-white-best-workplace-drama-since-mad-men", "title": "‘Best workplace drama since Mad Men’: the sandwich-makers who shook the world", "date_published": "2022-12-25 09:00:02+00:00", "description": "<p>How did The Bear – a small, indie-feeling series about a top chef who returns home to save the family business – become such a TV sensation? We unravel a story of chaos, obsession and thinly-sliced beef</p><p>When The Bear appeared on screens in the US this year, it arrived with few expectations. A small, indie-feeling drama about an ailing Chicago sandwich shop, it came with a semi-recognisable cast and a creator best known for directing standup specials. Three months later, when it debuted in the UK, the buzz was palpable. And now? The consensus is that it might be the best workplace drama since Mad Men.</p><p>The story of Carmy Berzatto, a celebrated chef who returns home to save the family business after the suicide of his brother, The Bear arrives at a gallop and never lets up. There’s obsession. There’s chaos. There is an episode delivered in a single breathless shot. The Bear has been such a sensation that media coverage has long since crept out from the television pages. We’ve seen articles about the food, the music, even Berzatto’s <a href=\"https://www.theguardian.com/fashion/2022/oct/14/real-star-the-bear-carmy-perfect-white-t-shirt\" title=\"\">favourite brand of T-shirt</a>. It has been called the sexiest show of the year and the most stressful. In an age dominated by spin-offs, knock-offs and prequels, people have taken to this wildly original series like it’s a long lost relative. And the show’s cast is as surprised as anyone by its success.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/25/the-bear-jeremy-allen-white-best-workplace-drama-since-mad-men\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/environment/gallery/2022/dec/25/age-of-extinction-year-pictures-guardian-photographers-nature-conservationists-aoe", "title": "Frisky bison and blooming streets: Age of Extinction’s year in pictures – UK", "date_published": "2022-12-25 08:00:02+00:00", "description": "<p>Guardian photographers travelled across the country to capture the work of nature lovers and conservationists. They came back with heritage oats, urban oases and the sadness of storm-ripped trees</p> <a href=\"https://www.theguardian.com/environment/gallery/2022/dec/25/age-of-extinction-year-pictures-guardian-photographers-nature-conservationists-aoe\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/25/january-6-proud-boys-trial-begins-enrique-tarrio", "title": "Highest-profile January 6 trial begins with Proud Boys leader Enrique Tarrio", "date_published": "2022-12-25 08:00:01+00:00", "description": "<p>Chairman of militia group and four others are charged with seditious conspiracy related to Capitol insurrection</p><p>The January 6 committee investigating the attack on the Capitol may have issued its huge final report, but the wheels of the justice system in the US are grinding on and one of the most high-profile trials emerging from the insurrection is about to begin in earnest.</p><p>Jury selection began last week with the seditious conspiracy trial against ex-Proud Boys national chairman Enrique Tarrio and four others involved in the far-right, often violent militia group.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/25/january-6-proud-boys-trial-begins-enrique-tarrio\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/25/chocolate-santa-new-orleans", "title": "How ‘Chocolate Santa’ brought joy to New Orleans again after tragedy", "date_published": "2022-12-25 08:00:01+00:00", "description": "<p>When the original Santa for the majority-Black Seventh Ward died a new one stepped into his boots, inspired by his memory</p><p>For Theron Murphy, the only thing cooler than taking pictures as a child with a Santa Claus who – like him – was Black was eventually getting the jolly guy’s blessing to carry on his spirit. Murphy, 33, was among the generations of children taken by their parents to Dennis Photofinish studio at the corner of St Bernard Avenue and North Tonti Street in <a href=\"https://www.theguardian.com/us-news/new-orleans\">New Orleans</a>’s majority-Black Seventh Ward <strong> </strong>neighborhood to have their portrait taken with the man countless folks in the city simply knew affectionately by his <a href=\"https://obits.nola.com/us/obituaries/nola/name/fred-parker-obituary?id=2268891\">preferred nickname</a>: “Chocolate Santa”.</p><p>Chocolate Santa for most of the year was school bus driver Fred Parker. But when the holidays rolled around, Parker transformed into Chocolate – or Seventh Ward – Santa, complete with the traditional red suit and hat. He sat patiently listening to wishes for toys and other Christmas miracles at the portrait studio or at the schools, daycares, hospitals, markets and malls he visited during “the most wonderful time of the year” for nearly five decades.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/25/chocolate-santa-new-orleans\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/25/i-had-my-tongue-pierced-and-couldnt-eat-the-turkey-the-christmas-present-ill-never-forget", "title": "I had my tongue pierced … and couldn’t eat the turkey – the Christmas present I’ll never forget", "date_published": "2022-12-25 08:00:01+00:00", "description": "<p>It wasn’t exactly me, but I’d asked my girlfriend for the piercing as a gift. I have no idea why</p><p>No, I don’t know why I asked my girlfriend for a tongue piercing for Christmas.</p><p>It wasn’t exactly “me”, an introverted, 21-year-old indie music fan not prone to bold style statements. Was it a desperate attempt to hang on to some youthful irresponsibility after recently leaving the safety net of university life? Or a nod to my immersion in DayGlo psychedelic trance raves – surprisingly popular in Leeds around the turn of the millennium, and often frequented by the kind of person who thought forcing a steel bar through a crucial muscle was an eminently sensible idea? Or maybe I was simply trying to impress said girlfriend?</p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/25/i-had-my-tongue-pierced-and-couldnt-eat-the-turkey-the-christmas-present-ill-never-forget\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/theguardian/2022/dec/25/the-king-williams-college-quiz-2022", "title": "The King William’s College quiz 2022", "date_published": "2022-12-25 08:00:00+00:00", "description": "<p>Who is remembered at Geddington? Which Girl of my Heart perished at Kastellorizo? Why did Charmian decline the queen’s demand to play billiards? These, and 177 more confounding conundrums, await</p><p><em>Editor’s note: the King William’s College quiz has appeared in the Guardian since 1951. The quiz is no longer sat formally; it is sent to the schoolchildren and their families to tackle over the Christmas holiday. So yes, you are allowed to Google – however, the questions are constructed to make that less than straightforward. Good luck!</em></p><p>General knowledge paper, 2022-23, No 118, sat by the pupils of King William’s College, Isle of Man</p> <a href=\"https://www.theguardian.com/theguardian/2022/dec/25/the-king-williams-college-quiz-2022\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/25/a-second-front-fight-to-save-cave-complexes-from-developers-in-ukraine", "title": "‘A second front’: fight to save cave complexes from developers in Ukraine", "date_published": "2022-12-25 08:00:00+00:00", "description": "<p>Archaeologists say caves must be preserved for ‘indisputable and cultural value’</p><p>Dmytro Perov was at his day job, analysing planning applications for Kyiv city council, when he saw a familiar address – the derelict house in central Kyiv built by his family in the late 1800s that was confiscated by the Bolsheviks. The owners of the site now wanted to build on it and had made the unlikely claim that their office was based at the house, which Perov knew had no roof and collapsed walls.</p><p>When he was a child, his grandmother said somewhere on the land around the former family home were rumoured to be ancient caves. He described it as a “small family legend”. Ukraine is home to a few cave complexes, most of which were built by monks, the most famous being Kyiv’s <em>Pecherska La</em><em>vra</em> – or Cave Monastery in English.</p> <a href=\"https://www.theguardian.com/world/2022/dec/25/a-second-front-fight-to-save-cave-complexes-from-developers-in-ukraine\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/commentisfree/2022/dec/25/parcel-delivery-company", "title": "Ah yes, exactly where I wanted my parcel – delivered to somebody else’s foot | Diane Morgan", "date_published": "2022-12-25 07:00:18+00:00", "description": "<p>I wouldn’t have been surprised to find this delivery company was running the country – it would explain a lot</p><ul><li>What was the image on your phone that defined 2022? <a href=\"https://www.theguardian.com/commentisfree/series/snapshot-of-2022\">Writers give their perspectives</a></li></ul><p>“We have successfully delivered your package”, the delivery company said, and to prove it, they sent me a photo of a woman’s foot. I didn’t recognise the foot. Or the door. But they were insistent they’d been successful at their ONE JOB. </p><p>If they’d said, “We are so badly paid that we don’t give a toss about your stupid parcel,” or even, “We booted your parcel off a cliff for fun,” I’d have found it easier to forgive them, but it was the fact that they seemed genuinely pleased with the service they’d given that bothered me.</p><p>Diane Morgan is an actor, comedian and writer. Cunk On … is on BBC iPlayer</p> <a href=\"https://www.theguardian.com/commentisfree/2022/dec/25/parcel-delivery-company\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/25/plan-b-morning-after-pill-contraceptive-abortion", "title": "Plan B morning-after contraceptive is not abortion pill, US to specify", "date_published": "2022-12-25 07:00:18+00:00", "description": "<p>FDA regulators to change packaging labels to make clear pill will not work if person is already pregnant</p><p>The US Food and Drug Administration has announced it will change packaging labels for the emergency contraceptive Plan B, to specify that it is not an abortion pill.</p><p>According to many anti-abortion activists, any form of disruption to an egg is considered an abortion.</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/25/plan-b-morning-after-pill-contraceptive-abortion\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/us-news/2022/dec/25/fauci-interview-covid-trump-biden", "title": "‘I had to fulfil my responsibility’: Fauci on his career, Covid and stepping down", "date_published": "2022-12-25 07:00:18+00:00", "description": "<p>America’s top health official, a cult figure for millions, has advised seven US presidents – but will he speak freely about Trump’s response to coronavirus?</p><p>Dr Anthony Fauci speaks to the Guardian via Zoom a couple of hours before his leaving do, marking the end of a 54-year career at the National Institute of Allergy and Infectious Diseases (NIAID).</p><p>“That’s going to be done according to all public health guidelines,” America’s top public health official, wearing dark suit, blue shirt and blue-and-white polka dot tie, is quick to add. “People with masks and people online and people dialling in through Zoom, so it’s not going to be the classical party.”</p> <a href=\"https://www.theguardian.com/us-news/2022/dec/25/fauci-interview-covid-trump-biden\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/live/2022/dec/25/russia-ukraine-war-live-zelenskiy-says-ukrainians-are-creating-their-own-miracle-in-christmas-eve-address", "title": "Russia-Ukraine war live: Zelenskiy says Ukrainians are creating their own ‘miracle’ in Christmas Eve address", "date_published": "2022-12-25 06:57:06+00:00", "description": "<p>Ukraine’s President delivers defiant message as many Ukrainians remain without power and calls attacks on Kherson that left 10 dead acts of ‘terror’</p><ul><li><a href=\"https://www.theguardian.com/world/2022/dec/25/russia-ukraine-war-at-a-glance-what-we-know-on-day-305-of-the-invasion\">What we know on day 305 of the invasion</a></li></ul><p>Hello and welcome to today’s coverage of the war in Ukraine. My name is Jonathan Yerushalmy and I’ll be with you for the next while.</p><p>It’s 9am in Kyiv where some will be celebrating Christmas Day, however most Ukrainians are Orthodox Christians and will therefore mark the occasion in early January.</p><p>At least ten people were killed and an estimated 58 wounded on Saturday in Russian shelling on the recently recaptured Ukrainian city of <strong>Kherson</strong>. The region was targeted by 74 Russian strikes. 66 cars caught fire in a residential area of the city due to the shelling, the emergency services said.</p><p><strong>Volodymyr Zelenskiy</strong> called the attacks on Kherson “terror … killing for the sake of intimidation and pleasure”. He said: “it is the real life of Ukraine … The world must see and understand what absolute evil we are fighting against.”</p><p><strong>Ukraine’s</strong> defence minister, <strong>Oleksii Reznikov</strong>, said the attack in <strong>Kherson</strong> is more evidence that Ukraine needs to be supplied with more defence systems and called for more weapons and ammunition.</p><p>Reuters reporters in the <strong>Russian</strong>-occupied city of <strong>Mariupol</strong> have confirmed that authorities are demolishing and clearing what is left of the smashed rear portion of the cities theatre, where hundreds of <strong>Ukrainians</strong> were killed in Russian airstrikes after a protracted siege earlier this year.</p><p><strong>Ukraine</strong> has announced it has killed another 480 <strong>Russian</strong> troops, according to its latest casualty figures.</p><p><strong>The Netherlands</strong> has pledged €2.5bn ($2.7bn) to help Ukraine in 2023, with most of the money earmarked for military aid.</p><p>The rock band Pink Floyd has raised $600,000 for <a href=\"https://www.theguardian.com/world/ukraine\">Ukraine</a> with the song Hey Hey Rise Up.</p> <a href=\"https://www.theguardian.com/world/live/2022/dec/25/russia-ukraine-war-live-zelenskiy-says-ukrainians-are-creating-their-own-miracle-in-christmas-eve-address\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/25/nfl-round-up-week-16-saturday-gamres", "title": "NFL round-up: Backup QB Minshew comes up short for Eagles in loss to Cowboys", "date_published": "2022-12-25 06:14:35+00:00", "description": "<ul><li>Prescott, Cowboys win 40-34, make Eagles wait on top seed</li><li>Singletary, Cook lead way as Bills beat Bears for AFC East</li><li>Steelers honor Franco Harris by rallying past Raiders 13-10</li></ul><p>Dak Prescott threw for 347 yards and three touchdowns, Brett Maher kicked the go-ahead field goal late and the Dallas Cowboys beat the Philadelphia Eagles 40-34 on Saturday.</p><p>Gardner Minshew threw two scoring passes and had a TD run filling in for the injured Jalen Hurts, but his second interception set up Mahers go-ahead kick.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/25/nfl-round-up-week-16-saturday-gamres\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/books/2022/dec/25/january-6-report-trump-publishing-books-mueller", "title": "Will the January 6 report bring a second Christmas for US publishers?", "date_published": "2022-12-25 06:00:18+00:00", "description": "<p>Major imprints are racing to sell the committee’s work to the reading public, with help from reporters, panel members, David Remnick and even a former speechwriter to Trump</p><p>The release of the <a href=\"https://www.theguardian.com/us-news/2022/dec/24/january-6-report-review-845-pages-crimes-trump\">final report of the House January 6 committee</a> has sparked a deluge of publishing activity: seven editions of the 200,000 word document from six imprints, featuring contributions from the New Yorker editor, David Remnick, the House intelligence chair, Adam Schiff, plus six other journalists, another committee member, a former congresswoman and a former speechwriter to Donald Trump.</p><p>There are two reasons for this hyperactivity: the belief that the completion of the report is a significant historical event, and the conviction that here is a big chance to do well by doing good.</p> <a href=\"https://www.theguardian.com/books/2022/dec/25/january-6-report-trump-publishing-books-mueller\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/global-development/2022/dec/25/indigenous-rappers-rap-music-mother-tongue", "title": "Indigenous State of Mind: six music makers rapping in their mother tongues", "date_published": "2022-12-25 06:00:17+00:00", "description": "<p>Musicians are reclaiming their roots and languages, fighting for the rights of their people – and soundtracking Hollywood movies</p><p>“Though I was born in 1986 I carry with me more than 500 years of resistance,” are the opening words of Katu Mirim’s album, <a href=\"https://open.spotify.com/track/13jxNi2NFoxN6MGmqghLgr\">Revolta</a>. They set the scene for the uncompromising lyrics that follows, an assault on colonisation, slavery, inequality, homophobia, and other injustices that beset Brazil five centuries after Portuguese conquistadores arrived.</p> <a href=\"https://www.theguardian.com/global-development/2022/dec/25/indigenous-rappers-rap-music-mother-tongue\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/tv-and-radio/2022/dec/25/netflix-the-witcher-blood-origin-review-this-profanity-packed-fantasy-is-a-riot", "title": "The Witcher: Blood Origin review – this profanity-packed fantasy is a riot", "date_published": "2022-12-25 06:00:16+00:00", "description": "<p>Extremely bad-ass fights and hilariously playful swearing make this drama lots of fun – plus it’s only four episodes long. Everyone’s a winner! </p><p>Welcome to the resistance! Perhaps we ought not to look primarily to fantasy shows on streaming services for tips on how to combat authoritarianism, but you take what you can get. After <a href=\"https://www.theguardian.com/tv-and-radio/2022/nov/22/andor-how-a-star-wars-deep-cut-became-one-of-the-best-tv-shows-of-the-year\">Andor</a> on Disney+, with its comprehensive guide to grassroots rebellion in the Star Wars universe, now The Witcher: Blood Origin (Netflix) maps out how to fight back when The Man has pointy ears.</p><p>For this prequel to <a href=\"https://www.theguardian.com/tv-and-radio/2019/dec/27/the-witcher-netflix-games-of-thrones\">The Witcher</a>, we go back, back, back to 1,200 years before the time of Geralt of Rivia – and if you don’t know who that is, it matters not. Slide right into the self-contained story of a continent where elves, dwarves and other often-warring peoples are living in uneasy proximity, until the arrival of one vicious dictatorship to rule them all makes everyone even less relaxed. Out in the sticks, soldier turned travelling bard Éile (Sophia Brown) is already fomenting revolutionary solidarity by singing rousing folk songs in pubs – and, in her introductory scene, taking care of drunk punters who get aggressively handsy with a waitress, by stabbing them in the legs and smashing their faces on tables, before continuing to play her bowed zither thingy and sing about people power. We like her immediately.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/25/netflix-the-witcher-blood-origin-review-this-profanity-packed-fantasy-is-a-riot\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/25/china-stops-publishing-daily-covid-figures-amid-reports-of-explosion-in-cases", "title": "China stops publishing daily Covid figures amid reports of explosion in cases", "date_published": "2022-12-25 05:24:50+00:00", "description": "<p>The National Health Commission’s decision comes as the country’s health system faces enormous strain after the sudden end to the zero-Covid policy</p><p>China’s National Health Commission (NHC) has stopped publishing daily Covid-19 data, amid concerns about the reliability of the figures after infections exploded in the wake of an abrupt easing of tough restrictions.</p><p>“Relevant Covid information will be published by the Chinese Center for Disease Control and Prevention for reference and research,” the commission said in a statement, without specifying the reasons for the change or how frequently China CDC will update the public with new Covid information.</p> <a href=\"https://www.theguardian.com/world/2022/dec/25/china-stops-publishing-daily-covid-figures-amid-reports-of-explosion-in-cases\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/25/pope-condemns-power-hungry-and-alludes-to-ukraine-conflict-in-christmas-eve-mass", "title": "Pope condemns power hungry and alludes to Ukraine conflict in Christmas Eve mass", "date_published": "2022-12-25 01:39:06+00:00", "description": "<p>7,000 people fill St. Peter’s Basilica after several years of Covid imposed restrictions on attendance</p><p>Pope Francis warned in a solemn Christmas Eve Mass that the level of greed and hunger for power was such that some wanted to “consume even their neighbours”, in an apparent reference to the war in Ukraine.</p><p>Francis, celebrating the 10th Christmas of his pontificate, presided over a capacity crowd of about 7,000 in St. Peter’s Basilica after several years of restricted attendance because of Covid.</p> <a href=\"https://www.theguardian.com/world/2022/dec/25/pope-condemns-power-hungry-and-alludes-to-ukraine-conflict-in-christmas-eve-mass\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/sport/2022/dec/25/boxing-day-test-victorian-fast-bowler-scott-boland-retains-spot-over-hazlewood", "title": "Boxing Day Test: Victorian fast bowler Scott Boland retains spot over Hazlewood", "date_published": "2022-12-25 00:46:51+00:00", "description": "<ul><li>Victorian quick will return to the scene of his famous Test debut last December</li><li>Boland has taken 25 wickets in his five Tests</li></ul><p>Boxing Day Test hero Scott Boland has retained his spot in Australia’s star bowling attack and will line up at the MCG against South Africa.</p><p>The Victorian quick will return to the scene of his famous Test debut last December, with Australia selectors opting for Boland over Josh Hazlewood, who continues his recovery from a side strain.</p> <a href=\"https://www.theguardian.com/sport/2022/dec/25/boxing-day-test-victorian-fast-bowler-scott-boland-retains-spot-over-hazlewood\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/world/2022/dec/25/russia-ukraine-war-at-a-glance-what-we-know-on-day-305-of-the-invasion", "title": "Russia-Ukraine war at a glance: what we know on day 305 of the invasion", "date_published": "2022-12-25 00:45:19+00:00", "description": "<p>Ten dead and more than 50 injured in Russian strikes on Kherson; ‘We will endure this winter,’ Volodymyr Zelenskiy says in Christmas eve message</p><ul><li><a href=\"https://www.theguardian.com/world/ukraine\">See all our Ukraine war coverage</a></li></ul><p>At least ten people were killed and an estimated 58 wounded on Saturday in Russian shelling on the recently recaptured Ukrainian city of <strong>Kherson</strong>. The region was targeted by 74 Russian strikes. 66 cars caught fire in a residential area of the city due to the shelling, the emergency services said.</p><p><strong>Ukraine’s president, Volodymyr Zelenskiy</strong> called the attacks on Kherson “terror … killing for the sake of intimidation and pleasure”. He said: “it is the real life of Ukraine … The world must see and understand what absolute evil we are fighting against.”</p><p><strong>Ukraine’s</strong> defence minister, <strong>Oleksii Reznikov</strong>, said the attack in <strong>Kherson</strong> is more evidence that Ukraine needs to be supplied with more defence systems and called for more weapons and ammunition.</p><p>In a message on Saturday, <strong>Zelenskiy</strong> said Ukrainians will create their own miracle this Christmas by showing they remain unbowed despite Russian attacks that have plunged millions into darkness. The president made his remarks in a video address to Ukrainians who celebrate Christmas in December. Most Ukrainians are Orthodox Christians and mark the occasion in early January.</p><p>Reuters reporters in the <strong>Russian</strong>-occupied city of <strong>Mariupol</strong> have confirmed that authorities are demolishing and clearing what is left of the smashed rear portion of the cities theatre, where hundreds of <strong>Ukrainians</strong> were killed in Russian airstrikes after a protracted siege earlier this year. </p><p><strong>Ukraine</strong> has announced it has killed another 480 <strong>Russian</strong> troops, according to its latest casualty figures.</p><p>A <strong>Ukrainian</strong> official has called for <strong>Iranian</strong> drone and missile factories to be destroyed because of their use by Russia in the war. <strong>Mykhailo Podolyak</strong>, an adviser to <strong>Volodymyr Zelenskiy</strong> said that Iran “blatantly humiliates the institution of international sanctions”.</p><p><strong>The Netherlands</strong> has pledged €2.5bn ($2.7bn) to help Ukraine in 2023, with most of the money earmarked for military aid.</p><p>The rock band Pink Floyd has raised $600,000 for <a href=\"https://www.theguardian.com/world/ukraine\">Ukraine</a> with the song Hey Hey Rise Up.</p> <a href=\"https://www.theguardian.com/world/2022/dec/25/russia-ukraine-war-at-a-glance-what-we-know-on-day-305-of-the-invasion\">Continue reading...</a>", "persistent": false, "language": "en-US"}, {"source": "https://www.theguardian.com/international/rss", "link": "https://www.theguardian.com/lifeandstyle/2022/dec/25/should-my-girlfriends-dog-stop-sleeping-in-our-bed", "title": "Should my girlfriend’s dog stop sleeping in our bed?", "date_published": "2022-12-25 00:00:10+00:00", "description": "<p>She lets the dog spend the night with them; he thinks it’s gross. You make the call on where sleeping dogs should lie</p><p><em>Luna is always on our mattress at night, and I think it’s gross. She’s got a dog bed downstairs</em></p> <a href=\"https://www.theguardian.com/lifeandstyle/2022/dec/25/should-my-girlfriends-dog-stop-sleeping-in-our-bed\">Continue reading...</a>", "persistent": false, "language": "en-US"}], "source": {"url": "https://www.theguardian.com/international/rss", "title": "The Guardian - International"}}