{"entries": [{"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-25/niemcy-fala-zachorowan-na-covid-19-grype-i-rsv-okolo-9-mln-osob-z-objawami/", "title": "Niemcy: Fala zachorowań na COVID-19, grypę i RSV. Około 9 mln osób z objawami", "date_published": "2022-12-25 21:51:00+00:00", "description": "Choć wydawało się, że sytuacja związana z pandemią COVID-19 w Niemczech została opanowana, pojawiły się kolejne wyzwania. Oprócz wirusa SARS-CoV-2 masowo pojawiają się zakażenia wirusami RSV, grypą oraz bakteryjne infekcje dróg oddechowych. Jak informuje portal Focus Online, objawy takie jak ból gardła, kaszel, gorączka występują obecnie u około 9 mln obywateli tego kraju.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-25/austria-lawina-porwala-10-narciarzy-trwa-akcja-ratunkowa/", "title": "Austria. Lawina porwała 10 narciarzy. Trwa akcja ratunkowa", "date_published": "2022-12-25 20:46:00+00:00", "description": "Śnieżna lawina porwała 10 narciarzy w rejonie kurortu Lech-Zürs w zachodniej Austrii. W akcji ratunkowej bierze udział około 200 ratowników i kilka helikopterów. Jedną osobę udało się odnaleźć i wyciągnąć spod śniegu.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-25/usa-10-latka-znalazla-w-domu-bron-postrzelila-sie-w-reke/", "title": "USA: 10-latka znalazła w domu broń. Postrzeliła się w rękę", "date_published": "2022-12-25 19:44:00+00:00", "description": "Dziewczynka znalazła broń w swoim domu i postrzeliła się w rękę. Do wypadku doszło tuż przed Wigilią. Policja z Chicago informuje, że stan dziecka jest dobry. Trwa postępowanie wyjaśniające.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-25/chicago-trzy-samobojstwa-policjantow-w-ciagu-tygodnia/", "title": "Chicago. Trzy samobójstwa policjantów w ciągu tygodnia", "date_published": "2022-12-25 19:43:00+00:00", "description": "Rzecznik Policji w Chicago poinformował o samobójstwie jednego z funkcjonariuszy z miasta. Mundurowy miał 51 lat. Odebrał sobie życie w domu, po służbie. Trwa śledztwo w sprawie jego śmierci. To trzeci taki przypadek w Chicago w ciągu tygodnia.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-25/wielka-brytania-strzelanina-w-pubie-w-wigilie-jedna-osoba-nie-zyje-kilka-jest-rannych/", "title": "Wielka Brytania. Strzelanina w pubie w Wigilię. Jedna osoba nie żyje, kilka jest rannych", "date_published": "2022-12-25 16:04:00+00:00", "description": "Policja poszukuje sprawcy strzelaniny w jednym z pubów w Wallasey Village (Wielka Brytania), do której doszło w wigilię Bożego Narodzenia. W jej wyniku zginęła kobieta, a trzy inne osoby z ranami postrzałowymi trafiły do szpitala.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-25/wielka-brytania-pies-wzniecil-pozar-domu-strazacy-wlaczyl-suszarke-lezaca-na-lozku/", "title": "Wielka Brytania: Pies wzniecił pożar domu. Strażacy: Włączył suszarkę leżącą na łóżku", "date_published": "2022-12-25 16:02:00+00:00", "description": "Brytyjska straż pożarna obwinia psa za dziwaczny incydent w jednym z domów w Hockley w hrabstwie Essex. Zwierzę miało przypadkowo włączyć suszarkę do włosów leżącą na łóżku w sypialni i wzniecić pożar. Do zdarzenia doszło w Wigilię, pod nieobecność właściciela.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-25/usa-ewakuacja-pasazerow-na-lotnisku-w-nowym-jorku-w-samolocie-zapalil-sie-laptop/", "title": "USA. Ewakuacja pasażerów na lotnisku w Nowym Jorku. W samolocie zapalił się laptop", "date_published": "2022-12-25 15:19:00+00:00", "description": "Prawie 130 pasażerów ewakuowano w wigilijny wieczór z samolotu Airbus A320 na lotnisku w Nowym Jorku, kiedy na pokładzie maszyny wybuchł pożar. Siedem osób odniosło drobne obrażenia - podtruły się dymem i są posiniaczone.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-25/wielka-brytania-nie-zyje-mloda-kobieta-potracona-przez-radiowoz-policji/", "title": "Wielka Brytania. Nie żyje młoda kobieta potrącona przez radiowóz policji", "date_published": "2022-12-25 13:37:00+00:00", "description": "Do tragicznego wypadku doszło w Liverpoolu w wigilijną noc. Policyjny radiowóz potrącił 20-latkę. Kobiety nie udało się uratować", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-25/hiszpania-autobus-wpadl-do-rzeki-trzy-osoby-nie-zyja-cztery-sa-zaginione/", "title": "Hiszpania. Autobus wpadł do rzeki. Cztery osoby nie żyją, trzy są zaginione", "date_published": "2022-12-25 12:45:00+00:00", "description": "Co najmniej cztery osoby zaginęły, a trzy pozostają zaginione po wypadku autobusu na terenie gminy Cerdedo-Cotobade w Hiszpanii. Pojazd w Wigilię wieczorem wpadł do rzeki Lérez.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-25/papiez-franciszek-w-urbi-et-orbi-polozyc-natychmiastowy-kres-bezsensownej-wojnie-w-ukrainie/", "title": "Papież Franciszek w Urbi et Orbi: Położyć natychmiastowy kres bezsensownej wojnie w Ukrainie", "date_published": "2022-12-25 12:44:00+00:00", "description": "- Choć dany nam jest Książę Pokoju, to wichry wojny nadal wieją lodowatym chłodem nad ludzkością, a nasze czasy doświadczają poważnego głodu pokoju - mówił papież, udzielając tradycyjnego błogosławieństwa Urbi et Orbi (Miastu i Światu) w Boże Narodzenie. Franciszek zwracał uwagę, że żywność nie może być używana jako broń i modlił się o natychmiastowe zakończenie bezsensownej wojny na Ukrainie.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-25/strzelanina-we-francji-areszt-podejrzanego-uchylony-ze-wzgledow-zdrowotnych/", "title": "Strzelanina we Francji. Areszt podejrzanego uchylony ze względów zdrowotnych", "date_published": "2022-12-25 12:40:00+00:00", "description": "Areszt policyjny 69-letniego Williama M., podejrzanego o dokonanie w piątek ataku na ośrodek kurdyjski w Paryżu, został zniesiony w sobotę - poinformowała w niedzielę paryska prokurator Laure Beccuau. Lekarz, który badał podejrzanego stwierdził, że stan jego zdrowia nie pozwala na osadzenie w areszcie. William M. został przewieziony do szpitala psychiatrycznego.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-25/alarm-przeciwlotniczy-w-ukrainie-z-lotniska-na-bialorusi-wystartowal-rosyjski-samolot/", "title": "Alarm przeciwlotniczy w Ukrainie. Z lotniska na Białorusi wystartował rosyjski samolot", "date_published": "2022-12-25 11:28:00+00:00", "description": "W Ukrainie rano ogłoszono alarm przeciwlotniczy. Z Białorusi poderwał się samolot, który mógł przenosić rakiety dalekiego zasięgu. O świętach w cieniu wojny na antenie Polsat News mówił mer Lwowa Andrij Sadowy. - W Polsce ludzie idą do kościoła, a u nas do schronów - powiedział Sadowy.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-25/rosja-putin-krytykuje-zachod-i-zapowiada-zniszczenie-systemow-patriot-dostarczanych-ukrainie/", "title": "Rosja: Putin krytykuje Zachód i zapowiada zniszczenie systemów Patriot dostarczanych Ukrainie", "date_published": "2022-12-25 10:55:00+00:00", "description": "Prezydent Rosji Władimir Putin skrytykował Zachód za próbę rozerwania Rosji. Słowa padły w wywiadzie, który zostanie w całości wyemitowany w telewizji państwowej w niedzielę. Skomentował też zapowiedź dostarczenia Ukrainie przez Pentagon systemów obrony powietrznej Patriot. - Zniszczymy je. W 100 procentach!", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-25/rosja-pozar-centrum-handlowego-na-kubaniu/", "title": "Rosja. Pożar centrum handlowego na Kubaniu", "date_published": "2022-12-25 10:51:00+00:00", "description": "W mieście Tbiliska na Kubaniu w Rosji płonęło centrum handlowe. Ogień objął powierzchnię tysiąca metrów kwadratowych. To kolejny pożar w ciągu ostatnich kilku dni.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-25/wielka-brytania-tragedia-na-basenie-nie-zyje-czteroletni-chlopiec/", "title": "Wielka Brytania. Tragedia na basenie w Wigilię. Nie żyje czteroletni chłopiec", "date_published": "2022-12-25 10:43:00+00:00", "description": "W Wigilię doszło do tragicznego wypadku w jednym z kurortów wypoczynkowych w Wiltshire w Wielkiej Brytanii. Czteroletni chłopiec został wyciągnięty z basenu i mimo udzielonej mu natychmiast pomocy, zmarł.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-25/rosja-nie-zyje-szef-duzej-rosyjskiej-stoczni-z-petersburga-produkujacej-m-in-okrety-podwodne/", "title": "Rosja. Nie żyje szef dużej rosyjskiej stoczni z Petersburga produkującej m.in. okręty podwodne", "date_published": "2022-12-25 08:22:00+00:00", "description": "Duża rosyjska stocznia specjalizująca się w budowie niejądrowych okrętów podwodnych poinformowała, że ​​jej dyrektor generalny Aleksander Buzakow nie żyje. Mężczyzna zmarł nagle w sobotę po 11 latach pracy. Stocznia produkuje okręty zdolne do wystrzeliwania pocisków Kalibr.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-25/isw-rosyjska-ofensywa-pod-bachmutem-spowolnila-najezdzcy-chca-przerwy/", "title": "ISW: Rosyjska ofensywa pod Bachmutem spowolniła. Najeźdźcy chcą przerwy", "date_published": "2022-12-25 07:33:00+00:00", "description": "Amerykański Instytut Studiów nad Wojną (ISW) zaobserwował spowolnienie postępów wojsk rosyjskich w rejonie miasta Bachmut. Analitycy uważają, że świadczy to o chęci zainicjowania przez najeźdźców pauzy taktycznej lub operacyjnej.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-25/usa-potezna-burza-sniezna-nie-zyja-co-najmniej-22-osoby/", "title": "USA. Potężna burza śnieżna. Nie żyją co najmniej 22 osoby", "date_published": "2022-12-25 06:48:00+00:00", "description": "Potężna burza śnieżna pustoszy i paraliżuje Stany Zjednoczone. W całym kraju w wigilię Bożego Narodzenia półtora miliona odbiorców było pozbawionych prądu. Odwołano ponad 2600 lotów i ponad 6000 opóźnień. Arktyczne wiatry, duże opady śniegu i niebezpiecznie niskie temperatury pochłonęły życie co najmniej 22 osób.", "persistent": false, "language": "pl-PL"}, {"source": "https://www.polsatnews.pl/rss/swiat.xml", "link": "https://www.polsatnews.pl/wiadomosc/2022-12-25/wojna-w-ukrainie-10-miesiecy-walk-z-najezdzca-wolodymyr-zelenski-z-przeslaniem-do-chrzescijan/", "title": "Wojna w Ukrainie. 10 miesięcy walk z najeźdźcą. Wołodymyr Zełenski z przesłaniem do chrześcijan", "date_published": "2022-12-25 06:43:00+00:00", "description": "Prezydent Ukrainy Wołodymyr Zełenski przekazał życzenia dla chrześcijan, z okazji świąt Bożego Narodzenia. W obchodzoną wczoraj, według kalendarza gregoriańskiego, wigilię Bożego Narodzenia, minęło dokładnie 10 miesięcy od rozpoczęcia rosyjskiej agresji. - Złamie najeźdźcę nasz stalowy duch - zapewniał szef państwa.", "persistent": false, "language": "pl-PL"}], "source": {"url": "https://www.polsatnews.pl/rss/swiat.xml", "title": "Polsat News"}}