{"entries": [{"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/biznes/swieta-w-hotelu-oblozenie-na-poziomie-60-70-proc/xqxj6e1", "title": "Święta w hotelu. \"Obłożenie na poziomie 60-70 proc.\"", "date_published": "2022-12-25 14:56:17+00:00", "description": "Obłożenie hoteli w pasie nadmorskim i w Trójmieście w czasie świąt Bożego Narodzenia jest na poziomie 60-70 proc. Szef Pomorskiej Regionalnej Organizacji Turystycznej Łukasz Magrian przyznaje, że w sylwestra nadal wiele hoteli ma do zaoferowania wolne pokoje.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/biznes/michal-swierczewski-x-kom-i-rakow-od-wlasciciela-sklepiku-do-szefa-giganta/q6tsc5c", "title": "Prowadził sklepik w Częstochowie. Dziś jest właścicielem giganta e-commerce i klubu Raków", "date_published": "2022-12-25 14:27:00+00:00", "description": "Michał Świerczewski, właściciel potężnej sieci handlowej x-kom i klubu Raków Częstochowa lubi wygrywać. I w biznesie, i w piłce nożnej, mimo że kompletnie nie ma talentu do futbolu.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/technologie/motoryzacja/mazda-cx-5-nadal-sie-nie-poddaje-test/zzmcjrn", "title": "Mazda CX-5 – nadal się nie poddaje", "date_published": "2022-12-25 14:21:10+00:00", "description": "Mazda CX-5 to nie jest nowy model. Bo na rynku w obecnej postaci znajduje się już od pięciu lat. Tyle że nic się nie zestarzała, a dzięki wprowadzonym po drodze zmianom, bez problemu dotrzymuje kroku konkurencji. Co ciekawe, japońska marka nadal nie poddaje się downsizingowi i zachowuje w gamie duże silniki na benzynę.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/technologie/motoryzacja/volkswagen-golf-ehybrid-krol-kompaktow-na-nowe-czasy-test/7y6pdld", "title": "Volkswagen Golf eHybrid – król kompaktów na nowe czasy", "date_published": "2022-12-25 14:20:06+00:00", "description": "Volkswagen Golf to legenda, która w ostatnich latach mocno się zmienia. Ewoluuje zgodnie z duchem czasów, które nadeszły, a przejawem tych zmian jest Golf, którego można podłączyć do gniazdka. Czy taki hybrydowy kompakt sprawdza się lepiej niż słynny Golf TDI, czyli z oszczędnym dieslem?", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/biznes/rekord-sprzedazy-kart-multisport-pomimo-inflacji/mvdst7m", "title": "Karnety na siłownie i do klubów fitness drożeją, ale lokale są pełne. Rekord sprzedaży kart MultiSport", "date_published": "2022-12-25 14:12:00+00:00", "description": "Obserwujemy podwyżki cen zarówno naszego flagowego produktu, kart MultiSport, jak i karnetów w klubach fitness — przyznaje Bartosz Józefiak, członek zarządu Benefit Systems, w rozmowie z Business Insider Polska. Głównym kosztem dla branży są rosnące czynsze, dodatkowo denominowane w euro. Do tego dochodzą podwyżki opłat ze media i energię. Co ciekawe, mimo inflacji sięgającej 17,5 proc., liczba użytkowników kart Multisport nie maleje. Wręcz przeciwnie — mijający rok przyniósł historyczne rekordy sprzedaży.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wideo/jego-jedwabniki-zjadaja-dziennie-ponad-270-kg-lisci-niekarmione-dadza-mniej-jedwabiu/k3zyy8j", "title": "Jego jedwabniki zjadają dziennie ponad 270 kg liści. Niekarmione dadzą mniej jedwabiu", "date_published": "2022-12-25 13:52:00+00:00", "description": "Jedwabniki jedzą co cztery godziny. Gustują w liściach morwy. A gdy już utkają nić, kończą jako przekąska do piwa.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/covid-19-chiny-przestaja-publikowac-dzienne-dane-o-zakazeniach-wariant-omikron-szerzy/t0lwnhk", "title": "Chiny przestają publikować dzienne dane o zakażeniach koronawirusem. Wariant Omikron szerzy się tam na szeroką skalę", "date_published": "2022-12-25 13:50:45+00:00", "description": "Chińska państwowa komisja zdrowia przestała w niedzielę publikować codzienne bilanse nowych zakażeń koronawirusem. Po nagłym zniesieniu restrykcji covidowych wariant Omikron szerzy się w kraju na szeroką skalę, a rządowe statystki powszechnie uznawano za niewiarygodne.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/finanse/makroekonomia/puchna-oszczednosci-polakow-w-bankach-kredytow-ubywa-dla-konsumentow-to-nie-sa-dobre/d86j4ge", "title": "Puchną oszczędności Polaków w bankach, kredytów ubywa. Dla konsumentów to nie są dobre wieści", "date_published": "2022-12-25 13:31:18+00:00", "description": "Wzrost stóp procentowych mocno zmienia układ sił na rynku finansowym. O kredyty coraz trudniej, ich sprzedaż i wartość systematycznie spada. Jednocześnie wyższe stawki lokat przyciągają pieniądze trzymane do tej pory na depozytach bieżących i powodują, że prawie 150 mld zł w rok napłynęło do depozytów terminowych. Oto najciekawsze wnioski płynące z najnowszych danych Narodowego Banku Polskiego.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/ekspert-chiny-wierza-w-putina-a-ich-sojusz-z-rosja-trwa-i-sie-rozwija/shhqm1d", "title": "Ekspert: Chiny wierzą w Putina, a ich sojusz z Rosją trwa i się rozwija", "date_published": "2022-12-25 12:39:50+00:00", "description": "Przez 10 miesięcy rosyjskiej inwazji na Ukrainę Chiny dodatkowo zacieśniały swoje relacje z Rosją. Sojusz trwa i się rozwija, a Pekin wierzy w Putina i nie odwróci się od Moskwy – ocenił dr Michał Bogusz z Ośrodka Studiów Wschodnich (OSW).", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wideo/uzywa-kremu-do-protez-aby-skladniki-nie-spadly-tak-powstaje-reklama-hamburgera/2clf4ww", "title": "Używa kremu do protez, aby składniki nie spadły. Tak powstaje reklama hamburgera", "date_published": "2022-12-25 11:45:00+00:00", "description": "Idealnie wyglądający burger z reklamy wymaga skrupulatnej pracy. Nakręcenie 30-sekundowej reklamy może kosztować setki tysięcy dolarów. Największymi wrogami filmowców na planie sa czas i temperatura.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/kaczynski-wraca-na-trase-do-odwiedzenia-zastalo-jeszcze-35-okregow/xff7etj", "title": "Kaczyński wraca na trasę. \"Do odwiedzenia zastało jeszcze 35 okręgów\"", "date_published": "2022-12-25 11:07:15+00:00", "description": "Prezes PiS Jarosław Kaczyński na przełomie stycznia i lutego wróci do objazdu po kraju. Do odwiedzenia zastało jeszcze 35 okręgów — zapowiedział sekretarz generalny PiS Krzysztof Sobolewski.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/piotr-sledz-tajemniczy-milioner-i-krol-instagrama-sylwetka/8c3f1pb", "title": "Piotr Śledź — kim jest tajemniczy milioner i król Instagrama?", "date_published": "2022-12-25 10:44:00+00:00", "description": "Pożyczki, domy wakacyjne, e-handel, mieszkania, biura, billboardy... – trudno wymienić branże, w których nie działa Piotr Śledź. W wielu odnosi spektakularne sukcesy. Choć próżno szukać go na listach najbogatszych Polaków, to jeden z najpopularniejszych przedsiębiorców na Instagramie. Czym się zajmuje? Gdzie można znaleźć jego willę?", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/sylwester-na-stokach-polskie-koleje-linowe-podaly-szczegoly-dla-narciarzy/lb5m0s1", "title": "Sylwester na stokach. PKL podały szczegóły", "date_published": "2022-12-25 10:27:25+00:00", "description": "Narciarze chcący przywitać Nowy Rok na stoku, będą mogli szusować, witając 2023 r. w ośrodku PKL Jaworzyna w Krynicy-Zdroju. Kolejki krzesełkowe będą tam kursowały jeszcze po północy – zapowiadają Polskie Koleje Linowe.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/znalezli-niezamieszkana-finlandzka-wyspe-na-google-maps-i-zbudowali-na-niej-dom-na/05xe854", "title": "Kupili wyspę, którą znaleźli na Google Maps. Teraz zarabiają na niej krocie", "date_published": "2022-12-25 09:50:00+00:00", "description": "Po pięcioletnich poszukiwaniach na Google Maps, projektanci Aleksi Hautamäkia i Milla Selkimäk kupili w 2018 r. prywatną wyspę z sosnowym lasem i trzema skalistymi półwyspami wystającymi w morze, które sprawiają, że z góry wygląda jak zwierzęcy pazur. Na jednym z nich zbudowali dom na wynajem.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/technologie/prezes-techland-walka-z-tym-zjawiskiem-moze-byc-jednym-z-najwiekszych-wyzwan-2023-r/pslhvxm", "title": "Prezes Techland: walka z tym zjawiskiem może być jednym z największych wyzwań 2023 r.", "date_published": "2022-12-25 09:09:00+00:00", "description": "Nowe technologie ułatwiają nam życie, ale tempo ich wdrażania może także prowadzić do cyfrowego wykluczenia. To właśnie walka z tym zjawiskiem może stać się jednym z największych wyzwań nadchodzącego roku — pisze dla Business Insider Polska Paweł Marchewka, prezes firmy Techland. Podkreśla też, że 2023 r. to też szansa dla firm gamingowych na ponowne osiągnięcie istotnych poziomów wzrostu.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/sebastian-buczek-2022-rok-bessy-2023-oczekiwana-znaczaca-poprawa/th36g72", "title": "2022 - rok bessy. 2023 - oczekiwana znacząca poprawa", "date_published": "2022-12-25 09:00:00+00:00", "description": "Kończy się rok 2022. Do historii rynków finansowych przejdzie jako wyjątkowy. Dlaczego? Ponieważ jest to pierwszy rok w ostatnim stuleciu, kiedy zarówno w przypadku amerykańskich akcji (indeks S&amp;P500 stracił do 14 grudnia br. 16,2 proc.), jak i obligacji (zmiana cen 10-letnich obligacji skarbowych do 14 grudnia br. wyniosła -13,6 proc.), inwestorzy zanotowali dwucyfrowe straty. Takiej sytuacji jeszcze nie było (w 1969 r. S&amp;P500 stracił 8,2 proc., a ceny 10-letnich obligacji zniżkowały o 5,0 proc.)! Rok 2022 do historii przejdzie, niestety, także z innego powodu – agresji Rosji na Ukrainę. Czego spodziewać się w kolejnych 12 miesiącach? Czy inwestorzy mogą liczyć na zyski w 2023 r.? — pisze dla Business Inisder Polska Sebastian Buczek, prezes zarządu Quercus TFI S.A.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/aleksander-gudzowaty-kim-byl-i-co-sie-stalo-z-jego-miliardowa-fortuna/8ll6q0t", "title": "Zarobił miliardy na rosyjskim gazie, stracił wpływy, gdy władzę przejął Putin. Co się stało z fortuną Aleksandra Gudzowatego?", "date_published": "2022-12-25 08:38:00+00:00", "description": "Ponoć w trudnych latach 90. Rosjanie ufali tylko jemu, a on w saunach podpisywał rosyjskimi wiceministrami i dyrektorami kontrakty na bajońskie sumy. Kim był Aleksander Gudzowaty i co stało się z jego fortuną?", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/biznes/prezes-portu-gdansk-do-tej-pory-przeladowalismy-12-mln-ton-wegla/fc86rvb", "title": "Prezes Portu Gdańsk: do tej pory przeładowaliśmy 12 mln ton węgla", "date_published": "2022-12-25 08:27:55+00:00", "description": "Do tej pory w Porcie Gdańsk udało się przeładować 12 mln ton węgla. Widzimy, że jesteśmy w stanie przeładowywać ok. 400 tys. ton tygodniowo – poinformował prezes Portu Gdańsk Łukasz Greinke.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/wstrzymano-prace-przy-poglebianiu-toru-na-zalewie-wislanym-akwen-zamarzl/et5cwrw", "title": "Wstrzymano prace przy pogłębianiu toru na Zalewie Wiślanym. Akwen zamarzł", "date_published": "2022-12-25 07:54:00+00:00", "description": "Prace przy pogłębianiu toru wodnego na Zalewie Wiślanym, dzięki któremu do portu w Elblągu będą mogły wpływać większe jednostki zostały wstrzymane. Akwen zamarzł. Roboty pogłębiarskie są obecnie zaawansowane w 80 proc. — podał Urząd Morski w Gdyni.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/finanse/prezes-bnp-paribas-gospodarka-w-czasach-niepewnosci/e7k65c3", "title": "Prezes dużego banku powtarza jedno słowo. Mówi o wyzwaniach w 2023 r.", "date_published": "2022-12-25 07:30:00+00:00", "description": "Gdybym miał w jednym słowie zawrzeć całą paletę emocji, które towarzyszą nam w ostatnim czasie, byłoby to słowo \"niepewność\". Odczuwamy niepewność jako jednostki oraz zbiorowo – jako naród, jako pracownicy, przedsiębiorcy, czy przedstawiciele konkretnych branż. W warunkach, z którymi mamy do czynienia, to zupełnie naturalna reakcja. Najważniejsze, aby ta emocja nie okazała się dla nas paraliżująca — pisze dla Business Insider Polska Przemek Gdański, prezes BNP Paribas Bank Polska.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/wiadomosci/wybory-wojna-i-inflacja-jerzy-buzek-i-piec-najwazniejszych-pytan-w-2023-r/zf2t0cv", "title": "Jerzy Buzek wskazuje pięć najważniejszych pytań na 2023 r. Kluczowe wybory, wojna i inflacja", "date_published": "2022-12-25 07:05:00+00:00", "description": "Kto wygra wybory parlamentarne w Polsce i kiedy zakończy się wojna w Ukrainie? To tylko dwa z pięciu najważniejszych pytań, na które znajdziemy albo powinniśmy znaleźć odpowiedzi w 2023 r. W specjalnym felietonie dla Business Insider Polska pisze o nich Jerzy Buzek, europoseł i były premier.", "persistent": false, "language": "en-US"}, {"source": "https://businessinsider.com.pl/.feed", "link": "https://businessinsider.com.pl/gospodarka/ekonomia-wedlug-jezusa/kdxjvp0", "title": "Ekonomia według Jezusa", "date_published": "2022-12-25 07:03:00+00:00", "description": "Należy podejmować próby mnożenia kapitału, ale gromadzenie pieniędzy nie może przysłaniać spraw najważniejszych – uczył niemal dwa tysiące lat temu Jezus z Nazaretu. Zanim przystąpi się do analizy jego słów dotyczących spraw ekonomicznych, należy uzmysłowić sobie, że dużym błędem jest próba dopasowywania ich do nurtów myśli ekonomicznej i politycznej, jakie pojawiły się wiele setek lat po jego odejściu.", "persistent": false, "language": "en-US"}], "source": {"url": "https://businessinsider.com.pl/.feed", "title": "Business insider"}}