[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "RM of BTS: Tiny Desk (Home) Concert", "description": "Stephen Thompson | December 2, 2022\n\nNow that we’re back to recording Tiny Desk concerts in the office, home concerts mostly happen under special circumstances: when the artist is overseas, for example, or otherwise unable to get to Washington, D.C., when we’re recording. Given that BTS’s RM (aka Kim Nam-joon) is based in South Korea, we let it slide — not least because his team put together one of the most impressive Tiny Desk facsimiles we’ve seen yet. What really sets it apart is the huge array of shelf-bound ephemera, which is bound to have the BTS Army sleuthing in the YouTube comments. What’s a random tchotchke and what’s an Easter egg? Study the set closely!\n\nRM timed his solo Tiny Desk debut — which follows BTS’s home concert from back in 2020 — to coincide with the release of his first official studio album, Indigo. But he kicks off the set with an older track, “seoul,” which first appeared on his 2018 mixtape mono. From there, he showcases the first two tracks from Indigo: the rap-driven “Yun” and the funky “Still Life,” both of which are inspired by RM’s love of and fascination with painting. The studio tracks feature Erykah Badu and Anderson .Paak, respectively, both of whom get shoutouts in this set. But here, the focus never drifts away from the star at center stage — no matter how closely you might squint at the stuffed animals, housewares, clocks and toys (not to mention Big Mouth Billy Bass!) behind him.\n\nNow, if we can just get him to visit the real Tiny Desk…\n\n\nSET LIST\n“seoul”\n“Yun”\n“Still Life”\n\nMUSICIANS\nRM: vocals\nDOCSKIM: keyboard \njohn eun: guitar\nJaeshin Park: bass\nJK Kim: drums\n\nCREDITS\nDirector: Oui Kim (OUI)\nProducer: Yeonjin Kim (OUI)\nAUDIO:\nJEONG WOO YEONG\nSon Yu Jeong\n\nCREW:\nHuiwon Song\nSunyoung Kim\nHyeri Shin \nEumKo\nYoungwoo Lee\nEunil Lee\nSungju Min \nKihun Kim \nSeungjong Lee\nYuntae Ko \nKidung Kim\nKiyong Eom\nDonghyun Lee\nDoosoo Choi\nYujin Jung\nSangjoon Lee \nKieun Lee \nKihyun Lee \nSeonghyeon Heo\nInsol Yun\nHyeongeun Kim \nYujin Ko \nDaeun Han\nJae Yoo \nGANi \nLeehyun Kim \nYeonhwa Cha\nDaye Shin\nDaniella Kim\nSaeyong Oh\nLee Jung Min\nLee Hyeon Ki\nJeong Dae Seong\nJinho Jeong\nRachel Um\nJennie Lee\nRosa Kim\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin\nTiny Production Team: Suraya Mohamed, Bobby Carter, Maia Stern, Joshua Bryant, Hazel Cills, Marissa Lorusso, Ashley Pointer, Jill Britton, Sofia Seidel\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #rm #bts #nprmusic", "link": "https://www.youtube.com/watch?v=CKg3FV5gwMc", "date_published": "2022-12-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "The A's: Tiny Desk Concert", "description": "Bob Boilen | December 1, 2022\nIt was clear from the outset, those very first harmonies, that this was to be a playful, fun-filled day at the Tiny Desk. For one thing, the two A's, Amelia and Alexandra, are Tiny Desk alums. Amelia Meath made her Tiny Desk concert debut in 2015 with Nick Sanborn as Sylvan Esso. She returned in 2019 with her Vermont college mates Mountain Man which includes Alexandra Sauser-Monnig along with Molly Erin Sarlé. Alexandra's project, Daughter of Swords, was here not long before the COVID outbreak.\n\nThis summer, Amelia and Alexandra put out a delightful album of songs titled Fruit, including the yodeling a cappella cowboy tune that opens this Tiny Desk, \"When The Bloom Is On the Sage.\" Other songs include the folk song \"Swing and Turn Jubilee,\" accompanied by Alexandra on acoustic guitar, with Amelia gently stomping her thick-soled Buffalo sneakers on stones to keep the beat.\n\nAmelia and Alexandra's identical leaf-and-bird-patterned dresses, dark lipstick and even darker sunglasses add an eeriness to these sublime songs. This leads us to the final song in the set, a tune Amelia says will guide her friends on what to do upon leaving this earth. The lyrical instructions in \"When I Die\" include singing and dancing, drinking to life, flowers to perfume the air and a bonfire to light the way home. Even in the face of death, The A's kept a smile on my face.\n\nSET LIST\n\"When The Bloom Is On the Sage\"\n\"Swing and Turn Jubilee\"\n\"Werewolf\" \n\"Wedding Dress\"\n\"When I Die\"\n\nMUSICIANS\nAmelia Meath: vocals\nAlexandra Sauser-Monnig: vocals, acoustic guitar\n\nTINY DESK TEAM\nProducer: Bob Boilen\nDirector: Joshua Bryant\nAudio Engineer: Josh Rogosin \nSeries Producer: Bobby Carter\nEditor: Sofia Seidel\nVideographers: Joshua Bryant, Maia Stern, Sofia Seidel\nAudio Assistant: Neil Tevault\nProduction Assistant: Jill Britton\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Kara Frame, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #theas", "link": "https://www.youtube.com/watch?v=C3Y_thL0juU", "date_published": "2022-12-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]