[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Every Rumor And Leak For The Game Awards 2022 | GameSpot News", "description": "Star Wars Jedi: Survivor, Hideo Kojima's next project, and more reveals at this year's Game Awards, info on Assassin's Creed Mirage's release date, and sign up for the weekend's Hyenas Alpha. \n#GameAwards #StarWars #HideoKojima #AsassinsCreed \n\nWe’re days away from the Game Awards, with leaks and rumors coming in thick and fast. Here’s a roundup of the biggest things we expect to see at the event.\n\nThere’s a really strong chance we’ll be getting a look at the upcoming sequel to Star Wars Jedi: Fallen Order; Jedi: Fallen Survivor. According to Jeff Grubb of GameSpot sister site, Giant Bomb, marketing for the game will be kicking off in December and expects the launch of the title to be March 2023. Then, Insider Gaming provided specific details around the game’s presence at the Game Awards, including a new trailer, release date, and pre-order details.\n\nThis would line up with the recent reveal of a tie-in book, Jedi: Battle Scars, that bridges part of the five year gap between the end of Fallen order and the beginning of Survivor.\n\nThis year, there has been an absolute ocean of rumors, leaks, and teases this year out of Kojima Productions and what they could possibly be working on next. A horror game? An anthology series? A sequel to Death Stranding? Metal Gear Solid 6?\n\nOk that last one I made up, but WHAT IF?!\n\nConsidering the recent teases from Kojima himself, as well as the fact the guy is certified bros with producer and host of the Game Awards Jeff Keighley, it seems almost inevitable the gaming auteur’s next title will be at the event. On December 1, Kojima tweeted an image with three logos and the caption, “start a new journey.”\n\nAccording to reports from insiders, Kojima Productions is working on two games: a horror title codenamed Project Overdose, which has already leaked footage, and Death Stranding 2. The prevailing theory is that these logos, which were also present with official reveal images that actors Ellie Fanning and Shiori Kitsuna would be a part of the project, are related to Overdose rather than Death Stranding 2. The previously mentioned leaked footage also revealed that Margaret Qualley, the actor behind Death Stranding’s character Mama, is also in the game.\n\nNo word on release date, and no concrete info on whether Overdose will be the exclusive that Kojima is working on for Xbox, but hopefully a lot of these messy details will be cleared up by the time the Game Awards wraps.\n\nJedi: Survivor and Overdose are just the tip of the iceberg of what to expect from the Game Awards. The rest of the rumors include: an appearance from Diablo IV with pre-orders going live during the show, more from FF XIV, particularly as its producer, Naoki Yoshida, is confirmed to be at the event, updates for Among Us, news from publisher 505, potentially a better look at Tekken 8, and a possible tease of the next game from Josef Fares and Hazelight, the game director and studio behind last year’s Game Awards Game of the Year Winner It Takes Two. Josef is confirmed to also be attending the event.", "link": "https://www.youtube.com/watch?v=ApgQGnx-EkI", "date_published": "2022-12-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Glen Schofield Breaks Down The Callisto Protocol's Horror | MindGames", "description": "Ahead of the release of The Callisto Protocol, the first game from his new studio Striking Distance, we sat down with the game's director Glen Schofield to talk about his horror influences, competing with Dead Space, and how he hopes his new game will get inside the head of even the most seasoned horror fan.\n\n#thecallistoprotocol #gaming #horrorgaming #mindgames", "link": "https://www.youtube.com/watch?v=ln4uRDYPCjY", "date_published": "2022-12-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Callisto Protocol Review", "description": "Though it starts off on a strong note, The Callisto Protocol's focus on action-heavy spectacles fails to adequately explore its horror and overcrowds its weak combat mechanics.\n\n#gaming #thecallistoprotocol #gamespot", "link": "https://www.youtube.com/watch?v=bkktCkDNYPw", "date_published": "2022-12-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Biggest Game Releases For December 2022", "description": "Still not sure what to ask Santa for? Well lucky for you this December is a little busier than normal, so we’ve got some great ideas for your wish list. Here are 10 of the biggest games coming out in December 2022.\n#TheCallistoProtocol #MarvelsMidnightSuns #GameSpot\n\nThe Callisto Protocol is a new original survival-horror game set on Callisto--a moon of Jupiter. More specifically, it's set in a prison called Black Iron located on Callisto in 2320, with protagonist Jacob Lee finding himself trapped as mutating humans begin taking over and murdering other inmates. If dead things in space sound familiar, that's because The Callisto Protocol is being developed by Dead Space co-creator Glen Schofield’s new company, Striking Distance Studios.\n\nMarvel's Midnight Suns is the next game from developer Firaxis Games, the studio behind Civilization and the past three XCOM games. Though it has tactical strategy elements, Marvel's Midnight Suns is far from a superhero reskin of XCOM. Instead of set abilities, your heroes will each have a deck of ability cards that get shuffled together when you bring three of them into combat together. Those cards range from basic attacks to special skills, allowing you to buff other players or toss enemies around the battlefield. The cards can also be customized with variations to suit your playstyle.\n\nNeed for Speed has a number of games about street racing, but Need for Speed Unbound might just be one of the most distinct entries in the long-running series, thanks to its cel-shaded visuals that make it look like a high-speed anime series. In the story players will attempt to win The Grand, the ultimate street racing challenge in Lakeshore, collecting cars and using them as a canvas to show off their personal style on the streets.\n\nTimestamps:\n00:00 - Intro\n00:12 - The Callisto Protocol\n01:18 - Marvel’s Midnight Suns\n02:13 - Need For Speed Unbound\n03:22 - Hello Neighbor 2\n04:14 - Chained Echoes\n04:56 - Choo-Choo Charles\n05:39 - Dragon Quest Treasures\n06:23 - Crisis Core: Final Fantasy VII Reunion\n07:29 - High on Life\n08:19 - The Witcher 3 Next-Gen Update", "link": "https://www.youtube.com/watch?v=FSSnIMge33I", "date_published": "2022-12-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Amnesia: The Bunker Official Announcement Trailer", "description": "Amnesia: The Bunker is a first-person horror game from the makers of SOMA and Amnesia coming to PC and Consoles March 2023.\n\nLeft all alone in a desolate WW1 bunker with only one bullet remaining in the barrel, it’s up to you to face the oppressing terrors in the dark. Keep the lights on at all costs, persevere, and make your way out alive.\n\n#amnesia #thebunker #gaming", "link": "https://www.youtube.com/watch?v=G3ZlCtRohWU", "date_published": "2022-12-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best Xbox Game Pass Games To Play Right Now", "description": "Xbox Game Pass continues to grow each month. Here's a list of seven great games, from Pentiment to Vampire Survivors, you can play on the service right now.\n\nXbox Game Pass, Microsoft's gaming subscription service, is often referred to as the best deal in gaming, and for good reason. Each month, multiple games are added to its rotating catalog of titles, a mix of first-party Xbox games, indies, and other huge games.\n\nIt can be a little overwhelming, but have no fear. In this video, we're going to tell you the best games to play on Xbox Game Pass. There's something for everyone, from adventure mystery games like Pentiment, to blood drenched action shooters like Gungrave G.O.R.E.\n\nTimestamps:\n00:00 - Intro\n00:15 - Vampire Survivors\n01:50 - Pentiment\n03:16 - Norco\n04:39 - Gungrave G.O.R.E.\n06:15 - Somerville\n07:06 - The Legend of Tianding\n07:46 - Ghost Song\n08:33 - Outro", "link": "https://www.youtube.com/watch?v=J7bCigmW3AE", "date_published": "2022-12-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Valve Giving Away Steam Decks At The Game Awards | GameSpot News", "description": "Watch the Game Awards and win a free Steam Deck, Nintnedo address issues with Pokemon Scarlet and Violet, and Lego Star Wars the Skywalker Saga is coming to Game Pass.\n#SteamDeck #GameAwards #PokemonScarletViolet \n\nhttps://store.steampowered.com/sale/thegameawardssteamdeckdrop2022\n\nDon’t have a Steam Deck yet? No worries. Valve might give you one for free!\n\nOn December 8, during the Game Awards, the maker of the Steam Deck Valve will be giving away the most expensive version of the Steam Deck, with 512GB, every minute to viewers of the livestream event.\n\nIf you want to be one of those lucky viewers, all you’ll need to do is head to the link we’ve attached in the description, sign into Steam, and then hit register now. Then, on December 8th, you must watch the Game Awards livestream via Steam— yes, Steam does livestreaming if you didn’t know— to be in with a chance of winning one.\n\nConsidering that last year, the length of the Game Awards rivaled the runtime of one of the Lord of the Rings movies, Valve is set to give away hundreds of devices.\n\nAnd even if you have a Steam Deck already, you should register anyway because A) who doesn’t need a second Steam Deck? and B) everyone who registers gets a very cute Steam Pal digital sticker.\n\nOf course you’ll be wanting to pick up a Steam Deck to replace your Switch because the technical issues of Pokemon Scarlet and Violet have pushed you to the brink. But don’t retire that nearly 6 year old handheld just yet, because in an extremely rare acknowledgement by Nintendo, it seems that the game might actually be getting some fixes.\n\nThe game just got its first patch since launch, and will make some additions as well as address some issues. Ranked battling is coming to the game’s battle stadium, and there have been some bug fixes, including a bug where the music during the game’s Elite Four confrontations wouldn’t play correctly.\n\nAs for what the additional bug fixes are, who knows what exactly what has been mended in this patch, but some of the biggest ones include massive frame rate drops, pop in at extremely close distances, invisible legendaries, and clipping through environments, but it sounds like some, if not all of these problems, will be addressed.\n\nIn addition to the patch notes, Nintendo stated that, “We are aware that players may encounter issues that affect the games' performance. Our goal is always to give players a positive experience with our games, and we apologize for the inconvenience. We take the feedback from players seriously and are working on improvements to the games.\"\n\nA statement like this is almost unheard of from the gaming giant. Considering its rarity, as well as the fact that Scarlet and Violet have been Nintendo’s fastest selling games ever, the breadth of issues, as well as the volume of players pointing them out, must be immense.", "link": "https://www.youtube.com/watch?v=WePAb3q5G4A", "date_published": "2022-12-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]