[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Turnstile: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nLars Gotrich | January 5, 2022\nFrom basements to bandshells, Turnstile shows are a life-affirming mosh-pit ballet. You sweat, you smile, you stage dive, you shake what ya mama gave ya. At the band's Tiny Desk (home) concert, Turnstile's high-energy hardcore is converted into seven songs over 17 minutes, surrounded by an art installation by John Scharbach — those stuffed animals presumably pogoing and windmilling in your imagination.\n\nGLOW ON, one of NPR Music's 50 best albums of 2021, is the rambunctious sum of the band's many parts – as much Bad Brains as it is Rare Essence and Fania deep cuts – but with its wild styles fully fused as Turnstile. Filmed at drummer Daniel Fang's house in Baltimore, these songs are all power chords, compact guitar solos, cowbells and fuzz bass, with vocalist Brendan Yates accenting the melody behind the keys. At shows, Yates normally bounces around with joyous aplomb; here, his self-restraint is commendable as he mimes out his stage moves inside an invisible bubble.\n\nIn the back half, Turnstile upsets the sequence: \"MYSTERY\" is transformed into a Fender Rhodes ballad before launching into \"T.L.C. (TURNSTILE LOVE CONNECTION)\" – maybe not the first hardcore bruiser to reference Sly and the Family Stone, but certainly one elevated by gang vocals. These songs from GLOW ON, in particular, tug at loneliness and uncertainty, but Turnstile offers a reprieve before we jump back into the pit of life: At the set's close, Yates and Franz Lyons lose the Blood Orange verses from the studio recording of \"ALIEN LOVE CALL\" to meditate on its existential phrase: \"Can't be the only one.\"\n\nSET LIST\n\"ENDLESS\"\n\"UNDERWATER BOI\"\n\"BLACKOUT\"\n\"DON'T PLAY\"\n\"MYSTERY\"\n\"T.L.C. (TURNSTILE LOVE CONNECTION)\"\n\"ALIEN LOVE CALL\"\n\nMUSICIANS\nPat McCrory: Guitar\nFranz Lyons: Bass\nDaniel Fang: Drums, Percussion\nBrendan Yates: Vocals, Keys, Percussion\nBrady Ebert: Guitar\n\nCREDITS\nVideo: Sunny Singh (hate5six)\nAudio: Paul Mercer\nInstallation: \"ALIEN LOVE RESPONSE\" by John Scharbach\n\nTINY DESK TEAM\nProducer: Lars Gotrich\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Joshua Bryant, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #turnstile", "link": "https://www.youtube.com/watch?v=XfJkMTVWu3U", "date_published": "2022-01-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]