[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Diablo 4 End Game Closed Beta Developer Update", "description": "Learn more about Diablo 4's upcoming closed end game beta from Rod Ferguson and Joe Shely. \n\nNow, here’s a run-down of the end game offerings included in the Diablo IV Closed End Game Beta: Helltide, Nightmare Dungeons, Whispers of the Dead, Fields of Hatred, and Paragon Boards. Take stock of the skills and knowledge you cultivate from playing through these features, you’ll need every tool at your disposal to defeat the Closed End Game Beta’s boss!\n\n#diablo #diabloiv #gaming", "link": "https://www.youtube.com/watch?v=rMMwgL5Hqwc", "date_published": "2022-09-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "GTA 6 Leak and Gameplay Details, Explained | GameSpot News", "description": "How did the Grand Theft Auto 6 leak happen? What was in it? What is Rockstar doing about it? All these questions, answered.\n#Gaming #GTA6 #GrandTheftAuto6 #GTA6Leak \n\nWell, what else is there to talk about? The Grand Theft Auto 6 leak. How did it happen? What was in it? What is Rockstar’s response? Here’s everything you need to know about the biggest leak the gaming industry has ever seen.\n\nNow, before we get into this, I just want to be expressly clear. Everything you are about to see is from previous GTA games. Ok. Rockstar’s legal team, if you’re listening— and I’ve heard they’re big fans of this show— we’re not showing any screenshots. Any gameplay. Nothing. Nada. Zip. Zilch. Got it? Ok. Good. Here we go.\n\nSo how did the leak happen? On Sunday September 20, a user that goes by the name of teapottuberhacker posted on GTAforums.com over 90 clips of in-development footage of the game. They claimed that the clips were taken from Rockstar’s internal Slack, which also allowed them to get their hands on source code for the game.\n\nThe hacker updated their post later that day, directing any employees of Rockstar or Take-Two Interactive to contact them via email, as they were \"looking to negotiate a deal.\" There has been no update as of this recording from the hacker.\n\nSo what was released? Well, a metric f*ton.\n\nThe footage in the 90+ clips totalled a near hour of incomplete GTA 6 gameplay. The validity of the footage before Rockstar could confirm the leak came in the form of two key details that lined up with Bloomberg’s report earlier this year about the game. One, all the gameplay took place in Vice City, Grand Theft Auto’s Miami parody, and the location of the game according to Bloomberg's report. \n\nThat report also included the detail that the player would take control of two characters, a man and a woman, whom are meant to be a Bonnie and Clyde-like type pairing. The gameplay seen in the leak featured both a playable man and woman. Pop-up text during the footage refers to the man as Jason and the woman as Lucia.\n\nThe footage showed off the characters’ abilities to crouch, go prone, and move while doing both. Going prone is something that can’t be done in GTA 5, and the only way to crouch in that game is by taking cover behind a low profile object. \n\nBoth of these elements hint that playing stealthily might be a viable course of action in the game, particularly as the footage also reveals a mechanic to pick up bodies that you could then presumably hide.", "link": "https://www.youtube.com/watch?v=3ZGdKumGlIk", "date_published": "2022-09-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Modern Warfare 2019: 10 Things You Never Knew", "description": "War… War never changes. Over the course of 16 games, Call of Duty has become one of the world's biggest gaming franchises. Although many players may have their own personal favorites in the series, none is as vastly popular as the Modern Warfare sub series. With the Modern Warfare 2 reboot just around the corner, these are 10 things you didn't know about Modern Warfare 2019.\n#gaming #callofduty #gamespot #modernwarfare \n\nStu here to break down the secrets and controversies surrounding the 2019 Modern Warfare reboot. From Santa Claus to giant teddy bears, Infinity Ward went no hold barred into their easter eggs for Modern Warfare 2019. Although Call of Duty Games can get a reputation for being “thrown together” because of their yearly release schedule, the 2019 reboot of Modern Warfare proves that Infinity Ward could put together a new style of Call of Duty game with a well planned year full of map, modes, and weapon releases. The level of detail, fun, and goofy secrets throughout the game elevate the entire experience to something more than just “another Call of Duty game.” In fact, The animations and attention to detail were so well done that both Call of Duty Cold War and Call of Duty Vanguard kept the same animations. It’s been a blast uncovering the intricacies and secrets of development and the controversies and hidden treasures surrounding the game itself.", "link": "https://www.youtube.com/watch?v=fCousd9Rg4I", "date_published": "2022-09-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Does Gaming Addiction Really Exist? | MindGames", "description": "From Fortnite to Candy Crush, concerns have long been raised about the addictive potential of video games. But when the World Health Organization classified 'Gaming disorder' as an addictive behaviour in 2018, the psychology community found itself divided.\n\nSome believed the WHO's decision was based on poorly-constructed research, while others have reported success in treating the condition. So was the WHO right to make this decision, and does Gaming Addiction really exist?\n\n00:00 Intro\n01:08 WHO did what?\n03:38 Psychology Divisions\n06:04 Treatment\n09:14 What's next?\n\nLost in a Good Game by Pete Etchells: https://iconbooks.com/ib-title/lost-in-a-good-game/\n\nNational Centre for Gaming Disorders: https://www.cnwl.nhs.uk/national-centre-gaming-disorders\n\nUK Addiction Support: https://www.mind.org.uk/information-support/guides-to-support-and-services/addiction-and-dependency/addiction-and-dependency-resources/\n\nUS Addiction Support: https://www.samhsa.gov/\n\n#gamingaddiction #gamingdisorder #gaming #mentalhealth #mindgames #fortnite", "link": "https://www.youtube.com/watch?v=S8qVwomybEI", "date_published": "2022-09-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite Chapter 3 Season 4 Official Battle Pass Trailer", "description": "Get a look at the battle pass trailer for Fortnite Chapter 3 Season 4 including some gameplay, skins and much more. \n\nWelcome to Paradise. A new season filled with Chrome, Chrome, and even more Chrome. This anomalous substance is spreading fast across the Island. Jump in to check out the newest weapons, items, POI’s, and ways to play! \n\nSome Island locations are seeking “safety” in the air — most notably Condo Canyon. Now called Cloudy Condos, attack from above in this expanding POI. Chrome’s not only taking over points of interest, it’s built a brand new one. Ascend Herald’s Sanctum (near the abandoned Sanctuary) and stand atop this tower of Chrome.\n\nDefy the laws of physics by walking through Chrome walls! Throw a Chrome Splash at the walls to make the walls penetrable — jump right through the building and get the drop on your opponent! \n\nPlay Fortnite Battle Royale, the completely free 100-player PvP mode. One giant map, A Battle Bus, Last one standing wins. ESRB Rating: Teen with Violence.\n\n#fortnite #gaming", "link": "https://www.youtube.com/watch?v=R0BhYKu1Vxs", "date_published": "2022-09-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite Chapter 3 Season 4 Official Cinematic Trailer", "description": "Check out the Fortnite chapter 3 season 4 cinematic trailer that showcases the rise of the Chrome.\n\nIn Fortnite Chapter 3 Season 4: Paradise, a mysterious substance has appeared on the Island. Chrome will consume all, Chrome will be all. Embrace the Chrome by turning structures Chrome, making yourself Chrome, and proving the power of Chrome weapons. \n\nAssemble an eclectic crew in your enjoyment of paradise. With this Season’s Battle Pass purchase, you’ll immediately unlock Paradigm (Reality-659). Progress through the Battle Pass to unlock Spider-Gwen.\n\nPlay Fortnite Battle Royale, the completely free 100-player PvP mode. One giant map, A Battle Bus, Last one standing wins. ESRB Rating: Teen with Violence.\n\n#Fortnite #gaming", "link": "https://www.youtube.com/watch?v=8DfIFYZJEbQ", "date_published": "2022-09-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]