{"entries": [{"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/biden-declares-u-s-troops-will-engage-in-war-with-china-if-taiwan-attacked-white-house-walks-back-statement", "title": "Biden Declares U.S. Troops Will Engage In War With China If Taiwan Attacked, White House Walks Back Statement", "date_published": "2022-09-18 22:38:00+00:00", "description": "President Joe Biden (D) declared during an interview on Sunday night that the U.S. Military would engage in war with communist China if China attacked Taiwan, a statement that was quickly walked back by the White House. Biden made the remarks during an interview on CBS News’ “60 Minutes” with leftist host Scott Pelley. &#8220;On ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/biden-shocks-white-house-by-declaring-pandemic-is-over-while-hundreds-of-americans-die-every-day", "title": "Biden Shocks White House By Declaring ‘Pandemic Is Over’ While Hundreds Of Americans Die Every Day", "date_published": "2022-09-18 22:10:03+00:00", "description": "President Joe Biden (D) said during an interview on Sunday that the pandemic was &#8220;over,&#8221; despite numbers from the CDC showing hundreds of Americans dying every day from COVID-19. Biden made the remarks during an interview on CBS News’ “60 Minutes” with leftist host Scott Pelley. Biden&#8217;s remarks come after more Americans have died of ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/biden-claims-hes-growing-the-economy-while-it-continues-to-shrink-warns-inflation-not-going-away", "title": "Biden Claims He’s ‘Growing The Economy’ While It Continues To Shrink, Warns Inflation Not Going Away", "date_published": "2022-09-18 21:57:58+00:00", "description": "President Joe Biden (D) claimed during an interview Sunday night that he was &#8220;growing the economy&#8221; despite the fact that the U.S. economy has shrank for two consecutive quarters in what economists have long indicated is a warning sign that an economy is in a recession. Biden made the remarks during an interview on CBS ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/i-got-that-biden-claims-people-who-are-hurting-because-of-inflation-need-to-put-this-in-perspective", "title": "‘I Got That’: Biden Claims People Who Are Hurting Because Of Inflation Need To ‘Put This In Perspective’", "date_published": "2022-09-18 21:37:10+00:00", "description": "President Joe Biden (D) tried to downplay during an interview that aired on Sunday the skyrocketing inflation rates that have erupted under his presidency, saying that people need to put things in &#8220;perspective.&#8221; Biden made the remarks during an interview on CBS News&#8217; &#8220;60 Minutes&#8221; with leftist host Scott Pelley. &#8220;Mr. President, as you know, ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/what-the-bible-really-says-about-tithing", "title": "What The Bible Really Says About Tithing", "date_published": "2022-09-18 21:34:11+00:00", "description": "Does the practice of tithing, instituted in the Torah for ancient Israel, still apply to Christians today? Is it a divine command from God for this hour, that you are “required to give 10% of your income to the Church? Should it be discarded as vestige from the past? It is true that tithing is ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/man-charged-after-video-shows-rampage-inside-a-nyc-mcdonalds-gets-released-from-jail-without-bail", "title": "Man Charged After Video Shows Rampage Inside A NYC McDonald’s, Gets Released From Jail Without Bail", "date_published": "2022-09-18 21:11:47+00:00", "description": "A man who was arrested over the weekend after allegedly causing thousands of dollars of damage inside a New York City McDonald&#8217;s by using an ax has now been released from jail without bail. Video shows an intense verbal altercation between several males and 31-year-old suspect Michael Palacios that led to pushing and shoving — ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/king-charles-iii-set-to-axe-prince-andrew-and-prince-harry-as-official-stand-ins-for-the-crown-report", "title": "King Charles III Set To Axe Prince Andrew And Prince Harry As Official ‘Stand-Ins’ For The Crown: Report", "date_published": "2022-09-18 20:57:20+00:00", "description": "King Charles III may soon move to exclude Prince Andrew, Princess Beatrice, and Prince Harry from acting as official stand-ins if he should be &#8220;incapacitated.&#8221; The Regency Act of 1937 allows a monarch&#8217;s spouse and the next four in line for the throne can on occasion be called up to act as &#8220;Councillors of State&#8221; ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/desantis-shreds-claims-that-illegal-immigrants-were-falsely-lured-into-going-to-marthas-vineyard", "title": "DeSantis Shreds Claims That Illegal Immigrants Were ‘Falsely Lured’ Into Going To Martha’s Vineyard", "date_published": "2022-09-18 19:14:24+00:00", "description": "Florida Governor Ron DeSantis (R) dismissed claims Friday from Democrats and left-wing media that the 50 illegal immigrants who were sent to Martha&#8217;s Vineyard were &#8220;falsely lured&#8221; or &#8220;enticed&#8221; into going. &#8220;I think that&#8217;s totally false,&#8221; he said in answer to a question from a reporter during a press conference. &#8220;I think if you look, ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/japan-experiences-massive-typhoon-as-millions-are-warned-to-evacuate", "title": "Japan Experiences Massive Typhoon As Millions Are Warned To Evacuate", "date_published": "2022-09-18 19:09:33+00:00", "description": "Typhoon Nanmadol struck the coastline of southern Japan on Sunday, causing widespread power outages and a massive evacuation. The Japan Meteorological Society said the typhoon could unleash up to 20 inches of rain by Monday with winds of more than 100 miles per hour as the storm reached the shore of Kagoshima City. More than ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/twitter-mob-comes-for-pat-sajak-after-photo-with-controversial-republican-surfaces", "title": "Twitter Mob Comes For Pat Sajak After Photo With Controversial Republican Surfaces", "date_published": "2022-09-18 18:39:29+00:00", "description": "Twitter mobsters targeted longtime &#8220;Wheel of Fortune&#8221; host Pat Sajak after a photo surfaced of the popular game show host posing with controversial Congresswoman Marjorie Taylor Greene (R-GA) and Right Side Broadcasting Network (RSBN) reporter Brian Glenn. Sajak, 75, was in the headlines late last week as he revealed that after spinning the wheel for ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/study-finds-veteran-suicide-1-37-times-greater-than-va-reports", "title": "Study Finds Veteran Suicide 1.37-Times Greater Than VA Reports", "date_published": "2022-09-18 18:27:13+00:00", "description": "The Department of Veterans Affairs (VA) is undercounting the number of former military service members who are dying to suicide and self-harm, a new study by a veterans group finds. America’s Warrior Partnership (AWP) worked with the University of Alabama and Duke University to gather the death data on veterans across eight states: Alabama, Florida, ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/aoc-responds-to-illegal-immigration-crisis-we-have-more-than-enough-to-care-for-everyone", "title": "AOC Responds To Illegal Immigration Crisis: ‘We Have More Than Enough To Care For Everyone’", "date_published": "2022-09-18 18:22:20+00:00", "description": "Far-left Rep. Alexandria Ocasio-Cortez (D-NY) responded to last week&#8217;s top national news story—the illegal immigration crisis that has erupted under President Joe Biden (D)—by saying that the U.S. has &#8220;more than enough&#8221; money to take care of everyone. Biden&#8217;s border crisis became the top news story last week after Florida Governor Ron DeSantis (R) sent ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/hurricane-fiona-leaves-all-of-puerto-rico-without-electricity", "title": "Hurricane Fiona Leaves All Of Puerto Rico Without Electricity", "date_published": "2022-09-18 18:04:01+00:00", "description": "Puerto Rico is without power across the island on Sunday as Category 1 Hurricane Fiona heads across its southern coast. Governor Pedro Pierluisi confirmed the electrical outage shortly before President Joe Biden authorized an emergency disaster. &#8220;Today, President Joseph R. Biden, Jr. declared that an emergency exists in the Commonwealth of Puerto Rico and ordered ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/white-house-brags-about-falling-gas-prices-and-people-have-thoughts", "title": "White House Brags About Falling Gas Prices And People Have Thoughts", "date_published": "2022-09-18 17:52:34+00:00", "description": "Twitter exploded with criticisms after President Joe Biden — and the official White House account — shared posts on Sunday touting the declining gas prices over the course of the last several months. President Biden started off the conversation by noting that gas prices at the pump had steadily been declining — since peaking in ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/ridiculous-fox-news-reporter-refutes-claim-the-network-coordinated-with-abbott-ahead-of-migrant-drop-offs", "title": "‘Ridiculous!’: Fox News Reporter Refutes Claim The Network Coordinated With Abbott Ahead Of Migrant Drop-Offs", "date_published": "2022-09-18 17:21:47+00:00", "description": "Fox News reporter Griff Jenkins fired back at the suggestion that the network had coordinated with Governor Greg Abbott (R-TX) to capture footage of illegal migrants being dropped off outside Vice President Kamala Harris&#8217; residence last week. Jenkins, who has been an integral part of the network&#8217;s coverage, told &#8220;MediaBuzz&#8221; host Howard Kurtz that it ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/gop-senator-desantis-abbott-trying-to-send-a-message-about-the-border-crisis-to-the-rest-of-the-country", "title": "GOP Senator: DeSantis, Abbott: ‘Trying To Send A Message’ About The Border Crisis To The Rest Of The Country", "date_published": "2022-09-18 16:40:32+00:00", "description": "Sen. Mike Rounds (R-SD) said that Republican governors are sending a message about the border crisis by transporting migrants to sanctuary cities. Appearing on CNN&#8216;s &#8220;State of the Union&#8221; Sunday, Rounds said that Florida Gov. Ron DeSantis (R) and Texas Gov. Greg Abbott (R) are &#8220;doing their best&#8221; to deal with the influx of migrants ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/nyc-mayor-calls-migrant-busing-an-american-crisis-blames-republican-governors", "title": "NYC Mayor Calls Migrant Busing An ‘American Crisis’, Blames Republican Governors", "date_published": "2022-09-18 16:14:15+00:00", "description": "The mayor of New York City blamed Republican governors for what he called an &#8220;American crisis&#8221; and &#8220;humanitarian crisis&#8221; in the sanctuary city as it grapples with migrants arriving from Texas.  Appearing on ABC’s &#8220;This Week&#8221; Sunday, host Jonathon Karl asked Mayor Eric Adams (D) what President Joe Biden’s administration was doing for the city. ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/texas-democrat-says-biden-admin-needs-to-turn-more-people-away-at-border", "title": "Texas Democrat Says Biden Admin Needs To Turn More People Away At Border", "date_published": "2022-09-18 15:11:53+00:00", "description": "Rep. Henry Cuellar (D-TX) said the Biden administration needs to ramp up border enforcement to mitigate the immigration crisis. Appearing on CBS&#8217; &#8220;Face the Nation&#8221; Sunday, Cuellar said that Governor Greg Abbott (R-TX) and Florida Governor Ron DeSantis (R-FL) sending migrants to Democratic-run cities was &#8220;theater.&#8221; But Cuellar, who represents a district on the Texas ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/yeshiva-university-suspends-all-student-club-activities-after-scotus-sides-with-lgbtq-club", "title": "Yeshiva University Suspends All Student Club Activities After SCOTUS Sides With LGBTQ Club", "date_published": "2022-09-18 14:37:22+00:00", "description": "Yeshiva University has suspended all student club activities after the Supreme Court ruled against its request to overturn the recognition of an LGBTQ student organization. The announcement was shared in an email to students on Friday that indicated the school would “hold off on all undergraduate club activities while it immediately takes steps to follow ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/investigation-reveals-cause-of-accident-that-killed-gop-rep-jackie-walorski-3-others", "title": "Investigation Reveals Cause of Accident That Killed GOP Rep. Jackie Walorski, 3 Others", "date_published": "2022-09-18 13:42:47+00:00", "description": "The investigation into an August crash in Indiana that killed Rep. Jackie Walorski (R-IN) and three others revealed that the driver of her vehicle crossed the center line and ran into another car while attempting to pass a flatbed truck on a two-lane highway. The Elkhart County Sheriff&#8217;s Department shared the information in a news ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/dick-durbin-attacks-gop-governors-over-transporting-migrants-to-democrat-cities-broken-every-basic-standard-of-decency", "title": "Dick Durbin Attacks GOP Governors Over Transporting Migrants To Democrat Cities: ‘Broken Every Basic Standard Of Decency’", "date_published": "2022-09-18 13:22:03+00:00", "description": "Sen. Dick Durbin (D-IL) accused Republican governors of violating &#8220;every basic standard of decency&#8221; by transporting migrants to sanctuary cities. Appearing on NBC&#8217;s &#8220;Meet the Press&#8221; Sunday, Durbin railed against recent moves by Governor Greg Abbott (R-TX) and Governor Ron DeSantis (R-FL) to relocate illegal immigrants from their states to heavily Democratic cities and Martha&#8217;s ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/el-pasos-democrat-mayor-defends-busing-illegal-immigrants-to-new-york", "title": "El Paso’s Democrat Mayor Defends Busing Illegal Immigrants To New York", "date_published": "2022-09-18 12:33:21+00:00", "description": "The Democrat mayor of El Paso defended his city’s policy of busing illegal immigrants 2,200 miles northeast to New York City, saying the beleaguered West Texas city is just trying to help them get to their ultimate destination. Speaking on ABC’s “This Week,” Mayor Oscar Leeser said the migrants are being treated humanely, even though ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/leading-pollster-gop-voters-will-be-virtually-impossible-to-poll-after-bidens-maga-republicans-attacks", "title": "Leading Pollster: GOP Voters Will Be ‘Virtually Impossible To Poll’ After Biden’s ‘MAGA Republicans’ Attacks", "date_published": "2022-09-18 11:25:20+00:00", "description": "A leading independent pollster said Saturday that polls might seriously undercount Republican voters in the current political climate. In a Twitter thread, Trafalgar Group chief pollster Robert C. Cahaly said that President Joe Biden’s recent attacks on so-called “MAGA Republicans” will make polling supporters of former President Donald Trump even harder to poll than in ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/magic-moral-time-machine-bill-maher-calls-out-woke-historians-over-slavery-presentism", "title": "‘Magic Moral Time Machine’: Bill Maher Calls Out Woke Historians Over Slavery ‘Presentism’", "date_published": "2022-09-18 10:45:09+00:00", "description": "Holding historical figures up to modern-day woke values is silly scholarship, Bill Maher declared Friday in his latest ‘Real Time’ lecture to leftists. The old-school liberal made the point about so-called “presentisim” in the “New Rules” segment of his HBO show while discussing a controversial essay by American Historical Society President James Sweet. The historian, ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/major-city-to-dole-out-12000-free-phones-to-homeless-trans-non-binary-people", "title": "Major City To Dole Out $12,000, Free Phones To Homeless Trans, ‘Non-Binary’ People", "date_published": "2022-09-18 09:55:16+00:00", "description": "Denver plans to dole out free phones and $12,000 apiece to 140 homeless women and transgender and “non-binary” people over the next year as part of a bigger partnership with a local nonprofit, according to a report. The money, which totals about $1.7 million, will come out of a $2 million fund from the federal ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/desantis-shatters-all-time-fundraising-record-gives-money-to-republican-candidates", "title": "DeSantis Shatters All-Time Fundraising Record, Gives Money To Republican Candidates", "date_published": "2022-09-18 09:15:56+00:00", "description": "Governor Ron DeSantis&#8217; (R-FL) political operation has raised a historic $177.4 million, more than any other governor in history, and that was before he sent 50 illegal immigrants to Martha&#8217;s Vineyard last week, which erupted into the top national news story. Open Secrets reported that a review of state campaign finance records showed DeSantis&#8217; re-election ...", "persistent": false}, {"source": "https://www.dailywire.com/feeds/rss.xml", "link": "https://www.dailywire.com/news/school-district-defends-trans-shop-teacher-whose-enormous-fake-breasts-spurred-internet-furor", "title": "School District Defends Trans Shop Teacher Whose Enormous Fake Breasts Spurred Internet Furor", "date_published": "2022-09-18 08:14:57+00:00", "description": "A Canadian school district is standing behind a biologically male teacher whose wearing of massive prosthetic breasts created an online furor, according to a new report. Pictures and video circulating online show the shop teacher using a table saw and teaching students while wearing the enormous fake bust, complete with prominent nipples. The teacher has ...", "persistent": true}], "source url": "https://www.dailywire.com/feeds/rss.xml", "source title": "Daily Wire"}