[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Ivermectin clarification", "description": "Ivermectin, is a Food and Drug Administration (FDA)-approved antiparasitic drug,\n\nhttps://www.covid19treatmentguidelines.nih.gov/therapies/antiviral-therapy/\n\nhttps://www.covid19treatmentguidelines.nih.gov/therapies/antiviral-therapy/ivermectin/\n\nDirect from official FDA site\n\nused to treat several neglected tropical diseases, \n\nincluding onchocerciasis, helminthiases, and scabies.\n\nFor these indications, ivermectin has been widely used and is generally well-tolerated\n\nIvermectin is not approved by the FDA for the treatment of any viral infection.\n\nProposed Mechanism of Action and Rationale for Use in Patients With COVID-19\n\n(in vitro studies)\n\nsuggest that ivermectin acts by,\n\nInhibiting host importin nuclear transport proteins\n\nInterfere with SARS-CoV-2 spike protein attachment to the human cell membrane\n\nSome studies of ivermectin have also reported potential anti-inflammatory properties\n\nShown to inhibit replication of SARS-CoV-2 in cell cultures\n\n\nCOVID-19 medical misinformation policy\n\nhttps://support.google.com/youtube/answer/9891785\nhttps://support.google.com/youtube/answer/11161123\n\nIf you're posting content\n\nDon't post content on YouTube if it includes any of the following:\n\nTreatment misinformation:\n\nContent that claims that there's a guaranteed cure for COVID-19\nContent that recommends use of Ivermectin or Hydroxychloroquine for the treatment of COVID-19\n\nCategorical claims that Ivermectin is an effective treatment for COVID-19\n\nClaims that Ivermectin and Hydroxychloroquine are safe to use in the prevention of COVID-19\n\nOther content that discourages people from consulting a medical professional or seeking medical advice\n\nPrevention misinformation: Content that promotes prevention methods that contradict local health authorities or the WHO.\n\nClaims that there is a guaranteed prevention method for COVID-19\n\nClaims that any medication or vaccination is a guaranteed prevention method for COVID-19\n\nContent that recommends use of Ivermectin or Hydroxychloroquine for the prevention of COVID-19\nClaims that Ivermectin and Hydroxychloroquine are safe to use in the prevention of COVID-19\n\nMonitoring, Adverse Effects, and Drug-Drug Interactions\n\nThe FDA first issued a warning in April 2020 that ivermectin intended for use in animals should not be used to treat COVID-19 in humans. This warning was updated and reiterated in 2021. \n\nhttps://www.fda.gov/consumers/consumer-updates/why-you-should-not-use-ivermectin-treat-or-prevent-covid-19\n\n\nFDA, Recommendation\n\nThe Panel recommends against the use of ivermectin for the treatment of COVID-19, except in clinical trials\n\nThe Panel will continue to review emerging data on ivermectin use, including the results from 2 large, ongoing randomized controlled trials.\n\nClinical Trials\n\nSeveral clinical trials evaluating the use of ivermectin for the treatment of COVID-19 are currently underway or in development. \n\nPlease see ClinicalTrials.gov for the latest information.\n\nBangkok\n\nEgypt\n\nMalaysia\n\nIs this one of the two?\n\nhttps://www.principletrial.org/news/ivermectin-to-be-investigated-as-a-possible-treatment-for-covid-19-in-oxford2019s-principle-trial\n\nIvermectin to be investigated in adults aged 18+ as a possible treatment for COVID-19 in the PRINCIPLE trial\n23 June 2021\n\nTime line\n\nhttps://www.principletrial.org/news/the-principle-trial-two-years-on", "link": "https://www.youtube.com/watch?v=cfhuSSl6XKs", "date_published": "2022-10-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]