[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "12 Minutes of Gotham Knights Co-Op Gameplay", "description": "We got hands on with Gotham Knights and tried out the 2 player co-op. Watch as Robin and Batgirl team up to take down Harley Quinn in this latest gameplay clip. We fight our way past Harley's minions throughout the mission and eventually make our way to take on Harley herself. Get a glimpse of Robin's various move sets as well as a new look at cooperative gameplay. \n\n#gothamknights #gaming\n\nGotham Knights is an action role-playing game set in Gotham City. The game features four playable characters: Batgirl, Nightwing, Red Hood, and Robin. Each of the characters has their own playstyle and unique abilities. Robin for example can teleport via the Justice League's satellite. Gotham Knights can be played solo, but the game also features a two-player co-op multiplayer mode, where the second player can drop in and out at any time without affecting the host. You can level up your character while in co-op, but enemies will be automatically level up too. You can also use vehicles such as the Batcycle to explore Gotham City.\n\nGotham Knights is set to release on October 21, 2022 for PC, PlayStation 5, and Xbox Series X/S.\n\nTimestamps:\n0:00 Introduction\n00:58 Aerial Combat Takedown and Co-op \n1:58 Fighting a Group as Robin\n3:28 Harley Quinn Co-Op Boss Battle", "link": "https://www.youtube.com/watch?v=VoAX-VUta5U", "date_published": "2022-10-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "6 Things We Wish We Knew Before Playing Overwatch 2", "description": "From how to merge your Overwatch accounts, to the way the new 5v5 format changes up gameplay, here are some tips and tricks to learn before jumping in to Overwatch 2.\n#gaming #Overwatch2 #gamespot #Overwatch2HowTo #Overwatch2Tips \n\nTimestamps: \n00:26 - Battle Pass explained\n01:23 - Challenges explained\n01:49 - How 5v5 changes the gameplay\n02:43 - How to merge your Overwatch accounts\n04:02 - How to play the three new heroes\n05:31 - Changes to old heroes", "link": "https://www.youtube.com/watch?v=CgugYBAb-jA", "date_published": "2022-10-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Gotham Knights Hands On Preview - We're Cautiously Optimistic", "description": "Lucy and Tam traveled up to WB Montreal to check out Gotham Knights and... They are optimistic. \n\nWe got about 2 hours of game time with the newest entry in the Batman Arkham series of games. They are back to share their thoughts as they ran around Gotham City as Robin, Nightwing, Batgirl, and Red Hood. From combat, to sleuthing, to how the characters all come together in the absence of a Batman; Lucy and Tam cover all aspects of the small slice they were given. For more Gotham Knights content head over to gamespot.com and be sure to get all your Gotham Knights coverage here when it launches October 21st on Playstation, Xbox, and PC.\n\n#gamespot #gothamknights #gaming #batman\n\nTime Stamps:\n00:00 Intro\n00:47 Overview \n01:45 Gameplay Breakdown\n09:35 Story and Character Thoughts\n14:41 Outro", "link": "https://www.youtube.com/watch?v=O2-vLd9kF4Y", "date_published": "2022-10-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Modern Warfare 2's Beta - The Good, Bad, and Ugly", "description": "Jake and David sit down and talk at length about everything they experienced in Modern Warfare 2's multiplayer beta. From map design and the new progression system, to the presentation and gameplay changes, watch to see what they felt was good, bad, ugly, and everything in between.\n#gaming #gamename #gamespot \n\nCall of Duty Modern Warfare 2 wrapped up it’s early access beta for multiplayer and we’ve got a lot of thoughts! Some good, some meh, some bad, and some…really ugly. In this video Jake Dekker & David Ahmadi sit together and talk about some noteworthy topics from the Beta, such as map design, weapon, gadgets, and equipment gameplay, and more. \n\nFans of Modern Warfare 2 be at ease, our thoughts about the beta are pretty positive overall! The gameplay feels solid and more of what made Call of Duty such a classic First Person Shooter over time. Black Ops Cold War fans and Vanguard fans might feel a bit out of place, but anyone who enjoyed Modern Warfare 2019 will feel right at home with the sequel. The only real complaint is with the UI and progression tree which isn’t the friendliest to more casual players, although gun enthusiasts will have an easier time navigating and tinkering with custom weapons. \n\n3rd Person mode also feels really out of place and a bit unnecessary, while map design is…okay. Could be better, could be worse. Overall it’s all serviceable and gets the job done. Be sure to subscribe to GameSpot for more Modern Warfare 2 videos and updates as we’ll be covering the game all throughout its release, including the campaign, multiplayer breakdowns, and Warzone 2.0. If there is anything you guys want to see, leave a note in the comments below!\n\nTimestamps:\n\n0:00 - Intro\n0:18 - Presentation\n2:41 - Gameplay\n8:56 - Maps & Level Design\n13:53 - Progression System\n18:45 - Gunsmith\n20:53 - 3rd Person Mode\n23:01 - Overall Thoughts", "link": "https://www.youtube.com/watch?v=IHWt7ODRf_Y", "date_published": "2022-10-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 Queue Times and Server Issues, Explained | GameSpot News", "description": "Everything going on with Overwatch 2's messy launch, 2025's Call of Duty might have been revealed, as well as the next Need for Speed.\n#Gaming #Overwatch2 #CallOfDuty \n\nWe break down Overwatch 2’s problematic launch, the next, next Call of Duty leaks, as does the imminent release of yet another Need for Speed game. All this on today’s GameSpot News.\n\nOverwatch 2 servers are now live, but players have been having a very hard time accessing them. Since servers went live on October 4, there have been enormous queues to get in, and oftentimes players still cannot access the game despite having 0 players ahead of them.\n\nPerhaps more notably, Blizzard boss Mike Ybarra announced that Overwatch 2 was suffering from a \"mass DDoS\" attack shortly after launch, which he says is causing \"a lot of drop/connection issues.\"\n\nIn a subsequent, late-night update from game director Aaron Keller, it was revealed that a second DDoS was underway, but that Blizzard was \"steadily making progress on server issues and stability.\" He added, \"We're all hands on deck and will continue to work throughout the night. Thank you for your patience - we'll share more info as it becomes available.\"\n\nBlizzard had previously acknowledged an \"unexpected server error\" that some players are receiving. Additionally, the studio has confirmed issues with players' unlocks, including skins, not appearing, as well as Watchpoint pack buyers not having access to it. There's no word on when these issues will be resolved, but the BlizzardCS Twitter account is providing updates as they come in, and a known issues list has been compiled on the Overwatch forums.\n\nAt the time of recording, there doesn’t seem to be any concrete answers on how to circumvent the loading screen, or fix account migration issues. Keep an eye on GameSpot dot com, where we’ll be posting updates to this story as they happen.\n\n2025 is not only the year you’ll get to play Overwatch 2, but also the release of Call of Duty: Advanced Warfare 2 according to a new leak. Reportedly developed by Sledgehammer Games, the Activision studio that led the charge on 2021’s Call of Duty Vanguard, reliable Call of Duty leaker Ralph Valve says that the studio is hoping to abandon the World War II setting of their recent work and return to the sci-fi setting that they left back in the mid-2010's.\n\nBy contrast, 2014's Advanced Warfare had a more near-future approach to things, with players donning mech-like \"exoskeletons\" that gave them superhuman abilities, like double-jumps. It featured now-disgraced actor Kevin Spacey, who was considered a major coup for the series at the time. Today, it's probably best-known as the origin of the infamous \"press F to pay respects\" meme.\n\nRalph Valve's report suggests that Sledgehammer was originally planning a follow-up to the WWII-themed Vanguard, but that entry failed to sell well enough to justify that.\n\nHowever, another reliable leaker CharlieIntel claims that they have heard “that there is no Advanced Warfare 2 currently in development at Sledgehammer Games, despite the rumors today.” \n\nTIMECODES:\n00:13 - Overwatch 2's launch woes\n01:46 - Call of Duty Advanced Warfare 2\n03:07 - Need for Speed Unbound leak", "link": "https://www.youtube.com/watch?v=4YdT9cNxRCk", "date_published": "2022-10-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "WILD HEARTS | Official 7 Minute HD Gameplay Trailer", "description": "From scenic meadows to verdant bamboo forests, get a look at some of your hunting grounds in the beautiful but troubled land of Azuma. See how karakuri will aid in taking down the mighty beasts you’ll face in both single and multiplayer as well as the incredible weapons you’ll be able to wield.\n\nMaster ancient tech to hunt down giant beasts. WILD HEARTS™ is a unique twist on the hunting genre where technology gives you a fighting chance against fearsome beasts infused with the ferocious power of nature itself. Take on these creatures alone or hunt with friends in seamless co-op.\n\nDeveloped by Omega Force, the Japanese studio behind the DYNASTY WARRIORS franchise and in partnership with EA Originals, WILD HEARTS takes you on an epic adventure set in a fantasy world inspired by feudal Japan. \n\nThe hunt begins 17th February 2023.\n\n#WildHearts #KoeiTecmo", "link": "https://www.youtube.com/watch?v=qNt_LuxFHw4", "date_published": "2022-10-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "24 Overwatch Heroes That Never Made The Cut", "description": "Heroes in Overwatch are some of the most meticulously designed and well crafted characters in the business. I want to explore some of the characters that either evolved into the heroes we know today, or got left on the cutting room floor.\n#gaming #Overwatch #gamespot #Overwatch2 \n\nStu here to dive into the development and evolution of the Overwatch Roster. In the last 6 years Overwatch’s heroes have become some of the most iconic characters in video games, and it's been fascinating to explore all the different design elements and deliberate choices the team made to create such a unique roster of characters. With the addition of more heroes at launch and many more updates coming with Overwatch 2, I cannot wait to see the new types of heroes that Blizzard can cook up.\n\n#overwatch2 #overwatch #gaming\n\nSTAMPS:\n00:00 Intro\n00:13 Brit\n00:32 Bruiser\n00:42 Firestarter\n01:02 Frost\n01:19 Helio\n01:35 Hivemind\n01:55 Huntress\n02:17 JetPack Cat\n03:21 Luc\n03:38 Mama Hong\n03:54 McCloud\n04:18 Overmind\n04:32 Phoenix\n04:53 Phreak\n05:14 Praetor\n05:39 Psyblade\n05:53 Rashi\n06:09 Recluse\n06:35 Rumble\n06:49 Shield Guy\n07:09 Troy\n07:18 Watcher\n07:29 Wildebeest\n07:49 Yetzi\n08:00 Genji\n08:06 Outro", "link": "https://www.youtube.com/watch?v=a7MByOMOWA0", "date_published": "2022-10-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 Sequel Announced, Witcher Projects Explained | GameSpot News", "description": "CD Projekt Red announces Cyberpunk 2077 sequel as well as several Witcher Games, the Dead Space remake gets its first look at gameplay, and Nintendo announces a Direct around the upcoming Super Smash Bros. movie.\n#GameSpot #Cyberpunk #witcher3 \n\nCyberpunk 2077 is getting a sequel, more Witcher games than you can shake a stick at, Dead Space reveals final gameplay, and a Nintendo Direct is coming this week. All on today’s GameSpot News.\n\nAs part of its strategy presentation, CD Projekt has announced that it has multiple new games in development. Although details are slim, the company did announce that a sequel to 2020's Cyberpunk 2077 is in development under the codename \"Project Orion\" and will \"prove the full power and potential of the Cyberpunk universe\" when it is released.\n\nAdditionally, a number of new games set in The Witcher universe are also in various stages of development. These are all being developed under various codenames as well, and include Project Sirius, Project Polaris, and Project Canis Majoris.\n\nFor Project Sirius, this Witcher game is described as an innovative take on the series that is aimed at both veteran fans and people new to the franchise. Currently in pre-production, it is being developed by Flame in the Flood developer The Molasses Flood and has 60+ people involved in its creation.\n\nProject Polaris is described as a story-driven open-world RPG built on the legacy of The Witcher 3: Wild Hunt and has more than 150 people working on it at CD Projekt Red. This game will be the start of a new Witcher trilogy that is aiming to be delivered within a 6-year period following the Polaris release.\n\nA story-driven single-player open-world RPG set within The Witcher universe, Project Canis Majoris  will be developed by a third-party studio that will be led by ex-Witcher veterans.\n\nBeyond its two most well-known franchises, CD Projekt is also working on a new standalone IP, codename Project Hadar. It has been in \"IP incubation\" since 2021 and is currently in the conceptual phase. This game is described as being distinct from Cyberpunk 2077 and The Witcher and is being developed 100% internally.", "link": "https://www.youtube.com/watch?v=y9Nr_eV-pck", "date_published": "2022-10-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dead Space Official 4K Gameplay Trailer", "description": "Something has gone horribly wrong on board the mining ship, USG Ishimura. \n\nGet your first look at Dead Space™ gameplay. See how you’ll explore the eerie, echoing corridors and workspaces within the USG Ishimura and survive the nightmarish horrors that await you. \n\nThe sci-fi survival horror classic Dead Space returns, completely rebuilt from the ground up to offer a deeper and more immersive experience. This remake brings jaw-dropping visual fidelity and suspenseful atmospheric audio, as well as new gameplay content and improvements while staying faithful to the original game’s thrilling vision.\n\nPrepare to uncover the mystery aboard the USG Ishimura when Dead Space launches on January 27, 2023.\n\n#DeadSpace", "link": "https://www.youtube.com/watch?v=4Tls3Wx_M4A", "date_published": "2022-10-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]