[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "MinisForum DeskMini UM580 review: a good GAMING CONSOLE?", "description": "Download Safing's Portmaster, or subscribe to the SPN, and take control of your network traffic: https://safing.io/portmaster \n\nLink to the UM580: https://bit.ly/3RnrBJ5\n\n👏 SUPPORT THE CHANNEL:\nGet access to a weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYouTube: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n📹 MORE VIDEOS FROM ME\nLinux news in Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\nGaming on Linux: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nI'm also on ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n🏆 FOLLOW ME ELSEWHERE:\nTwitter : http://twitter.com/thelinuxEXP\nInstagram: https://www.instagram.com/nick_thelinuxexp/\nMastodon: https://mastodon.social/web/@thelinuxEXP\nPixelfed: https://pixelfed.social/TLENick\n\nThis video is distributed under the Creative Commons Share Alike license.\n\n#steamdeck #linux #minipc \n\n00:00 Intro\n00:54 Sponsor: Monitor and secure your internet connection\n01:49 Specifications and design\n05:47 Linux support and performance\n07:29 Gaming Performance\n10:38 Final Thoughts\n12:09 Support the channel\n\n\nThe UM580 is a 13 centimeters square, and it's 4.6 centimeters tall. It comes with a ryzen 7 5800H, and it has a lot of ports. You're getting 2.5Gig ethernet, 2 HDMI ports that go up to 4K at 60 hertz, an audio jack, 2 USB 2 ports, 2 usb 3.2 ports, and 3 USB C ports. One is data only, on the front, one supports display port, on the front as well, and one supports power, display port, and alt mode.\n\nYou can upgrade the RAM, which is dual slot DDR4, and can go up to 64 Gigs. You can also replace the M.2 SSD, and you have a nice little slot on the back of the case where you can screw a 2.5 inch SATA drive, and plug it in using the included little cable.\n\nBy default, the UM580 comes with 16Gigs of RAM and 512Gigs of SSD, for 550 dollars. If you already have what you need, you can also buy it barebones, with no RAM or SSD, for 439 dollars, and for 599, you get 32Gigs of RAM, and 512Gigs of SSD, which feels reasonable in terms of pricing.\n\nYou also get Wifi6 and bluetooth 5.2, and the chip is removeable if you want.\n\nThe entire thing is powered by a ryzen 7 5800H, and this is and 8 core, 16 threads CPU, with a base clock of 3.2Ghz, and turbo boost up to 4.4. Its default TDP is 45W, and that's what this mini PC uses out of the box.\n\nOn Geekbench, it got 1407 in single core, and 7492 in multi core, which is pretty darn good for a PC that size and that costs less than 600 dollars. \n\nhttps://browser.geekbench.com/v5/cpu/17670981\n\nI tried a few games from the SteamOS interface. Note that this means that all games are limited to 720p, but can be upscaled using FSR to the native resolution of your monitor: this is mainly to compare with performance on the Deck. Of course, you can run these titles from desktop mode, or in a normal Linux distro without any issues.\n\nIn Crash bandicoot N Sane Trilogy, at High details, without vsync, you're getting a relatively smooth 40FPS while being upscaled from 720p to 1080p. If you lower everything to medium, you'll get closer to 50FPS, and at low, you're basically not gaining anything in terms of FPS. In this game, performance isn't comparable to the Deck at all, which runs it at 60FPS on ultra without a problem, in docked mode with the same upscaling.\n\nPlaying Hades yielded close to 60FPS. This game isn't very demanding, but it's a super quick reaction game, so every dropped frame can get you hurt and ruin your run, and here, it can't stick to a smooth 60FPS, with a few drops to 55 or 58. On this game, the Deck seems to perform better, being able to handle 60FPS without any problems even when upscaling.\n\nIn Shadow of the tomb raider, running at medium settings at 720p, with FSR enabled to upscale at 1080p, the game reaches around 30 FPS on average, which is pretty good! On low details, you can expect around 35 to 40 FPS. The deck can achieve closer to 50FPS  on low settings, so, again, the UM580 falls far off the mark.\n\nResident Evil 2 is a pretty demanding game, and running it at 720p upscaled to 1080p, at medium settings, it managed 50 to 60 FPS, which is really, really good, and playable. Here, finally, the performance is comparable with the steam deck.\n\nSo, to sum it up, the UM580 is a bit less powerful than a Steam Deck, and that pretty much makes it less appealing than the Steam Deck itself as a console: you might as well buy a Deck and use it in docked mode.", "link": "https://www.youtube.com/watch?v=mVuLkPf-9f4", "date_published": "2022-10-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]