[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Susana Baca: Tiny Desk (Home) Concert", "description": "From Sept. 15 through Oct. 15, Tiny Desk is celebrating Latinx Heritage Month with an El Tiny takeover, featuring Jessie Reyez, Girl Ultra and more musicians from all corners of Latinidad.\n\nStefanie Fernández | October 5, 2022\nAt the Babel library and bookstore in Lima, Peru, Susana Baca is surrounded by books, wine and percussion. In addition to their instruments, her band members play the desk they sit around itself, an organic setting that blurs the boundaries between music and context. “Estamos aqui, todos unidos por la música en este bello pupitre,” she laughs: “We’re here, all united by music at this beautiful desk.” The percussive fugue of “Molino Molero” ends sharply before, by contrast, the unwound and languorous “Dämmerung” stretches beneath her clarion voice. \n\nIn addition to being a musician, Baca has worked as  an ethnomusicologist, a schoolteacher and Peru’s former Minister of Culture; she’s a curator of folklore and culture of the highest order. Throughout her El Tiny performance, the camera shifts to an overhead shot of the desk, featuring her 2021 album Palabras Urgentes beside several books and a note that says “Eres lo que lees” (You are what you read). Her performance, like all of her music, is intimate because it’s situated, musically and thematically, in a specific time and place.\n\nAcross her many careers, Baca’s work is always in service of preserving and honoring African and Indigenous art forms. Her rendition of “Sorongo,” written by Puerto Rican composer Tite Curet Alonso, is an electric and pulsing homage, transmuting the salsa of the original to a meditation driven by the drums, cajón and cheko, grounding the narrative of African enslavement across Latin America in Afro-Peruvian percussion. The same goes for her closer, a salsafied version of Chabuca Granda’s “Canterurías,” which she introduces as “Afro-Peruvian bonus track en Babel!”\n\nIn this library, you are what you read. Joyfully running her hands along the spines of books behind her, Baca reminds us not just of the essential texts, but how to examine them with intention, precision and rapture.\n\nSET LIST\n“Molino Molero”\n“Dämmerung”\n“Sorongo”\n“Canterurías”\n\nMUSICIANS\nSusana Baca: vocals\nÓscar Huaranga: bass\nJonathan Mendoza: acoustic guitar, vocals\nAlex Quijandría: percussion, vocals\nManuel Mejía: percussion, vocals\nLuis Miguel: percussion\nRenzo Vignati: electric guitar\nJuan Carlos: piano, violin\n\nCREDITS\nProducer: Ricardo Pereira\nDirector: Giancarlo Aponte\nCameras: Gustavo de la Torre Casal, William Marquina, Jair Guillén, Fernando Galván\nArt and Styling: Amaro Casanova\nCamera Grip & Dolly: Omar Salazar\nEditing and Color: Giancarlo Aponte\nAudio Recording Engineer: Fico Hoyle\nMixing and Mastering: Óscar Huaranga\nFilmed at Babel library and bookstore\n\nTINY DESK TEAM\nProducer: Anamaria Sayre\nVideo Editor: Joshua Bryant\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Marissa Lorusso, Hazel Cills, Maia Stern, Ashley Pointer, Felix Contreras, Fi O'Reilly\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #eltiny #susanabaca #tinydesk", "link": "https://www.youtube.com/watch?v=7WiGD2vOqDk", "date_published": "2022-10-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]