[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "The Real CSI (full documentary) | FRONTLINE", "description": "A joint FRONTLINE investigation found serious flaws in some of the best-known tools of forensic science and inconsistencies in how forensic evidence was presented in the courtroom. (Aired 2012)\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nExpertise on fingerprints, ballistics and bite mark analysis is routinely called on to solve the most difficult criminal cases — and to put perpetrators behind bars. But how reliable is the science behind forensics? A joint investigation by FRONTLINE, ProPublica and the Investigative Reporting Program at UC Berkeley examined the science, the credentialing of forensic experts and how a field with few uniform standards and unproven science could end up undermining the search for justice.\n\nExplore additional reporting on \"The Real CSI\" on our website:\nhttps://www.pbs.org/wgbh/frontline/documentary/real-csi/\n\n#Documentary #CSI #FRONTLINE #ForensicScience\n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nFRONTLINE is produced at GBH in Boston and is broadcast nationwide on PBS. Funding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.\n\nCHAPTERS:\nPrologue - 00:00\nHow Reliable Are Fingerprints As Evidence?  - 01:33\nCognitive Bias  in Fingerprint Examiners  - 10:31\nIs Forensic Science Based on Scientific Methodology?  - 17:07\nForensic Evidence in the  Casey Anthony Case - 26:20 \nHow to Become a  Forensics “Expert” - 35:52 \nCrime Scene Investigation, An “Evolving Science” - 48:15\nCredits - 51:58", "link": "https://www.youtube.com/watch?v=WQZpJCNat-A", "date_published": "2022-10-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]