[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "DEEPIN: is the MOST BEAUTIFUL Linux desktop GOOD?", "description": "Use code LINUXEXPERIMENT to get 25% off your 2TB cloud storage plan on Internxt: https://internxt.com/pricing\nGrab a brand new laptop or desktop running Linux:https://www.tuxedocomputers.com/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nLinux news in Youtube Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\n\nJoin us on our Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMastodon: https://mastodon.social/web/@thelinuxEXP\n\nPixelfed: https://pixelfed.social/TLENick\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\nThis video is distributed under the Creative Commons Share Alike license.\n\n#linux #deepin #desktop \n\n00:00 Intro\n00:43 Get 25% off your private and secure file and photo storage\n01:53 The Desktop Shell: beautiful, but not very open\n05:39 Look & Feel: that's a really beautiful theme\n08:48 Window Management: a step behind other desktops\n10:47 Default Applications: a large, good selection\n14:46 App Store: Good ideas, bad execution\n16:50 Is Deepin a good desktop?\n18:22 Get a laptop or desktop running Linux out of the box\n19:40 Support the channel\n\n\nBoth layouts are more Windows like. The default one, \"Fashion mode\", is more WIndows 11 inspired, with a floating panel, centered task list and app shortcuts, indicators on the right, but keeping the menu in the bottom left corner.\n\nThe other mode, called \"Efficient\" mode, is basically the previous windows layout, with the panel stuck to the bottom, and the task list aligned to the left.\n\nThe main Deepin menu lets you open apps. You can turn this menu into a full screen grid of apps.\n\nApps in the grid can be rearranged, but you can't create your own folders, unfortunately.\n\nGrand Search is basically spotlight from macOS. You can open it by hitting shift + space , and it lets you search through files, folders, documents, apps, settings, or even web searches.\n\nNow, let's talk looks, because Deepin is, in my opinion, the most beautiful desktop you can get on Linux. Not only because it's nice, and modern, and a bit flashy, but also because that design actually seems well thought out. \n\nThe desktop itself isn't super heavy on effects and transitions. The apps have a solid, white or black background, with good contrast: very dark grey text and buttons, with blue highlights by default. The default theme Deepin apps use is also used on other apps you decide to install, GTK or KDE apps.\n\nOf course, you can tweak all of that, with a dark mode, or an auto light/dark switch, and accent colors.\n\nWindow management on Deepin DE is pretty basic. It has edge tiling, and drag up to maximize, as you'd expect, although corner tiling isn't there. It also has a multitasking view that combines virtual desktops and an exposé view of all your currently open apps.\n\nThis view is pretty laggy and doesn't feel very smooth, with choppy animations, even on a relatively good integrated AMD GPU in high performance mode. It looks good, but it's not very fluid.\n\nThere are touchpad gestures as well to switch between desktops and activate the multitasking view, but these aren't really good.\n\nThere is also no holding SUPER to drag a window from anywhere, which is weird.\n\nDeepin Desktop comes with a LOT of apps and utilities.\n\nThe file manager looks good, on the same level as Nautilus in terms of feature set. The web browser is a chromium derivative, based on an old chromium version.\n\nThe terminal emulator is also simple, with tabs, a few visual options, keyboard shortcuts, but no profiles or customizable colors.\n\nThen you have a basic calendar app, and a good email client with integrations with a few chinese providers, as well as gmail or yahoo, but that works with generic IMAP.\n\nAnd then there's the Deepin App Store. It's a beautiful looking piece of software. It handles app updates but not system updates, which are located in the settings, and it lets you search through all apps you've installed, or want to install.\n\nOn the Deepin distro, though, it's a mess. The App Store isn't well stocked at all, and most apps you'll find are outdated.", "link": "https://www.youtube.com/watch?v=FN67Zn3thNY", "date_published": "2022-07-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]