[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Logitech G Cloud Gaming Handheld Reveal Full Presentation | Logi Play 2022", "description": "We got our first look at the Logitech G Cloud handheld at todays Logi Play 2022. We learn more about the partnerships with Xbox and Nvidia Geforce now, battery life, and most importantly the price and release date of the unit. Check out the timestamps below for more information.\n\n#logitech #cloudgaming #gaming \n\nTimestamps\n0:00 Introduction\n1:00 Logitech G Cloud Handheld Reveal\n1:27 A word from Tencent\n3:02 The G Cloud Handheld in person reveal\n3:47 Logitech G Cloud Handheld Trailer\n4:38 Breakdown of the handheld\n6:39 A word from Xbox\n9:21 A word from Nvidia on Geforce Now\n11:51 Closing Statements", "link": "https://www.youtube.com/watch?v=XA9-iykKJrw", "date_published": "2022-09-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Logitech Reveals Its Own Gaming Handheld | GameSpot News", "description": "Logitech unveils a cloud based gaming handheld, Xbox gets a fun update, PlayStation won't launch their own games day and date on their PS Plus, and the details on the next Modern Warfare 2 beta.\n#Gaming #SteamDeck #Logitech #PS5 #ModernWarfare2 \n\nLogitech has jumped into the gaming handheld market that’s currently dominated by Steam Deck, Xbox has put out a new update, and PlayStation Studios games aren’t coming to subscriptions day and date any time soon. All this on today’s GameSpot News.\n\nLogitech has a gaming handheld, that can play games like Halo Infinite, Grounded, Sea of Thieves, and Forza Horizon 5. But there’s a catch— it’s all done via streaming.\n\nVia services like Xbox Cloud Gaming and GeForce Now, this device will allow you to take your games on the go… As long as you have a WiFi connection, because there’s zero options for cellular.\n\nIf you’re asking yourself, “is there anything this can do that my phone with a controller grip can’t?” the answer is no, there seemingly isn’t. And if you own a handheld like the Steam Deck that can play dedicated PC games, those also allow you to access the same streaming services, although the process to set them up is a little more complicated on those devices.\n\nThere is one area that the Logitech G Cloud gaming handheld succeeds in and that is battery life. If you don’t want to drain your phone’s power, Logitech’s handheld will provide up to 12 hours of battery life. It also sports a 7-inch, 1080p LCD screen with a 60Hz refresh rate. You’d think with a price tag of $350, matching the OLED Switch, it would pack an OLED screen. \n\nIf this incredibly niche product speaks to you, then pre-ordering ahead of its October 15th launch will nab you a $50 discount.\n\nOn the console side, Xbox has put out a fun update for its users. With this latest update you'll be able to change the Xbox button color on any Series 2 Elite controller. You can do so in the Xbox Accessories app on your Xbox console or PC, as long as your controller is connected. Alongside this, Xbox has released its Elite Series 2 Core controller, a white version of the device that excludes additional items such as the backpedals and swappable thumbsticks for a lower price point fo $130. Those items can be purchased in an additional accessory pack for $60.", "link": "https://www.youtube.com/watch?v=C3qJGYhFbQI", "date_published": "2022-09-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "SCORN 8 Minute Official 4K Prologue Gameplay", "description": "Take a look at 8 minutes of new Scorn gameplay and prepare to take your first few steps into Scorn’s truly unsettling hellscape next month. Check out the game’s first grotesque puzzle, this new gameplay walkthrough gives players a glimpse at the immersive nightmare that awaits.  \n\nScorn makes its way to PC and Xbox Series X|S (day one with Xbox Game Pass) on October 21. \n\n#scorn #gaming", "link": "https://www.youtube.com/watch?v=5069YMgJ9mE", "date_published": "2022-09-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Scorn Preview - Beautiful, Disturbing, And A Bit Directionless", "description": "We got a chance to see Scorn during a preview, and it looks to be shaping up to be an impressively haunting game. That said, we hope the full release offers more context to the world and the player's goal.\n#gaming #scorn #gamespot \n\nScorn's entire intent seems to be to disgust, disturb, and unnerve the player with its terrifying imagery of fleshy hallways and unsettling biomechanical monstrosities. Developer Ebb Software says that it pulled from the works of Swiss artist H. R. Giger and Polish painter, photographer, and sculptor Zdzisław Beksiński when constructing its part flesh, part machine world--injecting Giger's biomechanical art style into Beksiński's dystopian surrealism.\n\nScorn is scheduled to launch for Xbox Series X|S and PC on October 21. The game will also launch day one on Xbox Game Pass.", "link": "https://www.youtube.com/watch?v=jrxBfIwsxfY", "date_published": "2022-09-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Texas Chain Saw Hands-On Preview", "description": "After working on Friday The 13th, Gun Interactive says it understood Texas Chain Saw couldn't just be a \"copy and paste.\"\n#gaming #gamename #gamespot \n\nThe number of asymmetrical horror games has risen dramatically over the last few years, with games such as Friday The 13th, Dead By Daylight, Evil Dead, and more giving players the chance to see the world through the eyes of both original monsters and licensed slashers--not to mention their hapless victims. No two of these games are the same, but Gun Interactive is one of a very small number of studios to work on a second, separate franchise within the genre. For the studio, moving from the misty Camp Crystal Lake to the oppressive Texas heat is an undertaking that goes beyond setting and scenery.\n\nThe game plays in 4v3 matches where four victims--notably not named \"survivors,\" but instead \"victims\"--awaken already ensnared by the Slaughter family that consists of the hitchhiker, the cook, and, of course, Leatherface himself. In the 50 years since the original Tobe Hooper movie shocked audiences with its unflinching portrayals of violence, Leatherface has outgrown his own series in a way, partly due to marketing decisions, Keltner believes. As slashers blew up in the 1980s, Leatherface had to become the series' mascot, its face of evil who could stand tall next to Jason Voorhees, Freddy Krueger, Michael Myers, and the rest. But the original movie was much more focused on the family as a whole, so, in being a recreation of sorts of that 1974 film, the game does this too.\n\nFaithful video game adaptations of other visual media can uniquely immerse players who bring with them a level of familiarity, and for me today, that means an eagerness to get back into that house despite knowing the horrors that await within it.", "link": "https://www.youtube.com/watch?v=aSURf0yQCOg", "date_published": "2022-09-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 with NVIDIA DLSS 3 & Ray Tracing Overdrive Mode Trailer", "description": "Experience Cyberpunk 2077 like never before with incredible visuals of Night City enhanced by the new Ray Tracing: Overdrive Mode and up to 4 times the performance increase with NVIDIA DLSS 3, coming soon.\n\nCyberpunk 2077 is an open-world, action-adventure RPG set in the dark future of Night City a dangerous megalopolis obsessed with power, glamor, and ceaseless body modification.\n\n#cyberpunk2077 #nvidia #gaming", "link": "https://www.youtube.com/watch?v=ggHvchi_XeI", "date_published": "2022-09-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New PS5 Reportedly Releasing In 2023 | GameSpot News", "description": "A new, slim PlayStation 5 next year, Nvidia's 4000 series GeForce GPUs, Cyberpunk visual updates, and an Iron Man game from EA.\n#Gaming #Cyberpunk #PS5 \n\nHas the PlayStation 5 Slim been revealed? Plus, Nvidia’s new (expensive) graphics cards, new Cyberpunk updates for them, and yet another Marvel game announcement. All on today’s GameSpot News.\n\nA new version of the PlayStation 5 will be released in 2023 featuring a detachable disk drive, according to a new report from Tom Henderson at Insider-Gaming. Sources told the site that this new model of the PS5 has been in production since the PS5 launched in November 2020.\n\nThe new remodel will reportedly feature a detachable disc drive, and will connect to the PS5 via a USB-C port on the back of the console. The site went on to claim that the PS5 will be sold on its own or in a bundle with the detachable disk drive, while these rumored disc drives will be made available for sale separately.\n\nThe new PS5 model is said to be \"slimmer and lighter\" than the current system. The report had no mention of pricing.\n\nIf that wasn’t enough hardware for you, Nvidia finally unveiled their 4000 series cards, and… well they’re not cheap.\n\nThe RTX 4090 is Nvidia's new flagship GPU, shipping with 24GB of GDDR6X memory. Nvidia claims that it will be able to deliver framerates higher than 100fps when gaming at 4K, all while consuming the same amount of power as the RTX 3090 Ti. \n\nUsing DLSS 3, the latest version of Nvidia's AI based up-resing tech, Nvidia says that the RTX 4090 sees four times more performance than the RTX 3090 Ti using DLSS 2. The RTX 4090 starts at $1599 and launches on October 12.\n\nThe RTX 4080 is launching in two different configurations; a 12GB configuration and a 16GB one. Nvidia claims even the lower-end 12GB card can outperform the 3090 Ti when utilizing DLSS 3. The RTX 4080 16GB starts at $1199, while the 12GB version starts at $899. Both will launch sometime in November.\n\nTo show off Nvidia’s fancy new cards and DLSS tech, a new version of Portal is coming out called Portal RTX. It’ll be a free update for owners of the game on Steam in November, and will work on any RTX card, despite DLSS 3 being exclusive to the 4000 series GPUs. \n\nNvidia will also be releasing called RTX Remix, that allows modders to easily bring RTX enhancements like up-rezed textures and ray-tracing to older titles, Elder Scrolls III: Morrowind used as an example in the reveal showcase.\n\nIf you want to check out these new cards with a more recent release, Cyberpunk is getting a 4000 series makeover. DLSS 3 will allow for a new Overdrive ray-tracing mode, that’ll make the regular, old boring ray-tracing mode on your stupid, crappy current RTX GPU look like you’re playing the game in 1977, not 2077.", "link": "https://www.youtube.com/watch?v=4aHtO0QD888", "date_published": "2022-09-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 Kiriko Origin Story Trailer", "description": "Get to know more about Kiriko Kamori a ninja healer coming to Overwatch 2!\n\nLearn about how she forged her own path with a mix of tradition and innovation.\n\n#overwatch2 #kiriko #gaming", "link": "https://www.youtube.com/watch?v=u6YgMMada2A", "date_published": "2022-09-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Return To Monkey Island Review", "description": "The iconic point-and-click adventure series returns with a heartfelt and nostalgic adventure that any mighty pirate would be a fool to miss.\n\n#gaming #returntomonkeyisland #gamespot", "link": "https://www.youtube.com/watch?v=4--LplBTNwI", "date_published": "2022-09-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]