[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Story Change That Broke The Forgotten City", "description": "When developer Modern Storytellers wanted to make its successful Skyrim mod The Forgotten City a full-fledged game, they planned for a two year reskin. What they didn't know is that the small decision would derail the game's development for years.\n\nThe Forgotten City is a murder mystery, stuck in a time loop, set in an intricately designed Roman City. It's so well realized, that if you didn't know, you might assume the game was built from the ground up to always be that way. In actuality, it started as a Skyrim mod set in an underground Dwarven city. \n\nThe original mod was a huge success, amounting in millions of downloads and garnered several writing awards including Best Interactive Media from the Australian Writers' Guild. Designer/writer Nick Pearce enjoyed making the mod so much that he left his established career as a lawyer to pursue game development full-time and bring the mod to life as a full-fledged standalone game. \n\nWhat was intended as a two year endeavor to remake the game in a Roman setting turned into a cascading list of problems that would cause Nick Pearce and his development team, Modern Storytellers, to rewrite and rebuild the game from the ground up.\n\nThis is the story of how changing the setting broke The Forgotten City.\n\n#gaming #forgottencity #gamespot #modernstoryteller #skyrim", "link": "https://www.youtube.com/watch?v=EwcfrBtRyiI", "date_published": "2022-07-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Escape From Tarkov’s Guns PART 4", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down more of the weaponry of Escape From Tarkov, including the Milkor Grenade Launcher, a pair of G36s, and the iconic PPSh-41.\n\n00:00 - Opening\n00:39 - Baikal Double Barrel Shotgun\n03:00 - AXMC\n04:11 - G36\n05:19 - G36K\n06:48 - Milkor Grenade Launcher\n10:05 - PP-19-01 Vityaz (Customized)\n13:36 - PPSh-41\n16:05 - RPK-16\n18:14 - Ending\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down more of the guns of Escape From Tarkov and compares them to their potential real-life counterparts.\n\nFirearms Expert Reacts playlist - https://www.youtube.com/watch?v=y4T78VQoWUs&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=BvZQFat6sAc", "date_published": "2022-07-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xenoblade Chronicles 3 - Everything to Know", "description": "Xenoblade Chronicles 3 is the latest game in Monolith Soft and Tetsuya Takashi's anthology Xeno series releasing to the Nintendo Switch. Here is everything you need to know about Xenoblade Chronicles 3.\n#Xenoblade #Xenoblades #Xenobladechronicles #Xenosaga Chronicles 3 \n\nXenoblade Chronicles 3 is set in the world of Aionios, which is notable for its 2 major nations of Keves and Agnus - who constantly war with one another. Characters from Keves and Agnus only have 10 year life spans dubbed \"terms\".\n\nIn Xenoblade Chronicles 3, you control 6 primary characters, 3 from Keves, and 3 from Agnus, who become unlikely allies and friends, who will end up fighting together to discover the truth of the world of Xenoblade Chronicles 3. In order to fight, each character starts with a primary class with its own set of arts to use in fightings - however, can switch classes and arts in-between fighting to level up and learn all new master arts that can be equipped regardless of class.\n\nSome of the classes available included Swordfighter, Zephyr, Medic Gunner, Tactician, Heavy Guard, Ogre, Guardian Commander, Incursor, and War Medic.\n\nImportantly, each of the main characters has another character they'll be able to interlink with. This fuses the two characters you choose together into a mech-like form called an Ouroboros for a limited set amount time. These Ouroboros also have special arts, however not constrained by the same limits as the characters on their own.\n\nXenoblade Chronicles 3 releases July 29, 2022, with additional content releasing later this year, and into next year through a Xenoblade Chronicles 3 Expansion Pass for an additional cost.", "link": "https://www.youtube.com/watch?v=9Hxh4MGahRU", "date_published": "2022-07-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]