[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Monica: Tiny Desk (Home) Concert", "description": "This year, NPR Music is celebrating Black Music Month with an array of brand new Tiny Desk concerts — both from home and from behind our beloved Desk. Together, these artists represent the past, present and future of Black music. This month of carefully curated shows is a celebration of Black artists expressing themselves in ways we've never seen before, and of the Tiny Desk's unique way of showcasing that talent.\n\nMitra I. Arthur | June 24, 2022\nIt's only right to think \"New Monica!\" when her Tiny Desk (home) concert begins. Surrounded by candlelight, dressed in pink, Monica stands ready to deliver a vibrant vocal masterclass.\n\nWith her rich alto, Monica broke onto the music landscape in 1995 with her debut album, Miss Thang. In her class of '90s artists, the singer brought a mature sound, yet still tempered by youth, that made her relatable to audiences of any age who were growing into their own. Monica's albums are grounded in the here and now, the ups and the downs of life and love. For fans, she feels like a longtime friend to root for, not only for her talent, but because her realness is valued — an energy she brings to this performance.\n\nHere Monica and her musicians strip down 2003's \"So Gone,\" allowing a mellow, acoustic guitar to shine alongside the vocals. She shows us that when it comes to any #SoGoneChallenges, the viral challenge that had artists putting their own spin on the song, her original still reigns supreme. She also gives us a teaser of her upcoming single, the collaboration with Ty Dolla $ign \"Friends,\" on which Monica presents a tale of a relationship that doesn't require understanding from anyone on the outside, her soaring and acrobatic voice bending over a declaration of love. And when Monica revisits singles from her debut album, \"Why I Love You So Much\" and \"Before You Walk Out of My Life,\" in her Tiny Desk (home) concert they resonate on a different, and perhaps deeper, level now.\n\nSET LIST\n\"Angel of Mine\"\n\"Love All Over Me\"\n\"Why I Love You So Much\"\n\"So Gone\" \n\"Friends\" \n\"Before You Walk Out of My Life\" \n\nMUSICIANS\nMonica: vocals \nPriestly Johnson: vocals\nAshley Minnieweather: vocals\nAlexis McKinnon: vocals \nHerman \"P-Nut\" Johnson: drums \nRuben Royster: bass\nAdrian Forbes: keys\nDave Maiorino: guitar\n\nCREDITS\nExecutive Producers: Monica, Melinda Dancil \nAssociate Producer: Maurio Jackson \nProduction Coordinator: Rolanje Armstead \nCreative Director: Daniel \"Baby Yu\" Nakayama \nSet Designer: Akeem Clayton Designs\nLive Audio/Recording Engineer: Joseph Spencer III \nLive Audio/Recording Engineer: Tech: Ricky William Horton \nDirector: JT Colston \nDirector Of Photography: Sam Aldrich \nDigital Photography: Cyndi Brown \nCamera Operator: Tara Diiorio\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Michael Zamora\nAudio Mastering: Josh Rogosin\nAnimator: Kaz Fantone\nTiny Production Team: Bob Boilen, Kara Frame, Joshua Bryant, Maia Stern, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #monica #BMM", "link": "https://www.youtube.com/watch?v=jJ2rPTG1G9U", "date_published": "2022-06-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Maverick City Music: Tiny Desk Concert", "description": "This year, NPR Music is celebrating Black Music Month with an array of brand new Tiny Desk concerts — both from home and from behind our beloved Desk. Together, these artists represent the past, present and future of Black music. This month of carefully curated shows is a celebration of Black artists expressing themselves in ways we've never seen before, and of the Tiny Desk's unique way of showcasing that talent.\n\nSuraya Mohamed | June 23, 2022\nAlmost 30 musicians, choir members and staff of the contemporary worship music collective Maverick City Music entered the NPR lobby and crowded the security desk to undergo COVID protocols. Even through the dull process of checking vaccination cards and test results, there was a real feeling of excitement for what was about to happen.\n\nSome of the choir members were eager not only for the upcoming Tiny Desk concert but for later that evening, when they were scheduled to perform at a sold-out 20,000-seat arena nearby. A few of them had only previously performed with Maverick City Music in small venues and couldn't wait to move from the Tiny Desk to a big stage. Once upstairs, the group's enthusiasm grew during the set up and sound check. Even the NPR production staff was buzzing because we had not recorded such a large ensemble in our office in more than two years.\n\nOnce the performance started, Maverick City Music did what it always does. The members of the group became one voice, sharing beautiful music and spreading the good word with messages of hope, change and love. The group describes itself as a megaphone for a community of creatives that has been pushed to the margins of the industry of church music. Even for those who aren't fans of gospel music or for those who don't believe, it is possible to still find appreciation in this music's comforting and uplifting sound.\n\nMost of the songs performed here are from the collective's new album, Kingdom Book One, which was produced in collaboration with gospel legend Kirk Franklin. It was a blessing to watch him perform here alongside talented vocalists Naomi Raine and Chandler Moore on the last song, \"Kingdom.\"\n\nSET LIST\n\"Man of Your Word\"\n\"Million Little Miracles\"\n\"Jireh\"\n\"Kingdom\" (feat. Kirk Franklin)\n\nMUSICIANS\nChandler Moore: vocals\nBrandon Lake: vocals\nNaomi Raine: vocals\nKirk Franklin: vocals, keys\nHarold Brown: MD/drums\nSam Simon: keys\nMatt Ramsey: bass\nElijah Kaiween: guitar\nJason McGee: vocals/choir director\nAshley Perry: vocals\nAudrey Oquaye: vocals\nAntonio Drakes: vocals\nCameron Williams: vocals\nJelani Caldwell: vocals\nMaraya Stewart: vocals\nPierina Santa Maria: vocals\nTabitha Harris: vocals\nVictoria Fitzgerald: vocals\n\nTINY DESK TEAM\nProducer: Bobby Carter\nAudio Recording & Mix Engineer: Josh Rogosin\nDirector: Kara Frame\nEditor: Josh Bryant\nSeries Creator: Bob Boilen\nVideographers: Kara Frame, Josh Bryant, Michael Zamora, Pierre Kattar, Alanté Serene\nProduction Assistant: Ashley Pointer\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Jill Britton, Joby Tanseco, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #BMM #maverickcitymusic", "link": "https://www.youtube.com/watch?v=QKFjQbCKEgA", "date_published": "2022-06-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]