[{"source": "https://www.theguardian.com/rss", "title": "Russia-Ukraine war: EU leaders to decide on Kyiv bid; Russia aims to turn Donbas cities into a Mariupol, Zelenskiy says – live news", "description": "<p>Russian news agency says <a href=\"https://www.theguardian.com/world/live/2022/jun/23/russia-ukraine-war-eu-leaders-to-decide-on-kyiv-bid-russia-aims-to-turn-donbas-cities-into-a-mariupol-zelenskiy-says-live-news?page=with:block-62b412308f0877fb10b60a61#block-62b412308f0877fb10b60a61\">British citizens and Moroccan sentenced to death  preparing appeal</a>; EU leaders to decide <a href=\"https://www.theguardian.com/world/live/2022/jun/23/russia-ukraine-war-eu-leaders-to-decide-on-kyiv-bid-russia-aims-to-turn-donbas-cities-into-a-mariupol-zelenskiy-says-live-news?page=with:block-62b3c9fb8f0877fb10b608ce#block-62b3c9fb8f0877fb10b608ce\">whether to grant Ukraine candidate status</a></p><ul><li><a href=\"https://www.theguardian.com/world/2022/jun/22/finns-are-ready-to-fight-any-russian-attack-says-its-armed-forces-chief\">Finland ready to fight Russian attack, says armed forces chief</a></li><li><a href=\"https://www.theguardian.com/world/2022/jun/22/british-man-facing-death-sentence-donetsk-told-time-running-out\">British man facing death sentence told: ‘Time is running out’</a></li><li><a href=\"https://www.theguardian.com/world/2022/jun/23/russia-ukraine-war-what-we-know-on-day-120-of-the-invasion\">At a glance: what we know on day 120 of the invasion</a></li></ul><p><strong>Russia’s Tass news agency is carrying a report that British citizens Sean Pinner and Aiden Aslin, alongside Moroccan Saadoun Brahim, are preparing an appeal against their death sentences.</strong></p><p>Tass quotes Pinner’s lawyer <strong>Yulia Tserkovnikova</strong> saying “my colleagues and I are preparing the full text of the appeal against the verdict in the interests of our clients.”</p> <a href=\"https://www.theguardian.com/world/live/2022/jun/23/russia-ukraine-war-eu-leaders-to-decide-on-kyiv-bid-russia-aims-to-turn-donbas-cities-into-a-mariupol-zelenskiy-says-live-news\">Continue reading...</a>", "link": "https://www.theguardian.com/world/live/2022/jun/23/russia-ukraine-war-eu-leaders-to-decide-on-kyiv-bid-russia-aims-to-turn-donbas-cities-into-a-mariupol-zelenskiy-says-live-news", "date_published": "2022-06-23 08:33:32+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Train strikes: second day of action brings disruption across Britain’s rail network – live", "description": "<p>Passengers advised to only travel if necessary as members of RMT at Network Rail and 13 train operators walk out</p><ul><li><a href=\"https://www.theguardian.com/uk-news/2022/jun/23/second-day-of-rail-strikes-start-after-talks-collapse-in-acrimony\">Second day of rail strikes start after talks collapse in acrimony</a></li><li><a href=\"https://www.theguardian.com/uk-news/2022/jun/22/labour-frontbenchers-who-joined-rail-strike-pickets-pressed-to-apologise-by-keir-starmer\">Labour frontbenchers who joined pickets pressed to apologise</a></li></ul><p>Guardian reporter Matthew Weaver has the full story on the pay deal for Merseyrail staff:</p><p><strong>Rail union leaders have hailed a 7.1% pay deal for Merseyrail staff</strong>, which was struck without government involvement, as <strong>evidence that it is ministers who are blocking a deal in the national dispute</strong>.<br /><br />The Transport Salaried Staffs’ Association (TSSA) announced that its members at Merseyrail have accepted the 7.1% pay offer. The RMT, which was also involved in the Merseyrail negotiations said it plans to put the offer to its members.<br /><br />The RMT’s general secretary Mick Lynch said the deal was an example of what can be achieved when ministers are not involved.<br /><br />Speaking to BBC Breakfast he said: “The importance of that is the DFT (Department for Transport) and the Treasury are not pulling the strings in that negotiation.”<br /><br />He added: “That’s also the situation in other companies such as Transport for Wales, which is outside the DFTs control and Scotrail where we’re going to get proposals on pay which are far superior to what [Transport Secretary] Grant Shapps will allow to happen.”<br /><br />“Where Grant Shapps has no influence on this railway we are getting deals and getting offers that are likely to be more progressive than the ones we’re getting from Westminster.”<br /><br />Lynch added: “We need a guarantee of no compulsory redundancies and when we get that we can move on positively to the other agenda items, which includes<br />changes to working practices, and the adoption of new technology.”<br /><br />“It is the government in the form of Grant Shapps and the Treasury that are stopping those ideas coming forward. If we were dealing with the companies of their own volition ... I think we would have had a deal on these issues quite a long time ago.”<br /><br />Speaking to BBC Radio 4’s Today Eddie Dempsey, Assistant General Secretary of the RMT, said: “Wherever we’re dealing with somebody who’s not directly controlled by the DFT, we’re making progress: London Underground 8.5%; Docklands Light Railway we’ve got an inflation busting deal; Crossrail, saame thing, Transport for Wales we’re in the business of negotiating something there now. Mercy rail 7.1%.”<br /><br />But Tim Shoveller, Network Rail’s chief negotiator, suggested it would be too expensive to offer a 7.1% pay increase to settle the national dispute.<br /><br />Speaking to the Today programme ahead of further talks today, Shoveller said: “We currently have an offer that totals 3% on the table and we’re keen to improve on that. But that’s subject to affordability.<br /><br />“The difference between the 3% on the table now and a 7.1% is £65m every year just for the groups that are on strike today.”<br /></p><p><em> I think every Labour MP should come out. Let’s have it right, the Labour party was born out of the trade union movement and they are our political voice in parliament so every Labour MP should be out.</em></p><p><em> We don’t want to mess up people’s travel arrangements but if you’re pushed into a corner you have got to do something.</em></p> <a href=\"https://www.theguardian.com/uk-news/live/2022/jun/23/train-strikes-railways-rail-disruption-britain-latest-updates\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/live/2022/jun/23/train-strikes-railways-rail-disruption-britain-latest-updates", "date_published": "2022-06-23 08:31:00+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "UK borrowed £14bn in May as inflation drove up interest debt costs – business live", "description": "<p>Rolling coverage of the latest economic and financial news</p><ul><li><a href=\"https://www.theguardian.com/business/live/2022/jun/23/uk-borrowing-inflation-debt-costs-oil-gas-recession-stock-markets-factories-services-business-live?filterKeyEvents=false&amp;page=with:block-62b3fc528f088eb951437814#block-62b3fc528f088eb951437814\">UK borrowed more than expected last month, but less than a year ago</a></li><li>Interest bill rose 70% to £7.6bn in May, third-highest on record</li><li><a href=\"https://www.theguardian.com/business/live/2022/jun/23/uk-borrowing-inflation-debt-costs-oil-gas-recession-stock-markets-factories-services-business-live?page=with:block-62b412e78f0877fb10b60a67#block-62b412e78f0877fb10b60a67\">‘Early blow’ to government ahead of today’s by-elections</a></li><li><a href=\"https://www.theguardian.com/business/live/2022/jun/23/uk-borrowing-inflation-debt-costs-oil-gas-recession-stock-markets-factories-services-business-live?filterKeyEvents=false&amp;page=with:block-62b40c788f0877fb10b60a41#block-62b40c788f0877fb10b60a41\">Rishi Sunak says inflation and rising rates are a ‘challenge’</a></li><li><a href=\"https://www.theguardian.com/uk-news/live/2022/jun/23/train-strikes-railways-rail-disruption-britain-latest-updates\">Train strikes: second day of action set to bring disruption across Britain’s rail network – live</a></li></ul><p><strong>Private sector growth in both Germany and France has slowed sharply this month, which will fuel concerns that Europe’s economy is faltering.</strong></p><p>In <strong>France</strong>, growth has slumped to its weakest since the peak Omicron disruption at start of 2022, the latest survey of purchasing managers shows.</p> <a href=\"https://www.theguardian.com/business/live/2022/jun/23/uk-borrowing-inflation-debt-costs-oil-gas-recession-stock-markets-factories-services-business-live\">Continue reading...</a>", "link": "https://www.theguardian.com/business/live/2022/jun/23/uk-borrowing-inflation-debt-costs-oil-gas-recession-stock-markets-factories-services-business-live", "date_published": "2022-06-23 08:27:48+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Post your questions for Dougray Scott", "description": "<p>Got something you’d like to ask the Mission: Impossible and Deep Impact actor? Send it our way and we’ll put it to him</p><p>There’s aren’t many actors who can put “hand picked by Tom Cruise” on their CV. Scottish actor Dougray Scott was personally cast by TC to play rogue Impossible Missions Force agent and chief bad guy in 2000’s Mission: Impossible II – famous for that Cruise/Scott motorbike fighting scene. It’s a role that propelled the Twin Town and Deep Impact actor to international fame, even if it did mean he lost the role of Wolverine for 2000’s X-Men (to Hugh Jackman) after filming on MI2 overran. Scott was also apparently in the running to take over Bond in 2006’s Casino Royale, but was pipped to the post by Daniel Craig.</p><p>But let’s not worry about all that. This is a safe, happy space where we can quiz the Scot on working with John Malkovich in 2002’s Ripley’s Game; Emilia Fox and Billie Piper in 2005 British caper Things to Do Before You’re 30; and Liam Neeson in 2014’s Taken 3. On the small screen, he has appeared in everything from Taggart and Batwoman to Desperate Housewives and the 2009 BBC adaptation of The Day of the Triffids, and played everyone from Moses to Dr Jekyll/Mr Hyde.</p> <a href=\"https://www.theguardian.com/film/2022/jun/23/post-your-questions-for-dougray-scott\">Continue reading...</a>", "link": "https://www.theguardian.com/film/2022/jun/23/post-your-questions-for-dougray-scott", "date_published": "2022-06-23 08:17:28+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Afghanistan earthquake: Taliban appeal for more aid as death toll set to mount", "description": "<p>The hardline Islamist leadership says help needs to be ‘scaled up’ after the quake devastated towns and villages in the country’s mountainous east</p><p>Afghanistan’s Taliban-led government has appealed for more international aid as it struggles to cope with the devastating earthquake in a mountainous eastern region <a href=\"https://www.theguardian.com/world/2022/jun/22/afghanistan-earthquake-at-least-130-dead-after-magnitude-quake-strikes\">that has left more than 1,000 people dead</a> and many more injured.</p><p>With the war-ravaged country already stricken by an economic crisis, the hardline Islamist leadership said sanctions imposed by western countries after the withdrawal of US-led coalition forces last year meant it was handicapped in its ability to deal with Wednesday’s disaster in Khost and Paktika provinces.</p> <a href=\"https://www.theguardian.com/world/2022/jun/23/afghanistan-earthquake-taliban-appeal-for-more-aid-as-death-toll-mounts\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/jun/23/afghanistan-earthquake-taliban-appeal-for-more-aid-as-death-toll-mounts", "date_published": "2022-06-23 08:16:43+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘I wish she could have seen the change happening right now’: trailblazing theatre star Pearl Prescod", "description": "<p>The actor and campaigner came to Britain from Trinidad and Tobago in 1954 and rose to join Laurence Olivier’s National Theatre company. Clint Dyer and others explain why we should remember her</p><p>Pearl Prescod’s star soared high in her day. Born in Trinidad and Tobago, she became the first Black actor to play with the National Theatre company, under Laurence Olivier, in London in 1965. She appeared in the West End and on television, recorded radio plays, worked on the cabaret circuit and was also a prominent activist alongside Claudia Jones and Amy Ashwood Garvey. So why isn’t Prescod better known today?</p><p>Partly because her career was cut short by an untimely death – she had a brain haemorrhage at the age of 46, just a year after her breakthrough National Theatre role. But those excavating her forgotten legacy today think there is more to it than that. Coming to Britain in 1954, aged 34, on a music scholarship to the Guildhall School of Music and Drama, she was part of a larger group of well-educated, highly politicised Caribbean figures who arrived in the postwar era to make similarly impressive strides in culture and in consciousness-raising around race but whose names have since been forgotten.</p> <a href=\"https://www.theguardian.com/stage/2022/jun/23/theatre-star-pearl-prescod\">Continue reading...</a>", "link": "https://www.theguardian.com/stage/2022/jun/23/theatre-star-pearl-prescod", "date_published": "2022-06-23 08:14:09+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "A hostile environment baton passed from Theresa May to Priti Patel – and a decade of cruelty | Kamila Shamsie", "description": "<p>From ‘Go home’ vans to Rwanda deportation flights, there has been a lot to learn, but we can’t and won’t succumb to despair</p><p>In 2001, the <a href=\"https://www.theguardian.com/books/2021/oct/11/abdulrazak-gurnah-winning-nobel-prize-literature-zanzibar-priti-patel-racism\">Nobel laureate Abdulrazak Gurnah</a> published By the Sea, the story of Saleh Omar, a man who arrives at Gatwick airport as a refugee. The border official he speaks to says his parents also came to Britain as refugees, “But my parents are European, they have a right, they’re part of the family.” He goes on to say, “You don’t belong here … and we don’t want you here. We’ll make life hard on you, make you suffer indignities, perhaps even commit violence on you.”</p><p>Omar is far from unaffected, but he carries within him an important piece of knowledge: he knows that by the British government’s own rules he is entitled to asylum, and though the official might spew racist language he will have no option in the end but to stamp Omar’s passport and allow him through. As indeed he does.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/jun/23/hostile-environment-theresa-may-priti-patel-rwanda-deportation\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/jun/23/hostile-environment-theresa-may-priti-patel-rwanda-deportation", "date_published": "2022-06-23 08:00:42+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Republican senator faces backlash for work on gun bill after school shooting", "description": "<p>John Cornyn of Texas, lead negotiator on modest bipartisan reform proposal in Senate, was booed and heckled at party convention</p><p>In the aftermath of the Uvalde mass school shooting, the Texas senator John Cornyn is facing backlash from his own Republican party for being a lead negotiator on the bipartisan gun reform bill, the most significant legislation on gun control in America in decades.</p><p>At the state’s annual Republican convention recently held in Houston, Cornyn was <a href=\"https://www.dallasnews.com/news/politics/2022/06/17/texas-gop-convention-delegates-boo-cornyn-over-bipartisan-gun-law-talks-in-washington/\">booed</a> and heckled – a visible sign he is losing support from those within his own party. He dismissed the taunting crowd as a “mob”.</p> <a href=\"https://www.theguardian.com/us-news/2022/jun/23/republican-senator-john-cornyn-backlash-gun-control-school-shooting\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/jun/23/republican-senator-john-cornyn-backlash-gun-control-school-shooting", "date_published": "2022-06-23 08:00:42+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Tanzania charges 20 Maasai with murder after police officer dies during protests", "description": "<p>Lawyers say government is attempting to intimidate pastoralists as thousands flee to Kenya amid escalating row over evictions</p><p>Twenty Maasai pastoralists from northern Tanzania have been charged with the murder of a police officer <a href=\"https://www.theguardian.com/global-development/2022/jun/14/maasai-leaders-arrested-in-protests-over-tanzanian-game-reserve\">during protests</a> over government plans to use their ancestral land for conservation and a luxury hunting reserve.</p><p>The officer was allegedly shot by an arrow on 10 June while attempting to demarcate land in Loliondo, which borders Serengeti national park.</p> <a href=\"https://www.theguardian.com/global-development/2022/jun/23/tanzania-charges-20-maasai-with-after-police-officer-dies-during-protests\">Continue reading...</a>", "link": "https://www.theguardian.com/global-development/2022/jun/23/tanzania-charges-20-maasai-with-after-police-officer-dies-during-protests", "date_published": "2022-06-23 08:00:42+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The Playbook by Jennifer Jacquet review – how big business takes on science and wins", "description": "<p>A ‘guide’ for companies looking to counter unwelcome research exposes the corporate world’s dark arts</p><p>“Playbook” is a term that feels overused at the moment – mostly because of Vladimir Putin’s <a href=\"https://www.theguardian.com/world/series/russia-ukraine-war-at-a-glance\" title=\"\">military adventures</a>. We now know all too well that his playbook, deployed in Chechnya, then Syria, and now Ukraine, involves heavy bombardment of civilian areas with the aim of demoralising and grinding down a population towards eventual defeat. The end goal is the demonstration of Putin’s ruthlessness – one of his key tools for retaining power. Jennifer Jacquet’s The Playbook is about something else entirely – the methods corporations use to “deny science, sell lies, and make a killing”. The specifics couldn’t be more different. And yet, in some fundamental and peculiar ways, the strategies are similar.</p><p>Jacquet chooses a slightly unusual means of getting her ideas across, writing in the style of a helpful guide for corporations faced with scientific evidence that could “pose a risk to business operations”. Readers might assume the odd business may have used some of these dubious methods to push back against unwelcome research every so often, but they probably wouldn’t think it was a systemic issue. It doesn’t take long, however, to realise that Jacquet has a point – that the use of these tactics really does amount to a playbook to which almost every sector has had recourse at some point. The sheer weight of evidence that she piles up, chapter by chapter, is unarguable.</p> <a href=\"https://www.theguardian.com/books/2022/jun/23/the-playbook-by-jennifer-jacquet-review-how-big-business-takes-on-science-and-wins\">Continue reading...</a>", "link": "https://www.theguardian.com/books/2022/jun/23/the-playbook-by-jennifer-jacquet-review-how-big-business-takes-on-science-and-wins", "date_published": "2022-06-23 08:00:42+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Martin Lewis says House of Lords rejected his peerage application", "description": "<p>Consumer champion believes he was turned down because he was honest about limited time he could commit</p><p>The consumer champion Martin Lewis has revealed an application he made to become a member of the House of Lords has been turned down.</p><p>Lewis, who is regarded as the <a href=\"https://www.theguardian.com/money/2019/jan/31/money-saving-expert-how-martin-lewis-became-most-trusted-man-in-britain-consumer-finance-advice\">one of most trusted people in Britain</a>, said he believed his request for a cross-bench peerage was rejected because he was honest about the limited time he could commit to the role.</p> <a href=\"https://www.theguardian.com/politics/2022/jun/23/martin-lewis-says-house-lords-rejected-peerage-application\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/jun/23/martin-lewis-says-house-lords-rejected-peerage-application", "date_published": "2022-06-23 07:37:46+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "'What is stopping us becoming Ukraine 2.0?': The Estonian women preparing for war", "description": "<p>In the months since the invasion of Ukraine, Estonians, who share a border with Russia, are increasingly concerned about potential Kremlin aggression. Despite the threat being low, more than 1,000 ordinary women have volunteered to join the Women's Defence Organisation since the conflict began. Car mechanic Mari Klandorf is one. She now spends her weekends training in first aid, guerrilla warfare and firearms and says: 'Russia might not be coming tomorrow, or the next day, but I want to be prepared.' The Guardian's Kyri Evangelou reports.</p> <a href=\"https://www.theguardian.com/world/video/2022/jun/23/what-is-stopping-us-becoming-ukraine-20-the-estonian-women-preparing-for-war\">Continue reading...</a>", "link": "https://www.theguardian.com/world/video/2022/jun/23/what-is-stopping-us-becoming-ukraine-20-the-estonian-women-preparing-for-war", "date_published": "2022-06-23 07:23:29+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Putin is not yet ready to end the Ukraine war. When he is, we must be prepared | Jonathan Powell", "description": "<p>It’s vital to avoid a false choice between peace and justice: that only helps the Kremlin. We need terms both sides might accept</p><p>We are setting up an entirely false choice over Ukraine that, if pursued, could unnecessarily undermine European unity. Last week a <a href=\"https://ecfr.eu/publication/peace-versus-justice-the-coming-european-split-over-the-war-in-ukraine/\">poll</a> for the European Council on Foreign Relations showed two camps in European public opinion emerging: a larger peace camp (35%) that wants to cut and run now, and a smaller justice camp (25%) that wants to push ahead until victory. In fact, if you look at the detail, there are three groups, with the biggest single group (43%) choosing both peace and justice.</p><p>This divide between peace and justice is reflected in public polemic, too. At one extreme there is Henry Kissinger, <a href=\"https://www.theweek.co.uk/news/world-news/europe/956946/is-henry-kissinger-right-about-ukraine\">arguing at Davos</a> that Ukraine should concede territory now to secure a ceasefire and warning us to avoid humiliating Vladimir Putin. Not surprisingly, this provoked a sharp reaction from those who correctly point out that Putin shows no sign of being ready to negotiate seriously or respond to concessions. More likely, a pre-emptive cringe would not only fail to secure a lasting peace, but would also leave Putin in a position to return and grab more of Ukraine once he regroups his forces.</p><p>Jonathan Powell was Tony Blair’s chief negotiator on Northern Ireland while chief of staff to the prime minister, 1997-2007, and is the chief executive and founder of Inter Mediate, a charity devoted to helping end armed conflicts</p> <a href=\"https://www.theguardian.com/commentisfree/2022/jun/23/putin-not-ready-end-ukraine-war-prepared\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/jun/23/putin-not-ready-end-ukraine-war-prepared", "date_published": "2022-06-23 07:00:41+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Country-soul star Yola: ‘I have a mission. I’m extremely bloody-minded about it’", "description": "<p>The Grammy-nominated UK singer on her journey from guesting on dance bangers to starring in Baz Lurhmann’s Elvis, and her long battle for recognition in the white, male-dominated Americana scene</p><p>When the rumours started that Baz Luhrmann was snooping around Nashville for someone to play Sister Rosetta Tharpe in his Elvis biopic, Yolanda Quartey knew she had to step up. The country-soul singer, known as <a href=\"https://www.theguardian.com/music/2019/feb/21/yola-from-down-and-out-in-london-to-nashvilles-country-soul-star\" title=\"\">Yola</a>, is British but is based in the heartland of US roots music. She’d grown up listening to Tharpe back in Bristol and strongly related to her story.</p><p>Until recently, Tharpe’s contribution to laying the foundations for rock’n’roll in the 1930s and 40s – with her gutsy gospel singing and claw-hammer-plucked electric guitar, a huge influence on the Memphis Flash himself – had gone largely unsung in popular culture. Quartey has experienced that erasure first hand, too. Back when the 38-year-old was trying to make it in the UK, she says: “I was told by a record company exec that nobody wanted to hear a Black woman sing rock’n’roll.” She says the film is “for all the kids that have been told, because they’re of colour, that they can’t touch a guitar”, another insult that’s been levelled personally at her.</p> <a href=\"https://www.theguardian.com/film/2022/jun/23/yola-yolanda-quartey-music-interview-elvis-baz-luhrmann\">Continue reading...</a>", "link": "https://www.theguardian.com/film/2022/jun/23/yola-yolanda-quartey-music-interview-elvis-baz-luhrmann", "date_published": "2022-06-23 07:00:40+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Dramatic rescue at world championships after swimmer faints and sinks to bottom of pool", "description": "<ul><li>Artistic swimmer Anita Alvarez pulled out unconscious by coach</li><li>American ‘doing very well’ and hopes to compete on Friday</li></ul><p>Anita Alvarez was at the centre of a dramatic episode at the world swimming championships in Budapest on Wednesday when the artistic swimmer had to be rescued from the bottom of the pool by her coach after losing consciousness in the water.</p><p>American Alvarez had completed her solo free final at the World Aquatics Championships when she fainted and sank to the bottom of the pool. Andrea Fuentes, her coach, quickly realised something was amiss and dived in fully clothed to pull Alvarez up to the surface.</p> <a href=\"https://www.theguardian.com/sport/2022/jun/23/dramatic-rescue-at-world-championships-after-swimmer-faints-and-sinks-to-bottom-of-pool\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2022/jun/23/dramatic-rescue-at-world-championships-after-swimmer-faints-and-sinks-to-bottom-of-pool", "date_published": "2022-06-23 06:43:11+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Diego Maradona: eight to go on trial in Argentina for homicide", "description": "<p>Defendants named in judge’s report include football star’s three doctors, a psychiatrist and two nurses</p><p> Eight people who took care of the Argentinian football superstar Diego Maradona will be tried for homicide, according to a ruling released on Wednesday following an investigation into his death from cardiac arrest.</p><p>In the 236-page document seen by Reuters, the judge in charge of the case questioned “the behaviours – active or by omission – of each of the accused which led to and contributed to the realisation of the harmful result”.</p> <a href=\"https://www.theguardian.com/football/2022/jun/23/diego-maradona-argentina-eight-trial-football-homicide\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2022/jun/23/diego-maradona-argentina-eight-trial-football-homicide", "date_published": "2022-06-23 06:36:38+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The House of Fortune by Jessie Burton review – a sequel to The Miniaturist", "description": "<p>This thoughtful follow-up is a clever echo of Burton’s debut, tracing a woman’s coming of age in early 18th-century Amsterdam</p><p>When we rejoin Nella Oortman, the heroine of Jessie Burton’s blockbuster 2014 debut <a href=\"https://www.theguardian.com/books/2014/jul/10/miniaturist-jessie-burton-review-history-modern-day-heroine\">The Miniaturist</a>, we find her almost as we left her. She still lives in her dead husband Johannes Brandt’s home on the Herengracht canal in Amsterdam, along with Cornelia the cook, Johannes’s once-enslaved manservant Otto, and Thea, the child Otto fathered with Johannes’s steely sister, Marin. So far so familiar, but 18 years have passed: Nella is now 37 and baby Thea a young woman. The three unrelated adults have bonded into a family after the deaths of Marin and Johannes, but their fortunes are dwindling and the once lavish house has been stripped bare.</p><p>The family is a curiosity – “the black man who lives on the Herengracht, his mixed daughter, and the widow of the man drowned by the city for his supposed sins” – and Thea’s status as a Black heiress is troubling to the upper-class Amsterdammers she mingles with, who must weigh her “whiff of scandal” against her stratospherically expensive and fashionable home. Nella is keen to solve the family’s money problems by arranging her a lucrative marriage, but Thea resists. Just as her aunt once did, Thea believes in true love. Unlike Nella, she believes she’s found it, in the arms of a handsome theatre set decorator.</p> <a href=\"https://www.theguardian.com/books/2022/jun/23/the-house-of-fortune-by-jessie-burton-review-a-sequel-to-the-miniaturist\">Continue reading...</a>", "link": "https://www.theguardian.com/books/2022/jun/23/the-house-of-fortune-by-jessie-burton-review-a-sequel-to-the-miniaturist", "date_published": "2022-06-23 06:30:40+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Earth Photo 2022: in pictures", "description": "<p>Earth Photo, the international photography competition, has announced its 2022 shortlist. Created by Forestry England and the Royal Geographical Society (with IBG), Earth Photo celebrates photographs and videos that tell stories about the planet, its inhabitants and its future. The exhibition is open at the Royal Geographical Society in London from now until 26 August 2022</p> <a href=\"https://www.theguardian.com/environment/gallery/2022/jun/23/earth-photo-2022-in-pictures\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/gallery/2022/jun/23/earth-photo-2022-in-pictures", "date_published": "2022-06-23 06:00:41+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "NHS sent my wife a penalty notice for getting a prescription", "description": "<p>Unknown to her, her prepay certificate had been returned as ‘incorrect address’ and been cancelled</p><p><strong>My wife has a direct debit for an NHS prescription prepay certificate, which auto-renews every year. Recently, she received a penalty charge notice (PCN) for a prescription she collected three months ago. It appears that last year her new certificate was returned as undelivered to the issuer, NHS Business Services Authority (NHSBSA), because of an “incorrect address”, even though we haven’t moved. NHSBSA therefore cancelled the direct debit and the auto-renewal. We were unaware of this, and my wife continued to tick the prepaid box when she collected her prescriptions. NHSBSA claims it did not notify us because it assumed we’d moved. It has since issued the certificate, but says it can’t backdate it and insists my wife pay the PCN. We’re happy to make up the payments missed after the direct debit was cancelled, but I am concerned it may issue a PCN for all of the prescriptions she received during that period. She is on weekly prescriptions for eight medications.<br /></strong><em><strong>EA, Hastings</strong></em></p><p>NHSBSA tells me it was unable to comment on your wife’s case due to confidentiality, but says that if a pre-payment certificate is returned as undeliverable, it cancels payments so patients are not left out of pocket for a service they can’t use. It confirmed that patients are alerted if they have provided an alternative contact. You say your wife was called soon after I intervened and told that, since a phone number was included in her records, she should have been informed as soon as the certificate was returned.</p> <a href=\"https://www.theguardian.com/money/2022/jun/23/nhs-sent-my-wife-a-penalty-notice-for-getting-a-prescription\">Continue reading...</a>", "link": "https://www.theguardian.com/money/2022/jun/23/nhs-sent-my-wife-a-penalty-notice-for-getting-a-prescription", "date_published": "2022-06-23 06:00:41+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "NHS hospital failed to disclose babies’ deadly bacteria infections", "description": "<p>Exclusive: St Thomas’ hospital in London did not reveal that four premature babies – one of whom died – were infected</p><p>A leading NHS hospital failed to publicly disclose that four very ill premature babies in its care were infected with a deadly bacterium, one of whom died soon after, the Guardian can reveal.</p><p>St Thomas’ hospital did not admit publicly that it had <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC165275/#:~:text=Bacillus%20cereus%20is%20an%20uncommon,of%20bacteremia%20caused%20by%20B\">suffered an outbreak of </a><em><a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC165275/#:~:text=Bacillus%20cereus%20is%20an%20uncommon,of%20bacteremia%20caused%20by%20B\">Bacillus cereus</a></em> in the neonatal intensive care unit (NICU) of its Evelina children’s hospital in late 2013 and early 2014.</p><p>Did not acknowledge either the incident or infant’s death in any public forum.</p><p>Failed to mention the death in the report of its own internal inquiry into the outbreak.</p><p>Did not tell its own board that one of the four infected children who were given contaminated total parenteral nutrition (TPN) died, despite the board’s legal duty to oversee the trust.</p><p>Did not alert the media to the outbreak and instead prepared a statement in case it received any inquiries – none of which arrived, because GSTT never publicly acknowledged the incident.</p> <a href=\"https://www.theguardian.com/society/2022/jun/23/nhs-hospital-failed-to-disclose-babies-deadly-bacteria-infections\">Continue reading...</a>", "link": "https://www.theguardian.com/society/2022/jun/23/nhs-hospital-failed-to-disclose-babies-deadly-bacteria-infections", "date_published": "2022-06-23 06:00:40+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Rambo: First Blood review – Stallone’s 80s hero ripe for devotees of old-school action", "description": "<p>Fans of movie explosions get another chance to spend time with the character that inspired Ronald Reagan</p><p>Forty years on, here’s a rerelease of the first movie in the Rambo series from 1982: the watchable if entirely preposterous exploitation-action picture in which star and co-writer Sylvester Stallone makes his first appearance as John Rambo, the decorated Green Beret, Vietnam veteran and commando übermensch in a permanent rage at the way he and his fellow soldiers were let down. It climaxes with an entirely bizarre speech from Rambo on the subject of his PTSD, delivered in Stallone’s unintelligible slurred drone: “Igghh sawfff bodyghhh partghhs everyghrhwhere…!”</p><p>This was actually the film that came before the one that made Rambo a real movie icon, Rambo: First Blood Part II (1985), where he has to go back to Vietnam for a fantasy replay of the war on the grounds that he is searching for urban-mythic “MIA POWs”. That was the movie that Ronald Reagan watched in the middle of the <a href=\"https://en.wikipedia.org/wiki/TWA_Flight_847\">1985 Beirut hostage crisis</a> and famously said: “Boy, after seeing Rambo last night, I know what to do next time this happens.”</p> <a href=\"https://www.theguardian.com/film/2022/jun/23/rambo-first-blood-review-rerelease-sylvester-stallone\">Continue reading...</a>", "link": "https://www.theguardian.com/film/2022/jun/23/rambo-first-blood-review-rerelease-sylvester-stallone", "date_published": "2022-06-23 06:00:40+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Rupert Murdoch uses London visit to try to boost ratings at talkTV", "description": "<p>Effort to revive fortunes of Piers Morgan-fronted rightwing channel include appointing new boss and expected relaunch</p><p>Rupert Murdoch’s talkTV has been struggling to attract an audience for its culture-war output. But staff at the channel are now worried that they have recently gained one particular viewer: Murdoch himself, who has arrived in London and is taking an active interest in his station’s fate.</p><p>The media mogul has invested tens of millions of pounds in talkTV, but after just two months on air, there are fears it could become a costly disaster unless he makes a rapid intervention, with official viewing figures dipping to zero at some points during evening broadcasts.</p> <a href=\"https://www.theguardian.com/media/2022/jun/23/rupert-murdoch-uses-london-visit-to-try-to-boost-ratings-at-talktv\">Continue reading...</a>", "link": "https://www.theguardian.com/media/2022/jun/23/rupert-murdoch-uses-london-visit-to-try-to-boost-ratings-at-talktv", "date_published": "2022-06-23 06:00:40+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Behind the mask: Hans Georg Berger’s voyage of discovery – in pictures", "description": "<p>From documenting intimate relationships to exploring Buddhism, the German photographer has always been driven by a desire to learn </p><p></p><p><br /></p> <a href=\"https://www.theguardian.com/artanddesign/gallery/2022/jun/23/behind-the-mask-hans-georg-bergers-voyage-of-discovery-in-pictures\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/gallery/2022/jun/23/behind-the-mask-hans-georg-bergers-voyage-of-discovery-in-pictures", "date_published": "2022-06-23 06:00:39+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Bitcoin could stay below $69,000 peak for two years, says Binance boss", "description": "<p>Changpeng Zhao says people would have been happy with current $20,000 value four years ago</p><p>Bitcoin could stay below its historical high of $69,000 for the next two years after the <a href=\"https://www.theguardian.com/technology/2022/jun/18/bitcoin-value-falls-cryptocurrency-markets-turmoil\">latest digital asset market rout</a>, according to the chief executive of the world’s largest cryptocurrency exchange.</p><p>Changpeng Zhao, founder and chief executive of Binance, said people would have been “very happy” four years ago had they been told that bitcoin would be trading at $20,000 in 2022. The cornerstone crypto asset fell below that level at the weekend in a symbolic move that represented a wipeout of gains for many long-term bitcoin holders.</p> <a href=\"https://www.theguardian.com/technology/2022/jun/23/bitcoin-below-69000-dollar-peak-two-years-binance-boss\">Continue reading...</a>", "link": "https://www.theguardian.com/technology/2022/jun/23/bitcoin-below-69000-dollar-peak-two-years-binance-boss", "date_published": "2022-06-23 06:00:39+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Boris Johnson faces double verdict as polls open in byelections", "description": "<p>Labour clear favourite to win in Wakefield while Tories and Lib Dems in close race in Tiverton and Honiton</p><p>Boris Johnson faces a hugely important verdict from voters on Thursday as the Conservatives defend seats in Wakefield and in Tiverton and Honiton, with a double defeat likely to reignite speculation about a new challenge from Tory MPs.</p><p>The byelections were called after the respective MPs resigned in disgrace. Imran Ahmad Khan <a href=\"https://www.theguardian.com/politics/2022/apr/28/imran-ahmad-khan-mp-completes-resignation-process\">stepped down</a> in Wakefield having been convicted of sexually assaulting a teenage boy, while <a href=\"https://www.theguardian.com/politics/2022/apr/30/tory-neil-parish-resigns-mp-commons-porn-allegations\">Neil Parish quit</a> in Tiverton and Honiton after watching pornography in the Commons.</p> <a href=\"https://www.theguardian.com/politics/2022/jun/23/boris-johnson-double-verdict-wakefield-tiverton-and-honiton-byelections\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/jun/23/boris-johnson-double-verdict-wakefield-tiverton-and-honiton-byelections", "date_published": "2022-06-23 06:00:39+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "My generation is obsessed with wellness – that can be dangerous | Ione Gamble", "description": "<p>People have become transfixed with the idea that being well is the most impressive thing you can do – and as someone who is permanently unwell I will always be considered lesser</p><p>I have spent a huge part of my 20s learning to accept that I will never be healthy, after being diagnosed with an incurable illness – Crohn’s disease – two weeks after my 19th birthday. And although being “healthy” has never been a priority for me (I’ve never stepped foot in a gym and find it impossible to eat <a href=\"https://viewer.gutools.co.uk/society/2017/feb/23/five-day-10-portions-fruit-veg-cut-early-death#:~:text=5%20years%20old-,Forget%20five%20a%20day%2C%20eat%2010%20portions%20of%20fruit%20and,cut%20risk%20of%20early%20death&amp;text=Five%20portions%20of%20fruit%20and,worldwide%20every%20year%2C%20say%20scientists.\">10 portions of fruit and veg a day</a>) my ambivalence towards “wellness” grew as I dealt with being permanently unwell. It has also made me an anomaly among my peers.</p><p>From my bed, unable to move, I watched my generation become obsessed with being their best selves. We have become utterly transfixed with the idea that wellness is the key to a successful life; that our relationships, careers, friendships and mental health will all suffer unless we pursue being “well” above all else.</p> <a href=\"https://www.theguardian.com/commentisfree/2022/jun/23/my-generation-is-obsessed-with-the-cult-of-wellness-but-all-that-striving-to-be-your-best-self-can-be-dangerous\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/jun/23/my-generation-is-obsessed-with-the-cult-of-wellness-but-all-that-striving-to-be-your-best-self-can-be-dangerous", "date_published": "2022-06-23 05:58:36+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "10 of Europe’s best destinations for LGBTQ+ travellers this Pride season", "description": "<p>From Madrid to Mykonos our writer picks the most queer-friendly holiday spots in Europe</p><p>It’s 2003 and my boyfriend and I are hovering nervously at a hotel reception in Woodbridge, Suffolk. We can sense the frosty contempt of the fiftysomething male at the desk when we ask for a double, not a twin room. After we check in, we’re both tetchy: I’m annoyed at how we’ve been treated, while my partner believes we should just “accept” it, that “it’s just the way it is.”</p><p>Back then, there was little you could do about such blatant prejudice – at least on a day-to-day basis. Some respite could be found trawling through the listings in Gay Times for gay-owned hotels and B&amp;Bs. But, sadly, travel has long remained an issue for LGBTQ+ people, whether in the UK or abroad, where customs, legality and local cultural norms still need to be considered.</p> <a href=\"https://www.theguardian.com/travel/2022/jun/23/europe-best-holidays-for-lgbtq-travel\">Continue reading...</a>", "link": "https://www.theguardian.com/travel/2022/jun/23/europe-best-holidays-for-lgbtq-travel", "date_published": "2022-06-23 05:57:21+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Sex for a job: the scandal of Haiti’s exploited US garment workers", "description": "<p>Women paid a pittance for making clothes for top US brands are often forced to have sex by bosses to keep their jobs, say unions</p><p>Marie says she was less than a month into her job at a garment factory in the Haitian capital, Port-au-Prince, making clothes for a range of well-known US brands, when the factory’s head of security gave her an ultimatum: have sex with him or be fired.</p><p>The 24-year-old says she had little choice. She relies on her job to support her four-year-old son after both her father and husband died.</p> <a href=\"https://www.theguardian.com/global-development/2022/jun/23/sex-for-a-job-the-scandal-of-haiti-exploited-us-garment-workers\">Continue reading...</a>", "link": "https://www.theguardian.com/global-development/2022/jun/23/sex-for-a-job-the-scandal-of-haiti-exploited-us-garment-workers", "date_published": "2022-06-23 05:57:04+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Aung San Suu Kyi trial ‘moved to prison in Myanmar’s capital’", "description": "<p>Ousted leader, who has been held in secret location for past year, is facing a raft of charges that have been decried as politically motivated</p><p>Aung San Suu Kyi is expected to appear in a prison court room for all future trial hearings, amid reports that she will be transferred from an unknown detention location to a jail in the capital.</p><p>Myanmar’s ousted leader, who is 77, has been held by the military since 1 February last year, <a href=\"https://www.theguardian.com/world/2021/feb/01/aung-san-suu-kyi-and-other-figures-detained-in-myanmar-raids-says-ruling-party\">when it ousted her democratically elected government</a>, plunging the country into chaos.</p> <a href=\"https://www.theguardian.com/world/2022/jun/23/aung-san-suu-kyi-trial-moved-to-prison-in-myanmars-capital\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/jun/23/aung-san-suu-kyi-trial-moved-to-prison-in-myanmars-capital", "date_published": "2022-06-23 05:50:10+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Japan’s famed 100-yen shops fall victim to cost-of-living squeeze", "description": "<p>Prices at discount stores double or more as cost pressures become critical issue ahead of upper house elections next month</p><p>There can’t be a household in Japan that doesn’t own a few items from a 100-yen shop – anything from chopsticks and teacups to air freshener and bin bags.</p><p>But the wildly popular discount stores – whose roots lie in the country’s long battle with deflation – are having to compromise on their USP, as soaring raw material costs, the war in Ukraine and a weak yen force companies to raise prices.</p> <a href=\"https://www.theguardian.com/world/2022/jun/23/japans-famed-100-yen-shops-fall-victim-to-cost-of-living-squeeze\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/jun/23/japans-famed-100-yen-shops-fall-victim-to-cost-of-living-squeeze", "date_published": "2022-06-23 05:37:09+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Racism in aid sector is a hangover of colonialism, says scathing report by MPs", "description": "<p>Senior roles still dominated by white people while appeals depict countries as inferior to UK, says international development committee</p><p>British MPs have issued a scathing report on racism in the aid sector, warning that colonial mentalities are pervasive across charities and in government.</p><p>In their public appeals, international aid organisations depict the communities they serve as “helpless and needy” and “strip them of their dignity”, implying the countries in which they work are “inferior to the UK”, said the international development committee.</p> <a href=\"https://www.theguardian.com/global-development/2022/jun/23/racism-in-aid-sector-is-a-hangover-of-colonialism-says-scathing-report-by-mps\">Continue reading...</a>", "link": "https://www.theguardian.com/global-development/2022/jun/23/racism-in-aid-sector-is-a-hangover-of-colonialism-says-scathing-report-by-mps", "date_published": "2022-06-23 05:30:38+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "New Zealand records largest ever bleaching of sea sponges", "description": "<p>Researchers say tens of millions of sponges may have been affected by protracted marine heatwave</p><p>New Zealand is experiencing the largest bleaching of sea sponges ever recorded, scientists say, after extreme ocean temperatures turned millions of the aquatic creatures white.</p><p>The discovery comes after researchers <a href=\"https://www.theguardian.com/world/2022/may/16/bleached-sea-sponges-found-in-new-zealand-waters-for-first-time\">raised the alarm in May</a>, when sea sponges off New Zealand’s southern coastline were found bleached for the first time.</p> <a href=\"https://www.theguardian.com/world/2022/jun/23/new-zealand-records-largest-ever-bleaching-of-sea-sponges\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/jun/23/new-zealand-records-largest-ever-bleaching-of-sea-sponges", "date_published": "2022-06-23 05:24:49+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Ghislaine Maxwell: US prosecutors urge 30-year minimum prison sentence", "description": "<p>Prosecutors make recommendation in court filing a week before Maxwell’s sentencing for sex-trafficking conviction</p><p><a href=\"https://viewer.gutools.co.uk/us-news/ghislaine-maxwell\">Ghislaine Maxwell</a> should get at least 30 years’ imprisonment for sex trafficking when she is sentenced next week for her role in facilitating the abuse of teenage girls by Jeffrey Epstein, New York federal prosecutors have said in court filings.</p><p>“Ghislaine Maxwell sexually exploited young girls for years. It is difficult to overstate the magnitude of her crimes and the harm she caused. Her crimes demand justice,” they said in a court filing on Wednesday. “The government urges the court to impose a sentence within the applicable guidelines range of 360 to 660 months’ imprisonment.”</p> <a href=\"https://www.theguardian.com/us-news/2022/jun/23/ghislaine-maxwell-prison-sentence-us-prosecutors\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/jun/23/ghislaine-maxwell-prison-sentence-us-prosecutors", "date_published": "2022-06-23 05:23:24+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "TV tonight: an epic clash of the Taskmaster titans", "description": "<p>The season winners of series six to 10 tackle more nonsensical challenges. Plus: Motherland’s Anna Maxwell Martin delves into her family history. Here’s what to watch this evening</p> <a href=\"https://www.theguardian.com/tv-and-radio/2022/jun/23/tv-tonight-an-epic-clash-of-the-taskmaster-titans\">Continue reading...</a>", "link": "https://www.theguardian.com/tv-and-radio/2022/jun/23/tv-tonight-an-epic-clash-of-the-taskmaster-titans", "date_published": "2022-06-23 05:20:38+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘People may be overselling the myth’: should we bring back the wolf?", "description": "<p>Researchers say the return of wolves to Yellowstone in the 1990s kickstarted big changes in habitats. But that narrative is increasingly being challenged</p><ul><li><a href=\"https://www.theguardian.com/environment/series/wild-world\">Read more in our Wild world series</a></li></ul><p>In 1995, in Yellowstone national park, eight wolves were released from a white truck that had travelled 700 miles from Alberta, Canada. They were the first to live in the park for 70 years and the most fabled predator’s return to the world’s most famous national park inspired research that would feature in ecology textbooks for decades.</p><p>A key narrative from this event is that wolves created a “landscape of fear” in the park, which kickstarted big changes in habitats, known as trophic cascades. It is an argument used to justify releasing wolves elsewhere. But increasingly, researchers are looking at the nuances of what happened in the decades after wolves were introduced and challenging this approach. </p> <a href=\"https://www.theguardian.com/environment/2022/jun/23/rebalancing-act-bringing-back-wolf-fix-broken-ecosystem-aoe\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/jun/23/rebalancing-act-bringing-back-wolf-fix-broken-ecosystem-aoe", "date_published": "2022-06-23 05:15:38+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Heatwaves pushing up demand for air conditioning in UK", "description": "<p>Cooling could increase country’s power consumption by 15% during summer by end of century</p><p></p><p>It is a vicious cycle – as the climate grows hotter, <a href=\"https://www.iea.org/news/air-conditioning-use-emerges-as-one-of-the-key-drivers-of-global-electricity-demand-growth\">demand for air conditioning is booming</a> and that’s contributing to making the climate even hotter.<br /><br />Air conditioning accounts for about a fifth of the electricity used in buildings around the world. Much of that electricity comes from power stations that emit greenhouse gases and, to make matters worse, air conditioners can also leak <a href=\"https://www.gov.uk/guidance/fluorinated-gases-f-gases\">hydrofluorocarbon refrigerants</a>, greenhouse gases thousands of times more powerful than CO<sub>2</sub> over a 20-year period.<br /><br />As the UK endures longer and more intense heatwaves, air conditioning here is becoming increasingly popular. By the end of the century, air conditioning could increase the UK’s power <a href=\"https://www.gov.uk/government/publications/cooling-in-the-uk\">consumption by up to an estimated 15% during the summer</a>.<br /><br />A more efficient air conditioner <a href=\"https://www.cam.ac.uk/research/news/zero-carbon-refrigeration-spin-out-sets-its-sights-on-environmentally-friendly-heating-systems\">is being developed by Barocal, a spin-off company from Cambridge University</a>. This is a heat pump that does away with conventional refrigerants and uses solid materials to release or absorb heat at different pressures as they change volume. The materials are more efficient than liquid refrigerants, cheap and non-toxic, and the heat pumps can be used for either cooling or heating, helping solve two needs in one go.</p> <a href=\"https://www.theguardian.com/environment/2022/jun/23/heatwaves-pushing-up-demand-for-air-conditioning-in-uk\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/jun/23/heatwaves-pushing-up-demand-for-air-conditioning-in-uk", "date_published": "2022-06-23 05:00:40+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Why we are ready to strike: a panel of workers respond | Hannah David and others", "description": "<p>Pay freezes, cutbacks and redundancies on top of pandemic burnout and the cost of living crisis have left us with no choice</p><p>Since I started working more than 10 years ago, I’ve seen recruitment freezes, pay freezes, <a href=\"https://www.theguardian.com/politics/2022/jun/05/civil-service-cuts-will-leave-whitehall-unable-to-cope-with-brexit-workload\">cutbacks and redundancies</a>, but I’ve never seen a proper pay rise.</p><p>Hannah David works for Historic England and is a member of the PCS union</p> <a href=\"https://www.theguardian.com/commentisfree/2022/jun/23/ready-to-strike-public-sector-workers\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2022/jun/23/ready-to-strike-public-sector-workers", "date_published": "2022-06-23 05:00:40+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Brexit remains ‘open wound’ for EU citizens living in UK", "description": "<p>Survey of EU nationals shows ‘profound and lasting’ impact of Brexit on sense of identity</p><p>A study of EU citizens living in the UK has revealed the “open wound” left by Brexit, with respondents saying the decision to leave the bloc had left them feeling betrayed, insecure and distrustful towards the country that most nonetheless still call home.</p><p>The survey of EU nationals from 22 countries, who had mostly been in Britain for more than five years and stayed since Brexit, showed “a profound and lasting impact on the lives and sense of identity and belonging of EU citizens in the UK”, the authors said.</p> <a href=\"https://www.theguardian.com/politics/2022/jun/23/brexit-remains-open-wound-eu-citizens-living-uk\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2022/jun/23/brexit-remains-open-wound-eu-citizens-living-uk", "date_published": "2022-06-23 05:00:39+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Marseille, Alexandria and Istanbul prepare for Mediterranean tsunami", "description": "<p>Risk of significant tsunami within next 30 years is nearly 100%, Unesco says, as it urges coastal cities to become ‘tsunami-ready’</p><p>A tsunami could soon hit major cities on or near the Mediterranean Sea including Marseille, Alexandria and Istanbul, with a nearly 100% chance of a wave reaching more than a metre high in the next 30 years, according to Unesco.</p><p>The risk of a tsunami in Mediterranean coastal communities is predicted to soar as sea levels rise. While communities in the Pacific and Indian Ocean, where most tsunamis occur, were often aware of the dangers, it was underestimated in other coastal regions, including the Mediterranean, Unesco said.</p> <a href=\"https://www.theguardian.com/environment/2022/jun/23/marseille-alexandria-and-istanbul-prepare-for-mediterranean-tsunami\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2022/jun/23/marseille-alexandria-and-istanbul-prepare-for-mediterranean-tsunami", "date_published": "2022-06-23 05:00:39+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Royal Mail marks 50 years of UK Pride with colourful set of stamps", "description": "<p>March in London on 1 July 1972 was first with the name ‘Gay Pride’, inspired by events in US</p><p>On 1 July 1972 a crowd of people gathered in London’s Trafalgar Square and marched to Hyde Park chanting “Gay is fun! Gay is proud! Gay is beautiful!”.</p><p>It was not the first march for LGBTQ+ rights in the UK, as similar protests had taken place in Highbury Fields, Islington, in 1970 and Trafalgar Square in 1971. But it was the first rally in the UK with the name “Gay Pride”, inspired by Pride events in the US.</p> <a href=\"https://www.theguardian.com/world/2022/jun/23/royal-mail-marks-50-years-of-uk-pride-with-colourful-set-of-stamps\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/jun/23/royal-mail-marks-50-years-of-uk-pride-with-colourful-set-of-stamps", "date_published": "2022-06-23 05:00:39+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The King of Kowloon: my search for the cult graffiti prophet of Hong Kong", "description": "<p>For years Tsang Tsou-choi daubed his eccentric demands around Hong Kong, and the authorities raced to cover them up. But as the city’s protest movements bloomed, his words mysteriously reappeared</p><p>The secret message only appeared when the wall was drenched with rain. For weeks, I had been scouring Hong Kong for these misshapen Chinese characters, but the way they materialised out of nowhere was a shock. It was an unremarkable yellow-grey stone wall in the middle of Central, Hong Kong’s political and economic heart. The words were only revealed when the wall had been soaked; in this case after a downpour in July 2015, which left the wall darkened and damp. Suddenly it was possible to see spots where the dove-grey paint had flaked off, revealing traces of Chinese calligraphy. The writing, in clumsy, off-balance characters about 20cm high, was instantly recognisable for its lack of grace, elegance or learning.</p><p>I can’t remember the first time I saw characters like these. They were everywhere when I was growing up in Hong Kong in the 1970s and 80s, a feature of our city just as much as the bottle-green snub-nosed <a href=\"http://www.starferry.com.hk/tc/home\" title=\"\">Star Ferry</a> and the noisy trams. Their author was a fixture of the landscape as well: a filthy, toothless, often shirtless, rubbish collector with mental health issues. He called himself the King of Kowloon. Hopping on his crutches, with plastic bags swinging from the handles, his crablike, bow-legged silhouette was so distinctive that, if people saw him in the distance, they would cross the road to avoid him. As he passed, parents would shield their kids’ eyes from him and mutter, “<em>Chi-sin a</em>!” Crazy! He even became a playground taunt – “You’re the King of Kowloon!” – levelled at the slow kids, the weird ones, the poor ones, the outcasts.</p> <a href=\"https://www.theguardian.com/world/2022/jun/23/the-king-of-kowloon-my-search-for-the-cult-graffiti-prophet-of-hong-kong\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/jun/23/the-king-of-kowloon-my-search-for-the-cult-graffiti-prophet-of-hong-kong", "date_published": "2022-06-23 05:00:39+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Shock ending: how the Costa book awards changed reading – and pitted husband against wife", "description": "<p>After 50 years, the prize has been scrapped. How did it change Britain’s literary landscape? And what happened at the awards when Margaret Drabble was seated next to Theresa May?</p><p>Margaret Drabble was a bright young star with five novels to her name in 1971, when she was talked into joining her old friend JB Priestley on the judging panel for a new book prize. “Jack told me that I should spend the fee (which came in wine) by choosing some very nice half-bottles to drink by myself, which I did,” she recalls.</p><p>Drabble argued for a biography of the playwright Henrik Ibsen, Priestley was keen on a novel by Gerda Charles, and their fellow judge, the critic Anthony Thwaite, championed a poetry collection by Geoffrey Hill. The glory of the new, brewery-sponsored awards was that all three could have prizes, so it all went swimmingly, with none of the squabbles that had already begun to bedevil the Booker, launched two years earlier. These arguments had included one over the literary quality of a certain Margaret Drabble, who (<a href=\"https://www.theguardian.com/books/2008/sep/06/bookerprize.40years\">according to Booker judge</a> Dame Rebecca West) would insist on lowering the tone by writing about the washing-up.</p> <a href=\"https://www.theguardian.com/books/2022/jun/23/shock-ending-how-costa-book-awards-changed-reading\">Continue reading...</a>", "link": "https://www.theguardian.com/books/2022/jun/23/shock-ending-how-costa-book-awards-changed-reading", "date_published": "2022-06-23 05:00:38+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘He taught me about love, affection and great sex’: the untold story of Terrence Higgins", "description": "<p>Britain’s best-known HIV charity was launched 40 years ago, but little is known about the man who inspired it. The trust’s co-founders, a former partner and a close friend, reflect on his extraordinary life and legacy</p><p><br /></p><p>When Rupert Whitaker met Terry Higgins, he was 18 years old, callow and just starting out in life. Higgins was 37, streetwise and, although neither knew it at the time, approaching the end of his. They spent a blissful year together in which Whitaker learned so much. “He taught me that there was love and affection and safety and great sex and fun – that it <em>all</em> existed,” he says. “I was 19 and one month when Terry died.”</p><p>Today, Higgins continues to influence his life. Whitaker, a psychiatrist and immunologist, has dedicated himself to helping people who are HIV positive in the name of Higgins. He is one of two founders of the <a href=\"https://www.tht.org.uk/\">Terrence Higgins Trust</a> (THT), which celebrates its 40th anniversary this year. Not only has this kept his partner’s name alive, but it has also raised awareness of the virus, supported those who have it and, perhaps most importantly of all, helped destigmatise HIV.</p> <a href=\"https://www.theguardian.com/society/2022/jun/23/taught-me-love-affection-great-sex-untold-story-terrence-higgins\">Continue reading...</a>", "link": "https://www.theguardian.com/society/2022/jun/23/taught-me-love-affection-great-sex-untold-story-terrence-higgins", "date_published": "2022-06-23 05:00:38+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Rewilding with wolves: can they help rebuild ecosystems? | podcast", "description": "<p>After wolves were reintroduced to Yellowstone national park in 1995, researchers noticed some big ecological changes, leading to the regeneration of the landscape. It’s an argument used to justify the return of apex predators – but it’s increasingly being challenged. Phoebe Weston talks to Ian Sample about whether wolves really have the power to shape ecosystems, and what that means for the debate about bringing them back to the UK</p><p><em>Archive: Good Morning Britain</em></p> <a href=\"https://www.theguardian.com/science/audio/2022/jun/23/rewilding-with-wolves-can-they-help-rebuild-ecosystems-podcast\">Continue reading...</a>", "link": "https://www.theguardian.com/science/audio/2022/jun/23/rewilding-with-wolves-can-they-help-rebuild-ecosystems-podcast", "date_published": "2022-06-23 04:00:37+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Is Britain facing a summer of strikes? – podcast", "description": "<p>Transport correspondent Gwyn Topham reports on the rail strike negotiations, and economics columnist Aditya Chakrabortty analyses the political response from the Conservatives and Labour</p><p>This week, 40,000 rail workers joined the biggest nationwide rail strike in the UK for 30 years. On Thursday, the RMT union enters its second day of industrial action, which will see train services suspended across Britain. The union argues that rail workers, like many workers, are struggling to keep up with the spiralling cost of living.</p><p>At PMQs on Wednesday, Boris Johnson claimed it was not the government’s place to intervene in the negotiations between Network Rail, train operators and the union. He said it was “up to the railway companies to negotiate. That is their job.” But is it that simple? The Guardian and Observer’s transport correspondent, <strong>Gwyn Topham</strong>, tells <strong>Nosheen Iqbal</strong> how the dispute got this far, and what it would take for both sides to come to an agreement.</p> <a href=\"https://www.theguardian.com/news/audio/2022/jun/23/is-britain-facing-a-summer-of-strikes\">Continue reading...</a>", "link": "https://www.theguardian.com/news/audio/2022/jun/23/is-britain-facing-a-summer-of-strikes", "date_published": "2022-06-23 02:00:34+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Vienna reclaims title of the world’s most liveable city", "description": "<p>Annual rankings return Austria’s capital to first place, as former title-holder Auckland tumbles to 34th and Ukraine war sees eastern cities slump</p><p>The Austrian capital, Vienna, has made a comeback as the world’s most liveable city, according to an annual report from the Economist.</p><p>Vienna snatched the top spot from New Zealand city Auckland, which tumbled down to 34th place due to coronavirus pandemic restrictions, according to the report by the Economist intelligence unit published on Thursday.</p> <a href=\"https://www.theguardian.com/world/2022/jun/23/vienna-reclaims-title-of-the-worlds-most-liveable-city\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/jun/23/vienna-reclaims-title-of-the-worlds-most-liveable-city", "date_published": "2022-06-23 01:43:15+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Why is Australia so cold right now despite global heating? | Michael Grose for the Conversation", "description": "<p>Chilly weather can instinctively make us doubt the climate crisis. To understand how the planet is warming, we need to watch the long-term trends</p><p>It’s an offhand joke a lot of us make – it’s freezing, can we get a bit more of that global warming right about now?</p><p>But how should we really conceive our day-to-day weather in the context of climate change, especially when Australia’s east coast is enduring a <a href=\"https://theconversation.com/why-is-it-so-cold-right-now-and-how-long-will-it-last-a-climate-scientist-explains-184155\">colder-than-normal start to winter</a>? Here are four ways.</p> <a href=\"https://www.theguardian.com/australia-news/2022/jun/23/if-global-heating-is-a-thing-why-is-so-called-right-now-weather\">Continue reading...</a>", "link": "https://www.theguardian.com/australia-news/2022/jun/23/if-global-heating-is-a-thing-why-is-so-called-right-now-weather", "date_published": "2022-06-23 01:41:59+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "French MP sued for allegedly adopting aristocratic family’s name", "description": "<p>Emmanuel Taché de la Pagerie, a member of Marine Le Pen’s far-right party, faces legal action by descendants of the Tascher de la Pagerie family </p><p>A newly elected MP for Marine Le Pen’s resurgent far-right National Rally party has been sued by the descendants of one of France’s oldest aristocratic families who accuse him of adding their name to his own.</p><p>Emmanuel Taché de la Pagerie, 47, was one of dozens of National Rally MPs <a href=\"https://www.theguardian.com/world/2022/jun/20/french-elections-macron-le-pen-what-next\">voted into the National Assembly on Sunday</a>, with his official ID verified and approved by the local authorities in the southern city of Marseille.</p> <a href=\"https://www.theguardian.com/world/2022/jun/23/french-mp-sued-emmanuel-tache-de-la-pagerie-aristocratic-name\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/jun/23/french-mp-sued-emmanuel-tache-de-la-pagerie-aristocratic-name", "date_published": "2022-06-23 01:20:17+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Portly python: heaviest-ever snake captured in Florida tips scales at 215lbs", "description": "<p>Biologists used male ‘scout’ snakes to find the female Burmese which was nearly 18ft long and had 122 developing eggs</p><p>A team of biologists recently hauled in the heaviest Burmese python ever captured in Florida, officials said. The discovery was part of the state’s python removal program.</p><p>The female python weighed in at 215 pounds (98 kg), was nearly 18ft long (5 metres) and had 122 developing eggs, the Conservancy of Southwest Florida said in a news release.</p> <a href=\"https://www.theguardian.com/us-news/2022/jun/22/heaviest-ever-burmese-python-captured-florida\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2022/jun/22/heaviest-ever-burmese-python-captured-florida", "date_published": "2022-06-23 00:33:37+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "In the Philippines, a bun revives myths and misery of a bygone Marcos era", "description": "<p>Marcos supporters say nutribuns remain a symbol of family’s commitment to the poor, for others they stoke memories of severe hardship</p><p>It is not only the family of the late dictator Ferdinand Marcos Sr making a comeback in the Philippines. A fortified bread known as nutribun, and the controversy surrounding it, has also reappeared.</p><p>This month, a version of the snack – which was previously given to schoolchildren to tackle hunger during Marcos Sr’s regime – was spotted being distributed in Consolacion, Cebu, in the Central Visayas region. Packets bore the name of Senator Imee Marcos, daughter of the late dictator, <a href=\"https://interaksyon.philstar.com/trends-spotlights/2022/06/06/218970/spotted-nutribun-distributed-to-cebuanos-branded-with-imee-marcos-name/\">according to news reports</a>.</p> <a href=\"https://www.theguardian.com/world/2022/jun/23/in-the-philippines-a-bun-revives-myths-and-misery-of-a-bygone-marcos-era\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2022/jun/23/in-the-philippines-a-bun-revives-myths-and-misery-of-a-bygone-marcos-era", "date_published": "2022-06-23 00:00:32+00:00", "persistent": false, "user": null, "language": "en-UK"}]