[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCsXVk37bltHxD1rDPwtNM8Q", "title": "Is Civilization on the Brink of Collapse?", "description": "What We Owe The Future is available now — you can get it wherever you get your (audio)books or here:  https://www.amazon.com/What-Owe-Future-William-MacAskill/dp/1541618629\nThis video was sponsored by the author, Will MacAskill. Thanks a lot for the support.\n\nSources & further reading:\nhttps://sites.google.com/view/sources-civilization-collapse/\n\nAt its height, the Roman Empire was home to about 30 % of the world’s population, and in many ways the pinnacle of human advancement. Rome became the first city in history to reach one million inhabitants and was a center of technological, legal, and economic progress. An empire impossible to topple, stable and rich and powerful.\nUntil it wasn’t anymore. First slowly then suddenly, the most powerful civilization on earth collapsed. If this is how it has been over the ages, what about us today? Will we lose our industrial technology, and with that our greatest achievements, from one dollar pizza to smartphones or laser eye surgery? Will all this go away too?\n\n\nOUR CHANNELS\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nGerman:        https://kgs.link/youtubeDE\nSpanish:        https://kgs.link/youtubeES\nFrench:          https://kgs.link/youtubeFR\nPortuguese:  https://kgs.link/youtubePT\nArabic:           https://kgs.link/youtubeAR\nHindi:             https://kgs.link/youtubeHI\nJapanese:     https://kgs.link/youtubeJA\nKorean:          https://kgs.link/youtubeKO\n\n\nHOW CAN YOU SUPPORT US?\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThis is how we make our living and it would be a pleasure if you support us!\n\nGet Products designed with ❤ https://kgs.link/shop-165  \nJoin the Patreon Bird Army 🐧  https://kgs.link/patreon  \n\n\nDISCUSSIONS & SOCIAL MEDIA\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nTikTok:           https://kgs.link/tiktok\nReddit:            https://kgs.link/reddit\nInstagram:     https://kgs.link/instagram\nTwitter:           https://kgs.link/twitter\nFacebook:      https://kgs.link/facebook\nDiscord:          https://kgs.link/discord\nNewsletter:    https://kgs.link/newsletter\n\n\nOUR VOICE\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThe Kurzgesagt voice is from \nSteve Taylor:  https://kgs.link/youtube-voice\n\n\nOUR MUSIC ♬♪\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\n700+ minutes of Kurzgesagt Soundtracks by Epic Mountain:\n\nSpotify:            https://kgs.link/music-spotify\nSoundcloud:   https://kgs.link/music-soundcloud\nBandcamp:     https://kgs.link/music-bandcamp\nYoutube:          https://kgs.link/music-youtube\nFacebook:       https://kgs.link/music-facebook\n\nThe Soundtrack of this video:\nSoundcloud: https://bit.ly/3JZJqMu\nBandcamp: https://bit.ly/3zYselJ\n\nIf you want to help us caption this video, please send subtitles to subtitle@kurzgesagt.org\nYou can find info on what subtitle files work on YouTube here:\nhttps://support.google.com/youtube/answer/2734698?hl=en-GB&amp;ref_topic=7296214\nThank you!\n\n🐦🐧🐤 PATREON BIRD ARMY 🐤🐧🐦\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nMany Thanks to our wonderful Patreons (from http://kgs.link/patreon) who support us every month and made this video possible:\nLauritz David Jr, sploop146, Jun Mr., Bill L., IamTooth, Osvaldo Laurido, 예은 정, Jacob Charles Carino, Mathew Kleppin, Vivaan Gupta Reddy Vaka, Sujasha Gupta Vaka, PhD., Peter Kvalsvik, Amrith Prasad Vengalath, Connor Foster, Kurtis Odom, Liam Cartwright, 宗次 佐山, Adv3ntur0us, 갈치 금, David Baum, Dodge Ostrander, Mokking, Óscar Díaz, Kyle Vondra, Alexis-Walid Ahmed, Logan Schultz, Leonardo Shinagawa, Soupy, Cormac, Norman, mastermate, Cyrus, Justin Rosenberg, Psychosadistic, Cezar Munteanu, naliquinra, MikhailTalsQueen, Ben Mann, Alfredo, Sacha de Rosner, May, SISCANU MIHAIL, April Harris, TERRIKA R COAKLEYMCCOY, Carl Stone, JC, Katrina Yaggi, Thom Henri, Adam Everitt, Scott McNay, Republic, Adam Teger, Olivier L'Italien, Ben Zimmerman, KebDoe, Jakub Adamów, TMan87, Saidi, Matthew Chassot, Josh Weaver, Larry Cohen, André Simões, Matias Espinozas, setiawan, Loki, Garret Autry, Ducky, Widdy, Foxe", "link": "https://www.youtube.com/watch?v=W93XyXHI8Nw", "date_published": "2022-08-16 13:59:34+00:00", "persistent": false, "user": null, "language": "en-US"}]