[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "20+ things you never knew GNOME could do!", "description": "Download Safing's Portmaster, or subscribe to the SPN, and take control of your network traffic: https://safing.io/portmaster \nGrab a brand new laptop or desktop running Linux:https://www.tuxedocomputers.com/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to a weekly podcast, vote on the next topics I cover:\n\nYouTube: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n📹 MORE VIDEOS FROM ME\nLinux news in Shorts format: https://www.youtube.com/channel/UCtZp0mK9IBrpS2-jNzMZmoA\nGaming on Linux: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nI'm also on ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n🏆 FOLLOW ME ELSEWHERE:\nTwitter : http://twitter.com/thelinuxEXP\nMastodon: https://mastodon.social/web/@thelinuxEXP\nPixelfed: https://pixelfed.social/TLENick\nDiscord: https://discord.gg/xK7ukavWmQ\n\nThis video is distributed under the CC Share Alike license.\n\n#gnome #linux #desktop \n\n00:00 Intro\n01:00 Sponsor: Secure and monitor your internet connection\n01:54 Extensions and GNOME Tweaks\n04:35 Advanced Power Options\n06:08 Making the File manager a LOT more powerful\n06:19 Hidden Files, and typing in the pathbar\n06:59 Change the default compressed folder format\n07:28 Get some file templates to create new documents faster\n08:16 Manipulate images from the right click menu\n08:50 Get Nextcloud or OwnCloud options in the right click menu\n09:20 Access your recent folders from your Nautilus tab\n09:31 Use custom folder icons\n09:59 Get quick file previews by pressing spacebar\n10:38 Various cool tips and tweaks for GNOME\n10:45 Change how much you increase or decrease the volume by\n11:19 Restore \"classic\" scrollbars that are always visible\n11:44 Use a solid color or a gradient as a wallpaper\n12:37 Get larger resize handles for your windows\n13:03 Get a permanent \"Log out\" option in the menu\n13:36 Useful Keyboard Shortcuts\n13:41 Alt+F2 to run quick commands\n13:55 ' + Tab to switch between windows of the same app\n14:13 Take screenshots or screen recordings faster\n14:49 Quickly Shut down your computer\n14:57 Open the apps grid and set up your workspaces super fast\n15:19 Open the Notifications panel and use it with the keyboard\n15:31 Add a Show Desktop shortcut\n15:52 Easily resize windows from anywhere\n16:51 Sponsor: Get a laptop or desktop that runs Linux perfectly\n18:06 Support the channel\n\nAdvanced power settings: org - GNOME - settings-daemon - Plugins - power in dconf-editor.\n\nNautilus\n\nControl + H: displays hidden files and folders\nControl + L: lets you type in the path bar\n\nORG, GNOME, NAUTILUS, PREFERENCES, check \"always use location entry\" to make that permanent.\n\nYou can also decide to change the format to compress files: ORG, GNOME, NAUTILUS, COMPRESSION.\n\nIn your /home folder, you have a Templates folder. Everything you put in there will show up in a right click, new Document menu.\n\nInstall from the package nautilus-image-converter, and then completely quit nautilus by typing nautilus-q in a terminal, to get right click options to resize or rotate images.\n\nIf you use nextcloud, install the nextcloud-client-nautilus package, restart Nautilus.\n\nIf you need to quickly access your recent locations, right click the back or forward button.\n\nIf you want to change a specific folder's icon, right click the folder, hit properties, click on the folder's icon, and fetch the image you want to use.\n\nYou can also install gnome-sushi to get a \"press spacebar to preview file\" utility, like macOS quicklook\n\nIf you want to adjust your volume by smaller, or bigger steps, head over to ORG GNOME SETTINGS DAEMON PLUGINS MEDIA KEYS, you can find an option named \"volume-step\".\n\nTo disable overlay scrollbars, head over to ORG GNOME DESKTOP INTERFACE and disable overlay-scrolling.\n\nIf you don't like having an image as your wallpaper, and prefer a color or a gradient, you can go to ORG GNOME DESKTOP BACKGROUND, and set picture-uri to none\n\nThen in the same folder, in primary-color, enter the hexadecimal value for your color.\n\nAnd if you want a gradient, also set the secondary color to the one you want, and enable the color shading type horizontal or vertical option.\n\nYou can expand the resizeable handle size, by going to ORG GNOME MUTTER, and changing the draggable border width value.\n\nYou can have the option to logout always visible by going to ORG GNOME SHELL, and turning on always-show-log-out\n\nAlt + F2: pressing this allows you to run a quick command.\n\nAlt + the key immediately above tab: switch between windows of the same app\n\nALT + printscreen:  capture the current focused window\n\nSHIFT + printscreen captures the whole screen.\n\nControl + alt + shift + r: open this interface in video recording mode.\n\nControl + Alt + delete: open the power off dialog\n\nSuper x2 : open the apps grid\n\nSuper +ToM: open the notifications panel\n\nSuper + middle mouse button: resize a window", "link": "https://www.youtube.com/watch?v=dLsj8plxBn0", "date_published": "2022-08-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]