[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Warzone 2 Release Date May Have Leaked | GameSpot News", "description": "Warzone 2 and World of Warcraft: Dragonflight Release dates may have leaked. Plus, a new Call of Duty skin is accused of copying art from Dr Disrespect’s Deadrop. \n#GamingNews #CallofDuty #Warzone2 \n\nThe since deleted image appeared to show internal documentation related to readiness for various upcoming Activision Blizzard launches, such as the recently announced release date of the pre-patch for WoW: Wrath of the Lich King Classic. If the image is indeed legitimate, WoW players can expect to have their hands on the game's next expansion, Dragonflight, on November 28, with the game's pre-patch arriving roughly a month earlier, on October 25. Meanwhile, Call of Duty: Warzone 2 could be launching November 16, several weeks after the release of Call of Duty: Modern Warfare II. In addition to Warzone 2, the document lists a release of October 27 for something called \"COD Cortez,\" which may be the heavily rumored (and seemingly confirmed) DMZ mode for the upcoming shooter.\n\nIn other Call of Duty news, Activision has announced a new preorder bonus for Call of Duty: Modern Warfare II, and it's a first-of-its-kind offer for the franchise. Everyone who digitally preorders Modern Warfare II will get access to the game's campaign mode \"up to\" a week early, starting on October 20. The game releases officially on October 28. Preordering Modern Warfare II also gets you early access to the multiplayer beta, which begins September 16 on PlayStation before coming to Xbox and PC later.\n\nActivision has released the new \"Doomsayer\" operator skin in Call of Duty: Warzone and Vanguard, but players are already pointing out major similarities with artwork from Dr Disrespect's upcoming Deadrop game.\n\nSTAMPS\n00:00 - Intro\n00:05 - Warzone 2\n01:22 - Modern Warfare 2\n01:51 - Call of Duty & Deadrop", "link": "https://www.youtube.com/watch?v=yV7N2hO6-8o", "date_published": "2022-08-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Modern Warfare II Campaign Early Access Official Teaser Trailer", "description": "Take a sneak peek at the Call of Duty: Modern Warfare 2 campaign in this latest teaser trailer.\n\nCall of Duty: Modern Warfare releases October 28, 2022, but if you pre-order you can get access to the campaign early.\n\n#modernwarfare2 #callofduty #gaming", "link": "https://www.youtube.com/watch?v=rY1x0BHMsSA", "date_published": "2022-08-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Everything To Know About Fortnite x Dragon Ball Super | GameSpot News", "description": "In this episode of GameSpot News, we’re giving you all the information you need about Fortnite x Dragon Ball and revealing what you can expect from the next Game Pass drop.\n#GamingNews #Fortnite #DragonBallSuper\n\nthe Fortnite Dragon Ball Super collaboration is officially underway. Goku, Vegeta, Beerus, and Bulma skins have been added to the game, with all but Beerus sporting alternate styles. Alongside the Fortnite Dragon Ball crossover skins, multiple in-game events will also be featured, including the Dragon Ball Power Unleashed Quests that offer special rewards, extra battle pass levels, and a Shenron glider to those who complete quests and collect the Dragon Balls.\n\nFortnite x Dragon Ball Challenges: https://www.gamespot.com/articles/fortnite-dragon-ball-challenges-all-quests-rewards-and-guides/1100-6506517/\n\nOn Game Pass, Eight games in total are headed to the service before the month is out, unless Xbox wants to surprise us with some additional games as August progresses. Out today is the coffee brewing game/conversation Coffee Talk, in which players brew coffee and then talk to people about their issues. The game is available across console, PC, and the cloud. On August 23, Midnight Fight Express comes to Game Pass as a day-one new release. This is a \"brutal and hyper-kinetic brawling ballet\" game that will be available for console, PC, and cloud. Other games include: Exapunks, Opus Echo of Starsong, Immortality, Immortals Fenyx Rising, and Tinykin. \n\nSTAMPS\n00:00 - Intro\n00:08 - Fortnite x Dragon Ball Super\n02:03 - Game Pass", "link": "https://www.youtube.com/watch?v=EZCrDyEptjQ", "date_published": "2022-08-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite x Dragon Ball Official Gameplay Trailer", "description": "Get a glimpse of Dragon Ball Super making its way to Fortnite! We see various new gameplay that includes Goku, Vegeta, Bulma, and Beerus. You'll get to see various locations that mirror the hit anime, as well as emotes that represent iconic moves and moments like the Fusion Dance and the Kamehameha. \n\n#Fortnite #Dragonball #DBZ #gaming", "link": "https://www.youtube.com/watch?v=RvSOwgkLCzE", "date_published": "2022-08-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite x Dragon Ball Official Reveal Trailer", "description": "Goku, Vegeta, Beerus and Bulma join the fray in the latest Fortnite crossover with Dragon Ball Super. Check out this latest announcement trailer celebrating the crossover and also checkout the latest gameplay trailer showcasing Goku, Vegeta, Bulma, and Beerus in action. The Dragon Ball x Fortnite crossover starts on 8/16/22!\n\n#Fortnite #Dragonball #DBZ #gaming", "link": "https://www.youtube.com/watch?v=UE0qnf_lB28", "date_published": "2022-08-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Rollerdrome Review", "description": "Developer Roll7 excellently mixes high-scoring skating gameplay with shooter ideas to make a hybrid game that's tough to put down. Here's GameSpot's review.\n\nRollerdrome is similar to Roll7's other titles in that it's a single-player skating game that emphasizes performing tricks, but this isn't just an OlliOlli game with guns. Rollerdrome eschews the side-scrolling nature of Roll7's famous platformer series for fully 3D skate park-like arenas; as you skate through a single area, you must utilize walls and ramps to loop yourself around and to perform tricks.\n\nThough it makes departures from the skating games that Roll7 is known for, Rollerdrome nails what's most important about them: it's an easy game to play that makes you feel awesome while you're playing it.", "link": "https://www.youtube.com/watch?v=siMJklKuyPQ", "date_published": "2022-08-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Thymesia Review", "description": "Thymesia creates a Souls-like experience that iterates on what's most important about FromSoftware's beloved titles Bloodborne and Sekiro: Shadows Die Twice.\n\n#Gaming #GameSpot #Thymesia", "link": "https://www.youtube.com/watch?v=ihGDFIDmP9o", "date_published": "2022-08-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]