[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War Ragnarök Official Release Date Cinematic Trailer", "description": "God of War Ragnarök launches on 11.09.2022. \n\nJoin Kratos and Atreus on a mythic journey for answers before the prophesied battle that will end the world. All the while, the eyes of Asgard watch their every move.\n\n#godofwar #gaming", "link": "https://www.youtube.com/watch?v=3m4SYEHwV6w", "date_published": "2022-07-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War: Ragnarok Release Date & Preorder Info Revealed | GameSpot News", "description": "God of War: Ragnarok and Forspoken get new release dates, The Matrix Awakens is being delisted, Destiny Mobile may be on the way and The Division Mobile gets a new trailer.\n#GamingNews #GodofWarRagnarok #ps5 \n\nIt's official! God of War: Ragnarok has a release date! This continuation of the best father/son story in gaming will hit shelves on November 9 for PS5 and PS4. Four editions will be available at launch, and preorders will start on July 15 at 7 AM PT / 10 AM ET. If you preorder any edition of Ragnarok, you'll receive two in-game cosmetics: Kratos Risen Snow Armor and Atreus Risen Snow Tunic. These are \"Launch Edition\" bonuses, so the code will be in the box or added to your PlayStation account upon purchasing a digital version.\n\nForspoken, the action RPG from Square Enix, has been pushed from October to January 24, 2023. In a statement the company said \"all game elements\" are completed, and the remaining development time will be used for \"final polishing.\" Forspoken was originally revealed as Project Athia before getting its final title. The game follows protagonist Frey Holland (played by Ella Balinska from Charlie's Angels), a contemporary New Yorker with a cat named Homer, who gets transported to the magical world of Athia.\n\nBungie, the developer behind Destiny, and Chinese tech company NetEase are reportedly working on a new first-person shooter mobile game. As reported by The Gaming Post, a LinkedIn profile of one of the NetEase Games artists indicates that the company is helping Bungie create \"an unannounced FPS mobile game.\" Neither Bungie nor NetEase have announced any plans for a new mobile game, but a source with knowledge of the development plans told the publication that the team is currently working on a new Destiny game.\n\n\nSTAMPS\n00:00 - Intro\n00:08 - God of War Ragnarok\n00:57 - Forspoken\n02:13 - Destiny\n02:58 - The Division Mobile", "link": "https://www.youtube.com/watch?v=GF4icNhcKgg", "date_published": "2022-07-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Nintendo Switch OLED Model - Splatoon 3 Edition", "description": "Check out a brand new Splatoon 3 Nintendo Switch OLED Model. \n\nSomething fresh is surfacing! The Nintendo Switch – OLED Model Splatoon 3 Edition splashes down on 8/26!\n\nComplete the look with the Splatoon 3 Nintendo Switch Pro Controller and Nintendo Switch Splatoon 3 Edition Carrying Case, both arriving on 9/9!\n\n#nintendo #switch #splatoon", "link": "https://www.youtube.com/watch?v=1tfwNSuiJ9E", "date_published": "2022-07-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "VALKYRIE ELYSIUM Official Gameplay and Release Date Trailer", "description": "Get a glimpse of some brand new gameplay for Valkyrie Elysium an upcoming action role playing game from Square Enix. The game will release on September 29, 2022 on PlayStation 4 and PlayStation 5. Valkyrie Elysium makes it way to PC on Steam on November 11, 2022.\n\n#ValkyrieElysium #gaming", "link": "https://www.youtube.com/watch?v=IFdPDnjvvpQ", "date_published": "2022-07-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "GTA 6 & GTA Trilogy Changed Rockstar's Remaster Plans | GameSpot News", "description": "Rockstar is focusing on GTA 6, GTA 4 and Red Dead Redemption remasters are put on hold, news Call of Duty images leaks and Microsoft confirms Xbox 360 games are leaving Games with Gold. \n#GamingNews #GTA6 #CallofDuty \n\nRockstar insider Tez2 recently claimed on Twitter that it is unlikely that Rockstar Games is moving forward with potential GTA 4 and Red Dead Redemption remasters. A report from Kotaku corroborates that neither of these remasters are moving ahead for now, and that all remakes have been \"shelved\" as the studio focuses on Grand Theft Auto 6. In a tweet replying to another user on Twitter, Tez2 also clarified that the remasters weren't in full production, more just something that was planned, with Rockstar \"looking at the Trilogy to greenlight more remasters.\"\n\nNew Call of Duty images have surfaced online. The images seem to be a mix of screens from this year’s Modern Warfare 2 and an unannounced game from Treyarch, the developers of Black Ops. These leaked pics are the result of data mining from a recent Warzone Mobile update and fans have already started to speculate. One of the images that seems to be catching the most attention is the one labeled “Stealth”. This is because it contains a F-117 Nighthawk, a stealth aircraft that became synonymous with the Gulf War. \n\nBeginning in October, Games with Gold will no longer offer Xbox 360 games to download. Word of the change first surfaced in an email sent out to Dutch Xbox Live Gold subscribers (via Wario64). Xbox One games, however, will still be available each month. Xbox 360 Games with Gold titles will still be available for a redownload regardless of membership, as in the past. The program was originally introduced in 2013 for Xbox 360 consoles, and extended to Xbox One consoles in 2014 as a bonus for Xbox Live Gold subscribers.\n\nSTAMPS\n00:00 - Intro\n00:08 - GTA 6\n01:53 - Call of Duty\n02:58 - Xbox Games with Gold", "link": "https://www.youtube.com/watch?v=k_X9ratNENE", "date_published": "2022-07-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]