[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Marvel's Spider-Man - PS5 vs PC Max Settings Comparison", "description": "See how the recent PC port of Marvel's Spider-Man compares visually to the PlayStation 5 version.\n\nFor this comparison, we ran Marvel’s Spider-Man Remastered on PS5 in 4K fidelity mode, which offers the highest resolution and ray traced reflections at 30fps.\n\nThe PC version was set to 4K resolution max settings, including the highest level of ray tracing, using a machine with the following specs: RTX 3080 Ti, Intel i9-9900K CPU @ 3.60GHz, 1TB NVME SDD. Features like DLSS and upscaling were turned off for this comparison.  PC was locked to 30fps for a stable frame rate. \n\nMarvel’s Spider-Man Remastered is coming to PC on August 12, 2022. The port includes ultrawide support, an unlocked frame rate, improved shadows, ray-traced reflections at varying quality levels, Nvidia Deep Learning Super Sampling (DLSS), Nvidia Deep Learning Anti-Aliasing (DLAA) and more. The game also supports the DualSense controllers as well as mouse and keyboard setups. Cloud saves and achievements are supported on both the Epic Games Store and Steam.\n\nMarvel’s Spider-Man: Miles Morales will also come to PC sometime in Fall 2022. \n\nMarvel's Spider-Man originally launched on PlayStation 4 in September 2018. The remastered version came packaged with the ultimate edition of Marvel's Spider-Man: Miles Morales, which launched with the PlayStation 5 on November 12, 2020. Marvel's Spider-Man 2 was announced during the PlayStation showcase in September 2021, featuring Peter Parker and Miles Morales teaming up to fight crime. A PC version of the sequel as yet to be confirmed.\n\n#gaming #spiderman #pc", "link": "https://www.youtube.com/watch?v=BArs97rlY5o", "date_published": "2022-08-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sony Reportedly Paying To Keep Games Off Game Pass | GameSpot News", "description": "Microsoft claims Sony is paying devs to not put their games on Game Pass, Tower of Fantasy has a wild launch, and Dragon Ball Z is coming to Fortnite.\n#Gaming #PS5 #Fortnite #DragonBallZ \n\nMicrosoft fires back at Sony, Tower of Fantasy struggles to launch, and a long awaited Fortnite crossover has been teased! All this on today’s GameSpot News.\n\nAccording to documents filed with Brazil’s national competition regulator, Microsoft has claimed that Sony has paid \"blocking rights\" to developers to prevent their games from being added to Xbox Game Pass. As part of the regulator's review of Microsoft's proposed acquisition of Activision Blizzard, the company alleged that Sony had \"hampered\" the growth of its Game Pass subscription service with its business practices.\n\nMicrosoft's response comes shortly after Sony made its own claim about its users jumping ship to Xbox if Microsoft's deal to purchase Activision Blizzard, and by extension, the Call of Duty franchise, is completed. Microsoft has disputed that claim, and had also previously indicated that it would continue supporting Call of Duty on PlayStation \"beyond the existing agreement\" and into the future.\n\nAnother day, another Genshin Impact-esque game launches. Tower of Fantasy, a new gacha MMORPG, ran into a few launch issues when its servers went live in specific regions last night. But worry not, because developer Hotta Studios has announced that the problems have been fixed or will be within 48 hours--and players are entitled to some freebies.\n\nTo make up for the inconveniences caused by registration failures and login errors, Hotta is giving out a total of 600 Dark Crystals to all players who have registered by 5 PM PT/8 PM ET today, August 11. Dark Crystals can be used for a variety of things, but can notably be converted into four Red Nucleus to be used in Tower of Fantasy's premium gacha banner.\n\nHotta Studios also announced it would be giving away more freebies to celebrate Tower of Fantasy reaching the \"top free game charts\" in 22 countries prior to the game's global launch. All players who register prior to August 17 will receive 10 Gold Nucleus, which are used for gacha pulls for the game's standard banner. The Gold Nucleus reward will be mailed to players within the next 24 hours and will need to be claimed within 14 days. Once the items are in a player's inventory, they don't expire.\n\nTower of Fantasy, which is free-to-play, seems to be off to a solid start. Login queues on many servers were long at launch, and the game as of writing has more than 133,000 viewers on Twitch. Though the game is comparable to Genshin Impact--with familiar combat, gacha systems, user interface, and a similar art style--Tower of Fantasy's sci-fi setting, custom character-creator, focus on multiplayer (including PvP), and the addition of vehicles help it to stand out from MiHoYo's popular gacha game.\n\nTower of Fantasy is available now on PC, iOS, and Android devices and allows for cross-platform multiplayer. For now, those interested in playing on PC can download Tower of Fantasy through the official website, but the title is slated to come to Steam and the Epic Games Store later this year.\n\nTIMECODES: \n00:12 - Microsoft vs Sony legal disputes\n01:03 - Tower of Fantasy Launch\n02:54 - Dragon Ball Z x Fortnite", "link": "https://www.youtube.com/watch?v=5sH1IjGRHqw", "date_published": "2022-08-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cult of the Lamb Review", "description": "Cult of the Lamb is a delightfully demented rogue-like that combines fast-paced dungeoneering, bold art, dark topics, and real-time simulation elements to create a one-of-a-kind \n#gaming #gamespot #DevolverDigital #IndieGame", "link": "https://www.youtube.com/watch?v=VFF0iQJAAdA", "date_published": "2022-08-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Marvel's Spider-Man PC Ultrawide Mouse & Keyboard Gameplay", "description": "See Marvel's Spider-Man in action on PC, running at ultrawide resolution using mouse and keyboard controls.\n\nMarvel’s Spider-Man Remastered is now available on PC and with it comes support for ultrawide 21:9 displays. This aspect ratio looks great while swinging around New York City fighting crime, as well as during the game’s numerous cinematic cutscenes. However Spider-Man Remastered ultrawide support isn’t without its faults. For example, menu screens such as the map or the skill tree do not support 21:9 displays. We also ran into a visual bug with the waveform UI during calls in the game. Other supported ratios include panoramic 32:9 and Nvidia Surround multi-monitor setups.\n\nThis gameplay was captured using mouse and keyboard controls. This method of playing is serviceable, but does not feel as natural as playing with a controller such as the DualSense, which is supported as well.  \n\nThe PC port of Spider-Man also includes an unlocked frame rate, improved shadows, ray-traced reflections at varying quality levels, Nvidia Deep Learning Super Sampling, Nvidia Deep Learning Anti-Aliasing and more. \n\nMarvel’s Spider-Man Remastered is coming to PC on August 12, 2022. Marvel’s Spider-Man: Miles Morales will also come to PC sometime in Fall 2022. \n\nMarvel's Spider-Man originally launched on PlayStation 4 in September 2018. The remastered version came packaged with the ultimate edition of Marvel's Spider-Man: Miles Morales, which launched with the PlayStation 5 on November 12, 2020.\n\n#gaming #marvelsspiderman #ultrawide", "link": "https://www.youtube.com/watch?v=Zq9Pjg2kQcU", "date_published": "2022-08-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PlayStation Plus Adds More Titles To Its Game Catalog | GameSpot News", "description": "A bunch of games coming to PlayStation Plus, Platoon 3 Direct info, and the DioField Chronicles beta.\n#Gaming #PlayStationPlus #PS5 \n\nMore games coming to PlayStation Plus, Splatoon 3 Direct news, and go hands on with Square Enix’s latest JRPG, DioField Chronicles, early. All this on today’s GameSpot news, coming to you from inside Spider-Man 2018 (I’m in the office and gonna see about recording on the roof. Will cut this gag if that location isn’t feasible.)\n\nSony has revealed the next batch of free games for PlayStation Plus Extra and Premium subscribers. The August 2022 PS Plus Game Catalog lineup includes not one but three Yakuza games, a recent remake in the Mana series, the latest Ghost Recon, and more, coming to the service on August 16.\n\nTo start, you can live your Japanese crime family fantasies with Yakuza 0, Yakuza Kiwami, and Yakuza Kiwami 2. Those mark the start of Yakuza offerings on PS Plus with others set to come later this year. Extra and Premium members can also get the 1v4 multiplayer game Dead by Daylight, as well as Tom Clancy's Ghost Recon Wildlands and the extremely wacky adventure game Bugsnax.\n\nRounding out the new additions will be Metro Exodus, Trials of Mana, Uno, Monopoly Madness, and Monopoly Plus.\n\nThese are the premium extras for the higher tiers, separate from the PlayStation Plus Essentials games lineup. Extra and Premium members can grab those games too, which this month include Tony Hawk, Yakuza: Like a Dragon, and Little Nightmares.\n\nIf you subscribed to PlayStation Plus Extra or Premium, make sure to check out our list of the best PS4 and PS5 games in the library to download and play here on GameSpot’s YouTube.\n\nSplatoon 3 just had its Direct spotlight, revealing a ton of new info about the game. Familiar and newbie NPCs, including Splatoon 3’s new host. Frye, Shiver, and Big Man the stingray.\n\nCan’t wait for the internet to just be awash with erotic Big Man fan art.\n\nTIMECODES: \n00:16 - PlayStation Plus titles\n01:27 - Platoon 3 Nintendo Direct info\n02:52 - DioField Chronicles beta", "link": "https://www.youtube.com/watch?v=l8YsSzn-dKs", "date_published": "2022-08-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Splatoon 3 Direct (August 8, 2022)", "description": "Watch this Splatoon 3 Direct presentation and join us in the Splatlands for roughly 30 minutes of updates!\n\nLearn more about the various stages you'll get to play on, as well as a new weapon type, new special weapons, a brand new card game, photo mode, Salmon Run, Splatfest's return, and more in this latest Splatoon 3 direct.\n\n#splatoon3 #gaming #nintendo \n\nTimestamps\n0:00 Splatoon 3 Intro\n2:39 Splatoon 3 Stages\n4:12 Splatoon 3 Weapons\n6:52 Splatoon 3 Weapon Shop\n7:50 Splatoon 3 Gear\n10:22 Splatoon 3 Lobby\n14:27 Splatoon 3 Customization\n15:40 Splatoon 3 New Card Game\n16:52 Splatoon 3 Salmon Run\n19:28 Splatoon 3 Story Mode\n22:30 Splatoon 3 Amiibo\n24:15 Splatoon 3 New NPCs\n27:25 Splatfest Returns", "link": "https://www.youtube.com/watch?v=UkfWnSlhPWw", "date_published": "2022-08-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]