[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCmGSJVG3mCRXVOP4yZrU1Dw", "title": "The Origins of European Imperialism", "description": "How Europe Dominated the Planet\nGo to our sponsor https://betterhelp.com/JohnnyHarris for 10% off your first month of therapy with BetterHelp and get matched with a therapist who will listen and help.\nEp 2 and 3: https://youtube.com/playlist?list=PLphcdvnT8lOsBuRylBTXnr2fhIfHjz-z7\nCorrection: 01:07 I characterize Europe as a “continent full of poor miserable farmers” and later go on to compare it to the “thriving” empires elsewhere. While it is indeed true that Europe in the 1400s was full of famine, plague, war, and general suffering, it’s inaccurate to say that Europeans were much worse off than people living in any other parts of the world. Especially if you look to Southern Europe where an explosion of art, science, and trade was taking place at this time. The accurate point would be to say that Europe had been relatively cut off from the world since the Ottoman Empire blocked them from historical trade routes. Europe was not deeply connected to global trade, which was mostly happening in the Indian Ocean regions at that time.\n\nCorrection: 04:50 see the correction from 01:07\n\nCorrection: 05:43 As noted earlier, Europeans had trade connections with the east. During this time they were cut off by the Ottoman Empire for the reasons I explain in the video\n\nCorrection: 07:21 While Portugal had gone out trading and exploring Western Africa first, I present it as if Portugal had made it to Asia before Spain decided to start exploring. This isn’t right. Columbus’ journey west (1492) happened a few years before Portugal’s first voyage that reached India (lead by Vasco da Gama in 1497).\n\nCorrection: 08:55 This little dramatization mischaracterizes what happened here. As many have pointed it out it feels like I’m asserting that Columbus “invented” imperialism in this moment. And indeed the way this is presented implies that. Columbus did NOT invent the idea of taking over land. In fact, a part of his contract with the royals was that he would take over any land he could while on this journey. The important point here is that Columbus set out to get in on trade in the east, but that the “discovery” of the America’s turned those efforts away from looking for new trade routes, to a full blown imperial project in the Americas. That’s the point I was trying ot make, but missed the mark in this overly dramatized moment.\n\nCorrection: 16:02 In addition “their weapons” and “their city germs” It would have been more accurate to mention a major tool for the conquerors which was the exploitation of local politics and alliances. The conquest of these huge swaths of land required Europeans to ally with and rely on local expertise and man power to colonize these territories. \n\n\nThe Library of Congress has a wonderful map collection which I used to get high res versions of a lot of these old maps. Thank you Library of Congress!\n\n- ways to support - \nMy Patreon: https://www.patreon.com/johnnyharris\nOur custom Presets & LUTs: https://store.dftba.com/products/johnny-iz-luts-and-presets\n\n- where to find me -\nInstagram: https://www.instagram.com/johnny.harris/\nTiktok: https://www.tiktok.com/@johnny.harris\nFacebook: https://www.facebook.com/JohnnyHarrisVox\nIz's (my wife’s) channel: https://www.youtube.com/iz-harris\n\n- how i make my videos -\nTom Fox makes my music, work with him here: https://tfbeats.com/\nI make maps using this AE Plugin: https://aescripts.com/geolayers/?aff=77\nAll the gear I use: https://www.izharris.com/gear-guide\n \n- my courses - \nLearn a language: https://brighttrip.com/course/language/\nVisual storytelling: https://www.brighttrip.com/courses/visual-storytelling\n\n- about -\nJohnny Harris is a filmmaker and journalist. He currently is based in Washington, DC, reporting on interesting trends and stories domestically and around the globe. Johnny's visual style blends motion graphics with cinematic videography to create content that explains complex issues in relatable ways. He holds a BA in international relations from Brigham Young University and an MA in international peace and conflict resolution from American University.\n\n- press - \nNYTimes: https://www.nytimes.com/2021/11/09/opinion/democrats-blue-states-legislation.html\nNYTimes: https://www.nytimes.com/video/opinion/100000007358968/covid-pandemic-us-response.html\nVox Borders: https://www.youtube.com/watch?v=hLrFyjGZ9NU\nFinding Founders: https://findingfounders.co/episodes/johnny-harris-2esj3-c3pet-2pg4c-xbtwa-5gaaa\nNPR Planet Money: https://www.npr.org/transcripts/1072164745", "link": "https://www.youtube.com/watch?v=vLpSeMlfZ60", "date_published": "2022-08-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]