[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCG_nvdTLdijiAAuPKxtvBjA", "title": "Ninja Turtles — How to Fail at Launching a Franchise | Anatomy Of A Failure", "description": "Get started with Brilliant for free at https://brilliant.org/FILMENTO -- the first 200 people also get 20% off the annual premium subscription.\n\n2014's Teenage Mutant Ninja Turtles was an effort from Paramount and Michael Bay to recapture the financial success of the Transformers franchise. Unfortunately it didn't exactly go as planned. The movie was pretty bad and forgettable to the point where the better sequel flopped at the box office badly and thus the franchise was buried before it even fully began. In today's Anatomy of a Failure, lets look at TMNT to see the pitfalls of starting a new blockbuster franchise.\n\nFilmento en Español:\nhttps://youtu.be/Hd718nQbjt4\n\nSupport:     https://patreon.com/filmento\nFollow:        https://twitter.com/filmento\n\n#teenagemutantninjaturtles   #anatomyofafailure   #tmnt \n\nMusic:\n\n\n\n\n-\nTeenage Mutant Ninja Turtles (2014)\nParamount Pictures and Michael Bay present this reboot of the Teenage Mutant Ninja Turtles franchise with Wrath of the Titans' helmer Jonathan Liebesman directing. The sinister Shredder has seized control of New York City's police and politicians, leaving his ruthless Foot Clan to spread chaos in the streets. With no prospects for salvation in sight, mutant crime-fighters Raphael, Leonardo , Donatello, and Michaelangelo leap into action. They put up a fierce fight, too, though in order to truly defeat Shredder, the heroes in honest trailer teenage mutant ninja turtles cinemasins everything wrong with teenage mutant ninja turtles bad movie ninja turtles 3 mistakes movie mistakes teenage mutant ninja turtles tmnt only action action scenes teenage mutant ninja turtles watch full movie free online 4k clip hd half shell will need the help of box office flops biggest courageous reporter April O'Neil (Megan Fox) and her quick witted cameraman Vern Fenwick (Will Arnett) as well. With their help, Shredder's plan will quickly unravel, and this once-great city will rise again.", "link": "https://www.youtube.com/watch?v=mDPvBt1Pc80", "date_published": "2022-08-10 16:00:26+00:00", "persistent": false, "user": null, "language": "en-US"}]