[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "SFJAZZ Collective: Tiny Desk (Home) Concert", "description": "Suraya Mohamed | August 10, 2022\nHow exciting to see so many all-star jazz greats performing together. The SFJAZZ Collective is a talented cohort of artists who perform arrangements of works by modern composers and also newly commissioned pieces by each member of the band.\n\nIn 2020, the Collective was scheduled to perform an in-person Tiny Desk concert, but it was canceled due to the pandemic. We are still working to make that happen — but in the meantime, let’s enjoy this uplifting Tiny Desk (home) concert, recorded in The Joe Henderson Lab at SFJAZZ, a large, sunny venue that serves as both a live performance space and as the Collective’s rehearsal space.\n \nEarlier this year, the ensemble released New Works Reflecting the Moment (Live from the SFJAZZ Center 2021), an album addressing racial injustices, the ongoing pandemic and political polarization. In this concert, the musicians perform three songs from that project. “Ay Bendito” was written by tenor saxophonist David Sánchez, and its title is slang for “oh my God'' or “aw man”; it’s also subtitled “The Struggle Continues.”\n \nWritten to reflect the present moment, especially the isolation and social upheaval many of us continue to endure, “Mutuality” by tenor saxophonist Chris Potter was inspired by a Dr. Martin Luther King Jr. quote that reads, “Injustice anywhere is a threat to justice everywhere. We are caught in an inescapable network of mutuality, tied in a single garment of destiny. Whatever affects one directly affects all indirectly.” \n \nVocalist Gretchen Parlato’s “All There Inside '' was written with fellow SFJAZZ Collective vocalist Martin Luther McCoy in mind. Their voices fit together beautifully, and both the warm harmonies and the charming melody are the perfect foundation for Parlato’s inspiring message of hope and positive change: “Because it’s all there inside, all there inside of you.”\n \nSET LIST\n“Ay Bendito”\n“Mutuality”\n“All There Inside”\n\nMUSICIANS\nChris Potter: music director, tenor saxophone, winds\nDavid Sánchez: tenor saxophone\nEtienne Charles: trumpet\nWarren Wolf: vibraphone\nEdward Simon: piano\nMatt Brewer: bass\nKendrick Scott: drums\nGretchen Parlato: vocals\nMartin Luther McCoy: vocals\n\nCREDITS\nVideo: Robert Bambey, Diego Munguia\nAudio: Jeff Cressman, Josh Badura\n\nTINY DESK TEAM\nProducer: Suraya Mohamed\nVideo Editor: Joshua Bryant\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Michael Zamora, Maia Stern, Ashley Pointer\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#TinyDesk #NPRMusic #SFJAZZCollective", "link": "https://www.youtube.com/watch?v=0VvdSqp69Lc", "date_published": "2022-08-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "DOMi & JD BECK: Tiny Desk Concert", "description": "Bobby Carter | August 10, 2022\nIf you've heard a DOMi & JD BECK song or watched a performance online, expectations of catching brilliance when you witness the jazz duo in person are likely high. JD's drumsticks move faster than the brain can process. DOMi offers every appendage on her body to the keys. It's frantic but focused, and I can't stop watching. For as tight as the two artists are musically — and even physically; one of their few Tiny Desk requests was for the drums and keys to be set up as close as possible — they take silly self-deprecating jabs when they aren't playing. It's believable until they transform and the music starts.\n\nThe two musicians come from two completely different parts of the world. James Beck began cutting his teeth as young as eleven at jam sessions in Dallas. DOMi, aka DOMi Louna, was born in France and raised on jazz, and enrolled at the Conservatoire Régional du Grand Nancy at five. DOMi eventually made her way to the States via a Presidential Scholarship from the Berklee College of Music. The two met at a trade show in 2018 and have been inseparable since, playing sets on YouTube and driving the internet nuts. Before they knew it, they were rubbing elbows with the upper echelon in jazz, R&B, and hip-hop.\n\nThe duo's debut album, ironically titled NOT TiGHT, is a graduation of sorts with all of their OGs lending a hand — notably Anderson .Paak, who took DOMi and JD BECK under his wing and made the duo the first signee to his APES*** label. The two brought highlights from that album to the Tiny Desk, including the vines, turf and vibrant floral arrangements from the album cover. Before \"U DON'T HAVE TO ROB ME,\" a true story turned comedy, they make another attempt at neutralizing the room. DOMi says, \"We're gonna ruin it!\" It's too late for all of that. We're already amazed.\n\nSET LIST\n\"NOT TiGHT\"\n\"SMiLE\"\n\"U DON'T HAVE TO ROB ME\"\n\"WHATUP\"\n\nMUSICIANS\nDOMi: keys, vocals\nJD BECK: drums, vocals\n\nTINY DESK TEAM\nProducer: Bobby Carter \nAudio Engineer: Josh Rogosin, Jhair \"Jha\" Lazo \nDirector: Kara Frame \nCreative Director: Bob Boilen \nEditor: Joshua Bryant \nVideographers: Kara Frame, Pierre Kattar, Joshua Bryant\nArt Direction: Winston Studios, Carlos Lopez, Iman Jordan\nAudio Assistant: Josephine Nyounai \nProduction Assistants: Jill Britton, Joby Tanseco\nTiny Desk Team: Suraya Mohamed, Marissa Lorusso, Hazel Cills, Ashley Pointer, Maia Stern\nVP, Visuals and Music: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#TinyDesk #NPRMusic #DOMiandJDBECK", "link": "https://www.youtube.com/watch?v=ANPbOxaRIO0", "date_published": "2022-08-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]